[
    {
        "content": "<p>Pharmacy WG made a change in the build (leading up to R4) that merged MedicationStatement.taken into MedicationStatement.status (not-taken) as a result of alignment with workflow patterns.  As a result, MedicationStatement can no longer be used to get the “active medication list” for those medications that are not-taken.  For example, the patient who tells her primary care physician “I’m not taking those prenatal vitamins that the OB prescribed”.  The PCP could note that the patient isn’t taking the medication but would likely want to keep that medication on the “active meds list” for clinical decision support since the patient should be taking it.</p>\n<p>A few WGMs ago, we collectively worked the following table in <a href=\"http://hl7.org/fhir/STU3/medicationstatement.html#11.4.3.3\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/medicationstatement.html#11.4.3.3\">http://hl7.org/fhir/STU3/medicationstatement.html#11.4.3.3</a>, which started with “The MedicationStatement resource includes both a status and a taken code. The taken code conveys whether the medication was taken by the patient from the perspective of the information source. The status code reflects the current state of the practitioner’s instructions to the patient whether the consumption of the medication should continue or not.”  Unfortunately, this has all been removed in build (R4).</p>\n<p>In New Orleans, Pharmacy resolved <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15105\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15105\">GF#15105</a> saying that we were going to ask Workflow for an exemption on the pattern, so MedicationStatement could revert back having taken and status as separate elements.</p>\n<p>In some offline conversations held with Lloyd (representing Workflow) and Pharmacy co-chairs, it has been noted that MedicationStatement shouldn’t be used to convey practitioner’s instructions.  Instead, Lloyd’s recommendation is to use MedicationRequest.  In the past (DSTU2), the resource was named MedicationOrder, so it didn’t appear it could represent recorded/historical/OTC statements of medication use because it wasn’t an authorization to dispense.  By contrast, in STU3, the argument is that MedicationRequest is more broadly scoped, such that the MedicationRequest.intent can differentiate between an “order” (i.e. authorization for action) versus “plan” (i.e. intention to ensure something happens without providing an authorization to act).</p>\n<p>There are at least 3 options on the table for consideration:<br>\n1) Continue to ask for an exemption from the workflow pattern and revert back to taken and status as separate elements.<br>\n2) US Core switches to MedicationRequest to convey “active meds list” since scope has been expanded, so we can now include OTC meds and/or meds from other providers as MedicationRequest with intent = plan.<br>\n3) US Core embraces List to convey “active meds list” because MedicationStatement.status doesn’t work anymore when status is not-taken.</p>\n<p>The Pharmacy Work Group is seeking input from implementers to assist in their discussions and in the final decision on how to proceed.  Thank you.</p>",
        "id": 153946275,
        "sender_full_name": "Melva Peters",
        "timestamp": 1521493430
    },
    {
        "content": "<p>The relationship between MedicationRequest and MedicationStatement is challenging us. Personally, I think it's reasonable to capture the working instructions on a medication statement. That would usually be the practitioners instructions. That's not the same as disgreeing with Lloyd. I think the use case is very important.</p>",
        "id": 153946310,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521508714
    },
    {
        "content": "<p>The question is whether it's appropriate to have both \"this is what was ordered\" and \"this is what's actually happening\" in the same resource.  (And it's possible there could even be multiple conflicting sets of clinician directives simultaneously in force, so there'd be a challenge round which instructions to expose - and the question of whether you want to track who gave those instructions, when, etc.)</p>",
        "id": 153946314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521509278
    },
    {
        "content": "<p>I was going for 'this is what's actually happening' .</p>",
        "id": 153946317,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521509333
    },
    {
        "content": "<p>Agree it should reflect what's actually happening - and in many cases that will align with what was ordered, but not always.  And I don't think we can overload the resource by trying to convey both.</p>",
        "id": 153946318,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521509446
    },
    {
        "content": "<p>I think that 'should continue' is distinctly not 'what was ordered' - perhaps we understand the use case differently?</p>",
        "id": 153946320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521509500
    },
    {
        "content": "<p>\"not taking\" is what's happening.  \"Should continue\" is what was ordered.</p>",
        "id": 153946324,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521509696
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> so Lloyd and I do disagree... is 'should continue' something decided on request, or something that might be updated later?</p>",
        "id": 153946326,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521509757
    },
    {
        "content": "<p>typically the should continue is decided at the point when a medication history is taken or when medication reconciliation is done.  The patient may say I was prescribed drug A, but I'm not taking it and the prescriber may say the patient should be taking drug A.  There isn't really a need for a new MedicationRequest since the patient likely still has it at home.  I'll leave it up to <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> to weigh in here on how they are using MedStatement to come up with the list of active medications.</p>",
        "id": 153946346,
        "sender_full_name": "Melva Peters",
        "timestamp": 1521511672
    },
    {
        "content": "<p>2 cents<br>\nThe status should not be overloaded with some codes about the order and other codes about use. I think that status should be about the use of the medication. If you want to say in MedicationStatement that the medicine is not being taken, but it is still prescribed, I suggest putting \"not taking\" in MedicationStatement.status and creating a new data element for the \"Prescription being ignored\" information.</p>",
        "id": 153946355,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1521514917
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> this seems related to some brief discussion about \"statement of a request\", if you recall that. <br>\n1 (eur) cent: I think that medStatement was conceived to be a statement of use. So it is not easy to put there \"statement of request\" nor \"statement of dispense\".</p>",
        "id": 153946369,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1521528855
    },
    {
        "content": "<p>I think Melva's use case makes sense: patient has been prescribed elsewhere, and physician says \"don't stop that medication\".  Another use case I have is: patient mentions he has been prescribed and dispensed some medication but asserts he is not taking it for whatever reason.</p>",
        "id": 153946371,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1521529182
    },
    {
        "content": "<p>In both cases I think we'd be best by considering a \"statement\" of prescription, then a \"statement\" of dispense.</p>",
        "id": 153946372,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1521529319
    },
    {
        "content": "<p>In an emergence, and perhaps other, treatment setting I expect they would want to know what you have and an indication of what you say you are taking since the reaction you are now having may be due to the fact that you just started taking something you have.</p>",
        "id": 153946373,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1521529465
    },
    {
        "content": "<p>To address this: <strong>Could we extend our \"xxxStatement\" resources to contain and refer to another resource like request\"</strong>?<br>\nso we can have a MedStatement (or device or biologicallyDerivedProduct or whateverStatement) also saying \"this is a statement that a request is active\".</p>",
        "id": 153946374,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1521529505
    },
    {
        "content": "<p>Wouldn't the Request itself say the request is active?</p>",
        "id": 153946375,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1521530230
    },
    {
        "content": "<p>yes, but we are talking about the case where there is no need to create a request.</p>",
        "id": 153946376,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1521530257
    },
    {
        "content": "<p>Ah. Ok then.</p>",
        "id": 153946377,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1521530300
    },
    {
        "content": "<p>e.g. patient goes for surgery and there is an active prescription, but the physician must take the info that patient was prescribed that drug, but does not need to create a prescription for that purpose.</p>",
        "id": 153946378,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1521530348
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  commented</p>\n<blockquote>\n<p>typically the should continue is decided at the point when a medication history is taken or when medication reconciliation is done. The patient may say I was prescribed drug A, but I'm not taking it and the prescriber may say the patient should be taking drug A. There isn't really a need for a new MedicationRequest since the patient likely still has it at home. I'll leave it up to @Michelle (Moseman) Miller to weigh in here on how they are using MedStatement to come up with the list of active medications.</p>\n</blockquote>\n<p>Generally speaking, I agree.</p>\n<p>To elaborate, we persist all of the following on the same table:</p>\n<ul>\n<li>Orders (an authorization to dispense) </li>\n<li>Over the counter medications (no authorization needed) </li>\n<li>\"Statement of a request\" as <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> called it (patient reports an authorization to dispense from another provider - meaning our system doesn't have the official prescription, but we want to capture the existance of that existing prescription without creating a new/duplicate authorization to dispense; we refer to these as recorded or historical orders) </li>\n</ul>\n<p>We have the ability to capture 2 statuses in our system.  </p>\n<ul>\n<li>the \"order's\" status (\"order\" = orders + OTC + recorded/historical/statements about orders), which is more about whether the patient should be taking the medication or not.  The status is determined by the provider (often during meds reconciliation)</li>\n<li>the taken status noting there can be multiple taken statuses (on different dates) for a single \"order\".  The taken status is based on patient/related person feedback.  We can not capture a taken status without the parent \"order\" being documented (even if it is just a recorded/historical order and not a formal authorization to dispense)</li>\n</ul>",
        "id": 153946442,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1521550329
    },
    {
        "content": "<p>Does the inability to record \"taken\" without an order hold for over-the-counter meds?  Also, the many to 1 nature of taken to order seems to argue for separate records</p>",
        "id": 153946528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521557773
    },
    {
        "content": "<p>Yes, same for OTC.</p>",
        "id": 153946588,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1521561257
    }
]