[
    {
        "content": "<p>I am from payer organization and we are planning to develop a solution to send patient medication history to hospital EHR system using FHIR DSTU2. We are in the process of development and realize that we got data only for Medication description , Dosage and not the medication codes( like NDC or RxNorm).</p>\n<p>Are we able to build complaint solution without codes? As part of validation FHIR Specification will confirm to just medication description without a code?  I see \"MedicationStatment.Medication\" as codeable concept and it's 1..1</p>\n<p>Can someone please provide a recommendation on what to do since we do not want to build something that is non complaint?</p>\n<p><a href=\"https://www.hl7.org/fhir/DSTU2/medicationstatement-definitions.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/DSTU2/medicationstatement-definitions.html\">https://www.hl7.org/fhir/DSTU2/medicationstatement-definitions.html</a></p>",
        "id": 154013358,
        "sender_full_name": "Bhanu Vemuri",
        "timestamp": 1540842037
    },
    {
        "content": "<p>You can use a CodeableConcept with only its <code>text</code> element populated with the medication description - that is perfectly legal</p>",
        "id": 154013361,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1540842327
    },
    {
        "content": "<p>Having said that, not having a medication code would limit what the receiving system could do with that information</p>",
        "id": 154013362,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1540842412
    },
    {
        "content": "<p>I'm surprised that as a payer you do not have a specific product code.  Typically, payment is based on the specific product.</p>\n<p>As <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> pointed out, while you can send just the text name that will be of minimal use for the EHR.  Aside from displaying the text to the user, without a code the EHR would have difficulty performing medication reconciliation/adherence reporting and probably would not be able to use the information for interaction checking.</p>",
        "id": 154013383,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1540844914
    },
    {
        "content": "<p>Thank you for the quick reply. We do have codes but not in the tables from which we can consume quickly without additional ETL work. So, trying to understand, can we start with text and enhance it later to include codes if FHIR response can confirm to be complaint during validation.</p>",
        "id": 154013396,
        "sender_full_name": "Bhanu Vemuri",
        "timestamp": 1540846624
    },
    {
        "content": "<p>You can also put your codes in there too. Then if mappings are created, they can be applied later too.<br>\nOr could create mappings other side for the most common ones, better than nothing.</p>",
        "id": 154013566,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1540888016
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197261\">@Bhanu Vemuri</span>  Your step-wise approach (text now, add codes later) should work (should be compliant)</p>",
        "id": 154013687,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1540916416
    }
]