[
    {
        "content": "<p>How MedicationStatement.status, .assertedDate and .effective interact is unclear to me.</p>\n<p>I think the .status field is supposed to express whatever the status is on the dateAsserted? Is that true?<br>\nI believe .effectivePeriod is only used to represent a period that medication IS taken, so can never be used to define a period that medication is NOT taken, is that true?</p>\n<p>Suppose I want to say today (December 4, 2019) that I will temporarily stop (status on-hold?) using the medication from december 11 - 19, so I intend to resume taking medication on December 20? How can I do that?</p>\n<p>What I can think of is using two instances of MedicationStatement:<br>\nMedicationStatement<br>\n.status = \"active\"<br>\n.effectivePeriod.end = December 11, 2019<br>\n.dateAsserted = December 4, 2019</p>\n<p>And then a second MedicationStatement<br>\n.status = \"active\"<br>\n.effectivePeriod.start = December 20, 2019<br>\n.dateAsserted = December 4, 2019</p>\n<p>The concept of \"on-hold\" is then never noted?</p>\n<p>How is it supposed to work in STU3? Does the .taken field interact with .effective (can you state: not taken with start date of not taking X ?)</p>\n<p>Is there a way of doing this using one instance of MedicationStatement?</p>",
        "id": 182557989,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1575468353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 182561835,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575470989
    },
    {
        "content": "<p>I don't think we've thought completely about the interaction of the status and the two dates, but it is really intended to be the status over the effectivePeriod.  </p>\n<p>To express your use case, you would have three statements.  You can't do this in one since we don't have a set of statuses and effectiveDates.<br>\n#1: status = active, effectivePeriod = n/a / Dec 11, assertedDate = Dec 4<br>\n#2: status = on-hold, effectivePeriod = Dec 11 / Dec 19, assertedDate = Dec 4<br>\n#3: status = intended, effectiveperiod = Dec 20 / n/a, assertedDate = Dec 4</p>\n<p>In STU3, the .taken field does interact with .effective and with .status, which is why we removed it because it became difficult to reconcile if those didn't all agree.  I would have .taken = y for #1 and #3 and .taken = n for #2.</p>",
        "id": 182573805,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1575477935
    },
    {
        "content": "<p>Thank you for your response.</p>\n<p>Okay when I read <a href=\"http://hl7.org/fhir//medicationstatement-definitions.html#MedicationStatement.status\" target=\"_blank\" title=\"http://hl7.org/fhir//medicationstatement-definitions.html#MedicationStatement.status\">the text on status</a> I was confused by this:</p>\n<blockquote>\n<p>The status is only representative at the point when it was asserted.</p>\n</blockquote>\n<p>I am not sure what that means in combination with .effective. For example, applying this to your #2 example above:<br>\n the status 'on-hold' \"is only representative at the point when it was asserted\" (December 4)</p>\n<p>However the status is really about December 11-19 (even though it was asserted on December 4). I understand that on December 5, I may state something new overruling this old statement, but the text in itself is confusing since it does not mention the .effective at all.</p>\n<p>I  also noticed <a href=\"http://hl7.org/fhir//medicationstatement-definitions.html#MedicationStatement.effective_x_\" target=\"_blank\" title=\"http://hl7.org/fhir//medicationstatement-definitions.html#MedicationStatement.effective_x_\">the text on effective</a>, which seems to relate to the now removed .taken field. That may need some updating!</p>\n<blockquote>\n<p>(or was not taking, when the MedicationStatement.taken element is No)</p>\n</blockquote>\n<p>I am also confused by the following piece of text:</p>\n<blockquote>\n<p>If the medication is still being taken at the time the statement is recorded, the \"end\" date will be omitted.</p>\n</blockquote>\n<p>The medication may still be taken on the assertedDate (December 4) AND an end date may be known (December 11), as per your example #1 above. </p>\n<p>Just to confirm, if I want to express that I am <em>not</em> taking medication during a certain period (let's say November 1 to December 31), this is done by:<br>\nMedicationStatement<br>\n.status = stopped<br>\n.effective = November 1 / December 31<br>\n.assertedDate = December 4</p>",
        "id": 182576367,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1575479349
    },
    {
        "content": "<p>Basically, the combination of effective and status is valid at the date that the statement was asserted and may have changed.  So you said that you were going to take the medication from now until Dec 11th and then put it on-hold from 11th to 19th and then retake it from the 20th on.  All of that is true on December 4th, but may not be true on December 6th.</p>\n<p>Yes, we need to revise the text on effective because we may know when we intend to stop taking the medication.  I thought we had revised it already, but can you raise an issue in any case?</p>\n<p>For not taking, in R4, you should use the status of not-taken.</p>",
        "id": 182581354,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1575482407
    },
    {
        "content": "<blockquote>\n<p>For not taking, in R4, you should use the status of not-taken.</p>\n</blockquote>\n<p>I don't think I agree, because when  \"not-taken\" is true I may want to state whether this is definitive (stopped) or temporary (on-hold). <br>\nOnly when I don't know the difference between stopped and on-hold,  the \"not-taken\" may be useful to register. In other words when the status is 'stopped' or 'on-hold' this implicitly means the medication is 'not-taken', at least in the .effectivePeriod (if stated).</p>\n<p>Just to confirm again:<br>\nWhen .status is one  of 'not-taken', 'stopped' or 'on-hold' this effectively means the meaning of .effective changes to the period of 'not taking medication', any other status the meaning of .effective is the period of taking medication. </p>\n<p>The difference .status  'completed', 'active' and 'intended' is really only determined by the relation between assertedDate en effectivePeriod. However, I do understand it is still useful to ALSO have these status, since effectivePeriod may not be populated?</p>\n<p>However, with .status 'entered-in-error' and 'unknown' you are clueless as to what the period means....</p>\n<p>I think a set of examples explaining this mechanism would be really helpful.</p>",
        "id": 182641474,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1575537930
    },
    {
        "content": "<blockquote>\n<p>Yes, we need to revise the text on effective because we may know when we intend to stop taking the medication.  I thought we had revised it already, but can you raise an issue in any case?</p>\n</blockquote>\n<p>I looked at the <a href=\"http://build.fhir.org/medicationusage-definitions.html#MedicationUsage.effective_x_\" target=\"_blank\" title=\"http://build.fhir.org/medicationusage-definitions.html#MedicationUsage.effective_x_\">current build</a> and indeed the text on .effective has been improved</p>\n<p>However, the </p>\n<blockquote>\n<p>(or was not taking, when the MedicationUsage.status element is NotTaken)</p>\n</blockquote>\n<p>seems incomplete? Because that is also true when status element is 'stopped' or 'on-hold'? </p>\n<p>Would it be more consistent to spell 'NotTaken' as 'not-taken'?</p>",
        "id": 182642460,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1575538856
    },
    {
        "content": "<p>Yes, we need to re-look at our statuses and make sure that they make sense.  You have pointed out some inconsistencies and some spots were we need better documentation/examples.</p>",
        "id": 182670261,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1575559902
    },
    {
        "content": "<p>There was a lot of consternation about moving that not-taken into a status. This is one of the reasons why (eg: not being able to say \"I'm currently not taking it but it's still active/I plan on doing it in the future\"</p>",
        "id": 182777008,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1575649426
    }
]