[
    {
        "content": "<p>Is there a way to represent a medication's \"therapeutic class\", e.g. \"Cardiovascular\", \"Analgesics\", \"Antibacterials\", etc.   If not, is this something that should be balloted for R4 or is this better handled by the Pharmacy working group?</p>\n<p>For an examples see the US \"USP Therapeutic Model Guidelines\" and the  AHFS \"Pharmacologic Therapeutic Classification\" here:</p>\n<p><a href=\"http://www.usp.org/health-quality-safety/usp-medicare-model-guidelines\" target=\"_blank\" title=\"http://www.usp.org/health-quality-safety/usp-medicare-model-guidelines\">http://www.usp.org/health-quality-safety/usp-medicare-model-guidelines</a><br>\n<a href=\"http://www.ahfsdruginformation.com/ahfs-pharmacologic-therapeutic-classification/\" target=\"_blank\" title=\"http://www.ahfsdruginformation.com/ahfs-pharmacologic-therapeutic-classification/\">http://www.ahfsdruginformation.com/ahfs-pharmacologic-therapeutic-classification/</a></p>",
        "id": 153929187,
        "sender_full_name": "John Silva",
        "timestamp": 1516185041
    },
    {
        "content": "<p>This has / is being discussed. Currently we are looking at product definitions, and there are two approaches: <br>\nEntryDefinition is a definitional wrapper that can be used on Medications, and has a \"classification\" attribute.<br>\nThere are some open discussions around a \"healthProduct\" definitional resource, and a \"medicationKnowledge\".<br>\nAlso, BRR has a set of new resources where this could fit, but I can't find classification there. Only medicinalproductpharmaceutical.characteristics.</p>",
        "id": 153929193,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516186080
    },
    {
        "content": "<p>I assume that the \"classification\" can be also context-specific - i.e. one provider may have a classification, other provider a different classification. There are global or national classifications as you mention.</p>",
        "id": 153929194,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516186160
    },
    {
        "content": "<p>but directly answering your question, yes, there should be a solution, and entryDefinition.classification was made exactly to address this purpose. We may alter that, but that is afaik the attribute tat covers that.</p>",
        "id": 153929195,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516186208
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  thanks for the response.   Are \"healthProduct\" and \"medicationKnowlege\" proposed (new) properties on the Medication resource?  (What is BRR?)</p>",
        "id": 153929200,
        "sender_full_name": "John Silva",
        "timestamp": 1516187702
    },
    {
        "content": "<p>HealthProduct is a discussion ogoing, to make life easier for implementers, esp when having to choose whether  a product is a device or a medicine - the standard should not be too prescriptive there.<br>\nmedicationKnowledge i think is also an ongoing discussion. They are independent resources.</p>",
        "id": 153929208,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516188500
    },
    {
        "content": "<p>BRR is the working group that defines regulatory and research stuff, and since medications are regulated products, they hve implemetned a few concepts as proposals.</p>",
        "id": 153929209,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516188545
    },
    {
        "content": "<p>since we now have quite many \"product\" resources where the boundaries are not always clear in practice - and the certainty that there will always be more products, someone mentioned whether these could be reunited under a pattern or resource. HealthProduct would be that.</p>",
        "id": 153929210,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516188673
    },
    {
        "content": "<p>additional insight: entryDefinition may be merged onto healthProduct when healthProduct becomes real thing.</p>",
        "id": 153929211,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516188734
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> Pharmacy is considering a new medication related resource that we have tentatively called \"MedicationKnowledge\" where information such a therapeutic categories/classifications, and other types of knowledge could be included.  If you have other requirements, it would be great if you could join the Pharmacy WG in New Orleans or on a teleconference with your requirements or create a tracker item.</p>",
        "id": 153929235,
        "sender_full_name": "Melva Peters",
        "timestamp": 1516201376
    },
    {
        "content": "<p>In Ontario, we use STU3 for our Medications project. To convey therapeutic class and subclass (along with the Health Canada DIN - drug identification number), we use repetitions of Medication.code.coding.</p>",
        "id": 153929250,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1516204229
    },
    {
        "content": "<p>To be more precise, we had sliced the Medication.code.coding into several slices, each with its own terminology binding.</p>",
        "id": 153929251,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1516204302
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span> that is a choice, although classification is technically not a code - same product can have many classifications, there are surely many products with the same classification. And there are limitations to that (we've discussed a few here, such as when you have Aspirin and give it the code for Aspirin and also the code for ASA - you are describing Aspirin, not ASA. Aspirin can have a medication.manufacturer, but ASA does not have a manufacturer) <br>\nThis approach you have is sufficient for prescriptions but not for definition of the product.</p>",
        "id": 153929252,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516204530
    },
    {
        "content": "<p>in short: the slicing works in practice. your mileage may vary. For different purposes, requirements will differ.</p>",
        "id": 153929253,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516204574
    },
    {
        "content": "<p>BTW, the fact that we have different approaches to provide classifications. Implementers may dictate requirements but also rely on the norm as guidance (at least I did).</p>",
        "id": 153929254,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516204733
    },
    {
        "content": "<p>I agree. This is a workaround until there is a better permanent solution. But this was a pragrmatic approach recommended by the Pharmacy group that had allowed us to meet our business requirement and  to go into production last year.</p>",
        "id": 153929256,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1516205122
    },
    {
        "content": "<p>Many products with the same classification doesn't mean it's not a code - it's just less granular.  Multiple applicable classifications is more of an issue as all coding repetitions are expected to be encoding the same concept, not describing different aspects of it.</p>",
        "id": 153929260,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516206046
    },
    {
        "content": "<p>One of the things MedicationKnowledge will need to figure out is what the boundaries are (and what the overlap is) around what appears on Medication vs. MedicationKnowledge.</p>",
        "id": 153929261,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516206084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<blockquote>\n<p>all coding repetitions are expected to be encoding the same concept, not describing different aspects of it.</p>\n</blockquote>\n<p>Yep, and that is where using classification codes as produt codes will have issues. And classifications may be context-bound, which is another challenge.</p>",
        "id": 153929269,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516207394
    },
    {
        "content": "<p>at least this discussion seems to confirm the issue / requirement. I'd leave the \"which resources\" for when we have a solution that works, or several.</p>",
        "id": 153929271,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516207613
    },
    {
        "content": "<p>Why isn't a straightforward element like <code>category</code> 0..* CodeableConcept being considered? Then you can apply any classification system , like therapeutic class, you want.</p>",
        "id": 153929277,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516209438
    },
    {
        "content": "<p>The question was (i think) which element to use. Category or Classification could work, but the resource medication does not have it. and we ahve to make sure of the impact.</p>",
        "id": 153929285,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516210459
    },
    {
        "content": "<p>the discussion on codes and classifications is about that impact - in short, you should not use a code to say \"this aspirin has also the code for ASA, so it contains ASA\"</p>",
        "id": 153929287,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516210501
    },
    {
        "content": "<blockquote>\n<p>The question was (i think) which element to use. Category or Classification could work, but the resource medication does not have it. and we ahve to make sure of the impact.</p>\n</blockquote>\n<p>...Then create a category extension for your use case</p>",
        "id": 153929294,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516211157
    },
    {
        "content": "<p>correct, <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> - but this is input for changes that are planned in the resources, anyway, hence diving into it.<br>\nFor implementations today, an extension would be best indeed.</p>",
        "id": 153929295,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516211226
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  I'm really confused reading this by what you have in mind as \"a classification.\" I'm going to assume you really mean \"a category\" to whit, you mean a grouper where multiple other drug concepts in this case are considered \"in the group.\" Usually that means \"is-a\" but in this case it might also mean \"is contained in\" (such as Aspirin-containing medication.) Whatever the \"grouper/class\" is, would be a terminology concept from a code system (essentially like those you listed above) and they would be represented by a code from the code system. So you'd use FHIR datatype coding to capture it when you want to include it with a medication. Keep in mind that doing so is in essence an point in time view of a grouper (class) for that medication. Am I following what you are asking for?</p>",
        "id": 153929366,
        "sender_full_name": "Robert McClure",
        "timestamp": 1516229854
    },
    {
        "content": "<p>I'm glad this topic has generated some discussion.   My intent (or need) is to have a mechanism to describe the taxonomy of drugs, as the USP and AHSF groups do.   An Aspirin is a type of analgesic; I suppose it could also be considered a 'neural agent' (not knowing about the multi-axial nature of drug classifications).    My basic question was about what to use in the Medication resource since I didn't see any (obvious) way to do this.  Jose's mention of using EntryDefinition I suppose would be very useful because it could be used to represent the same drug in multiple classifications (places in the taxonomy).   For simplicity's sake it would be simpler for my use case to have a category property on Medication.  (I'm not sure I understand why the additional complications are needed but of course there are probably many other use cases out there beside the simpler example I have.)</p>",
        "id": 153929377,
        "sender_full_name": "John Silva",
        "timestamp": 1516241681
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> Yes, if you use medication resource to define the medicine, you could have a medication.classification (i.e. \"i'm declaring that aspirin is an analgesic, an antiplatelet...\")</p>",
        "id": 153929384,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516252607
    },
    {
        "content": "<p>if you use medication to specify what you are ordering/delivering, you can also use medication.classification, but it have different values (i.e. \"i am prescribing aspirin, and I am stating it is an analgesic, so please substitute accordingly if you need to - meaning, don't substitute for an antiplatelet because i am only referring to the analgesic class\").<br>\nI hope this differentiation between \"defining a product\" and \"specifying a product\" is useful - it is not obvious and it is a thought aid, but has helped me a lot since I learned it.</p>",
        "id": 153929386,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516252935
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> for classification, i mean e.g. ATC. I know it is coded, so it works as you say. I am guessing your doubt stems from the discussions \"why not use a coded element\"- which is fine and agreed, but what was being discussed was where what that coded element. <br>\nmedication.code does not make a good place for it.</p>",
        "id": 153929389,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516253150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> and <span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> If you are discussing this to propose that FHIR resources be the way medication knowledge about drugs - not an instance of a patient taking a drug - is represented, then I'd participate in <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> \"MedicationKnowledge\" work (although one wonders why FHIR? in this situation.) If you want to do something like what Jose suggested, then the information should be derived from what the prescriber put into the ReasonCode in the MedicationStatement. Perhaps that could be influenced by classification information available from a drug information database, or from the \"MedicationKnowledge\" resource. But I'm concerned you want to support anyone to insert whatever class concept they want on a medication resource in some server. Not vetted, not good.</p>",
        "id": 153929455,
        "sender_full_name": "Robert McClure",
        "timestamp": 1516300141
    },
    {
        "content": "<blockquote>\n<p>I'm concerned you want to support anyone to insert whatever class concept they want on a medication resource in some server. Not vetted, not good.</p>\n</blockquote>\n<p>Why is this a concern? I don't see why the discussion above should derive that someone wants that.</p>",
        "id": 153929458,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516300574
    },
    {
        "content": "<p>Vetting policy is outside of HL7.  FHIR allows anyone to assert anything they want.  It's up to server business rules to decide what changes can actually be made and by whom.</p>",
        "id": 153929459,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516300824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> therapeutic classes should not be something that \"any user\" can add to a  Medication.  Therapeutic class(es) is a static characteristic of the medication.</p>",
        "id": 153929460,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1516300839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> sure, that is why we have it in the ProductDefinition.</p>",
        "id": 153929461,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516300863
    },
    {
        "content": "<p>but it COULD be put in a prescription.</p>",
        "id": 153929462,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516300876
    },
    {
        "content": "<p>I don't know what you mean by \"it COULD be put in a prescription\".  Those assignments exist.  Whether or not it is explicitly expressed in a prescription (as an aspect of the medication) is trivial ... it doesn't impact the prescription</p>",
        "id": 153929464,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1516300999
    },
    {
        "content": "<p>Say aspirin has ATC class N02BA and B01AC. in a prescription you may want to put one of those.</p>",
        "id": 153929465,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301023
    },
    {
        "content": "<p>if you put both, it is not clear why you are prescribing it for</p>",
        "id": 153929466,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301052
    },
    {
        "content": "<p>that indication, not classification</p>",
        "id": 153929467,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1516301070
    },
    {
        "content": "<p>that is classification.</p>",
        "id": 153929468,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301082
    },
    {
        "content": "<p>well, indication is the condition supposed to be treated, right?</p>",
        "id": 153929470,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301107
    },
    {
        "content": "<p>and in some cases, indication is  not in the prescription.</p>",
        "id": 153929471,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301154
    },
    {
        "content": "<p>indication is the specific condition being treated.  just because aspirin is an analgesic, it is not prescribed to be analgesic, it is prescribed for some (specific) pain</p>",
        "id": 153929472,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1516301183
    },
    {
        "content": "<p>agree</p>",
        "id": 153929473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301192
    },
    {
        "content": "<p>in the US, and I believe around the world, there is a big push to strongly advise, or even require, the inclusion of indication in all prescriptions</p>",
        "id": 153929474,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1516301241
    },
    {
        "content": "<p>yes, but afaik, in some situations it is actually forbidden</p>",
        "id": 153929475,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301262
    },
    {
        "content": "<p>so perhaps atc here is a confusing example , let's consider you want to send the drug schedule, or any other classification (not therapeutic), so that the receiving system does not need to have a (synced) drug database to understand how to handle.</p>",
        "id": 153929476,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301358
    },
    {
        "content": "<p>yes, which is why I didn't say just \"require\".  It's kind of nonsensical because in those cases the \"prohibited\" information is usually easily inferred</p>",
        "id": 153929477,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1516301359
    },
    {
        "content": "<p>another example (sorry, i am trying to funnel lots of info) is narcotics. Something classified as narcotics in one side may not be classified as narcotic in the other. It may be good (or not) to send that classification over the wire, right?</p>",
        "id": 153929478,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301412
    },
    {
        "content": "<p>all of this is actually why we have the work on Catalog.</p>",
        "id": 153929479,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301429
    },
    {
        "content": "<p>so, going back to the (simple) question: <br>\n1. There is no way to handle classification in medication resource.<br>\n2. When you want to do that, i advise to clarify if you are defining the medication (as in a catalog or drug database) or conveying additional info in the prescription to support identification.</p>",
        "id": 153929480,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301639
    },
    {
        "content": "<p>\"narcotic\" medically always means the same thing.  \"narcotic\" as used in regulation can vary by jurisdiction.  whether or not a product is specifically noted as a \"narcotic\" in the order, it is still a \"narcotic\" - there may be clinical considerations for that order AND there may be procedural/regulatory considerations for the order.</p>\n<p>I agree that this particular \"sub-thread\" has diverged from the original question.  There is work going on which should address this capability</p>",
        "id": 153929481,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1516301753
    },
    {
        "content": "<p>and we have worked on entryDefinition which is a proposed(some may call it scaffolding) resource, which has classification and can be used around medication</p>",
        "id": 153929482,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301768
    },
    {
        "content": "<blockquote>\n<p>\"narcotic\" medically always means the same thing.  \"narcotic\" as used in regulation can vary by jurisdiction.  whether or not a product is specifically noted as a \"narcotic\" in the order, it is still a \"narcotic\" - there may be clinical considerations for that order AND there may be procedural/regulatory considerations for the order.</p>\n<p>I agree that this particular \"sub-thread\" has diverged from the original question.  There is work going on which should address this capability</p>\n</blockquote>\n<p>Agree, Scott. Just an example of classifications. We can consider \"distribution Class\", \"price class\"... all of which can have their interest. The idea is that a) you do not want to send the entire product definition over the wire  and b) you may not be able to guarantee that the receiver shares the same data set as the prescriber, so you want to send some additional attributes on the drug.</p>",
        "id": 153929483,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516301874
    },
    {
        "content": "<p>BTW, I was asked for recommendation on a medicines database  / \"terminology\" and to me the only solution that would work is the one on Catalog. But i look forward to see what is \"medicationKnowledge\" when it is available - and hope it is aligned with BRR resources and catalogs. Pharmacies do not define most of the drug knowledge, manufacturers and regulators do.</p>",
        "id": 153929485,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516302100
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> The use case we have is related to representing and sharing what I call \"drug information\" and is often maintained by drug knowledge base vendors such as First DataBank or Multum.  Pharmacy has separated this out of a medication that you would prescribe or dispense as it can contain more information such as classifications, etc.  Lots of discussion still to take place and meetings/quarters are scheduled in New Orleans</p>",
        "id": 153929528,
        "sender_full_name": "Melva Peters",
        "timestamp": 1516315556
    },
    {
        "content": "<p>One of the issues I pick up on in this conversation (sorry I'm late to it) is that there are defining characteristics of a medication that are always true, then there are contextual characteristics. Classifications (depending upon what you mean when you are talking about them) get into this space, and this is where the \"is-a\" hierarchical relationships get difficult.</p>\n<p>So a drug may contain an ingredient and that is defining of that drug, and always true, but depending upon the context/dose/etc it may be performing a different role - there are many drugs that can perform different roles. The fact that a drug can perform one of these roles means it has that \"disposition\", but because it has that disposition doesn't mean it will be used in that role. Then there's the regulation which licences the drugs to be used for certain purposes (in certain roles)</p>\n<p>One thing that has been useful to distinguish in the SNOMED CT drug modelling discussions the difference between the following properties of a drug<br>\n - defining characteristics (like its ingredient or form)<br>\n - the disposition/s it has because of those defining characteristics (its potential uses)<br>\n - the role/s it is performing in a particular event</p>\n<p>For example petrol is a substance we can define chemically, it has the disposition of being flammable or being a solvent, and when I'm driving my car I'm using its flammable disposition to use it in the role of being a fuel.</p>\n<p>Understanding that these properties have different characteristics and temporality is useful to consider where those properties should be modelled.</p>\n<p>Personally I like the idea of scoping Medication resources to be a pure statement of what the medication is (the defining characteristics) and separating out <br>\n - what the medication could potentially be used for or may interact with (like MedicationKnowledge for disposition) <br>\n - what the medication is licensed for in any particular realm at any given time (regulatory information)<br>\n - what the medication is being used for (or intended to be) in a specific encounter (role)</p>",
        "id": 153929552,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1516333087
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> <br>\nperhaps the semantics discussions (the \"is a\" were not well framed).</p>",
        "id": 153929568,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516352906
    },
    {
        "content": "<p>agree with :<br>\nthere are defining characteristics of a medication that are always true, then there are contextual characteristics. Classifications (depending upon what you mean when you are talking about them) get into this space</p>",
        "id": 153929569,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516352920
    },
    {
        "content": "<p>(that is a requirement we have been slowly trying to push - more than a \"knowlegde\" artifact, we need to capture the \"definition\" of a product. Hence we having our \"entryDefinition\". Which may be collapsed when we have \"productDefinition\".</p>",
        "id": 153929570,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516352993
    },
    {
        "content": "<p>and that definition is master data, although it is somewhat contextual.</p>",
        "id": 153929571,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516353039
    },
    {
        "content": "<p>the transactional data is different. <br>\nMedication was designed to be an operational data - to be put in prescriptions, etc.<br>\nWhat we in openMedicine called \"specifying a product\" (in opposition to \"Defining a product\").</p>",
        "id": 153929572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516353129
    },
    {
        "content": "<p>We all have to keep the distinction between the Catalog resource and its Catalog entries versus the things that are referenced in that Catalog.  If I am creating a Catalog of Medication resources, say to represent my jurisdictional formulary with costs and such, I would <em>NOT</em> necessarily use the Catalog classifications to represent the Drug classes.  I would use the Catalog classifications for however I am grouping the medications in my formulary.  I would <em>ALWAYS</em> use the MedicationKnowledge resource's means for identifying the various medication classes we have - such as ATC class, Allergen Groupings, etc.</p>",
        "id": 153929642,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1516378317
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> that is an option indeed, but not what the catalog was conceived for. We can iterate now and the Catalog stuff is visible exactly to get this feedback. Is there any information on the medicationKnowledge? I am not even sure the scope is clear but from this message it seems that the resource is already done.</p>",
        "id": 153929644,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516378444
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Here is the statement on the Catalog profile:  \"The Definitional resources contain static, immutable attributes. The Catalog provides the curated, approved and context-specific attributes and relations.\"  That seems rather clear to me.  The inherent relationships of a medication to its drug class, a branded product to its generic formulations, etc. are all \"static immutable attributes\" of the medication and so that seems to be out-of-scope for the Catalog and the Catalog entries.</p>",
        "id": 153929664,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1516380048
    },
    {
        "content": "<p>BTW, the Pharmacy WG is proposing the MedicationKnowledge resource as the foundational resource for formularies, drug catalogs, and other knowledge bases.  The scope of this resource will be enough attributes to convey the information that is needed for those use cases, as opposed to the existing Medication resource which is only enough attributes to convey what has been ordered/dispensed/administered/stated.</p>",
        "id": 153929665,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1516380274
    },
    {
        "content": "<blockquote>\n<p>BTW, the Pharmacy WG is proposing the MedicationKnowledge resource as the foundational resource for formularies, drug catalogs, and other knowledge bases.  The scope of this resource will be enough attributes to convey the information that is needed for those use cases, as opposed to the existing Medication resource which is only enough attributes to convey what has been ordered/dispensed/administered/stated.</p>\n</blockquote>\n<p>Glad to hear that. In 2015 it was not accepted , so i look forward to see what is proposed and if that meets the requirements.</p>",
        "id": 153929667,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516380394
    },
    {
        "content": "<p>I'm relatively certain that there won't end up being a \"Catalogue\" resource or any other resources that are catalogue-specific.  Instead, we'll end up with patterns.  The reason is that \"catalogues\" are just publication mechanisms for information that's defined and used elsewhere.  There's no piece of information that only exists in the context of a catalogue.  Price, insurance coverage, relationships between products, etc. all need to be shared and maintained in situations where no catalogue exists or will ever exist.  And the introduction of a catalogue can't change where those data elements are defined.  All a catalogue can do is take a particular subset of interrelated resources and publishe them together - i.e. as a document.</p>",
        "id": 153929671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516381207
    },
    {
        "content": "<blockquote>\n<p>I'm relatively certain that there won't end up being a \"Catalogue\" resource or any other resources that are catalogue-specific.  Instead, we'll end up with patterns.  The reason is that \"catalogues\" are just publication mechanisms for information that's defined and used elsewhere.  There's no piece of information that only exists in the context of a catalogue.  Price, insurance coverage, relationships between products, etc. all need to be shared and maintained in situations where no catalogue exists or will ever exist.  And the introduction of a catalogue can't change where those data elements are defined.  All a catalogue can do is take a particular subset of interrelated resources and publishe them together - i.e. as a document.</p>\n</blockquote>\n<p>Yep, I think we are moving in that direction</p>",
        "id": 153929676,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516381373
    },
    {
        "content": "<p>Follow-up to this; is there a FHIR-recommended URI to use for AHFS as a coding system?  (thinking of using <a href=\"http://ahfs.ashp.org/\" target=\"_blank\" title=\"http://ahfs.ashp.org/\">http://ahfs.ashp.org/</a> unless there is a better one already in use or registered)</p>",
        "id": 153949478,
        "sender_full_name": "John Silva",
        "timestamp": 1522437655
    }
]