[
    {
        "content": "<p>Is there a recommendation to capture to medication administered information in AllergyIntolerance FHIR resource?</p>\n<p>Thanks<br>\nRavi</p>",
        "id": 181233587,
        "sender_full_name": "ravindra kondiparthi",
        "timestamp": 1574273487
    },
    {
        "content": "<p>Can you explain the context better - are you looking for the medication that caused a particular reaction and you want more than just the med - you also want dose or other info?</p>",
        "id": 181237291,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574276257
    },
    {
        "content": "<p>I want to map the medication given(administered) for an allergic reaction.</p>\n<p>Example: I have an allergic reaction because of peanuts(some other food) and doctor recommended to take medicine X . </p>\n<p>is there a way to map medicine X in AllergyIntolerance resource?</p>\n<p>Thanks<br>\nRavo</p>",
        "id": 181239041,
        "sender_full_name": "ravindra kondiparthi",
        "timestamp": 1574277350
    },
    {
        "content": "<p>No, but you can reference the reaction in the actual administration or order.</p>",
        "id": 181239481,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1574277584
    },
    {
        "content": "<p>the MedicationRequest.reasonReference or MedicationAdministration.reasonReference can point to a Condition or Observation which would convey the actual reaction</p>",
        "id": 181239642,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1574277690
    },
    {
        "content": "<p>Thanks Jean!!</p>\n<p>are their any plans to add AllergyIntolerance to MedicationAdministration.reasonReference? If not I have to use condition or observation to store allergy information..</p>",
        "id": 181240889,
        "sender_full_name": "ravindra kondiparthi",
        "timestamp": 1574278440
    },
    {
        "content": "<p>So do you want to express \"a patient should take this medication because they are allergic to peanuts\"?</p>",
        "id": 181246035,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574281659
    },
    {
        "content": "<p>Or \"a patient has taken this unplanned medication because there was an allergy\"?</p>",
        "id": 181246268,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574281806
    },
    {
        "content": "<p>Because if you say \"doctor recommended\" then you have a medicationrequest.</p>",
        "id": 181246306,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574281849
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  i read it as \"take medication X because of your reaction\" and not necessarily because of the allergy itself.<br>\n<span class=\"user-mention\" data-user-id=\"232564\">@ravindra kondiparthi</span> I don't think we'd add the AllergyIntolerance because I don't think the allergy would be the <em>cause</em> of the medrequest/admin.  but the reaction should be.  I do realize that there is a missing element because we currently can't point an allergy at the reaction</p>",
        "id": 181247772,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1574282887
    },
    {
        "content": "<p>Yes my use case is user reporting \"took medication X because of allergy(can be peanuts..etc)\"</p>",
        "id": 181249719,
        "sender_full_name": "ravindra kondiparthi",
        "timestamp": 1574284073
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232564\">@ravindra kondiparthi</span> <br>\nIf you just want to say that the medicine was taken because of an allergy to peanuts, that can be said using reasonCode.<br>\nIf you want to include the details of the allergy you will need to</p>\n<ul>\n<li>use an extension on MedicationAdministration based on reasonReference, called something like reasonAllergy, or</li>\n<li>use a Condition to hold the allergy information, and refer to it with reasonReference</li>\n</ul>\n<p>I suggest you create a Jira issue to have a solution documented in R5.</p>",
        "id": 181273317,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1574307079
    }
]