[
    {
        "content": "<p>Hi, in Medication Request the intent field has a valueset that includes order and instance-order. In the spec the examples the are given for the use of instance-order are all related to medication administration,</p>\n<p>From Medication Request intent, instance-order - The request represents an instance for the particular order, for example a medication administration record.<br>\nFrom Request.intent,    instance-order - An order created in fulfillment of a broader order that represents the authorization for a single activity occurrence. E.g. The administration of a single dose of a drug. </p>\n<p>Would it be a correct use of FHIR to use instance-order to represent an issue of a repeat prescription by a GP? So if a GP Authorised a repeat prescription with 5 issues then there would be 5 Medication Requests with the intent set to instance-order that would represent the individual prescriptions.</p>",
        "id": 153929439,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1516294959
    },
    {
        "content": "<p>from a prescription (medicationRequest, instance-order=order) that says \"take this 3 times per day for 5 days\",<br>\ninstance-order is used to derive the 15 planned administrations \"take this at 7 am on day 1\", \"take this at 3 pm on day 1\"...\" take this at 11pm on day 5\"</p>",
        "id": 153929440,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516295143
    },
    {
        "content": "<p>so, repeat prescriptions should not be handled the way you are saying because that would mean that your prescription has intent=instance-order , which is not what is going to be recognized by another system (which expects prescriptions to be intent=order.</p>",
        "id": 153929441,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516295356
    },
    {
        "content": "<p>No, instance-order would rarely be used by a GP but if it was, it would be indicating the ordering of one specific administration that was covered by the drug.  I do not totally understand  your terminology \"a repeat prescription with 5 issues\", but the MedicationOrder resource allows for defining a prescription (with intent=order) that allows refills.</p>",
        "id": 153929442,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1516295846
    },
    {
        "content": "<p>What do you mean by \"repeat prescription\"?</p>",
        "id": 153929448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516297269
    },
    {
        "content": "<p>I guess Repeat prescription is a UK term. It is a prescription issued by a GP that means the patient can get further supplies of a medication without the patient having to see the doctor again. This may be for a limited number of occurrences ie. the GP may authorise for the medication to be supplied 5 times or perhaps until a certain date when it would be reviewed.</p>",
        "id": 153929562,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1516351715
    },
    {
        "content": "<p>That is quite common. I would suggest the way to use it is using medicationrequest.DispenseRequest.</p>",
        "id": 153929566,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516352704
    },
    {
        "content": "<p>there you can say \"this prescription is valid for 1 year\" or \"this prescription is valid for 5 refills\"</p>",
        "id": 153929567,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516352757
    },
    {
        "content": "<p>Agree with Jose.  That would be a single order.  The MedicationRequest.dispenseRequest would convey how many fills are authorized.  If you wanted to initiate just a single fill, that would be handled by Task.</p>",
        "id": 153929630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516377283
    },
    {
        "content": "<p>What they said.  The MedicationRequest.DispenseRequest.numberOfRepeatsAllowed lets you specify how many fills beyond the first that you are authorizing.</p>",
        "id": 153929645,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1516378463
    }
]