[
    {
        "content": "<p>Hi all,<br>\nI'm new to FHIR and to Zulip, sorry if this topic has already been discussed or documented somewhere, I was not able to find it.<br>\nIn the context of an hospital, a physician may prescribe a continuous injection of a 'preparation' made of several drugs. This prescription will be handled by a nurse who will have to prepare this prescription into a bag before administration.<br>\nTypically this prescription will have a main product (e.g. morphine) and some additional products (e.g. Sodium chloride) which can be classified as carrier solution, adjuvant, etc<br>\nHow should we handle this in terms of Medication and MedicationRequest?<br>\nCould we use basedOn?<br>\nMedicationRequest A (Medication=main product) - id=medreqA<br>\n  - MedicationRequest B (Medication=carrier solution) - basedOn=medreqA<br>\nThanks.<br>\nFabrice</p>",
        "id": 153918833,
        "sender_full_name": "Fabrice Aupert",
        "timestamp": 1510311369
    },
    {
        "content": "<p>If it's handled as a single Medication that is prepared before administration, then you'd handle it as a compound - and use Medication.ingredient to describe the mixture.  If it's handled as multiple separate bags hanging on an IV, then you'd have separate MedicationRequests and could potentially use RequestGroup to identify timing and/or conditional dependencies between them.  MedicationRequest.basedOn is to let you assert that one request is based on the authorization of another request.  So it lets you say \"Plan B is based on recommendation A\" or \"Presciption C is based on Plan B and recommendation A\" or \"Encoded order D is based on prescription C\" or \"Instance order E is based on Prescription C and Encoded order D\".  The content of all requests in a \"basedOn\" chain should be consistent (i.e. same patient and more-or-less same drug, allowing for permitted substitutions and strength adjustments)</p>",
        "id": 153918845,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510316424
    },
    {
        "content": "<p>Hi Lloyd. Thanks for the info, that's very helpful.</p>",
        "id": 153918849,
        "sender_full_name": "Fabrice Aupert",
        "timestamp": 1510320132
    },
    {
        "content": "<p>i think Lloyd's guidance is similar to this:<br>\nIf two different drugs are to be administered at the same time, and if the group of these drugs does not have one unique ID, this is represented by a group of medication requests (i.e., one single request group, with two requests, each representing one medication item.<br>\nAn example is “Drug A 500 mg and Drug B 150 mg”. Most compound products may be described this way.</p>",
        "id": 153918867,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510328726
    },
    {
        "content": "<p>If, however, the grouped composite medication can also be represented in an unequivocal way as a single product (even if as free text), then this can be represented as a single medication. <br>\nPut simply, it is recommended to specify a combination of products with a unique resource that unequivocally represents that combination, if that is possible and that unique code exists.<br>\nIf not, then the combination needs to be described by a group of its constituents.</p>",
        "id": 153918868,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510328839
    }
]