[
    {
        "content": "<p>Good day. I was wondering if anyone's seen or done anything with extensions for medication reconciliation??</p>",
        "id": 153836822,
        "sender_full_name": "Chad Albert",
        "timestamp": 1467924476
    },
    {
        "content": "<p>some thoughts here: <a href=\"https://fhirblog.com/2013/10/31/representing-a-patients-list-of-medications-in-fhir/\" target=\"_blank\" title=\"https://fhirblog.com/2013/10/31/representing-a-patients-list-of-medications-in-fhir/\">https://fhirblog.com/2013/10/31/representing-a-patients-list-of-medications-in-fhir/</a>   (a bit dated tho...)</p>",
        "id": 153836843,
        "sender_full_name": "David Hay",
        "timestamp": 1467928525
    },
    {
        "content": "<p>I think it might be time to revisit this one, and comment on the current state of this.<br>\nOr an update to the article. :)</p>",
        "id": 153836929,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1467958773
    },
    {
        "content": "<p>yes, a new post is needed! I'll put it on the list   :)</p>",
        "id": 153836932,
        "sender_full_name": "David Hay",
        "timestamp": 1467959490
    },
    {
        "content": "<p>What is the appropriate content to revisit here? We're working with some vendors who provide medication reconciliation solutions and we're looking to understand what the appropriate FHIR API is to have that information written to and then exposed from our FHIR server. Current Resource Lists looks like the right area to be investigating (<a href=\"https://www.hl7.org/fhir/lifecycle.html#current\" target=\"_blank\" title=\"https://www.hl7.org/fhir/lifecycle.html#current\">https://www.hl7.org/fhir/lifecycle.html#current</a>). Are we on the right track there?</p>",
        "id": 153861174,
        "sender_full_name": "David Teirney",
        "timestamp": 1481015995
    },
    {
        "content": "<p>We've implemented MedicationStatement, which addresses a subset of the Medication Reconciliation workflow.  For example....</p>\n<p>1. Capture the patient’s current medication list (typically a nursing workflow).<br>\nWe've implemented MedicationStatement for this part of the workflow.  A MedicationStatement can be created to represent a patient-reported over-the-counter medication, a patient-reported medication that was prescribed by another provider (using a different system), as well as statements of compliance (e.g. taking as prescribed or not) for prescriptions/medications previously ordered within our system. </p>\n<p>2. At each change of venue, compare and update the patient’s medication list (typically a physician workflow).   <br>\nThe FHIR List resource seems reasonable to convey a historical snapshot of the medication list at each change of venue, along with who took what actions on each order, but we haven't actually implemented List yet.  Some of the US-based MU use cases (such as retrieving the current list) can be met via MedicationStatement alone.     </p>\n<p>3.Communicate the list, which could consist of generating a report to give to the patient or receiving provider (for transfers).  We haven't implemented any queries to retrieve those reports.</p>",
        "id": 153861224,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1481036772
    }
]