[
    {
        "content": "<p>FHIR R4 MedicationRequest.category contains two concepts - community and discharge.  CQI believes that discharge was added for their use case - I.e., for medications ordered for the patient to take at home after discharge.  However, previously, Pharmacy committee suggested that we use \"community\" since the orders is written for the patient to take at home.  We need clarification.</p>",
        "id": 186215953,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1579633794
    },
    {
        "content": "<p>this is an example binding so I guess/hope it says \"there is no strict guidance on these codes and their meaning and implications\".</p>",
        "id": 186216815,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1579634324
    },
    {
        "content": "<p>If the use case is a hospital system, this case is obviously a \"discharge\", there's no need to project the remainder of the workflow (where this may be happening) into the request. But depends on the use. In some implementations you may simply have inpatient/community.</p>",
        "id": 186217219,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1579634567
    },
    {
        "content": "<p>Is there a need to make any stronger guidance here?</p>",
        "id": 186217283,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1579634616
    },
    {
        "content": "<p>The issue is that the definition of \"community\" seems to encompass the \"written to be taken at home ---- as in after discharge\" and it is broader because it is also covering medications written to take at home from the ambulatory setting.  Discharge is for meds to be taken at home but more restricted to the discharge setting.   The challenge is that in writing electronic clinical quality measures, we feel there is some overlap and we want to be sure the implementers are clear.</p>",
        "id": 186217649,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1579634855
    },
    {
        "content": "<p>Discharge Prescriptions does overlap with \"Prescriptions dispensed in a community pharmacy\", I think.<br>\nThis overlap is not a bad thing, is it?</p>",
        "id": 186220271,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1579636452
    },
    {
        "content": "<p>There is definitely an overlap between discharge and community.  The attribute can be used for any kind of grouping - pharmacy included the exemplar value set for \"where the medication is expected to be consumed or administered\" .  Originally, we had inpatient, outpatient and community, but have since added discharge.  I really think that this attribute needs to be reviewed and the value set updated to make it less confusing.  If we're trying to represent (in the example) where the medication is to be consumed - then I think it should  be inpatient, outpatient and community only as values.  Discharge is confusing.  I'm going to add a JIRA issue.  <span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span> you can add your comments about your use case to that issue once it is created.  We can only have 1 exemplar value set, but we could provide other examples of how this could be used in the attribute it self.</p>",
        "id": 186222428,
        "sender_full_name": "Melva Peters",
        "timestamp": 1579637749
    },
    {
        "content": "<p>Thanks Melva.  I think discharge may have \"sneaked in\" because of CQI's comments but I definitely think community covers the use case without discharge.</p>",
        "id": 186222792,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1579637992
    },
    {
        "content": "<p>FWIW, I think overlap is not a bad thing. We have hierarchical codes everywhere. But agree with clarification of the examples we give in implementation.</p>",
        "id": 186222896,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1579638048
    },
    {
        "content": "<p>Here's the JIRA issue: FHIR-25555 - <a href=\"https://jira.hl7.org/browse/FHIR-25555\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-25555\">https://jira.hl7.org/browse/FHIR-25555</a></p>",
        "id": 186223212,
        "sender_full_name": "Melva Peters",
        "timestamp": 1579638226
    }
]