[
    {
        "content": "<p>If a patient has multiple comorbidities, and there are care protocols for each, are there known approaches for merging these in a single patient-specific care plan? Was there ever an operational system that implemented this? There are some academic publications on this subject, however it is hard to get started. I would appreciate if anyone could point to useful/important resources in this area.</p>",
        "id": 154006962,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1539078644
    },
    {
        "content": "<p>Merging them without any human intervention?  I guess that's theoretically possible, but I'm pretty sure you'd want a human to intervene with the result.</p>",
        "id": 154006999,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539094526
    },
    {
        "content": "<p>We see the process as akin to merging git branches: there is a history of completed treatments up to present, and the care plans currently proposed are \"feature branches\". In order to be put in action, they would have to be merged into the \"master\" in a semi-automated way, resolving potential conflicts along the way. The process might facilitate communication among clinicians. Thus, there would be a collectively maintained unified care plan in action. Apparently there was some discussion on this within HL7 last year, but nothing was published of the outcome: <a href=\"http://wiki.hl7.org/index.php?title=201704_Care_Plan\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201704_Care_Plan\">http://wiki.hl7.org/index.php?title=201704_Care_Plan</a></p>",
        "id": 154007475,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1539186682
    },
    {
        "content": "<p>We've been testing some ideas on this topic.  With interoperable data, we were able to model a Multiple Sclerosis patient with 3+ careplans.  We store the FHIR resources in collections for each resourceType.  So when the careplans come in with different goals, medications, conditions, etc; the goals all get grouped together; the meds all together; etc.  With our Careplan Designer, we've been experimenting with filtering.  One obvious approach for merging is the \"this is what's remaining to do\" careplan.  So, we filter out any goals with status completed; medication orders that have been filled; conditions that are remission; etc.  And whatever is remaining, we just write into an aggregate careplan.</p>",
        "id": 154008549,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539357947
    },
    {
        "content": "<p>We've been investigating this in the Care Coordination track at the Connectathons. In particular we've been looking at using CarePlan.partOf to link various care plans together. The issue we've been running into is that not all care will be provided by a single provider and each member of the care team may be generating their own care plans to document their part of the patient's treatment.</p>",
        "id": 154008553,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1539358628
    },
    {
        "content": "<p>How do you manage the \"relevance\" aspect?  The optometrist's care plan, the gynechologist's care plan and the psychiatrist's care plan may have some level of overlap, but a lot of what's in the different plans won't be relevant (or even appropriate to share) with other plans.</p>",
        "id": 154008564,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539363105
    },
    {
        "content": "<p>We have a user interface to let the user determine relevance!  <span class=\"emoji emoji-1f601\" title=\"grin\">:grin:</span></p>",
        "id": 154008568,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539363680
    },
    {
        "content": "<p>:punt:</p>",
        "id": 154008569,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539363699
    },
    {
        "content": "<p>If you're providing automated merging with manual review/assistance, that makes sense.  I thought some were talking about fully automated merging, which makes me a bit nervous.</p>",
        "id": 154008571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539363815
    }
]