[
    {
        "content": "<p>During the upcoming DevDays in Amsterdam I'll be presenting a session (see <a href=\"https://www.fhirdevdays.com/schedule/#event-403\" target=\"_blank\" title=\"https://www.fhirdevdays.com/schedule/#event-403\">https://www.fhirdevdays.com/schedule/#event-403</a> ) with the title \"Messaging, the unloved paradigm\".</p>\n<p>Within the FHIR community messaging is usually seen as an old fashioned way of data interchange, yet at the same time: messaging is probably the most widely used paradigm for data exchange in healthcare, and a large number of FHIR projects are based on FHIR messaging. </p>\n<p>My questions to you: <br>\n(1) I'd love to know about your messaging project, especially if the choice to use messaging was NOT based on the fact that you're converting from/to HL7 v2. The English NHS has embraced messaging, mainly for volumetric concerns they have with REST. - that's the kind of stuff I'd love to include in the presentation.<br>\n(2)  As part of the presentation I'll debunk some of the bogus arguments against the messaging paradigm (like: \"messaging is old fashioned\"). [Note that there are valid arguments pro/con messaging, just as there are pro/con arguments related to REST or documents]. What bogus arguments have you heard yourself?</p>",
        "id": 153904447,
        "sender_full_name": "René Spronk",
        "timestamp": 1504617611
    },
    {
        "content": "<p>Canada is using messaging with a \"mailbox\" approach on a central server for secure communication and e-prescribing.  Rationale was that recipients wouldn't necessarily be up at time of delivery and a desire to send all relevant information as a single package.  There was no desire to support information access beyond specificly targeted recipients, so hosting the information a FHIR server for query seemed inappropriate.</p>",
        "id": 153904461,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504620354
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> as you say in the NHS we are using the messaging paradigm quite extensively. There are a number of reasons for this not all attached to volumetrics. We use RESTful and Document paradigms as well. An appropriate solution to address the problem Across our very heterogeneous landscape we have to cater with a stack of legacy and a broad spectrum of \"digital maturity\". Happy to discuss more if you are in San Diego.</p>",
        "id": 153904468,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1504621843
    },
    {
        "content": "<p>Rene, I find that FHIR has added features that resolve much of the problems people point out as critical against messaging. First of all is the Subscription, to enable dynamic attachment/detachment to a messaging stream. Second of all the Conformance capabilities, to align expectations. Yes, messaging can be done without these, and you will end up with a very HL7 v2 like system...   :-)</p>",
        "id": 153904477,
        "sender_full_name": "John Moehrke",
        "timestamp": 1504624975
    },
    {
        "content": "<p>I'm interested to know what the 'large number' is beside the NHS</p>",
        "id": 153904496,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504632824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I'll add that to my list of issues to debunk -the \"nobody is using it\" comment. I'm aware you didn't intent to word it like that. I'm aware of 3 implementations that use it in production, and I recall some chats here with a fair number of participants (e.g. about 'trigger events'). I have yet to find out if/how they're using messaging.<br>\nAs always it's difficult to be aware of projects that use one's specifications. How many projects do you know of that use FHIR Documents (i.e. those projects whose use-case is NOT based on CDA conversion) ? That's tough - it's early days yet.</p>",
        "id": 153904598,
        "sender_full_name": "René Spronk",
        "timestamp": 1504680131
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Note that my DevDays talk is aimed at those that know nothing about HL7v2, those that started working afresh with FHIR without any prior exposure to HL7. When en why should they use the messaging paradigm ? What is the messaging paradigm ? - That's the issue I'll be addressing, without mentioning HL7v2 ever (well, maybe just once, to illustrate the migration issues).<br>\n(As a side note:  there'll be a similar talk at DevDays about the document paradigm for those new to FHIR, without any mention nor explanation of CDA R2)</p>",
        "id": 153904599,
        "sender_full_name": "René Spronk",
        "timestamp": 1504680460
    },
    {
        "content": "<p>In Ontario, Canada, we are using messaging for submission of immunization records by doctor's portal and EMR systems to the provincial immunization repository. The submission goes into a temporary repository first where public health nurses review them, might call a provider in case they need to clarify anything, might add a patient record if it's not in the system yet (e.g., newborn or newcomer) and then approve these immunization records to be added to the main repository.</p>",
        "id": 153904708,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1504727966
    },
    {
        "content": "<p>thx</p>",
        "id": 153904925,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504839808
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> me and my colleagues at Redox have built a cottage industry out of turning HL7v2 messages into JSON (not necessarily FHIR messages). The key concepts I would hammer home are state and events. Messages are powerful because they provide a framework to map real-world state changes. If I tried to map an ADT^A02 message to bundle, I would be relying on the receiver to detect a change in location for the patient. This seems risky, ands a lot of complexity to the receiver's logic. Best to explicitly say \"A transfer happened\" to remove ambiguity and allow the receiver of the message to focus on what to do after that event happens. </p>\n<p>If you're looking for an example that can illustrate the concept - look at github webhooks: <a href=\"https://developer.github.com/webhooks/\" target=\"_blank\" title=\"https://developer.github.com/webhooks/\">https://developer.github.com/webhooks/</a> <br>\nPeople want to develop things that respond to events in Github in real-time. Same goes for healthcare, and real-time is much more important than github webhooks when it comes to ADT.</p>",
        "id": 153905005,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1504878726
    },
    {
        "content": "<p>What's the intent of MesssageDefinition.event?</p>",
        "id": 153911209,
        "sender_full_name": "René Spronk",
        "timestamp": 1506601040
    },
    {
        "content": "<p>..and if trigger event, why not as a code as in CapabilityStatement.messaging.event.code ?</p>",
        "id": 153911212,
        "sender_full_name": "René Spronk",
        "timestamp": 1506601434
    },
    {
        "content": "<p>Side observation: CapabilityStatement.messaging.event.focus is 1..1, whereas a message can have multiple focal resources (this is supported by MessageDefinition..)</p>",
        "id": 153911213,
        "sender_full_name": "René Spronk",
        "timestamp": 1506601716
    },
    {
        "content": "<p>Side observation 2: CapabilityStatement.messaging.event.response is 1..1, thus indicating that each and every event shall have exactly 1 response message type. MessageDefinition has a 0..* list of AllowedResponse. message<br>\nSide observation 3: MessageDefinition has a strange lack of references to StructureDefinition - the only such link is for the \"focal resource\", not for the remainder / overall structure of the message.</p>",
        "id": 153911236,
        "sender_full_name": "René Spronk",
        "timestamp": 1506605331
    },
    {
        "content": "<p>Cappability.messaging.event is going to go away, replaced by MessageDefinition.  But I agree that the change away from code is concerning.  MessageDefinition needs to be updated to use GraphDefinition to define the content.  I'd forgotten to write the CR to do that.  now done - <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13970\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13970\">GF#13970</a></p>",
        "id": 153911247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506610020
    },
    {
        "content": "<p>The intent with URI is to point to EventDefinition - but that seems like severe overkill given the historic use of messaging.</p>",
        "id": 153911249,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506610077
    },
    {
        "content": "<p>Ok, so something like [messaging_conformance.jpg] (shown below, showing highlights only for educational purposes)(<a href=\"https://chat.fhir.org/user_uploads/10155/8GcLAAlb_LrgDV_Y8VLnIBuy/messaging_conformance.jpg\" target=\"_blank\" title=\"messaging_conformance.jpg\">https://chat.fhir.org/user_uploads/10155/8GcLAAlb_LrgDV_Y8VLnIBuy/messaging_conformance.jpg</a>) </p>\n<p>The NHS uses Composition as the focal resource in messages, which simplifies the graph.</p>\n<div class=\"message_inline_image\"><a href=\"https://chat.fhir.org/user_uploads/10155/8GcLAAlb_LrgDV_Y8VLnIBuy/messaging_conformance.jpg\" target=\"_blank\" title=\"https://chat.fhir.org/user_uploads/10155/8GcLAAlb_LrgDV_Y8VLnIBuy/messaging_conformance.jpg\"><img src=\"https://chat.fhir.org/user_uploads/10155/8GcLAAlb_LrgDV_Y8VLnIBuy/messaging_conformance.jpg\"></a></div>",
        "id": 153911445,
        "sender_full_name": "René Spronk",
        "timestamp": 1506676445
    },
    {
        "content": "<p>Yes</p>",
        "id": 153911482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506697765
    }
]