[
    {
        "content": "<p>I remember seeing some comparison of MessageHeader vs Communication resources, but I cannot locate it. There is a lot of similarity between the two resources and I'm wondering if there are any guidleines on the scenarios where each of these resources is supposed to be used. </p>",
        "id": 153869732,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1485986035
    },
    {
        "content": "<p>MessageHeader is to support the messaging paradigm.  It's a transport mechanism.  Clinicians and business users will never see a MessageHeader any more than they'd see an HTTP header.  Communication is a business resource - it allows you to track what was told to another person/system.  The information might have been shared in person, by mail, by phone or electronically.  You'd expect to see records of Communication in the EHR.  </p>",
        "id": 153869747,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485990128
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . So MessageHeader is equivalent to HL7v3 message wrappers and HL7v2 MSH segment while Communication is just a record of communication rather than the actual system to system message, correct?</p>",
        "id": 153869776,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1486010128
    },
    {
        "content": "<p>Correct.</p>",
        "id": 153869781,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486024164
    },
    {
        "content": "<p>Unless the message you want to send IS the content of the Communication resource.</p>",
        "id": 153872944,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1487681328
    },
    {
        "content": "<p>Not sure that's an \"unless\".  MessageHeader is about routing a system-level communication.  Communication is maintaining a record of a business/clinical level sharing of information.  It's certainly possible to pass a Communication inside a FHIR message, but that doesn't change the function of each of the resources.</p>",
        "id": 153872968,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487698834
    },
    {
        "content": "<p>Communication doesn't only contain a recording that an information exchange occurred, it can exchange the information (as a reference or actual content) in Communication.payload.content.</p>",
        "id": 153873524,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1488106185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Not really.  Communication is a record of what was shared.  You could treat the Communication as having a status of \"active\" meaning that the communication is ongoing.  But Communication isn't really intended as a way of actually sharing the information, it's a way of saying this is being/was shared.</p>",
        "id": 153873567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488122746
    }
]