[
    {
        "content": "<p>I'm curious if any production implementations utilize message-level encryption. TIA</p>",
        "id": 180538837,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1573578958
    },
    {
        "content": "<p>Depends on what you call a message, and what you are using for storage/transport.<br>\nFor example in the USA there is the \"Direct Project\" that uses e-mail transport and S/MIME end-to-end encryption of any 'message' which usually are but are not limited to documents.</p>",
        "id": 180584466,
        "sender_full_name": "John Moehrke",
        "timestamp": 1573612494
    },
    {
        "content": "<p>In IHE there is a profile for general purpose end-to-end encryption -- DEN profile</p>",
        "id": 180584486,
        "sender_full_name": "John Moehrke",
        "timestamp": 1573612521
    },
    {
        "content": "<p>Most of the time these have huge administrative burden ... so often are scrapped half implemented with preference for  normal TLS and thus normal web http encryption between client and server (session, point-to-point).</p>",
        "id": 180584549,
        "sender_full_name": "John Moehrke",
        "timestamp": 1573612597
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , I was specifically interested in FHIR implementations that encrypt the message payload itself. I suspect the answer is no and that transport-level encryption is sufficient. Speaking only for my org, we also encrypt data at rest, but assume this is SOP industry-wide.</p>",
        "id": 181329294,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1574358757
    },
    {
        "content": "<p>encryption of data-at-rest would be an operational requirement that is outside-the-scope of HL7 to define. We do point at good security frameworks that would encourage that kind of stuff.</p>",
        "id": 181329474,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574358866
    },
    {
        "content": "<p>Understood.</p>",
        "id": 181329740,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1574359029
    }
]