[
    {
        "content": "<p>I've just submitted a new tracker item (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23061\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23061\">GF#23061</a>) seeking some clarification around the boundaries of using Messaging vs. using the Communication resource because the scope of Communication  has been evolving to the point that there's now considerable overlap and I'm seeing projects that are starting to use Communication to essentially replicate v2 ADT messaging.  Right now, there's no guidance that tells implementers or designers when to go one route or the other.  I'm not sure exactly what the wording should be, but it's desperately needed and needs to be right.</p>\n<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> (and anyone else who wants to play :&gt;)</p>",
        "id": 172543286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565043437
    },
    {
        "content": "<p>I'm not seeing the overlap</p>",
        "id": 172543465,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565043600
    },
    {
        "content": "<p>Communication lets you identify a sender, recipient and reason and point to a payload that's being communicated.  MessageHeader lets you do the same.  Create a Bundle with either and post them to an operation endpoint that says \"process this\" and they're somewhat indistinguishable.</p>",
        "id": 172543677,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565043775
    },
    {
        "content": "<p>This discussion addresses notification and messaging so I think this is a topic for the INM work group.</p>",
        "id": 172694356,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1565196504
    },
    {
        "content": "<p>As owners of MessageHeader, they should certainly be involved in the discussion.  As should PC (who owns Communication).  Expect FHIR-I (responsible for the paradigms in general)  and MnM (methodology) may have opinions too.  This is probably the best place for a general discussion.</p>",
        "id": 172694528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565196673
    },
    {
        "content": "<p>sounds like we should have a quarter about this at Atlanta</p>",
        "id": 172718715,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565214220
    },
    {
        "content": "<p>We have a joint scheduled w/ PC, but there's often a lot of other things on the agenda.   We could do it the Tue Q2 session that InM hosts FHIR-I.  <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>, would PC be able to sent a rep?  (Note that I won't be there - someone else would be representing FHIR-I.)</p>",
        "id": 172720387,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565215884
    },
    {
        "content": "<p>Tues Q2 might be challenging...  What about using one of these other quarters?</p>\n<ul>\n<li>Mon Q4 - FHIR-I hosts a large joint Workflow quarter</li>\n<li>Tues Q1  (I can be available)</li>\n<li>Tues Q3 - PC hosts FHIR-I (and I can put this tracker on our agenda)</li>\n<li>Wed Q3 - PC hosted quarter (and I can put this tracker on our agenda)</li>\n</ul>",
        "id": 172763798,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1565270567
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> ?</p>",
        "id": 172793188,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565290426
    },
    {
        "content": "<p>I am concerned we will burn a quarter with very little to show for it.   I am curious what would be the specific goals of this quarter and would the outcomes provide any real benefit beyond what we already say about Messaging and RPC? </p>\n<p>Besides Alerts who else chose to ignore messaging and use Communication + RPC route?</p>\n<p>There is a lot of overlap in the content models but that doesn't seem to be the issue rather choosing the \"right\" paradigm,  although what is right may be in the eye of the beholder, so( In the FHIR messaging section there is even a $process-message. operation for messaging so there is no real boundary here)   My immediate thought is to create a master table to say \"for transaction X consider paradigm Y \".  Heck, that may already exist but the spec is getting so big even I don't know what's all in there.</p>",
        "id": 172811635,
        "sender_full_name": "Eric Haas",
        "timestamp": 1565306331
    },
    {
        "content": "<p>I think the objective would be specific wording for inclusion in the spec - wording that would differentiate the \"business\" level of asking for data and meeting that request from the \"technical\" level of routing information to relevant systems.</p>",
        "id": 172816426,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565311848
    },
    {
        "content": "<p>So restating  create a master table to say \"for transaction X consider paradigm Y \"</p>",
        "id": 172816549,
        "sender_full_name": "Eric Haas",
        "timestamp": 1565312030
    },
    {
        "content": "<p>More about language to insert in the \"boundaries and relationships\" section for both MessageHeader and Communication, and perhaps a blurb to inject in the 'messaging' page.</p>",
        "id": 172816636,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565312145
    },
    {
        "content": "<p>I think this is too narrow a focus.  It should be a start of a \"how to  in FHIR page\".   .... and  ... For anything to get done in a quarter a straw man proposal ( table ) would be helpful.</p>",
        "id": 172816901,
        "sender_full_name": "Eric Haas",
        "timestamp": 1565312511
    },
    {
        "content": "<p>It's not necessarily wrong to have a page in the architecture section that does that too.  But we can't count on people seeing/reading that.  So the guidance needs to be everywhere that we can reasonably predict (in this case, based on experience) that designers/implementers might start barking up the wrong tree.</p>",
        "id": 172818928,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565315543
    },
    {
        "content": "<p>I never considered that Messaging and Communication were so close, but now I see it... I expected Messaging would be used as is v2 messaging or subscriptions today for regular push of data. Where as communication is more one-off, uncommon, event, or human driven. No idea why I thought that except that I saw Communication more associated with (SMS messages, Email messages, etc), and messaging more backend business stuff.</p>",
        "id": 172851247,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565357490
    },
    {
        "content": "<p>Did we land on a work group meeting (WGM) quarter yet?  Patient Care has another backlogged tracker (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13389\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13389\">GF#13389</a>) dealing with Communication scope that we'll try to squeeze into the same quarter as this boundaries discussion.  My prior suggestions were:<br>\nMon Q4 - FHIR-I hosts a large joint Workflow quarter<br>\nTues Q1 (I can be available)<br>\nTues Q3 - PC hosts FHIR-I (and I can put this tracker on our agenda)<br>\nWed Q3 - PC hosted quarter (and I can put this tracker on our agenda)</p>",
        "id": 173927510,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1566513401
    },
    {
        "content": "<p>Pinging <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> again</p>",
        "id": 173927717,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566513609
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I think this needs to include INM as its within their scope. Monday Q4 or Tuesday Q3 I think are best for me.</p>",
        "id": 173942270,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1566536359
    },
    {
        "content": "<p>Ok, let's plan for Mon Q4.  I'm not sure we're going to have a whole lot of other things to discuss in that quarter and this should be somewhat juicy :)</p>",
        "id": 173969108,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566567347
    },
    {
        "content": "<p>I'd prefer Tuesday Q3, if possible...</p>",
        "id": 174006395,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1566597388
    },
    {
        "content": "<blockquote>\n<p>I never considered that Messaging and Communication were so close, but now I see it... I expected Messaging would be used as is v2 messaging or subscriptions today for regular push of data. Where as communication is more one-off, uncommon, event, or human driven. No idea why I thought that except that I saw Communication more associated with (SMS messages, Email messages, etc), and messaging more backend business stuff.</p>\n</blockquote>\n<p>Should'nt Communication be more clearly documented to be what it was originally meant to be: \"This resource is a record of a communication that has occurred. It does not represent the actual flow of communication\".<br>\nInstead of redefining it to be another kind of MessageHeader? This could be solved by documenting the \"record\" purpose of the Communication resource at the very beginning of the Resource description. I don't think introducing a second MessageHeader flavor solves any issues, it just makes Messaging model more complex, and does not offer any obvious gains for that complexity. (other than the few projects using the Resource in a creative way?)</p>",
        "id": 174117112,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1566799552
    },
    {
        "content": "<p>I think that you can write all the words you want in the introductions, if if looks and act like a duck - folks are going to treat it like a duckl    Structure works fine as a header the challenge is to convince folks its not a bundle header.</p>",
        "id": 174157903,
        "sender_full_name": "Eric Haas",
        "timestamp": 1566838282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> is PC going to have much else on the joint PC/FHIR-I agenda for Tue Q3?  I can make either work, so it's a question of the PC agenda for that quarter.</p>",
        "id": 174196177,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566880709
    },
    {
        "content": "<blockquote>\n<p>I think that you can write all the words you want in the introductions, if if looks and act like a duck - folks are going to treat it like a duckl    Structure works fine as a header the challenge is to convince folks its not a bundle header.</p>\n</blockquote>\n<p>This happens time and time again in the FHIR spec, some resources are so similar that it is not trivial to determine what is the best choice for a specific use-case. The best approach is to change the resource in a way that it don't really fly as well for the overlapping use-cases. This might be difficult in some cases because of the requirements of theuse-cases you try to solve. I believe the best bet when you have overlapping Resource capabilities is to have good documentation that clearly states the boundaries and purpose of the resources, and I think this can get better as more implementations reveals overlaps in the spec, if the clarifications are documented that is.</p>",
        "id": 174222664,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1566908309
    },
    {
        "content": "<p>The challenge is that preventing abuse often prevents utility too.  If we provide clear guidance about what not to do - and what to do instead, most implementers will follow it.  (And those who choose not to can be clearly shown the error of their ways :&gt;)</p>",
        "id": 174234637,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566916293
    },
    {
        "content": "<p>The agenda for Tues Q3 is flexible - just the usual FHIR admin + any trackers in the backlog.  Stated another way, we should have plenty of time.</p>",
        "id": 174242706,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1566921398
    }
]