[
    {
        "content": "<p>I'd like to use an event Coding to represent EligibilityRequest/EligibilityResponse messaging, but I cannot find a suitable Coding from the current Preferred list \"<a href=\"http://hl7.org/fhir/message-events\" target=\"_blank\" title=\"http://hl7.org/fhir/message-events\">http://hl7.org/fhir/message-events</a>\".  Could we expand the list? or could I define a custom Coding system?</p>",
        "id": 153843864,
        "sender_full_name": "jassy",
        "timestamp": 1471040025
    },
    {
        "content": "<p>you can make up your own events, and/or you can review the connnectathon notes from previous connectathons to see what they are using</p>",
        "id": 153843866,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471041871
    },
    {
        "content": "<p>The previous connectathons do not show use cases with the \"messaging\" transaction paradigm I am looking for.  For example, most use cases are using a REST get request and a separate pull for response. Thanks for the reference and suggestion.  </p>",
        "id": 153843878,
        "sender_full_name": "jassy",
        "timestamp": 1471151522
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> - I thought there was a message event for this somewhere?</p>",
        "id": 153843879,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471170627
    },
    {
        "content": "<p>No, the FHIR Message connectathon work pre-dated the current MessageHeader and $process-message endpoints. Most of you testing of late has been conventional RESTful Request/Response or WSI Web Services (or FHIR REST using POST and GET). </p>\n<p>The Message Event codesystem is inconsistent, but inferring the pattern then something like 'EligibilityRequest-Process' for $process-request to 'Process an EligibiltyRequest and return an EligibilityResponse.' would be appropriate.</p>",
        "id": 153843880,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1471175881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> The notion of event code hasn't changed since the inception of MessageHeader.  In any case, you can't infer the existence of codes not defined in the current code system.  So while you can follow the naming pattern, you'd still have to do it within your own code system with your own URI until such time as HL7 defines an event code.  (It's not clear right now whether HL7 is going to take this on as not a lot of implementers have been seeking standardized event codes - almost everyone wants to go off and define their own anyhow.</p>",
        "id": 153843937,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1471277522
    },
    {
        "content": "<p>I didn't think the notion of the event code has changed, I said the code name pattern was inconsistent. Yes, to get a code in the codeset we would have to add it to the codeset. Agreed, people going off and doing their own thing is a problem, probably the biggest barrier to interoperability and largest source of risk and waste - I think that we need to be active rather than passive in addressing this.</p>",
        "id": 153844067,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1471468014
    },
    {
        "content": "<p>generally, we are pretty passive in the messaging space because<br>\n- few implementers are using it, and those that are have not stepped forward to ask for changes<br>\n- no committee is standing forward and caring</p>",
        "id": 153844120,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471471672
    }
]