[
    {
        "content": "<p>I've been looking at the MessageHeader.destation.reciever documentation, and noticing that it is a reference to a Practitioner or PractitionerRole or Organization.  Because it's a reference the resource being referenced is not actually enforced via schema.  Is it a bad thing to reference a CareTeam or RelatedPerson etc?   </p>\n<p>Second to that, why would the documentation not allow the same choices as Communication.recipient, which documents Device, Organization, Patient, Practitioner, PractitionerRole, RelatedPerson, Group, CareTeam, HealthcareService as possible referenced resources?</p>",
        "id": 175481696,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1568240699
    },
    {
        "content": "<p>1. yes that would be a bad thing <br>\n2. because classically this hasn't happened when messaging. Do you have use cases?</p>",
        "id": 175482440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568241443
    },
    {
        "content": "<p>Well this came about because I was considering a message scenario where I was attaching a document.  So I was assuming a a message bundle with a focus on a Communication resource containing a contentReference in the payload.  I was suggested to me that the focus should potentially be a DocumentReference instead, because that can encapsulate a reference to a document and references to related attachments which I needed.  </p>\n<p>The issue for me became that I needed a place to put the recipients that I would have put in Communication.recipient.   MessageHeader.destination.receiver seemed the obvious place, except for the cardinality of 0..1 and the fact that the documentation states that the possible receivers don't allow for CareTeam, which I would need.</p>",
        "id": 175482974,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1568242039
    },
    {
        "content": "<p>Face thus same dilemma for da Vinci alerts as well</p>",
        "id": 175483536,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568242717
    },
    {
        "content": "<p>We will be looking communication vis a vis messaging next week at the Hl7 wgm and I will bring this up.   It won’t change anytime right now though</p>",
        "id": 175483692,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568242826
    },
    {
        "content": "<p>You could include an extension instead of a value that included references to other resources as a short-term solution.</p>",
        "id": 175485808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568245160
    },
    {
        "content": "<p>Should I submit a change request for this?</p>",
        "id": 175538542,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1568301116
    },
    {
        "content": "<p>You could.  Also provide your use-case for the expansion of the list of resources.</p>",
        "id": 175553106,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568310579
    }
]