[
    {
        "content": "<p>If I have a FHIR Document, and I am carrying it in a FHIR Message (could be http response); do I have a Bundle within a Bundle?  That is, does the Bundle that contains the FHIR Document stay intact when it is inside the Bundle that contains the whole message?  </p>",
        "id": 153864766,
        "sender_full_name": "John Moehrke",
        "timestamp": 1482418414
    },
    {
        "content": "<p>yes you would put a bundle in a bundl;e</p>",
        "id": 153864796,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1482437203
    },
    {
        "content": "<p>so a FHIR Document is always contained in a Bundle... that is logical.  So then a Reference (pointer) to a FHIR document is to the Bundle, or to the Composition within that Bundle?</p>",
        "id": 153864799,
        "sender_full_name": "John Moehrke",
        "timestamp": 1482437594
    },
    {
        "content": "<p>well, probably the Bundle, depending on exactly what you want to reference</p>",
        "id": 153864806,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1482437887
    },
    {
        "content": "<p>I want to reference 'the document'... so is that the Bundle, or the Composition?</p>",
        "id": 153864819,
        "sender_full_name": "John Moehrke",
        "timestamp": 1482438646
    },
    {
        "content": "<p>For example: I have a DocumentReference pointing at a FHIR document...  Today when DocumentReference points at a CDA document, it is done by pointing at a Binary that contains the CDA.... Want a deterministic pattern for when it is a FHIR document vs CDA document</p>",
        "id": 153864820,
        "sender_full_name": "John Moehrke",
        "timestamp": 1482438729
    },
    {
        "content": "<p>if you want to point at the bundle - an authenticated collection of content, frozen in time - then you reference the bundle. If you want to refer to the collection of documents that are the set of versions of the same document - then you refer to the Composition</p>",
        "id": 153864822,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1482438867
    },
    {
        "content": "<p>so is a pointer to the Composition just pointing at the 'content'... where a formal 'document' only exists when it gets seralized into a Bundle?  Using the definition of 'document' principles:<br>\nPersistence – Documents are persistent over time. The content of the document does not change from one moment to another. A document represents information stored at a single instance in time. <br>\nWholeness - A document is a whole unit of information. Parts of the document may be created or edited separately, or may also be authenticated or legally authenticated, but the entire document is still to be treated as a whole unit. <br>\nStewardship –A document is maintained over its lifetime by a custodian, either an organization or a person entrusted with its care. <br>\nContext - A clinical document establishes the default context for its contents <br>\nPotential for authentication - A clinical document is an assemblage of information that is intended to be legally authenticated. </p>",
        "id": 153864823,
        "sender_full_name": "John Moehrke",
        "timestamp": 1482438874
    },
    {
        "content": "<p>okay, that is reasonable and logical...</p>",
        "id": 153864824,
        "sender_full_name": "John Moehrke",
        "timestamp": 1482438906
    },
    {
        "content": "<p>If I were to search for Message Bundles, and the messages are carrying Documents .. Would the returned SearchSet Bundle be a SearchSet Bundle, containing one or more Message Bundles, each containing a Document Bundle?</p>\n<p>(I'm not trolling -- we actually have a use case for this)</p>",
        "id": 210317169,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1600288552
    },
    {
        "content": "<p>The answer is yes, and given that your realize how strange that is in general, what is the particular use case?</p>\n<p>In order for a search to work, someone must post the message Bundle to a Bundle endpoint, where the message is NOT being processed - why would you do that?</p>",
        "id": 210322237,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1600291425
    },
    {
        "content": "<p>I have a system that posts messages for subsequent polling retrieval by recipients, so there's definitely a use-case for posting messages to a Bundle endpoint and <em>not</em> expecting them to be processed.  (Once successfully retrieved and custody taken, the receipient submits a batch delete to remove them from the intermediary repository.)</p>",
        "id": 210324092,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600292573
    },
    {
        "content": "<p>Async Messaging, where our FHIR server is an intermediary for senders and recipients. Senders will create Message Bundles (possibly containing a Document Bundle) and post it to the FHIR server, for the recipient to pick up. The recipients will search our server, and get a Searchset Bundle of all the Message Bundles (containing Document Bundles) intended for them. <a href=\"https://www.hl7.org/fhir/messaging.html#rest\">https://www.hl7.org/fhir/messaging.html#rest</a></p>",
        "id": 210334922,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1600301176
    },
    {
        "content": "<p>so you are re-inventing SMTP + POP/IMAP</p>",
        "id": 210379172,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600344283
    },
    {
        "content": "<p>well, everyone else does it</p>",
        "id": 210382818,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600346471
    },
    {
        "content": "<p>What this world needs is a new email protocol that has all the benefits of SMTP but is more Direct</p>",
        "id": 210386764,
        "sender_full_name": "David Pyke",
        "timestamp": 1600348293
    }
]