[
    {
        "content": "<p>Starting a thread about messaging</p>",
        "id": 153813929,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457151524
    },
    {
        "content": "<p>I got some comments at HIMSS about messaging. It seems to me it would be useful to add some sentence like this to the both the messaging page and MessageHeader page:  <br>\n\"Messaging and the MessageHeader describe a way to exchange data based ona store and forward architecture. In general, there is no need to use either in the context of a classic web orientated architecture implied by the use of a RESTful interface, and the RESTful interface provides alternative mechanisms for the same functionalty (RESTful interactions, named operations, pub-sub). Implementers wondering why messaging should be used should not, in general, choose to use messaging\"</p>",
        "id": 153813930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457151921
    },
    {
        "content": "<p>I'd be strongly in favor of such language. Even of going further with a specific mention of the <code>Subscription</code> resource (which can accomplish some messaging-like goals within FHIR's REST API pattern).</p>",
        "id": 153813933,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457153940
    },
    {
        "content": "<p>If I wrote those words, pub/sub would be a link to the subscription resource, but I suppose that since there's also _history, it would be necssary to link to something that explained both and their relationship</p>",
        "id": 153813935,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457155785
    },
    {
        "content": "<p>Ah. Some people consider exposing data for polling on <code>search</code> to be a form of publishing/subscribing.</p>",
        "id": 153813936,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457155891
    },
    {
        "content": "<p>ummmmmmm, well, maybe </p>",
        "id": 153813937,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457156083
    },
    {
        "content": "<p>Well, the suggested wording is negative in that it focuses on \"don't use this .. etc.\". How about creating a postive worded statement \"messaging can/should be used for xxxx\" - same effect as the above wording. What you aim to do is to provide advise as to when people should use what paradigm, but you'll have to do so in a paradigm-neutral fashion based on best practices, or otherwise both Messaging and Documents will (in future) contain the advise \"don't use this, only for Backwards compatibility reasons, use REST instead\". This may well be what the current RESTful fans would like the standard to state, but it doesn't reflect the current realities out there. Yes, add guidance, but phrase it as a positive sentence - whilst essentially conveying the same kind of content.</p>",
        "id": 153813939,
        "sender_full_name": "René Spronk",
        "timestamp": 1457164637
    },
    {
        "content": "<p>Well, what's xxxx in your statement? We're consistently getting a lot of confusion because people who know the web orientated architecture can't imagine what xxxx is</p>",
        "id": 153813945,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457180283
    },
    {
        "content": "<p>In all of our FHIR materials we have wording about when a particular paradigm is appropriate. For messaging the list tends to be </p>\n<p>Event driven <br>\nbehavioral expectation<br>\nAlways request/response<br>\nAsync option<br>\nLoosely coupled, worse case assumption<br>\nStuff other than CRUD<br>\nUnit of work = * resources</p>\n<p>So the only real question to answer is: when to use an operation, and when to use a message. That question is a bit more tricky, for (if carefully done) one could create an operation that mimicks the behavioural characteristics of a message.</p>\n<p>But I agree that someone with (solely) a web background will have a hard time understanding messaging and its purpose. So indeed we may wish to scare them away from messaging by noting that \"if you've never worked with messaging before, don't play with this at home.\" - too many undocumented assumptions in messaging. At least with REST one is aware that there is little in terms of assumptions as to how things are processed.</p>",
        "id": 153813949,
        "sender_full_name": "René Spronk",
        "timestamp": 1457184572
    },
    {
        "content": "<p>A couple more: Messaging allows server-driven orchestration (client sends a bunch of stuff, server decides what to create or update and in what order), it also supports routing</p>",
        "id": 153813973,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1457218420
    },
    {
        "content": "<blockquote>\n<p>Implementers wondering why messaging should be used should not, in general, choose to use messaging</p>\n</blockquote>\n<p>+1</p>",
        "id": 153814066,
        "sender_full_name": "James Agnew",
        "timestamp": 1457321071
    },
    {
        "content": "<p>And forward the comments to INM to assess and implement.</p>",
        "id": 153814162,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1457343699
    },
    {
        "content": "<p>Sure, though since this is about not:messaging, it's not purely just up to INM, I think </p>",
        "id": 153814163,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457343753
    },
    {
        "content": "<p>I can't see 'scaring someone away' when what they may need is more knowledge as being a net beneficial approach.</p>",
        "id": 153814164,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1457343902
    },
    {
        "content": "<p>well, it you want to write a book explaining this, go for it. But in the meantime, v2 style store and forward messaging is alien to most implementers, and we're just trying to manage them without having to completely educate them </p>",
        "id": 153814166,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457343981
    },
    {
        "content": "<p>I think we should encourage exploration of using FhIr resources and profiles in a messaging context and see what we can learn from those endeavors.  The standard claims it supports such an exchange style and if so we should encourage such exploration.</p>",
        "id": 153814196,
        "sender_full_name": "Brian Pech",
        "timestamp": 1457367205
    },
    {
        "content": "<p>In England we developing both messaging and RESTful solutions for different scenarios. There are many reasosn that cause us to choose one solution over the other.</p>",
        "id": 153814201,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1457370659
    },
    {
        "content": "<p>It's fine if you want to, and we have no intent of removing it, though it's the one section that attracts people demanding us to remove it since it demonstrates that we have no architectural understanding, and because it creates confusion for a whole swath of stakeholders. I am just trying to deal with the confusion </p>",
        "id": 153814212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457377358
    },
    {
        "content": "<p>I don't see how having a section on Messaging 'demonstrates that we have no architectural understanding'. We have content models to support the information the business needs to be conveyed. Those content models can be exchanged over a variety of exchange protocols. Different business have different architectures and so one picks an exchange protocol which suits the business - and as Richard points out above many factors may be considered in that assessment. </p>",
        "id": 153814325,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1457414468
    },
    {
        "content": "<p>I didn't say I thought we had a lack of architectural understanding. I'm just telling you what people say. You can deny their reality if you want. </p>",
        "id": 153814326,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457414549
    },
    {
        "content": "<p>the problem that i'm trying to deal with is that many implementers have no framework in which to understand messaging, and get really confused when it turns out that there's other ways to do the same things as messaging, and then they end up misusing it because it's there and they somehow feel as though they're not doing things properly if they don't use it somehow </p>",
        "id": 153814327,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457414644
    },
    {
        "content": "<p>It sounds like education on 'the tools of the trade' is lacking. I'll try to engage INM, ITS, Brian, Rene, Richard to see what could be added into the FHIR spec. It may just be links to existing HL7 or other external information on messaging or information exchange paradigms.</p>",
        "id": 153814329,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1457415631
    },
    {
        "content": "<p>sure. make it hard for everyone. </p>",
        "id": 153814330,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457415664
    },
    {
        "content": "<p>or maybe we could add my original proposal with a link to somewhere to go for that kin of information</p>",
        "id": 153814331,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457415679
    },
    {
        "content": "<p>Huh? Hard? Isn't links what I concluded with?</p>",
        "id": 153814332,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1457415720
    },
    {
        "content": "<p>you appeared to disagree with my simple wording and proposed links instead </p>",
        "id": 153814333,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457415765
    },
    {
        "content": "<p>I think we would do the community a better service by providing some education or links to material or sample consideratons and not by saying 'Implementers wondering why messaging should be used should not, in general, choose to use messaging AND implementers wondering why RESTful designs should be used should not, in general, choose to use REST'.</p>",
        "id": 153814334,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1457416293
    },
    {
        "content": "<p>see, you did. as usual, you are complicating everything and making everything hard for everyone</p>",
        "id": 153814335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457416372
    },
    {
        "content": "<p>FHIR provides many options to cover any specific use case, without expressing a preference 'because it's up to the implementer/context'. Are we ready to express a preference, by stating that one paradigm is preferred over another one? I wouldn't wish to go there. In our FHIR material we mainly talk about REST (FHIR was designed with REST in mind), but cover the other paradigms as well. The rationale for using one paradigm or another can be reasonably well documented. But such a rationale may well be on the wiki and not part of the spec.</p>",
        "id": 153815125,
        "sender_full_name": "René Spronk",
        "timestamp": 1457689910
    },
    {
        "content": "<p>I dont have a problem with a warning for the '80%': \"should you have a REST background, then please consider using transactions and/or operations instead of messaging\" works for me. Yes, one can add a link with the underlying rationale.</p>",
        "id": 153815126,
        "sender_full_name": "René Spronk",
        "timestamp": 1457690007
    },
    {
        "content": "<p>We will need some documentation for those with a messaging background as to how one can cover the same functionality (if possible at all) using transactions and operations.</p>",
        "id": 153815129,
        "sender_full_name": "René Spronk",
        "timestamp": 1457690337
    },
    {
        "content": "<p>Right. We're not trying to disparage it, just save confusion for the rest guys</p>",
        "id": 153815144,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457693429
    },
    {
        "content": "<p>I would like to point out that there are interested parties who are hoping to use FHIR resources in exchange scenarios that use a paradigm other than REST. Paul is not trying to make things complicated but to point out these other uses. I'll grant there has not been a substantial exploration of these other paradigm but I am aware of several parties interested in  this area.</p>",
        "id": 153815686,
        "sender_full_name": "Brian Pech",
        "timestamp": 1458062735
    },
    {
        "content": "<p>we have no problem with that, and will continue to support that. We're just trying to deal with the confusion that many people have expressed to me about message header - it's a paradigm thing. People who understand HL7 v2 are never confused about it, and people who don't find it really confusing, and we want something simple to say about that</p>",
        "id": 153815692,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458065962
    },
    {
        "content": "<p>it's proving hard to get any progress on this because the messaging people are overly sensitive about this, I think</p>",
        "id": 153815693,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458065995
    },
    {
        "content": "<p>These are people who have never encountered a message paradigm in any of their work/studies? That's unfortunate.</p>",
        "id": 153815696,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1458066826
    },
    {
        "content": "<p>yep. </p>",
        "id": 153815697,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458066877
    },
    {
        "content": "<p>Weird - I thought they were web savvy.</p>",
        "id": 153815698,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1458066899
    },
    {
        "content": "<p>we require everyone who is educated to know all that we know</p>",
        "id": 153815701,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458066961
    },
    {
        "content": "<p>No, just thought they'd at least be familiar with TCP/IP.</p>",
        "id": 153815703,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1458067255
    },
    {
        "content": "<p>I think it's safe to say that there are lots of people building applications these days who have never dealt with anything resembling \"messaging\" in the sense that HL7 uses the term</p>",
        "id": 153815706,
        "sender_full_name": "James Agnew",
        "timestamp": 1458069526
    }
]