[
    {
        "content": "<p>We are looking at a potential use case for MessageDefinition in STU3. For us, if our message content is a FHIR document (so that the MessageHeader.focus  points to the FHIR Document Bundle) what should go in MessageDefinition.focus.profile ?</p>",
        "id": 153922709,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1512328938
    },
    {
        "content": "<p>Bundle</p>",
        "id": 153922713,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512330939
    },
    {
        "content": "<p>Thanks Lloyd, thought as much. Not sure this will actually help anyone in our case so we'll look to extend so as to add more details on the actual content used.</p>",
        "id": 153922748,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1512374957
    },
    {
        "content": "<p>Well, you could include a tighter profile of Bundle that reflects your document constraints</p>",
        "id": 153922774,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512396978
    },
    {
        "content": "<p>We could but a profile of bundle that represents all of what can be in the document bundle does not seem to add anything for us as it would probably just end up being an entry sliced dozens of different ways. What we are looking for is something that helps in describing the profiles used in the exchange of certain messages.</p>",
        "id": 153922848,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1512424234
    },
    {
        "content": "<p>GraphDefinition?</p>",
        "id": 153922878,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512444121
    },
    {
        "content": "<p>We're supposed to move to that but haven't yet.</p>",
        "id": 153922882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512444367
    },
    {
        "content": "<p>GraphDefinition may be an option in the future but we are only looking st STU3 at the moment.</p>",
        "id": 153922942,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1512475050
    },
    {
        "content": "<p>GraphDefinition exists in STU3, though you'd need an extension to point to it.  You could still experiment with it if you wished.</p>",
        "id": 153922987,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512489509
    }
]