[
    {
        "content": "<p>hello all, as of now we used restful calls. But in fhir we have Operations,Messaging,Subscription. i'm not understanding in which scenarios use what? so please any suggestions?  </p>\n<p>Thank you.</p>",
        "id": 153894484,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1497935580
    },
    {
        "content": "<p>See <a href=\"http://build.fhir.org/foundation-module.html#uses\" target=\"_blank\" title=\"http://build.fhir.org/foundation-module.html#uses\">http://build.fhir.org/foundation-module.html#uses</a></p>",
        "id": 153894531,
        "sender_full_name": "René Spronk",
        "timestamp": 1497951619
    },
    {
        "content": "<p>Thank you @Rene Spronk, here they have not given much info, i'm not understanding the real time scenarios, in which situation what we use?</p>",
        "id": 153896298,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1499403865
    },
    {
        "content": "<p>Messaging works well for asynchronous communication and for indirect/routed communication.  It also works well when you have a request/response behavior and want to communicate in a single (potentially large) burst rather than a bunch of small transmissions.  Documents work when you care about strict control of human-readability, authentication and what data gets persisted (and you don't have any behavior such as \"please do this\").  Services work well for decision support where you're doing something not covered by a RESTful operation.  Subscription isn't really a paradigm for exchange, it's just an alternate mechanism for getting query results that avoids repeatedly polling.  Keep in mind that both messaging and operations are going to require more discussion between the communicating parties as they need a lot more definition than simple REST does</p>",
        "id": 153896349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499439504
    },
    {
        "content": "<p>tnq <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153896576,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1499773952
    },
    {
        "content": "<p>When implementing messaging via subscription (PUSH messages) - even though it's not a strict pattern to follow, I'm still getting hung up on which resources would be involved.  MessageHeader or MessageDefinition?  Is there a reason to choose one over the other?</p>",
        "id": 153896616,
        "sender_full_name": "Ken Melms",
        "timestamp": 1499799373
    },
    {
        "content": "<p>See my response on the <a href=\"https://chat.fhir.org/#narrow/stream/implementers/subject/FHIR.20and.20ADT\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/subject/FHIR.20and.20ADT\">ADT thread</a></p>",
        "id": 153896626,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499802551
    }
]