[
    {
        "content": "<p>I'm currently trying to figure out what would be the suitable FHIR object to store additional information about an Observation.<br>\nThe way i see it, an Observation can be seen as a record (a code, a timestamp and a value) but what if i need to add some custom information (metadata) regarding a specific Observation type (like weight or size).<br>\nI could add these custom properties as extensions, but since theses properties are metadata that would force the server to send bigger Observation objects containing the same information for every Observation of the same type again and again.</p>\n<p>Is there a FHIR object specifically designed to hold metadata like ObservationMetadata or ObservationDefinition?<br>\nI thought about :<br>\n- StructureDefinition and ElementDefinition but i don't think it can be extended<br>\n- CodeSystem and ValueSet, i'm not sure it could be use to fulfill that need<br>\n- Use Observation.related not to group but to define to a Observation object holding metadata only (no value).<br>\nWhat would you advice?</p>\n<p>Thanks!</p>",
        "id": 153952305,
        "sender_full_name": "Romain LECOLE",
        "timestamp": 1523647868
    },
    {
        "content": "<p>You can see a draft here: <a href=\"http://build.fhir.org/observationdefinition.html\" target=\"_blank\" title=\"http://build.fhir.org/observationdefinition.html\">http://build.fhir.org/observationdefinition.html</a></p>",
        "id": 153952306,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523648874
    },
    {
        "content": "<p>Feedback welcome :)</p>",
        "id": 153952307,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523648878
    },
    {
        "content": "<p>'but what if i need to add some custom information (metadata) regarding a specific Observation type (like weight or size).' </p>\n<p>I don't  understand,  can you give a concrete example.   Obs def defines the attrbutes of a specific type of observation. ( e.g. when is performed, how much is costs,  description, references etc)   If you need more context for a specific instance use <code>Obs.components</code></p>",
        "id": 153952359,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523664628
    },
    {
        "content": "<p>That's great thank you very much, i wasn't aware ObservationDefinition was actually a Draft under consideration. <br>\nIt's pretty much what i was looking for but... <br>\nWhat would you recommend if i wanted to specialize ObservationDefinition per Patient?<br>\nObservationDefinition contains values that could potentially vary from one Patient to another.<br>\nMaybe a reference property targeting a Patient could be added on ObservationDefinition object in order to link Patient and ObservationDefinition (just like Observation and Patient already are with the \"subject\" property)?<br>\nBut perhaps it wouldn't be the way this resource has been originally intended to be used?<br>\nThank you for your answer.</p>",
        "id": 153952422,
        "sender_full_name": "Romain LECOLE",
        "timestamp": 1523844012
    },
    {
        "content": "<p>With Obs def, do you mean <a href=\"http://build.fhir.org/observationdefinition.html\" target=\"_blank\" title=\"http://build.fhir.org/observationdefinition.html\">http://build.fhir.org/observationdefinition.html</a>?<br>\nIf you do, yes that's pretty much what i was looking for (quantitativeDetails and qualifiedInterval for instance).</p>",
        "id": 153952423,
        "sender_full_name": "Romain LECOLE",
        "timestamp": 1523844688
    },
    {
        "content": "<p>re:  </p>\n<p>\"What would you recommend if i wanted to specialize ObservationDefinition per Patient?<br>\nObservationDefinition contains values that could potentially vary from one Patient to another.\"</p>\n<p>I would think that would live on Observation since that would be an instance and not a type of observation.</p>",
        "id": 153952424,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523845463
    },
    {
        "content": "<p>Any patient-specific metadata would be time-specific.  The parameters relevant for an infant vs. ten-year-old vs. 40-year-old vs. 80-year-old would all be different.  If you wanted to capture something broader than each individual Observation, i'd recommend CarePlan.</p>",
        "id": 153952425,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523846476
    },
    {
        "content": "<p>Thank you both for your answers!</p>",
        "id": 153952630,
        "sender_full_name": "Romain LECOLE",
        "timestamp": 1523965517
    }
]