[
    {
        "content": "<p>Question to group regarding applying the <a href=\"http://meta.security\">meta.security</a> labels to each resource profile. <a href=\"http://hl7.org/fhir/R4/valueset-security-labels.html\">http://hl7.org/fhir/R4/valueset-security-labels.html</a> Question is, what implementation are you all using to apply the labels. There are no value sets defined for populating them that I could find. For example, HIV/AIDs - I would expect there to be a clear value set or implementation guide on flagging that, not all of us figuring it out on our own.</p>",
        "id": 224772444,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612205250
    },
    {
        "content": "<p>What's the question?</p>",
        "id": 224772629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612205335
    },
    {
        "content": "<p>Edited to include question, curious to see what others have found or are implementing on the topic</p>",
        "id": 224773635,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612205750
    },
    {
        "content": "<p>Application of security labels is in it's infancy.  With the voluntary use within the US, many developers have chosen to focus on other methods of data filtering and segmentation</p>",
        "id": 224773855,
        "sender_full_name": "David Pyke",
        "timestamp": 1612205832
    },
    {
        "content": "<p>Where does it say use is voluntary? HIPAA laws in the US apply to the subject areas within these security labels.</p>",
        "id": 224774850,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612206227
    },
    {
        "content": "<p>Basic sensitivity labelling is needed per HIPAA but the level that the valueset defines goes beyond that and the ONC Rule left it voluntary and many orgs are looking at simple labels and filtering at source</p>",
        "id": 224775100,
        "sender_full_name": "David Pyke",
        "timestamp": 1612206335
    },
    {
        "content": "<p>Interesting. Filtering at source I would think could put at risk for information blocking. For example, some states have specific data sharing laws for certain types of data. Behavioral Health, Reproductive health of minors (some states don't allow birth control script to be seen by parent). HIV AIDs. I would have expected others would be implementing these tags</p>",
        "id": 224777228,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612207230
    },
    {
        "content": "<p>Filtering sensitive data is normally done  and released with specific request (BTG or specific request with specific, often out of band, sign-off).  Data labelling has a high cost to implement.</p>",
        "id": 224779666,
        "sender_full_name": "David Pyke",
        "timestamp": 1612208233
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"379418\">@Donna Lehr</span>  have you looked at the page in the FHIR core that discusses this?<br>\n<a href=\"http://build.fhir.org/security-labels.html\">http://build.fhir.org/security-labels.html</a><br>\nhave you reviewed the HCS documentation outlined in <a href=\"http://build.fhir.org/security-labels.html#hcs\">http://build.fhir.org/security-labels.html#hcs</a></p>\n<p>You might find the report out from DS4P tracks at the FHIR-Connectathon to be informative<br>\n<a href=\"https://confluence.hl7.org/display/SEC/Report+Out%3A+Security+Labeling+Track+Connectathon+24\">https://confluence.hl7.org/display/SEC/Report+Out%3A+Security+Labeling+Track+Connectathon+24</a></p>",
        "id": 224793965,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612215025
    },
    {
        "content": "<p>You should also look to the <a class=\"stream\" data-stream-id=\"179247\" href=\"/#narrow/stream/179247-Security-and-Privacy\">#Security and Privacy</a> zulip stream</p>",
        "id": 224794045,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612215062
    },
    {
        "content": "<p>Not data labeling properly has a higher cost for HIPAA fine than taking the time to implement correctly. Also overly filtering at the source and information blocking has a fat fine too. Food for thought. <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> </p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  Thank you, yes I have reviewed those resources. It defines all the possible tags that can be applied, however it does not direct on an approved value set to implement the tags. If we are tagging restricted drugs for example, where is the value set that tells me which drugs to restrict? If we are restricting specific behavioral health data, or limited to how that is shared- which diagnosis/procedure codes value set do we use to apply the tag. This should be clearly defined.</p>",
        "id": 224806488,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612220681
    },
    {
        "content": "<p>Curious, is anyone on this channel implementing these- and are there any helpful resources you can share with the group?</p>",
        "id": 224806725,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612220806
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>   I take back my statement, I had not seen the Connectathon sources. I dug a little deeper and found one IG- I am looking closer now. Thanks for the resource. <a href=\"https://github.com/HL7/us-security-label-regs\">https://github.com/HL7/us-security-label-regs</a></p>",
        "id": 224807532,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612221393
    },
    {
        "content": "<p>yes. FHIR Core is universal, so it can't declare things like how to tag for USA... yet a USA specific implementation guide can.. and even it can't know the clinical codes you use within your organization. That is why we defined a generic Service Labling Service to do that assessment of data, likely leveraging not just code matching but also clinical machine learning.</p>",
        "id": 224816003,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612227131
    },
    {
        "content": "<p>Interesting, thank you <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>   for all your insight. Can you, or anyone on this channel recommend a US implementation guide that includes value sets for these tags, if that even exists. I understand implementation may very by state, any resources are appreciated. The Connectathon that <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> provided did have some useful content.</p>",
        "id": 224913268,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612290027
    },
    {
        "content": "<p>That is under development. Follow that last github repo.</p>",
        "id": 224913620,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612290179
    },
    {
        "content": "<p>I see! When is this expected to be complete would you estimate? If you are unsure do you know who I could contact regarding this? <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 224915159,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1612290699
    },
    {
        "content": "<p>It is under development, going through ballot reconsilliation. The likely is this year. I would like to see a second ballot, but that is not clear right now.</p>",
        "id": 224932305,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612297982
    },
    {
        "content": "<p>Any update yet on release?</p>",
        "id": 228022007,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614389181
    }
]