[
    {
        "content": "<p>The definition of meta.source seems to indicate that it is the predecessor version of the resource (this is what Provenance.entity.what) would be. </p>\n<p>However I was under the understanding that it would tend to just hold the root URL of the FHIR Server from which the data was originally published. This would be useful when one imports externally authored Resources.  </p>\n<p>I would tend to read this differently than entity.what. In fact I might argue that this is closer to Provenance.agent.who where who is an Organization (that exported).</p>\n<p>I might want to put a URI of the originating system..</p>\n<p>So I am not sure what is appropriate, what was intended, how it is used elsewhere... and if any of that should be used to modify the definition of the element.</p>\n<p>How are others using this?</p>",
        "id": 222075767,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610114951
    },
    {
        "content": "<p>meta.source is definitely not the predecessor.  It's generally the system (or some system descriptor) about where the data came from.  It's primarily useful when there's a need to know the subsystem or third-party system where data came from.</p>",
        "id": 222078185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610116212
    },
    {
        "content": "<p>You could certainly propose a clarification of the wording</p>",
        "id": 222078235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610116238
    },
    {
        "content": "<p>Would meta.source be more appropriately mapped to Provenance.entity.agent?</p>",
        "id": 222083173,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1610118769
    },
    {
        "content": "<p>so <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I am hearing you say that the meta.source would be more likely the root URL of the FHIR server from which this resource came. So if the original Resource was</p>\n<div class=\"codehilite\"><pre><span></span><code>http://example.org/fhir/Observation/1\n</code></pre></div>\n<p>and I imported that into my system, then I would set the meta.source on my copy as </p>\n<div class=\"codehilite\"><pre><span></span><code>http://example.org/fhir\n</code></pre></div>\n<p>This is what I thought it was... until I read the text</p>",
        "id": 222083501,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610118953
    },
    {
        "content": "<p>Not necessarily the root URL.  Could just be a URI that represents the source.</p>",
        "id": 222087192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610120774
    },
    {
        "content": "<p>The source might not even be FHIR-enabled</p>",
        "id": 222087208,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610120786
    },
    {
        "content": "<p>good. I agree.</p>",
        "id": 222094037,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610123863
    },
    {
        "content": "<p>we have a case where it is an XCA HomeCommunityID... which is an identifier, which can be easily represented as a URI</p>",
        "id": 222094142,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610123913
    },
    {
        "content": "<p>do others agree? Is this consistent with the way HAPI uses it? Is this consistent with how other reference implementations use it?</p>",
        "id": 222094198,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610123951
    },
    {
        "content": "<p>poke... would like others to comment on this use of meta.source</p>",
        "id": 233557350,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617827954
    }
]