[
    {
        "content": "<p>Hello,</p>\n<p>I would like to know which FHIR release version is relevant for MHD at this year's Europe Connectathon. Is it R3 or R4? The new MHD Supplement is currently published for Public Comment and as far as I understood, the Trial Implementation publication target is set for March 1st. But that wouldn't leave much space for changes until the beginning of this year's EU Connectathon. So does R3 remain relevant for MHD, or do we have to switch to R4 for CAT?</p>\n<p>Many thanks,<br>\nDavid</p>",
        "id": 155261381,
        "sender_full_name": "David Burca",
        "timestamp": 1547652184
    },
    {
        "content": "<p>IHE Connectathon next week will be testing the STU3 version of all of the IHE Profiles that leverage FHIR. There is an oustanding Public Comment ballot on a small first set of profiles to align with FHIR R4. Once that is approved then IHE Connectathon will move to those specified profiles. <br>\nThat said, you might be able to find peer-to-peer partners willing to test R4...</p>",
        "id": 155262763,
        "sender_full_name": "John Moehrke",
        "timestamp": 1547653153
    },
    {
        "content": "<p>Thanks for the answer, but let me reformulate the question: Which FHIR Release version (R3 or R4) is going to be used for MHD at this year's EU Connectathon? I am currently implementing the MHD profile and I want to know which version I should stick to.</p>",
        "id": 156693714,
        "sender_full_name": "David Burca",
        "timestamp": 1548254573
    },
    {
        "content": "<p>I would like to say that it would be the FHIR R4 version, but I am not close enough to the test tools team to know that they will be able to revise. Typically they are fast to change after these public comment revisions.</p>",
        "id": 156696267,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548256475
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 156802672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548361019
    },
    {
        "content": "<p>A bit of an update... Given that MHD and the other priority set, will be finishing the Public Comment resolution at very best March 1; the time difference between that and EU Connectathon is too short. So EU Connectathon will formally be testing the STU3 flavor of ALL of the IHE profiles. Anyone bringing a R4 flavor will likely just be doing cross-testing with peers also supporting R4.</p>",
        "id": 156806910,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548364526
    }
]