[
    {
        "content": "<p>Do we have any good examples of micro reports/observations structure? I see a few links out to a possible dead example on the current build ( <a href=\"https://hl7-fhir.github.io/diagnosticreport-micro1.html\" target=\"_blank\" title=\"https://hl7-fhir.github.io/diagnosticreport-micro1.html\">https://hl7-fhir.github.io/diagnosticreport-micro1.html</a> ), but I also can't tell if the results would have been realistic.</p>",
        "id": 153842202,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1470253976
    },
    {
        "content": "<p>Or any good previous discussions somewhere? :)</p>",
        "id": 153842203,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1470253997
    },
    {
        "content": "<p>I thought micro1 example was solid. I don't now what it was removed. I'll investigate</p>",
        "id": 153842217,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470255889
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/diagnosticreport-micro1.xml.html\" target=\"_blank\" title=\"http://hl7.org/fhir/diagnosticreport-micro1.xml.html\">http://hl7.org/fhir/diagnosticreport-micro1.xml.html</a></p>",
        "id": 153842218,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470255935
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 153842226,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1470257376
    },
    {
        "content": "<p>its coming back in the build. </p>",
        "id": 153842230,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470259004
    },
    {
        "content": "<p>its baaack and it is taken from a V2 example.   Its  all contained.  I can dig up a graphic  I made of it to show the nesting.  If you need it.  </p>",
        "id": 153842460,
        "sender_full_name": "Eric Haas",
        "timestamp": 1470350102
    },
    {
        "content": "<p>thanks! the graphic might be helpful if you have it</p>",
        "id": 153842461,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1470351273
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/WpBJc7PsTnAlwi_G8Gk_pVAW/culture-with-susc-fhir-diagram.png\" target=\"_blank\" title=\"culture-with-susc-fhir-diagram.png\">culture-with-susc-fhir-diagram.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/WpBJc7PsTnAlwi_G8Gk_pVAW/culture-with-susc-fhir-diagram.png\" target=\"_blank\" title=\"culture-with-susc-fhir-diagram.png\"><img src=\"/user_uploads/10155/WpBJc7PsTnAlwi_G8Gk_pVAW/culture-with-susc-fhir-diagram.png\"></a></div>",
        "id": 153843871,
        "sender_full_name": "Eric Haas",
        "timestamp": 1471048121
    },
    {
        "content": "<p>Lots of chatter within OO about creating a profile for micro.   </p>",
        "id": 153843873,
        "sender_full_name": "Eric Haas",
        "timestamp": 1471048165
    },
    {
        "content": "<p>Note:  there is no result value for one (and actually more)of the antibiotics because it is a R (Resistant).</p>",
        "id": 153843887,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1471238143
    },
    {
        "content": "<p>There is also this model which was done as part of the Australian RCPA standardisation work. It's PDF of a mind map.</p>",
        "id": 153843889,
        "sender_full_name": "Michael Osborne",
        "timestamp": 1471242582
    },
    {
        "content": "<p><a href=\"http://www.rcpa.edu.au/getattachment/5d6ebd13-eace-4074-bb03-6f7f5252c5a1/APUTS-Urine-Microbiology-Reporting-Information-Mod.aspx\" target=\"_blank\" title=\"http://www.rcpa.edu.au/getattachment/5d6ebd13-eace-4074-bb03-6f7f5252c5a1/APUTS-Urine-Microbiology-Reporting-Information-Mod.aspx\">http://www.rcpa.edu.au/getattachment/5d6ebd13-eace-4074-bb03-6f7f5252c5a1/APUTS-Urine-Microbiology-Reporting-Information-Mod.aspx</a></p>",
        "id": 153843890,
        "sender_full_name": "Michael Osborne",
        "timestamp": 1471242589
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> A few comments on the diagram.  I find the \"Staphylococcus aureus Panel\" organization to be a bit odd - you end up with stating \"Staph aureus\" at two different levels.  Related to that, I've certainly seen it reported this way before, but it's not obvious to me why having a separate CULTPOSNEG observation is very useful.  I think you can do the same thing easier and just as consistently using Observation.interpretation = POS or NEG at the \"culture\" level.  With that, I think you should be able to collapse the \"Culture  Result Part 1 obs\" at the level of the \"\"panel\" Obs\" (as just mentioned) and the \"Culture Result Part 2 obs\" at the \"culture\" (DR?) level.  Then I believe it will look a little more like <span class=\"user-mention\" data-user-id=\"192047\">@Michael Osborne</span>'s diagram (and pretty similar to the V3 Lab Result model work on micro).</p>",
        "id": 153843999,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1471317595
    },
    {
        "content": "<p>I would not get stuck on the details. the example is taken from a  v2 messsage instance and I've seen it reported that way on occasion.  Here is an overview of the pattern.  </p>\n<p><a href=\"https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki\" target=\"_blank\" title=\"https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki\">https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki</a></p>",
        "id": 153844040,
        "sender_full_name": "Eric Haas",
        "timestamp": 1471468001
    },
    {
        "content": "<p>I would not get stuck on the details. the example is taken from a  v2 messsage instance and I've seen it reported that way on occasion.  Here is an overview of the pattern.  </p>\n<p><a href=\"https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki\" target=\"_blank\" title=\"https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki\">https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki</a></p>",
        "id": 153844078,
        "sender_full_name": "Eric Haas",
        "timestamp": 1471468018
    },
    {
        "content": "<p>but the details is the question, is it not? </p>",
        "id": 153844125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471471773
    },
    {
        "content": "<p>no its not  labs report other stuff alongside the organisim observations ,  gram stains ,colony counts, whether is isolated or not  I think we can put them in a category  of  \"other stuff\"  and treat them all the same.  I don't think we should be debating what they report.   On the other hand, the actual sensitivities measurements are a separate category and should be represented like you did in the example.   I'm trying to establish a structural pattern and then we can worry about the terminology separately.     In direct response to <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  collapsing down to the DR level only workswhen you don't have a coinfection, but in the general case you need the extra layer.</p>",
        "id": 153844132,
        "sender_full_name": "Eric Haas",
        "timestamp": 1471472399
    },
    {
        "content": "<p>I think that's only partially true, <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> - I think I misread the way you intended org1, org2 org3, which you are showing as references at the DR level.  But I still think my comments make sense.  It would probably help to look at the original v2 message and see what they actually did.  I will say again that I also have seen it reported this way (using CULTPOSNEG), but we might want to look again at the actual nesting in v2.  It still doesn't make much sense to me to have CULTPOSNEG except at the \"culture\" level.  If you have at least one organism (isolate) identified (other than \"normal flora\"), then the culture is positive, and it doesn't help to repeat CULTPOSNEG = POS for each separate organism.  What seems probably most unusual to me, though, is identifying the organism (i.e. \"staph aureus\") at two separate and adjacent levels.  Instead I would probably use something more generic like \"org1\" at the \"'panel' Obs\" level and only identify \"staph aureus\" at the \"Culture Result Part 1 obs\" level.  </p>\n<p>But, with all that said, I will concede that it is certainly possible to do it this way, and that's undoubtedly what some labs actually do, and if they do it will still be understandable and not \"wrong\" (even though redundant).  So I don't have a serious argument with it, other than that I don't think this is going to be one of the most common approaches that labs use, and I think it certainly isn't the simplest and clearest example (especially if it's used as a model).</p>",
        "id": 153844144,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1471475404
    },
    {
        "content": "<p>posted an <a href=\"http://healthedatainc.com/go-ftp/micro/\" target=\"_blank\" title=\"http://healthedatainc.com/go-ftp/micro/\">alternative model</a> which flattens out the structure. based on last weeks OO on FHIR call.  There is also an example taken from the v2 LRI guide.</p>",
        "id": 153845370,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472451861
    },
    {
        "content": "<p>How would you go about indicating that some of the Antibiotic sensitivities are reportable to a FP/GP/Primary Care doctor for general use, and others are restricted - or only reported in Infection Control scenarios? What about the Urine M/C/S scenario - I didn't see any chemistry (e.g. Glucose/Ketones/Blood) or Inhibitors present or even Leukocytes/Erythrocytes/epithelial cells. Still much to debate about this model I think.</p>",
        "id": 153845381,
        "sender_full_name": "Michael Osborne",
        "timestamp": 1472464365
    },
    {
        "content": "<p>I am limiting this to C&amp;S reports only..  I would expect there to be a separate DR for chemistry and cbc  UA   ( superpanels or \"Panel of panels\") as they are typicallyproduced separately and not lumped together in a single report - but rather aggregated.  They are ordered separately or bundled as convenience \"Profiles\" but the lab treats them as separate things.   We haven't really discussed  this but the DR could be bundled based on a common order or some other group identifier if  you have one.  </p>",
        "id": 153845434,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472484780
    },
    {
        "content": "<p>I'm certain there is a way to restrict access to some results and not others  maybe  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  or <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  could chime in here.  But  I am not familiar with that use case?  Why would you hide results from the practitioner or patient?  (Unless its a presumptive BSE or H5 influenza or something with devastating impact if leaked prematurely.)</p>",
        "id": 153845436,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472485202
    },
    {
        "content": "<p>There is a capability built into FHIR Resource model to individually tag each instance of each Resource. These \"Security-Tags\" can be used by Access Control decision/enforcement systems to prevent inappropriate access. We have written this up on the Security/Privacy module, although admit we have not yet communicated well. <a href=\"http://hl7-fhir.github.io/secpriv-module.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/secpriv-module.html\">http://hl7-fhir.github.io/secpriv-module.html</a>  Welcome ballot (or non-ballot) comments and suggestions.</p>",
        "id": 153845437,
        "sender_full_name": "John Moehrke",
        "timestamp": 1472485564
    },
    {
        "content": "<p>There are some medical-ethics use-cases that would defer disclosing specifically tragic results to a patient until the GP has had a one-on-one discussion. </p>",
        "id": 153845438,
        "sender_full_name": "John Moehrke",
        "timestamp": 1472485617
    },
    {
        "content": "<p>specifics of security-tags most fully in the FHIR spec at <a href=\"http://hl7-fhir.github.io/security-labels.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/security-labels.html\">http://hl7-fhir.github.io/security-labels.html</a></p>",
        "id": 153845439,
        "sender_full_name": "John Moehrke",
        "timestamp": 1472485681
    },
    {
        "content": "<p>I have more on my blog <a href=\"https://healthcaresecprivacy.blogspot.com/p/topics.html#FHIR\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/p/topics.html#FHIR\">https://healthcaresecprivacy.blogspot.com/p/topics.html#FHIR</a></p>",
        "id": 153845440,
        "sender_full_name": "John Moehrke",
        "timestamp": 1472485727
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  </p>",
        "id": 153845441,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472489466
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> re: use case for issuing limited antibiotics to clinicians: In a large state-wide based laboratory information system that I used to be manager of, the labs would test for a wide range of antibiotics against the bacteria that were known to develop resistance.  The labs would report the first line antibiotics to the clinician and record the susceptibilities for the next range of antibiotics in the system which would only be viewable to the hospital medical microbiologists (pathologists) and infection disease physicians. If the non-specialist clinician wanted a \"newer\" antibiotic they would have to contact the lab or the infection diseases clinician to discuss the case.  The purpose was to reduce the inappropriate use of newer antibiotics. FYI - it's been nearly 10 years since I was involved with that system, so things may have changed, but that was the case then.</p>",
        "id": 153845473,
        "sender_full_name": "David McKillop",
        "timestamp": 1472512218
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192323\">@David McKillop</span>  yes that was my exact use case. If I just wanted to present one fhir server to the general public/doctors/Public Health and limit what antibiogram was released depending on the client. The tight controls around antimicrobial use is why Australia has such comparatively low levels of super bugs such as Carbepenam (Merepenam) resistant Enterobacteraceae and Pseudomonas. </p>",
        "id": 153845633,
        "sender_full_name": "Michael Osborne",
        "timestamp": 1472546747
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"192323\">@David McKillop</span> and <span class=\"user-mention\" data-user-id=\"192047\">@Michael Osborne</span>, that is exactly the use case that I've seen, as well.  It's very common practice in ID practice and infection control.  In V2, these \"suppressed results\" are typically flagged in OBX-13.  From the V2.8.2 spec:</p>\n<p>7.4.2.13 OBX-13 User Defined Access Checks (ST) 00581<br>\nDefinition: This field permits the producer to record results-dependent codes for classifying the observation at the receiving system. This field should be needed only rarely, because most classifications are fixed attributes of the observation ID and can be defined in the associated observation master file (see description in Chapter 8).<br>\nHowever, there are a few cases when such controls vary with the value of the observation in a complex way that the receiving system would not want to re-calculate. An example is an antimicrobial susceptibility result. Some systems prefer to display only the susceptibility results of inexpensive antimicrobials depending upon the organism, the source of the specimen and the patient's allergy status. The sending service wants to send all of the susceptibilities so that certain privileged users (e.g., Infectious Disease specialists) can review all of the results but non-privileged users would see only the \"preferred\" antimicrobials to which the organism was susceptible. We expect that other cases also occur.</p>",
        "id": 153845782,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1472558995
    },
    {
        "content": "<p>In any case the tagging of the resource instances seems like the best approach for FHIR resources.  </p>",
        "id": 153845847,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472581307
    },
    {
        "content": "<p>I've updated the \"MicroReport IG\"  to flesh out how to report C&amp;S after some discussions on the OO on FHIR call.  It is US Realm based and was a chance to derive some Lab profiles based on the US-core profiles and the V2 LRI guides.. ( so a couple of things going on here).  This use case is a helpful to illustrate the idea of creating a set of lab models and applying them to specific use case.  I took a bunch of shortcuts and it certainly more a proof of concept with the idea in mind to help show whether can or need to align the LRI work with US-Core and CIMI.     </p>",
        "id": 153850702,
        "sender_full_name": "Eric Haas",
        "timestamp": 1474848759
    },
    {
        "content": "<p><a href=\"https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki/1.-Home\" target=\"_blank\" title=\"https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki/1.-Home\">https://github.com/Healthedata1/OO-on-FHIR-Micro-Profile/wiki/1.-Home</a></p>",
        "id": 153850703,
        "sender_full_name": "Eric Haas",
        "timestamp": 1474848779
    }
]