[
    {
        "content": "<p>Hi <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> I was wondering if there are guidelines and examples for using ConceptMap and/or StructureMap to define the relation between different versions of a single IG. The use case I have in mind is where an IG is in productive use but still being extended or modified in (primarily) non-breaking ways (i.e. MINOR changes in the SemVer lingo) - as one might have it in a very dynamic situation like COVID-19. Typical change examples would be changes in individual codes or value sets.  In such a scenario, it would be ideal to equip each update with a \"migration script\" to allows user to bring their already collected data to the latest IG stage (or  researcher to do it at a later point to pool data). Are there examples of that?</p>",
        "id": 199153400,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1590758781
    },
    {
        "content": "<p>Trying to revive this as there were no answers so far<span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span> - would be very grateful for any experiences, lessons learned, ideas... <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 201703986,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1592903895
    },
    {
        "content": "<p>It probably means nobody ahs done this before, and that all of us are waiting for your best practices :-) Please do tell us!</p>",
        "id": 201705453,
        "sender_full_name": "René Spronk",
        "timestamp": 1592905006
    },
    {
        "content": "<p>It's not a bad idea, it's just a degree of work that not a lot of IG implementers have been willing to take on.</p>",
        "id": 201733659,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592922747
    },
    {
        "content": "<p>It's done for the core spec, but not as yet for any HL7 International-published IGs.</p>",
        "id": 201733742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592922788
    },
    {
        "content": "<p>how would you migrate existing data for new codes?</p>",
        "id": 201787935,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592948774
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> The one concrete case I had in mind was that of changing the value set specifying the allowed answers to a specific question in a Questionnaire. Specifically, I was thinking of the case where there is a 1-to-1 relation between the codes in the old and the new value set so a precise mapping is possible (in QuestionnaireResponse instances).  For instance, both SNOMED and LOINC have code codes for \"yes\" and \"no\", so one could switch from one to the other and still map the data. </p>\n<p>Background: In Germany, there is an ongoing effort to align the (FHIR) data collected on COVID-19, the <a href=\"http://cocos.team\">COCOS initiative</a>. We put out an IG for a COVID questionnaire app while this initiative was just getting started. However, in some instances the codes we used  differ from those COCOS is now converging on. Hence, I am considering how to align our IG while still providing a \"bridge\" for existing data. COCOS hat tip to <span class=\"user-mention\" data-user-id=\"191532\">@dr Kai U. Heitmann</span> - maybe this is interesting to you as well.</p>",
        "id": 201869199,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1593015311
    },
    {
        "content": "<p>ok sure that's a situation where you could. So if you're IG has 2 versions, you can publish a structure map that identifies the 2 versions and maps between them</p>",
        "id": 201898832,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593030145
    },
    {
        "content": "<p>there's no IG infrastructure to support doing anything with that inside the IG itself</p>",
        "id": 201898858,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593030164
    }
]