[
    {
        "content": "<p>I'm pretty new to the HL7 standard. Is there any way to add min, max, mean, average etc. stats to an observation, in a case where the data set is collected over time?</p>",
        "id": 264327874,
        "sender_full_name": "Dan C",
        "timestamp": 1639067804
    },
    {
        "content": "<p>You can certainly capture those as their own observations.  They typically wouldn't be on the same Observation instance as one that captures a point-in-time value.</p>",
        "id": 264328331,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639067996
    },
    {
        "content": "<p>In a database you don't generally store these aggregate values. You calculate them at need upon the set of data you care about. When you start storing the values then you are also storing the set (indirectly). Say you store your avg weight for the year. Tomorrow you store another weight measurement. Do you update the avg observation or store another one? Avg as of today, Avg as of tomorrow. It's probably better to just calculate on the fly \"What is the avg using set of jan-1 to today\" \"What is the avg using the set of jan-1 to tomorrow\"<br>\nWhat if you calculate and store the avg based on your set and tomorrow you notice that Jul1 measure had a typo, 171 instead or 117. If you update that, it invalidates the avg observation.</p>",
        "id": 264330033,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1639068670
    },
    {
        "content": "<p>Ah gotcha, makes sense then. So the FHIR data is more meant as a long term data storage as opposed to something that changes day to day?</p>",
        "id": 264330794,
        "sender_full_name": "Dan C",
        "timestamp": 1639068990
    },
    {
        "content": "<p>Generally, resources once finalized don't change. New resources can be added at any moment. It's data storage (model) and interface. If you want functions built on that data, you fetch the data and do your calculations on the data as it exists at that moment. Tomorrow, if you want new calculations, fetch the current (as of tomorrow) data again.</p>",
        "id": 264332819,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1639069775
    },
    {
        "content": "<p>Ah makes sense now. Thank you so much for the help!</p>",
        "id": 264334580,
        "sender_full_name": "Dan C",
        "timestamp": 1639070405
    },
    {
        "content": "<p>It's really weird because the person I'm doing intern work for has like a totally wrong picture of what HL7 is supposed to be used for. Glad I have this chat group to keep coming back and asking questions :)</p>",
        "id": 264334807,
        "sender_full_name": "Dan C",
        "timestamp": 1639070516
    },
    {
        "content": "<p>There's a $stats operation on Observation that can determine the current statistics for a particular subset of Observations.</p>",
        "id": 264337575,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639071613
    }
]