[
    {
        "content": "<p>Any way to do that?  Or does it make any sense?  For example, to accelerate   ingesting data before further data standardization/normalization.</p>",
        "id": 217141841,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605710138
    },
    {
        "content": "<p>Minimizing/avoiding extensions means minimizing/avoiding use-case specific and country-specific data elements.  If your objective is only to capture/share what you're confident that pretty much every other system will recognize/understand, that's fine.  However, if you want to support the needs of a specific space, you're going to <em>need</em> extensions.  Extensions are a normal - even essential part of FHIR.  Extensions don't necessarily represent \"non-standardized\" data.  They simply represent \"specialized\" data - and there's lots of specialization in different parts of the healthcare space.</p>",
        "id": 217144039,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605711085
    },
    {
        "content": "<p>Thanks, Lloyd<span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span>  You are right.  Actually I'm wondering whether a FHIR  server could used as a staging store for later processing.  Something like a server with not so many constraints.</p>",
        "id": 217148011,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605712705
    },
    {
        "content": "<p>So your question is \"Should I have a preliminary storage area that can accept anything separate from my 'main' storage area?\"?</p>\n<p>That's certainly a possibility.  However, keep in mind that your external interface has to meet the contract of that interface.  If someone says \"please store this\" and you respond with \"yes, stored, here's the id\", you don't want that statement to suddenly become untrue when you propagate the data to your internal system and you want the id you returned to be valid for subsequent search results, etc.</p>",
        "id": 217148624,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605712945
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192103\">@Lin Zhang</span> It is not a question on limiting the extensions used in resource. You server should at least process extensions it understand. It can ignore extensions it does not support. This is why server should have CapabilityStatement to indicate what it support.</p>",
        "id": 217160636,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1605717334
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Yep, that's my question.  Thanks for your straightforward explanation :)</p>",
        "id": 217211221,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605742357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  OK. Many thanks.</p>",
        "id": 217211495,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605742525
    }
]