[
    {
        "content": "<p>Since we cannot remove the gender element from our JSON <br>\noutput, and sometimes we have no value from the genderidentity list, can we just use an empty string for the missing gender value?</p>",
        "id": 222904340,
        "sender_full_name": "Gaius Gracchus",
        "timestamp": 1610736004
    },
    {
        "content": "<p>is there a reason why not to use the 'unknown' code?<br>\nalso what IG are you trying to adhere to, US Core? because FHIR without any other IG requirements does not require patient gender</p>",
        "id": 222907462,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1610737233
    },
    {
        "content": "<p>Empty strings are never allowed in FHIR.</p>",
        "id": 222910218,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610738239
    },
    {
        "content": "<p>Hi Ryan,<br>\nThanks for the suggestion.   We considered 'unknown' but it is not one of the GenderIdentity values.</p>",
        "id": 222921370,
        "sender_full_name": "Gaius Gracchus",
        "timestamp": 1610742773
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"380683\">@Gaius Gracchus</span>  What do you mean \"Since we cannot remove the gender element from our JSON output\"? In base FHIR profile, Patient.gender is [0..1] so you don't have to include it.</p>",
        "id": 222929795,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1610747189
    },
    {
        "content": "<p>Thanks, Yunwei, for the reply.   We originally had a hardcoded profile and had to include it, as I mentioned above.   However, we are working on a more dynamic profile that will allow us to exclude it now.   Thanks!</p>",
        "id": 222943663,
        "sender_full_name": "Gaius Gracchus",
        "timestamp": 1610755727
    },
    {
        "content": "<p>gender identity is CodeableConcept. I think it should follow Missing Data handling, <a href=\"http://hl7.org/fhir/us/core/general-guidance.html#missing-data\">http://hl7.org/fhir/us/core/general-guidance.html#missing-data</a>.</p>",
        "id": 225319635,
        "sender_full_name": "Warren Lin",
        "timestamp": 1612541773
    },
    {
        "content": "<p>Are we talking about genderIdentity (i.e. this <a href=\"https://build.fhir.org/extension-patient-genderidentity.html\">extension</a>), Patient.gender (which is admin gender, not gender identity), or birth sex (which is the USCDI data element)?  </p>\n<ul>\n<li>For Patient.gender, unless you are using an IG that requires it, just don't send it, though it would be preferred to end unknown if you don't have it.  Interestingly, US Core does require it...</li>\n<li>For genderIdentity, if you don't have it, just don't include the extension.  Also, the <a href=\"https://build.fhir.org/extension-patient-genderidentity.html\">genderIdentiy value set </a> is just an example binding, so if you feel like you need to send unknown, rather than just not sending it, you can use your own code.</li>\n<li>For birth-sex, again, if you don't have it, just don't include the extension.</li>\n</ul>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  - do you know why US Core has Patient.gender as 1..1?  I know that we can DAR it, but since birth sex is the USCDI data element, I would have thought that would have had the more strict cardinality, rather than Patient.gender.</p>",
        "id": 225320821,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1612542299
    },
    {
        "content": "<p>If the gender field is not required, you don't need to send it. But if it is required, Data-Absent can be sent.</p>",
        "id": 225321249,
        "sender_full_name": "Warren Lin",
        "timestamp": 1612542491
    },
    {
        "content": "<p>Strongly disagree with not sending Patient.gender.  It's a core element.  You should <strong>always</strong> populate core elements if you have something useful to send, because that gives you the most common degree of interoperability.  Lots of systems won't recognize extensions, but everyone should recognize Patient.gender.  It may not convey all of the nuances desired, but it's far better than nothing..  Also, in US-core, gender is mustSupport and 1..1, so you MUST populate it if you can possibly map your data to one of its values.</p>",
        "id": 225323197,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612543333
    },
    {
        "content": "<p>Sending DAR is <em>not</em> ok if you can reasonably perform a mapping.</p>",
        "id": 225323216,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612543344
    },
    {
        "content": "<p>I agree with Lloyd that you should send  the administrative gender if you have it.  And I expect almost everyone will.  I was just saying if for some reason you <em>don't</em> have it (maybe unconscious  ED patients), then you can just not send it.  I did update my post to suggest sending unknown as the administrative gender if you don't know.  However the initial post seemed to be about gender identity.  Or was there just some confusion between gender and gender identity?</p>",
        "id": 225323966,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1612543683
    },
    {
        "content": "<p>I am still curious why US Core locked down gender - perhaps that was something we did for non-USCDI reasons?</p>",
        "id": 225324103,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1612543749
    },
    {
        "content": "<p>Long term I do want to push back against the idea that administrative gender is a core element.  I agree that it is core today, but it doesn't really have a definition, and gets misused in all sorts of ways, so I would like to see the more defined sex and gender properties become core elements, while the admin gender concept disappears.  I get that this is probably an optimistic and very long term goal though.</p>",
        "id": 225325469,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1612544272
    },
    {
        "content": "<p>It's core because most systems in the world are capable of capturing a single, ill-defined and sometimes confusing broad categorization of gender.  And having that is much more useful than having nothing.  Very few systems across the world can consistently capture and share anything else.  Even if the US manages to drive better consistency on concepts such as birth gender and gender identity, interoperability with the rest of the world is still going to matter.</p>",
        "id": 225327081,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612544879
    }
]