[
    {
        "content": "<p>Can I confirm my recollection that the extension  \"data absent reason\"  -  <a href=\"http://hl7.org/fhir/extension-data-absent-reason.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-data-absent-reason.html\">http://hl7.org/fhir/extension-data-absent-reason.html</a> - can be used in thse situations where there is a required field that cannot be populated. For example, the patient tells you that they did react to a medication,  but the can't recall what it was...</p>",
        "id": 153829179,
        "sender_full_name": "David Hay",
        "timestamp": 1463970164
    },
    {
        "content": "<p>yes you can provide that instead of a value</p>",
        "id": 153829275,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464007809
    },
    {
        "content": "<p>Do the committees fully understand the implications of this?  It's a very nuanced use of \"required\"...most will assume that a required element will always have an @value (or relevant children).</p>",
        "id": 153829286,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1464014098
    },
    {
        "content": "<p>DAR is used within the element so it is a relevent child.  </p>",
        "id": 153829293,
        "sender_full_name": "Eric Haas",
        "timestamp": 1464016824
    },
    {
        "content": "<p>I understand that it's both legal and relevant.  My question is: is its use obvious/expected or surprising?  Personally, I was surprised the first time I saw DAR or NullFlavor as a satisfaction of \"required\".  The documentation for elementdefinition.min is silent about this.</p>",
        "id": 153829296,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1464018146
    },
    {
        "content": "<p>I call this a \"naked\" extension.  And it took me by surprise too.  </p>",
        "id": 153829297,
        "sender_full_name": "Eric Haas",
        "timestamp": 1464018524
    },
    {
        "content": "<p>I think that most committees are taking \"required\" very seriously and won't set something to required unless the resource has no meaning without it.  So adding the \"NI\" null flavor really defeats the purpose.  As an implementer, it's completely unacceptable for a truly required field to have a NULL value, even if I know what flavor of NULL it is!  If NULL is acceptable, then it's not required!</p>",
        "id": 153829298,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1464019014
    },
    {
        "content": "<p>There's also some security implications here - none that can't be accounted for, but if you're depending on the validator to ensure that a field is present....  Again, legal by the letter of the law, but surprising.</p>",
        "id": 153829300,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1464019181
    },
    {
        "content": "<p>well, I'll add it to our co-chair education efforts</p>",
        "id": 153829363,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464037109
    },
    {
        "content": "<p>Would it be acceptable for a committee to make @value required?</p>",
        "id": 153829370,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1464037960
    },
    {
        "content": "<p>it possible, and they should do it if it makes sense. it's not easy though </p>",
        "id": 153829372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464038008
    },
    {
        "content": "<p>it's something we thought would mainly be a profiling thing</p>",
        "id": 153829373,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464038021
    }
]