[
    {
        "content": "<p>Hi, I'm new here.  Could someone explain why the sample US Core resources point to profiles that don't seem to exist?  For example, <a href=\"http://hl7.org/fhir/us/core/stu1/Patient-example.json.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/stu1/Patient-example.json.html\">http://hl7.org/fhir/us/core/stu1/Patient-example.json.html</a> points to a structure definition URI that doesn't resolve...</p>",
        "id": 153975054,
        "sender_full_name": "Chris Blair",
        "timestamp": 1531450315
    },
    {
        "content": "<p>It's a tooling thing.  Right now, the tooling that creates the implementation guide publishing packages doesn't generate redirects at the canonical endpoints to where the resources reside in the implementation guides.  It can and should be done, we just haven't gotten around to it yet.  If you like, you can submit a change request asking for it to happen.  (There's a \"propose a change\" link at the bottom of every page in the spec.)  That way you'll get notified when we've addressed the issue - though you'll have to wait until new a new official version of whatever IG is of interest gets published before you'll see the impact of the change.</p>",
        "id": 153975058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531453252
    },
    {
        "content": "<p>I don't quite follow yet.  I don't see a link to propose a change here...?  <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-patient.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-patient.html\">http://hl7.org/fhir/us/core/StructureDefinition-us-core-patient.html</a>  And, if the structure definition endpoint for U.S. Core isn't here, where is it?  How are people able to use these profiles if there aren't any working endpoints?</p>",
        "id": 153975110,
        "sender_full_name": "Chris Blair",
        "timestamp": 1531486850
    },
    {
        "content": "<p>Hmm.  There seems to be an issue with the publishing template for that IG - it <em>should</em> have the propose a change link (<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> ?).  The profiles (with .json and .xml extensions) can currently be found by following this pattern: <a href=\"http://hl7.org/fhir/us/core/structuredefinition-us-core-patient.json\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/structuredefinition-us-core-patient.json\">http://hl7.org/fhir/us/core/structuredefinition-us-core-patient.json</a></p>\n<p>That said, there isn't an expectation that most systems will use the canonical URLs at runtime - and there's no guarantee they'll resolve (websites move, reorganize, etc. over time).  Instead, implementations are expected to look up their local cached versions of the profiles or find them in registries.  When you're actually looking at an implementation guide, you can navigate using the IG's table of contents to find a particular endpoint.</p>",
        "id": 153975175,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531506652
    },
    {
        "content": "<blockquote>\n<p>here seems to be an issue with the publishing template for that IG - it should have the propose a change link</p>\n</blockquote>",
        "id": 153975234,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531555842
    },
    {
        "content": "<p>There is a link in the yellow box on the home page that explains where to submit trackers.</p>",
        "id": 153975235,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531555954
    },
    {
        "content": "<p>given out standard pattern, there should be one at the bottom of every page too</p>",
        "id": 153975323,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531701448
    },
    {
        "content": "<p><span class=\"emoji emoji-1f612\" title=\"unamused\">:unamused:</span></p>",
        "id": 153975504,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531762376
    }
]