[
    {
        "content": "<p>What are the anticipated problems if someone wanted to use a STU3 resource definition in a DSTU2 server? </p>",
        "id": 153840360,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469131366
    },
    {
        "content": "<p>well, there's lots of reasons why that can't work, but what are you trying to do?</p>",
        "id": 153840361,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469131741
    },
    {
        "content": "<p>IHE -- Where MHD is based on DSTU2; but where Radiology doesn't want to waste time at DSTU2 (ImagingObjectSelection) but rather go direct to STU3 (ImagingManifest).... One might force the DSTU2 rules upon it, and it then looks like a \"Custom Resource\"... :-)</p>",
        "id": 153840362,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469132026
    },
    {
        "content": "<p>so, for majority of the client-server; it would be DSTU2 -- Patient, Provider, DocumentReference, DocumentManifest, AuditEvent, Provenance, Practitioner, Organization, Location,  --- just one object would be served up different ImagingManifest.</p>",
        "id": 153840363,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469132152
    },
    {
        "content": "<p>carumba. that is  really bad idea. </p>",
        "id": 153840372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469134651
    },
    {
        "content": "<p>So what will go wrong?  It's much like adding a custom resource (the DSTU3 thing) to an otherwise DSTU2 collection of resources.</p>",
        "id": 153840376,
        "sender_full_name": "Robert Horn",
        "timestamp": 1469136554
    },
    {
        "content": "<p>- we have no practical experience with custom resources and how they might actually work (e.g. reference implementations...)<br>\n- we haven't even be able to get consensus about a policy at all, after trying for months<br>\n- it's not like that if you think you're going to use the same name. That would just be straight non-conformance<br>\n- technically, the R3 dpends on the rest of ST3, but I suppose none of that is relevant. we hope</p>",
        "id": 153840378,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469137285
    },
    {
        "content": "<p>so this is why we are asking the Implementer community for their guess on what the problems will be. I don't expect that this is already known. I don't expect that it will be easy. I just want to get guesses at how bad it will be.</p>",
        "id": 153840380,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469137513
    },
    {
        "content": "<p>So the MIME-TYPE change between DSTU2 vs STU3 is easy... the transport will be DSTU2.</p>",
        "id": 153840381,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469137532
    },
    {
        "content": "<p>We can just forbid the ImagingManifest from referencing anything. We really don't need the patient identity it is already known by the session context. (well, we need to put something there as it is 1..1).</p>",
        "id": 153840382,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469137573
    },
    {
        "content": "<p>I don't see what referencing has to do with it </p>",
        "id": 153840383,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469138668
    },
    {
        "content": "<p>okay. then I will not worry about references.</p>",
        "id": 153840384,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469139275
    },
    {
        "content": "<p>what should I worry about?</p>",
        "id": 153840385,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469139284
    },
    {
        "content": "<p>There will be zero off the shelf tooling support for using DSTU3 resources with DSTU2 processing rules. That alone would make this idea a non-starter IMO.</p>",
        "id": 153840648,
        "sender_full_name": "James Agnew",
        "timestamp": 1469203949
    },
    {
        "content": "<p>James, thanks. Good point. This is why I am trying to cast the ImagingManafest more as a custom resource being used in a DSTU2 environment.   So Imaging Manifest would need to be hand coded.</p>",
        "id": 153840650,
        "sender_full_name": "John Moehrke",
        "timestamp": 1469204926
    },
    {
        "content": "<p>We were almost about to do something similar; use CareTeam resource definition from STU3 into our DSTU2 based server. But I understand the associated problems w.r.t toolkit support.</p>",
        "id": 153840657,
        "sender_full_name": "Anand Mohan Tumuluri",
        "timestamp": 1469208823
    },
    {
        "content": "<p>you should worry about <br>\n- policy approval for custom resources<br>\n- tooling support for custom resources<br>\n- social approval for custom resources</p>",
        "id": 153840674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469218882
    },
    {
        "content": "<p>why not just use STU3?</p>",
        "id": 153840675,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469218893
    }
]