[
    {
        "content": "<p>HI I am developing a mobile app for patient/doctors. against a FHIR server. please suggest some design architecture for this. my concern is mainly for shall I put a wrapper  service before FHIR server do reduce the network latency and reduce the multiple call. let say on mobile screen I have to show some   appointments. now for this I need to do multiple call to FHIR server. what I am planning is I will send single call to middle service which in turn will call fhir server multiple time and return the info to mobile app.</p>",
        "id": 153884614,
        "sender_full_name": "Somnath",
        "timestamp": 1492077015
    },
    {
        "content": "<p>Maybe you could also implement your own custom operations on the FHIR server to perform a set of operations and return multiple results in a Bundle resource. That way you wouldn't need to implement extra middleware.</p>",
        "id": 153884651,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1492081591
    },
    {
        "content": "<p>I would recommend using these FHIR client libraries for <a href=\"http://hapifhir.io/doc_android.html\" target=\"_blank\" title=\"http://hapifhir.io/doc_android.html\">Android</a> and <a href=\"https://github.com/smart-on-fhir/Swift-FHIR\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/Swift-FHIR\">IOS</a>. It can make your interaction with FHIR server easy. Application features are up to you, what do you want to do your application with FHIR server. FHIR is agnostic to architecture you can go for most used design architectures for Android and IOS, you can use that suits your needs.</p>",
        "id": 153884654,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1492082063
    },
    {
        "content": "<p>thanks for the answer what is the general practice for this. </p>",
        "id": 153884660,
        "sender_full_name": "Somnath",
        "timestamp": 1492085530
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193721\">@Somnath</span> general practice for what?</p>",
        "id": 153884662,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1492087314
    },
    {
        "content": "<p>I mean let I don't control FHIR server. I want develop the mobile client what is the  best practice? any  deployment diagram will be help full ? </p>",
        "id": 153884884,
        "sender_full_name": "Somnath",
        "timestamp": 1492404080
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193721\">@Somnath</span> are you looking for a security model to support secure management of mobile client applications, and users? If so, then I would recommend you look at SMART. It is a great start. This space is also expanding as groups focus. I have pointers to many initiatives that are each taking a unique use-case persona focus, while using existing security frameworks such as OAuth -- <a href=\"https://healthcaresecprivacy.blogspot.com/2017/04/fhir-security-model-is-enterprise.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/04/fhir-security-model-is-enterprise.html\">https://healthcaresecprivacy.blogspot.com/2017/04/fhir-security-model-is-enterprise.html</a> </p>",
        "id": 153884905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492430358
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  HI I am not looking for Security. I am looking for best practice for write mobile client against FHIR server. and be verify specific do we need a layer between FHIR and mobile client do reduce the network latency.  let say I need to show appointments on screen in that case I need to make multiple call from Mobile client to FHIR server. my question  shall I deploy a service layper besides FHIR server which will return all the resources in single call to mobile client by calling FHIR multiple time. </p>",
        "id": 153884939,
        "sender_full_name": "Somnath",
        "timestamp": 1492489735
    },
    {
        "content": "<p>That is very dependent on your application, mobile client capability, network capability, and user expectations. All things well beyond the FHIR standard. It is possible it would work without an additional layer.</p>",
        "id": 153884969,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492515891
    },
    {
        "content": "<p>hello everyone, in fhir resource, one resorce is refering to another for example in Immunization <a href=\"/user_uploads/10155/5tYwp4q32PBBEGkJccn8_nRb/immunization-reactn.PNG\" target=\"_blank\" title=\"immunization-reactn.PNG\">immunization-reactn.PNG</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/5tYwp4q32PBBEGkJccn8_nRb/immunization-reactn.PNG\" target=\"_blank\" title=\"immunization-reactn.PNG\"><img src=\"/user_uploads/10155/5tYwp4q32PBBEGkJccn8_nRb/immunization-reactn.PNG\"></a></div>",
        "id": 153885423,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492751333
    },
    {
        "content": "<p>.</p>",
        "id": 153885424,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492751333
    },
    {
        "content": "<p>reaction.details we have observation reference right, so how to implement this client side? </p>",
        "id": 153885425,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492752419
    },
    {
        "content": "<p>The immunization instance will contain a URL pointing to the Observation instance on some server (possibly the same one you're posting the immunization to, possibly a different one).</p>",
        "id": 153885429,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492755942
    },
    {
        "content": "<p>in http REST interaction model.. you just take the value in reaction.detail and do an http GET .. yes, client side</p>",
        "id": 153885473,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492780180
    },
    {
        "content": "<p>If you're building with Xamarin, you can also use the dotnet fhir client (available as a NuGet package) which is build with c#.<br>\nThere are also many queries that can be done that cross resource boundaries with _include and _revInclude (careful with this one) which will reduce the number of calls that you make from your client, and also the _summary parameter which can reduce the volume of data (if that works for you).<br>\n(and some servers also support compression, which reduces data bandwidth over mobile: Accept-Encoding: gzip)</p>",
        "id": 153886075,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1493184320
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  what value should i take in reaction.detail? i thnik we have to provide the reference or id right?</p>",
        "id": 153886076,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493184928
    },
    {
        "content": "<p>@Brain Postlethwaite. our appln is based on java</p>",
        "id": 153886077,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493184953
    },
    {
        "content": "<p>Then as Muhammed suggested, the HAPI client is probably your best bet.<br>\nI think it's up to you if you want to introduce another server layer in your solution. Just wanted to ensure that you saw that there are techniques to reduce the perceived \"chattiness\" of fhir where a single call can be used to do several things.</p>",
        "id": 153886084,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1493186452
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span> new in STU3 is that the Reference could be a URL, or it could be an Identifier. This does make the client a bit more difficult. The reference URL is what I was referring to. If you are not given the URL, but an Identifier; then you need to either process this as a failure, or try to search for somewhere a Resouce might be with that identifier. This searching is not easy, and likely to not find it. I say that because if it was findable, then the URL would have been given.  I don't like this new datatype, it seems very problematic; it seems very counter to FHIR principles.</p>",
        "id": 153886129,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493208190
    },
    {
        "content": "<p>There's no expectation for resolution of Reference.identifier when doing an _include or _revinclude.  It's solely for business-level linkage.  It's certainly a violation of REST principles to use it.  However, FHIR principles are about practicality - and from a practical perspective, there are lots of places where resolvable URLs are not going to be manageable, at least in the near-term.  FHIR needs to support those environments too.</p>",
        "id": 153886155,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493212537
    }
]