[
    {
        "content": "<p>Hi, do anyone know of publicly available high-level models of the FHIR resource landscape? Goal is to communicate to stakeholders the fact that the resources also have defined relations among them and constitutes a quite impressive information model, and give an idea of these  relations through a visualized model.</p>",
        "id": 203252611,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594204704
    },
    {
        "content": "<p>At one time we had a auto-generated UML diagram showing all resource types and references between them. But it's huge and cluttered, so of very limited value. You'd need some hand crafted / curated graph of resource types. We use such graphs in our FHIR training courses, but only for parts of the set of resources types, never for FHIR as a whole - which would still be a fairly large/complex diagram.</p>",
        "id": 203255928,
        "sender_full_name": "René Spronk",
        "timestamp": 1594207384
    },
    {
        "content": "<p>there is an \"ad  hoc\" one for the Medication Definition resources that you were enquiring about, in the resource proposal for these resources e.g. here <a href=\"https://wiki.hl7.org/MedicinalProductDefinition_FHIR_Resource_Proposal\">https://wiki.hl7.org/MedicinalProductDefinition_FHIR_Resource_Proposal</a> (direct link here <a href=\"https://wiki.hl7.org/File:Resources_sketch.png\">https://wiki.hl7.org/File:Resources_sketch.png</a>)</p>\n<div class=\"message_inline_image\"><a href=\"https://wiki.hl7.org/File:Resources_sketch.png\"><img src=\"https://wiki.hl7.org/File:Resources_sketch.png\"></a></div>",
        "id": 203259387,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594209963
    },
    {
        "content": "<p>Thank you Rik, good one for those contexts. There are some on the category level also in the spec, even though not for all categories. What I was looking for was a model that shows a broader view also across categories. All resources with all relations might be an interesting view but in general be too busy, so ideally more a highlevel model with a set of easily recognizible resources that shows stakeholders in an easy way that all these resources also are building a beautiful web :)</p>",
        "id": 203260956,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594211246
    },
    {
        "content": "<p>If you figure out how to build one, be sure to share :)  So far, we haven't found a way.</p>",
        "id": 203273606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594218355
    },
    {
        "content": "<p>Although not directly representing FHIR resources, would the RIM be helpful here?</p>",
        "id": 203273871,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1594218477
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, I think I will settle for creating a smiple manual version in the first round then :). <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> - the idea was to create a recognition among the stakeholders also for the FHIR resources, so RIM is not ideal.</p>",
        "id": 203275000,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594219018
    },
    {
        "content": "<p>If I were to create something like this (and as a trainer I can see the use) I'd first create a list of the 80% most commonly implemented resources, and group them by functional area (like the modules on the main page of the FHIR spec). Build graphs per group (using different colors for different groups), add some key references within a group, add key references between groups. However, readers will be most interested in clinical and administrative resources, and not in conformance or infrastructural resources (Bundle, Binary, ..). So that'd also impact the visualization and the level of detail (=number of different resource types) shown for each grouping.</p>",
        "id": 203278003,
        "sender_full_name": "René Spronk",
        "timestamp": 1594220414
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> - that is good input.</p>",
        "id": 203328576,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594245245
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span>  you can use ClinFHIR to create FHIR Resource Models based on a Bundle. An example of one for an electronic prescription, including dispensing, can be found here <a href=\"https://terminz-itp.azurewebsites.net/Content/NZePStoFHIR.jpg\">https://terminz-itp.azurewebsites.net/Content/NZePStoFHIR.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"https://terminz-itp.azurewebsites.net/Content/NZePStoFHIR.jpg\"><img src=\"https://terminz-itp.azurewebsites.net/Content/NZePStoFHIR.jpg\"></a></div>",
        "id": 203328675,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1594245320
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  - neat diagram. I will check that out.</p>",
        "id": 203328984,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594245518
    },
    {
        "content": "<p>If this becomes a popular request, I'd start with capturing a graphml definition of the resource graph. From there, selection and visualization should be easier</p>",
        "id": 203331283,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594247103
    },
    {
        "content": "<p>I think you'll find that this specific purpose requires one to have quite a bit of artistic freedom in selecting what resource types to use, what references to show, how to group/display them on a slide, and e.g. whether or not to collapse multiple resources types into 1. The graph doesn't have to represent the full truth - the overall message that such a graph conveys is much more important than its correctness.</p>",
        "id": 203353635,
        "sender_full_name": "René Spronk",
        "timestamp": 1594275195
    },
    {
        "content": "<p>Yes, agree. I was thinking that we could handle selection, clustering and layout on the visualisation layer.</p>",
        "id": 203353959,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594275722
    },
    {
        "content": "<p>I'm just afraid that a standard visualization layer wouldn't support the artistic freedom required for such a graph ;-)</p>",
        "id": 203355621,
        "sender_full_name": "René Spronk",
        "timestamp": 1594277967
    }
]