[
    {
        "content": "<p>We are trying to capture a person's citizenship status that has three pieces of info:</p>\n<ol>\n<li>Citizenship status (citizen, permanent resident, refugee, etc)</li>\n<li>Were you born in the country? (yes, no, prefer not to answer)</li>\n<li>What year did you come to the country?</li>\n</ol>\n<p>We are using observation for #1, and we wonder if we can use Observation.component or extensions for the other two items? I sort of see the rationale for using Observation.component as they are part of the main observation which is citizenship status, but I'm not sure if this will align with the guidance below from Observation page:</p>\n<p>\"Components should only be used when there is only one method, one observation, one performer, one device, and one time\"<br>\n \"Component observations may make up the separate and individual parts of the observation or may provide qualifying information to Observation.code and may only be able to be understood in relation to the Observation.code\"</p>\n<p>Appreciate any feedback on what we should do. Thank you!!</p>",
        "id": 272294156,
        "sender_full_name": "frank cao",
        "timestamp": 1645119025
    },
    {
        "content": "<p>I could see (2) and (3) asked independently of the citizenship status, so I'd say separate observations more than components</p>",
        "id": 272295067,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1645119383
    },
    {
        "content": "<p>I think your questions might need some revising. \"What year did you come to the country?\" Which country? \"Were you born...?\" Which country? <br>\nIf I'm in the EU and I hopped the train to Italy, saw a Dr. Dr. asks those questions it is highly relevant to who is reading and where.<br>\nResident of Greece, train to Italy, \"Are you a citizen?\" Yes. \"Are you a citizen of Italy?\" No.<br>\nGo back home and my PCP retrieves the info and thinks Odd this citizen of Greece answered \"Are you a citizen?\" Yes while they were in Italy.</p>\n<p>There will probably be multiple observations, each observation might have components depending on how the question is phrased.<br>\nQ: \"Are you a citizen?\" A: Yes Component(country, Greece).</p>\n<p>Or perhaps you rephrase the question so that there is only 1 interpretation. \"Are you a citizen of (X|Y|Z)?\"<br>\nperhaps, \"What country are you a citizen of?\" Then there is no \"where\" aspect of q/a.</p>",
        "id": 272306582,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1645124309
    },
    {
        "content": "<p>We are in Canada, so these are only referring to Canada.</p>",
        "id": 272307372,
        "sender_full_name": "frank cao",
        "timestamp": 1645124642
    },
    {
        "content": "<p>Right, but you can't presume the Observation will stay in Canada.  So the key point of \"A citizenship observation needs to include both the citizenship assertion <em>and</em> the country it pertains to\" holds.  It the question is \"Are you a Canadian citizen?\", then you just need a value.  If the question is \"Are you a citizen?\", then you need a component that specifies the country.  Same goes for \"Were you born in the country?\" vs. \"Were you born in Canada?\".  \"What year did you come to the country?\" is just a poor question - does it mean first visit?  Most recent before you became a citizen?  When did you arrive most recently?</p>\n<p>In terms of component vs. extension, if it's a value that qualifies or supplements the Observation.value, then component is appropriate.  If it's qualifying the observing process (e.g. who supervised, was the test done externally), then it should be an extension.</p>",
        "id": 272315600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645128300
    },
    {
        "content": "<p>I see. I think extensions are a better fit here because when I think about the blood pressure example, these items are really further details for the citizenship status. They are not essential pieces that must be understood together.</p>",
        "id": 272443880,
        "sender_full_name": "frank cao",
        "timestamp": 1645211378
    }
]