[
    {
        "content": "<p><a href=\"http://build.fhir.org/loinc.html#alist\" target=\"_blank\" title=\"http://build.fhir.org/loinc.html#alist\">http://build.fhir.org/loinc.html#alist</a> shows hows a set of LOINC answer codes can be represented as a <code>ValueSet</code>, using an example of platelet morphology choices. But I can't see any way to say \"and this value set is associated with LOINC code <code>11125-2</code>. Is there a way to define this linkage, or do consumers have to somehow intuit it?</p>",
        "id": 153854689,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1477718087
    },
    {
        "content": "<p>Dan Vreeman and I were talking about that on Wednesday night. I'll be updating LOINC page in the next 48 hours with out answer</p>",
        "id": 153854694,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477732215
    },
    {
        "content": "<p>Ha, awesome! (I should say: I have an unrelated use case for this general kind of link, so i'm hoping your solution isn't LOINC-specific :-))</p>",
        "id": 153854704,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1477753801
    },
    {
        "content": "<p>hmm it is. what's your case?</p>",
        "id": 153854777,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477771593
    },
    {
        "content": "<p>This is exactly why I discussed with Stan and then Dan about the use of the emergine new Binding Semantics project (<a href=\"http://wiki.hl7.org/index.php?title=Binding_Syntax#Current_Working_Material\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Binding_Syntax#Current_Working_Material\">http://wiki.hl7.org/index.php?title=Binding_Syntax#Current_Working_Material</a>) to represent the link between the LOINC observable and the defined set of answers. I urge you all to align. I'll be referencing this discussion back to Stan and Dan via email and include <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nStan and Dan agreed they would work to do this and bring it to the LOINC committee for discussion.</p>",
        "id": 153854800,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477845904
    },
    {
        "content": "<p>I don't thnk this has anything to do with binding syntax</p>",
        "id": 153854809,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477859151
    },
    {
        "content": "<p>Josh's need to say \"and this value set is associated with LOINC code 11125-2.\" Is essentially a binding with one big difference, it's to a code and not to a model element. Granted that is a big difference so it's really not what we've decided \"a binding\" is meant to represent, but the fact is that all the issues of binding actually insert themselves. </p>\n<p>Because of this I've asked LOINC to consider rerpresenting \"the link\" of a LOINC code to the allowed set of answers using a more formal - more computable - expression. RIght now it's simply buried in the LOINC tables - as Josh has noted. I posit that that more formal expression of linkage can be very similar to a binding statement.</p>",
        "id": 153854912,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477935676
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> -- though from the perspective of consuming LOINC (e.g. converting LOINC's published tables into FHIR resources) this is straightforward; the data are there. The problem is there's no way to say in FHIR \"{this term} in a <code>CodeSystem</code> is associated with the answers defined in {this other} <code>ValueSet</code>.\"</p>",
        "id": 153854913,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1477935887
    },
    {
        "content": "<p>Agree there is no way to do that. So far as I can tell, this is somewhat unique to LOINC and some have argued because it's all \"inside LOINC\" this is really better managed as code system knowledge. That could be a solution (although IMHO this is not the type of information that should be \"in a code system\" because it's too volatile) but LOINC does not have concept relations that can be used to represent this, so we have to hack it someplace. </p>\n<p>Perhaps given all th complexities, instead of representing this link as code to value set we should push LOINC to define the link inside the code system. Then the association you need to support in FHIR is simply a code system query?</p>",
        "id": 153854916,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477936309
    },
    {
        "content": "<p>right, define LOINC properties for the various codes. That's what Dan and I agreed last week</p>",
        "id": 153854930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477937526
    },
    {
        "content": "<p>WHat \"LOINC Property\" are we thinking? I'm not aware of any LOINC concept relations. My understanding is that LOINC properties are the things we've wanted for quite some time and they are coded names (in LOINC code system) for each of the \"attributes\" of a LOINC code (like Method and Scale). I'm not sure how those will work to link to answer sets unless they create yet another attribute \"Answer Set ID\" or some such. Even then, we still need to find which actual LA codes are in the answer set.  SO I'm not sure what you've gotten Dan to agree to that fixes this.</p>",
        "id": 153854944,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477951239
    },
    {
        "content": "<p>I left it to Dan to sort out the distribution issues; we just agreed on how a terminology server would expose this information </p>",
        "id": 153854965,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477979771
    }
]