[
    {
        "content": "<p>I'm trying to figure out how to convey a follow-up request. For example, during an imaging procedure for another issue, the radiologist notices a small lung nodule. Standard practice is to document that on the report, and inform the referring physician that follow-up imaging is needed in, say 6 months.<br>\nWhat I've got so far is:</p>\n<ul>\n<li>\n<p>To capture what was seen: A DiagnosticReport with a codedDiagnosis of \"suspected nodule\", and a result which references an Observation. That Observation would be coded for \"nodule\" and have a valueQuantity of, e.g., 4 mm, and bodySite of lung. (Would there be an interpretation?) </p>\n</li>\n<li>\n<p>To capture the communication: A CommunicationRequest with: reasonReference pointing to the Observation, reasonCode indicating \"Non-critical actionable finding notification\", topic (or payloadReference) pointing to the DiagnosticReport, category of notification. (Possibly with basedOn pointing to a PlanDefinition?).</p>\n</li>\n</ul>\n<p>Assuming that all is right, what I'm stumbling over is how do I communicate the \"request followup imaging in 6 months\" part? Is that a proposed ProcedureRequest? CarePlan? Is it communicated directly (in a coded or non-coded form) in the CommunicationRequest?</p>\n<p>Thanks.</p>",
        "id": 153896649,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1499810181
    },
    {
        "content": "<p>I'd say ProcedureRequest with intent=proposal.  We may want an extension on DiagnosticReport and/or Observation that allows you to point to \"recommended actions\".  I'm not sure where Communication comes into play?</p>",
        "id": 153896653,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499812865
    },
    {
        "content": "<p>We're focusing on CommunicationRequest first before looking at Communication, to create a more loosely coupled arrangement. I assume that most of how we capture this in the request will get transferred to the actual Communication.</p>\n<p>You're suggesting that the Communication Request have a topic or payloadReference pointing to a proposal ProcedureRequest?</p>\n<p>ProcedureRequest already has reasonReference(Condition|Observation). Do we actually need an extension, or just add DiagnosticReport to the existing element? (Now that I see the reasonReference element, it seems to me that an extension from DiagnosticReport/Observation to the ProcedureRequest is pointing in the wrong direction.)</p>",
        "id": 153896676,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1499813684
    },
    {
        "content": "<p>I'm not sure why you need Communication at all.  When the radiologist prepares their report, I'd just expect a DiagnosticReport that points to Observations and maybe to ProcedureRequest.  No need for Communication/CommunicationRequest in the mix.</p>",
        "id": 153896679,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499814285
    },
    {
        "content": "<p>I don't have all the details, but my understanding is that the reading radiologist wants a separate communication (phone call, email) from the regular delivery of the report. In part, this is to because the referring physician is often focused on the primary findings, and the secondary ones get lost and the follow-up is missed. The workflow also involves a communication back that the referring physician acknowledges the issue and will schedule follow-up. (I think the model also complicated by the fact that it is designed for cross-institution uses, so a report showing up in my EMR does little to help you.)</p>",
        "id": 153896680,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1499815254
    },
    {
        "content": "<p>You don't need Communication to <em>have</em> a Communication.  You can just send the data.  If you want strict management of workflow steps, you can also look at Task.</p>",
        "id": 153896682,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499815782
    },
    {
        "content": "<p>I think what they want is the record of telling the referring physician, and the record of the acknowledgement, for which Communication seems appropriate. However, I'll take your suggestion back to the team.</p>",
        "id": 153896684,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1499816025
    },
    {
        "content": "<p>The record of the transmission could be handled by Provenance.  Acknowledgment could vary depending on what you want to do.  It could be \"here's the scheduled appointment\".  But if it's just an I saw, then yes Communication might make the most sense there.</p>",
        "id": 153896689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499816685
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13630\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13630\">GF#13630</a> added for ProcedureRequest.reasonReference include DiagnosticReport.</p>",
        "id": 153896691,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1499817506
    }
]