[
    {
        "content": "<p>I'm looking at exposing events/metrics to our performance monitoring system (splunk). The data I'm looking at monitoring would be HL7v2 events such as Patient Create/Update, Encounter plus class (inpatient, outpatient, etc), Integration Engine Info/warn/error logs (as OperationOutcome) and custom metrics. It would seem AuditEvent is what I should be basing this on, which alongside the normal resource will contain an abstract version of the original resource. These AuditEvents would be posted to splunk.  </p>",
        "id": 153857897,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1479636650
    },
    {
        "content": "<p>Does this make sense and/or has anyone done anything similar? [We would only be doing a limited conversion to FHIR for HL7v2 messages and the conversion is desirable to expose HL7v2 developers to FHIR+REST]</p>",
        "id": 153857898,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1479636798
    },
    {
        "content": "<p>The nearest similar thing I know of was when <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> set up to post an AuditEvent for <a href=\"http://fhir2.healthintersections.com.au\" target=\"_blank\" title=\"http://fhir2.healthintersections.com.au\">fhir2.healthintersections.com.au</a> for any tweet with #FHIR in it</p>",
        "id": 153857899,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479636922
    },
    {
        "content": "<p>it makes sense to use AuditEvent</p>",
        "id": 153857900,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479636935
    },
    {
        "content": "<p>IIRC I used Communication Resource for the Twitter spoof, I don't remember doing anything with AuditEvent. In combination with V2 Mapping I only tackled Provenance but not AuditEvent yet. I understood this to be rather something the server would want to create when it recieves e.g. a Transaction, rather than the client, when it posts one...</p>",
        "id": 153858003,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1479755637
    },
    {
        "content": "<p>client could post an AuditEvent (ATNA server)</p>",
        "id": 153858007,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479757988
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Yes, that's what I was thinking of. When a transaction comes in, the v2 message would carry on as normal but we'd additionally audit the transaction using FHIR. A background process would send the audit to splunk for telemetry. </p>",
        "id": 153858122,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1479817883
    }
]