[
    {
        "content": "<p>An outcome of today's clinicians on FHIR is a series of questions about clinical records in FHIR around mother and child, both during and after pregnancy. How should these things be represented in FHIR:</p>\n<ul>\n<li>the child was exposed to a medication administered to the mother before birth</li>\n<li>the child has [condition] because of a procedure performed on the mother</li>\n<li>the fetal heartbeat for fetus B is Xbpm</li>\n<li>the womb length is Xcm and the Baby height is Ycm</li>\n</ul>\n<p>I have my own ideas about how those things might be represented in the clinical resources, but the first question is, how do vendors around the world handle these interlinked records - are the records interlinked? When do newborns get ids assigned or records created? How would you do attribution across the records?</p>\n<p>I suspect that the answers to these questions will vary widely between institutions, vendors, and jurisdictions.  But we need at least some consistency in the FHIR representation. The proposal is that I write a section about this on <a href=\"http://build.fhir.org/clinicalsummary-module.html\" target=\"_blank\" title=\"http://build.fhir.org/clinicalsummary-module.html\">http://build.fhir.org/clinicalsummary-module.html</a>. </p>\n<p>Thoughts? (particularly <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> <span class=\"user-mention\" data-user-id=\"195159\">@Malcolm Pradhan</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> )</p>",
        "id": 153935089,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517600429
    },
    {
        "content": "<p>Maybe you can do a <code>contained</code> Patient for the child?  :)</p>",
        "id": 153935102,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1517607018
    },
    {
        "content": "<p>(Still trying to decide if that was a joke that the Baby resource was <em>contained</em> in the Mother resource or not ;)<br>\nThere are sample resources that PA put in for a mother, and child (with appropriate RelatedPerson too) that you could use in your examples<br>\n<a href=\"http://build.fhir.org/patient-example-mom.xml.html\" target=\"_blank\" title=\"http://build.fhir.org/patient-example-mom.xml.html\">http://build.fhir.org/patient-example-mom.xml.html</a><br>\n<a href=\"http://build.fhir.org/patient-example-newborn.xml.html\" target=\"_blank\" title=\"http://build.fhir.org/patient-example-newborn.xml.html\">http://build.fhir.org/patient-example-newborn.xml.html</a><br>\n<a href=\"http://build.fhir.org/relatedperson-example-newborn-mom.xml.html\" target=\"_blank\" title=\"http://build.fhir.org/relatedperson-example-newborn-mom.xml.html\">http://build.fhir.org/relatedperson-example-newborn-mom.xml.html</a></p>",
        "id": 153935105,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517608494
    },
    {
        "content": "<p>Yeah, it was a joke.</p>",
        "id": 153935108,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1517609095
    },
    {
        "content": "<p>We'll probably be leveraging JSON as much as possible to model things as biological processes.  This gets back to my question of flattening nested FHIR resources into one large JSON file vs sending over bundles or lists of separate resources (we do a lot of the former internally in the Javascript community; it's super convenient and useful).  </p>\n<p>Internally, we would use both...  during pregnancy, the records are all kept in the maternal record; and at birth, the child subobject is used to create a new account; either as a template or simply copied/moved over.  Keep things simple.  Model the data just like the real world.</p>\n<p>I'm very keen on the idea of the Provenance resource, and have some ideas on how to use it throughout our entire app to indicate data quality...  this data in your aggregated continuity of care timeline is from a hospital; this data is from your medical devices; these data points are from social media; these are self-reported.  We're probably going to display them with different colors or icons; that type of thing.  And in keeping with that approach...  adding 'this data was derived from the mother's records' would fit perfectly.  </p>\n<p>So, we'll probably keep a maternal MRN associated with the child (possibly/probably paternal also), and have provenance lookup functionality; and the parental records on hand as available.  Probably some sort of extension to reference the parents on a Patient resource.  Then, when Observations that are generated via a lookup on that parent reference, attach a Provenance resource to each new Observation describing that this was indirectly observed data.</p>\n<p>Would definitely be interested in hearing how others are implementing this.</p>",
        "id": 153935141,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1517668018
    },
    {
        "content": "<p>Glad to see Provenance with a place of provenance in an EHR :)  Something else I'm interested in is that linking child to parent records is a very natural thing for newborns/infants, but starts to raise potential privacy issues as the child ages and particularly once they reach the point of legal self-determination.  Does anyone have thoughts on a need to \"unlink\" parent and child records at a particular point (or at least more strictly control how that linkage is used)?</p>",
        "id": 153935142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517669381
    },
    {
        "content": "<p>In terms of flattening, you can do whatever you like internally, but for it to be \"exchangeable\", we'd have to address it in all of the syntaxes, we'd have to make it work with the schema representations of the different syntaxes and we'd have to ensure consistency of how it was done - and I suspect the way data would be flattened would typically be context-specific, making consistency difficult.</p>",
        "id": 153935143,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517669471
    },
    {
        "content": "<p>That also brings up the use case of the adoptive mother and the birth mother (e.g. for surrogates); how would that be handled?</p>",
        "id": 153935153,
        "sender_full_name": "John Silva",
        "timestamp": 1517684603
    },
    {
        "content": "<p>Those born in NZ hospitals have National Health Index (NHI) identifiers assigned to them as soon as birth delivery details are entered on the hospital system. My kids' NHIs were on the Mother &amp; Baby Discharge Summaries issued only a few hours after the birth events. The link to the mother is via her NHI number but, at present, the information from the hospital system isn't passed back to primary care (very few GPs in NZ now provide ante-natal care and the first 6 weeks of post-natal care is done by an agency called Plunket) - although the GP systems do pick up the NHI number, via the Patient Identity Service, when a baby is first enrolled at a general practice.</p>",
        "id": 153935171,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1517707907
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> We have the concept of a fetal chart where meds, fetal surgery, lab orders, etc. can be documented.   It is linked to the mother.  We have a special patient-to-patient link for mother/baby, which is not really a RelatedPerson, though maybe we could represent it that way, though given the special biological connection pre-birth I don't know that RelatedPerson is there right answer.  We do allow un/re-linking (for correction workflows).  I think we apply all the normal rules for institutional MRN assignment, but I can double check that.  We do have special rules for national ID assignment in some realms (i.e. we don't trigger a request to the national ID assigner for fetal charts).</p>",
        "id": 153935355,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1517862042
    },
    {
        "content": "<p>so you have a general record level link? - no cross linking at a finer granularity?</p>",
        "id": 153935405,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517877997
    },
    {
        "content": "<p>We have a special \"mother's record link\" on the baby.</p>",
        "id": 153935545,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1517930727
    },
    {
        "content": "<p>thanks</p>",
        "id": 153935590,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517948899
    },
    {
        "content": "<p>We're still looking into it :)</p>",
        "id": 153935593,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1517949670
    },
    {
        "content": "<p>Similar approach - we have a fetal/neonatal resource, also used to calculate gestational age and corrected age for prems.<br>\nBTW is there a preferred way to represent a condition secondary to a procedure (as in Grahame's example)?  Condition.evidence doesn't seem to be quite right.</p>",
        "id": 153935669,
        "sender_full_name": "Malcolm Pradhan",
        "timestamp": 1517968627
    },
    {
        "content": "<p>what else does it contain?</p>",
        "id": 153935670,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517968702
    },
    {
        "content": "<p>Very similar to the clinical summary, which we will upgrade to at some point. We only generate Patient &amp; Encounter resources when triggered through the PAS, so we  use the fetal/neonate resource to track observations, tasks, notes, etc. until we get confirmation of the child's MRN/NHI. It has grown a bit to also handle some basic neonatal information before the child is entered into the PAS. E.g. neonatal screening tasks, baby location (so they don't forget where they left it...)<br>\nThe problem we have is that most PAS systems we have encountered don't explicitly link the baby to the mother.</p>",
        "id": 153935677,
        "sender_full_name": "Malcolm Pradhan",
        "timestamp": 1517971470
    },
    {
        "content": "<p>Grahame, for the mother-fetus scenario, we have a somewhat similar scenario where we need to take repeated measurements of one or more masses seen on imaging. We want to say for instance \"mass 1 is 3cm diameter today, and was 2.5cm last month\". Neither observation.subject nor observation.specimen seem just right. Perhaps there is a need to broaden the notion of observation.subject to other types of things?</p>",
        "id": 153935887,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1518043757
    },
    {
        "content": "<p>OO has defined <a href=\"http://build.fhir.org/extension-observation-focal-subject.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-observation-focal-subject.html\">http://build.fhir.org/extension-observation-focal-subject.html</a> for this use case,  I believe</p>",
        "id": 153935888,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518043885
    },
    {
        "content": "<p>Thanks. I see how that can meet the mother/fetus case, but not the repeated measurements of lesions seen on imaging. In the latter case, the focal-subject is a diagnostic imaging finding.</p>",
        "id": 153935891,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1518044448
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/extension-body-structure.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-body-structure.html\">http://build.fhir.org/extension-body-structure.html</a> ? <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> any further comments?</p>",
        "id": 153935892,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518044576
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> Also look at the BodySite resource.  That allows you to document multiple observations and procedures over time that all apply to the same lesion/tumor/fetus/etc.</p>",
        "id": 153935894,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518044820
    },
    {
        "content": "<p>Would it make sense to add bodyStructure or bodySite into the list of things that can be referenced by focal-subject?</p>",
        "id": 153935895,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1518045639
    },
    {
        "content": "<p>or allow observation.bodySite to be a bodySite reference OR a codeable concept?</p>",
        "id": 153935896,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1518045919
    },
    {
        "content": "<p>Sorry, forgot it had been renamed BodyStructure.  There's actually an extension that allows it to be referenced from various resources.  It might make more sense as a focal subject, but in theory you could have all three - mother, fetus, body feature within fetus.</p>",
        "id": 153935900,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518047013
    },
    {
        "content": "<p>very helpful. Thank you guys</p>",
        "id": 153935905,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1518047436
    },
    {
        "content": "<p>Something does seem to be missing here (but maybe it's just me that's missing it).  Obviously I should have been paying more attention.  Though we don't need it for the mother/fetus case, I was thinking that we had the ability to specify locations relative to anatomical landmarks (or other coordinates), but I'm not finding that in the resources or extensions.  Would like to get <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>'s thoughts.</p>",
        "id": 153936381,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1518111222
    },
    {
        "content": "<p>Specimen and bodysite are always a kind of focal subjects for Observations.    Use the Bodystructure extension as Lloyd points out if you want to track the bodysite.</p>",
        "id": 153936426,
        "sender_full_name": "Eric Haas",
        "timestamp": 1518121059
    },
    {
        "content": "<p>We recommend documenting against one or more babies within the mother’s chart prior to delivery.  We offer ways to distinguish baby A versus baby B observations.  Once delivered, the baby is registered and the baby's record is created.  We provide the ability to copy observations and documents from mom's record to baby's record.  Medications, for example, typically stay on the maternal chart.  The maternal and baby charts are related, so users can gather any additional maternal information that has not copied to the baby’s chart.  It’s then up to the practitioner caring for the newborn to begin the newborn’s own history information based on information gathered in the maternal chart.<br>\nCC:  <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span></p>",
        "id": 153936496,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1518132730
    },
    {
        "content": "<p>so I think that we should 2 things:<br>\n- add a page to the specification describing how all this is represented in resources<br>\n- define a new resource \"BirthRecord\" with contents something like:</p>\n<p>BirthRecord<br>\n - baby[x] int | Reference(Patient) 0..1<br>\n - mother : Reference(Patient) 1..1<br>\n - father : reference(RelatedPerson) 0..1<br>\n - LMP : date 0..1<br>\n - expected/plannedDoB 0..1<br>\n - dateOfBirth 0..1<br>\n - timeOfBirth 0..1<br>\n - consultation : Reference(Encounter|Composition) 0..*<br>\n - birth : Reference(Procedure) 0..1<br>\n - birthDetails : Reference(Observation | Condition) 0..*</p>",
        "id": 153936512,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518138868
    },
    {
        "content": "<p>I'm not really a fan of this.  LMP is an observation - and could be captured multiple times and may not always get the same answer.  expected/plannedDoB is also an observation and has associated with it a method and there will typically be many predications over the course of a pregnancy (hopefully with increasing accuracy).  dateOfBirth/timeOfBirth replicate information from both the procedure and the Patient.  Linking everything in a pregnancy together (all of the measurements of the mother, heart rates, etc.) is intended to be managed under EpisodeOfCare which already has the ability to link all of these things.</p>",
        "id": 153936516,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518141157
    },
    {
        "content": "<p>The notion of a \"birth record\" is similar to occupational health and all sorts of other instruments where you gather a bunch of information (observations, meds, encounters, etc.) and present them in a particular way.  We do NOT want to introduce a resource for every single one of these - we'll end up with hundreds.</p>",
        "id": 153936517,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518141230
    },
    {
        "content": "<p>Is a birth record a composition?</p>",
        "id": 153936518,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1518141389
    },
    {
        "content": "<p>A section?</p>",
        "id": 153936519,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1518141441
    },
    {
        "content": "<p>LMP is  decision, based on an observation</p>",
        "id": 153936520,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518141590
    },
    {
        "content": "<p>Some of it may be better in EpisodeOfCare, yes.</p>",
        "id": 153936521,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518141648
    },
    {
        "content": "<p>Composition is about presentation for human review.  The information certainly could be packaged into a document, but it should never need to be.</p>",
        "id": 153936522,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518142366
    },
    {
        "content": "<p>Don't really get the distinction of \"decision\" vs. \"observation\" <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153936523,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518142395
    },
    {
        "content": "<p>I observe an LMP<br>\nI decide that for this pregnancy, we will estimate an LMP of X (sometimes it's not an observation)</p>",
        "id": 153936524,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518142922
    },
    {
        "content": "<p>To me, an estimate is still an observation.  In v2, it'd be an OBX.  In v3 it'd be an ObservationEvent.  In FHIR, we have nothing to capture it other than Observation and the elements of Observation all apply.</p>",
        "id": 153936530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518144323
    },
    {
        "content": "<p>The mother/father properties do not seem to handle the situation where there is a surrogate mother and a birth mother.   (I suppose the father might not be known directly if from 'sperm bank' though the cardinality of 0 handles that; unless there is a need to know about preexisting genetic issues with the father.)</p>",
        "id": 153936566,
        "sender_full_name": "John Silva",
        "timestamp": 1518185534
    },
    {
        "content": "<p>EpisodeOfCare has a certain assumption of the role of a care provider being centrally involved (and hence payment), whereas BirthRecord may better accommodates at-home births.</p>",
        "id": 153936593,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1518194597
    },
    {
        "content": "<p>I don't think there's anything about Episode that is necessarily provider-centric.  It's more condition-centric.  It would integrate encounters, conditions, Observations, etc. from a variety of practitioners (and the patient themselves) that all pertain to a particular pregnancy or fetus.</p>",
        "id": 153936614,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518206651
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> The NHS BirthRecord (albeit a draft based on DSTU 2) is modelled as a Bundle: <a href=\"https://nhsconnect.github.io/Digital-Child-Health/Generated/Profile.BirthDetails/dch-bundle-1.html\" target=\"_blank\" title=\"https://nhsconnect.github.io/Digital-Child-Health/Generated/Profile.BirthDetails/dch-bundle-1.html\">https://nhsconnect.github.io/Digital-Child-Health/Generated/Profile.BirthDetails/dch-bundle-1.html</a>  Thoughts on this verses a resource?</p>",
        "id": 153936872,
        "sender_full_name": "Tim Blake",
        "timestamp": 1518394586
    },
    {
        "content": "<p>In the NHS case, is BirthRecord representative of a legal document, or another standalone artefact? If so, a composition might be something to consider (based on Richard's comment)...</p>",
        "id": 153936881,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1518403171
    },
    {
        "content": "<p>Composition can wrap anything.  But it's not a primary representation of anything.</p>",
        "id": 153936882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518403324
    },
    {
        "content": "<p>In Australia the birth record isn't a legal document, but it is a somewhat standardised record (with state to state variations) that gets written into a paper child personal health record.</p>",
        "id": 153936884,
        "sender_full_name": "Tim Blake",
        "timestamp": 1518411825
    },
    {
        "content": "<p>I think there is a good case to be made for making BirthRecord a resource</p>",
        "id": 153936885,
        "sender_full_name": "Tim Blake",
        "timestamp": 1518411865
    },
    {
        "content": "<p>I expect that a full birth record will be a set of resources, that may be wrapped in a Bundle, potentially with a Composition. But the actual birth details have to be somewhere, and we don't have anything for that right now. Hence, I propose a BirthRecord resource</p>",
        "id": 153936942,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518464096
    },
    {
        "content": "<p>I don't see anything in your list that isn't already covered by other resources.  Expected birth date and LMP are both Observations too.</p>",
        "id": 153936985,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518472114
    },
    {
        "content": "<p>Perhaps then the resource could be BirthDetails, with a birth record being the larger bundle / composition...</p>",
        "id": 153937024,
        "sender_full_name": "Tim Blake",
        "timestamp": 1518489198
    },
    {
        "content": "<p>I don't see a need for a resource at all.  All of the other information can be captured using existing resources.  So all that's really needed is a profile on Bundle or Composition to group things together.</p>",
        "id": 153937032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518494196
    },
    {
        "content": "<p>most of the information can be captured, but what links together as a coherent whole? As for the information:<br>\nBirthRecord<br>\n- baby[x] int | Reference(Patient) 0..1 - - where is this prior to birth?<br>\n- mother : Reference(Patient) 1..1 - where is this?<br>\n- father : reference(RelatedPerson) 0..1- where is this?<br>\n- LMP : date 0..1  - which observation is the right one? <br>\n- expected/plannedDoB 0..1 - what is this? how do you find it<br>\n- dateOfBirth 0..1<br>\n- timeOfBirth 0..1<br>\n- consultation : Reference(Encounter|Composition) 0..* - how do you find these?<br>\n- birth : Reference(Procedure) 0..1  <br>\n- birthDetails : Reference(Observation | Condition) 0..* - how do you find these?</p>",
        "id": 153937053,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518513682
    },
    {
        "content": "<p>1. I'd expect there to be a pregnancy EpisodeOfCare.  I'd also expect there to be a BodySite for each fetus to track things over time.  We should have an extension that links the BodySite to the eventual Patient resource.<br>\n2. We've talked about having an extension that allows linking \"baby\" Patient to \"mother\" Patient<br>\n3. This could be RelatedPerson or could be \"baby\" Patient.contact.  Given it tends to be capture for administrative purposes, I'd lean towards the latter.<br>\n4. The right LMP is the one that's linked to the Episode.  If there are multiple linked to the episode for some reason, it's the most recent<br>\n5. ExpectedDoB is an Observation (with derivedFrom links to a LMP observation and/or an ultrasound image.  PlannedDoB for a scheduled caesarean would be in appointment<br>\n6/7 date/timeOfBirth are on the \"baby\" Patient and on the delivery Procedure<br>\n8. You find the encounters because they're tied to the EpisodeOfCare<br>\n10. The birth details would also be tied to the EpisodeOfCare - and possibly the birth Procedure</p>",
        "id": 153937184,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518545410
    },
    {
        "content": "<p>I agree that we'd want a \"view\" that shows the relevant information - but we're going to have 100s of views for different purposes and we absolutely don't want to create a resource for each of them.</p>",
        "id": 153937185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518545456
    },
    {
        "content": "<p>As many are aware, I've been arguing for a dedicated 'Maternity' resource for several years. While I fully understand Lloyd's arguments against this, I think that it is clearly the exception that breaks the rule precluding one resource per specialty. I've worked on 3 major maternity system implementations during my career and, as things currently stand, would find it very hard to recommend, or use, FHIR as a means of exchanging, modeling, processing or persisting maternity data. It requires an 'anchoring' resource because of the sheer size and complexity of the data model (the NZ version is a door-stopper) and number of associated events.  Furthermore it is the start of the patient journey/record - where it all starts for 100% of us (no kidding).</p>",
        "id": 153937209,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1518551577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> do you or anyone else have a good example data set for us to iterate on as an example?</p>",
        "id": 153937526,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518658973
    },
    {
        "content": "<p>Don't have any sets of test data left from my time at National Womens' Hospital, but have emailed you copies of the NZ Maternity Data Dictionary and CDA Template 'standard'.</p>",
        "id": 153937591,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1518663695
    },
    {
        "content": "<p>I'd be interested in generating these in Synthea, if I had some good examples to work from.</p>",
        "id": 153937751,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1518704449
    },
    {
        "content": "<p>Has there been any further discussion on the Mother/Child record issue?  With respect to simply identifying a patient as pregnant, the prefered resource is observation o condition? In the documentation pregnancy is mentioned in both.</p>",
        "id": 153967887,
        "sender_full_name": "Ive Kohnenkamp",
        "timestamp": 1528402026
    },
    {
        "content": "<p>Condition for being pregnant. Observation for LMP</p>",
        "id": 153967888,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528402104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> You write: </p>\n<blockquote>\n<p>I don't think there's anything about Episode that is necessarily provider-centric. It's more condition-centric. It would integrate encounters, conditions, Observations, etc. from a variety of practitioners (and the patient themselves) that all pertain to a particular pregnancy or fetus</p>\n</blockquote>\n<p>I like that approach, but EpisodeOfCare seems to forbid it: </p>\n<blockquote>\n<p>Many organizations can be involved in an EpisodeOfCare, however each organization will have their own EpisodeOfCare</p>\n</blockquote>\n<p>So I'd probably need a Condition (being a pregnancy) with multiple Episodes, one for each involved provider. That does not seem to capture the reality of maternal care, which does involve multiple parties around a single pregnancy, not sequentially but in parallel. So is one Episode which aggregates data from multiple providers OK or not? (Sorry, old thread, but working on this now.)</p>",
        "id": 161773671,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1553614696
    },
    {
        "content": "<p>I think there should be a 'typically' in there.  The wording reflects typical practice, not an absolute rule.  (We try hard to <em>not</em> dictate business rules in resources.)  Feel free to submit a change request to improve the wording.  And certainly don't feel bound by that wording in your use of the resource now.</p>",
        "id": 161774023,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553614924
    },
    {
        "content": "<p>Thanks, just submitted #20612</p>",
        "id": 161776469,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1553616205
    },
    {
        "content": "<p>Pregnancy records have a lot of data: gravida, parida, amniocity, subfertility treatment and so on. These can be modelled as (a battery of) Observations. Of course, since a woman can have multiple 'pregnancy' Episodes, the Observations need to be associated with the proper Episode. I see some possibilities:<br>\n- EoC does not have a reference to Observation (nor a Reference(Any)). There is a workflow extension, which might be the thing to use, but there's not a lot of guidance in the extension on intended use.<br>\n- EoC can link to condition, which can link to Observation, but only in condition.stage and condition.evidence which seems far-fetched.<br>\n- I could use some grouping mechanism as Composition and DocumentReference, but that doesn't seem to grasp the relatedness between the Episode and the Observations.<br>\n- Observation can reference Encounter (used to be Episode | Encounter, but that didn't make it to normative), which can reference EpisodeOfCare. However, typically the exact Encounter where an Observation which pertains to the entire pregancy isn't recorded (here in the Netherlands anyway). So the Encounter for blood pressure (which changes) is known, for gravida (which does not change during <em>this</em> pregnacy, isn't). So to do this I'd need an almost empty un-dated Encounter to gather those data<br>\nAnybody any ideas which is the best approach (of another, which I've overseen)?</p>",
        "id": 161878331,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1553705418
    },
    {
        "content": "<p>The expectation is that stuff that's relevant to the episode points to the episode with the extension.  (It's an extension because we don't feel most systems support linking to episodes).</p>",
        "id": 161878991,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553705870
    },
    {
        "content": "<p>Fair enough. Thx.</p>",
        "id": 161879351,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1553706100
    },
    {
        "content": "<p>The Patient resource explains how to deal with mother and newborn <a href=\"https://www.hl7.org/fhir/patient.html#maternity\" target=\"_blank\" title=\"https://www.hl7.org/fhir/patient.html#maternity\">https://www.hl7.org/fhir/patient.html#maternity</a>.  It says that to link the mother  and baby encounters the encounter.partof element should be used. I wonder whether this recommendation is a correct use of the element, since it is not really part of but rather a very much related encounter. The issue I bumped into is that encounter.partof has a maximum cardinality of 1 and I am already using it in some profiling for establishing relationships between encounters at institution and health system level (the first would refer to the latter in encounter.partof).</p>",
        "id": 164926597,
        "sender_full_name": "Javier Espina",
        "timestamp": 1557074223
    }
]