[
    {
        "content": "<p>Hi! <br>\nWe have a requirement to communicate the mothers and fathers height of a patient for a growth chart use case. <br>\nWe would like to use the code attibute for sending a SNOMED code telling that the observation is a mothers or a fathers height.<br>\nOur question is however now if we should use the standard body height observation for this. The problem is that the observation height profile already has a fixed value with the LOINC code for body height. </p>\n<p>What is the attended use for these standard profiles. Do they support the use case of sending mothers or fathers height? And if yes, is it possible to use observation.code to send a snomed code for e.g, mothers height aswell as the LOINC code? Or do we need to send a reference for the parent in the observation.focus element? </p>\n<p>Thanks in advance!</p>",
        "id": 236395270,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1619551957
    },
    {
        "content": "<p>Using the Observation with the standard code and Observation.focus referencing the RelatedPerson record of the Parent is the most straightforward.  There are other possibilities but that likely will work most smoothly</p>",
        "id": 236396820,
        "sender_full_name": "David Pyke",
        "timestamp": 1619552678
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span>  - where did the Vital Records project end up with the Mother's Height observation? Did it use the newborn or the mother's patient record as Observation.subject?</p>",
        "id": 236502322,
        "sender_full_name": "Craig Newman",
        "timestamp": 1619614860
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>  <br>\nI am curious what other possibilites there might be. In our context we do not have any reference or knowledge about the mother or father of the patient other than that the observed body height belongs to the patients mother/father. </p>\n<p>Is the other possibility to send the code in observation.code? And if it is, should we use the standard profile when deriving our body weight profile? <br>\nI am thinking of creating a use case specific observation profile for only comunicating the mother or fathers body height. In that profile have a value set containing codes for fathers height and mothers height binded to the observation.code attribute.</p>",
        "id": 237297685,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1620122573
    },
    {
        "content": "<p>Yes, if you don't have the information about the parent, you're going to need to create a custom profile on Observation to handle this case.</p>",
        "id": 237317430,
        "sender_full_name": "David Pyke",
        "timestamp": 1620132596
    },
    {
        "content": "<p>Thanks! <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>  Would you say that the custom profile should be derived from the standard body height profile(and therefor inherit the LOINC code for body height)? Or should we derive it from the standard vital sign profile and only support snomed codes for mothers height and fathers height? The only difference in the profile would be if the LOINC code would be present or not.</p>",
        "id": 237610479,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1620281543
    },
    {
        "content": "<p>I would suggest that you work with a derived profile adding an extension to mark it as a parental measurement (that has no record in the server)</p>",
        "id": 237703380,
        "sender_full_name": "David Pyke",
        "timestamp": 1620324465
    },
    {
        "content": "<p>You can't mark something as a parental measurement with a regular extension - you'd have to use a modifierExtension (which would mean a lot of systems wouldn't accept/process the instance).  Using focus to point to a 'contained' RelatedPerson that just captures the relationship would probably be better.</p>",
        "id": 237742788,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620341704
    }
]