[
    {
        "content": "<p>Question from DevDays:</p>\n<blockquote>\n<p>we are moving data from DSTU2 to STU3.what is the bestway to approach this?</p>\n</blockquote>",
        "id": 201065472,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592337150
    },
    {
        "content": "<p>well, I don't know about the <em>best</em> way. But here's some ways you can:</p>\n<ul>\n<li>use the FHIR Mapping language and libraries to convert the data as a once off </li>\n<li>write code in some 3GL or XSLT, and then you can do it as a once off or as an ongoing process</li>\n<li>use some existing library or service that can do the conversion</li>\n</ul>\n<p>but it all depends on your condition. Are you storing data as FHIR resources? If you aren't, you can just write parallel infrastructure in your mapping/bridging code</p>",
        "id": 201066370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592337593
    },
    {
        "content": "<p>Also without knowing the context here I am inclined to ask why not go straight to r4? (I'm assuming there are good reasons, but this is worth looking into.)</p>",
        "id": 201083559,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592347728
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  - but does FHIR define a 'straight mapping' from DSTU2 to R4 -- or does one have to go from DSTU2 to STU3 and then to R4?</p>",
        "id": 201371514,
        "sender_full_name": "John Silva",
        "timestamp": 1592560893
    },
    {
        "content": "<p>I only have the excerpted context above -- I was assuming you were talking about updating an API service rather than just converting a pile of data. Depending on what data you're working with and the tool set you have chosen, a two-step data conversion process might be helpful; my comment was really just about your target state.</p>",
        "id": 201386108,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592571751
    }
]