[
    {
        "content": "<p>In response to <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16031\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16031\">GF#16031</a>, we're looking for feedback on concerns for working with multi-server environments. <br>\nMost discussions I've seen on Zulip seem to assume a single server that will have all the information a client is looking for, however that architecture isn't required by FHIR. Even if a single server has all the information a particular client needs, there is no requirement that an environment have only a single server.<br>\nIn previous discussions, it was suggested that search doesn't need to span servers. That is, e.g., searching server A for observations for patients named Smith will only return observations (on server A) for patients named Smith (on server A); any server A observations for non-server A patients aren't necessarily returned. Is this generally expected? (And if you know where this is actually documented, I'd appreciate a link.)<br>\nAre there other places where multiple servers introduce complexity that we should warn implementers about? Or should implementers just realize that (a) they might encounter multi-server environments, and (b) multi-server environments make things tricky?</p>",
        "id": 153981959,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533330425
    },
    {
        "content": "<p>it's specifically documented that search is allowed to return resources from other servers.</p>",
        "id": 153981961,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533330476
    },
    {
        "content": "<p>(recent change after this was discussed here before)</p>",
        "id": 153981962,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533330488
    },
    {
        "content": "<p>I personally think (a) and (b) are inherently true and nothing special about FHIR</p>",
        "id": 153981963,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533330512
    },
    {
        "content": "<blockquote>\n<p>it's specifically documented that search is allowed to return resources from other servers.</p>\n</blockquote>\n<p>Agree, which is why searches include the full URL of the results, not just the relative URL. It is also documented that _include need not include resources on other servers.</p>\n<blockquote>\n<p>I personally think (a) and (b) are inherently true and nothing special about FHIR</p>\n</blockquote>\n<p>I agree with that too. What about \"implementers should just realize\"? And even if they realize it, and know that there are tricky bits here, wouldn't we do them a service to point out what some of those tricky bits are? Surely we expect all implementers to realize that healthcare systems have safety risks, yet we provide a list of clinical safety gotchas.</p>",
        "id": 153981970,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533331434
    },
    {
        "content": "<p>I think that whatever warning we can get agreement too will be so generic it's not useful. \"Implementers should be aware that there might be more than one server out there....\"    (ok, we could probably get better than that, but how much better?)</p>",
        "id": 153981981,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533332513
    },
    {
        "content": "<p>I'd hope we could do more than absolutely generic.</p>",
        "id": 153981992,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533334182
    },
    {
        "content": "<p>Care to propose some specific language? :)</p>",
        "id": 153981995,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533334236
    },
    {
        "content": "<p>No, not really. I submitted the tracker item because I was looking for guidance. I've got some bullet points in the tracker, but they need verification. And the one thing I thought was explicitly defined (cross-server search), I can't find text in the spec to back it up.</p>",
        "id": 153981997,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533334398
    },
    {
        "content": "<p>There be dragons there...   <a href=\"http://build.fhir.org/assets/images/dragon.png\" target=\"_blank\" title=\"http://build.fhir.org/assets/images/dragon.png\">http://build.fhir.org/assets/images/dragon.png</a></p>\n<div class=\"message_inline_image\"><a href=\"http://build.fhir.org/assets/images/dragon.png\" target=\"_blank\" title=\"http://build.fhir.org/assets/images/dragon.png\"><img src=\"http://build.fhir.org/assets/images/dragon.png\"></a></div>",
        "id": 153982090,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533394874
    },
    {
        "content": "<p>well, we can add that if you want. For editors: it's easy to add this now - just wrap your implementer warning in the source with [%dragons-start] and [%dragons-end%]</p>",
        "id": 153982115,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533417773
    },
    {
        "content": "<p>(in the main build)</p>",
        "id": 153982116,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533417782
    },
    {
        "content": "<p>I'm not sure if this was in jest or not now :~</p>",
        "id": 153982966,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1533611998
    }
]