[
    {
        "content": "<p>Hi:<br>\nWe are trying to map Lab message to FHIR.  For HL7 v2 message with multiple OBRs, should we map them into a single DiagnosticReport with multiple Observations or should we map each OBR to one DiagnosticReport?</p>",
        "id": 153837384,
        "sender_full_name": "George",
        "timestamp": 1468273119
    },
    {
        "content": "<p>well, generally, OBR = DiagnosticReport, so that would be the default expectation. However, use of OBR/OBX is highly variable, and I've seen OBR used is a section header in a report - that would equate to Observation, not DiagnoticReport</p>",
        "id": 153837389,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468274534
    },
    {
        "content": "<p>Is there any preference for Lab messages?</p>",
        "id": 153837391,
        "sender_full_name": "George",
        "timestamp": 1468274964
    },
    {
        "content": "<p>the default would be the preference. you might choose to do otherwise for specific lab messages based on manual inspection of their content</p>",
        "id": 153837394,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468276050
    },
    {
        "content": "<p>I don't think this is hard and fast - as Grahame said, there is considerable variability in the V2 world.  I've seen V2 messages containing multiple OBR's that would be reasonable candidates for a single DiagnosticReport.</p>",
        "id": 153837471,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1468291388
    },
    {
        "content": "<p>Each OBR represents a battery. So in the same message, it contains multiple different battery codes.<br>\nWhen we display to the end user, we put all OBRs and its associated OBX into 1 PDF lab report.</p>\n<p>To Rob: What scenarios  would make multiple OBRs  become reasonable candidates for single diagnosticReport?</p>",
        "id": 153837669,
        "sender_full_name": "George",
        "timestamp": 1468340369
    },
    {
        "content": "<p>user preception that it's a single report, and the fact that all of them are authorised together and published as a group, not separately </p>",
        "id": 153837691,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468351310
    },
    {
        "content": "<p>Yes, user perception is a single report.</p>\n<p>If we map it to a single diagnostic report, does this mean that we need to map each OBR code to Observation.code and use Observation.related to map the OBX?</p>\n<p>On the other hand, if we use multiple diagnosticReport to represent one single report, can we use Bundle resource to group them together?</p>",
        "id": 153837725,
        "sender_full_name": "George",
        "timestamp": 1468358977
    },
    {
        "content": "<p>Yes or they may be  linked by a single order patient-encounter  as well and can be associated that way without bundling.</p>",
        "id": 153837728,
        "sender_full_name": "Eric Haas",
        "timestamp": 1468360409
    },
    {
        "content": "<p>yes, each OBR to Observation.code + use related for the OBXs</p>",
        "id": 153837744,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468362301
    },
    {
        "content": "<p>with regard to bundle, it's a physical arrangement, not a logical one. Resources move in and out of bundles e.g. when you search or not. Putting a resource in a bundle doesn't have any *meaning* </p>",
        "id": 153837745,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468362341
    },
    {
        "content": "<p>and I think that's what you want - what links them together logically. </p>",
        "id": 153837746,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468362357
    },
    {
        "content": "<p>what do you want to link them together? a common order? </p>",
        "id": 153837747,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468362371
    },
    {
        "content": "<p>Hi Grahame,<br>\nThank you for the help. I am working with George for this mapping exercise.<br>\nTo link them logically we map diagnosticReport.identifier to Report ID and battery ID. So the diagnosticReport  resources that belong to the same report will have same report ID.</p>\n<p>Will this approach work to link them together?</p>",
        "id": 153837996,
        "sender_full_name": "Stefanie Walter",
        "timestamp": 1468426660
    },
    {
        "content": "<p>that definitely links them together, for sure. </p>",
        "id": 153838022,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468439144
    }
]