[
    {
        "content": "<p>I have a use case where patients are, in some contexts, identified solely by their association with a particular case (with a case ID) on a specific system. Each case ID on this system is associated with a unique patient, i.e. the system can \"resolve\" a case ID  to a unique individual. However, each patient may have several cases on the system, so the reverse does not hold true (patient does not map to a unique case ID) - this is different from the case of e.g. Social Security Number where there is a 1-to-1 correspondence. </p>\n<p>My question is: what is the guidance is for using such IDs are business identifiers <em>for the patient</em>? Having read the spec documentation of references, managing resource identity etc., I did not find any indication that it is prohibited. However, it would mean that the same Patient would be identifier by multiple codes from the same system (the code system of case IDs). Hence,  different resources referencing the same patient might use different IDs from this system and, conversely, Patient instances may contain multiple codes from the same <code>system</code> in <code>Patient.identifier</code>.</p>",
        "id": 231504561,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1616518433
    },
    {
        "content": "<p>It's not prohibited for an entity to have multiple identifiers from the same system.  All that's required is that a given identifier apply to not more than one entity.  As an example, one person could have multiple credit cards from the same card company.  Some systems might treat credit card number as a patient identifier.</p>",
        "id": 231513497,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616521770
    },
    {
        "content": "<p>OK, thanks for confirmation <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>!</p>",
        "id": 231590738,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1616568873
    }
]