[
    {
        "content": "<p>We will likely have several profiles for many different resources. One example of that is Observations where we can support a BP profile as well as a lab/pathology result profile, or having different types of Encounters ranging from IP to different types of OP which all have different information model requirements (hence different profile requirements).</p>\n<p>Another requirement we have is that depending on profile, we want to allow/support different interactions, ie Read, Create etc. This seems supported, and we can implement multiple profiles. But this does not seem to be possible to represent in the CapabilityStatement as resource.<em>interaction</em> is parallel to resource.<em>profile</em>.</p>\n<p>Is this a known limitation in the CapabilityStatement? Or is it not intended to support different interaction types per profile rather than resource?</p>\n<p>What we seem to need is in the CapabilityStatement relate interactions to the profile rather than resource. </p>\n<p><a href=\"/user_uploads/10155/6t0TwpoIOqLIIoSj_DxUmNyV/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/6t0TwpoIOqLIIoSj_DxUmNyV/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/6t0TwpoIOqLIIoSj_DxUmNyV/pasted_image.png\"></a></div>",
        "id": 186883623,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1580303446
    },
    {
        "content": "<p>Realized I mentioned resource.profile instead of resource.supportedProfile, but hopefully you got the point :)</p>",
        "id": 186885585,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1580304908
    },
    {
        "content": "<p>It's a known limitation.  If you support create on vitals, but not on lab, there's no way to distinguish that computably.  You could consider using extensions if you can agree on a simple enough way to define the expectations in your interoperability space.  Trying to do that generically has proved too complex.</p>",
        "id": 186901760,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580315134
    },
    {
        "content": "<p>I'm intending to discuss this in Sydney next week. It's a topic that bubbles away...</p>",
        "id": 186923862,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580328545
    }
]