[
    {
        "content": "<p>It seems it is possible to declare support for multiple profiles in the capability statement. There is a comment in the spec that state that really that means the union of 2 profiles is supported. Has there been thoughts about leveraging that as a way for a client to request specific profiled versions of a resource? The problem that servers may want to address is globalization of their server. Should it be possible for an implementer to build 1 FHIR server that can support multiple profiles and produce profiled version of the same resource without having to fork based on location in code? A client could pass in some header/parameter requesting a specific profiled version of a resource.</p>",
        "id": 196626811,
        "sender_full_name": "Drew Torres",
        "timestamp": 1588768300
    },
    {
        "content": "<p>Taking an arbitrary instance and a profile URL and then filtering that instance to adhere to a profile is a super-hard problem.  In most cases, an implementation would simply be coded to spit out instances that are valid against all the profiles of interest - which should be possible if the profiles don't inappropriately impose constraints (e.g. limiting name to 1..1)</p>",
        "id": 196650395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588778489
    },
    {
        "content": "<p>There are instances where I have seen profiles going even further by profiling a field to 0..0. Then the concern is about extensions for different profiles, and lastly where the profiles use different value sets for some fields.</p>",
        "id": 196663143,
        "sender_full_name": "Drew Torres",
        "timestamp": 1588783701
    },
    {
        "content": "<p>It may be possible leveraging ontologies to help mitigate mapping internal codes to externally available codes, but then how do you flex that represented resource for each profile.</p>",
        "id": 196663231,
        "sender_full_name": "Drew Torres",
        "timestamp": 1588783757
    },
    {
        "content": "<p>Constraining max cardinality is a bad design choice unless it's reflecting a business rule about the characteristics of the business object.  For example, prohibiting deceased[x] is fine if the rule is that the patient can't be dead, but prohibiting other things is problematic.  Only possible reason is if you're in a \"minimum necessary\" type situation and need to strip data for privacy reasons - but that should ideally be handled by the privacy layer, not the profile.  The desired outcome is you send all possible elements to everyone (filtered by the privacy rules for that recipient), include all codings that are relevant to anyone and for those systems that need to be able to pick one or two items out of a collection, use type, use and other qualifying elements and if necessary extensions to allow them to grab what they need - while still allowing you to send all the others you know.</p>",
        "id": 196663775,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588784013
    },
    {
        "content": "<p>I agree with the statements made, but I haven't seen that in reality. In multiple regions, I have seen fields removed simply to make the API response \"cleaner\" making implementation work globally nearly impossible. I would also agree that sending codes from multiple systems should also be OK, but I fear that is not how they would interpret a required binding. </p>\n<p>Would it be prudent to add more explicit language around how multiple profiles in a single resource could/should be supported?</p>",
        "id": 196725155,
        "sender_full_name": "Drew Torres",
        "timestamp": 1588824107
    },
    {
        "content": "<p>Probably.  As well as some guidance around good practice to provide a bit more weight when implementers need to argue with those who are making interoperability harder...</p>",
        "id": 196732086,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588833950
    },
    {
        "content": "<p>We have had that experience with the <a class=\"stream\" data-stream-id=\"179222\" href=\"/#narrow/stream/179222-finnish-PHR\">#finnish PHR</a> and would have benefited from such guidance.</p>",
        "id": 196758294,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1588851589
    },
    {
        "content": "<p>We are discussing those topic in the conformance group. But that seems to be too far away ...</p>",
        "id": 196769708,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1588858179
    },
    {
        "content": "<p>On a related note (I think), is it possible (or desirable) to have multiple profiles of the same resource in a single IG? For example, multiple QuestionnaireResponse profiles representing multiple types of assessments?</p>",
        "id": 199565366,
        "sender_full_name": "David Reeves",
        "timestamp": 1591140317
    },
    {
        "content": "<p>I do that regularly.  I have multiple Organization profiles depending on use, obviously multiple Observation profiles for different types of Observations.</p>",
        "id": 199565508,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1591140431
    },
    {
        "content": "<p>Generally you wouldn't use profiles on Questionnaire for different types of assessments - you'd just have different Questionnaires.  Profiling of Questionnaires is for when you want to set a particular set of rules for a whole collection of questionnaires (e.g. none of my questionnaires are allowed to use value sets).</p>",
        "id": 199565967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591140883
    }
]