[
    {
        "content": "<p>Let's say I have a lab order with Urine Analysis, Bloodwork, and stool sample. My understanding is that since each of these can be processed separately, it should be 3 ServiceRequests - with the option to connect them via the ServiveRequest.requistion identifier element. </p>\n<p>However, much of the info in these 3 ServiceRequests is the same between these 3 connected ServiceRequests. Is there a model where these three ServiceRequests would be a basedOn a parentServiceRequest to connect them and hold the shared data vs. connecting them via the requisition element? What is the preferred practice for these multiple ServiceRequests (i.e., ServiceRequest.requisition vs. some other mechanism to link them together like ServiceRequest.basedOn)?</p>",
        "id": 178808699,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571786927
    },
    {
        "content": "<p>Shared data is always repeated in FHIR because each resource needs to be shareable independently.  Most of the shared data is lightweight references, so it's not a huge imposition.</p>",
        "id": 178812005,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571790207
    },
    {
        "content": "<p>Note that \"basedOn\" means \"fulfills\", not \"part of\".  The only whole/part relationship in the Request space is RequestGroup - and if you use that, then the statuses of the individual requests become moot and the whole collection must be managed with a single state - that on the RequestGroup.</p>",
        "id": 178812081,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571790288
    },
    {
        "content": "<p>(And even if you use RequestGroup, you'd still have to repeat the subject, author, dates, etc. on each of the child orders)</p>",
        "id": 178812095,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571790313
    },
    {
        "content": "<p>check the note on MedicationRequest page about multiple items in a prescription - the same principles apply</p>",
        "id": 178812259,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571790532
    },
    {
        "content": "<p>Ok I think I see, this page you mention is very useful. <a href=\"https://www.hl7.org/fhir/request.html#compound\" target=\"_blank\" title=\"https://www.hl7.org/fhir/request.html#compound\">https://www.hl7.org/fhir/request.html#compound</a></p>\n<p>I don't think that I want to lose the ability to track the statuses of the individual requests. which I think leaves me with the ServiceRequest.requisition.</p>\n<p>Let's say I want have another resource (e.g., a Communication) that is related to the whole requisition rather than individual ServiceRequests, would I use Communication.basedOn.identifier to point to the requisition identifier?</p>",
        "id": 178812796,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571791181
    },
    {
        "content": "<p>That identifier doesn't really represent a 'request', though I guess it's not prohibited.  What sort of 'Communication' would be done in fulfillment of the requisition (which isn't doing anything other than grouping a bunch of independent orders)?</p>",
        "id": 178813040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571791507
    },
    {
        "content": "<p>For the use case in question, the provider wants to communicate a summary of the handling of all the requests once they've all been handled, or may want to create a CarePlan that is based on the set of requests rather than any individual request in the set.</p>",
        "id": 178813565,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571792284
    },
    {
        "content": "<p>You might tie that to a Task that seeks fulfillment of all of them.  The CarePlan wouldn't need to involve a Communication.  It could simply be basedOn all of the requests.</p>",
        "id": 178814807,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571793480
    },
    {
        "content": "<p>Related to multiple requests and ServiceRequest.requisition... there is a desire to have a \"reason for referral\" that is overall across ALL of the connected ServiceRequests. ServiceRequest resource has some reason fields, but that would be for a single component of the set of Requests. </p>\n<p>Some ideas I have thus far on how to capture \"Reason for Referral\" for a requisition with Multiple ServiceRequests:<br>\n1) Extend the requisition element on ServiceRequest<br>\n2) Have \"SupportingInfo\" for each serviceRequest point to another resource that holds the \"Reason for Referral\".<br>\n3) Use MessageHeader.reason.text. (This one seems inappropriate as it wouldn't be friendly to a parallel RESTful approach when looking at your referral data)<br>\n4) Slice ServiceRequest.reasonCode or ServiceRequest.reasonReference somehow... (i'm new to slicing)<br>\n5) Other?</p>",
        "id": 178977134,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571938721
    },
    {
        "content": "<p>Just specify the reason on each request.  SupportingInfo is intended to contain information relevant to the execution of that request - not a reason for the request.  MessageHeader information isn't generally exposed to end users.  (And you should avoid tying your solution to messaging where possible.)</p>",
        "id": 178986293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571944091
    },
    {
        "content": "<p>If you adopt a Task-centric approach, many of these questions have possibly simpler answers, for example the ability to have multiple Tasks be partOf a top-level Task, where that Task.reasonCode or Task.reasonReference contains your reason for referral. Or, as Lloyd suggested, have a single Task that is basedOn all service requests (if you don't need to track the fulfillment of each Service Request individually).</p>\n<p>Of course, if you need to have the individual ServiceRequests by themselves directly contain the reason, then you'll have some duplication...</p>",
        "id": 179152318,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1572146044
    },
    {
        "content": "<p>That sounds plausible - I'm going to explore that idea of an overarching task vs. duplicating reason across ServiceRequests in depth. Thanks for the ideas. Generally \"Reason for Referral\" is pretty open text-y, would it be accurate to say that Task.reasonCode.text is a more suitable spot to use than task.reasonReference.display?</p>",
        "id": 179428340,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1572440455
    },
    {
        "content": "<p>Remember that each ServiceRequest might be seen totally on its own.  If the reason is relevant, it should be repeated.  While you might be designing a message where everything is sent at once, the resource content should always be constructed presuming that every resource is shared independently.</p>",
        "id": 179431752,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572442598
    }
]