[
    {
        "content": "<p>Codeable concept can have one or more codings inside it, where \" Each coding is a representation of the concept\".</p>\n<p>My question is : <br>\nCan the multiple codings represent only a part of the concept each .<br>\nFor eg : </p>\n<p>CodeableConcept :<br>\n -------          text : \"Fever and headache since 3 days\"<br>\n -------          coding :   [<br>\n ------- ---                                     {<br>\n ------- ---                                           \"code\": \"c1\",<br>\n-------  ---                                         \"display\" : \"fever\"<br>\n ------- ---                                    },<br>\n -------  ---                                    {<br>\n -------  ---                                           \"code\":\"c2\",<br>\n -------  ---                                         \"display\" :\"headache\"<br>\n -------  ---                                  }<br>\n -------  ---                                ]</p>\n<p>Is the above Codeable Concept valid?</p>",
        "id": 153971452,
        "sender_full_name": "Mithilesh gupta",
        "timestamp": 1529920688
    },
    {
        "content": "<p>A related question (or example), can a CodeableConcept have 2 different codings that represent both a drug and it's therapeutic category codes?</p>",
        "id": 153971454,
        "sender_full_name": "John Silva",
        "timestamp": 1529921258
    },
    {
        "content": "<p>The key is that you should be able to pick <em>one</em> coding that provides the most detail and that should be all you need to pay attention to.  The intention is not to convey different \"aspects\" of a concept.  E.g. the therapeutic type, form, strength, etc. of a medication.  However, it is legitimate to provide multiple codings with different degrees of granularity.</p>",
        "id": 153971474,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529922319
    },
    {
        "content": "<p>e.g. the answer is 'it's valid, but not a good idea'</p>",
        "id": 153971482,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529922654
    },
    {
        "content": "<p>Yes, someone pointed this out to me at the \"Profiling table\" at DevDays; (not a good idea).   However, the problem is that there isn't a proper way to represent categories of drugs in the Medication resource hence I'm left with going with an extension or this 'hack'.   (The FHIR Observation has the category property, why doesn't Medication?)   I guess it's time for a GF item?</p>",
        "id": 153971528,
        "sender_full_name": "John Silva",
        "timestamp": 1529928024
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> ?</p>",
        "id": 153971550,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529937206
    },
    {
        "content": "<p>MedicationKnowledge has looked at that kind of considerations.</p>",
        "id": 153971553,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529937364
    },
    {
        "content": "<p>if you mean to present / define concepts and their relations (e.g. hyerarchical) then you would use something like medicationKnowledge</p>",
        "id": 153971554,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529937776
    },
    {
        "content": "<p>in a prescription or dispense, you typically would not say \"i have given aspirin, which by the way is a pain killer\"</p>",
        "id": 153971555,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529937800
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - I went to the STU3 Medication resource page and it shows it referenced by MedicationKnowledge (but it is maturity 0 -- a little worrisome using such a low maturity resource).  I suppose this would be a more appropriate way of representing this relationship though.  (Yes, aspirin is ordered and aspirin is a neuro drug and a pain killer and ... etc.; it can belong to many therapeutic categories.  The pharmacist knows these relationships when ordering, maybe not as important when dispensing.  In our use case we're dealing with the MedicationRequest order which refers to the Medication being ordered.   The 'I have given aspirin' would be the MedicationAdministration.)</p>",
        "id": 153971587,
        "sender_full_name": "John Silva",
        "timestamp": 1529940456
    },
    {
        "content": "<p>I should have written \"please give aspirin\" instead of  \"i have given aspirin\"</p>",
        "id": 153971588,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529940530
    },
    {
        "content": "<p>the concept is the same</p>",
        "id": 153971589,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529940537
    },
    {
        "content": "<p>i agree, the \"knowledge\" resource is not mature. But if you want to convey that kind of information in a prescription, you should make sure you explicitly state what the doctor ordered.</p>",
        "id": 153971590,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529940767
    },
    {
        "content": "<p>Thinking about this a little more --- there is the concept of the Formulary -- the set of drugs and their categorization that are available for ordering (inpatient or prescribing for outpatient) that seems to be separate from the Med Orders and Med Admins!   The \"Formulary\" exists 'outside of' the Med Orders and Med Admins; how would one expect to maintain that info in a FHIR store?   Are the current Med-related resources sufficient for representing the formulary, from which then, these related concepts can be applied to individual Med Orders and Med Admins?</p>",
        "id": 153971591,
        "sender_full_name": "John Silva",
        "timestamp": 1529940796
    },
    {
        "content": "<p>(Terminology question -- to me 'ordering' seems to apply to inpatient settings whereas prescribing seems to apply to outpatient settings, is that appropriate?   It seems to me as a 'newbie' to FHIR [but not to HL7 V2] that the current Med-related resources seem to be more focused on the outpatient use cases.)</p>",
        "id": 153971593,
        "sender_full_name": "John Silva",
        "timestamp": 1529940906
    },
    {
        "content": "<p>in the cases i am considering, the physician says \"please give this person aspirin\" and then you have a system that says \"yes, and aspirin is a pain killer\", so the system appends \"this is a pain killer in case you want to substitute\"</p>",
        "id": 153971594,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529940989
    },
    {
        "content": "<p>Odering  / Prescription - those semantics are not enforced. in V2 terms, \"MedicationRequest\" covers OMP and RDE.</p>",
        "id": 153971595,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529941031
    },
    {
        "content": "<p>the Formulary is exactly what is covered by medicationKnowledge. That is the resource that is designed to represent the definition of a drug and its relationships</p>",
        "id": 153971596,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529941123
    },
    {
        "content": "<p>Thanks!  Yes, the semantics of 'order vs prescription' are vague; I guess order can apply to many more things than just meds whereas prescription typically only applies to meds.   Yes, I've been trying to map V2 RDE (not so much OMP) to FHIR Med-related resources --- it's been 'real fun'! ;-)   I've submitted a GF tracker item to get mappings for the underlying Dosage and Timing data types since these are key to handling these HL7 V2 message mappings.</p>\n<p>(See my post in 'v2 to FHIR' thread about this attempted V2 mapping:  <a href=\"#narrow/stream/32-v2-to.20FHIR/subject/Mapping.20of.20RDE.2C.20RAS.2C.20etc.2E.20medication-related.20messages.3F\" title=\"#narrow/stream/32-v2-to.20FHIR/subject/Mapping.20of.20RDE.2C.20RAS.2C.20etc.2E.20medication-related.20messages.3F\">https://chat.fhir.org/#narrow/stream/32-v2-to.20FHIR/subject/Mapping.20of.20RDE.2C.20RAS.2C.20etc.2E.20medication-related.20messages.3F</a> )</p>",
        "id": 153971597,
        "sender_full_name": "John Silva",
        "timestamp": 1529941192
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> The MedicationKnowledge resource is draft - it is very new and is being worked on and has not been approved as a resource by the FHIR Management Group.  The Medication resource went under some changes as a result of the discussion that this resource would include attributes about the medication needed to prescribe/order, dispense, administer and make usage statements about.  It is possible that some additional attributes are needed on this medication resource.</p>",
        "id": 153971607,
        "sender_full_name": "Melva Peters",
        "timestamp": 1529942602
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  - thanks for this update.  Can you ask the committee how they plan on representing \"Therapeutic categories\" or how they'll consider it in their use cases?</p>",
        "id": 153971621,
        "sender_full_name": "John Silva",
        "timestamp": 1529947093
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> The MedicationKnowledge resource has \"medicineClassification\" with a type and a codeableConcept - cardinality is 0..*  I would suggest that you add a tracker item with your use case if you think it should also be included in Medication</p>",
        "id": 153971623,
        "sender_full_name": "Melva Peters",
        "timestamp": 1529947227
    },
    {
        "content": "<p>I've contended a bit with this and have been reading the literature on the lines between the reference model and the ontological model. There aren't a lot of solid answers out there.</p>\n<p>Should medication category be something that is handled by the terminology or ontology and not the information model?</p>\n<p>I would also love to see a breakdown of the ideal FHIR representation of 'Fever and headache for 3 days'. My understanding of multiple codings within a single concept is that they are meant to represent the same concept, just with various systems and possibly various granularities (with the user selected field indicate which was initially chosen). </p>\n<p>What the initial poster was seemingly trying to do was use a coding array as like compositional grammar to postcoordinate a concept, which I don't think is correct?</p>",
        "id": 153971639,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1529957081
    },
    {
        "content": "<p>OK, done.  <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17411\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17411\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17411</a></p>",
        "id": 153971664,
        "sender_full_name": "John Silva",
        "timestamp": 1529962707
    },
    {
        "content": "<p>I'll reiterate what <span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span> said that multiple codings within a single concept are meant to represent the same concept, but potentially with different systems and possibly different granularities - and I agree that using a set of Codings in a CodeableConcept as if they would function as a compositional grammar to post-coordinate a concept is definitely not intended.  In the CodeableConcept documentation we state that: \"More than one code may be used in CodeableConcept. The concept may be coded multiple times in different code systems (or even multiple times in the same code systems, where multiple forms are possible, such as with SNOMED CT). Each coding (also referred to as a 'translation') is a representation of the concept as described above and may have slightly different granularity due to the differences in the definitions of the underlying codes.\"  We may want to consider adding a statement that explicitly excludes attempting to use a set of Codings within CodeableConcept as a surrogate post-coordination grammar.</p>",
        "id": 153971816,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1530026283
    },
    {
        "content": "<p>And explicitly state that if you need multiple concepts, use multiple attributes, including introducing extensions if necessary.  (Sending multiple concepts in a core element should never be used as a means to avoid introducing extensions.)</p>",
        "id": 153971882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530036486
    },
    {
        "content": "<p>Concur with <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> that multiple code systems can be used to describe the same thing and meet different coding requirements or have different features for implementations.  </p>\n<p>Take for example qualitative test result values.  SCT qualifier codes are required for US MU/law for public health reporting.  LOINC Answer codes are also available.  Both can be used.  Folks likely know there are differences in both sets of terminology and so an implementer may wish to send both so end users can realize benefits of both.  </p>\n<p>Another example is for genomic test result values.  Multiple code systems may be desired to notate test result values per regulatory or other requirements, using standardized nomenclature, etc.</p>",
        "id": 153972081,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1530108069
    },
    {
        "content": "<p>Agree we need to make clearer that the OP's use of translations to do composition is verboten. But that brings up the need to provide a clear general example of what <strong>should be done instead.</strong> This is similar to wanting to add parts of a complex drug such as strength, form, etc. as \"translations\" assuming you can't send a code that has that information embedded within the meaning. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  can we add creating an example showing a solutiion for encoding complex ideas to our to-do list?</p>\n<p>Regarding the desire to provide additional information about a code such as it's classification - without evoking the idea of a FHIR <code>MedicationKnowledge resource</code>, this has been the job of a code system (ontology type) and for the example given you absolutely could expect a user to take your code in a resource and separately (not in FHIR) do a query to find the codes \"category.\" IMHO jamming this into FHIR follows the 'we have a hammer so lets use it' approach to the future, but given the interest, I'll jump on the wagon. I'll agree with <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>, this should be handled in FHIR using the <code>MedicationKnowledge</code>if you want to say \"this is the category I have decided, for this use for this coded drug. What I'm not seeing is how you would link the <code>MedicationKnowledge</code>you want to a medication resource of the appropriate type (Request, admin, etc.) that is the instance of the drug use you want to also define the category for.</p>",
        "id": 153972182,
        "sender_full_name": "Robert McClure",
        "timestamp": 1530127553
    }
]