[
    {
        "content": "<p>According to <a href=\"https://www.hl7.org/fhir/icd.html\">https://www.hl7.org/fhir/icd.html</a> you can have multiple codes in a single code attribute.</p>\n<div class=\"codehilite\"><pre><span></span><code>  &lt;coding&gt;\n    &lt;system value=&quot;http://hl7.org/fhir/sid/icd-10&quot;/&gt;\n    &lt;code value=&quot;J21.8 B95.6&quot;/&gt;\n  &lt;/coding&gt;\n</code></pre></div>\n<p>Many things bother me with that. How would exact (default) code search work? Should the server say \"I found the code you want \"B95.6\" as a sub-component of the code attribute\" (essentially a contains) OR should the user have to query for \"J21.9 B95.6\" to get this row? How are the dagger, bang and star handled (+!*)? How would the user know the sequence of the codes to query, especially when you get to 3+ codes? </p>\n<p>How would the &lt;display&gt; attribute be formed for a multi-code code attribute?<br>\nHow would a validator (which are typically, value in value set/value not in value set) comparators work?</p>",
        "id": 247970404,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1627937749
    },
    {
        "content": "<p>Coding.code is considered to be a single code.  What you're seeing above is a single code which is a post-coordinated expression made up of multiple codes (just a slightly more obvious example of the UCUM code \"mg\" which is made up of the code \"m\" and \"g\".  In order to do this, the code system in question must define a grammar and semantic interpretation for the code string.  If there is no grammar defined by the code system, then it's not allowed.  In the case of ICD, the convention is clearly documented in the specification and thus it's allowed.  Expectations around the creation of a 'display' is also up to the code system, though in some cases, FHIR might choose to clarify if the code system does not.  Any terminology server would have to have the post-coordination rules for the code system build in.  Some servers might not support post-coordination even if the code system allows it.</p>",
        "id": 248176039,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627957227
    }
]