[
    {
        "content": "<p>In FHIR, can a Person be a Patient, RelatedPerson and Practitioner at the same time?</p>\n<p>And can someone explain the consequence of these statements:</p>\n<p>\"Not many systems actually implement a shared Person record, and as such the values DO become out of sync with each other. The inclusion of this resource does permit a capability for systems to identify other instances of this actual person's data via a centralized registry that can assist in keeping things up to date.\"</p>\n<p>Follow-on question: Would a Person registry be a smart thing to add to a FHIR-compliant architecture?  Thanks</p>",
        "id": 153934851,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1517523907
    },
    {
        "content": "<p>yes, a real life person may manifest as all of those things. Staff in country hospitals almost certainly will.</p>",
        "id": 153934852,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517523968
    },
    {
        "content": "<p>for the follow on question, I think about it as a business question: is it a smart thing for a business to track individuals across their multiple roles.... if so, then it's a smart thing to have a person registry.  But few organizations do have such a thing.... so maybe it's not often a net benefit once you account for the costs</p>",
        "id": 153934853,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517524048
    },
    {
        "content": "<p>\"A real life Person may manifest\"... agreed, but how is it managed in FHIR?</p>\n<p>As to the cost / benefit - could an argument be made for interoperability starting with a register and connecting aliases?</p>",
        "id": 153934854,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1517524296
    },
    {
        "content": "<p>it is managed using the Person resource</p>",
        "id": 153934855,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517524400
    },
    {
        "content": "<p>Thanks Graheme.  So is the following statement relevant to that approach?</p>\n<p>\"The inclusion of this resource does permit a capability for systems to identify other instances of this actual person's data via a centralized registry <br>\nthat can assist in keeping things up to date.\"</p>\n<p>In other words, would the Person resource treat 'John Doe' from an EHR and 'Doe, John Q.' as the same entity?</p>",
        "id": 153934856,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1517524758
    },
    {
        "content": "<p>that's the point of Person - to link the 2 of them an indicate that they are the same real world person</p>",
        "id": 153934860,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517525352
    },
    {
        "content": "<p>Person has a few use-cases.  It can serve as a way to maintain a shared set of demographics - systems could maintain minimal (or differential) demographics on Patient/RelatedPerson/Practitioner and maintain most on Person.  (Though this would be best from an internal/persistance perspective rather than an external/exchange perspective.)  It can also be used where full demographics are maintained on all resources, but Person helps to maintain consistency by acting as a central source of truth which can trigger updates to others.  It can also be used to note that Dr. Smith = Patient Smith, which can be helpful in monitoring for inappropriate access violations.</p>",
        "id": 153934896,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517531297
    },
    {
        "content": "<p>Typically those use-cases only manifest in relatively advanced implementations</p>",
        "id": 153934898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517531386
    },
    {
        "content": "<p>As well, all of those uses can raise some dicey security/privacy issues, so care needs to be taken when implementing them.</p>",
        "id": 153934899,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517531417
    }
]