[
    {
        "content": "<p>We have FHIR service where are validating incoming messages against the service profile, but we get errors validating againt the referenced profiles since they also should be custom (they are not defined so they expect all the default values, wich they do not have). I see that the default reference definitions are like this: &lt;profile value=\"<a href=\"http://hl7.org/fhir/StructureDefinition/Organization\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/Organization\">http://hl7.org/fhir/StructureDefinition/Organization</a>\" /&gt;<br>\nThe messages the service support are bundles containing both the main object (CommunicationRequest) and the referenced objects (Device and Organization), where the main message is CommunicationRequest which contain references to the other objects.<br>\nHow should the profile be edited to support more than one profile? Is it possible to create a bundle profile containing the definitions of the objects inside it, or should the profiles be seperate? If so, what is the syntax for profile value, can it be a relative path?</p>",
        "id": 153847445,
        "sender_full_name": "Odd A. S. Dahl",
        "timestamp": 1474019849
    },
    {
        "content": "<p>you need to provide a lot more context</p>",
        "id": 153847448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474020739
    },
    {
        "content": "<p>I don't know how to answer your questions because I don't have enough context about what you are doing</p>",
        "id": 153847449,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474020776
    },
    {
        "content": "<p>I might not know enough about how profiles are used, but I'll try:<br>\nThe service we have uses CommunicationRequest messages, and we have a custom CommunicationRequest profile that we want to validate the incoming messages against. This works as expected, but in CommunicationRequest the sender and recipient elements are their own FHIR objects (not a part of the CommunicationRequest profile definition). We can validate the messages against the custom CommunicationRequest profile, but get errors on the sender and recipient objects because we do not have any custom profile definitions for them. We do the validation in one step, so we might have to validate them seperatly if it is not possible to do it in one go.</p>",
        "id": 153847451,
        "sender_full_name": "Odd A. S. Dahl",
        "timestamp": 1474021277
    },
    {
        "content": "<p>You should never get an error validating against the base resource that you wouldn't get if the instance was validated against a profile - profiles must, by definition, be tighter than the base resource.  Can you explain what you mean by \"defaults\"?  Profiles aren't allowed to declare default values - only resource definitions can do that.</p>",
        "id": 153847492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474062757
    }
]