[
    {
        "content": "<p>I am looking at trying to get a single get request/query return from multiple systems. We have the system to make the same call to many many systems &amp; this question is about aggregating the responses into a single document. <br>\ni.e. imagine you had a GP system, an Acute system &amp; a Community care system. </p>\n<p>So you want to say \"Give me all of Bob's allergies\" where the different systems might have differing result (some the same, some different) e.g. GP says penicillin, acute says pen &amp; latex &amp; community care says pen &amp; dust mites.  </p>\n<p>Is there an obvious/standard structure into which I can place a top level of these systems , under which is the return for the specific query? e.g. /systems/GP/Allergies, /systems/Acute/Allergies, /systems/CommunityCare/Allergies etc. We are looking to target V4 &amp; looking at the docs I can't quite see an obvious candidate.</p>\n<p>Ah the joy of cleaning up after years of disconnected working &amp; record taking......</p>",
        "id": 242700513,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1623744591
    },
    {
        "content": "<blockquote>\n<p>a top level of these systems</p>\n</blockquote>\n<p>I don't know what this means</p>",
        "id": 242702489,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623745893
    },
    {
        "content": "<p>Imagine I am wanting to return an allergies list from each clinical system where a clinical system = \"GP System\" &amp; handles GP'es making GP records vs Hospital System, and hospital records etc.,etc.</p>\n<p>Our \"Fhir Facade\" can ask each of our clinical systems the same question &amp; then would look to aggregate the individual (e.g. allergies) FHIR responses into a single document where each response is represented as a child of the system which returned it. </p>\n<p>So you would see something like:</p>\n<p>&lt;DocRoot&gt;<br>\n  &lt;ClincialSystems&gt;<br>\n    &lt;ClincialSystem name=\"GP\"&gt;<br>\n    Individual FHIR Query response structure e.g. list of allergies<br>\n    &lt;/ClincialSystem&gt;<br>\n    &lt;ClincialSystem name=\"Acute\"&gt;<br>\n    Individual FHIR Query response structure e.g. list of allergies<br>\n    &lt;/ClincialSystem&gt;<br>\n    &lt;ClincialSystem name=\"CommunityCare\"&gt;<br>\n    Individual FHIR Query response structure e.g. list of allergies<br>\n   &lt;/ClincialSystem&gt;<br>\n  &lt;/ClincialSystems&gt;<br>\n&lt;/DocRoot&gt;</p>\n<p>The rationale is that we need to know where (which clinical system) each query return came from and will allow clinicians to note where there are differences between the responses from other systems e.g. the GP may not be aware of the Community Care dust mite allergy or the Acute Latex Allergy &amp; thus may want to take appropriate actions to rectify differences.</p>",
        "id": 242706369,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1623748291
    },
    {
        "content": "<p>Ah just found : \"Grahame Grieve - One FHIR Facade for Multiple Servers | DevDays November 2020 Virtual\" on youtube . Hopefully the answer is in there.</p>",
        "id": 242709347,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1623749947
    },
    {
        "content": "<p>Some other points. <br>\n(1) Interesting vid as it has raised the problems we have ID'ed so that's a useful second opinion. <br>\n(2) At this stage we are looking to have an ephemeral facade i.e. the end systems own their data &amp; we are simply an aggregation service so we ask the end servers every time.<br>\n(3) We keep data effectively for ever (long after a patient has died)<br>\n(4) We need to split by clinical System because we feel de-duplicating is dangerous so we would rather show duplicate data than erroneously remove duplicates<br>\n(5) Given the age of our records and the variety of different systems we will have different codesystems/taxonomies and I have too many scars from taxonomic mismatching to wish to do some sort of taxonomic normalisation (e.g. everything to snomed).<br>\n(6) We are instituting a common JWT with common RBAC etc codes wrt human fertility, sexual &amp; mental health etc &amp; the end servers are responsible for what they pass back on that basis. No records found due to those reasons is acceptable.<br>\n(7) Part of the reason for splitting by clinical system is to allow for if a system has not responded, this can be made clear to the client.<br>\n(8) The Facade has no capabilities of its own and as such each server has a capability statement which our facade queries periodically to build up a aggregated capability statement which allows us to route queries to servers with that declared capability.</p>",
        "id": 242712704,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1623751848
    },
    {
        "content": "<p>A FHIR server can return only a flat list of resources in response to a search request, so it has to return either (1) all the allergies as they are recorded in the different systems or (2) some kind of consolidated list if the facade is able to de-duplicate or combine data coming from different systems. In case (1)  you can use Provenance to represent where the data came from</p>",
        "id": 242726977,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1623761435
    },
    {
        "content": "<p>If they come from different systems, then they should have different base url</p>",
        "id": 242733846,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1623764524
    },
    {
        "content": "<blockquote>\n<p>The rationale is that we need to know where (which clinical system) each query return came from and will allow clinicians to note where there are differences between the responses from other systems e.g. the GP may not be aware of the Community Care dust mite allergy or the Acute Latex Allergy &amp; thus may want to take appropriate actions to rectify differences.</p>\n</blockquote>\n<p>I understand that, and agree about the challenges with matching: an unresolvable problem without significant clinical efforts that are unlikely to pay off at the moment. You effectively have three choices:</p>\n<p>#1 use Resource.meta.source to indicate the source system, and require source systems to expose the source when displaying the results of a search<br>\n#2 think of this as a document, prepared by a server, with a Composition resource doing your structuring as you show, Define a document format profile, and use the standard operation to generate a patient document on request<br>\n#3 define your own custom operation</p>\n<p>My recommendation would be #2. I think you're not thinking about a 'facade' in the sense that's a FHIR API that's a facade on multiple APIs; you want a server that does more than that.</p>",
        "id": 242802606,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623792706
    },
    {
        "content": "<p>thanks</p>",
        "id": 242881173,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1623850638
    },
    {
        "content": "<p>&amp; yes it does / will do more than that. This is the stage 1 foot in the door exploration of the possible/ the best way.</p>",
        "id": 242889703,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1623854124
    }
]