[
    {
        "content": "<p>The discussion of <a href=\"http://build.fhir.org/conformance-rules.html#mustSupport\">must support</a> in FHIR says that MS is IG dependant and no elements in the core spec are flagged as MS. However, <a href=\"http://build.fhir.org/vitalsigns\">vital signs</a> declare several elements as MS. What is the required MS meaning for these?</p>\n<p>The base vital signs profile makes component.value[x] must support. <a href=\"http://build.fhir.org/bodyheight.html\">Height</a> and <a href=\"http://build.fhir.org/bodyweight.html\">Weight</a> derive from the base vital signs profile, (and thus, inherit the base profile's MS obligations) but it would be (I assume) unusual to find component.value[x] in a height or weight. What is the intended obligation of a system to support component in this case?</p>",
        "id": 255285950,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632858219
    },
    {
        "content": "<p>I <em>think</em> there's a change request about this already.  It's definitely something that needs to be addressed, because we're not following our own methodology around mustSupport</p>",
        "id": 255291568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632860350
    },
    {
        "content": "<p>Ah -- <a href=\"http://jira.hl7.org/browse/FHIR-20192\">J#20192</a> covers the fact that vitals use MS but we don't specify what is required; <a href=\"http://jira.hl7.org/browse/FHIR-28190\">J#28190</a>, <a href=\"http://jira.hl7.org/browse/FHIR-28191\">J#28191</a>, <a href=\"http://jira.hl7.org/browse/FHIR-28192\">J#28192</a> cover the fact that MS doesn't make sense on component.value[x] for height, weight, and BMI (although, I'm not sure their inclusion is a typo as claimed in the tickets).</p>",
        "id": 255294602,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632861249
    },
    {
        "content": "<p>I'm hoping that those two sets of tickets will end up meaning that a system that supports vital signs will not be expected to support component.value[x] (or actually, any of component)  unless the system supports one of vital sign profiles that explicitly makes use of component, i.e. panel.</p>",
        "id": 255295261,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632861518
    },
    {
        "content": "<p>(or blood pressure)</p>",
        "id": 255331981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632882654
    },
    {
        "content": "<p>maybe take up that specific point with <a class=\"stream\" data-stream-id=\"179256\" href=\"/#narrow/stream/179256-Orders-and-Observation-WG\">#Orders and Observation WG</a></p>",
        "id": 255347367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632895905
    },
    {
        "content": "<p>I think they are typos because they were introduced/copied from argo data query without removing the MS tags which are meaningless without a definition.   This solution would mean that there will be no MS on these profiles.   <a href=\"http://jira.hl7.org/browse/FHIR-20192\">FHIR-20192</a> proposed resolution is potentially troublesome for downstream profiles which might have a conflicting MS rules with any base MS rules.</p>",
        "id": 255414407,
        "sender_full_name": "Eric Haas",
        "timestamp": 1632927675
    },
    {
        "content": "<p>I don't think that's the solution.  I think the intention really is that at least some elements are supported.  (Claiming to comply with the profile and not having an Observation.value but instead sticking the value in Observation.code.text or something is definitely intended to be non-conformant.)  However, the mustSupport expectations do need to be clarified and to make sure they're only in places they need to be.</p>",
        "id": 255492331,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632958207
    },
    {
        "content": "<blockquote>\n<p>I think the intention really is that at least some elements are supported. </p>\n</blockquote>\n<p>I authored the core profile and I failed to consider that the must support language was missing.  Ergo it is indeed an error of omission for which in retrospect was a good thing.  I think getting consensus on MS rules in the core spec now is going to be hard.  I drafted  a proposal that outlines some basic FHIR RESTful Rules that may be anodyne enough to pass muster.   see <a href=\"http://jira.hl7.org/browse/FHIR-20192\">FHIR-20192</a></p>",
        "id": 255508138,
        "sender_full_name": "Eric Haas",
        "timestamp": 1632969532
    },
    {
        "content": "<p>I think that's weaker than necessary.  I'd say \"Sender: If your system is capable of capturing the vital sign with discrete data values and recognizing that it is a vital sign that falls within the scope of the profile, then you SHALL be capable of populating those elements marked as mustSupport with data.\"  I don't think we much care what receivers do with the data.</p>",
        "id": 255508783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632970051
    }
]