[
    {
        "content": "<p>I have always found it a little difficult understanding the semantics of 'must support' versus cardinality. Is it possible to have 'must support' on an element with a minimum cardinality of 0?</p>",
        "id": 153887365,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1494013867
    },
    {
        "content": "<p>Absolutely.  E.g. Patient.deceasedDate</p>",
        "id": 153887367,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494014001
    },
    {
        "content": "<p>If I recall correctly, \"must support\" means \"you need to understand what to do with this element if it is there.\" Cardinality just says whether it needs to be there.</p>",
        "id": 153887368,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1494014024
    },
    {
        "content": "<p>Cardinality is 0 - we allow you to send patient's who aren't deceased and don't require you to make them so before sending data.  However, if they <em>are</em> deceased, we expect you to be able to capture/send/understand/display/include in decision support logic/report based on/whatever that data element.</p>",
        "id": 153887369,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494014064
    },
    {
        "content": "<p>(The specific meaning of mustSupport is dictated by the IG or profile that uses it as \"support\" means different things in different contexts.)</p>",
        "id": 153887371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494014088
    },
    {
        "content": "<p>I see. I guess its trying to understand what it means when one requires \"you need to understand what to do with this element if it is there\". I assume it doesn't matter to the server but only to the consumer of the resource.</p>",
        "id": 153887374,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1494014288
    },
    {
        "content": "<p>Well, it matters for servers too - for example not throwing it away.  (Servers aren't required to support all element they receive - they may throw away certain extensions and might also throw away core elements in some cases.)</p>",
        "id": 153887376,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494015840
    },
    {
        "content": "<p>But it's not something you can test by looking at an instance, you can only check \"mustSupport\" by looking at the behavior of the system.</p>",
        "id": 153887377,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494015867
    }
]