[
    {
        "content": "<p>Hi,</p>\n<p>I have a question about the correct usage of the \"Must Support\" property for profiling <a href=\"http://build.fhir.org/profiling.html#mustsupport\" target=\"_blank\" title=\"http://build.fhir.org/profiling.html#mustsupport\">http://build.fhir.org/profiling.html#mustsupport</a>: <br>\nThe definition for \"Must Support = True\" is available but somehow the definition of \"Must Support = False\" is missing, or am I missing something (maybe an implicit hint)?</p>\n<p>Does \"Must Support = False\" mean that this element is optional? If yes, does it have the same meaning as if this property isn't available at all (which according to the spec is possible, see first sentence: \" One of the properties that <em>can</em> be declared on profiles…\")? </p>\n<p>In my opinion there should be three definitions for the usage of the \"Must Support\" property:</p>\n<ul>\n<li>Must Support = True means …</li>\n<li>Must Support = False means …</li>\n<li>Must Support property isn't available means …</li>\n</ul>\n<p>or are the latter two not defined by the base FHIR spec on purpose and are up to the implementers for definition?</p>",
        "id": 153974311,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1531142878
    },
    {
        "content": "<p>when mustSupport is missing, it is simply an indication that THAT StructureDefinition has not declared mustSupport constraint, therefore 'see predecessor', aka the base structure definition upon which THIS is built...   I am not sure false is logical, as successor can't really undo a constraint of a predecessor.</p>",
        "id": 153974315,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531144424
    },
    {
        "content": "<p>You can't change mustSupport to \"false\" if the parent IG has set it to true.  (Which can be a challenge with mustSupport being declared in parent IGs...)</p>",
        "id": 153974323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531147655
    },
    {
        "content": "<p>I've talked with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> about this topic and during this discussion he pointed out that there are actually not just three but four different options for the \"Must Support\" property. The fourth one is when the property is available but empty, so the correct list looks like this:</p>\n<ul>\n<li>Must Support = \"True\" means …</li>\n<li>Must Support = \"False\" means ...</li>\n<li>Must Support property isn't available means …</li>\n<li>Must Support = \"\" means ...</li>\n</ul>\n<p>which could potentially lead to a lot of different interpretations out in the field. <br>\nTherefore it might be useful to add some information in the spec about these options and how implementers should deal with it, while creating profiles. I will create a gforge tracker for this topic.</p>",
        "id": 153974436,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1531211966
    },
    {
        "content": "<p>gforge tracker #17476</p>",
        "id": 153974871,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1531385258
    },
    {
        "content": "<p>note: the 4th option is not valid. It can only be missing | true | false</p>",
        "id": 153975581,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531774862
    }
]