[
    {
        "content": "<p>Hello, in the structure definition of a US Core resource, say Encounter, there are data elements that are \"Must Have\" and then there are others that are under \"Must Support\". All of them have an \"S\" in Red in the differential view; Only the ones that are \"Must Have\" have a cardinality of 1..1 or 1..*.  <br>\nWe are implementing a FHIR server that reads data from an EHR system and creates FHIR resources to be consumed. My question is when creating a FHIR resource, it is required to output the \"must support\" elements? Or can I just create a FHIR resource with \"Must Have\" elements? The FHIR java validator does not give any error when validating a resource with the \"must have\" elements against a us core profile.  Thanks.</p>",
        "id": 193076889,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1586195273
    },
    {
        "content": "<p>You have to output only the 'must have' (min. cardinality = 1) elements</p>",
        "id": 193077247,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1586195413
    },
    {
        "content": "<p>My understanding is that you omit the Must Support elements <strong>iff</strong> there is no data to output.<br>\n<a href=\"https://build.fhir.org/ig/HL7/US-Core/guidance.html#must-support\" title=\"https://build.fhir.org/ig/HL7/US-Core/guidance.html#must-support\">https://build.fhir.org/ig/HL7/US-Core/guidance.html#must-support</a></p>",
        "id": 193078535,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1586196001
    },
    {
        "content": "<p>oh yes ... if you have the data you have to output it...</p>",
        "id": 193087656,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1586200272
    },
    {
        "content": "<p>More specifically, you must be <em>capable</em> of spitting out the must support elements.  Whether you share them with a given recipient is allowed to depend on business rules, contractual obligations, privacy settings, etc.  However, if you're not able to share the data element with anyone, you're non-conformant.</p>",
        "id": 193107273,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586210153
    },
    {
        "content": "<p>One thing to be careful of is that all of the MUST SUPPORT elements don't always show up in the differential view in US Core, because some of the US Core profiles build off other profiles that bring along additional MUST SUPPORT elements (and are inherited into the US Core profile).  For example, you have to look in the 'Full View', not 'Differential View' to see all the MUST SUPPORT elements in the Pediatric Weight profile: <a href=\"https://www.hl7.org/fhir/us/core/StructureDefinition-pediatric-weight-for-height.html\" title=\"https://www.hl7.org/fhir/us/core/StructureDefinition-pediatric-weight-for-height.html\">https://www.hl7.org/fhir/us/core/StructureDefinition-pediatric-weight-for-height.html</a></p>",
        "id": 193197280,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1586270362
    },
    {
        "content": "<p>I bring that up because the statement 'All of them have an \"S\" in Red in the differential view' isn't always true from a completeness perspective, and is something I missed initially.</p>",
        "id": 193198217,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1586270736
    },
    {
        "content": "<p>We intend to define a new 'view' in IGs that provides a consolidated list of all mustSupport, mandatory and modifier elements - i.e. everything an implementer definitely needs to be paying attention to.</p>",
        "id": 193202133,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586272217
    },
    {
        "content": "<p>And Conformance is working on an extension to help with specifying the expectations for mustSupport elements.</p>",
        "id": 193210101,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1586275301
    },
    {
        "content": "<p>that extension could be interesting to put in the publisher or template (layouts) - so that implementers can see the meaning/level or MustSupport</p>",
        "id": 193210336,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586275390
    },
    {
        "content": "<p>Yes, exactly. It should help with formalizing - if someone wants it...</p>",
        "id": 193220430,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1586280018
    },
    {
        "content": "<p>Thank you for your replies. If not displaying \"must support\" elements makes a resource non-conformant, why is the cardinality 0..* in the profile? Why is it not deemed mandatory then?</p>\n<p>This is command I've been using to validate a us core encounter resource -  java -jar \"org.hl7.fhir.validator.jar\" \"C:\\Users\\lbhamidipati\\Documents\\FHIR\\EncounterR4.json\" -version 4.0 -ig hl7.fhir.us.core#3.1.0 -profile \"<a href=\"http://hl7.org/fhir/us/core/StructureDefinition/us-core-encounter\" title=\"http://hl7.org/fhir/us/core/StructureDefinition/us-core-encounter\">http://hl7.org/fhir/us/core/StructureDefinition/us-core-encounter</a>\" (edited) . With this if I have just the \"must have\" elements, validation is successful.</p>",
        "id": 193222632,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1586281063
    },
    {
        "content": "<p>I don't know in the US profile, but must support does not mean \"cannot be empty\"</p>",
        "id": 193224228,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586281918
    },
    {
        "content": "<p>For example we have this in a Must Support attribute:</p>\n<p>This field has a Must Support flag. In this case it means: systems receiving the attribute SHALL NOT ignore it. Systems that can populate this information SHALL be able to fill in the field. For those systems, the decision on which information is appropriate to send must consider relevance, privacy considerations, etc. - this can be understood simply as 'Systems that contain appropriate information to send SHALL be able to send it using this field'</p>",
        "id": 193224305,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586281952
    },
    {
        "content": "<p>I just saw Lloyd's message. That's it.</p>\n<blockquote>\n<p>Whether you share them with a given recipient is allowed to depend on business rules, contractual obligations, privacy settings, etc...<br>\nif you're not able to share the data element with anyone, you're non-conformant.</p>\n</blockquote>",
        "id": 193224579,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586282119
    },
    {
        "content": "<p>MustSupport deals with \"capability of the system\".  Cardinality deals with what must appear in the instance.</p>",
        "id": 193224777,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586282224
    },
    {
        "content": "<p>Thank you, that helps with my understanding. According to this statement in <a href=\"https://build.fhir.org/ig/HL7/US-Core/guidance.html#must-support\" title=\"https://build.fhir.org/ig/HL7/US-Core/guidance.html#must-support\">https://build.fhir.org/ig/HL7/US-Core/guidance.html#must-support</a> - \"NOTE: US Core Responders who do not have the capability to store or return a data element tagged as Supported in US Core profiles can still claim conformance to the US Core profiles per the US Core conformance resources.\" implies that if our system is not capable of generating this information, we can claim conformance, however, if our system is capable to generating the data,  it is possible that some instances of a resource element may not have that information and that's ok because the cardinality is 0. I think I got it :)</p>",
        "id": 193225801,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1586282707
    },
    {
        "content": "<p>US Core is pretty lenient.  They just say you need to share it if you can.  In many IGs, they may enforce that you must be able to</p>",
        "id": 193227471,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586283607
    },
    {
        "content": "<p>Are you implementing US Core to meet the new criteria for the ONC Certification program Lakshmi?  That criteria removes the leniency you are seeing here.</p>",
        "id": 193227874,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1586283794
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> yes, we are implementing to meet the new criteria for ONC Certification. Is there is an updated guide I can look at to understand this better? Thank you.</p>",
        "id": 193229702,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1586284687
    },
    {
        "content": "<p>As far as updated, guide, no, but be sure you are looking specifically at v3.1 (and not what is at <a href=\"http://build.fhir.org\" title=\"http://build.fhir.org\">build.fhir.org</a>): <a href=\"https://www.hl7.org/fhir/us/core/\" title=\"https://www.hl7.org/fhir/us/core/\">https://www.hl7.org/fhir/us/core/</a></p>",
        "id": 193229852,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1586284765
    },
    {
        "content": "<p>The language in the rule is: \"Data response. (A) Respond to requests for a single patient’s data according to the standard adopted in § 170.215(a)(1) [FHIR R4] and implementation specification adopted in § 170.215(a)(2) [US Core v3.1], including the mandatory capabilities described in “US Core Server CapabilityStatement,” for each of the data included in the standard adopted in § 170.213 [USCDI]. All data elements indicated as “mandatory” and “must support” by the standards and implementation specifications must be supported.\"</p>",
        "id": 193230174,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1586284944
    },
    {
        "content": "<p>Page 1173 in <a href=\"https://www.healthit.gov/sites/default/files/cures/2020-03/ONC_Cures_Act_Final_Rule_03092020.pdf\" title=\"https://www.healthit.gov/sites/default/files/cures/2020-03/ONC_Cures_Act_Final_Rule_03092020.pdf\">https://www.healthit.gov/sites/default/files/cures/2020-03/ONC_Cures_Act_Final_Rule_03092020.pdf</a></p>",
        "id": 193230270,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1586284992
    },
    {
        "content": "<p>Thank you. This is really helpful.</p>",
        "id": 193231265,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1586285434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224800\">@Lakshmi Bhamidipati</span>  you reference the wrong version and should be looking at version 3.1.0 for guidance:  <a href=\"http://hl7.org/fhir/us/core/general-guidance.html#must-support\" title=\"http://hl7.org/fhir/us/core/general-guidance.html#must-support\">http://hl7.org/fhir/us/core/general-guidance.html#must-support</a></p>",
        "id": 193238170,
        "sender_full_name": "Eric Haas",
        "timestamp": 1586288722
    },
    {
        "content": "<p>importantly that huge caveat was removed as part of the latest version so as Robert stated is much less lenient.</p>",
        "id": 193238367,
        "sender_full_name": "Eric Haas",
        "timestamp": 1586288799
    },
    {
        "content": "<p>Make sure you are looking at the version referenced in the rule.</p>",
        "id": 193238528,
        "sender_full_name": "Eric Haas",
        "timestamp": 1586288884
    },
    {
        "content": "<p>Ah, I thought it was removed in the guide as well and wondered why that language was still in there.  For what its worth, passing around the <a href=\"http://build.fhir.org\" title=\"http://build.fhir.org\">build.fhir.org</a> link of US Core seems to be a fairly common mistake that I've observed.  For some reason I think search engines still point to it, and it isn't obvious that you are on the wrong version unless you know what to look for.</p>",
        "id": 193240228,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1586289693
    },
    {
        "content": "<p>I always assume <a href=\"http://build.fhir.org\" title=\"http://build.fhir.org\">build.fhir.org</a> to be the continuous build for everything, and to contain either the latest version (with potentially new content that has not been balloted) or a future version to be introduced. To have old versions there seems counterproductive.</p>",
        "id": 193240719,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1586289941
    },
    {
        "content": "<p>I made the same assumption.</p>",
        "id": 193241049,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1586290117
    }
]