[
    {
        "content": "<p>I just joined the chat, so complete newbie.  I download the Zulip Desktop App for MacOS,  But now even clear to me what to put in the for organization or if I need to create a new one.  Anyways, developing a MWL and MPPS server in a Python Docker container to be used with Orthanc a a RIS that is under development.  I'm looking for collaborators with the Python container that will handle MPPS and maybe most of the MWL stuff, although orthanc has a C++ plug-in that handles the MWL queries just fine, and I have a Python script that will create MWL files from HL7 or JSON requests.  Unrelated, but down the road I might want to get some sort of certification for the RIS component and wondering how to do that.  I am retired radiology and sort of a hobbyist really but getting kind of addicted to informatics, so I might join SIIM also.</p>",
        "id": 244644154,
        "sender_full_name": "Stephen Douglas Scotti",
        "timestamp": 1625185893
    },
    {
        "content": "<p>Regarding collaborators, either pro bono for fee for service.  I want to keep all but the RIS open source.</p>",
        "id": 244644242,
        "sender_full_name": "Stephen Douglas Scotti",
        "timestamp": 1625185958
    },
    {
        "content": "<p>I guess I need a token of some type for the Desktop:  Use your web browser to finish logging in, then come back here to paste in your login token.</p>",
        "id": 244644960,
        "sender_full_name": "Stephen Douglas Scotti",
        "timestamp": 1625186799
    },
    {
        "content": "<p>Got the Desktop App setup, so just looking for help with what I described after that.</p>",
        "id": 244645051,
        "sender_full_name": "Stephen Douglas Scotti",
        "timestamp": 1625186936
    },
    {
        "content": "<p>Maybe it is just me, but I have no idea of what MWL, MPPS, RIS and SIIM are. What is your question exactly?</p>",
        "id": 244654249,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1625193779
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"424419\">@Stephen Douglas Scotti</span> , this community is primarily about the FHIR standard (and other HL7 standards). There are some of us on here that are familiar with DICOM Modality Worklist, Modality Performed Procedure Step, Radiology Information Systems, and the Society for Imaging Informatics in Medicine, but we're in the minority. If you're looking for a community to discuss imaging with, I'd suggest the <a href=\"https://join.slack.com/t/siimhackathon/shared_invite/zt-mkk0yn2e-KUqOLi6ETBUQmOffxmcQxA\">SIIM Hackathon Slack channel</a>.</p>\n<p>Populating a DMWL or MPPS entry from an HL7 v2 order should be straight forward. There is less experience with creating them from FHIR (in either XML or JSON representations); I don't think anyone has the full answers there yet, although I understand IHE Radiology may be looking at this as a 2021/2022 work item.</p>",
        "id": 244660074,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1625202281
    },
    {
        "content": "<p>Elliot, thank you for that information.  I'll see if I can register on the SIIM Hackathon Slack Channel.  Do you have to be a member of SIIM to register there ?  I have a Slack account.  I've actually already written some stuff to populate and create a DICOM .wl MWL files from an HL7 messages (and from JSON) using a Python script and a hl7 PIP module for Python located here:  <a href=\"https://python-hl7.readthedocs.io/en/latest/\">https://python-hl7.readthedocs.io/en/latest/</a>, and a PHP HL7 library located here:  <a href=\"https://github.com/senaranya/HL7\">https://github.com/senaranya/HL7</a>.</p>\n<p>I also started building the MPPS server with pynetdicom from here:  <a href=\"https://pydicom.github.io/pynetdicom/stable/examples/index.html\">https://pydicom.github.io/pynetdicom/stable/examples/index.html</a></p>\n<p>I know a fair bit about HL7 ORM, ORU and OMI &amp; ADT messages for Radiology, but I would like to learn a bit about FHIR and maybe the Qvera Engine.  I'll keep my account here for HL7 questions that I might have and for FHIR.  Do you deal with HL7 that much or mostly FHIR ?</p>",
        "id": 244661955,
        "sender_full_name": "Stephen Douglas Scotti",
        "timestamp": 1625205100
    },
    {
        "content": "<p>Steven, for clarity, HL7 is an organization that publishes standards including HL7 version 2 (which contains ORM and ORU messages) and HL7 FHIR.  So, yes, I deal with both v2 and FHIR, although discussion around here is almost entirely FHIR (there is a V2 stream that doesn't see much action).</p>\n<p>You don't need to be a SIIM member to join the Slack channel; the Iink I included above should be enough.</p>",
        "id": 244662445,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1625205706
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"424419\">@Stephen Douglas Scotti</span>   and <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  Populating a DMWL from OMI, ORM and ADT is specified in an IHE Profile called SWF.b.  IHE profiles are similar in stature to HL7 Implementation Guides.    The Profile and mappings are described in the IHE Radiology Technical Framework published <a href=\"https://www.ihe.net/resources/technical_frameworks/#radiology\">https://www.ihe.net/resources/technical_frameworks/#radiology</a>.  You will find the mappings in Appendix B in Volume 2x   <a href=\"https://www.ihe.net/uploadedFiles/Documents/Radiology/IHE_RAD_TF_Vol2x.pdf\">https://www.ihe.net/uploadedFiles/Documents/Radiology/IHE_RAD_TF_Vol2x.pdf</a>.  There are IHE Connectathons held worldwide to test IHE profiles, including SWF.  SWF testing is actually very popular.  See <a href=\"https://www.ihe.net/testing/\">https://www.ihe.net/testing/</a> for more details.  </p>\n<p>I think your idea of building a DMWL and MPPS server is excellent.  Most of the implementation work over the years has focused on the ORM/OMI to DMWL translations.  IHE does not explicitly specify the mapping from the MPPS to an HL7 v2 ORM/OMI, but it is very feasible and has been done.</p>\n<p>Note, there is an IHE profile proposal, OBIW, submitted by the II WG co-chairs to establish a REST based SWF to include FHIR and DICOMweb. <a href=\"https://wiki.ihe.net/index.php/Radiology_Proposals_2021-2022#Brief_Proposals\">https://wiki.ihe.net/index.php/Radiology_Proposals_2021-2022#Brief_Proposals</a> which could be of intrest.</p>",
        "id": 244695984,
        "sender_full_name": "Christopher Lindop",
        "timestamp": 1625229469
    },
    {
        "content": "<p>Thank you for the detail with the external links.  Those may be helpful.  I already create HL7 messages in a PHP app, and then I mapped them to a MWL text template using the DICOM conformance statement of the vendor as a guide, and they actually work in the live enviornment.  Appendix B there in Volume 2x is helpful though.  dcmtk (dicom toolkit) has a tool to convert .txt template to .wl (dcm format worklist files), which is what I am using.   You can also use XML templates and convert those to DICOM.</p>\n<p>My \"Project\" is moslty a prototype RIS / PACS with HL7 support, but going forward I might want to implement FHIR since that probably has more of a future really and would make integration and interoperability easier down the road.  So some newbie questions are:</p>\n<ol>\n<li>\n<p>How do I create an imaging order with FHIR, sort of similar to ORM/OMI in HL7.  I could probably handle creating  MWL files from such a message, if there isn't already some package out there that does that.</p>\n</li>\n<li>\n<p>How do I create an imaging report with FHIR.  I am currently using the ORU messages with either HTML or an encapsulated PDF document in the OBX -5 segment, which works fine with my setup, and it even attaches a PDF version of the report to the imaging study as a series with an encapsulated PDF.</p>\n</li>\n<li>\n<p>I do have Qvera on my system, but have not done much with that yet.  I think they have an \"FHIR\" starter kit that would let me play around with messsages a bit.  I would prefer to use something like that down the road as an interface engine and use mostly JSON and REST API calls within my applicaiton.</p>\n</li>\n<li>\n<p>There is not a lot of urgency because the HL7 setup 'works', but I'd like to slowly develop FHIR support for patients, appointments, imaging orders, imaging reports initially, and then eventually some billing stuff for insurers and claims.  I did play around a bit earlier with EDI / X12 messages for electronic claims.  Does FHIR support electronic billing ?</p>\n</li>\n</ol>",
        "id": 244701131,
        "sender_full_name": "Stephen Douglas Scotti",
        "timestamp": 1625232125
    },
    {
        "content": "<ol start=\"4\">\n<li>Elecetronic billing -&gt; yes. See the \"finance\" module on the main page of the FHIR spec. As for order management in FHIR, that's based on the \"Task\" resource (please read up on that resource), an example using Lab orders/results is presented in this blog (first video): <a href=\"http://www.ringholm.com/column/FHIR_HL7_IHE_XDS_year_in_review.htm\">http://www.ringholm.com/column/FHIR_HL7_IHE_XDS_year_in_review.htm</a></li>\n</ol>",
        "id": 244703787,
        "sender_full_name": "René Spronk",
        "timestamp": 1625233382
    }
]