[
    {
        "content": "<p>We have been creating some example profiles (Observations and DiagnosticReport) for our resources to Simplifier. For Obsrvation Narrative can be seen in Narrative tab after upload. For DiagnosticReport it shows \"The resource cannot be rendered.\". Has someone had the same problem? Could there be some bug in simplifier or is there some difference in using of narratives in stu3 vs r4?</p>",
        "id": 197539802,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1589455917
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196057\">@Lauri Karppinen</span>, on <a href=\"http://Simplifier.net\">Simplifier.net</a> we render on the first tab for:</p>\n<ul>\n<li>Profiles: An interactive tree-view of the profile (diff/hybrid/snapshot)</li>\n<li>Examples/FHIR Instances: The narrative from the resource</li>\n</ul>\n<p>Looking at other DiagnosticReport instances the narrative seems to render (<a href=\"https://simplifier.net/hl7.fhir.r3/DiagnosticReport-example/~overview\">example STU3</a> / <a href=\"https://simplifier.net/SpecialtyFHIR4/DiagnosticReport-example-duplicate-2/~overview\">example R4</a>).<br>\nWhen a narrative is empty, we will show: <em>\"The narrative of this resource is empty.\"</em> (<a href=\"https://simplifier.net/UKCore/DiagnosticReport-example/~overview\">example</a>).<br>\nWhen the narrative tab shows <em>\"The resource cannot be rendered.\"</em> generally there are major issues with the profile. You should be able to hit the Validate button on the resource page and see those errors listed. See <a href=\"https://simplifier.net/FreseniusDialysisFHIR/DiagnosticReport-example/~overview\">this one for example</a>.</p>\n<p>Does your resource have any validation errors? If you can share a link, I could have a look at it.</p>",
        "id": 197561006,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1589465595
    },
    {
        "content": "<p>Thanks a lot for the answer <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> . It seems that validator gives me some errors for the example resource. I will try to sort them out.</p>",
        "id": 197648943,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1589519349
    }
]