[
    {
        "content": "<p>Hello guys. I am new in FHIR. I find it very interesting. As long time I want to build a complet EHR for my country. I found that FHIR can help me to achieve it. My question is how can I build a complet EHR with FHIR?</p>",
        "id": 200271729,
        "sender_full_name": "Siriman KONARE",
        "timestamp": 1591727757
    },
    {
        "content": "<p>By \"complete EHR\" do you mean a registry that holds shared patient information for all your patients, or do you mean a proper EHR that allows clinicians to perform all of their regular workflow steps, book appointments, do billing, etc.?  Both are significant amounts of work, but the latter is even harder because you have to worry about user interface, workflow, reporting, etc.  If you're looking for cheap/free EMRs, have you looked at OpenMRS?  They're an open source EMR targeting the developing world and they have a growing amount of FHIR support.</p>",
        "id": 200272579,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591728117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am saying a registry that holds shared information about patient. This will enable practitioners(doctor, nurses, insurances company) to access  patient health information.</p>",
        "id": 200278249,
        "sender_full_name": "Siriman KONARE",
        "timestamp": 1591730993
    },
    {
        "content": "<p>Ok, then you could theoretically start with one of the open source FHIR servers, but you'd have to add a lot of logic to manage access, consent, define profiles that guide what terminologies and elements need to be used for different types of data, work with data sources to push data and build interfaces to query data, etc.  Generally there are lots of political considerations that will be bigger barriers than the technical steps.</p>",
        "id": 200281281,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591732560
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310389\">Siriman KONARE</span> <a href=\"#narrow/stream/179166-implementers/topic/nationwide.20EHR/near/200278249\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span>  I am saying a registry that holds shared information about patient. This will enable practitioners(doctor, nurses, insurances company) to access  patient health information.</p>\n</blockquote>\n<p>Which country?  As Lloyd says, political barriers may prove to be the biggest hurdle, not to mention security and privacy laws. The first up consideration is whether it's actually permissible within your regulatory environment - e.g. do you have national patient identifiers?</p>",
        "id": 200296814,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1591740137
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  It is for Senegal in Africa. I get your points, I will be face a lot of barriers I know. For security and access control I decide use a blockchain. About identifier, in Senegal this unique identifier does not exist yet</p>",
        "id": 200305491,
        "sender_full_name": "Siriman KONARE",
        "timestamp": 1591746579
    },
    {
        "content": "<p>I'd take a look at the <a class=\"stream\" data-stream-id=\"179216\" href=\"/#narrow/stream/179216-blockchain\">#blockchain</a> stream before you wed yourself too tightly to blockchain.  </p>\n<p>Please understand that we're not trying to discourage your initiative.  National EHRs are wonderful things if you can get them up and running and well used.  This community will absolutely help you however we can.  We just want you to understand that what you're contemplating is a huge undertaking - so make sure that you're aware of that and have the right advocates in place who'll be able to help with the political barriers that inevitably arise.  </p>\n<p>I know Lithuania rolled out a national EHR based on FHIR STU1 - they may have some lessons to share.  <span class=\"user-mention\" data-user-id=\"191840\">@Jan Jasinski</span>?</p>",
        "id": 200313449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591755345
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  for your advices.  I will take my time to undertand very well my subjet and you will look also the polical barriers that you guys are saying. I will glad to take contact with <span class=\"user-mention\" data-user-id=\"191840\">@Jan Jasinski</span>  to have an idea on what is done in Lithuania</p>",
        "id": 200386790,
        "sender_full_name": "Siriman KONARE",
        "timestamp": 1591775377
    }
]