[
    {
        "content": "<p>After conferring with the NCI re: the FHIR requirement for a URI for the NCI-T they have decided to persist the address that's in the HTA records. Per Gilberto Fragoso, the permanent URI for the NCI-T is <a href=\"http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl\">http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl</a> &amp; per the [HTA record here|https://confluence.hl7.org/display/TA/National+Cancer+Institute+-+Thesaurus]. Whereas this may not appear to be any change and thus not resolved, please understand that the NCI has considered our request and in order to support legacy systems they have in place, need to persist the aforementioned URL. What they have done is provide a redirect mechanism for transactions with the MIME type: html which transfers these transaction to [this page|https://ncit.nci.nih.gov/ncitbrowser/]  Please let me know if you have any questions</p>",
        "id": 232752694,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1617282362
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"340004\">@Davera Gabriel</span> this is different to what is presently specificed in the FHIR core spec?</p>",
        "id": 235106610,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618784678
    },
    {
        "content": "<p>the core spec currently only contains the NCI <strong>meta</strong> thesaurus, this is about the nci thesaurus.</p>",
        "id": 235138920,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1618817346
    },
    {
        "content": "<p>hmm. it sounds like it's still called into question</p>",
        "id": 235140799,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618818514
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> what is called into question? And BTW, NCIm is not a code system at all. Even if some folks want to pretend it is. The identifiers in NCIm represent the set of relationships, not a concept. So I hope no one continues to use that url in system, it should be an error.</p>",
        "id": 235372419,
        "sender_full_name": "Robert McClure",
        "timestamp": 1618935633
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  is this page a problem <a href=\"http://hl7.org/fhir/ncimeta.html\">http://hl7.org/fhir/ncimeta.html</a>?</p>",
        "id": 235412859,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618951852
    },
    {
        "content": "<p>Yes that page has information that is factually incorrect, plus makes users think the thesaurus is a code system, which is not correct. Of the MANY things we need to fix, this is one is particularly confusing because people confuse it with the actual code system NCI Thesaurus. JIRA made <a href=\"https://jira.hl7.org/browse/FHIR-31938\">FHIR-31938</a></p>",
        "id": 235427444,
        "sender_full_name": "Robert McClure",
        "timestamp": 1618958602
    },
    {
        "content": "<p>do you want to draft a replacement then?</p>",
        "id": 235430193,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618960266
    },
    {
        "content": "<p>and one we publish an updated version, we should go back and do a technical correction to make older versions of that page point to the latest version saying that the latest page is applicable in the older versions</p>",
        "id": 235430285,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618960331
    },
    {
        "content": "<p>No time to make that new page now and it's not needed to solve the problem. But I can put it on the todo list.</p>",
        "id": 235432531,
        "sender_full_name": "Robert McClure",
        "timestamp": 1618961875
    }
]