[
    {
        "content": "<p>Hello, does anyone know how to map part of NCPDP related to signature within FHIR? When we search for available examples <br>\n(<a href=\"https://www.hl7.org/fhir/medication-mappings.html#script10.6\" target=\"_blank\" title=\"https://www.hl7.org/fhir/medication-mappings.html#script10.6\">https://www.hl7.org/fhir/medication-mappings.html#script10.6</a><br>\n<a href=\"https://www.hl7.org/fhir/medicationrequest-mappings.html#script10.6\" target=\"_blank\" title=\"https://www.hl7.org/fhir/medicationrequest-mappings.html#script10.6\">https://www.hl7.org/fhir/medicationrequest-mappings.html#script10.6</a>),<br>\nmuch of the data is not mapped and the signature is absent at all.</p>",
        "id": 168066926,
        "sender_full_name": "Aron Dalentor",
        "timestamp": 1560447292
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span></p>",
        "id": 168067475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560447683
    },
    {
        "content": "<p>Yes, the mapping is incomplete.  While SCRIPT 10.6 is in use today, as of 1/1/2020 SCRIPT 2017071 will be the version in use.  The current effort is to get a comprehensive SCRIPT 2017071 to FHIR r4 mapping done.  This will likely include a set of extensions for the SCRIPT content that does not map or is not added to the resources.</p>\n<p>I assume your request is in terms of EPCS, the requirement for a digital signature or an indicator that of identity verification (a \"Signed Prescription\" per DEA regulation).  SCRIPT 10.6 does not support digital signatures (although, you should look at FHIR Digital Signatures (<a href=\"https://www.hl7.org/fhir/signatures.html#6.1.2\" target=\"_blank\" title=\"https://www.hl7.org/fhir/signatures.html#6.1.2\">https://www.hl7.org/fhir/signatures.html#6.1.2</a>) if that is your intent.  SCRIPT 10.6 uses &lt;DrugCoverageStatusCode&gt;=\"SI\" to meet DEA requirements, and that could be sent as a local FHIR extension.</p>\n<p>I'm interested in your business case.  Do you have a system receiving eRx using FHIR?</p>",
        "id": 168071581,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1560450197
    },
    {
        "content": "<p>We've partnered with company that developed eRx system. They use NCPDP 2017071 and they didn't implement FHIR, but we do and want to integrate their system into ours. They will send to us messages in NCPDP and we want to convert it into FHIR R4 and retranslate to other systems as FHIR messages. We are especially concerned about sig because in NCPDP sig is presented very well compared to dosageInstruction in MedicationRequest resource in FHIR. We are not interested in controlled substances, our focus is oncology and chemotherapy medications. <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 168122634,
        "sender_full_name": "Aron Dalentor",
        "timestamp": 1560506764
    },
    {
        "content": "<p>This is an interesting thread. Has anyone done significant work on the NCPDP to FHIR mapping?</p>",
        "id": 249879686,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1629306005
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> would know if anyone has...</p>",
        "id": 249915046,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629322567
    },
    {
        "content": "<p>There are individuals interested in mapping between SCRIPT 2017071 and FHIR r4, but no coordinated effort that I am aware of.  It will need a business/use case driver since non-inpatient eRx in the US is exclusively SCRIPT 2017071 - CMS names SCRIPT in the Part D regulations, and that drives the overall market.</p>",
        "id": 249943794,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1629351201
    },
    {
        "content": "<p>FHIR increasingly used in a storage capacity. A FHIR enabled pharmacy receives a NEWRX and wants to store it.<br>\nA prescriber retrieves medication history and wants to store to the FHIR server</p>",
        "id": 249945225,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1629352975
    },
    {
        "content": "<p>I imagine RXHISTORYRESPONSE would be MedicationStatement, but RXHISTORYREQUEST seems to map to two distinct FHIR calls (Patient search with demographics, MedicationStatement search with patient ID). Do people agree? Is there a way around that?</p>",
        "id": 250161437,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1629487257
    },
    {
        "content": "<p>Circling back on this - seems like it was done here: <a href=\"http://hl7.org/fhir/us/meds/2020Sep/pdmp.html#ncpdp-mappings-for-pdmp-request\">http://hl7.org/fhir/us/meds/2020Sep/pdmp.html#ncpdp-mappings-for-pdmp-request</a></p>\n<p>I'm curious about the choice of MedicationDispense vs MedicationStatement</p>",
        "id": 262078076,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637334471
    },
    {
        "content": "<p>NCPDP lives in the world of dispenses and prescriptions.  Why would they use statement, which is more about summarization and tracking compliance?</p>",
        "id": 262109851,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637347232
    },
    {
        "content": "<p>The med history response is a summary across all pharmacies and Pharmacy Benefit Managers.</p>",
        "id": 262123543,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637352821
    },
    {
        "content": "<p>The pharmacies know about dispenses, wouldn't that be the best resource type to use?</p>",
        "id": 262137366,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1637359896
    },
    {
        "content": "<p>Given it's a mixture of dispenses (pharmacies) and claims (PBMs), I'm conflicted. Here's MedicationStatement's explanation:</p>\n<p>\"This is a record of a medication being taken by a patient or that a medication has been given to a patient, where the record is the result of a report from the patient or another clinician, or derived from supporting information (for example, <strong>Claim</strong>, Observation or MedicationRequest). A medication statement is not a part of the prescribe-&gt;dispense-&gt;administer sequence but is a report that such a sequence (or at least a part of it) did take place, resulting in a belief that the patient has received a particular medication.\"</p>",
        "id": 262140236,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637361276
    },
    {
        "content": "<p>MedicationDispense and Claims both allow conveying \"what quantity of what was provided\".  MedicationStatement can't expose that.  It lets you say \"Patient is on X\", but that's pretty much it.  So we'd lose information NCPDP has if we did that.</p>",
        "id": 262335925,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637595784
    },
    {
        "content": "<p>Gotcha. MedicationDispense it is</p>",
        "id": 262362615,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637607563
    }
]