[
    {
        "content": "<p>NCPDP has the codeset &amp; Valueset to use and its restricted to NCPDP members only with subscription. However, when used in FHIR resources, could we share the NCPDP code, Description and details  in a FHIR resource with an organization not a NCPDP member? Is there any restrictions sharing the NCPDP codes &amp; description along with other FHIR elements in a FHIR resources?</p>\n<p>Example:  CairnBB IG we used the DAW NCPDP code.<br>\n<a href=\"https://build.fhir.org/ig/HL7/carin-bb/ValueSet-NCPDPDispensedAsWrittenOrProductSelectionCode.html\">https://build.fhir.org/ig/HL7/carin-bb/ValueSet-NCPDPDispensedAsWrittenOrProductSelectionCode.html</a><br>\nThe link defined in the page rout to NCPDP and it needs membership to acces<br>\n<a href=\"https://standards.ncpdp.org/Access-to-Standards.aspx\">https://standards.ncpdp.org/Access-to-Standards.aspx</a></p>\n<p><span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span> <span class=\"user-mention\" data-user-id=\"325566\">@Annette Kuball</span> <span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span></p>",
        "id": 219535240,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1607635139
    },
    {
        "content": "<p>The rules around sharing codes generally don't change just because you change the syntax.</p>",
        "id": 219546836,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607641726
    },
    {
        "content": "<p>Per the information registered (and reviewed by NCPDP) with the HL7 Terminology Authority located here <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=92000495\">https://confluence.hl7.org/pages/viewpage.action?pageId=92000495</a>, the IP and Licensing information is as follows:</p>\n<p>*National Council for Prescription Drugs Programs, Inc. (NCPDP) publications are owned by NCPDP, 9240 East Raintree Drive Scottsdale, AZ 85260, and protected by the copyright laws of the United States. 17 U.S.C. §101, et. seq.<br>\nPermission is given to Council members to copy and use the work or any part thereof in connection with the business purposes of the Council members. The work may not be changed or altered. The work may be shared within the member company but may not be distributed and/or copied for/by others outside of the member’s company. The work may not be sold, used or exploited for commercial purposes. This permission may be revoked by NCPDP at any time. NCPDP is not responsible for any errors or damage as a result of the use of the work.</p>\n<p>All material is provided \"as is\", without warranty of any kind, expressed or implied, including but not limited to warranties of merchantability, fitness for a particular purpose, accuracy, completeness and non-infringement of third party rights. In no event shall NCPDP, its members or its contributors be liable for any claim, or any direct, special, indirect or consequential damages, or any damages whatsoever resulting from loss of use, data or profits, whether in an action of contract, negligence or other tortious action, arising out of or in connection with the use or performance of the material.\n*</p>\n<p>If you have further questions regarding the use of NCPDP,  the information registered with HTA also contains contact information</p>\n<p>FYI only for <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span></p>",
        "id": 219556087,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1607649591
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> . My question is specific to a transaction record. For example, When sharing an EOB records for a member we need to share the NCPDP DAW code with an organization (Not a NCPDP member). Is that allowed?</p>\n<p>Or any organization receiving NCPDP codes in transaction data has to be member of NCPDP?</p>\n<p>Per the description above, my understanding is the <strong>restriction applied</strong> to distributing the NCPDP codes &amp; details. That is absolutely understandable.  </p>\n<p>I appreciate your help. </p>\n<p><span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span>  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span></p>",
        "id": 219649436,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1607714331
    },
    {
        "content": "<p>How would any organization know that any particular recipient of the data was a member or not, as of that moment in time? <br>\nIf the recipient of the data is the patient themselves, the patient has full rights to see (and correct) all aspects of their \"chart\" regardless of who defined the dictionary do they not? <br>\nHow would something so restricted make it into a public interoperable IG?<br>\nThere almost has to be some carve out somewhere that says, the author of the data must be licensed to author with it and any recipient must be a member to get the background info... But to prevent the distribution down to the smallest increment? <br>\nI am not a lawyer, but I'm going to surmise that the \"the work\" means the dictionary in total, not the individual codes and definitions. Imagine that if every single word in the code system was then locked away. You wouldn't be able to use the word \"medication\" in your documents. Consult your corporate lawyer.</p>",
        "id": 219654346,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1607716706
    },
    {
        "content": "<p>I am interested in clarity too. My understanding is that the patient has near complete access to the healthcare data created about them as a healthcare entity.  The creation and maintenance of that data will generally be the responsibility of a clinician / administrator. You would not want a patient modifying their actual diagnosis information, you just want to empower them to choose what information is shared. </p>\n<p>In the event that the patient needs to make a correction, it will be important that the appropriate system receives the correction. For example, a patient may be looking at a downstream version of a clinical piece of data. Any modifications to that data would not be reflected in the correct systems (as needed for clinical decision support). Basically the patient would need to follow the old process of contacting the entity that captured the data incorrectly, and have it corrected there. </p>\n<p>I hope I understood the intent of the question.</p>",
        "id": 219859106,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607960682
    },
    {
        "content": "<p>Frank - Hope you can comment. <span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span>  suggested, you may be able to help on our question above with respect to sharing NCPDP code in a transaction record.</p>\n<p><span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span>  <span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span></p>",
        "id": 219866888,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1607963727
    },
    {
        "content": "<p>Hi Bapi, all. I've reached out to NCPDP to get an answer to this question. My understanding matches Daniel's, but I'm also not a lawyer ;)  Hopefully will be able to forward a response pretty quickly.</p>",
        "id": 219897856,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1607977858
    },
    {
        "content": "<p>Hi all. <span class=\"user-mention\" data-user-id=\"248131\">@Margaret Weiker</span> at NCPDP shared the following...</p>\n<ul>\n<li>Sharing data that contains values from NCPDP code sets isn’t prohibited by the copyright. But sharing or publishing a full NCPDP code set and definitions is.</li>\n<li>A party may share data containing NCPDP codes with a receiver that isn’t an NCPDP member. </li>\n<li>A party that isn’t an NCPDP member may capture and later share data containing NCPDP codes with another party.</li>\n</ul>\n<p>That said, Margaret wanted to emphasize that both the sending and receiving parties would be limited in their ability to understand and validate the information if they don't have access to the full code systems.</p>\n<p>Hope this helps</p>",
        "id": 219902609,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1607980323
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span>, <span class=\"user-mention\" data-user-id=\"248131\">@Margaret Weiker</span>, <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> . What would you think about adding the bulleted points, above, to the NCPDP entries in HTA?</p>",
        "id": 219903897,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1607980970
    },
    {
        "content": "<p>Thank you Frank for your help. much appriciated.</p>",
        "id": 219996526,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1608046986
    },
    {
        "content": "<p>HTA will review the additions, thanks <span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span></p>",
        "id": 220277276,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1608227235
    }
]