[
    {
        "content": "<p>Folks, does anyone know if someone has created a FHIR terminology service that serves up NCPDP SCRIPT 10.6 code sets?</p>",
        "id": 153815421,
        "sender_full_name": "Robert McClure",
        "timestamp": 1457969645
    },
    {
        "content": "<p>I haven't heard of it. Do you have source from which to create a code system resource?</p>",
        "id": 153815462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457985791
    },
    {
        "content": "<p>Not one I can give you :-) It's pay-for-license stuff. I was a bit criptic in my ask in that it would happen most likely if someone was trying to create an NCPDP-compliant exchange using FHIR</p>",
        "id": 153815923,
        "sender_full_name": "Robert McClure",
        "timestamp": 1458167847
    },
    {
        "content": "<p>pay for license? Like, as in, last decades approach...?</p>",
        "id": 153815929,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458168737
    },
    {
        "content": "<p>;-0</p>",
        "id": 153815930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458168740
    },
    {
        "content": "<p>:)</p>",
        "id": 153815931,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1458168759
    },
    {
        "content": "<p>We have a \"task\" in NCPDP to map between FHIR and NCPDP, but it basically down to myself and one other person.  So, there isn't a lot of traction to get it done.  Do you need something specific, or are your looking for the full set of codes and structures?</p>",
        "id": 153815975,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1458181139
    },
    {
        "content": "<p>first time I have seen a need to comment on a thread.  Finally see some of the features of Zulip ... it does have advantages over the Skype streams</p>",
        "id": 153815977,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1458181206
    },
    {
        "content": "<p>thanks Scott. What's the scope and intent of the mapping exercise? </p>",
        "id": 153815980,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458181268
    },
    {
        "content": "<p>\"pay for license\"  - NCPDP standards are licensed products.  If you are doing commercial work, then you do need to be a member to have \"access\" to the standards.  It's not a hard and fast rule, but Rob was correct to be \"careful\" about it</p>",
        "id": 153815981,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1458181307
    },
    {
        "content": "<p>the scope at present is a basic mapping of the fields in the SCRIPT (eRx) NCPDP transactions to the equivalent  FHIR resources.  This would involved identifiying and resolving code set differences.  But, there is the basic question about SCRIPT being an Order paragidm, which doesn't really match to RESTful concepts.  We were just trying to deal with the data mapping and leave the workflow issues until the FHIR workflow discussions are more complete.</p>",
        "id": 153815982,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1458181477
    },
    {
        "content": "<p>k thanks. Would NCPDP consider making the code systems publicly available but not everything else?</p>",
        "id": 153815983,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458181552
    },
    {
        "content": "<p>The licensing issue is many in terms of commerical applications.  I need to be careful since I cannot speak for NCPDP.  But, delevelop between HL7 and NCPDP have been cooperative, I think we can make appropriate arrangements.  (just not tonight ;-)</p>",
        "id": 153815984,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1458181733
    },
    {
        "content": "<p>I will look into it further.  ROB - do you have a timeframe for when you would like to see this? (other than \"yesterday\"?)</p>",
        "id": 153815985,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1458181851
    },
    {
        "content": "<p>(I'm seeing some typos, but I think the intent of my response is fairly clear.  please let me know if I need to clarify)</p>",
        "id": 153815986,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1458181908
    },
    {
        "content": "<p>A little background.  In the US, eRx is done with NCPDP SCRIPT 10.6.  This is in regulation and not subject to trading partner agreements.  SCRIPT is very business -requirement based.  This might align with the \"80% concept\" of FHIR ... but that's wat we need to confirm.</p>",
        "id": 153815987,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1458182119
    },
    {
        "content": "<p>I'm back... <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> My timeframe is a derivative of work currently occurring in FHIM where we are working on finalizing some of the models for review and those models reference NCPDP code sets. Since NCPDP doesn't think of these things as \"code systems\", one \"easy solution\" for us would be to instead point to someones FHIR terminology serivce url for the code system and likely they will also have a value set resource that we need too. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  - you can not gloat about this!!</p>",
        "id": 153816212,
        "sender_full_name": "Robert McClure",
        "timestamp": 1458240995
    },
    {
        "content": "<p>ahh but I can if I want </p>",
        "id": 153816217,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458241128
    },
    {
        "content": "<p>more seriously, how can you reference ncpdp code systeems in FHIM given what Scott said about the licensing conditions? </p>",
        "id": 153816218,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458241164
    },
    {
        "content": "<p>This get's us to the issue we had regarding FHIR term serv in general, how to confirm license issues. FHIM functions in the same way other \"IG-generating\" tools do - view and use to create something that would be implemented by a license holder. So FHIM is still a step removed from something that is \"implementable\" even though the FHIR TS we would use _could_ be used by FHIR to actually implement (hence the license issue).</p>",
        "id": 153816239,
        "sender_full_name": "Robert McClure",
        "timestamp": 1458243430
    },
    {
        "content": "<p>I'm not sure what you mean. All value set and code system resources can carry a copyright statement, and many of them do. What's your actual question?</p>",
        "id": 153816245,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458243911
    },
    {
        "content": "<p>it's the same question you posed to me. \"How does FHIR reference a code system given the need to demonstrate you've paid for it?\"</p>",
        "id": 153816288,
        "sender_full_name": "Robert McClure",
        "timestamp": 1458245803
    }
]