[
    {
        "content": "<p>We're using FHIR resources to compose our C-CDAs for the 2015 Meaningful Use requirements. The C-CDAs need to meet the criteria specified in the ONC's Common Clinical Data Set (CCDS), whose requirement for Immunization specifies (or at least strongly implies) the inclusion of NDC as an identifier of the substance administered.</p>\n<p>Is there a means, besides an extension, of sending NDC as an element of the Immunization resource? Extending the cardinality of vaccineCode is not something I want to do unilaterally, and no other element in Immunization (R4) seems appropriate.</p>",
        "id": 154010220,
        "sender_full_name": "Mike Henderson",
        "timestamp": 1539882812
    },
    {
        "content": "<p>Do you expect to need to include vaccine code from a value set other than NDC? Why not just put the NDC in vaccineCode? For historical immunizations, you'll probably need to pick a code from the CVX value set rather than an NDC, but for new administrations are expecting to need to send both a CVX and an NDC?</p>",
        "id": 154010221,
        "sender_full_name": "Craig Newman",
        "timestamp": 1539883027
    },
    {
        "content": "<p>Exactly. We want to use both CVX and NDC for new administrations.</p>",
        "id": 154010224,
        "sender_full_name": "Mike Henderson",
        "timestamp": 1539883358
    },
    {
        "content": "<p>What is the use case for sending both?</p>",
        "id": 154010225,
        "sender_full_name": "Craig Newman",
        "timestamp": 1539883384
    },
    {
        "content": "<p>Compliance with CCDS.</p>",
        "id": 154010226,
        "sender_full_name": "Mike Henderson",
        "timestamp": 1539883471
    },
    {
        "content": "<p>In the v2 world, the requirement was to use CVX with historical doses and NDC with new administrations. I'm  not quite sure how to interpret the CCDS documentation (<a href=\"https://www.healthit.gov/sites/default/files/commonclinicaldataset_ml_11-4-15.pdf\" target=\"_blank\" title=\"https://www.healthit.gov/sites/default/files/commonclinicaldataset_ml_11-4-15.pdf\">https://www.healthit.gov/sites/default/files/commonclinicaldataset_ml_11-4-15.pdf</a>) I've seen (maybe I'm not looking in the right places) where they call out both. Certainly for historical doses, the chances of knowing the NDC are close to none. Does it explicitly say somewhere that every dose needs to capture both a CVX and an NDC?</p>",
        "id": 154010227,
        "sender_full_name": "Craig Newman",
        "timestamp": 1539883811
    },
    {
        "content": "<p>The explicit requirement to send both is not stated. Agreed about historical doses; no point to an NDC requirement there.<br>\nIf you're suggesting to send NDC when we have it and CVX otherwise, that makes sense, and since NDC maps to CVX, it would meet the requirement of ยง170.207(e)(4). I'll go with that unless others jump onto the thread making a strong case to do otherwise. Thanks!</p>",
        "id": 154010229,
        "sender_full_name": "Mike Henderson",
        "timestamp": 1539884480
    },
    {
        "content": "<p>Just to be clear, I have no authority to make any kind of statement about the intent of the CCDS authors, I'm just asking the questions....</p>\n<p>Do keep in mind that this requires the receiving system to be able to digest NDC codes as the only vaccine identifier. We are seeing trouble with that in the v2 world where immunization information systems (IIS) are requesting both an NDC and a CVX code be sent in a new administration message. Fortunately, the RXA-5 field uses the CWE v2 data type which allows for both a code and an alternate code so that's technically possible. It doesn't look like that is the case for the FHIR data type. I'm not sure who will be ingesting your data, but they may have a similar problem. It's probably well worth you submitting a gForge ticket to enhance the Immunization resource to allow multiple codes and we can have a larger discussion beyond just the two of us.</p>",
        "id": 154010239,
        "sender_full_name": "Craig Newman",
        "timestamp": 1539887594
    },
    {
        "content": "<p>Good idea, Craig, thanks. I've submitted a gForge ticket under PHER.</p>",
        "id": 154010252,
        "sender_full_name": "Mike Henderson",
        "timestamp": 1539890084
    },
    {
        "content": "<p>why not just put both NDC and CVX in vaccineCode?</p>",
        "id": 154010296,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539902295
    },
    {
        "content": "<p>The cardinality of vaccineCode is 1..1.</p>",
        "id": 154010416,
        "sender_full_name": "Mike Henderson",
        "timestamp": 1539956899
    },
    {
        "content": "<p>Right.  But vaccineCode is a CodeableConcept which contains 0..* codings - each of which can convey a separate code possibly from a separate code system.</p>",
        "id": 154010457,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539961229
    },
    {
        "content": "<p>As long as nobody at PHER thinks that approach would introduce a semantic clash, Lloyd, that sounds like a sensible path forward. We'll go with that for now. Thanks.</p>",
        "id": 154010466,
        "sender_full_name": "Mike Henderson",
        "timestamp": 1539961610
    },
    {
        "content": "<p>It's very common to specify multiple codings.  E.g. local code + SNOMED + ICD10 + ICD9 for diagnosis; GITN + NDC code for drugs, etc.</p>",
        "id": 154010469,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539961746
    },
    {
        "content": "<p>It's a reasonable solution from the immunization point of view. I swear I looked for that when we started discussing this...</p>",
        "id": 154010945,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540210388
    }
]