[
    {
        "content": "<p>I'm wondering if someone would be able to give me some context as to why 10 digit NDC codes were chosen for use with FHIR instead of 11 digit codes. It seems like the 11 digit version is more consistent and interoperable, for some context I work for Surescripts and with ePrescribing we require the 11 digit NDC code to be used.</p>\n<p><a href=\"http://hl7.org/fhir/ndc.html\" target=\"_blank\" title=\"http://hl7.org/fhir/ndc.html\">http://hl7.org/fhir/ndc.html</a></p>",
        "id": 153889444,
        "sender_full_name": "Joseph Athman",
        "timestamp": 1494522354
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - do you remember?</p>",
        "id": 153889447,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494522553
    },
    {
        "content": "<p>It's because the FDA NDC distribution and the package labels use the 10-digit format - that's the \"official\" one.  The 11-digit codes are an unofficial derivative format that is used by drug database vendors and others.  I think it's a better and more useful format, but it's an alternative code representation and not the primary one.  We could possibly add an additional representation that uses the 11-digit format - maybe as a separate code system, like \"NDC/NHRIC 11-digit Codes (unofficial)”?  But I don't know if we should.</p>",
        "id": 153889516,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1494536480
    },
    {
        "content": "<p>Thanks, that is helpful. In our case we are dealing with medication information that is sourced from ePrescribing related data so it would be helpful to just be able to leave it in it's original format. I'm not sure if there is a definitive way for us to go from the 11 digit code to 10 digit unless I'm missing something. At least for a company like Surescripts the 11 digit variety is much more common, but I'm not sure how that came to be the case. I'm guessing the use of drug databases would make sense there. </p>",
        "id": 153889565,
        "sender_full_name": "Joseph Athman",
        "timestamp": 1494542179
    },
    {
        "content": "<p>Yes, I expect that the codes you are getting came from a drug database.  And you are right that there is no deterministic way to transform from the 11 digit codes back to the 10 digit.  But I would do that in reverse.  It's a simple algorithm to transform from 10 to 11 digits - you just pad the \"short\" group (it will be either the first or the second group of digits) to the maximum length with a leading '0' and then remove the dashes.  For doing comparisons that can be done on the fly using a simple function or you can cache a table with the full 11 digit codes locally.  Or, if we think it really is needed, we still could entertain the possibility of creating a FHIR code system for the 11 digit codes.</p>",
        "id": 153889592,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1494546521
    },
    {
        "content": "<p>if we can create a code system for the 11 code digits, why can't we just make it part of the existing code system?</p>",
        "id": 153889603,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494564986
    },
    {
        "content": "<p>Since it is always possible to go from 10 digits to 11 digits, then transmitting the data with 11 digits would be better since whether your data source is 10 or 11 digits you would always be able to transmit it as 11. In our case our source of data is 11 digits so there's no way for us to get back to 10, I think we would be required to create an extension to send our data. If I am a receiver and get an 11 digit value but need to compare it to my 10 digit data, I can easily convert my 10 digit data to an 11 digit value for comparison sake. </p>",
        "id": 153889755,
        "sender_full_name": "Joseph Athman",
        "timestamp": 1494598348
    },
    {
        "content": "<p>I am exploring different coding systems and how they interact with FHIR. For NDC code system, the recommended field to use for the display value (returned by the $validate-code extended operation,  for example) is the <code>PACKAGEDESCRIPTION</code> from the <code>package.txt</code> file. However, this field provides dosage information and is useless as a display value. The <code>PROPRIETARYNAME</code>, <code>PROPRIETARYNAMESUFFIX</code>, and <code>NONPROPRIETARYNAME</code> fields from the <code>product.txt</code>file are much more descriptive display names. So.....any reasoning behind why that field is suggested?</p>",
        "id": 167325135,
        "sender_full_name": "Elise Myers",
        "timestamp": 1559674205
    },
    {
        "content": "<p>Also, +1 on seeing 11-digit NDC codes without dashes. I'm glad i read the above thread so I know the best way is to turn my standard 10 digit dash codes into 11 digit non-dash codes for comparison's sake.</p>",
        "id": 167326939,
        "sender_full_name": "Elise Myers",
        "timestamp": 1559675544
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> I believe that we have a task about the description?</p>",
        "id": 167373880,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559728872
    },
    {
        "content": "<p>Well, we have <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9555\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9555\">GF#9555</a> (can't believe it's that old!) voted over 2 years ago with the status still as 'Resolved - Change required'.  I think it's related, but doesn't necessarily exactly address the question(s) in this topic.  I'm not seeing anything else (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> is there anything else in particular that you were thinking of?).  We've delayed on implementing <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9555\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9555\">GF#9555</a> for over 2 years, since we didn't really describe the solution in the resolution and said that we needed help from NLM (which, as far as I know, we haven't yet pursued).  Maybe we need a couple of new trackers specifically for addressing the display and 11 digit code issues, as well as we need to finally figure out how we want to implement <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9555\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9555\">GF#9555</a>.</p>",
        "id": 167380751,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1559735948
    },
    {
        "content": "<p>hmm. better make a task then</p>",
        "id": 167382278,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559737177
    },
    {
        "content": "<p>Thank you for the response! Do you have an idea which field you plan on recommending instead? I want to align with y'all as much as possible. On a related topic, the newest version of LOINC that will be released in December 2019 is going to include a display field, and they recommend using that for display instead of the <code>COMMON_LONG_NAME</code> that is currently recommended.</p>",
        "id": 167503586,
        "sender_full_name": "Elise Myers",
        "timestamp": 1559842965
    },
    {
        "content": "<p>I think we haven't determined for sure yet what is the best field (or fields) to recommend for NDC.  I may bring it up on the Main Vocab WG call today (beginning 3:30 PM Eastern) for at least preliminary discussion (Ted Klein is not available today and I'm not sure about the expected attendance otherwise).  In the LOINC meeting today there was discussion of the proposed display field - my take away was that there are quite a few questions out there and, as I understood it, the agreement was to not include any content for it in the soon upcoming July release, and I think it may not yet be clear exactly what we will be seeing in December (if you were also in the meeting, Elise, and have a different take on that please feel free to add to or correct what I said).</p>",
        "id": 167508424,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1559845826
    },
    {
        "content": "<p>I was not at the LOINC committee meeting today but I was at the conference in person yesterday. It was the lead content developer there who told me about the planned release in December including display values (but as you said correctly, not in July). That very well could have changed after whatever discussions took place today, though.</p>",
        "id": 167524066,
        "sender_full_name": "Elise Myers",
        "timestamp": 1559856154
    },
    {
        "content": "<p>What should implementers do in the meantime with the NDC and display as defined in <a href=\"http://build.fhir.org/ndc.html\" target=\"_blank\" title=\"http://build.fhir.org/ndc.html\">http://build.fhir.org/ndc.html</a>?  As <span class=\"user-mention\" data-user-id=\"224108\">@Elise Myers</span> described the packagedescription defined for the display does not provide the product name of NDC only the package description.  Even the display in the example provided for MedicationKnowledge does not align with what has been defined   <a href=\"http://build.fhir.org/ndc.html\" target=\"_blank\" title=\"http://build.fhir.org/ndc.html\">http://build.fhir.org/ndc.html</a>.  What are our options in representing the appropriate product name for the NDC and 11 digit NDC?</p>\n<p><a href=\"http://build.fhir.org/medicationknowledge-example.json.html\" target=\"_blank\" title=\"http://build.fhir.org/medicationknowledge-example.json.html\">http://build.fhir.org/medicationknowledge-example.json.html</a><br>\n        \"system\": \"<a href=\"http://hl7.org/fhir/sid/ndc\" target=\"_blank\" title=\"http://hl7.org/fhir/sid/ndc\">http://hl7.org/fhir/sid/ndc</a>\",<br>\n        \"code\": \"0409-6531-02\",<br>\n        \"display\": \"Vancomycin Hydrochloride (VANCOMYCIN HYDROCHLORIDE)\"</p>",
        "id": 174037844,
        "sender_full_name": "Mona O",
        "timestamp": 1566650758
    },
    {
        "content": "<p>We can fix this in the MedicationKnowledge example.  I'm not sure the guidance existed when the example was created.</p>",
        "id": 174053565,
        "sender_full_name": "Melva Peters",
        "timestamp": 1566678676
    },
    {
        "content": "<p>@Melva Peters I believe the representation of the product name in the MedicationKnowledge example is represented correctly, but it doesn't align with how \"code\" and \"display\" are defined in  <a href=\"http://build.fhir.org/ndc.html\" target=\"_blank\" title=\"http://build.fhir.org/ndc.html\">http://build.fhir.org/ndc.html</a>.</p>",
        "id": 174110109,
        "sender_full_name": "Mona O",
        "timestamp": 1566786399
    }
]