[
    {
        "content": "<p>Hi, recently we were wondering how to use <em>:contains</em> modifier trough fhir-client.min.js. We made a little change in this local library and all going well.<br>\nNow I'm wonder how should I write the syntax to use the modifier <em>near</em> and <em>neardistance</em> to perform the request <code>{{url}}/Location?near=-32.74977:-70.708992&amp;near-distance=110.20||km...</code> Our app is working along with a dstu3 fhir server. We try to avoid a direct request 'cause the structure of the code is ad-hoc to perform request through this library.</p>\n<p>Maybe <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>, <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> , <span class=\"user-mention\" data-user-id=\"192807\">@Daniel Zsebedits</span>   could give us a suggestion?</p>",
        "id": 193311366,
        "sender_full_name": "Marcelo Cabello",
        "timestamp": 1586349012
    },
    {
        "content": "<p>I think your separator for near should be '|', not ':'</p>",
        "id": 193325872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586355285
    },
    {
        "content": "<p>Also, do check the CapabilityStatement and confirm the server supports the <code>near</code> search operator.   A <code>near</code> operator is something of a specialized usecase, and requires either a dedicated geospatial mapping library on the server, or a geospatial index on the database (preferably both).  There's quite a few sandboxes out there in the world that might have Rest enabled for the Location resources, but not have implemented the search operator yet.</p>",
        "id": 193344601,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1586363263
    },
    {
        "content": "<p>That's rigth <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , but the spec of dstu3 shows  \":\"<br>\ndstu3 -&gt; Location?near=-83.694810:42.256500&amp;near-distance=11.20||km...<br>\nr4 -&gt; Location?near=-83.694810|42.256500|11.20|km...<br>\nCheers!</p>\n<p>Thanks <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> , I always have to check in CapStatement for every new operation that I want to use. Fortunately, 4.2 from Hapi uses these modifiers. <br>\nThe spec defines modifiers near/neardistance , but I guess algorithms which calculate distance belong to the implementation server. We developed a proof of concept using googlemaps api key, but regarding your advice, do you meant I MUST/SHOULD use another geospatial support ??</p>",
        "id": 193452525,
        "sender_full_name": "Marcelo Cabello",
        "timestamp": 1586440235
    },
    {
        "content": "<p>Hmmm... I was thinking: to calculate the distance between my position and Location resources could I use also the google api key or other similar to calculate distance and show that as a response through the near / neardistance modifiers.</p>\n<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> could you tell how works the algorithms in hapi 4.2 to the use case \"give me a list of locations near me inside 5 kms?\" Can I simply take it and use it or do I need another support as Abigail mentioned?</p>",
        "id": 193454142,
        "sender_full_name": "Marcelo Cabello",
        "timestamp": 1586440951
    },
    {
        "content": "<p>DSTU3 was in error, but given that it's a narrative issue, not something we'll be fixing.</p>",
        "id": 193463811,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586445191
    },
    {
        "content": "<p>If HAPI has them listed in the CapabilityStatement, you should be good to go.  Just be aware that other servers might support Location REST endpoints, but not the <code>near</code> search operator.  So you may run into hiccups if you point your app at a different sandbox or production server.  </p>\n<p>We use the Mongo API and a specialized client side Minimongo library that supports in-memory <code>$near</code> operations.  So, rather than asking the server to calculate the nearest locations, we like to fetch the entire dataset when possible, and do our own proximity calculations.</p>",
        "id": 193468044,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1586446955
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193556\">@Marcelo Cabello</span> near is supported in HAPI as of 4.2.0. We use a pretty naive \"box\" algorithm that simply draws a rectangular box around the point you gave and finds Locations within it (as opposed to a radius search, which we are also planning on implementing in the future)</p>",
        "id": 193493065,
        "sender_full_name": "James Agnew",
        "timestamp": 1586458048
    }
]