[
    {
        "content": "<p>When defining a custom profile as a new StructureDefinition, is it necessary to define the intermediate BackboneElements as explicit elements or can they be ommited and only their contained elements have to be listed ? Because the existence of the BackboneElements can be implicitely assumed, when there is a path to subelements.</p>",
        "id": 177692129,
        "sender_full_name": "Georg Fette",
        "timestamp": 1570609422
    },
    {
        "content": "<p>You need to define it, because otherwise we don't know the cardinality (i.e., is it 0..1, 1..1, 0..*, etc).  I also think we can't <em>assume</em> it is a BackboneElement, because it also could be a normal Element.  I think the only difference is that BackboneElement allows modifierExtension -- so technically modelers could use either one depending on what they want to allow.</p>",
        "id": 177705790,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1570622188
    },
    {
        "content": "<p>In a logical model, <code>BackBoneElement</code> nodes can introduce child elements. <code>Element</code> nodes contain a single value.</p>",
        "id": 177706301,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1570622597
    },
    {
        "content": "<p>And yes, a logical model definition must explicitly introduce all parent elements. Only constraining profiles can be sparse.</p>",
        "id": 177706415,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1570622691
    },
    {
        "content": "<blockquote>\n<p>In a logical model, BackBoneElement nodes can introduce child elements. Element nodes contain a single value.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> -- I did not know that.  Is that documented somewhere or is it a convention?  I can't seem to find it in the docs, but I may be looking in the wrong place.</p>",
        "id": 177710304,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1570625630
    },
    {
        "content": "<p>Good question... not sure if this is explicitly documented in the spec. But if you look at the profiles that define the FHIR core resources, you will notice the same pattern.</p>",
        "id": 177710904,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1570626074
    },
    {
        "content": "<p>An <code>ElementDefinition</code> in a profile can either:</p>\n<ul>\n<li>Contain a primitive value =&gt; base <code>Element</code></li>\n<li>Introduce child elements =&gt; base <code>BackboneElement</code></li>\n<li>Reference an external type profile =&gt; base is the root element of the external profile</li>\n</ul>",
        "id": 177711144,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1570626239
    }
]