[
    {
        "content": "<p>Hi, I'm implementing an API following the FHIR STU3 standard and would like to ask for advice with placing some properties, so that I don't deviate from the standard too much. I'm looking at 3 properties:<br>\n- <strong>available for online scheduling</strong> A flag describing whether the Practitioner is accepts online scheduling<br>\n- <strong>activation date</strong> A date when this practitioner will become available for accepting appointments<br>\n- <strong>hidden</strong> A flag allowing to temporarily hide a Practitioner</p>\n<p>Here's my thinking - can I treat online scheduling as a separate Role in itself? I'm currently using the Practitioner Role to list all the organizations the Practitioner is part of. Would this make sense or should I try to add online scheduling as properties on existing Roles?</p>\n<p>I'm thinking of using some properties on the PractitionerRole for the other two fields, namely the <strong>active</strong> flag for my <strong>hidden</strong> field and the <strong>period</strong> start field for the <strong>activation date</strong>.</p>\n<p>Thoughts?</p>",
        "id": 153917860,
        "sender_full_name": "Dan Siwiec",
        "timestamp": 1509992041
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153917893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510008341
    },
    {
        "content": "<p>Yes, I'd be considering the scheduling to be matched up with the PractitionerRole rather than the Practitioner, as is operating at a practice (even if its his own sole practitioner practice) and when working at multiple places, then is there.<br>\nThis also needs to tie into the Schedule and Slot resources where those actual things can give you fine grain control over things.</p>",
        "id": 153918782,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1510297048
    },
    {
        "content": "<p>No available appointments is no schedule.</p>",
        "id": 153918783,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1510297083
    },
    {
        "content": "<p>If you have a scheduling system, then its likely to have the window of available appointments (slots) defined in the schedule (so from today for the next 2 months, or the booking window is only open for next month)</p>",
        "id": 153918784,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1510297334
    }
]