[
    {
        "content": "<p>Did we come to a landing on how to express a negated condition? - eg 'the patient does not have asthma'.  or 'I have ruled out meningitis as a diagnosis' ?  </p>",
        "id": 153846481,
        "sender_full_name": "David Hay",
        "timestamp": 1473128727
    },
    {
        "content": "<p>Unless I missed something while on maternity leave, I would have suggested using Condition.verificationStatus = refuted (which is defined as the condition has been ruled out by diagnostic and clinical evidence).</p>",
        "id": 153846590,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1473187473
    },
    {
        "content": "<p>nice!</p>",
        "id": 153846603,
        "sender_full_name": "David Hay",
        "timestamp": 1473193025
    },
    {
        "content": "<p>The definition of \"refuted\" is \"This condition has been ruled out by diagnostic and clinical evidence.\"  Based on that, it works for the second example.  It seems to be a bit of a stretch for the more generic \"does not have\" case in the first example, though.  You certainly could argue that a clinician wouldn't state that \"the patient does not have asthma\" unless they had at least clinical evidence to support that, and that probably makes sense.  But the asserter can also be a patient.  There I don't think that \"refuted\" would fit, but maybe we don't need to be concerned about having a coded assertion of absence in that case, anyway?  The alternatives are a pre-coordinated \"no x\" or \"does not have x\" code, or code.text.  </p>",
        "id": 153846613,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1473203149
    },
    {
        "content": "<p>There needs to be some way to say \"patient says that they are not allergic to peanuts\" and using a status of refuted in AlleryIntolerance seems wrong for several reasons: <br>\n1) it being recorded in status suggests that it was suspected and is now refuted <br>\n2) this is an unconfirmed assertion that something is not so, it has both confidence and negation. Status has values for confidence, _unconfirmed_ and _confirmed_. Adding to _refuted_ a new code  for _unconfirmed refutation_ means making the meaning of status unclear.<br>\nThere seem to be two concepts: life cycle status of the resource and whether the resource is positive or negative.</p>",
        "id": 153846624,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473208588
    },
    {
        "content": "<p>AllergyIntolerance is the place for that, not Condition</p>",
        "id": 153846625,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473209247
    },
    {
        "content": "<p>Oops, yes.<br>\nHow about \"patient says that they have never had chicken pox\"?</p>",
        "id": 153846626,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473209502
    },
    {
        "content": "<p>If we expand the meaning of 'refuted' to allow for 'asserter denial' - that would cover it, would it not?  (or add 'denied' as an option)</p>",
        "id": 153846633,
        "sender_full_name": "David Hay",
        "timestamp": 1473217193
    },
    {
        "content": "<p>That would cover it. But I think 'asserter denial' is outside the usual meaning of 'refuted'. Would it surprise people to discover that 'refuted' can mean 'claimed to not be so' and not just 'proved to not be so'?</p>",
        "id": 153846635,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473222681
    },
    {
        "content": "<p>At the moment there are values for 'thought to be true but unconfirmed' (unconfirmed), 'confirmed to be true' (confirmed) and 'confirmed to be false' (refuted). I see you idea as expanding the scope of 'refuted' to include 'thought to be false but unconfirmed'.</p>",
        "id": 153846636,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473222945
    },
    {
        "content": "<p>This means all queries need to not only look for the condition,. but also must include the not refuted (and all the future negative words). We are getting into dangerous triple negative space.  I have broad concerns, but in this case I am expressing a concern brought up in the context of Privacy and Security policy enforcement. Protecting sensitive statements is  hard enough without needing to include triple negative protection. (no specific meaning in the phrase triple negative except to convey that complexity lies here). I don't have the solution, but I understood a reason to leave the V3 space and do it better in FHIR was to simplify.  Surely with greenfields we can come up with a more elegant solution...</p>",
        "id": 153846669,
        "sender_full_name": "John Moehrke",
        "timestamp": 1473251373
    },
    {
        "content": "<p>I agree generally with <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>.  The TermInfo project (in Vocab) intends to develop an IG for use of terminology (initially SNOMED CT, but including others) in FHIR.  We do need to be careful to avoid overloading the meaning and intended use of 'status'.  I agree that the life cycle status of the resource itself and the presence or absence of the entity that the resource represents are separate things, and I think we're generally best off keeping them separate (it's a bit muddy right now in some places, including Condition.verificationStatus and AllergyIntolerance.status, and we don't want to make that worse).  We hope to address issues of this nature in the IG, and are planning to begin with AllergyIntolerance (where there's been considerable dicussion and a fair bit of work already done).  That's the thought at present, anyway.  It would be good to enterain further discussion of this and similar issues - and the terminology stream would be a good place for that.</p>",
        "id": 153846717,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1473281299
    },
    {
        "content": "<p>There are a whole load of requirements in this space that FHIR does not appear to have properly considered yet. Not just with conditions, but allergies, medications, procedures, ... In Australia, we currently have a number of explicit models for this which we cannot easily translate into FHIR because of the lack of ability say things like \"never had\", \"not currently taking\", &amp;c.  Any of which may be asserted by a variety of people: patient, related person, practitioner, &amp;c.  While terminology may well provide some of the answers, it is a known issue that SNOMED has little in the way of cooncepts describing negation and is unlikely to have the kind of expression our models currently carry for some time to come.  So I would think that there is a need to seriously consider having explicit model elements for negation.</p>",
        "id": 153846827,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473384887
    },
    {
        "content": "<p>Stephen, we do need to consider that - but the information model negation solutions in general certainly haven't been without their own problems<br>\nwe should take a further look at the Australian examples, and it would be very helpful to make sure that we've included whatever use cases and examples you have in the Negation Requirements project  - which will then feed into FHIR and, as much as possible, into the other standards families, as well</p>",
        "id": 153846829,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1473386240
    },
    {
        "content": "<p>Which working group does this fall under?  Is it Patient Care?  If so, <span class=\"user-mention\" data-user-id=\"192135\">@Stephen Chu</span> is aware of most of what we've done in this respect, but I can make sure he feeds our models to the WG.</p>",
        "id": 153846830,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473386483
    },
    {
        "content": "<p>Yes, it is Patient Care, and <span class=\"user-mention\" data-user-id=\"192135\">@Stephen Chu</span> certainly is aware - we should at least verify that we have all of the relevant models and requirements - you can talk to him about that, and I will as well</p>",
        "id": 153846831,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1473386771
    },
    {
        "content": "<p>Sweet.  I'll give Stephen some material to share with the WG. <img alt=\":smiley:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/smiley.png\" title=\":smiley:\"> </p>",
        "id": 153846832,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473387189
    },
    {
        "content": "<p>sounds good - thanks!</p>",
        "id": 153846833,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1473387670
    },
    {
        "content": "<p>Is there any evidence that any of those negation models reflect actual clinical practice?</p>",
        "id": 153846836,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473393322
    },
    {
        "content": "<p>I couldn't tell you.  I do know that the models, as they currently stand, are very poor from a data modelling practice perspective, but the basic ideas carried in them would seem to be useful; or, at least, to a non-clinician like me, they would seem to be useful!  However, I have no idea whether or not current systems allow the recording of things like \"not currently taking any medication\", \"not currently taking a particular medication\", \"no history of a given condition or procedure\", \"the patient has never undergone any procedures\".</p>",
        "id": 153846859,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473405921
    },
    {
        "content": "<p>We (in the Agency) find ourselves on the horns of a dilemma here.  On the one hand, FHIR's goal making things easy and straight for implementers is laudable and something we support; on the other we want to move forward what their systems record to foster a more sophisticated digital health ecosystem in Australia.</p>",
        "id": 153846860,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473406357
    },
    {
        "content": "<p>those are separate discussions. FHIR ia the underlying techniology, but you can make your profiles as tight as you like. However expereince shows that it's not very easy to get clinicians to agree to this. </p>",
        "id": 153846878,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473423138
    },
    {
        "content": "<p>yes, I think we should be aware and cautious not to tread very far (if at all) beyond where there is evidence of actual clinical practice and need (e.g.. the FHIR 80% rule)</p>",
        "id": 153846881,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1473433722
    },
    {
        "content": "<p>We don't want to make our profiles tight, we want to expand the models to include data items that may well be part of clinical practice, but do not currently fall within the 80% implementation boundary.  That is, data items in models, the lack of which is restricting clinicians from properly recording their actual practice.</p>",
        "id": 153846979,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473637549
    },
    {
        "content": "<p>Model expansion, not tightening!</p>",
        "id": 153846980,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473637649
    },
    {
        "content": "<p>typically, clinicians are not recordings things because they don't want to. Witnesss the howls of dismay here in USA where they are asked to</p>",
        "id": 153847058,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473704048
    },
    {
        "content": "<p>but there's no reason you can't add whatever you want in your profiles </p>",
        "id": 153847061,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473704079
    },
    {
        "content": "<p>Yeah, I get all that.  I suppose my thing is that, for example, the whole <code>AllergyIntolerance</code> resource is major overkill for an exclusion statement.  I could profile it down, but even then, it will only work where negated SNOMED codes (or the like) exist.  So if you want to record that a person is not allergic to obscure things (sunlight maybe?), that might be somewhat of a challenge without using modifier extensions (which I think we should be avoiding like the plague).  On the other hand, if we had a dedicated exclusion statement resource for allergies, not only would the model be much simpler, but I'd have access to the whole SNOMED substance and finding hierarchies to express exactly what I wanted.</p>",
        "id": 153847137,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473722144
    },
    {
        "content": "<p>Also, I'm not proposing forcing clinicians to record stuff they don't want to; I'm proposing enabling them to record stuff they do want to.</p>",
        "id": 153847138,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473722194
    },
    {
        "content": "<p>It's not just the clinicians - it's having multiple groups of clinicians who convince sufficient implementers to introduce the complexity of the additional resource into their persistence, user interface and external interface layers, including mapping existing data and then having clinicians use it.  It would require quite a bit of passion and money to make that happen - and there's a lot of places where most people would probably look for more bang for the buck elsewhere</p>",
        "id": 153847142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473728468
    },
    {
        "content": "<p>This is not just about persistence of data; e.g. I'm pretty sure most clinical systems have the capacity to persist information about particular things to which a person is not allergic.  This is also about how already persisted information is exchanged.  The model for exchanging non-allergies is heavy-weight and not easy to understand nor implement.</p>",
        "id": 153847143,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473729096
    },
    {
        "content": "<p>As far as whether or not expanding what's persisted in the space is worthwhile, that's not my job.  My job is to provide the expanded models and others decide whether they're worth investing in, and, if so, how.  I just need a means to have ready to go persistence models that people can use.  For those building FHIR servers, a FHIR resource would be good!</p>",
        "id": 153847144,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473729224
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  where did we get to with the AllergyIntolerance exlucsion statement stuff?</p>",
        "id": 153847147,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473741424
    },
    {
        "content": "<p>We have the discussion on Negated Allergies and Intolerances (<a href=\"http://hl7-fhir.github.io/allergyintolerance.html#9.1.3.2\" target=\"_blank\" title=\"http://hl7-fhir.github.io/allergyintolerance.html#9.1.3.2\">http://hl7-fhir.github.io/allergyintolerance.html#9.1.3.2</a>) about what we can do with AllergyIntolerance.code, and there is the substanceExposureRisk extension, which isn't a \"dedicated exclusion statement\" but allows for the full range of substance codes (or findings, as it's example) to be used in an exclusion statement, as Stephen is describing </p>",
        "id": 153847210,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1473785839
    },
    {
        "content": "<p>There's a lot here.<br>\nIf there are examples of negation requirements in AUS, let's try to make sure they are represented in the Negation project collection of requirements (<a href=\"http://wiki.hl7.org/index.php?title=Negation_Requirements\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Negation_Requirements\">http://wiki.hl7.org/index.php?title=Negation_Requirements</a>). I'd point out that we are trying to collect actual requirements, not curious examples of what could conceivably go wrong, e.g., triple negation.<br>\n(The \"patient reports never having had chicken pox\" case is interesting: do we know of someone who has wanted to record that?)<br>\nFor allergies, \"patient says\" no allergy to X is provenance, not a different flavor of negation. There's not a lot of confirmation testing in that domain, as I understand it.<br>\nFor conditions, it may be different, but my preference would be to put provenance in provenance. Who refuted something may be germane, but if it is, you can ask. If the refutation criterion of \"clinical evidence\" excludes patient testimony, well, then we have more to do.<br>\nIf we can keep the concepts of \"absent\" or \"not done\" separate from provenance and certainty, then SNOMED covers the need.</p>",
        "id": 153847226,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1473811443
    },
    {
        "content": "<p>Reading this old topic, if I want to say no known allergy intolerance, how do I do that?</p>",
        "id": 153880951,
        "sender_full_name": "David Cai",
        "timestamp": 1491374653
    },
    {
        "content": "<p>AllergyIntolerance.code = NKA (SNOMED code)<br>\nFor more information on negated allergies, refer to <a href=\"https://www.hl7.org/fhir/allergyintolerance.html#9.1.3.3\" target=\"_blank\" title=\"https://www.hl7.org/fhir/allergyintolerance.html#9.1.3.3\">https://www.hl7.org/fhir/allergyintolerance.html#9.1.3.3</a></p>",
        "id": 153880961,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1491388268
    }
]