[
    {
        "content": "<p>I work in on a FHIR application in the Oncology domain. For many pieces of clinical data (conditions, procedures etc), there may be 3 options:<br>\n1. The patient has/had this &lt;condition/procedure/...&gt;.<br>\n2. The patient does not/did not have this &lt;condition/procedure/...&gt;<br>\n3. We do not know whether or not the patient has this &lt;condition/procedure/...&gt;.</p>\n<p>The difference between (2) and (3) is important to the clinicians. Thus, we need to model (in FHIR) the negation of the data item (e.g. the patient does not suffer from diabetes), so that we can tell the difference between \"unknown\" and \"no\".<br>\nIs there a standard way to do this in FHIR?<br>\nThis applies to comorbidities, procedures (incl. surgeries, chemotherapies and radiation therapies) and maybe some other types of data.<br>\nThanks!</p>",
        "id": 153870538,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1486468522
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/allergyintolerance.html#9.1.3.3\" target=\"_blank\" title=\"http://build.fhir.org/allergyintolerance.html#9.1.3.3\">http://build.fhir.org/allergyintolerance.html#9.1.3.3</a></p>",
        "id": 153870542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486468809
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/condition.html#9.3.3.4\" target=\"_blank\" title=\"http://build.fhir.org/condition.html#9.3.3.4\">http://build.fhir.org/condition.html#9.3.3.4</a></p>",
        "id": 153870543,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486468826
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/observation.html#10.1.4.5\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#10.1.4.5\">http://build.fhir.org/observation.html#10.1.4.5</a></p>",
        "id": 153870544,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486468852
    },
    {
        "content": "<p>Thanks! But I forgot to say we're using DSTU2. Are those new in STU3?</p>",
        "id": 153870545,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1486468958
    },
    {
        "content": "<p>Having skimmed over that - List.emptyReason seems to exist in DSTU2 too: <a href=\"http://hl7.org/fhir/list-definitions.html#List.emptyReason\" target=\"_blank\" title=\"http://hl7.org/fhir/list-definitions.html#List.emptyReason\">http://hl7.org/fhir/list-definitions.html#List.emptyReason</a></p>",
        "id": 153870546,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1486469062
    },
    {
        "content": "<p>yes, you'll have to back port those approaches to DSTU2 with extensions - we put a lot of effort into this stuff during the STU3 preparation process</p>",
        "id": 153870548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486469319
    },
    {
        "content": "<p>What about Procedure? How do we say that a patient never had any radiation therapies (vs. \"we don't know whether or not the patient had any radiation therapies\")?</p>",
        "id": 153870555,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1486474290
    },
    {
        "content": "<p>Seems more like QuestionnaireResponse or Observation to me.  Same rationale as <a href=\"http://build.fhir.org/condition.html#9.3.3.5\" target=\"_blank\" title=\"http://build.fhir.org/condition.html#9.3.3.5\">http://build.fhir.org/condition.html#9.3.3.5</a> says:  It is common as part of checklists prior to admission, surgery, enrollment in trials, etc. to ask questions such as \"are you pregnant\", \"do you have a history of hypertension\", etc. This information should NOT be captured using the Condition resource but should instead be captured using QuestionnaireResponse or Observation. In this case, the combination of the question and answer would convey that a particular condition was not present</p>\n<p>That said, we do have a Procedure.notDone element (formally known as Procedure.notPerformed in DSTU2).  However, its use is intended for a slightly different use case, such as 1) a procedure was scheduled, but not done as originally planned, or 2) when there is an order NOT to do something, so documentation follows that the procedure was not done as ordered</p>",
        "id": 153870559,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1486477493
    },
    {
        "content": "<p>Also, Procedure probably won't be the resource for representing radiation therapy - there's a bunch of unique information for radiation that likely makes it appropriate to have its own resource.  (We're looking for implementers who want to push that forward as we don't have a lot of expertise \"in the room\" to do the design.)</p>",
        "id": 153870694,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486528957
    },
    {
        "content": "<p>You're probably right, but for now we're \"stuck\" with DSTU2 and we're using Procedure to model some of the data about the radiation therapy. We also don't have much expertise in that, we're learning as we go.<br>\nRegardless of radiation therapy, there are a few things we model as Procedure, and for them, we also need to be able to say whether the patient had this procedure, did not have this procedure, or if we don't know the answer.</p>",
        "id": 153870710,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1486547386
    },
    {
        "content": "<p>Do you actually want a full procedure record?  Typically questions like \"Has the patient had an appendectomy\" would be captured using Observation.  Procedure would only be used if you have details - like a date, location, etc.</p>",
        "id": 153870732,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486564140
    }
]