[
    {
        "content": "<p>Question on nesting ProcedureRequest under a DiagnosticOrder, and on what is happening for STU3. Here's the use case: <br>\nA physician orders an investigation for congestive heart failure, which is performed by a CT of the Thorax, with and without contrast (two separate studies; the first CT is performed without a contrast agent, then a contrast agent is injected, and then the second CT is performed). So, we would create a DiagnosticOrder for the \"Congestive Heart Failure\" reason, and that would contain two ProcedureRequests 1) CT Without Contrast and 2) CT With Contrast.</p>\n<p>What is unclear is how do we group that these ProcedureRequests underneath the original DiagnosticOrder.</p>\n<p>Remembering what was discussed in May - <a href=\"http://wiki.hl7.org/index.php?title=File:FHIR_Workflow.pptx\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=File:FHIR_Workflow.pptx\">http://wiki.hl7.org/index.php?title=File:FHIR_Workflow.pptx</a> - both DiagnosticOrder and ProcedureRequest would be based on the Request pattern - where there is a field called basedOn - which seems to make the most sense, but the current build does not have these fields. I'm not sure if there are plans to extend the DiagnosticOrder and ProcedureRequest with the items in the Request pattern. Or if the resource will be renamed DiagnosticRequest.</p>\n<p>I'm sure this has to have been hit before (especially in Lab), but I haven't been able to find any discussion on imaging workflows specifically. Any input would be appreciated.</p>",
        "id": 153837617,
        "sender_full_name": "Brad Genereaux",
        "timestamp": 1468319562
    },
    {
        "content": "<p>The decision coming out of FHIR Workflow is that we *won't* have parent-child orders.  Instead we'd have a single order for the comparison CT and the imaging department would define 3 separate orders (CT1, contrast admin, CT2) in fulfillment of the first CT.  Alternatively, the placer could just create two orders and have both share the same requisition id.  All work groups have been asked to add \"basedOn\" and I expect by next week you'll see it on both DiagnosticOrder and ProcedureRequest.</p>",
        "id": 153837647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468329777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span> , wouldn't that typically be ordered as a single procedure, \"Chest CT W &amp; W/O contrast\"? I didn't think that the administration of the contrast was considered a separate procedure. Also, the imaging comes through as one study with both series. </p>",
        "id": 153837718,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1468357579
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - that helps. Much appreicated. I'm looking forward to these updates.</p>\n<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> - for this, my perspective is more from the RIS / pre-acquisition side, than on the PACS side. On the \"PACS side\", we would expect that only one ImagingStudy and DiagnosticReport to be created - but from the RIS, there is a need for finer granularity, i.e. for example -<br>\n1) where things need to be protocoled prior to the request needing to be accepted, the protocol might have different parameters<br>\n2) where we have a definition of \"with contrast\", \"without contrast\", and having a third one of \"with and without contrast\" means there'd be a lot of duplication of pre-acquisition tasks<br>\n3) there's a chance that certain procedure requests would be cancelled over the course of the acquisition (i.e., patient is nauseous at time of exam, they may choose to not do the WITH CONTRAST, but they don't want to cancel the entire order - they will only fulfill the first part, and not fulfill the other parts)</p>",
        "id": 153837936,
        "sender_full_name": "Brad Genereaux",
        "timestamp": 1468396996
    }
]