[
    {
        "content": "<p>Something I hear often from 'architects' of 'large enterprise systems' is that FHIR is problematic because there's no way to prevent record corruption associated with resources having inconsistent relationships between them</p>",
        "id": 153850683,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474814466
    },
    {
        "content": "<p>a typical issue is if a Patient Condition references an observation for evidence, but the observation references a different patient</p>",
        "id": 153850684,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474814545
    },
    {
        "content": "<p>the problem here is that 99.999% of the time, that would be an error, but the other 0.001%, that would be correct</p>",
        "id": 153850685,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474814586
    },
    {
        "content": "<p>....life is never as simple as we would like it to be....</p>",
        "id": 153850686,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474814600
    },
    {
        "content": "<p>however, lets say that you were a clinical model type of person, and you wanted to comment about this - how would you say something about this in FHIR? </p>",
        "id": 153850687,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474814627
    },
    {
        "content": "<p>right now, there's only one way, to use FluentPath</p>",
        "id": 153850688,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474814643
    },
    {
        "content": "<p>so, I have a profile on Condition, and it says there might be an evidence observation, and that evidence has to be on the same patient. So, using an informal short hand for a profile:</p>",
        "id": 153850689,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474814843
    },
    {
        "content": "<div class=\"codehilite\"><pre>Condition Profile ([some uri])\n  Subject 1..1 Reference(Patient) - there must be a subject, and it must be a patient\n  Evidence 1..1 - there must be one piece of evidence\n    Detail 1..1 Reference(Observation) - there must be one observation for evidence\n      Profile = [some url] - the profile on observation that says what code it \n          must have, and that there must be a subject, a patient\n      constraint = resolve().subject = %resource.subject - the \n          subject of the target must have the same subject as the Condition resource\n</pre></div>",
        "id": 153850690,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474815042
    },
    {
        "content": "<p>fluentpath is a general purpose language that can solve all the problems you might imagine in this space.. but it's very generality means that it's not the easiest to interpret other than when validating. Is there a bounded set of problems in this space for which it would be useful to define a more specific language that would be easier to interpret?</p>",
        "id": 153850692,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474815131
    },
    {
        "content": "<p>So, an easy way to express reference constraints? A construct that allowed you to express paths to the source and target reference elements and the constraint asserts they are the same?</p>",
        "id": 153851260,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475167151
    },
    {
        "content": "<p>Condition.detail.ofType(Observation).subject.ofType(Patient) -&gt; Condition.subject.ofType(Patient)</p>",
        "id": 153851261,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475167266
    },
    {
        "content": "<p>Doesn't capture the cardinality constraints, and assumes resolution through references, but something like that?</p>",
        "id": 153851262,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475167318
    },
    {
        "content": "<p>yes. A syntax that's a lot easier to process than fluentpath (since that's the default fall back position).</p>",
        "id": 153851282,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475167704
    }
]