[
    {
        "content": "<p>When creating a new StructureDefinition with Forge (v. 22.0), why isn't  it possible to base the new profile on the base profile DomainResource  ? I would like to create a custom profile that is completely independent of the exiting profiles. Or is DomainResource so abstract, that my idea does not make sense at all ? (btw. is there a more specific stream for Forge related questions than \"implementers\" ?)</p>",
        "id": 175899492,
        "sender_full_name": "Georg Fette",
        "timestamp": 1568722420
    },
    {
        "content": "<p>Hi Georg,</p>\n<p>I think you're likely right that this is because DomainResource (and Resource) are abstract base resources, but I'll check with <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>. Can you share the use case you're looking to create a profile for?<br>\nYou're also welcome to ask Forge questions in the <a class=\"stream\" data-stream-id=\"179239\" href=\"/#narrow/stream/179239-tooling\">#tooling</a> channel. We're considering a dedicated stream for the Firely toolsuite, I'll put your vote on that :)</p>\n<p>Best,<br>\nWard</p>",
        "id": 175902266,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1568724653
    },
    {
        "content": "<p>What's your usecase for profiling DomainResource</p>",
        "id": 175903141,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568725241
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>, if you derive from <code>Resource</code> or <code>DomainResource</code>, you are defining a custom resource. Currently, Forge does not support custom resources.</p>",
        "id": 175905094,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568726572
    },
    {
        "content": "<p>Not necessarily.  You could theoretically profile DomainResource to set expectations around the use of meta, extension, etc. and \"instantiate\" that profile in other resources (e.g. Observation, AllergyIntolerance).  Is that the use-case <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span> ?</p>",
        "id": 175941167,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568749037
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  You're definining a new resource when <code>derivation=specialization</code>, but it would be a re-useable constraint (which is what Lloyd refers to) when <code>derivation=constraint</code>.   I read Georg's text (\"create a custom profile that is completely independent\") as wanting to create a new custom resource.</p>",
        "id": 175944284,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1568751273
    },
    {
        "content": "<p>My usecase is that I want to algorithmically transform a bunch of openehr archetypes and templates into fhir data model definitions. I do not need to specifically derive from anything, but as it seemed convenient to give the new structuredefinitions a basedefinition, I thought that domainresource could be nice. The resulting custom profiles are not compatible to anything from the rest of the fhir cosmos but at least I can use all tools and servers that are on the fhir side to handle my data, as from a specification point of view it will be fhir.</p>",
        "id": 175976226,
        "sender_full_name": "Georg Fette",
        "timestamp": 1568789812
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> indeed, that is possible but also not currently supported by Forge.</p>",
        "id": 175997063,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568807865
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> It sounds like that's not what Georg needs so we'll leave it as a theoretical possible future requirement.</p>\n<p><span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span> If you're defining logical models, you can't start those with DomainResource (because they're not FHIR resources).  If you wanted to define a logical model that looked similar to DomainResource and had similar elements and inherit from that, you could</p>",
        "id": 176000293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568810333
    },
    {
        "content": "<p>within v2+ this also a consideration/use case. Why not creating logical models that have the same characteristics like resources, although they are not \"official\"?<br>\nNext we would like to generate an API for it...</p>",
        "id": 176190523,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1568984804
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span> You cannot use Logical models to exchange data. You can only exchange instances that conform to an actual resource definition. You can implement an interface based on custom resource definitions. Of course such an interface would not be FHIR compliant.</p>",
        "id": 176191514,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568985499
    },
    {
        "content": "<p>you cannot instantiate a logical model with data?</p>",
        "id": 176192684,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1568986314
    },
    {
        "content": "<p>there's actually 2 answers to this: you cannot instantiate a logical model with data <em>and be FHIR conformant</em>. But you can instantiate a logical model with data and be conformant to something else, whatever the logical model is expressing</p>",
        "id": 176193808,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568987072
    },
    {
        "content": "<p>e.g. CDA or V2</p>",
        "id": 176193816,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568987080
    }
]