[
    {
        "content": "<p>Wanting to surface the abnormality level for a diagnostic report that is based on the most severe abnormality (abnormal interpretation) in the results that compose that report.  For example, the abnormality level for a laboratory test could classified as \"Normal\", Abnormal\" or \"Critical\".  This abnormality level then needs to be available as an element in the summary query version of the FHIR DiagnosticReport API.  Before moving towards publishing an extension, is there any work going on in this area?</p>",
        "id": 153891458,
        "sender_full_name": "Rod McDonald",
        "timestamp": 1496020718
    },
    {
        "content": "<p>We have not seen this come on DR before.  The <code>Observation.interpretation</code> are where results interpretations are usually reported.  What is the use case?  And would the <code>DiagnosticReport.codedDiagnosis</code> work?</p>",
        "id": 153891462,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496021390
    },
    {
        "content": "<p>The use case is within a Clinical Document Viewer (tree structure) in which Diagnostic Report details include an overall abnormality status (from all the individual Observation interpretations).  It is intended that the _summary version of the FHIR DiagnosticReport API will be able to include this overall abnormality status without having to include the contained Observation resources.  Not sure I can see how the DiagnosticReport.codedDiagnosis  would work?</p>",
        "id": 153891602,
        "sender_full_name": "Rod McDonald",
        "timestamp": 1496105033
    },
    {
        "content": "<p>We're going to create a new extension for this, probably called something like diagnosticreport-abnormalityInterpretation, as a Code with values \"normal\", \"abnormal\" or \"critical\", determined based on the collection of Observation.interpretation. Any better suggestions?</p>",
        "id": 153891992,
        "sender_full_name": "David Teirney",
        "timestamp": 1496354959
    },
    {
        "content": "<p>What about using .conclusion?  You can make a string into a code,  but then you would give up free text since can not support both.  Free free to  submit a tracker to OO to consider as a new element on DR or a standard extension. </p>",
        "id": 153891993,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496355835
    }
]