[
    {
        "content": "<p>We're facing a large body of work that doesn't translate well into existing resources. So we could</p>\n<p>-Create a Basic resource for every chunk<br>\n-Create new resources</p>\n<p>Either solution could be followed up with a proposal to add them to the core. Considering that it evolves around use cases that are presumably too Dutch to make international, we might not get those approved. </p>\n<p>Are there any recommendations to make here?</p>",
        "id": 153902345,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502699124
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>, if any of the proposed new resources won't reach approval, then they probably also won't be supported by any available FHIR tooling (out of the box).</p>",
        "id": 153902349,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1502701806
    },
    {
        "content": "<p>True, but they wouldn't be supported at the very start either. We will build stuff for STU3. It's not until R4 they we _may_ get out-of-the-box tooling support. </p>\n<p>The tradeoff is that while Basic resource profiling leverages built in FHIR capabilities, it is a “dragon” compared to the concise (domain specific) XML it is today. Building new resources however is even worse because it is very possible that what we create is never accepted internationally.</p>",
        "id": 153902350,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502701959
    },
    {
        "content": "<p>Basic is not much fun. It'll get you started, maybe.  If has less risk - a little less. The best way is to describe the scope of the things you talking about here, and have discussion on the likely scope here, then run by the likely committees, and seek for contributers</p>",
        "id": 153902352,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502702775
    },
    {
        "content": "<p>then design your own, given the comments you get, and then take back to committee</p>",
        "id": 153902353,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502702789
    },
    {
        "content": "<p>I agree that's the \"royal way\" (Dutch expression). When it comes down to creating my own set: hoew does that work? Can I just start a StructureDefinition on a new type of resource? Do I start from Excel? Do I start from a logical model?</p>",
        "id": 153902383,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502711159
    },
    {
        "content": "<p>we're trying to move from spreadsheets for profiles - and it's not working very well. I'm not even trying for resources. It's spreadsheets only.</p>",
        "id": 153902385,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502711237
    },
    {
        "content": "<p>you can start with a logical model, sure. but eventually it has to become a spreadsheet representation if it's going to be a real resource. Though it probably wouldn't be to hard to write a converter</p>",
        "id": 153902386,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502711287
    },
    {
        "content": "<p>Alright. That just limits my (initial) processing options to the publisher I guess — we normally work through Simplifier</p>",
        "id": 153902387,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502711313
    },
    {
        "content": "<p>maybe. slow build though. I might even prototype with a logical model myself now</p>",
        "id": 153902388,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502711341
    },
    {
        "content": "<p>Slow is better than not at all :-) Logical Model is definitely an option although we have none so far</p>",
        "id": 153902389,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502711412
    },
    {
        "content": "<p>Keep in mind that if you use custom resources, you can't claim to be FHIR conformant.  It would really be helpful to get a sense of what sort of resources you're expecting to need</p>",
        "id": 153902418,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502719204
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>, if desired, we could implement support in Forge for authoring (new) core resources/datatypes. Seems similar to authoring logical models, which is already supported, so it shouldn't be too hard.<br>\nHowever support for custom datatype constraints on element types is a bit trickier to implement...</p>",
        "id": 153902420,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1502725376
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>: understood. The domain is too much to cover in whole here, but I'll try to give a taste:</p>\n<p><a href=\"https://www.istandaarden.nl\" target=\"_blank\" title=\"https://www.istandaarden.nl\">https://www.istandaarden.nl</a> -- This is a Dutch language website that deals, among other aspects, with communication patterns around 4 bills (laws). Long term care, social care, youth care, mental care. They are mostly administrative in nature. They for example deal with whether or not a person is eligible to receive care/help coordinated by their municipality. The types of services they could be eligible for vary from vacuum cleaning, washing, to changing of \"supporting stockings\".</p>\n<p>The first use case we're going work on is the decision report that details their eligibility for these municipal services. The information model for that is here: <a href=\"https://modellen.istandaarden.nl/wlz/iwlz1_2/index.php/IO31_(View)\" target=\"_blank\" title=\"https://modellen.istandaarden.nl/wlz/iwlz1_2/index.php/IO31_(View)\">https://modellen.istandaarden.nl/wlz/iwlz1_2/index.php/IO31_(View)</a>. They now have their own XML format for sending stuff.</p>\n<p>What you'll see in Dutch:<br>\n- Header == FHIR MessageHeader [we'll skip that]<br>\n- Client == FHIR Patient<br>\n- Relatie/Contact == FHIR RelatedPerson<br>\n- Indicatie == ... [this is where the Indication decision is]<br>\n    - GeïndiceerdZorgzwaartepakket == ... [a package with a certain weight. More weight is eligible to more care]<br>\n    - GeïndiceerdFunctie == ... [a physical or mental function that gets attention under the decision]<br>\n    - Stoornis == FHIR Problem [background for the decision]<br>\n    - StoornisScore == FHIR QuestionnaireResponse [background for the decision. questions related to the Stoornis]<br>\n    - Beperking == FHIR Observation? [physical or mental impairment/limitation]<br>\n    - BeperkingScore == FHIR QuestionnaireResponse [background for the decision. questions related to the Beperking]</p>\n<p>The Indicatie [Indicated decision on care eligibility] sort of resembles EligibilityResponse but has very different properties. It also has some characteristics of a Contract, in the sense that you can hold your municipality to this decision when it comes to reimbursement.</p>\n<p>For the truly curious: the full list of messages they currently have is here. To the right you may download their XSDs for that: <a href=\"https://modellen.istandaarden.nl/wlz/iwlz1_2/index.php/Berichten\" target=\"_blank\" title=\"https://modellen.istandaarden.nl/wlz/iwlz1_2/index.php/Berichten\">https://modellen.istandaarden.nl/wlz/iwlz1_2/index.php/Berichten</a></p>",
        "id": 153902472,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502779655
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> That is a tempting offer. Would the FHIR Community itself not benefit from creating reusable patterns, i.e. datatypes through Forge, regardless of my particular use case? For our purposes I first need a little more work on our attack strategy before asking new features from Forge. Thanks though, I'll keep it in mind</p>",
        "id": 153902474,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502779863
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> a lot of this stuff sounds like decision support outcomes</p>",
        "id": 153902475,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502779920
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> will you be in San Diego? At the connectathon?</p>",
        "id": 153902478,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502780675
    },
    {
        "content": "<p>No sorry. Funding thing. I'll not be in San Diego at all</p>",
        "id": 153902479,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502780710
    },
    {
        "content": "<p>these kind of questions require funding... well, we'll pursue them here</p>",
        "id": 153902480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502780754
    },
    {
        "content": "<p>Well there's funding for doing work on this, but that does not include going to the WGM this round :(</p>",
        "id": 153902481,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1502780802
    },
    {
        "content": "<p>The contractual aspect sounds more like a pre-determination than an eligibility check.  In the former, you're presumed to have some sort of coverage and the question is \"if we were to provide services of this type, would the cost be covered (and possibly how much of the cost would be covered?\".  Eligibility is more about \"if you were to seek coverage, would we likely give you coverage?\".  My leaning would definitely be to use the existing resources, generifying them as necessary, rather than creating something country-specific.  The scope you appear to be talking about doesn't seem like something that's country-specific - though of course some of the data-elements might be.</p>",
        "id": 153902500,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502805256
    },
    {
        "content": "<p>Definitely agree these sound like decision support outcomes, and that the current resources should be able to cover the use cases here.</p>",
        "id": 153903246,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1503417023
    },
    {
        "content": "<p>Have you also looked into the EpisodeOfCare resource also for the tracking of things?<br>\nAs activities occur I expect that some will be allocated to the various types, and EpisodeOfCare can be used to track this.</p>",
        "id": 153903784,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1503825408
    }
]