[
    {
        "content": "<p>There's a new layout at <a href=\"http://build.fhir.org/resourcelist.html\" target=\"_blank\" title=\"http://build.fhir.org/resourcelist.html\">http://build.fhir.org/resourcelist.html</a></p>",
        "id": 153873679,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488171079
    },
    {
        "content": "<p>it's driven by a more architectural approach. It's more systematic, but less... conven ient</p>",
        "id": 153873680,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488171102
    },
    {
        "content": "<p>comments welcome</p>",
        "id": 153873681,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488171108
    },
    {
        "content": "<p>Would be good to make the far-left labels vertical to waste less space.  Conformance should be listed before security.  Don't like the \"Summary\" and \"Diagnosis\" labels.  I thought the proposal had labled them something else?</p>",
        "id": 153873685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488171777
    },
    {
        "content": "<p>summary was labelled 'clinical' but that was silly sitting next to 'clinical resources'</p>",
        "id": 153873690,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488174485
    },
    {
        "content": "<p>diagnosis is my typo</p>",
        "id": 153873691,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488174489
    },
    {
        "content": "<p>But they're not all summary resources - some of them are detail resources.  </p>",
        "id": 153873697,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488176013
    },
    {
        "content": "<p>Sir please large the font of tooltip over resource names.</p>",
        "id": 153873701,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1488176949
    },
    {
        "content": "<p>I don't think we have any control over that </p>",
        "id": 153873703,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488177035
    },
    {
        "content": "<p>I don't mind if you have something other than 'summary' but it can't be 'clinical</p>",
        "id": 153873704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488177062
    },
    {
        "content": "<p>It should be a style setting somewhere or other.  Anyone with expertise is welcome to chime in.</p>",
        "id": 153873705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488177068
    },
    {
        "content": "<p>I hope I can do that</p>",
        "id": 153873707,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1488177125
    },
    {
        "content": "<p><a href=\"http://stackoverflow.com/questions/15027301/change-font-size-of-td-title-attribute\" target=\"_blank\" title=\"http://stackoverflow.com/questions/15027301/change-font-size-of-td-title-attribute\">http://stackoverflow.com/questions/15027301/change-font-size-of-td-title-attribute</a> - bit of mucking around</p>",
        "id": 153873709,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488177188
    },
    {
        "content": "<p>I think it shoud be a browser thing - hint size is a local thing not a server thing</p>",
        "id": 153873710,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488177209
    },
    {
        "content": "<p>Yes I think you are right. but there are some jquery libs that can do the job.</p>",
        "id": 153873714,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1488177912
    },
    {
        "content": "<p>need to be very careful about jquery - we already use it, but sparingly. Need to be the same version for all uses, needs to work offline, needs to be same across all browsers</p>",
        "id": 153873715,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488177975
    },
    {
        "content": "<p>sir like this <a href=\"https://jqueryui.com/tooltip/\" target=\"_blank\" title=\"https://jqueryui.com/tooltip/\">https://jqueryui.com/tooltip/</a><br>\nthis is official one </p>",
        "id": 153873716,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1488178074
    },
    {
        "content": "<p>Media is missing  and i don't like it  Sticking stuff at top that nobody (well me) never uses or cares about.  I think should be a popularity contest  most used stuff at top.   forgotten stuff at bottom  </p>",
        "id": 153873725,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488178861
    },
    {
        "content": "<p>maybe a third pragmatic view <br>\nview</p>",
        "id": 153873726,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488178954
    },
    {
        "content": "<p>This resourcelist does not render well on mobile display. It is usable, as I can scroll right... </p>",
        "id": 153873799,
        "sender_full_name": "John Moehrke",
        "timestamp": 1488206546
    },
    {
        "content": "<p>although I focus more on foundation, I would think our audience would rather see base first, then foundation. </p>",
        "id": 153873800,
        "sender_full_name": "John Moehrke",
        "timestamp": 1488206644
    },
    {
        "content": "<p>Lemme clarify my response.  I use this page for navigating to resources, so from that perspective I think this view a step backwards.  But after further review of the content and its context it is very useful.  I would however still like a view for navigating to the resources.</p>",
        "id": 153873801,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488207656
    },
    {
        "content": "<p>well, we could have 3 views. Still seeing opinions on this</p>",
        "id": 153873859,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488225790
    },
    {
        "content": "<p>Also, the veritcal text doesn't render in IE properly.</p>",
        "id": 153873902,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1488236974
    },
    {
        "content": "<p>As described Person resource is referring to a person that is outside the healthcare setting.<br>\nwhat comes in my mind that the Person resource is for the persons in the organization like CEO, Head of Department or HR admin.</p>\n<p>*1st. So, in this case, we must have a PersonRole resource for that person in the organization. Like we have PractionerRole for the Practitioner</p>\n<p>If the point 1st does not look appropriate then the 2nd point should be consider</p>\n<p>*2nd. Group resource should also refer to the person resource so that we can say this person is lying in a specific group</p>\n<p>I think by using one of the above techniques we will be able to define a person in an organization that is outside the healthcare setting in a more appropriate way.</p>",
        "id": 153873962,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1488263249
    },
    {
        "content": "<p>The Person definition needs work.  Person is a \"linking\" resource - that should be first and foremost in the definition.  Person has no role and can have no role associated with them.  The \"role\" of Person is conveyed by the Patient, Practitioner or RelatedPerson resources.</p>",
        "id": 153874039,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488297741
    },
    {
        "content": "<p>Yes as Lloyd describes it can be a linking resource, and also a registry that is for use outside the healthcare setting. So maintaining an overall list of people that haven't entered the healthcare system yet (e.g. In a local council could be rate payers - who could be eligible for receiving community services, or in an insurance system the subscribers - until they actually need to receive care).<br>\nThen once the enter into use in the healthcare system they will be entered as either Patient, RelatedPersion or Practitioner resources (depending what they are doing).<br>\nFrom your example of a CEO, that would be a practitioner (with a role of CEO) if you were actually recording that in the healthcare solution.<br>\nPerson records don't perform anything, and can't have anything done to them, you need one of the other resources listed here to do that. (hence isn't a part of groups or anywhere else)</p>",
        "id": 153874125,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1488323405
    },
    {
        "content": "<p>Hi Brian,<br>\nI don't think your nuance of \"outside of the healthcare system\" is useful.  Persons can't be referenced by any resource - which means they can't be used in any context inside our outside of the healthcare system except for linking.  Someone who's eligible for a service is a Patient - they're in the role of actual or potential recipient of care.</p>",
        "id": 153874131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488324480
    },
    {
        "content": "<p>Outside the direct linkage usage I'd mostly I'd expect to see this interface on non healthcare systems to provide a list of potential people to use inside the healthcare system.</p>",
        "id": 153874132,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1488324759
    },
    {
        "content": "<p>Just as with my example of subscribers, members, or other person registries.</p>",
        "id": 153874133,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1488324794
    },
    {
        "content": "<p>Oh I see, <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> So,  If I need more roles in PractionerRole I will add extensions/dataTypes in PractionerRole by creating a profile according to my neads? </p>",
        "id": 153874179,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1488338359
    },
    {
        "content": "<p>Just more PractitionerRole instances with the details of the new roles that the prac does.</p>",
        "id": 153874180,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1488338398
    },
    {
        "content": "<p>Subscribers are considered Patients when referenced by Coverage.  I'd expect the registries of them to be the same.  I don't think there's any circumstance where Person should be used except as a Linkage resource.  (That was the agreement when FMG approved it . . .)</p>",
        "id": 153874182,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488339263
    },
    {
        "content": "<p>Yes, by that time the are patients.</p>",
        "id": 153874183,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1488339294
    },
    {
        "content": "<p>Not sure what you mean \"by that time\".  If you're a subscriber, your a Patient whether you're in a registry or attached to a Coverage.  Person is role-less.  I can't see how it could possibly be used for anything other than linking.  And the agreement was that it wouldn't be.  So not sure why the definition doesn't just say that explicitly.</p>",
        "id": 153874187,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488339735
    }
]