[
    {
        "content": "<p>Hello FHIR community! I'm hoping to get some feedback on the following...</p>\n<p>How are implementers handling elements of type CodeableConcept where no terminology binding is specified? A few examples that I have come across thus far are observation.componenet.valueCodableConcept, careplan.detail.statusReason, medication.ingredient.itemCodeableConcept, etc. Thanks in advance for any feedback you can offer!</p>",
        "id": 188045078,
        "sender_full_name": "Christopher Vitale",
        "timestamp": 1581535747
    },
    {
        "content": "<p>in almost cases, that means the committee is still working on the bindings.  i know that in Pharmacy that is definitely the case.  eventually all of our CodeableConcept elements will have bindings.</p>",
        "id": 188045902,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1581536243
    },
    {
        "content": "<p>people are putting their own codes in there. It sounds like you have a more specific question?</p>",
        "id": 188045930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1581536265
    },
    {
        "content": "<p>Thank you both for the quick reply!</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , I do not have a more specific question. As we work through implementing US Core and referenced resources, I have come across about 20 of these thus far. But can you please clarify? When you say people are putting their own codes in there, do you mean local codes? Or people are simply putting any code from any code system (local or standard)? Thanks again!</p>",
        "id": 188046461,
        "sender_full_name": "Christopher Vitale",
        "timestamp": 1581536610
    },
    {
        "content": "<p>In some cases, there won't ever be bindings on an international - or even a national - basis.  E.g. billing codes.  There's just no chance of getting consensus or being able to point at a publicly available example set.  The standardization of terminology varies by area and by country.  What HL7 can lock down it does, but it can't lock down very much.  Implementation guides like US Core can (and do) lock down more, but even they can't lock down everything.  Something like valueCodeableConcept can really only be meaningfully constrained in the context of a specific Observation.code.  You won't find a single value set that covers the components of an APGAR, the different types of genetic variants and the possible values for the questions in a psychiatric assessment in a single value set.</p>",
        "id": 188050521,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581539409
    },
    {
        "content": "<p>Thank you, Lloyd. This is very helpful.</p>",
        "id": 188121795,
        "sender_full_name": "Christopher Vitale",
        "timestamp": 1581610576
    }
]