[
    {
        "content": "<p>Greetings Everyone!<br>\nSuper new to this form so excuse me if I am not sending this message to the right group. I was reaching out if anyone can help in how do I get details of the non-FHIR Data Types of External Payers while recieving US core Profiles</p>",
        "id": 227488606,
        "sender_full_name": "Virali",
        "timestamp": 1614108286
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"391981\">@Virali</span>.  Welcome.  One thing to note when posting to <a href=\"http://chat.fhir.org\">chat.fhir.org</a> is to make sure you set your \"topic\" when you ask a question so that each distinct discussion has its own thread.  (You posted your original question to \"US Core Goal\".  I used my admin privileges to change the topic to \"non-FHIR Data Types.)</p>",
        "id": 227497051,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614111658
    },
    {
        "content": "<p>I'm not fully understanding the question.  Can you explain what you mean by \"non-FHIR Data Types of External Payers\"?</p>",
        "id": 227497107,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614111684
    },
    {
        "content": "<p>Who are you communicating with?  In what context?  What type of data are you wanting to receive?</p>",
        "id": 227497159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614111708
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/non-FHIR.20Data.20Types/near/227497159\">said</a>:</p>\n<blockquote>\n<p>Who are you communicating with?  In what context?  What type of data are you wanting to receive?</p>\n</blockquote>\n<p>Hi @Lloyd McKenzie thank you for the brief education. I appreaciate that. My question is that if I want to receive Non-FHIR data from external payers for 21 US Core Profiles. How can I get in touch with the Payer's External Data</p>",
        "id": 227548560,
        "sender_full_name": "Virali",
        "timestamp": 1614142887
    },
    {
        "content": "<p>I'm still not really understanding.  If you're using US Core profiles, then the data will, by definition, be FHIR data.  If you're receiving non-FHIR data, then this really isn't a great place to ask the question as the focus of this community is around sharing data in standardized ways.  Can you give a specific example of what you mean by \"non-FHIR data\"?</p>",
        "id": 227607244,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614177352
    }
]