[
    {
        "content": "<p>Encounter quite specifically states is as being between a patient and care provider. We need to model information acquired in meetings between care  professionals - specifcally in a multi-disciplinary team meeting, where professionals discuss the case, may alter the diagnosis and may decide the care plan. The next patient Encounter is not a logical place for this information - different date, different participants. The most logical way is to use Episode of Care to aggregate Encounters, and have patient-professional and MDT encounters. So is it \"legal\" in FHIR to use Encounter for non-patient encounters?</p>",
        "id": 186371936,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1579772360
    },
    {
        "content": "<p>Here is the previous discussion for similar senario: <a href=\"#narrow/stream/179166-implementers/topic/FHIR.20Community.20navigation.20help\" title=\"#narrow/stream/179166-implementers/topic/FHIR.20Community.20navigation.20help\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/FHIR.20Community.20navigation.20help</a><br>\nand here is JIRA ticket: <a href=\"https://jira.hl7.org/browse/FHIR-20479\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-20479\">https://jira.hl7.org/browse/FHIR-20479</a></p>",
        "id": 186398443,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1579792710
    },
    {
        "content": "<p>A simple answer is no.</p>",
        "id": 186398509,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1579792769
    },
    {
        "content": "<p>PA is working on a solution.</p>",
        "id": 186398649,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1579792829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span> There were extensive discussions regarding this at the last WGM. Our group ended up modelling MDTB as an Encounter (per patient discussion) which is partOf another Encounter (MDTB). Composition resource holds all the associated documents they present at the tumor board.<br>\nIn the last discussion I was part of, the resolution was to 1) update the description of the Encounter in the next release to broaden up its definition, and 2) add participation backbone element with the \"required\" property which could hold the value of \"informational only\" (as in Appointment resource) to support that usecase. Not sure what  happening with that now. <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 186437322,
        "sender_full_name": "Halina Labikova",
        "timestamp": 1579814629
    },
    {
        "content": "<p>We'll be talking about it at the WGM this week.</p>",
        "id": 187172846,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1580583934
    },
    {
        "content": "<p>We are using Encounter in the same way in our TumorBoard Software. Any updates on this?</p>",
        "id": 190605406,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584206287
    }
]