[
    {
        "content": "<p>We're proposing to refine and slightly loosen the requirements for fullUrls on Bundle.entry to more clearly reflect what our original intention was (as well as what's useful/appropriate).  However, loosening normative requirements is technically a breaking change, so we're seeking community review and feedback on this proposed clarification.  If you implement Bundles - and in particular batch or transaction, please read <a href=\"http://jira.hl7.org/browse/FHIR-31354\">FHIR#31354</a> and comment here on whether you agree or disagree with the proposed change.</p>",
        "id": 255151177,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632795764
    },
    {
        "content": "<p>What does this statement mean; can you give an example?</p>\n<p>\"invoking or responding to an operation where the body is not a single identified resource; \"</p>",
        "id": 255205431,
        "sender_full_name": "John Silva",
        "timestamp": 1632831015
    },
    {
        "content": "<p>If you're invoking $validate and are passing in a resource that 'exists' somewhere, the fullUrl would be the location of that resource.  However, the OperationOutcome you get back wouldn't have a resource id and doesn't exist on a specific server, so no fullUrl would be needed.  If invoking $graphql, there's no resource payload on the request at all, so there also wouldn't be a fullUrl.</p>",
        "id": 255224323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632838813
    },
    {
        "content": "<p>Feedback on how to be clearer is welcome.</p>",
        "id": 255224353,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632838825
    },
    {
        "content": "<p>Does this affect only batch and transaction bundles? Document bundles with use of fullUrl feels a little bit wonky. It is fine if the resource fullURL (when it is a url and not a urn) exists on the server that the document exists on, but there is no guarantee of that (the document itself may have passed through several servers) and there is no guarantee that the entry resources exist outside of the document. </p>\n<p>This has been a point of some confusion that I think we may see more of when FHIR native documents become more prevalent. We should at least have clearer guidance regarding how this should work and what the expectations are (more clearly laid out) or consider taking another look at this to see if there is a way to simplify.</p>",
        "id": 255231993,
        "sender_full_name": "Corey Spears",
        "timestamp": 1632841520
    },
    {
        "content": "<p>In a document Bundle the fullUrl is necessary for references among the resources in the Bundle, isn't it?</p>",
        "id": 255270499,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1632852605
    },
    {
        "content": "<p>Yes, that is the way it is currently defined, though it could be more explicit in the documents documentation. The FHIR Documents section (<a href=\"https://www.hl7.org/fhir/documents.html\">https://www.hl7.org/fhir/documents.html</a>) doesn't even mention fullUrl.</p>",
        "id": 255273033,
        "sender_full_name": "Corey Spears",
        "timestamp": 1632853521
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> we need fullUrl in documents when we do not have identifiable resources (e.g. CDA to FHIR transformation)</p>",
        "id": 255279394,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1632855696
    },
    {
        "content": "<p>fullUrl is needed any time resolution is necessary - which is the case for all entries in a document or message and may be true for some entries in transactions - we appear to presume it's also always true for 'collection' Bundles, though there's no documented requirement there.  We've also asserted that It's true when the entries correspond to entries that represent content available on a server, though it's not entirely clear to me why we require this.</p>",
        "id": 255281501,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632856465
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Normative.20.28breaking.3F.29.20change.20to.20Bundle.20fullUrl.20requirements/near/255281501\">said</a>:</p>\n<blockquote>\n<p>fullUrl is needed any time resolution is necessary - which is the case for all entries in a document or message and may be true for some entries in transactions - we appear to presume it's also always true for 'collection' Bundles, though there's no documented requirement there.  We've also asserted that It's true when the entries correspond to entries that represent content available on a server, though it's not entirely clear to me why we require this.</p>\n</blockquote>\n<p>Hi Lloyd, <br>\nthe requirements around Bundle.fullUrl seems going backward from build to build of the validator v3.0.2.  What I mean is that in the older builds of the _cli.jar validator, it never complained about missing Bundle.fullUrl for OperationOutcome entry in the Bundle.  In the new builds since 2021-02-18, the validator starts to raise error for the same Bundle document I have which is a searchset.   The error is </p>\n<p>Error @ Bundle.entry[1] (line 733, col12) : Except for transactions and batches, each entry in a Bundle must have a fullUrl which is the identity of the resource in the entry  </p>\n<p>Is this the requirement that you are trying to loosen?  If not what is the reason for that a fullUrl is now needed for OperationOutcome in the Bundle?</p>\n<p>Thanks,</p>\n<p>Amy</p>",
        "id": 256631217,
        "sender_full_name": "Amy Li",
        "timestamp": 1633633111
    },
    {
        "content": "<p>The rule was always there (and is, in fact tighter than it needs to be).  We're trying to create additional clarity in R5.  Feel free to submit a change request around this, though there's also a proposal to move OperationOutcome in a Bundle outside of entry entirely and deprecate that approach.</p>",
        "id": 256634082,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633634221
    },
    {
        "content": "<p>Thank you Lloyd.<br>\nIt makes perfect sense to move OperationOutcome outside of Bundle.entry.  For one obvious reason, OperationOutcome is not counted in the <a href=\"http://Bundle.total\">Bundle.total</a> and for another it has different characteristics as other resources.  I would definitely welcome this change in the future releases.</p>",
        "id": 256651354,
        "sender_full_name": "Amy Li",
        "timestamp": 1633641333
    }
]