[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>, OO indicated that Observation is a candidate for Normative in R4. The stated scope of Observation includes:</p>\n<ul>\n<li>Vital signs such as body weight, blood pressure, and temperature</li>\n<li>Laboratory Data like blood glucose, or an estimated GFR</li>\n<li>Imaging results like bone density or fetal measurements</li>\n<li>Devices Measurements such as EKG data or Pulse Oximetry data</li>\n<li>Clinical assessment tools such as APGAR or a Glasgow Coma Score</li>\n<li>Personal characteristics: such as eye-color</li>\n<li>Social history like tobacco use, family support, or cognitive status</li>\n<li>Core characteristics like pregnancy status, or a death assertion</li>\n</ul>\n<p>where do we stand on these usages? can we say anything solid or loose about all of them?</p>",
        "id": 153891863,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496277497
    },
    {
        "content": "<p>It's also used for genetics.  There's some intrisic instability with that domain given its rapid evolution, but I'm not sure that signals instability in its use of Observation.</p>",
        "id": 153891867,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496278280
    },
    {
        "content": "<p>Almost all of these are all well within the Observation's  Scope and pretty well documented and I think non-controversial.  The poorly documented/controversial use-cases ( beside genetics which I always have considered as part of lab, but currently sports its own standard profile, a sequence resources and seems to be unsettled as Lloyd stated ) is patient reported observations which was identified as an area that we need to work on, as well as some device generated data like EKG data where there has been noise about creating a new resource - but I haven't seen anything yet.  This as much an issue about the sampledData data type as anything.  Currently we are investigating boundaries between Observation and the Media resource ( in cooperation with Imaging ) -  lot of that has to do with the Attachment data type.    </p>",
        "id": 153891875,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496279367
    },
    {
        "content": "<p>can we do any connectathon work in these areas? I ask now because we're doing connectathon planning now</p>",
        "id": 153891876,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496279929
    },
    {
        "content": "<p>I'm doing $LastN  ( I don't think Graphql can handle that- can it?)  But the  best thing would be patient reported data stream maybe with OpenMHealth -that would be cool.    Could do a blood glucose and diet log...</p>",
        "id": 153891878,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496280275
    },
    {
        "content": "<p>that would be good - and might dovetail well with another connectathon stream </p>",
        "id": 153891879,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496280618
    },
    {
        "content": "<p>graphQL - I'll work on operations</p>",
        "id": 153891880,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496280629
    }
]