[
    {
        "content": "<p>Hi there,</p>\n<p>We are implementing FHIR Subscriptions, which work well to notify subscribers of created/updated/deleted resources. <br>\nToday we got the question how it would be possible to subscribe for changes to tags and security labels. </p>\n<p>Communicating that as an update on the resource would be possible, but not logical given that the resource itself hasn't changed, at least, its version hasn't changed.</p>\n<p>Has anyone tried implementing subscriptions / notfications for change to tags and security labels?</p>\n<p>Thanks,</p>\n<p>Theo</p>",
        "id": 153908805,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1505504751
    },
    {
        "content": "<p>Hi Theo. In principle, you subscribe to changes to the resource. So anything that changes the content  (including, through the rest interface, any update, patch, delete, or create) will trigger a subscription event</p>",
        "id": 153908827,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505519985
    },
    {
        "content": "<p>it's possible to use $meta-add and $meta-delete to change just the meta. We have not defined whether or not that triggers subscriptio</p>",
        "id": 153908828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505520017
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, </p>\n<p>Thanks for your response/ You said: \"it's possible to use $meta-add and $meta-delete to change just the meta. We have not defined whether or not that triggers subscription\".<br>\nThat is exactly the type of clarification that I am looking for. The particular issue being here that the resource doesn't get a new version when only the meta fields change.</p>\n<p>How can we resolve this to recommended behavior?</p>\n<p>Thanks,</p>\n<p>Theo</p>",
        "id": 153908883,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1505739729
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153908884,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1505739746
    },
    {
        "content": "<p>Theo, We have not defined this because it is going to be something that different regions and deployments will want to handle in different ways. Some really want changes to meta to change version, some don't want it to change version, and others only want the version to not change for specific tag changes.   I would be interested in your use-case so that I can make sure the security WG addresses it (I am co-chair).</p>",
        "id": 153908896,
        "sender_full_name": "John Moehrke",
        "timestamp": 1505741121
    }
]