[
    {
        "content": "<p>Interested in learning how systems represent concepts relating to NPO and which FHIR resources you (would) use to render/represent them:</p>\n<p>(1) the order \"NPO\" -  <em>Nil per os</em> ( a.k.a. Nothing per mouth  - likely mapping to the concept \"Nil by mouth\" (regime/therapy) SCTID: 182923009) <br>\n-This can be a temporary order (e.g., NPO at midnight before a study or surgery) while an inpatient or for a more prolonged period (e.g., intestinal conditions or disorders where a patient may be NPO for many weeks). <br>\n-I expect this is most commonly a nursing order, but it obviously also needs to be seen by nutritional services, pharmacy, etc... Would ServiceRequest be used? -Does anyone one use a NutritionOrder instead, in addition? -Is it every Flagged in your system?<br>\n(2) NPO status - the documentation that the patient is currently NPO ( likely mapping to \"On nothing by mouth status \"(finding) SCTID: 450819000) <br>\n-Would one use Observation?<br>\n(3) Patient direction/instruction - \"Do not take anything by mouth after 11 pm the evening before your scheduled procedure.\" </p>\n<p>Welcome further thoughts/feedback/input. <br>\n<span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span> </p>\n<p>[Note:  these are already structured as \"negative\" concepts and would not require additional negation such as doNOTperform.  Previously covered ground. ]</p>",
        "id": 156615510,
        "sender_full_name": "Michael Padula",
        "timestamp": 1548172741
    },
    {
        "content": "<p>The \"how would you represent it in FHIR\" will be significantly influenced by how this concept is captured/represented within the current EHR systems.  <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span></p>",
        "id": 156615720,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548172896
    },
    {
        "content": "<p>Lots of discussion in Patient Care about this a while ago...check out <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9335\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9335\">GF#9335</a></p>",
        "id": 156619560,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1548175836
    },
    {
        "content": "<p>Speaking as Cerner now, for #1, yes, NPO is an order.  For example, “diet NPO” or “NPO except for ice” are generally represented as pre-coordinated codes (not necessarily deeply structured).  I need to check into the other two (TBD).</p>",
        "id": 156620666,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1548176716
    },
    {
        "content": "<p>But what kind of order - nutrition order? medication order? service request?  Based on how it lives in your system, which FHIR interface would end up exposing it?</p>",
        "id": 156623245,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548178839
    },
    {
        "content": "<p>ServiceRequest or NutritionOrder.</p>",
        "id": 156635487,
        "sender_full_name": "Eric Haas",
        "timestamp": 1548188008
    },
    {
        "content": "<p>Our underlying EHR classifies NPO as nutrition orders, but I think we are currently exposing them as ProcedureRequests (DSTU2) at the moment (soon to be ServiceRequest when we uplift to R4).</p>",
        "id": 156730385,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1548281927
    },
    {
        "content": "<p>I follow the logic to include it among Nutrition Orders, but the idea I prefer using ServiceRequest (as Michelle highlights its location in R4) has merit as well since it remains relevant to maintains relevance to the Pharmacy.  The other scenario, which is common, is \"NPO except for medications\", which seems most appropriate as a nutrition order. Appreciate the feedback.</p>",
        "id": 156778821,
        "sender_full_name": "Michael Padula",
        "timestamp": 1548342478
    },
    {
        "content": "<p>Upon further investigation, the scope of our DSTU2 ProcedureRequest is configurable and nutrition orders are currently excluded, by default.  When we uplift to ServiceRequest in R4, we'll revisit whether we keep the same scope or not.  Either way, we don't have NutritionOrder implemented.</p>",
        "id": 156786642,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1548348128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193259\">@Margaret Dittloff</span> ( our  NO expert ),  how is NPO represented in the resource,  my thought was a code at NO.oralDiet.type = [NPO code]</p>",
        "id": 156786837,
        "sender_full_name": "Eric Haas",
        "timestamp": 1548348289
    },
    {
        "content": "<p>Update on #3:  Sometimes, those simple instructions are verbally communicated to the patient during the preadmission phone call and they may not have it written down anywhere.  Other times, patients may receive a printed copy when they’re in the surgical clinic (or direct messaged to them).  Either way, not terribly standardized or discretely documented.</p>",
        "id": 156869387,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1548438231
    }
]