[
    {
        "content": "<p>Is it possible to store \"Number of Previous Operations\" in Condition resource?</p>",
        "id": 246061702,
        "sender_full_name": "Mohsen Jafari",
        "timestamp": 1626335205
    },
    {
        "content": "<p>I think this case is similar to <a href=\"#narrow/stream/179166-implementers/topic/Previous.20Hospitalizations\">this one</a> about number of previous hospitalization. <br>\nI would not advise to add it to a condition: A condition may last longer, but the number of previous operations may change over time. Also you have to distinguish: Number of operations in total or related to a condition.<br>\nTherefore you could either count the number of procedures with a code indicating an operation, which are related to the condition in question; or if you don't have these procedures you could use an observation focussing the condition.<br>\nAt least it's my point of view, others might see it differently.</p>",
        "id": 246072622,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1626342498
    },
    {
        "content": "<p>I almost copied and pasted my previous answer, but yes, don't look for new places to add custom values/attributes. Find a way to get the info you need with the existing structures. That way everybody shares the same interface, shares the same documentation, shares the same info in the same way. In this situation, search for all the procedures that you consider an operation AND that reference the condition you are concerned with. For calculable fields (sums, avg, etc.) get the base data and do the math, that way if the base data changes between now and then, your calculation stays up to date, just in time.</p>\n<p>I'll admit that there may be a situation where the data you want just isn't available on any resource (or set of resources) and that's when you go to HL7 and say, \"We need to store X attribute on Y resource.\" But it'll probably never be an sum/avg for a point in time.</p>",
        "id": 246085714,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626351672
    }
]