[
    {
        "content": "<p>I would like to  say a patient did six sessions with a physiotherapist in the context of a treatment.<br>\nAs far as I understand the Procedure resource, it can be used for \"long term services\", and I can see in Procedure indeed the Procedure.performed[x] allows for a period, so far so good. However: what if I want to further clarify the patient had six sessions in that period -&gt; is the right way to just include an extension to model that or would there be a better way?</p>",
        "id": 189093082,
        "sender_full_name": "Robin Bosman",
        "timestamp": 1582704319
    },
    {
        "content": "<p>Have looked at EpisodeOfCare as a grouper for the 6 procedures ? Depending of your definition of 'a treatment' that could be appropriate. Or perhaps even CarePlan. Don't use extensions until you're really, really, sure it isn't already covered in some other way in FHIR.</p>",
        "id": 189094626,
        "sender_full_name": "René Spronk",
        "timestamp": 1582706177
    },
    {
        "content": "<p>Thanks! As a context: this would be used in a FHIR message flow (so no REST exchange) to insurance organizations to report what was done, for administrative purposes. In CarePlan I see indeed in details we could give a pt code and a quantity for the number of sessions and keep status on 'done', that would solve it. <br>\nA justification for an extension in Procedure would be that we keep our message lighter, but we want to do it the correct way of course.</p>",
        "id": 189099850,
        "sender_full_name": "Robin Bosman",
        "timestamp": 1582711188
    },
    {
        "content": "<p>If you're grouping for administrative purposes, EpisodeOfCare nor carePlan may be your best option, perhaps some more non-clinical grouper such as Encounter or even List may be appropriate.</p>",
        "id": 189116732,
        "sender_full_name": "René Spronk",
        "timestamp": 1582726240
    },
    {
        "content": "<p>Right! I think in this project we might look at List in some other use cases. <br>\nHowever, I am still a little bit in the dark concerning my original question: to just model the patient went six times to a pt during a certain time period. It seems to me a bit heavy to include six encounter resources - of course if we just keep them to the bare minimum I guess it would be acceptable.</p>",
        "id": 189130904,
        "sender_full_name": "Robin Bosman",
        "timestamp": 1582734662
    },
    {
        "content": "<p>It all depends. Most systems, if a patient visits a hospital or other medical facility six times, will create 6 encounters. The use of encounters is heavily impacted by financial insurance/reimbursement rules. You have plenty of those in Belgium, more so than in most countries..</p>",
        "id": 189192450,
        "sender_full_name": "René Spronk",
        "timestamp": 1582788611
    }
]