[
    {
        "content": "<p>I have a question about the interaction between Oauth and asynchronous requests.  If you have a request from system A to system B  that's being authorized by the Patient, what happens if the OAuth token expires before the asynchronous request is delivered?  Is that a problem or does the authorization token only matter for the initiation of the request, not the retrieval of the response? (FYI <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> )</p>",
        "id": 169728898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562352722
    },
    {
        "content": "<p>Logically, I would have thought it only matters for the initiation...</p>",
        "id": 169729060,
        "sender_full_name": "David Hay",
        "timestamp": 1562352845
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> ?</p>",
        "id": 169729902,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562353673
    },
    {
        "content": "<p>The user is only needed during the authorization process.  During that process, System B would request an access token from System A, which after approval would be used for communications on behalf of the user.  It is up to System A to determine expiration when granting the access token (and to manage any revocation requests from the user).  System A can also include a Refresh Token, so that access can continue without involving the user.</p>",
        "id": 169730703,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1562354631
    },
    {
        "content": "<p>That said, if the token between System A and System B expired and there was no refresh token, the user would need to re-authorize the application.</p>",
        "id": 169730770,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1562354691
    },
    {
        "content": "<p>Leaving the technical issues to one side for the moment though, doesn't it make more sense from the user's perspective that it success regardless? (in the absence of other failure reasons of course)? As the initiator, it would be irritating for me to have to start again just because it took a bit longer than expected to complete...</p>",
        "id": 169730958,
        "sender_full_name": "David Hay",
        "timestamp": 1562354910
    },
    {
        "content": "<p>The asynchronous response I'm looking at might involve human intervention, which can be quite unpredictable in terms of duration.  Would I be better off figuring out a different mechanism (i.e. not using async) if the authorization token should be time-limited, but the time to respond should be open-ended?</p>",
        "id": 169732228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562356444
    },
    {
        "content": "<p>I think the principle is that the Client must be, and continue to remain <em>authorized</em>, for the entire length of the transaction. In this case, the client can acquire a new token (e.g. using a refresh token) but if the token expires and the client cannot demonstrate that it is still authorized, it should not be able to continue the transaction. I think a similar case is when a client is authorized for a workflow which involves multiple steps. If the client's authorization expires at some point during the transaction and it fails to reauthorize itself, then it should not be considered authorized.</p>",
        "id": 169733066,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1562357385
    },
    {
        "content": "<p>I think it's a policy question, but I think that if a user revoked access, they might find continued access rather surprising</p>",
        "id": 169735430,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562360136
    },
    {
        "content": "<p>I think the explanation here is straightforward and the solution elegant: <a href=\"https://nordicapis.com/how-to-handle-batch-processing-with-oauth-2-0/\" target=\"_blank\" title=\"https://nordicapis.com/how-to-handle-batch-processing-with-oauth-2-0/\">https://nordicapis.com/how-to-handle-batch-processing-with-oauth-2-0/</a></p>",
        "id": 169836407,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1562553424
    },
    {
        "content": "<blockquote>\n<p>I think the explanation here is straightforward and the solution elegant: <a href=\"https://nordicapis.com/how-to-handle-batch-processing-with-oauth-2-0/\" target=\"_blank\" title=\"https://nordicapis.com/how-to-handle-batch-processing-with-oauth-2-0/\">https://nordicapis.com/how-to-handle-batch-processing-with-oauth-2-0/</a></p>\n</blockquote>\n<p>That article is exceptional. It shows a very mature and best-practice.  I would highly recommend this.</p>",
        "id": 169864520,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562589549
    },
    {
        "content": "<p>That said, I agree with Grahame, and was about to post my answer \"of that is policy\" but he got there first.</p>",
        "id": 169864556,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562589587
    },
    {
        "content": "<p>The policy in question needs to consider the risks. In the article Brendan points to, the batch job is making regular payments, so it is making changes. In the case of a FHIR Subscription, it is not making changes, but might be improperly notifying. So there is a different risk profile.   The case where the user decides to NOT authorize this subscription, that should be looked to as a new operation against the Subscription. So the most important risk is that when the subscription is going to notify, to be sure the user and app still exist and have a relationship. (Not good to notify a patient that has died).</p>",
        "id": 169864807,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562589784
    },
    {
        "content": "<p>so, it depends on policy and circumstances. Nothing wrong with using the model outlined in the article.  But the whole set of risks must be considered, such as the death of the subscriber (payer)...</p>",
        "id": 169864947,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562589899
    },
    {
        "content": "<p>Catching up here, I think <span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span> said it just right. In general <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> if you have an authorized async step, there should still be authorization in place at the end of the process. (In Bulk Data we use SMART Backend Services authorization with asynchronous operations, so a client can always fetch new access tokens as needed; with the SMART App Launch framework for user authorization, you'd probably want a refresh token.)</p>",
        "id": 170416691,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1562636120
    }
]