[
    {
        "content": "<p>We're looking into setting up an OAuth2 server that allows for clients to authenticate themselves and then request FHIR resources from our data store. The recommended approach for this seems to be the following (SMART on FHIR):</p>\n<p><a href=\"http://docs.smarthealthit.org/authorization/backend-services/\" target=\"_blank\" title=\"http://docs.smarthealthit.org/authorization/backend-services/\">http://docs.smarthealthit.org/authorization/backend-services/</a> </p>\n<p>We will not be authenticating against an existing EHR Auth Server - we're setting this up ourselves.</p>\n<p>Our primary use case will be for third parties to request (via GET calls) bundles of resources that they are granted access to via specific authorization rules we establish. One way we were thinking of doing this was to set up a database of \"users\" (e.g. clients) that would then be able to make authenticated API calls to our server to get what they need. They'd do this by sending along the appropriate Authorization header with their requests.</p>\n<p>So...on to my question. Should we pursue a JSON Web Token (JWT) model where:</p>\n<ul>\n<li>Clients generate a public/private key pair, and store the private key securely</li>\n<li>We store the client public key</li>\n<li>Clients create single use JWT's, and make requests to a <code>/token</code> endpoint we set up, which returns them an access token</li>\n<li>Clients can use this \"bearer\" token until it expires</li>\n</ul>\n<p>This does seem more cumbersome to set up, but secure in the long run. Open to thoughts...</p>",
        "id": 153952047,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1523538278
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?</p>",
        "id": 153952099,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523554372
    },
    {
        "content": "<p>I think you have a wide design space available to you. On the lowest end of the spectrum: just give developers API keys that they can use directly for API calls (forever or until revoked). To avoid long-lived shared secrets, the asymmetric cryptography infrastructure helps. We proposed this (with a JWT-based OAuth flow) in SMART as a good fit for many use cases -- but it's entirely possible that it's \"too cumbersome\". We're trying to learn more on  this front through community feedback.</p>",
        "id": 153952104,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1523555421
    },
    {
        "content": "<p>One overarching goal is to find an approach in a sweet spot of \"good security properties\" and \"not too cumbersome\" ... to the point that it can be come commonly adopted and understood across many vendors and use cases. We've had modest success here with user-facing app OAuth protocols, but here hasn't been enough attention to \"backend services\" yet.</p>",
        "id": 153952105,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1523555566
    },
    {
        "content": "<p>I agree with Josh on the current state of the art. This specific use-case is one we (the FHIR community) is trying to gather experience and formulate a position on. You might want to join the \"Security and Privacy\" stream. Over there is a specific thread to this topic <a href=\"https://chat.fhir.org/#narrow/stream/Security.20and.20Privacy/topic/backend.20service.20secure.20communication\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/Security.20and.20Privacy/topic/backend.20service.20secure.20communication\">https://chat.fhir.org/#narrow/stream/Security.20and.20Privacy/topic/backend.20service.20secure.20communication</a></p>",
        "id": 153952108,
        "sender_full_name": "John Moehrke",
        "timestamp": 1523556881
    },
    {
        "content": "<blockquote>\n<p>I think you have a wide design space available to you. On the lowest end of the spectrum: just give developers API keys that they can use directly for API calls (forever or until revoked). To avoid long-lived shared secrets, the asymmetric cryptography infrastructure helps. We proposed this (with a JWT-based OAuth flow) in SMART as a good fit for many use cases -- but it's entirely possible that it's \"too cumbersome\". We're trying to learn more on  this front through community feedback.</p>\n</blockquote>\n<p>Hey <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>, I'm sorry if the resources for this are covered in FHIR but I'll ask anyway, but what about biometrics? Can the clients use biometrics in order to sign-on? (i.e. fingerprints, facial detection). Does FHIR have resources built for this type of security protocol?</p>",
        "id": 153952129,
        "sender_full_name": "Akeem Leighton Foster Spencer",
        "timestamp": 1523562152
    },
    {
        "content": "<p>FHIR doesn't have resources for authentication (biometric or otherwise). For user-facing apps, an identity provider certainly can provide support for multiple factors including passwords, OTP, device flows, biometrics, etc. This gets into details of authentication, which should be orthogonal to how FHIR and an authorization spec are created.</p>",
        "id": 153952143,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1523568243
    },
    {
        "content": "<p>Specifically for backend services (the question in this thread), there's no user in the loop, so it wouldn't make sense to talk about biometrics.</p>",
        "id": 153952144,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1523568274
    },
    {
        "content": "<p>in general you should look to SCIM for this - see <a href=\"http://www.simplecloud.info/\" target=\"_blank\" title=\"http://www.simplecloud.info/\">http://www.simplecloud.info/</a></p>",
        "id": 153952324,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523653255
    },
    {
        "content": "<blockquote>\n<p>in general you should look to SCIM for this - see <a href=\"http://www.simplecloud.info/\" target=\"_blank\" title=\"http://www.simplecloud.info/\">http://www.simplecloud.info/</a></p>\n</blockquote>\n<p>Hi Grahame, is this what you would recommend for this use case? Poking around, I think the SCIM protocol does show promise, especially if part of the goal is to limit what folks should be granted access to based on their identity.  <a href=\"https://tools.ietf.org/html/rfc7644\" target=\"_blank\" title=\"https://tools.ietf.org/html/rfc7644\">https://tools.ietf.org/html/rfc7644</a></p>\n<p>I also wonder how this would work in practice. I suppose we could provision users in a database but include enough information to encode them as SCIM objects. Then, when users (clients) make requests using OAuth, that mechanism doesn't change but we can restrict what FHIR resources those users can access once the request makes its way through.</p>",
        "id": 153954801,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1524846555
    },
    {
        "content": "<p>SCIM would mnage the user accounts and permissions (in the authorization server). And I'd use OAuth, yes. And the Authorization server users the user details in the SCIM fronted database to decide what user is allowed to do. THis requires that the resource server be firmly welded to the Authorization server for permission/access control as well as authorization</p>",
        "id": 153954869,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524872172
    }
]