[
    {
        "content": "<p>Hi everyone,</p>\n<p>Wondering if there's a way to constrain the scope on an OAuth2 token to a specific profile of a resource.<br>\nConsider a server of Observations, which include both blood/lab work as well as mental health assessments - these are distinguished by their conformance profiles.<br>\nThe patient wants to only issue authorization for an app to access his blood/lab work Observations, but not his mental health assessment Observations.<br>\nProfile seems to be an ideal way to distinguish these -- e.g. in a FHIR search, the _profile argument would be used to distinguish between the two.<br>\nIs there something similar in scope definitions for SMART on FHIR? (or maybe even the HEART Profile for OAuth2?)</p>\n<p>Thanks!<br>\n (Cross-posted to SMART on FHIR google group: <a href=\"https://groups.google.com/forum/#!topic/smart-on-fhir/VYTfxbP8U-M\" target=\"_blank\" title=\"https://groups.google.com/forum/#!topic/smart-on-fhir/VYTfxbP8U-M\">https://groups.google.com/forum/#!topic/smart-on-fhir/VYTfxbP8U-M</a>)</p>",
        "id": 154021333,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1543422060
    },
    {
        "content": "<p>So the clients would have to issue different searches? That does not seem nice</p>",
        "id": 154021334,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1543422929
    },
    {
        "content": "<p>..also: are apps the right focus? We do have that feature in our system but it is user-based - i.e. sensitive data like mental health or drug use can be seen only by specific users - regardless of how they access the data (via an app or directly in our internal UI etc)</p>",
        "id": 154021336,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1543423737
    },
    {
        "content": "<p>Consider a widget/applet/viewlet whose function is to retrieve and display bloodwork and other lab Observations from a server, as part of another GUI/Portal Page. As a patient, you're authorizing the widget to access the repository on your behalf, to retrieve only the Observations that conform to the bloodwork FHIR profile (so scope=patient/Observation.read), but don't want to give it access to read any more than that, for whatever privacy reasons. No diagnostic imaging reports, no mental health, just be for personal privacy practices.</p>\n<p>Is there native support for something like that to be defined in the scope element of an OAuth request/access token? Or something that's been profiled as part of SMART on FHIR or HEART?</p>",
        "id": 154021413,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1543437508
    },
    {
        "content": "<p>for casual readers: from the Smart email list, this is a future todo</p>",
        "id": 154021524,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543482060
    }
]