[
    {
        "content": "<p>I have a class hierarchy that expresses FHIR in an object-oriented form. The classes in the model are based on commonalities between various resources, and arranged according to similar functional semantics. The class structure starts at DomainResource and eventually reaches the Resources. In between, there classes that contain common elements that occur in multiple resources. An example is a generic Request, which specializes to ServiceRequest, and then ReferralRequest and ProcedureRequest. The hierarchy also extends below the resources, describing additional classes that map to profiles. By creating child classes, you can extend FHIR in object-oriented fashion. The classes also smooth out some of the irregularities between resources, such as, where one class uses different name for the same semantics. So in the \"parallel universe\" of object-oriented classes, things are a bit more consistent. I also have the capability to exported the entire thing as FHIR profiles in DSTU2, STU3, and (very soon) R4 -- thus creating profiles and implementation guides. Objective FHIR, as I'm calling it, has also developed conversions from FHIR resources into the object-oriented form (in ES6) and back, so business logic can be executed on the object-oriented version of FHIR. <br>\nBasically this is just a trial balloon to see how many people find that idea interesting. Is this something useful to the FHIR community?</p>",
        "id": 164941497,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1557098359
    },
    {
        "content": "<p>Sounds very useful, or at least I have a use for it. I also had to write something that does parts of that and would love to replace my own implementation by something more sophisticated. Did you use a specific programming language or did you manage to make the approach programming language agnostic ? Will it be publicly available ?</p>",
        "id": 164958842,
        "sender_full_name": "Georg Fette",
        "timestamp": 1557125847
    },
    {
        "content": "<p>I've been intending to generate the patterns into HAPI at some stage. Howe much do you follow the patterns?</p>",
        "id": 164971279,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557139147
    },
    {
        "content": "<p>as for profiles as classes - that's problematic because profiles are patterns of use, and not exclusive. A single resource may conform to multiple different patterns. I've been intending to generate facades for the profiles</p>",
        "id": 164971350,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557139222
    },
    {
        "content": "<p>a few of us discussed what you're doing last night. Can you comment on how consistency has progressed over FHIR releases?</p>",
        "id": 164971361,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557139255
    },
    {
        "content": "<p>and the things you smoothed over - do you want to create tasks for committees to consider making changes for them?</p>",
        "id": 164971378,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557139280
    },
    {
        "content": "<p>As a secondary view this could be useful, but the serialization couldn't be driven by it because it messes with the sort order.  Also, it wouldn't work for projects to continue extending.  The schemas need to be fixed and universal.</p>",
        "id": 164973583,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557141794
    },
    {
        "content": "<p>We'regoing to spend some time talking about this today, Q4 - Salon Drummond East</p>",
        "id": 164978258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557146234
    },
    {
        "content": "<p>I  built something conceptually similar to that years ago for the HL7 V3 RIM. But FHIR has moved away from the OO inheritance model. Any commonalities between resource types are supposed to be represented by Design Patterns.<br>\n<a href=\"http://www.hl7.org/fhir/documentation.html\" target=\"_blank\" title=\"http://www.hl7.org/fhir/documentation.html\">http://www.hl7.org/fhir/documentation.html</a><br>\nSo a FHIR OO model would generally have only a single inheritance layer with all resource type classes inheriting from a an abstract \"Resource\" superclass. And then interfaces for each of the four design patterns, which would be implemented by each of the resource type classes which follow those patterns.</p>",
        "id": 164981288,
        "sender_full_name": "Nick Radov",
        "timestamp": 1557149170
    },
    {
        "content": "<p>that's how I've been thinking about it</p>",
        "id": 164981477,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557149370
    },
    {
        "content": "<p>but note that I do generate one additional super type in the HAPI classes - a Metadata resource</p>",
        "id": 164981497,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557149394
    },
    {
        "content": "<p>The C# Reference Library has an abstract base Resource Class from which all Resource Type classes inherit and this includes a Meta object property which is an instance of a meta (data) class.</p>",
        "id": 164983427,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1557150997
    },
    {
        "content": "<p>MetadataResource is something else - it's the base for all resources that have a canonical URL</p>",
        "id": 164983938,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557151330
    },
    {
        "content": "<p>The .NET API also implements an abstract base class for <code>DomainResource</code>, e.g. <code>Resource &gt; DomainResource &gt; Patient</code></p>",
        "id": 164990528,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1557156021
    },
    {
        "content": "<p>Conformance resources implement <code>IConformanceResource</code> with some common fields</p>",
        "id": 164990550,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1557156043
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span> Objective FHIR is available. See <a href=\"http://standardhealthrecord.org/guides/shrcore/modeldoc\" target=\"_blank\" title=\"http://standardhealthrecord.org/guides/shrcore/modeldoc\">http://standardhealthrecord.org/guides/shrcore/modeldoc</a></p>",
        "id": 165281656,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1557430016
    }
]