[
    {
        "content": "<p>Observation.value is 0..1 so it cannot handle multiple answers apparently. Does that mean I should always turn to Questionnaire for those cases? In V3 the Observation/value is 0..*. Was the FHIR limitation a conscious move?</p>",
        "id": 166299759,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1558552277
    },
    {
        "content": "<p>The expectation is that you're capturing separate Observation instances or you're using a data type like SampledData.  Questionnaire is for data capture, but not for analysis/comparison/querying.</p>",
        "id": 166300688,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558552887
    },
    {
        "content": "<p>Or use Observation.component</p>",
        "id": 166301037,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1558553158
    },
    {
        "content": "<p>example here for a  multiple answer question:  <a href=\"http://build.fhir.org/observation-example-alcohol-type.html\" target=\"_blank\" title=\"http://build.fhir.org/observation-example-alcohol-type.html\">http://build.fhir.org/observation-example-alcohol-type.html</a></p>",
        "id": 166301215,
        "sender_full_name": "Eric Haas",
        "timestamp": 1558553281
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>   the observation should be the result and the observation value should be the value.  Where multiple observation values are reported, typically (at lease from a lab perspective) they would be reported on separate results/observations (question and answer pairs is another way to think about the modeling) </p>\n<p>Your question also highlights a fundamental aspect of interoperability.  If folks are modeling the same types of data differently, inoperability may occur.  Will be interesting to see how this evolves for the use cases described.</p>",
        "id": 167850304,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1560260166
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , how should be interpreted when there are several extensions attached to the same observation? (e.g. genetics)<br>\nShould they really be separated Observations?</p>",
        "id": 169388976,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1561982538
    },
    {
        "content": "<p>In the draft genomics reporting IG,  most elements of a genetics report are either modeled as distinct Observations or as Observation.component.  There are very few places where extensions are needed/appropriate.  (You can see the draft IG here: <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/\">http://build.fhir.org/ig/HL7/genomics-reporting/</a></p>",
        "id": 169399459,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561990959
    },
    {
        "content": "<p>But current profile doesn't follow that right? <a href=\"https://www.hl7.org/fhir/observation-genetic.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/observation-genetic.html\">https://www.hl7.org/fhir/observation-genetic.html</a><br>\nOr maybe I'm misunderstanding something...</p>\n<p>Anyway, for complex observations the general rule would be to define each minimal observation that can be identified in their own profile and then create references on these observations from... another (upper level) observation profile? or maybe using another resource e.g. inside of sections in a composition?</p>",
        "id": 169408985,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1561997984
    },
    {
        "content": "<p>Right.  Which is why there's a notice at the top of the profile noting that it's going to be replaced and pointing to the draft IG as guidance.</p>",
        "id": 169412204,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562000730
    },
    {
        "content": "<p>The general rule is that anything that can be stated independently in a meaningful way should be a distinct Observation.  Anything that's qualifying/describing what was observed should be an Observation.component.  Anything that's qualifying the Observation process itself rather than describing what was observed (e.g. who verified the Observation, what the specimen delivery mechanism was, etc.) would be appropriate as an extension.</p>",
        "id": 169412361,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562000840
    }
]