[
    {
        "content": "<p>In the PACIO Project (IGs and reference implementations for post-acute care), we are using the Observation resource to hold the data from a post-acute care functional status assessment (e.g. Section GG which measures mobility - ability for patient to walk, toilet, get in/out of bed, etc.).  Often, devices are needed to complete the assessment, such as a cane walker, ramp, etc., which is useful to include as part of the assessment.  Observation supports a list of devices, but for observation measurement purposes, so it would seem that we would need to add an extension to convey the devices needed by the patient to complete the assessment.  I would like to avoid adding an extension if possible.</p>\n<p>Thoughts?</p>\n<p>Thanks!</p>",
        "id": 194957007,
        "sender_full_name": "Dave Hill",
        "timestamp": 1587573041
    },
    {
        "content": "<p>Seems more an observation value (or code) than a device - eg 'Can walk' observations have possible values 'Yes', 'No', 'With cane'</p>",
        "id": 194962301,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1587575444
    },
    {
        "content": "<p>My reading is that <span class=\"user-mention\" data-user-id=\"222957\">@Dave Hill</span> is looking for the device that was used to help in the assessment -  not \"from now on the patient is able to walk but needs a cane\" but \"we used this cane to assess the patient's ability to walk)</p>",
        "id": 194963815,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587576084
    },
    {
        "content": "<p>right?</p>",
        "id": 194963820,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587576087
    },
    {
        "content": "<p>My understanding is that the observation.device has a presumed role - that the device was active in returning the observation value.</p>",
        "id": 194965522,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587576832
    },
    {
        "content": "<blockquote>\n<p>we used this cane to assess the patient's ability to walk</p>\n</blockquote>\n<p>...that sounds an observation code to me then: 'Can walk with cane' (LOINC has a bunch of that kind of things: eg <a href=\"https://loinc.org/68260-9/\" title=\"https://loinc.org/68260-9/\">https://loinc.org/68260-9/</a>)</p>",
        "id": 194969880,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1587578845
    },
    {
        "content": "<p>sorry, I should have written \"we used THIS cane to assess the ability to walk\"</p>",
        "id": 194970166,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587578995
    },
    {
        "content": "<p>and I don't think that is the same. <br>\n\"We used this cane to see if the patient can walk\" does not mean \"patient can walk with cane\".</p>",
        "id": 194970300,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587579054
    },
    {
        "content": "<p>(especially when we gave the cane but the patient could still not walk)</p>",
        "id": 194970339,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587579076
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222957\">@Dave Hill</span> please chime in on your intent. <br>\nMy reading of your question is similar to recording the Snellen chart used for checking the vision after surgery</p>",
        "id": 194970732,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587579280
    },
    {
        "content": "<p>Agree with Michelle....This sounds like a terminology thing to me.  either the code like he proposed or the value.  (e.g. walks with cane, walks with walker, walks with assistance etc.   Like mentioned above the device element is for recording the Device <em>used</em> to capture the measurement/finding.</p>",
        "id": 194986112,
        "sender_full_name": "Eric Haas",
        "timestamp": 1587586754
    },
    {
        "content": "<p>Interesting... If it is not Observation.device (because that is for devised used to capture findings/measurements), then where does something like a cane go?  <br>\nIt looks like \"Cane\" can be captured as a SNOMED code like in this valueset <a href=\"https://www.hl7.org/fhir/valueset-device-kind.html\" title=\"https://www.hl7.org/fhir/valueset-device-kind.html\">https://www.hl7.org/fhir/valueset-device-kind.html</a><br>\nFrom there- Would it then be one of those listed resources, such as Resource: <strong>Procedure.usedCode</strong> (CodeableConcept / Example)?</p>",
        "id": 194987619,
        "sender_full_name": "Matt Zajack",
        "timestamp": 1587587502
    },
    {
        "content": "<p>If you needed to identify the specific device used, you'd need an extension.  If you just need to know the 'kind' of device used, pre-coordinating it into the Observation.code or using Observation.methodCode would be most appropriate</p>",
        "id": 195010585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587605284
    },
    {
        "content": "<p>or an extension on Observation.device to express the role of the device in the observation?</p>",
        "id": 195018722,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587617592
    },
    {
        "content": "<p>Extensions can't change the meaning of the element.  The element is clearly the device that was used in performing the measurement.   An extension can't allow it to contain something else.</p>",
        "id": 195019976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587619802
    },
    {
        "content": "<p>or if you for some reason you choose not to use terminology you could represent it as a form with a bunch of yes/no questions and then create an Observation panel.</p>",
        "id": 195090041,
        "sender_full_name": "Eric Haas",
        "timestamp": 1587661007
    }
]