[
    {
        "content": "<p>We have several patient attributes that could be considered observations, but which are recorded in the legacy system as as part of the patient file. They are administrative, not clinical, though they are related to clinical data (e.g., Was the veteran patient judged to have seen combat?).</p>\n<p>In the interest of interoperability, we could expose these attributes as observations; however, they would not have ids. It would be easier to create extensions. What other criteria should we apply to this decision?</p>",
        "id": 201188537,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1592421813
    },
    {
        "content": "<p>Would they need to be searchable?</p>",
        "id": 201188691,
        "sender_full_name": "Jim Steel",
        "timestamp": 1592421899
    },
    {
        "content": "<p>You would get some search functions \"for free\" if they were in Observations that might be more intuitive than if they were in extensions?</p>",
        "id": 201188737,
        "sender_full_name": "Jim Steel",
        "timestamp": 1592421938
    },
    {
        "content": "<p>How would they be used?  Could different authors have different opinions on the answer?</p>",
        "id": 201188738,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592421939
    },
    {
        "content": "<p>Searchable: Not this iteration.</p>",
        "id": 201188820,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1592421973
    },
    {
        "content": "<p>Differing opinions: no.</p>",
        "id": 201188842,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1592421987
    },
    {
        "content": "<p>This iteration: for pharmacists to view patient record when processing med orders.</p>",
        "id": 201188918,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1592422041
    },
    {
        "content": "<p>Seems like this is closer to marital status than blood type, so I'd probably go with extensions on Patient</p>",
        "id": 201192425,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592423928
    },
    {
        "content": "<p>This one sounded familiar to me for some reason, so I went and found what I was thinking of:  <a href=\"http://hl7.org/fhir/us/odh/StructureDefinition-odh-CombatZonePeriod.html\">http://hl7.org/fhir/us/odh/StructureDefinition-odh-CombatZonePeriod.html</a><br>\nThey use Observation for that, but I guess its a little different than your use case.</p>",
        "id": 201257151,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592481149
    },
    {
        "content": "<p>The ODH structure is independent of Patient; to use extension they'd have had to make some fundamental changes, maybe limiting its appeal. Most of the signs seem to point to extension. Thanks.</p>",
        "id": 201257530,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1592481409
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> , we've leveraged the ODH approach to  create extensions similar to HL7 V2 Z-segment for Employment Service History and Status ()https://confluence.hl7.org/display/CGP/Military+Service+History+and+Status+FHIR+Profiles+Project+Page). We reused one ODH profile  as a base profile and  created a base/constrainable profile for <strong>Employment History Episode</strong> that leveraged the ODH pattern  for <strong>PastOrPresentJob</strong> (i.e. Observation with coded components for extensibility). The approach worked for <strong>Military Service</strong> and we hope to apply it to <strong>Disability</strong> and other VA APIs that use custom REST APIs.  Please joine <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> , <span class=\"user-mention\" data-user-id=\"192418\">@Sean Muir</span> , Genny,  Lori, and I   on the weekly project call on Tuesdays at 11 am EST (<a href=\"https://zoom.us/j/98656497049\">https://zoom.us/j/98656497049</a> ) if you have any questions or add your comments to the Confluence page.<br>\n<a href=\"/user_uploads/10155/Uk1qwLvKRsw-4mKAA6OyHeZw/Military-Service-History-and-Status-Profiles-0.2.docx\">Military-Service-History-and-Status-Profiles-0.2.docx</a></p>",
        "id": 201287019,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1592495396
    },
    {
        "content": "<p>Hello everyone, I have got a question about observations and extensions:<br>\nHow to decide whether to use an observation or an extension for a specific value? <br>\nFor example, you measure your sleep, and within your main sleep you also measure different sleep stages like light sleep, deep sleep and so on. But in addition to that I also would like to measure or at least give a value for the total main sleep efficiency. So would it be better to use a main sleep observation with an \"efficiency\" extension or should I use separate observations for all values that would be measured during the main sleep?</p>",
        "id": 201701798,
        "sender_full_name": "Armin Griebler",
        "timestamp": 1592902457
    },
    {
        "content": "<p>An observation has 'components', it looks like you could use one single Observation resource and express the various values/aspects as component values.</p>",
        "id": 201703193,
        "sender_full_name": "René Spronk",
        "timestamp": 1592903341
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191372\">René Spronk</span> <a href=\"#narrow/stream/179166-implementers/topic/Observation.20or.20extension/near/201703193\">said</a>:</p>\n<blockquote>\n<p>An observation has 'components', it looks like you could use one single Observation resource and express the various values/aspects as component values.</p>\n</blockquote>\n<p>Thank you for your answer! A component requires the usage of a codable concept. What if there is for example no Loinc or Snomed Code for the particular value? Then, do I have to use an extension?</p>",
        "id": 201706604,
        "sender_full_name": "Armin Griebler",
        "timestamp": 1592905844
    },
    {
        "content": "<p>No. You just use a code from a different coding system (if that's allowed by whatever implementation guide(s), if any, that you're trying to adhere to).  If you're not using an implementation guide you can use any coding system you want, even if it's your own coding system.</p>",
        "id": 201706884,
        "sender_full_name": "René Spronk",
        "timestamp": 1592906073
    },
    {
        "content": "<p>If you're capturing information about something observed or qualifying something observed, it'll be either an Observation.value or an Observation.component.value if it doesn't obviously fit in one of the existing Observation elements (e.g. method).  Extensions on Observation would be for other purposes (e.g. data enterer, relationship to research study, etc.)</p>",
        "id": 201734117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592922962
    },
    {
        "content": "<p>Side note...just because there isn't (yet) a code for the measurement concept in a standard terminology like LOINC doesn't mean there shouldn't be. Terminologies extend their coverage based on user requests. If this is a measurement from a wearable sensor, for example, I'd recommend making a submission for new concepts to LOINC: <a href=\"https://loinc.org/submissions/\">https://loinc.org/submissions/</a></p>",
        "id": 201804407,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1592962935
    },
    {
        "content": "<p>FYI, we went with Observation to align with ODH. It's semantically a little different but close enough that leverage seemed like the best path.</p>",
        "id": 206316209,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1596839154
    }
]