[
    {
        "content": "<p>Looking at <a href=\"https://build.fhir.org/observation.html#invs\">Observation obs-6</a>, I notice that the invariant doesn't touch on cover component.value[x] or hasMember, nor does it matter what the status of the observation is (and thus, a registered or entered-in-error Observation must have a value or have a DAR). What is the logic for why these were left out?</p>\n<p>I recall talk of an extension that could be used to convey an attachment as an Observation \"value\". I can't locate the extension in R4 right now, but how does that work with the above invariant logic? Is the extension on Observation or on an Observation.value[x] (and if so, which type)?</p>",
        "id": 273278716,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1645819805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span></p>",
        "id": 273282451,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645821682
    },
    {
        "content": "<p>use the R5 or R3 valueAttachment element as an extension on Observation</p>",
        "id": 273508675,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646063136
    },
    {
        "content": "<blockquote>\n<p>What is the logic for why these were left out?</p>\n</blockquote>\n<p>made it simple as possible.    Note  only constrains when the DAR elelment can be used.    Little value in trying to anticipate a bunch of edge cases here.</p>",
        "id": 273510094,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646063634
    },
    {
        "content": "<p>Actually, with invariants, you need to anticipate <em>all</em> edge cases.  However, in this case, I don't think status needs to be taken into account.  The invariant as written <em>would</em> allow a DAR on a blood pressure with component systolic and diastolics.  It would also allow a DAR on a blood panel.  However, I think having a DAR when you have components is still legit.  For example, you might indicate that you don't have a result of a susceptibility test to drug X.  It <em>might</em> be reasonable to have a parent with members with a DAR, though it would be good to know what the use-case for that is.</p>",
        "id": 273512507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646064440
    },
    {
        "content": "<p>So the invariant basically says \"you can't have a DAR if you have a value\" rather than \"if you don't have a value, you need a DAR\"? OK.</p>",
        "id": 273513001,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646064623
    },
    {
        "content": "<p>Hi everyone. i like to implement kind of patient's diary. did you guys have any suggestions to me which resources the best to handle this usecase?<br>\ni found this article <a href=\"http://community.fhir.org/t/what-is-the-best-resource-to-represent-a-patients-diary-or-note/215/2\">http://community.fhir.org/t/what-is-the-best-resource-to-represent-a-patients-diary-or-note/215/2</a> <br>\nbut still not clear if it still the right choise.  it wroten in 2016.</p>\n<p>thank you for any advice.</p>",
        "id": 275488426,
        "sender_full_name": "Giantape",
        "timestamp": 1647424745
    },
    {
        "content": "<p>Observation would probably be the best way to capture individual entries.  If you're capturing specific discrete data each day, you could also group them with a parent Observation and hasMember.</p>",
        "id": 275513656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647439124
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - I'd like to profile the Observation resource, where having an invariant that requires the subject.identifier and/or specimen.identifier is present. Is this possible? where I could read more about developing this invariant, if this is possible? I checked <a href=\"https://hl7.org/fhir/uv/shorthand/reference.html\">https://hl7.org/fhir/uv/shorthand/reference.html</a>, is there additional documentation? Thanks</p>",
        "id": 278710580,
        "sender_full_name": "Aly Khalifa",
        "timestamp": 1649777786
    },
    {
        "content": "<p>Invariants are expressed using <a href=\"http://hl7.org/fhirpath\">FHIRPath</a>.  In this case, it would simply be <code>subject.identifier.exists() or specimen.identifier.exists()</code><br>\nNote that this invariant wouldn't be satisfied if you had subject.reference or specimen.reference instead of identifier - and having reference is both more common and preferred than having .identifier, so make sure that's the constraint you really want.</p>",
        "id": 278716477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649780440
    }
]