[
    {
        "content": "<p>we are trying to depict the result of a dilution series in an observation.</p>\n<p>in an rubella hemagglutination inhibition test (HHT) the blood serum is diluted in an specific process/steps i.e (1:8, 1:16, 1:32, 1:64 etc.). Process and display of the steps should be equal international. These steps are represented as mathematical fractions. We would like to express the result of this process in an observation. The result is an mathematical fraction too and therefore it is handeld as a valueRatio in an observation. Up to this point we have no problems, but we couldn't represent the referenceRange (low/high) in the same manner, since simpleQuantity is allowed only. So we couldn't use the same type as we used in the valueelement (ratio). </p>\n<p>Is the way of using an observation not correct or what is the way of doing this?  Is the spec not applicable at this point? </p>\n<p>Our doctors are telling us: Quantities are not sufficient, since the way of displaying the referenceRange is not okay. </p>\n<p>in general: wouldn't it be useful to have all datatypes of the value[x] section as referenceRange options?</p>\n<p>regards Max</p>",
        "id": 207399716,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597839392
    },
    {
        "content": "<p><strong>in general: wouldn't it be useful to have all datatypes of the value[x] section as referenceRange options?</strong></p>\n<p>use text</p>",
        "id": 207444155,
        "sender_full_name": "Eric Haas",
        "timestamp": 1597861723
    },
    {
        "content": "<p>text is for textual describtions ( <a href=\"https://www.hl7.org/fhir/observation-definitions.html#Observation.referenceRange.text\">https://www.hl7.org/fhir/observation-definitions.html#Observation.referenceRange.text</a> -&gt; An example would be a reference value of \"Negative\" or a list or table of \"normals\".), but we have a mathematical term, which we would like to use as it is (ratio)...</p>",
        "id": 207490193,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597901571
    },
    {
        "content": "<p>text is useful default when the reference range cannot be expressed using the structured form.  otherwise you are stuck using extensions.  I think text is easier.</p>",
        "id": 207543777,
        "sender_full_name": "Eric Haas",
        "timestamp": 1597941233
    }
]