[
    {
        "content": "<p>Dear FHIR Community,</p>\n<p>we have a FHIR Viewer in our portfolio that supports displaying an overview of all Observations of a patient in a timeline/table view. This viewer displays the result of a query to the FHIR Observation resource filtered by the patient.</p>\n<p>Now our users would be able to see Observations grouped by the corresponding DiagnosticReports, those Observations belong to and optionally be able to jump to the full DiagnosticReport. The most efficient way to support this would be having optional References to the DiagnosticReport in the Observation resource, but this does not seem to be supported by the standard right now. The only way to accomplish this in a FHIR conformant way right now would be to get all DiagnosticReports in their entirety for the Observations/Patient and map the links to the Observations by parsing all of them. This is inefficient, because same patients have lots of relatively large DiagnosticReports containing more than 10k Observations with rather big narratives.</p>\n<p>That grouping Observations by the DiagnosticReport they are part of, is an important use case is already apparent in the current documentation of the Observation resource:</p>\n<blockquote>\n<p>Many observations have important relationships to other observations and need to be grouped together. These structures have been defined to do this: DiagnosticReport and DiagnosticReport.result</p>\n</blockquote>\n<p><a href=\"https://www.hl7.org/fhir/observation.html#obsgrouping\">https://www.hl7.org/fhir/observation.html#obsgrouping</a></p>\n<p>So would it be possible to extend the Observation resource to allow either an optional Diagnostic Report reference in the partOf field or a new diagnosticReport field containing this optional reference?</p>\n<p>Thanks in advance,<br>\nMichael</p>",
        "id": 209496428,
        "sender_full_name": "Michael Doppler",
        "timestamp": 1599649173
    },
    {
        "content": "<p>You can get the DiagnosticReports related to the Observations using a reverse include: <code>[base]/Observation? . . . &amp;_revinclude=DiagnosticReport:result</code> (if the server supports it)</p>",
        "id": 209504269,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1599654890
    },
    {
        "content": "<p>Having references in both direction is not done in general, makes updating resources hard</p>",
        "id": 209504302,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1599654920
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>: thank you for pointing to the <code>_revinclude</code> parameter. On the server side this is hard to implement with good performance when processing a large number of Observations.  An optional DiagnosticReport reference in the Observation resource would mitigate this problem.</p>",
        "id": 209520820,
        "sender_full_name": "Michael Doppler",
        "timestamp": 1599662754
    },
    {
        "content": "<p>In FHIR, we try hard to ensure that references exist in only one direction - otherwise we run into transactional issues when updating resources (you'd need to update both the source and target resource simultaneously to keep things consistent).  The performance shouldn't be any different using _include with a forward reference or _revinclude with a reverse reference.</p>",
        "id": 209526570,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599664929
    }
]