[
    {
        "content": "<p>For obstetric observations, such as lactation status, pregnancy status, and organ inventory (organ inventory I guess is broader than OB...), what Observation.category would folks consider the best fit?  Would any of the values in the <a href=\"https://www.hl7.org/fhir/codesystem-observation-category.html\">preferred valueset</a> work, or would a separate code be better?  </p>\n<p>Options that stood out to me include:</p>\n<ul>\n<li>exam - however the description says this is for physical exams by clinicians on the patient's body.  And the OB info is often just patient reported via question/answer.</li>\n<li>survey - this seems the most obvious to me, but I understand that survey has a more specific meaning than what is communicated in the current description of that code</li>\n</ul>\n<p>QuestionnaireResponse I suppose could be an option, but even though this info is provided via question/response interaction with the patient, Observation feels better to me.</p>",
        "id": 206064780,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1596654273
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> for the category question.</p>\n<p>QuestionnaireResponse isn't queriable by the data within the response, so your instinct to use Observation is a good one.  (Though you might do raw data capture using a QuestionnaireResponse before propagating it to Observations.)</p>",
        "id": 206086342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596666946
    },
    {
        "content": "<p>Looks like this is related to <a href=\"http://jira.hl7.org/browse/FHIR-14677\">FHIR#14677</a>.</p>",
        "id": 206611477,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1597170068
    },
    {
        "content": "<p>I'm confused by the first bit of the resolution though:  <br>\n1) Move Pregnancy status to \"social-history\" line item in introduction</p>\n<p>Is that a typo?  Is that intended to mean 'remove pregnancy status from \"social history\" line item in introduction'?</p>",
        "id": 206611960,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1597170310
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  RE <a href=\"http://jira.hl7.org/browse/FHIR-14677\">FHIR#14677</a>: this is a proposal that went nowhere.  The category codes are a minefield.   I have moved on since I don't have the time or patience to hash it out. But you are welcome to it.</p>",
        "id": 206654543,
        "sender_full_name": "Eric Haas",
        "timestamp": 1597199799
    }
]