[
    {
        "content": "<p>Hi,</p>\n<p>First time I have posted on this group.  But I have been around interoperability for over 15 years now and I am the lead on FHIR for CSC (soon to become DXC Technology when it merges with HPE at the end of the month).  I am also on the curation team for InterOpen.</p>\n<p>Today I need to take opinion and advice from the community on a challenge we have for implementation of FHIR for Lorenzo.</p>\n<p>How are systems of record dealing with references to observations where the observation utilisation is different?</p>\n<p>What I mean is the following challenge in diagnosticReport that references out to an observation to represent a result item.  The result items are represented in a different database table to pure observations such as a blood pressure.  How do we differentiate between them in an observation?  Is it with the Observation.Category attribute or something else?</p>\n<p>Then when we make a reference to an observation for example, in a Diagnostic report how is that reference constructed?  </p>\n<p>..\\observation\\123456</p>\n<p>Can we qualify a reference further with say category and have it paramitised such that the reference is:</p>\n<p>..\\observation\\id='123456'&amp;category='laboratory'</p>\n<p>(not sure we can even do this, as all references seem to be an ID)</p>\n<p>We need to do this so we can differentiate what table in Lorenzo to go to because of the different utilisation of the observation resource.  In this case to represent a result item and a standard observation.</p>\n<p>Or do we have to respect the reference structure of referencing out to a single resource with a unique ID?  We do a concatenation of id+category.  Such that:</p>\n<p>..\\observation\\123456laboratory</p>\n<p>Or is there another technique or new idea from this forum that can be used?</p>\n<p>Does this make any sense?  Looking forward to your feed back and pearls of wisdom.</p>",
        "id": 153875508,
        "sender_full_name": "Will Jones",
        "timestamp": 1488973442
    },
    {
        "content": "<p>So your issue is that observations don't have unique identifiers across tables?</p>",
        "id": 153875542,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488990288
    },
    {
        "content": "<p>Concatenation would be the typical approach - though I'd probably put the prefix at the start for efficiency reasons.  E.g. Observation/lab123456 vs Observation/vit123456</p>",
        "id": 153875543,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488990350
    },
    {
        "content": "<p>the id is opaque, but must be maintained correctly. in many cases, the id is a composite key - your's would be a classic case; Observation/1-2345 where '1' refers to which table.</p>",
        "id": 153875668,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489030861
    }
]