[
    {
        "content": "<p>In trying to suss out the relationship between a DiagnosticReport and Observations, it's clear the DiagnosticReport will have 0 or more Observations associated with it.  The Observation data model makes no specific reference back to a specific DiagnosticReport, so what I can't be sure about is whether or not it is expected that an Observation may be included in _multiple_ DiagnosticReports, or if the set of Observations for any given DiagnosticReport is a completely separate set (even if the dates, et al, are the same)?</p>\n<p>In the JSON schema, I noticed this bit under \"Observation\":</p>\n<div class=\"codehilite\"><pre><span></span>        &quot;contained&quot;: {\n          &quot;description&quot;: &quot;These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.&quot;,\n          &quot;items&quot;: {\n            &quot;$ref&quot;: &quot;#/definitions/ResourceList&quot;\n          },\n</pre></div>\n\n\n<p>...which implies that Observations included under a DiagnosticReport are, in fact, unique elements of that report and should only be referenced \"through\" the report -- but in the HTML documentation, there's a reference to the \"last n Observations query\" (<a href=\"https://www.hl7.org/fhir/observation-operation-lastn.html\" title=\"https://www.hl7.org/fhir/observation-operation-lastn.html\">https://www.hl7.org/fhir/observation-operation-lastn.html</a>) which makes apparent that these records _can_ be referenced \"independently\".</p>\n<p>Can an Observation be referenced by multiple different DiagnosticReports or does each belong to only one report?</p>",
        "id": 195019929,
        "sender_full_name": "...Paul",
        "timestamp": 1587619718
    },
    {
        "content": "<p>you're right to be unsure. THe specification does not prohibit a given observation being referenced from more than one report. That's deliberate. In general, though, it would be unusual for a source system to do that - typically, the diagnostic report owns the observations - they are part of it's life cycle. Though you might get more than one version of the same diagnostic report referencing the same observation, if it doesn't change</p>",
        "id": 195020012,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587619901
    },
    {
        "content": "<p>There are no rules prohibiting the same Observation from being referenced in multiple DiagnosticReports, though that would not be common.</p>\n<p>The 'contained' element is only used for resources that cannot stand independently and are generally not accessed independently.  The intention with a DiagnosticReport is that all of the referenced Observations exist as independent instances, not sent as 'contained' resources.</p>",
        "id": 195020057,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587619932
    },
    {
        "content": "<p>Cool, cool.  Would it be expected, though, that an Observation referenced in a DiagnosticReport would, though, be also referenced by the other types, such as \"Appointment\", \"ServiceRequest\", etc?</p>",
        "id": 195020133,
        "sender_full_name": "...Paul",
        "timestamp": 1587620047
    },
    {
        "content": "<p>couild be - specially as evidence for sometihng</p>",
        "id": 195020139,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587620077
    },
    {
        "content": "<p>Excellent, thanks for the advice, guys!</p>",
        "id": 195020145,
        "sender_full_name": "...Paul",
        "timestamp": 1587620102
    }
]