[
    {
        "content": "<p>First, the OO group's new guidance on code-value pairing is excellent. I don't know when that was added but it is very helpful to see that laid out, I've profiled 40 or 50 observations and I will likely add exactly which pattern each of them is to the SD. Thanks! </p>\n<p>Regarding the change to Observation.related, I have a use case in which I made heavy use of the 'replaces' related-type, but I believe it may be easier to accomplish with observation.status. The explanation of it doesn't quite answer all my questions. The situation is a sequence of the same observation from a series of procedures meant to confirm N Category of a cancer. (X is any of 5/6 procedures). I would like to know what the status is of each of these four observations. It may be that they are all 'final', but I am hoping that the first three are either preliminary (or amended?), I would just like confirmation.</p>\n<p>N1 at diagnosis (preliminary) -&gt; X | N2 (status: preliminary) -&gt; X | N3(status: preliminary) -&gt; X | confirmed N3( status: final)  </p>\n<p>Is this correct? Or are those all technically final observations? I use the 'replaces' field to differentiate the next three, replaced by may also worked.</p>",
        "id": 153918520,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1510246894
    },
    {
        "content": "<p>that is typo  should be 'replaces'</p>",
        "id": 153918523,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510247408
    },
    {
        "content": "<p>By typo you mean 'replacedBy' is actually going to be 'replaces'?<br>\nAny guidance on status for this example? <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  or <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 153918524,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1510247750
    },
    {
        "content": "<p>The statuses would be about a single observation's state over time.  The 'replaces' would a way to trace within observation other observations that the current one over-rides.   I am concerned that we are overloading observation if this is the primary way to monitor a progression of a lesion, etc.  There may be some overarching resource that provides a better way to follow a case over time.?  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 153918526,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510247927
    },
    {
        "content": "<p>I would love further explanation of those statuses with examples. I'm not quite sure I understand preliminary vs amended vs final. When does one set an observation's status to amended vs preliminary. Are all observations that require further confirmation set to preliminary?</p>",
        "id": 153918529,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1510248224
    },
    {
        "content": "<p>In FHIR, a single Observation instance (same 'id') may be updated many times over its lifespan as it evolves towards completion.  You would never use \"replaces\" to link two versions of a single Observation instance.  That linkage is implicit in that both are versions of the same instance (and have a timestamp that says when each version was created).  The idea of \"replaces\" would be for something like \"we had a baseline for Observations of type x, but that baseline is now replaced with this new Observation instance\".  So both Observations would typically have a status of completed and they'd have different \"id\" values (and different identifier values).  You're establishing that one Observation result should now be used in preference for the other.</p>",
        "id": 153918533,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510248515
    },
    {
        "content": "<p>Setting the status to \"preliminary\" for results that require confirmation would certainly be typical - but there's one thing we've learned is that \"typical\" does not mean \"always\"...</p>",
        "id": 153918535,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510248574
    },
    {
        "content": "<p>Excellent, thank you. I'm going to have these observations set to preliminary and communicate that in the implementation guide.</p>",
        "id": 153918554,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1510252649
    }
]