[
    {
        "content": "<p>This is almost too late, but I figured I'd raise it.  Right now the workflow pattern for Observation.context is 0..1 Encounter|EpisodeOfCare.  That's always made me slightly uncomfortable.  The notion of 0..1 Encounter is fine.  A given Observation should be \"owned\" by no more than one Encounter.  However, it's possible a single Observation could be relevant to multiple episodes.  I.e. It could be tied to your pregnancy and also to your hypertension management.  (And of course also to your encounter.)  Would we be better splitting \".context\" into \".encounter 0..1 Encounter\" and \".episode 0..* EpisodeOfCare\"?</p>",
        "id": 153984405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533841317
    },
    {
        "content": "<p>This is our last chance to do this for Observation.</p>",
        "id": 153984406,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533841328
    },
    {
        "content": "<p>We'd presumably make the same change everywhere else .context currently appears, but that wouldn't have to happen before ballot.</p>",
        "id": 153984407,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533841358
    },
    {
        "content": "<p>it does sound like an extension thing to me</p>",
        "id": 153984409,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533841430
    },
    {
        "content": "<p>Lloyd is exactly right about this from a healthcare systems theory (for lack of a better term that comes to mind at the moment) perspective.   A single observation certainly can and should be able to reference multiple \"episodes of care\", but logically only one encounter.  If there are systems that actually implement the notion of \"episode of care\" as it was intended they would have this requirement.  What I'm not as certain of is exactly how well or thoroughly most systems are implementing this.  In principle I think that having encounter 0..1 and episode 0..* would be better.  If you just add an extension then you still have .context and I expect there would be both some redundancy and lack of clarity in regard to using it (or suggesting to not use it) along with the extension.</p>",
        "id": 153984416,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1533842157
    },
    {
        "content": "<p>The trick is that both Encounter and EpisodeOfCare have been deemed to be core.  Supporting additional Episodes as extensions is somewhat messy.  My guess is that we'll probably change the pattern to what I've described for all the other resources.  The question is what whether we want (and can) do that for Observation too.</p>",
        "id": 153984419,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533842710
    },
    {
        "content": "<p>I agree with Lloyd conceptually.  <br>\n but I am not sure how we do this process wise.. Our OO meetig was 2 + hrs ago.</p>",
        "id": 153984476,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533846419
    },
    {
        "content": "<p>what about an encounter sans Episode of Care and and extension for Episodes?</p>",
        "id": 153984478,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533846611
    },
    {
        "content": "<p>I was actually about to propose the same.  Rename Observation.context to Observation.encounter, type it as 0..1 Encounter and define an extension applicable to Observation (and eventually all requests and events) for a 0..* link to EpisodeOfCare.  That probably accurately reflects current support.</p>",
        "id": 153984493,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533847801
    },
    {
        "content": "<p>Process-wise, I could submit a change request that could be pre-applied before ballot.  In theory if someone negative balloted and forced things back to the way they were, that would prevent us from passing Observation as normative.  However, given that we're actually expanding capability rather than diminishing it and given that I don't think anyone's actually using EpisodeOfCare yet, I think the chances of that happening are super-slim.</p>",
        "id": 153984494,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533847910
    },
    {
        "content": "<p>Would be best to at least ensure the majority of the OO co-chairs are onside with the change.</p>",
        "id": 153984495,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533847936
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?  <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> ?  <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> ? <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span> ?   ( will need to email the rest)</p>",
        "id": 153984498,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533848106
    },
    {
        "content": "<p>That seems workable to me.</p>",
        "id": 153984521,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1533851531
    },
    {
        "content": "<p>Is there an implication on the search parameters also?<br>\n(p.s. I like the idea of splitting the encounter/episode refs on obs and the suggested cardinalities also)</p>",
        "id": 153984606,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1533867551
    },
    {
        "content": "<p>Yes.  We'd have to split the search parameters too.</p>",
        "id": 153984608,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533867758
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  did you log a Tracker?</p>",
        "id": 153985129,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533945352
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17661\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17661\">GF#17661</a></p>",
        "id": 153985163,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533954084
    },
    {
        "content": "<p>Looks like the search parameters were never addressed as a part of the making this an extension <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span></p>",
        "id": 249162157,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1628712230
    }
]