[
    {
        "content": "<p>I'm looking into profiling emergency triage (more specifically a triage conducted in the ambulance) and so far I've looked towards a profile on Observation. I had a quick dive into SOAP notes trying to understand the 'A' which should be reflected in ClinicalImpression. The question is if an emergency triage is best modelled using ClinicalImpression or Observation. Any clinical/technical advice is much appreciated</p>",
        "id": 154025356,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1544709942
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 154025362,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1544713310
    },
    {
        "content": "<p>SOAP is still a matter of some debate.  <span class=\"user-mention\" data-user-id=\"191360\">@Michelle M Miller</span> ?</p>",
        "id": 154025368,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544713808
    },
    {
        "content": "<p>What exactly are you going to model regarding the emergency triage? From my understanding the resulting triage level can best be modeled as an Observation. We are currently evaluating using Questionnaire for the triage assessment as a basis for generating the triage level.</p>",
        "id": 154025372,
        "sender_full_name": "Johannes Faber",
        "timestamp": 1544714941
    },
    {
        "content": "<p>Yes ... the questionnaire was also in my mind</p>",
        "id": 154025373,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1544715047
    },
    {
        "content": "<p>in terms of questionnaire it would be the questionnaireresponse that would be in focus</p>",
        "id": 154025374,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1544715098
    },
    {
        "content": "<p>QuestionnaireResponse is a useful way of doing data capture, but for data analysis, you'll want to move the data into Observations, MedicationStatements, AllergyIntolerance, etc.</p>",
        "id": 154025377,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544715393
    },
    {
        "content": "<p>Our current idea is to use questionnaire to model the possible choices of a triage system, e.g., the manchester triage system. <br>\nUsing questionnaireresponse we'll then store the choices of a triage nurse during an assessment, whereas the resulting triage level will be stored as observation.</p>\n<p>I'm not sure though that questionnaire is actually suited to model the major aspects of a system like manchester triage (MTS), because MTS also defines certain clinical checks based on vital signs. For instance, such a check can be something like 'if the temperature of a patient is higher than 41 centigrade, then suggest the triage nurse to select Temperature Very High in the questionnaire'. This certainly can be added as an extension to the questionnaire, but I'm not sure if this is overstretching the questionnaire too much. I'd be very interested if anyone has better ideas how to realize something like that.</p>",
        "id": 154025380,
        "sender_full_name": "Johannes Faber",
        "timestamp": 1544716807
    },
    {
        "content": "<p>Thats sort of the same for my case. We're up against modelling DEPT which is sort of like ADAPT, which in turn is sort of like CTAS and ATS (<a href=\"https://sjtrem.biomedcentral.com/articles/10.1186/s13049-016-0312-6\" target=\"_blank\" title=\"https://sjtrem.biomedcentral.com/articles/10.1186/s13049-016-0312-6\">https://sjtrem.biomedcentral.com/articles/10.1186/s13049-016-0312-6</a>) - but basically <span class=\"user-mention\" data-user-id=\"197446\">@Johannes Faber</span>  it sounds like we are sort of stuck with the same problem. Interesting though that you actually plan to use the QuestionnaireResponse for capturing the all the choices made by the clinician.</p>",
        "id": 154025481,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1544737827
    }
]