[
    {
        "content": "<p>Hi All,</p>\n<p>I'm currently working on drafting a Observation profile to capture few details on  tobacco comsumptions by a Patient. As per our requirement, we have to capture the status (e.g.: \"Former smoker\") and few additional details like \"Cigarettes per day\" and \"Smoking - Quit date\" as applicable. I looked at the IPS profile and planning to model the status using 'Observation.valueCodeableConcept' However I'm unsure about modelling the other associated details (\"Cigarettes per day\" and \"Smoking - Quit date\")<br>\n Looking at the FHIR guideline at section <a href=\"http://hl7.org/fhir/observation.html#gr-comp\" target=\"_blank\" title=\"http://hl7.org/fhir/observation.html#gr-comp\">http://hl7.org/fhir/observation.html#gr-comp</a> point 3: \"reporting the types of alcohol consumed by a patient\", I was thinking of modelling it as \"Observation.component\". However, further reading, I can see Observation.hasMember is another option. May I request the group to provide me some guidance on what's the better option (Observation.component vs Observation.hasMember) in this context.</p>",
        "id": 169532326,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1562116576
    },
    {
        "content": "<p>If the information makes sense and is useful by itself, then it should be a separate Observation (possibly linked by 'hasMember').  If it qualifies another Observation or doesn't make sense based on common medical convention to ever interpret separately from another Observation, then component is appropriate.  Examples of component would be the pieces of an APGAR or diastolic, systolic and cuff size values for blood pressure.  On the other hand, the parts of a complete blood count would be handled using hasMember to distinct observations.</p>",
        "id": 169533422,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562118651
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193760\">@Shovan Roy</span> were you looking up the smoking status or are you deciding how to design FHIR representation of data in your system?  Any chance you can share what you ended up doing?  I am asking to learn more about this representation because it seems like the implementation of smoking status is quite different across vendors.</p>",
        "id": 189744619,
        "sender_full_name": "Farhan Ahmad",
        "timestamp": 1583362358
    },
    {
        "content": "<p>If you haven't seen it, the Common Clinical Registry Framework ballot from Sept 2019 contains data elements, questions and value sets regarding tobacco/nicotine usage. They are hoping to get this included as part of US Core or some other FHIR work. </p>\n<p><a href=\"https://confluence.hl7.org/display/CIC/Common+Clinical+Registry+Framework%3A+Common+Data+Elements+%28CDEs%29+for+Registries+Interoperability\" target=\"_blank\" title=\"https://confluence.hl7.org/display/CIC/Common+Clinical+Registry+Framework%3A+Common+Data+Elements+%28CDEs%29+for+Registries+Interoperability\">https://confluence.hl7.org/display/CIC/Common+Clinical+Registry+Framework%3A+Common+Data+Elements+%28CDEs%29+for+Registries+Interoperability</a></p>",
        "id": 189789443,
        "sender_full_name": "Craig Newman",
        "timestamp": 1583414233
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194231\">@Farhan Ahmad</span> extremely sorry I missed your message.. It's kind of what is required in our stream.. you can have a look at let me know if you need any further information.. <a href=\"http://build.fhir.org/ig/hl7au/au-fhir-childhealth/StructureDefinition-ncdhc-observation-bi-tobacco-usage.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/hl7au/au-fhir-childhealth/StructureDefinition-ncdhc-observation-bi-tobacco-usage.html\">http://build.fhir.org/ig/hl7au/au-fhir-childhealth/StructureDefinition-ncdhc-observation-bi-tobacco-usage.html</a></p>",
        "id": 191385540,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1584863940
    }
]