[
    {
        "content": "<p>I'm sure this conversation has occurred but I can't find it.</p>\n<p>If one wishes to express persistent facts about a patient (e.g., whether the patient has a service-related disability), one could<br>\na) create extensions<br>\nb) add observations<br>\nc) add a list of questions in a questionnaire</p>\n<p>We have dozens of these, and they tend not to be structured or interrelated (explicitly), so observation seems a little heavy, as do extensions. Adding a questionnaire would require an extension, too, but it would only be one. Though questionnaire instance design would complicate the constraint.</p>\n<p>How are other implementers addressing these questions?</p>",
        "id": 158885328,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1550586589
    },
    {
        "content": "<p>This seems clearly an Observation. Why do you think Observation is \"heavy\"? It is one of the smallest resources</p>",
        "id": 158886420,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550587344
    },
    {
        "content": "<p>Observation allows you to capture who mande the statement, when it was made and possibly the basis for making the assertion.  So it's best for anything that is either clinical or transient.  Patient is really about demographics - if it's not a demographic characteristic, it shouldn't be on the Patient resource.  Questionnaire is a data capture tool - you can use it to capture anything.  But it doesn't give you data that's understandable across systems that don't share that specific questionnaire version, nor does it let you query based on the data.</p>",
        "id": 158888678,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550588870
    },
    {
        "content": "<p>Something else that's a possibility would be an extension on Encounter if it's an element that primarily drives encounter-specific behavior</p>",
        "id": 158888843,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550588977
    },
    {
        "content": "<p>John, any time it's complex (includes dates, methods, etc.), Observation seems right. And perhaps it's right for the simple cases, too (e.g., whether the patient has a service-related disability, with no context or metadata). Status is the only thing we'd absolutely have to impute or not support. Thanks.</p>\n<p>Lloyd, this is sort of clinical, and it's used as a patient characteristic: does that mean it's 'demographic' or not? I'm considering an Observation for the element, baked into a VA Patient profile. There would be many such Observation profile components.</p>\n<p>Also, you suggest an extension on Encounter rather than an observation -  is there some implicit facet that's different there?</p>",
        "id": 158933603,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1550622715
    },
    {
        "content": "<p>Service-related disability sounds like something that isn't encounter-specific.  (Something like \"valuables location\" would be encounter-specific.)  Service-related disability seems like it might be coverage-related, but could potentially be categorized as demographic if the primary use is filtering and finding patients.</p>",
        "id": 158934932,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550624219
    },
    {
        "content": "<p>Most of what I'm looking at is not encounter-specific. I'm chewing on when it's appropriate to use Observation rather than Patient extension.  Service-related disability, Unemployable &amp; Purple Heart status all have tenuous links to clinical process, but I'm comfortable calling them \"personal characteristics\" per Observation Scope &amp; Usage. But Rx cap type? Rx mail preference? Are there heuristics for this sort of thing?</p>",
        "id": 159118973,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1550796536
    },
    {
        "content": "<p>so you identify the patient using them? If so... patient extension. If not... observatin</p>",
        "id": 159120570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550798492
    },
    {
        "content": "<p>There's a criterion. \"Identify\": meaning, use in a query?</p>",
        "id": 159122565,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1550801026
    },
    {
        "content": "<p>Feels like observation to me, just as other social status things go - e.g. smoking status.</p>",
        "id": 162476838,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1554331559
    }
]