[
    {
        "content": "<p>I'm starting development of Digital Child Health solution. This initially involves gathering data from maternity services, then moving onto other care setting such as General Practice for data such as immunisations. The solution will use FHIR resource profiles to transfer/post the data to a central repository, The central repository (over time) will be used for a variety of purposes from tracking individual children through the health care system - to answer questions such as \"Which children have not presented for a MMR immunisation jab\", as well as population questions - for example \"are  those children who had a birth weight of less than 2 kg more likely to use Emergency Departments for [a range of illnesses]\". <br>\nMy question is around the resources I should be using to post the data from maternity services to a central FHIR server. For example, we are interested in Birth Weight, Gestation Length, Apgar Score, Complications at Birth. I could use a series of Observations, or a I could use a single QuestionnaireResponse resource, as the data lends itself to code/value pairs.<br>\nWhat are the implications for querying the data from the FHIR server for both options? Is there any guidance I could use to guide me? Are there any advantages to each approach? (it seems simpler to use the QuestionnaireResponse, but doesn't quite \"feel\" right)</p>",
        "id": 153855987,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1478620113
    },
    {
        "content": "<p>In general, Questionnaire is useful for data capture (and occasionally data presentation), but not so much for search/retrieval/analysis.  A common pattern is to gather the data using Questionnaire, then transform it into the \"appropriate\" resource instances for downstream use (possibly with a link to the source Questionnaire for traceability/provenance purposes).</p>",
        "id": 153856040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478635509
    },
    {
        "content": "<p>What you are building is very similar to i2b2 (<a href=\"http://www.i2b2.org\" target=\"_blank\" title=\"http://www.i2b2.org\">www.i2b2.org</a>) and tranSMART, so you could look at those (open source) projects to see how they solve your problems. The gist is that you definitely want to adhere to an ontology and want to code data appropriately, for which QuestionnaireResponse is only of limited utility – at least for well-established medical concepts like immunizations, problem, gestational age and so on.</p>",
        "id": 153856052,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1478638293
    },
    {
        "content": "<p>When possible, use an Observation.  QuestionnaireResponse is sort of a catch-all for anything that doesn't fit into the other FHIR resources.  Furthermore, the QuestionnaireResponse basically just collects data points; whereas the other FHIR resources encode<br>\n knowledge.  </p>",
        "id": 153856947,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1479188309
    }
]