[
    {
        "content": "<p>Imagine (for a silly example) I want to express an observation like \"color of [[something]]\". Well, SNOMED \"107650008\" could express \"color of\"... but of course we don't have pre-coordinated codes meaning \"color of toenail\" or \"color of spleen\" or whatever. </p>\n<p>Now, with SNOMED I <strong>could</strong> create an expression meaning \"color of toenail\" and stick it in <code>Observation.code</code>, but this has two issues:</p>\n<p>1. If clients want to query for \"all color observations\", there's no clear way to do this unless servers support SNOMED expressions in a deep way.</p>\n<p>2. If the objects don't have SNOMED codes (but do have codes in another standard terminology), there's no way to use this approach.</p>\n<p>Some possible \"fixes\" would be to use an <code>Observation.code</code> meaning \"color\", and express \"colored thing = toenail\" in an</p>\n<ul>\n<li>a) <code>Observation.extension</code>, </li>\n<li>b) <code>Observation.related</code>, or </li>\n<li>c) <code>Observation.component</code></li>\n</ul>\n<p>Well, a) is nice but doesn't allow \"generic\" search; b) seems to create a separate observation that doesn't really stand alone. Is (c) plausible here?</p>",
        "id": 153834101,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466623844
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> can you not say /Observation?code=107650008&amp;code=&lt;snomed toemail code&gt; ?</p>",
        "id": 153834102,
        "sender_full_name": "Jeremy Walton",
        "timestamp": 1466624257
    },
    {
        "content": "<p>It's a good point --- another option I've considered. Given that the cardinality of <code>Observation.code</code> is 1..1, it's sort of \"cheating\" to try to stick different meanings into a single code and pretend their intersection is the meaning of the whole thing. But it does satisfy my use case from a mechanical/functional/syntactic perspective.</p>",
        "id": 153834103,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466624330
    },
    {
        "content": "<p>Pre-coordinate codes are not a good idea, agreed  but there a lot of good examples where qualifiers are very interesting: and \"oxygen saturation\"  (O2SAT) with or without oxygen administration . Searching for \"O2Sat\" then filter by  \"with oxygen\"?  I would vote for a) \"core extension\" qualifier [0..*].</p>",
        "id": 153834105,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1466624393
    },
    {
        "content": "<p>What would be the <strong>type</strong> of the qualifier, <span class=\"user-mention\" data-user-id=\"191968\">@Ioana Singureanu</span> ?</p>",
        "id": 153834106,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466624452
    },
    {
        "content": "<p>Normally I would consider any codes in the Coding field of the same system as AND's instead of OR's, different systems would be an OR</p>",
        "id": 153834108,
        "sender_full_name": "Jeremy Walton",
        "timestamp": 1466624536
    },
    {
        "content": "<p>Probably a choice of Observation, or Procedure (\"oxygen administration .. volume\") . Observation.bodySite is already a built-in qualifier.</p>",
        "id": 153834109,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1466624552
    },
    {
        "content": "<p>Hmm -- if the data doesn't go inline, it's still hard to work with through FHIR's current REST API.</p>",
        "id": 153834113,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466624628
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192215\">@Jeremy Walton</span> well, the notion of repeat <code>codings</code> in a single <code>CodeableConcept</code> is they're supposed to be synonyms/translations.</p>",
        "id": 153834114,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466624654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Which makes sense when you talk about different coding systems, but if there are multiple of the same, either there is something wrong with the coding system you are using, or thats how the system works collectively</p>",
        "id": 153834121,
        "sender_full_name": "Jeremy Walton",
        "timestamp": 1466624891
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Although I would definitely prefer that code/display of CodeableConcept.Coding be an array, that way, you can store one system, with multiple codes that are collective together.</p>",
        "id": 153834136,
        "sender_full_name": "Jeremy Walton",
        "timestamp": 1466625090
    },
    {
        "content": "<p>I mean, in a hierarchical coding system I could include multiple codings that walk up the tree from \"toenail\" to \"foot part\" to \"body part\" to \"thing\", and could including all 4 codings if wanted. That helps facilitate some query patterns (but I wouldn't exactly call it a best practice).</p>",
        "id": 153834140,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466625170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> You are right, but I don't see those as being synonymous at least in a clinical setting.  They are related but definite do not mean the same thing.</p>",
        "id": 153834151,
        "sender_full_name": "Jeremy Walton",
        "timestamp": 1466625287
    },
    {
        "content": "<p>Yes -- this is only true in a \"subsumption logic\" sense.</p>",
        "id": 153834159,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466625514
    },
    {
        "content": "<p>Precoordinated LOINCs have already done this in many cases.  So does post coordination of SNOMED code.  So a coding system exists to handle many use cases.   For the cases where this is not the case, for STU3 , OO is proposing using  Observation.component.code is relative to the Observation.code in the same way you propose. <a href=\"http://hl7-fhir.github.io/observation-operations.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/observation-operations.html\">http://hl7-fhir.github.io/observation-operations.html</a>.</p>",
        "id": 153834175,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466627152
    },
    {
        "content": "<p>I don't think that the proposal for component is the same thing. </p>",
        "id": 153834178,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466627653
    },
    {
        "content": "<p>My take on Josh's question is that the question could be code | bodysite. At least the examples Josh gave are about  that. Or it could be specimen, though you could make colour observations on other things. And so something so general points to an ontological solution.... so then, well, it's a terminology problem.</p>",
        "id": 153834179,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466627835
    },
    {
        "content": "<p>and we've described the proper solution for this, which is a value set with a filter, and a search for :in. </p>",
        "id": 153834180,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466627875
    },
    {
        "content": "<p>but as you say \"servers support SNOMED expressions in a deep way\" - well, yes. But as far as I can tell, that's inevitable. Else, well, you'll have to indulge in trickery and make arbitary rules about snomed queries or extensions (that's what _query is for)</p>",
        "id": 153834181,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466628247
    },
    {
        "content": "<p>To clarify what I think is being discussed is there are several inline qualifiers such as bodysite, method, device., time.   What if the class of qualifiers doesn't exist?    (and I can't think of any right now - because I think we already have most of the big ones covered)  How best to handle that.  In retrospect an extension would be my choice.   I agree the operation is a bit different.</p>",
        "id": 153834183,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466628870
    },
    {
        "content": "<p>well, you could talk about the colour of a thing that is not a body site. You could generalise the heck out of that concept and probably cover this case at the case of no one having any idea what the element is for...</p>",
        "id": 153834186,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466629118
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Yeah. My real interest here is not colored-things, but genotype observations. It doesn't make sense to have pre-coordinated codes meaning \"genotype determination for [[some gene]]\" for every gene in existence. But SNOMED has a generic \"genotype determination\" code, and HGNC has codes for all of the relevant genes.</p>\n<p>The extension approach is okay, but it means search doesn't work out-of-the-box on servers that <em>do</em> support the standard FHIR search params. I'm experimenting with components-as-ad-hoc-qualifiers, which I'm not thrilled about semantically, but it does \"work\" technically.</p>",
        "id": 153834234,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466648142
    },
    {
        "content": "<p>at some point the cost/benefit of postcordination has to tip over...</p>",
        "id": 153834239,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466650930
    },
    {
        "content": "<p>but <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> is it possible to use the code for the gene for observation.code then the genotype as the value?</p>",
        "id": 153834240,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466651065
    },
    {
        "content": "<p>or is the gene the <code>bodySite</code> ??</p>",
        "id": 153834241,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466651121
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> what have clinical genomics said about this question to this point? </p>",
        "id": 153834300,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466667024
    },
    {
        "content": "<p>Currently all qualification is in extensions (see <a href=\"http://hl7-fhir.github.io/observation-genetics.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/observation-genetics.html\">http://hl7-fhir.github.io/observation-genetics.html</a>). I'm thinking through the implications here. </p>",
        "id": 153834316,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466679196
    },
    {
        "content": "<p>this is a hard problem. Bodysite is obviously wrong, but it might not be wrong if we generalised 'site'. but that might be a less than optimal idea generally</p>",
        "id": 153834317,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466679650
    },
    {
        "content": "<p>wrong depends on scale :-)</p>",
        "id": 153834318,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466679683
    },
    {
        "content": "<p>OO would say that the correct approach is to push both things into the code, so it remains a code / value pair, but we accept method as a variant on that</p>",
        "id": 153834319,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466679704
    },
    {
        "content": "<p>that would argue for an extension approach; we can define a search parameter on an extension in the spec if we need to</p>",
        "id": 153834320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466679726
    },
    {
        "content": "<p>In the past I proposed an extension on Observation.code (but that's crazy confusing) </p>",
        "id": 153834321,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466679746
    },
    {
        "content": "<p>yes, it should be an extension on Observation, not Observation.code</p>",
        "id": 153834322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466679767
    },
    {
        "content": "<p>True, but in general there's a real benefit in designs that \"just work\" with all the reference servers without having to wait 18 months between releases. </p>",
        "id": 153834323,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466679804
    },
    {
        "content": "<p>I.e. Solutions that can naturally \"back port\" to the currently published release are nice. Not the only consideration by any stretch, but it counts for something. </p>",
        "id": 153834324,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466679843
    },
    {
        "content": "<p>I don't think you have to wait 18 months for a new release. </p>",
        "id": 153834325,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466679846
    },
    {
        "content": "<p>though it's not automatic, no</p>",
        "id": 153834326,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466679857
    },
    {
        "content": "<p>I mean, technically a qualifier here is qualifying the code (at least in the case of \"code=genotype assessment, gene=TPMT\"). But that's unmanageable. </p>",
        "id": 153834327,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466679975
    },
    {
        "content": "<p>why is it unmanagable</p>",
        "id": 153834329,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466680587
    },
    {
        "content": "<p>In viral sequencing  in V2 have done this as a type of panel.  The CG group moved away from this I think.   The gene was part of the panel so that fits into using the components.   code = genotype assessment  component.code= gene,  component.value - TPMT and component.code[1]= blah, component.valeu[2] =blah...   Some component code are provided more context for the other values.  </p>",
        "id": 153834447,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466691306
    },
    {
        "content": "<p>The CG work actually spurred us to bring component back.  These values all had to be looked at together.  They were meaningless apart.  I think after reading this that this is what you are looking for. </p>",
        "id": 153834448,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466691483
    },
    {
        "content": "<p>CG wanted them to be inline and not name:value so chose the extensions and then created the Sequence  resource</p>",
        "id": 153834449,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466691543
    },
    {
        "content": "<p>Seems to me that we need a good reason to push hard very soon to define a post-coordination extension mechanisim that everyone can adopt. Could be that gene data is the right lever to make that push. If we can get the right terminology authorities involved (IHTSDO plus who ever can bring the gene concepts to the party) you might be able to get this moving. I'd really be concerned if you all tried to hack an in-line approach to this that makes all sorts of assumptions. Am I on the right track?</p>",
        "id": 153834510,
        "sender_full_name": "Robert McClure",
        "timestamp": 1466699028
    },
    {
        "content": "<blockquote>\n<p>Am I on the right track?</p>\n</blockquote>\n<p>Perhaps <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>! What do you mean by \"hack an in-line approach\". That is: what has you most concerned?</p>",
        "id": 153834511,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466699116
    },
    {
        "content": "<p>my biggest concern is that FHIR do post-coordination in a consistent way. By post-coordination I mean communicate meaning using coded concepts alone. And the in-line concern was that simple combinations of concepts would have assumed, instead of explicit, semantics. I know I'm not following everything you all have said so I could be off in a different space...</p>",
        "id": 153834514,
        "sender_full_name": "Robert McClure",
        "timestamp": 1466699321
    },
    {
        "content": "<p>I agree with Rob's concern.  We need to be careful, and also very clear, about whatever we decide to do with this.  Post-coordination in SNOMED CT is hard enough, and it has an underlying description logic foundation.  The description logic doesn't make it easy, but at least it helps (doesn't always ensure) in making it consistent and sound.  If we start \"post-coordinating\" more extensively with the FHIR elements (most likely without having that formal description logic foundation), we may well create more issues than we are solving.  So let's proceed with exploring this, but be cautious and thorough in evaluating whatever is being proposed.</p>",
        "id": 153834519,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1466700374
    },
    {
        "content": "<p>I think we mentioned post-coordination of codes as a possibility vs a precoordinated code like LOINC.   We are already modifying the context of the code in the resources now when you use the method  or bodysite or specimen or any othe element (if we hypothetically add an element \"gene\" to Observation that would qualify the code.)!   Using component codes using a name value pair is a way to relate interdependent observations codes with the same context and maybe qualifier codes is the wrong term. </p>\n<p>At this point in FHIR saying hold on is very curious to me.  What exactly is the concern here with this discussion? </p>",
        "id": 153834528,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466703292
    },
    {
        "content": "<p>well, there's a methodological issue. From a purist informatics point of view, the right way to do this is post-coordination. In practice, though, that's not supportable because of the way systems are architected today, and Josh is searching for something that's implementable now. </p>",
        "id": 153834587,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466717816
    },
    {
        "content": "<p>FHIR has the APIs that allow you to build an architecture that doesn't see post-coordinated codes differently, but as far as I know, I'm the only one who's built an architecture that works that way. It's not possible to retro-fit that either </p>",
        "id": 153834589,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466717883
    },
    {
        "content": "<p>I don't know whether the component approach meets Josh's needs - what does it look like - example?</p>",
        "id": 153834592,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466718403
    },
    {
        "content": "<p>I was noodling with Gaston on something like <a href=\"https://github.com/jmandel/pgx-cds/blob/patch-1/examples/tpmt/Observation-example-diplotypecall.json\" target=\"_blank\" title=\"https://github.com/jmandel/pgx-cds/blob/patch-1/examples/tpmt/Observation-example-diplotypecall.json\">https://github.com/jmandel/pgx-cds/blob/patch-1/examples/tpmt/Observation-example-diplotypecall.json</a></p>",
        "id": 153834597,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466718755
    },
    {
        "content": "<p>I expected this observation to include at least one more component of an actual measurement.</p>",
        "id": 153834603,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466719399
    },
    {
        "content": "<p>Currently this example includes the genotype \"measurement\" at Observation.value. -Would you rather put that in a component instead of Observation.value? If so, what would the  Observation.code and component.code be then, <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>? </p>",
        "id": 153834607,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466719928
    },
    {
        "content": "<p>i think \"solving postcoordination\" is a problem bigger than FHIR</p>",
        "id": 153834616,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466724073
    },
    {
        "content": "<p>getting a consistent model that gives a standardised expression pattern is half the battle</p>",
        "id": 153834617,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466724117
    },
    {
        "content": "<p>uncontrolled postcoordination rapidly degenerates into something akin to free text parsing unless all stakeholders are on same page</p>",
        "id": 153834619,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466724174
    },
    {
        "content": "<p>I think Josh's example is valid</p>",
        "id": 153834620,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466724227
    },
    {
        "content": "<p>I wasn't expecting  value so I missed that.   I would expect this pattern....</p>\n<div class=\"codehilite\"><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;\n&lt;Observation xmlns:xhtml=&quot;http://www.w3.org/1999/xhtml&quot; xsi:schemaLocation=&quot;http://hl7.org/fhir //Mac/Home/Documents/FHIR/FHIR%20tools/DSTU2Schema/observation.xsd&quot; xmlns=&quot;http://hl7.org/fhir&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;\n&lt;id value=&quot;gene-example&quot;/&gt;\n&lt;status value=&quot;final&quot;/&gt;\n&lt;code&gt;\n    &lt;coding&gt;\n        &lt;system value=&quot;http://example.org&quot;/&gt;\n        &lt;code value=&quot;genetic test&quot;/&gt;\n        &lt;display value=&quot;Genetic test&quot;/&gt;\n    &lt;/coding&gt;\n&lt;/code&gt;\n&lt;component&gt;\n    &lt;code&gt;\n        &lt;coding&gt;\n            &lt;system value=&quot;http://example.org&quot;/&gt;\n            &lt;code value=&quot;gene&quot;/&gt;\n            &lt;display value=&quot;Gene&quot;/&gt;\n        &lt;/coding&gt;\n    &lt;/code&gt;\n    &lt;valueString value=&quot;GENE&quot;/&gt;\n&lt;/component&gt;\n&lt;component&gt;\n    &lt;code&gt;\n        &lt;coding&gt;\n            &lt;system value=&quot;http://example.org&quot;/&gt;\n            &lt;code value=&quot;genetic test measure&quot;/&gt;\n            &lt;display value=&quot;Genetic test Measure&quot;/&gt;\n        &lt;/coding&gt;\n    &lt;/code&gt;\n    &lt;valueQuantity&gt;\n        &lt;value value=&quot;1000&quot;/&gt;\n    &lt;/valueQuantity&gt;\n&lt;/component&gt;\n&lt;/Observation&gt;\n</pre></div>",
        "id": 153834645,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466726037
    },
    {
        "content": "<p>where .code would be a \"panel or grouper' code.  I think having  a .value and a .component.value implies \"rank\" for lack of a better term.  where the .value would be a compilation or summary of all the component values.</p>",
        "id": 153834650,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466726252
    },
    {
        "content": "<p>Oops ... this example is invalid because of an invariant that says .code can't equal .component.code  - I fixed it</p>",
        "id": 153834659,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466726680
    },
    {
        "content": "<p>Can you help me understand why repeating the Observation.code in Observation.component.code (or slightly tweaking it just to make the validator happy) provides a more correct (or otherwise preferable) solution? What's new gain?  </p>",
        "id": 153834662,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1466726851
    },
    {
        "content": "<p>ah. ok. well, that follows the pattern we use for immunology, but makes search a little hard </p>",
        "id": 153834669,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466727810
    },
    {
        "content": "<p>Josh's pattern is odd:<br>\n  obs code = genotype determination,  value = {genotype}<br>\n     component obs code = gene, value = {gene}</p>\n<p>Erics's pattern is also odd<br>\n  obs code = genetic test<br>\n    component obs code = gene, value = {gene}<br>\n    component obs code = genotype, value = {genotype}</p>",
        "id": 153834670,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466728008
    },
    {
        "content": "<p>when the underlying concept model is <br>\n  test = genotype, gene = {gene}, value = {genotype}</p>",
        "id": 153834671,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466728045
    },
    {
        "content": "<p>gene is a qualifier like bodysite is</p>",
        "id": 153834672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466728052
    },
    {
        "content": "<p>.I think it's better as an extension than a componetn</p>",
        "id": 153834673,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466728061
    },
    {
        "content": "<p>having looked at both those</p>",
        "id": 153834674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466728068
    },
    {
        "content": "<p>My issue is what is implied relationship between  .value and the component.  What happens when there are multiple Values for Gene X?  We actually state that  \"As is true when using Observation.related above, the observation for a panel that carries the component typically does not have its own Observation.value.\"    </p>",
        "id": 153834675,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466728848
    },
    {
        "content": "<p>mine is less odd and more patterned after a panel!  :-)</p>",
        "id": 153834676,
        "sender_full_name": "Eric Haas",
        "timestamp": 1466728929
    },
    {
        "content": "<p>less odd was a smalle mountain to climb in this case ;-)</p>",
        "id": 153834677,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466729018
    },
    {
        "content": "<p>Here's another twist.  The underlying sequence data associated with a particular clinical biomarker can change over time.  For example, the set of BRCA1 mutations classified as pathogenic may grow.  For that reason, when doing genetic analysis of a patient cohort, it may be important to re-interpret the underlying sequence data instead of relying on coded values generated in the past.</p>",
        "id": 153835902,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1467302672
    },
    {
        "content": "<p>Is this already addressed by the  <a href=\"http://hl7-fhir.github.io/sequence.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/sequence.html\">Sequence Resource</a> or the <a href=\"http://hl7-fhir.github.io/observation-genetics.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/observation-genetics.html\">genetics profile</a>?</p>",
        "id": 153835910,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467306595
    },
    {
        "content": "<p>Addressed, yes: I'm trying to figure out how well this works in practice, and whether alternatives might work better.</p>",
        "id": 153835919,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1467315823
    },
    {
        "content": "<p>OK let me know if and what I or OO can do to help.  <span class=\"user-mention\" data-user-id=\"191926\">@Joel Schneider</span>  If I understand you correctly what you are measuring is a moving target.    Still - Iook at this a  type of panel with two classes of result values : 1)  direct measurements and 2) a set of \"ask at order\" observations.  </p>\n<p>You have to ask each time \"Ok what I am measuring\"   The measurements are looked at in the context of the new set of answers to that question.  <br>\nOne day the sands will stop shifting in genomics and will be just like measuring glucose levels.  -  quote from Clem :-)</p>",
        "id": 153835920,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467316730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Thanks for the offer to help.  It may take time for concrete details to filter through the CG group.  Clem has definitely been working on HL7 v2 representations for genetic test results.  The pattern of direct measurements and derived observations makes sense.<br>\nFor some cases, clinical genetic test reporting might only include results which are deemed significant, but the significance of a genetic measurement can also change over time, as illustrated by a recent negligence suit against Quest's Athena involving SCN1A and Dravet syndrome.  That kind of situation may (eventually) require additional consideration.</p>",
        "id": 153836788,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1467907810
    }
]