[
    {
        "content": "<p>I am creating an IG based upon STU-3. I am struggling with how to represent an observation whose value is an address (58332-8 death location and 69447-1 Injury Location). There is no observation.valueAddress element and there is no way to point a Location resource to a subject. Any suggested workarounds?</p>",
        "id": 154021211,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1543369688
    },
    {
        "content": "<p>Put the address as a single string in valueString and the as an Address data type in an extension of value ? So general-purpose client would have ta decent value and clients that know about the special extension can get better details</p>",
        "id": 154021221,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1543376533
    },
    {
        "content": "<p>It looks like an extension is my only option. I am considering adding a \"location\" extension to Observation that would function similar to the location element of Adverse Event. Any opinions pro or con with this approach?</p>",
        "id": 154021317,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1543415197
    },
    {
        "content": "<p>I'd make it an extension of Observation.value maybe - because it is the value of the observation after all</p>",
        "id": 154021318,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1543415418
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196402\">@AbdulMalik Shakir</span> Would it always be an address, or could it extend to GPS coordinates ? We just ahd a discussion in another thread about real time location tracking (e.g. of patients), whereby we'd need an extension on Observation to a Location resource (which has address, coordinates as well as other descriptions). Location may be too complex in your use case if it's really just (and always) an address.</p>",
        "id": 154023693,
        "sender_full_name": "René Spronk",
        "timestamp": 1544174987
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"196402\">@AbdulMalik Shakir</span> Would it always be an address, or could it extend to GPS coordinates ? We just ahd a discussion in another thread about real time location tracking (e.g. of patients), whereby we'd need an extension on Observation to a Location resource (which has address, coordinates as well as other descriptions). Location may be too complex in your use case if it's really just (and always) an address.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> My requirement is not always a postal address. It is any location that a decedent's remains might be found. GPS would be useful in some cases but sometimes it could simply be a landmark such as 'the 59th street entrance to Central Park' or 'Aboard United flight 167 from DC to LAX). The Location resource would meet all of my needs.</p>",
        "id": 154023697,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1544176006
    },
    {
        "content": "<p>In which case you could propose such an extension (valueLocation, a reference to a Location resource) to Observation. (I won't be proposing it myself, my real-time-location question [the other thread] was raised on behalf of a participant in a FHIR training course)</p>",
        "id": 154023703,
        "sender_full_name": "René Spronk",
        "timestamp": 1544179505
    },
    {
        "content": "<p>valueReference would probably be the appropriate extension.  You'd constrain it to be a Reference to a Location in your particular profile</p>",
        "id": 154024328,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544492979
    }
]