[
    {
        "content": "<p>Hi! In our data model we have Observations related to bowel and bladder function that contain a reference to a stoma (which is either an Observation or Condition resource in FHIR - to be discussed). Is the extension workflow-supportingInfo suitable to map this reference, as the stoma can help interpreting the bowel/bladder function? And a related question, does anyone already have some experience with this extension?</p>",
        "id": 257062135,
        "sender_full_name": "Luud Slagter",
        "timestamp": 1633957865
    },
    {
        "content": "<p>You might actually want to use BodyStructure for this (given that an unlucky patient might have more than one of these).  supportinginfo is a relatively weak extension - it basically allows you to send anything at all that's deemed to be relevant in either executing an order or interpreting a set of results.  However, it doesn't provide any information about <em>how</em> the referenced resources are relevant.</p>",
        "id": 257062610,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633958136
    },
    {
        "content": "<p>That's a good suggestion regarding BodyStructure. We will have a closer look into that resource for modelling the Stoma. <br>\nA relation to a resource that contains the Stoma information would either be a reference using the supportingInfo extension or a custom extension (correct?). Wouldn't the core extension be more appropriate as it can contain additional documentation inside the profile that uses it?</p>",
        "id": 257100237,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1633976593
    },
    {
        "content": "<p>There's a standard extension to point to BodyStructure for Procedure &amp; ServiceRequest.  For Observation, it would just be focus.  Looks like we need a new extension if you want to tie BodyStructure directly to a Condition.</p>",
        "id": 257103825,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633978633
    },
    {
        "content": "<p>I am not so sure about <code>Observation.focus</code> as the definition states: \"<em>The actual focus of an observation when it is <strong>not the patient of record </strong>representing something or someone associated with the patient such as a spouse, parent, fetus, or donor.</em>\"<br>\nThe bladder and bowel functions do have the patient as subject/focus. The presence of a stoma is additional information to have a better interpretation of someones bladder and bowel function.</p>",
        "id": 257161466,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634024238
    },
    {
        "content": "<p>What is the relationship of the stoma to the observation being made</p>",
        "id": 257199641,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634044213
    },
    {
        "content": "<p>The description of Stoma in our model is 'Stoma describes the presence of an unnatural, surgically created opening. If the patient has a stoma, the type of stoma must be entered along with the date on and location at which the stoma and any stoma pouches were placed. An comment can also be entered.' So actually it is more of an implicit relationship; the element Stoma just describes the stoma itself, which might have some (implicit) consequences on other elements. Therefore it seems not to be the focus of the Observation, but to give some additional information or context instead.</p>\n<p>The data model has the following elements (BowelFunction is the root): <a href=\"/user_uploads/10155/paM4UvWH2Ey4o5MG_OojEy7a/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/paM4UvWH2Ey4o5MG_OojEy7a/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/paM4UvWH2Ey4o5MG_OojEy7a/image.png\"></a></div>",
        "id": 257210142,
        "sender_full_name": "Luud Slagter",
        "timestamp": 1634048233
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 257215716,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634050261
    }
]