[
    {
        "content": "<p>Hello,<br>\nI would like a proposal/solution about the preferred way to create a specific resource after the decision to remove valueAttachment from Observation resource (the change in tracker is here <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_id=677&amp;tracker_item_id=13421\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_id=677&amp;tracker_item_id=13421\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_id=677&amp;tracker_item_id=13421</a>).</p>\n<p>I have a scenario in mind:<br>\nI want a resource that it is not Media resource (not a photo or video) and not a document (e.g. pdf) it is an file with relatively high sampling rate (1sample/sec) that is unpractical to create distinct resources for a period of time (e.g. 5 minutes).<br>\nvalueSampledData works well if the sampling rate is fixed.<br>\nif the sampling rate is irregular (e.g. continuous heart rate measurements ) use of valueAttachment could be a solution using timestamp,value pairs as csv or any type of binary.</p>\n<p>What is the preferred way to handle this situation?</p>",
        "id": 153996630,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1536843138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ?</p>",
        "id": 153996695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536852466
    },
    {
        "content": "<p>a string?</p>",
        "id": 153996804,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536862996
    },
    {
        "content": "<p>Using sampled data with a Null value when no data??? SampledData     <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  What experience do you have with irregularly sampled data?</p>",
        "id": 153996806,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536863409
    },
    {
        "content": "<p>Seems irregularly sampled data would be different Observations.</p>",
        "id": 153996808,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536863592
    },
    {
        "content": "<p>however <span class=\"user-mention\" data-user-id=\"196809\">@Vassilis Kilintzis</span>  have you looked at Sequence?</p>",
        "id": 153996811,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536863635
    },
    {
        "content": "<p>Thank you for your responses, <br>\n<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Using string could be a solution for the specific case since more or less the format of the csv must be agreed outside of the resource description, on the other hand attachment.contentType(text/csv)  is very valuable property of the resource and can help in automatic management of the resource.<br>\nRegarding the conversion of the signal to a fixed frequency sampled signal this solution requires significant effort since the procedure requires interpolation and resampling since even if we determine the maximum sampling frequency of the signal adding NULL to non sampled timepoints we can not guarantee that the samples align to the resulting timepoints.</p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  Using different observations is a semantically correct solution but performance-wise is very impractical (i.e. in a scenario that we want to exchange an hour of the aforementioned heart rate measurements we would need ~4800 requests.<br>\nRegarding Sequence does not solve the problem for two reasons A)semantically Sequence is too narrow to \"genetic sequence information\" ,<br>\nb) but even if we ignore that Sequence.observedSeq is merely a string not providing additional semantics.</p>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I may be missing additional conversations but just by reading the tracker item of the decision to remove valueAttachment is not clear to me the rationale behind that decision. My humble personal opinion is that introduction of Media does not necessarily require the removal of attachment from observation.</p>",
        "id": 153996893,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1536906771
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"196809\">@Vassilis Kilintzis</span> you are trying to record EKG? I have previously modeled a FHIR Resource from the IEEE 11073. I did this when I was part of GE, but couldn't get GE to endorse the proposal to FHIR as a Resource.  If this is what you are interested in, I still have the model. It would need to be proposed and sponsored by an appropriate workgroup.</p>",
        "id": 153996991,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536931224
    },
    {
        "content": "<p>I put that 2015 model for FHIR source Resource onto GITHUB <a href=\"https://github.com/JohnMoehrke/FHIR-ECG\" target=\"_blank\" title=\"https://github.com/JohnMoehrke/FHIR-ECG\">https://github.com/JohnMoehrke/FHIR-ECG</a></p>",
        "id": 153996996,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536932253
    },
    {
        "content": "<p>Why was valueAttachment removed?</p>",
        "id": 153997013,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536935732
    },
    {
        "content": "<p>Thank you John (<span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ), but i would prefer the flexibility of the DTU3 observation resource with valueAttachment and let the profile/extension mechanism to describe the exact nature of the resource. </p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  i believe that at some point valueAttachment will return, since we can not predict all possible payloads beforehand.</p>",
        "id": 153997287,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1537167179
    },
    {
        "content": "<p>The ECG/EKG model I did was not a replacement for Observation. There would still be an Observation based on the data. What the IEEE model does is record the details of the ECG/EKG in sufficient detail that it can be used in future analysis comparing past and present. Much like an ImagingStudy, or Sequence.</p>",
        "id": 153997334,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537185506
    },
    {
        "content": "<p>I would expect that where valueAttachment felt like the right thing that it would be better to put that attachment into a DocumentReference or Media... and use Observation.derivedFrom.</p>",
        "id": 153997340,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537186285
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Can you shed light on why valueAttachment went away?</p>",
        "id": 153997372,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537195656
    },
    {
        "content": "<p>1) This change eliminates the ambiguity and duplication on how to represent multimedia observations.  The committees felt that Media was a more appropriate way to represent these types of Observations.</p>",
        "id": 153997642,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537286714
    },
    {
        "content": "<p>How is a csv  file fundamentally different from a pdf image.   They are both documents in my mind and Media would work.   Otherwise you are adding back into observation this ambiguity of when to use which resource each time you come up with an attachment.</p>",
        "id": 153997645,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537287174
    },
    {
        "content": "<p>Media is tightly scoped to images and video though.  There are all sorts of other types of Observations that fall outside that space.</p>",
        "id": 153997659,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537290182
    },
    {
        "content": "<p>Perhaps we should loosen the scope of Media?</p>",
        "id": 153997660,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537290192
    },
    {
        "content": "<p>I think of a pdf or word doc as being media  <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> ??</p>",
        "id": 153997662,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537290315
    },
    {
        "content": "<p>I do too, but the spec clearly says that Media is: <code>A photo, video, or audio recording acquired or used in healthcare. The actual content may be inline or provided by direct reference.</code></p>",
        "id": 153997664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537290456
    },
    {
        "content": "<p>Something like a PDF or Word doc (shudder) can be handled using DocumentReference.  But an EKG or something like that doesn't have a clear home anymore.</p>",
        "id": 153997665,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537290498
    },
    {
        "content": "<p>I envisioned Media as audio/video/still images, but others felt that it could function as more a generic clinical blob. I don't think we ever nailed down the boundaries on the DocReference&lt;&gt;Media&lt;&gt;Observation continuum.</p>",
        "id": 153997666,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1537290527
    },
    {
        "content": "<p>\"Something like a PDF or Word doc (shudder) can be handled using DocumentReference. \"   DocRef only referenced through derivedBy or .focus  so is not a direct result value.  I think Media would  makes sense if you want a document/file as a direct result.  because I agree we have a gap for files that are not images, video or audio.  and DR is not a type of Observation.</p>",
        "id": 153997694,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537291706
    },
    {
        "content": "<p>Possibly another option may be a DR reference extension for values that are other file types?? ( My preference is for  media to be liberally defined)</p>",
        "id": 153997695,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537291858
    },
    {
        "content": "<p>audio/video/still images/other??</p>",
        "id": 153997696,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537291972
    },
    {
        "content": "<p>More proof that we have not yet figured out the difference between Media and DocumentReference. I think they should be either better clarified, or merged into one resource. I see no reason for continued dancing around this. I see no need for differentiation.</p>",
        "id": 153997720,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537298825
    },
    {
        "content": "<p>so <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> why have you gravitated toward Media when DocumentReference can carry your example PDF or CSV?</p>",
        "id": 153997723,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537298977
    },
    {
        "content": "<p>is it the 'name' of the DocumentReference resource? Renaming suggestions are welcome.</p>",
        "id": 153997724,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299023
    },
    {
        "content": "<p>What matters to me is that in R4 there's a clear place to send stuff like EKGs</p>",
        "id": 153997725,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537299080
    },
    {
        "content": "<p>to me the answer for all of this is DocumentReference.</p>",
        "id": 153997728,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299161
    },
    {
        "content": "<p>if we are talking about a blob of data that has a defined mime-type, then DocumentReference.</p>",
        "id": 153997729,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299205
    },
    {
        "content": "<p>DocumentReference doesn't make any sense for an EKG</p>",
        "id": 153997730,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537299309
    },
    {
        "content": "<p>An EKG is an Observation</p>",
        "id": 153997731,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537299321
    },
    {
        "content": "<p>DR is not an Observation.  The question is I have a code = ekg and result value is this file containing a set of irregularly sampled data.  How would DR handle that?</p>",
        "id": 153997732,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537299327
    },
    {
        "content": "<p>What part of the EKG are you asking about? The medical statements (observations), or the raw material measured from the body?</p>",
        "id": 153997735,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299368
    },
    {
        "content": "<p>the raw data.. This is analogous to 80 mg/dL for a blood glucose observation</p>",
        "id": 153997736,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537299407
    },
    {
        "content": "<p>I understood that there was going to be a specializations like imagingstudy for EKG, EEG etc but this has not happened yet.  So I guess we are looking for interim - longterm solutions.</p>",
        "id": 153997740,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537299561
    },
    {
        "content": "<p>I think you are not thinking about the full potential of an EKG, but rather are thinking only about a simple resting-EKG. Even a resting-EKG can reach a Meg bytes in size. But there are Stress EKG that far exceed that and reach the size of a CT exam (hence why DICOM is one of the standards defined to hold the raw EKG data).</p>",
        "id": 153997741,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299563
    },
    {
        "content": "<p>yes there is a DICOM specification for EKG</p>",
        "id": 153997742,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299582
    },
    {
        "content": "<p>yes it fits in ImagingStudy</p>",
        "id": 153997743,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299588
    },
    {
        "content": "<p>So are you suggesting redefining imaging Study?</p>",
        "id": 153997744,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537299619
    },
    {
        "content": "<p>no, ImagingStudy works already for all DICOM</p>",
        "id": 153997745,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299635
    },
    {
        "content": "<p>However most uses of EKG are made portable by committing them to printed form in PDF... and that is best represented by DocumentReference</p>",
        "id": 153997746,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299693
    },
    {
        "content": "<p>I tried to get a formal EKG/ECG Resource in FHIR back two years ago when I was part of GE. But couldn't get sponsorship or find a workgroup.   See <a href=\"https://github.com/JohnMoehrke/FHIR-ECG\" target=\"_blank\" title=\"https://github.com/JohnMoehrke/FHIR-ECG\">https://github.com/JohnMoehrke/FHIR-ECG</a></p>",
        "id": 153997747,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299745
    },
    {
        "content": "<p>so Observation may point at an ImagingStudy, and/or documentReference for further details. But the Observation should carry the 'observations' made from that raw material (the Serial Comparison statements, waveform analsysis, or human observations), along with critical parameters (who, where, when, how, length, etc)</p>",
        "id": 153997748,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537299878
    },
    {
        "content": "<p>An EKG is absolutely an Observation - it's not something appropriate for DocumentReference.  You might have your whole diagnostic report as a document, but not the raw pieces.</p>",
        "id": 153997749,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537300126
    },
    {
        "content": "<p>We are  talking in circles.  \"in PDF... and that is best represented by DocumentReference\"  </p>\n<p>\"Lloyd McKenzie: DocumentReference doesn't make any sense for an EKG</p>\n<p>Lloyd McKenzie: An EKG is an Observation\"</p>\n<p>ergo and EKG as a PDF or a screen capture or a picture on my iphone is .....Media   ( for now since there is no EKG resource.)</p>\n<p>(And I agree that I don't know all the other stuff that an ekg may need )</p>",
        "id": 153997750,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537300213
    },
    {
        "content": "<p>I'm thinking about an EKG as a raw data file</p>",
        "id": 153997751,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537300333
    },
    {
        "content": "<p>EKG has a few standards based formats (Not printed form which most clinicians see). The raw data is only ever processed by AI (Serial Comparison) code -- which compares last-previous with current; or by algorithm that looks at just this waveform (e.g. 12sl). This raw format is proprietary format originally written by Marquette Electric, now owned by GE.  This format has been re-architected in IEEE under 11073 standard as the abstract model. That abstract model has an encoding in DICOM.</p>",
        "id": 153997759,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537300927
    },
    {
        "content": "<p>I have provided the GITHUB location where I attempted to map IEEE 11073 into a FHIR Resource... two years ago.  It never went anywhere</p>",
        "id": 153997761,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537300973
    },
    {
        "content": "<p>If we are going to use the 80% rule... then this discussion can be shortened as 80% of the time none of that is used.. what is used 80% of the time is a PDF rendering into human readable form</p>",
        "id": 153997762,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537301056
    },
    {
        "content": "<p>thus leaving the raw form behind in an ECG management system (MUSE).</p>",
        "id": 153997764,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537301098
    },
    {
        "content": "<p>that PDF form is usually (should be) a vectored PDF, so that close inspection (zoom in) enables very careful measurement using the red-grid in the background (red-grid, another proprietary standard from Marquette made ubiquitous standard). If it is rastered graphics PDF it is not medically useful.</p>",
        "id": 153997767,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537301320
    },
    {
        "content": "<p>Hi John,<br>\nMy point wasn't to focus on EKGs.  It was to deal with the fact that there are a number of Observation types where the end result is binary data that is not an image, video or sound recording.  That information needs to have a mechanism for it to be stored.  I'm fine if the decision is for that to be Media.  I'm fine if the decision is to add an extension to Observation to allow valueAttachment until such time as we can put valueAttachment back.  I'm not ok with the notion of using DocumentReference for such a purpose though.</p>",
        "id": 153997775,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537301906
    },
    {
        "content": "<p>why not?</p>",
        "id": 153997776,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537301937
    },
    {
        "content": "<p>Because DocumentReference is about documents - and these things aren't.  They're clearly observations.  They're raw data.  They're no different than a blood pressure reading or a white blood cell count.</p>",
        "id": 153997784,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537302294
    },
    {
        "content": "<p>I am not trying to extract measurements out of Observation. I would agree that where measurements exist they should be enumerated in Observation. I am just observing that sometimes the source for that Observation is only available as a blob of bytes that have a mime-type and thus need metadata (DocumentReference resource purpose) to describe and provide a handle for Observation to point at. DocumentReference is only (lowercase) document based in that it must point at a blob that has a mime-type... just like the word document means in the http world.  DocumentReference is not constrained to (uppercase) Document as is defined and described by HL7 structured documents workgroup.</p>",
        "id": 153997789,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537302766
    },
    {
        "content": "<p>the inspiration for DocumentRefenence is much wider than Structured Documents definition of \"Document\". Hence why ownership by Structure Documents workgroup is not the best fit for DocumentReference (and DocumentManifest). Would ownership by OO or FHIR-I help get this clarity? Would be glad for a change of the name of the Resource, as the name seems to be causing misunderstanding. That misunderstanding seems to be causing duplicate effort in FHIR (aka Media).</p>",
        "id": 153997790,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537302913
    },
    {
        "content": "<p>Media has notions of bodySite, device and other Observation things.  And doesn't have masterIdentifier, docStatus, authenticator and a whole bunch of other elements that are highly document-centric.</p>",
        "id": 153997801,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537304133
    },
    {
        "content": "<p>Also, Media ties into Observation in all the right ways.  DocumentReference doesn't (and shouldn't).</p>",
        "id": 153997803,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537304156
    },
    {
        "content": "<p>why not?</p>",
        "id": 153997806,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537304928
    },
    {
        "content": "<p>so this discussion has been pretty unfocused, it seems to me, now that I'm catching up on it. </p>\n<p>I have several questions:</p>\n<ul>\n<li>if DICOM has a format for EKG, why would also do one? </li>\n<li>I would've thought that this would be DiagnosticReport.imagingStudy</li>\n<li>why specifically do we want an observation? If your answer is yes, why hasn't this been an issue or other kinds of imaging? </li>\n<li>I do not think that the correct answer here is to make DocRef ever more generic and central</li>\n<li>Nor do I think that media should be made more generic</li>\n<li>I suppose we could take the EKG format on directly... but they are very large, and there are existing formats... so it seems low yield to me</li>\n</ul>",
        "id": 153997807,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537304992
    },
    {
        "content": "<p>EKG isn't the focus.  I care about EKGs, genetic files,  tummy bands for pregnant moms and all other sorts of observation results that can't be expressed as a single Quantity but which certainly aren't \"documents\".  In the past, I'd have said \"send those using Observation.valueAttachment\", but that doesn't exist anymore - and there doesn't seem to be an adequate alternative.</p>",
        "id": 153997808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537305136
    },
    {
        "content": "<p>yup, what Lloyd said... (On EKG, yes you got the point there. and why EKG didn't get into a FHIR Resource)</p>",
        "id": 153997809,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537305209
    },
    {
        "content": "<p>so, back to what Lloyd said... I am possibly distracting from Lloyds point, saying that when one has something beyond a single Quantity one should have one choice. It is not clear that choice should only be Media, but what about DocumentReferenece.  Media and DocumentReference need to be rationalized, harmonized, or homogenized.   I would like to see them merged into one blob describing resource</p>",
        "id": 153997810,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537305364
    },
    {
        "content": "<p>If they can't be merged, then we need a distinction that is clear.  Today, Lloyd seems to see a distinction that Media can be used as input to an Observation, but DocumentReference can NOT be used as input to an Observation. That is not a distinction.</p>",
        "id": 153997813,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537305515
    },
    {
        "content": "<p>I get the bodySite argument... no problem adding that to DocumentReference... etc... a few spare elements are not problematic as long as the use-case and scope are clear.</p>",
        "id": 153997814,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537305580
    },
    {
        "content": "<p>I already asked if it should be imagingStudy and was told not in scope...</p>",
        "id": 153997820,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537306785
    },
    {
        "content": "<p>So John wants to mush dr and media together. Lloyd syggests to reverse our multiple discussions and meetings about valueAttachment and put it back into observation.  (and get rid of Media sInce its not that apecIal after all?)</p>",
        "id": 153997823,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537307203
    },
    {
        "content": "<p>I'm fine with Media being made broader.  I'm fine with ValueAttachment coming back.  However, getting rid of valueAttachment and leaving Media tight means there's a lot of stuff we can't express anymore, and that's a problem.</p>",
        "id": 153997824,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537307305
    },
    {
        "content": "<p>I am still stuck on when an image file not an image.  A pdf is just a file format.  It could be a picture of my cat or my resume</p>",
        "id": 153997829,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537307535
    },
    {
        "content": "<p>So could a JPEG.  Though if it's your resume, I wouldn't expect a lot of job offers... ;)</p>",
        "id": 153997830,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537307584
    },
    {
        "content": "<p>:-)</p>",
        "id": 153997831,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537307604
    },
    {
        "content": "<p>What I liked about what gg said is that if there is a Dixon format it should flow through an imagingStudy like resource</p>",
        "id": 153997835,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537307782
    },
    {
        "content": "<p>Although i understand <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  's reason that all binaries can be viewed as media so valueAttachment is obsolete i am with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  that not every media is actually video or photo. Making media semantics more loose to accept other types of blobs would solve the issue (although several fields are not applicable for all non video/photo blobs e.g. Media.view or Media.bodySite) . Also keeping valueAttachment with comment to avoid using for videos or photos could solve the problem.</p>",
        "id": 153998018,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1537344433
    },
    {
        "content": "<p>And I am happy with the model as it is today with <code>derivedFrom</code> supporting DocumentReference, ImagingStudy, Media, Sequence, QuestionnaireResponse, and other Observations. This seems most logical to me. All of these could be source material for -this- Observation.</p>",
        "id": 153998061,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537361945
    },
    {
        "content": "<p>I would indeed like to see Media and DocumentReference resolved. Either more clear separation, or merging.  Today they overlap too much. Yet there seems to be some unsaid reason why Media is preferred in Observation land over DocumentReference.</p>",
        "id": 153998062,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537362037
    },
    {
        "content": "<p>I will agree with the text found currently in Observation regarding use of Media, DocumentReference, and ImagingStudy. It seems evenhanded.  I guess it might be useful to mention PDF is the boundary where move to DocumentReference over Media is appropriate. Overall I would like the community to help by reviewing these all and help add clarity based on what we all know, as new readers don't know what we know.</p>",
        "id": 153998064,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537362292
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> </p>\n<blockquote>\n<p>Nor do I think that Media should be made more generic</p>\n</blockquote>\n<p>Why not ?  I</p>\n<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>   <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>   can we talk about expanding the scope of Media  at the WGM.  <span class=\"user-mention\" data-user-id=\"196809\">@Vassilis Kilintzis</span>   will you be available too and can you send an actual example file so we can see your use case?</p>",
        "id": 153998234,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537373815
    },
    {
        "content": "<p>If by expanding the Scope of Media, you are considering how DocumentReference factors in... YES   I am not clear what expanding of Media you are pursuing? Are you considering existing DocumentReference?</p>",
        "id": 153998325,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537381229
    },
    {
        "content": "<p>DocumentReference is appropriate if what you're pointing to is actually a document and you don't need any Observation-specific metadata, such as what device was used, what method was used, etc. to capture the data represented by the blob.  But DocumentReference wouldn't be appropriate when you need that sort of Observation metadata or when the blob you're pointing to isn't actually a document.</p>",
        "id": 153998339,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537382890
    },
    {
        "content": "<blockquote>\n<p>DocumentReference is appropriate if what you're pointing to is actually a document and you don't need any Observation-specific metadata, such as what device was used, what method was used, etc. to capture the data represented by the blob.  But DocumentReference wouldn't be appropriate when you need that sort of Observation metadata or when the blob you're pointing to isn't actually a document.</p>\n</blockquote>\n<p>100% agree, that is the source of the problem upon which i created this thread.<br>\n<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  where can i find details about WGM to see if i can manage.  The scenario of use i have explained earlier, i will try to find an actual example and send it.</p>",
        "id": 153998478,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1537423243
    },
    {
        "content": "<p>Hello everyone,<br>\nI take advantage of this thread.<br>\nI have to upload a vector pdf of a multiple-lead ECG, captured by a mobility device.<br>\nWhat would be the best way to do it directly through FHIR STU3 then?</p>",
        "id": 153998501,
        "sender_full_name": "Mariano Garuz",
        "timestamp": 1537436124
    },
    {
        "content": "<blockquote>\n<p>Hello everyone,<br>\nI take advantage of this thread.<br>\nI have to upload a vector pdf of a multiple-lead ECG, captured by a mobility device.<br>\nWhat would be the best way to do it directly through FHIR STU3 then?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"196877\">@Mariano Garuz</span>  To me, for STU3, the answer is clear  \"valueAttachment\" , it is a binary file with specific mime type that it is not just a document but the actual observation of ECG.</p>",
        "id": 153998511,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1537440738
    },
    {
        "content": "<blockquote>\n<p>Hello everyone,<br>\nI take advantage of this thread.<br>\nI have to upload a vector pdf of a multiple-lead ECG, captured by a mobility device.<br>\nWhat would be the best way to do it directly through FHIR STU3 then?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"196877\">@Mariano Garuz</span> Given STU3, Observation.valueAttachment is your only choice. However you see the spec has evolved based on community comments so that your use-case in R4 (ballot)be Observation.derivedFrom pointing at DocumentReference pointing at Binary with your PDF. This change between STU3 and current is the crux of the discussion in this thread. I think the argument is what goes into the .value element to be the primary observation in this case.  .derivedFrom is a good element, with good flexibility. The hope is that one can extract out useful elements from the PDF to fill sufficient elements in Observation so that one has a useful Observation.</p>",
        "id": 153998532,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537445901
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is this your point? Where the 99% of the observation is in a PDF and will not be extracted out into useful elements in the Observation (such as this PDF of the ECG)?  In this case I would agree it does seem odd to have a Observation that is mostly empty except for a category, code, and derivedFrom; that points at a DocumentReference that points at a PDF. Where interpretation is extracted and the Observation is more a coded extract of the PDF, this feels less bulky. But I would agree that if the Observation is minimally populated, this is messy. My first point is that it should not be disallowed, which I understood you to be saying. That said, this does seem to argue for valueAttachment for specific use-cases.</p>",
        "id": 153998552,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537447286
    },
    {
        "content": "<p>This was discussed a year ago  - and it was decided to go with Media and not both.    I propose that we have actual use cases  (vs hypothetical)  on the table at the WGM  so we can what  our options are.</p>",
        "id": 153998620,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537454835
    },
    {
        "content": "<p>I'm fine with using Media - but if we're going to do that, Media needs to be broader.  Usecases already on the table include ECGs and genomics data.</p>",
        "id": 153998624,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537454946
    },
    {
        "content": "<blockquote>\n<p>This was discussed a year ago  - and it was decided to go with Media and not both.    I propose that we have actual use cases  (vs hypothetical)  on the table at the WGM  so we can what  our options are.</p>\n</blockquote>\n<p>What was discussed? What was concluded?   There have been many things discussed on this thread.    <br>\nthe elimination of valueAttachment has no obvious replacement except for derivedFrom. I have expressed how that is not a reasonable replacement.</p>",
        "id": 153998714,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537468506
    },
    {
        "content": "<p>the use-case is specifically where the attachment 'is' the observation. There is no observation derived from the attachment.</p>",
        "id": 153998715,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537468567
    },
    {
        "content": "<p>I have penciled this topic into the OO's Wed Q2 Quarter which is a OO/II and others joint session.</p>",
        "id": 153998788,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537482874
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>   as I recall we had joint OO/II meetings where  you were present.</p>",
        "id": 153998789,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537482959
    },
    {
        "content": "<blockquote>\n<p>I would expect that where valueAttachment felt like the right thing that it would be better to put that attachment into a DocumentReference or Media... and use Observation.derivedFrom.</p>\n</blockquote>\n<p>I can follow that idea, but derived from has a different semantic meaning than putting in Binarys or links to them directly into valueAttachment.</p>",
        "id": 153998938,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537520822
    },
    {
        "content": "<p>yes, I eventually came to that conclusion too. Seems we need valueAttachment, with clear scope that it is for when the attachment 'is the observation'. Or have something like valueReference that can point at Media, DocumentReference, ImagingStudy, or Sequence.</p>",
        "id": 153998968,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537533961
    },
    {
        "content": "<p>Nm</p>",
        "id": 153999047,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537546457
    },
    {
        "content": "<p>Why don’t we make John the OO editor?</p>",
        "id": 153999049,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537546696
    },
    {
        "content": "<p>OO made the decision to drop valueAttachment with the presumption that Media would handle all of those cases.  But they didn't open up Media to handle all the cases that valueAttachment supported.  At this point, reverting the valueAttachment isn't possible without yanking Observation from Normative for R4.  So that leaves two choices - add an equivalent of valueAttachment as an extension or expand the scope of Media.</p>",
        "id": 153999060,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537548517
    },
    {
        "content": "<p>added <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemBrowse&amp;feedback=Successfully+added+%5B%2318216%5D&amp;tracker_id=677\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemBrowse&amp;feedback=Successfully+added+%5B%2318216%5D&amp;tracker_id=677\">GF#18216</a></p>",
        "id": 153999454,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537804405
    },
    {
        "content": "<p>from what i read,I am more in favour of expanding media. My use case is recording of a procedure. Not the outcome or observation, but the procedure itself.</p>",
        "id": 154003572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538389340
    },
    {
        "content": "<p>so I need a place to put mostly videos. Media should cover that. But the other stuff that we will have may not fit in DR or</p>",
        "id": 154003573,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538389409
    },
    {
        "content": "<p>observation</p>",
        "id": 154003574,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538389414
    },
    {
        "content": "<blockquote>\n<p>OO made the decision to drop valueAttachment with the presumption that Media would handle all of those cases.  But they didn't open up Media to handle all the cases that valueAttachment supported.  At this point, reverting the valueAttachment isn't possible without yanking Observation from Normative for R4.  So that leaves two choices - add an equivalent of valueAttachment as an extension or expand the scope of Media.</p>\n</blockquote>\n<p>after giving the issue some thought i would be in favor of opening the scope of Media.</p>",
        "id": 154023680,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1544170745
    },
    {
        "content": "<p>DocumentReference fits this very nicely. What is it that doesn't fit?  I am continually frustrated at the growing overlap without a distinction between Media and DocumentReference. I am sure most of this is caused by the names of the two resources; as their normative scope and usage are clear and distinct.</p>",
        "id": 154023741,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544191784
    },
    {
        "content": "<p>I believe there is a plan for a valueAttachment extension on observation to address some of those use cases. <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ? (I agree that there is confusion about Media/DocumentReference.)</p>",
        "id": 154023758,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1544202898
    },
    {
        "content": "<p>I don’t know the solution but adding attachment back to Observation doesn’t solve the problem. if we reverse course and go with valueAttachment then Media is superfluous and docref overlaps observation.   I personally would like to see docref renamed too.</p>",
        "id": 154023849,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544239174
    },
    {
        "content": "<p>DocumentReference has major issues.  The name does not reflect its ever-evolving scope.  I do however think there's a major difference between an \"indexing\" resource (which is what DocumentReference is) and an Observation - which is a point-in-time statement.  DocumentReference should always be a reference to a something.  We still need a resource for the \"something\" when we're talking about a complex observation that's not media.</p>",
        "id": 154024330,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544493428
    },
    {
        "content": "<blockquote>\n<p>DocumentReference has major issues.  The name does not reflect its ever-evolving scope.  I do however think there's a major difference between an \"indexing\" resource (which is what DocumentReference is) and an Observation - which is a point-in-time statement.  DocumentReference should always be a reference to a something.  We still need a resource for the \"something\" when we're talking about a complex observation that's not media.</p>\n</blockquote>\n<p>I very much agree... so when can we get this discussion going?</p>",
        "id": 154024420,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544538005
    },
    {
        "content": "<p>I think it is going... :)  I'd like DocumentReference to be renamed to be a general \"index\" resource.  But it also means that doing things like using DocumentReference as the primary way to represent a clinical note is problematic.</p>",
        "id": 154024448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544544396
    },
    {
        "content": "<blockquote>\n<p>We still need a resource for the \"something\" when we're talking about a complex observation that's not media.</p>\n</blockquote>",
        "id": 154024495,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544551111
    },
    {
        "content": "<p>what do you mean by this?  a new Observation resource for things not covered by the old Observation resource and Media?</p>",
        "id": 154024496,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544551213
    },
    {
        "content": "<blockquote>\n<p>But it also means that doing things like using DocumentReference as the primary way to represent a clinical note is problematic.</p>\n</blockquote>\n<p>I think using DocumentReference as the primary way to represent a clinical note <em>is</em> problematic. I would much rather see clinical notes in a new resource or supported in DiagnosticReport (possibly renamed and with a modified scope).</p>",
        "id": 154024904,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1544635831
    },
    {
        "content": "<p>I still think that Composition may work for clinical notes (many or most of them), too.</p>",
        "id": 154025170,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1544668608
    },
    {
        "content": "<p>Composition is a grouper - it's like MessageHeader.  It doesn't generally stand on its own.</p>",
        "id": 154025171,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544668740
    },
    {
        "content": "<p>Though I guess I prefer it to DocumentReference</p>",
        "id": 154025172,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544668756
    },
    {
        "content": "<p>Yeah, we've certainly discussed that before.  The way it's documented doesn't limit it to being <strong>exclusively</strong> a grouper (in my opinion) - the second sentence describes it as \"A Composition defines the structure and narrative content necessary for a document.\"  So at least there's some agreement about needing something other than DocumentReference.</p>",
        "id": 154025174,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1544669163
    },
    {
        "content": "<p>agreement where exactly? ... There is agreement among Argonaut vendors to use DR and DR.   So if implementers follow Argonaut and HL7 hims and haws over this during then next cycle ...  what direction do you think the implementation community is going to take?</p>",
        "id": 154025181,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544670031
    },
    {
        "content": "<p>ç'est un fait accompli   time to move on in my opinion</p>",
        "id": 154025182,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544670125
    },
    {
        "content": "<p>DocumentReference could be significantly revised in R5, so revisiting may be necessary.</p>",
        "id": 154025189,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544670392
    },
    {
        "content": "<p>The name of DocumentReference could be improved.</p>",
        "id": 154025385,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1544718537
    },
    {
        "content": "<p>I would like to see ONE resource that is metadata for Binary and other external resources.  Essentially anything that uses Attachment datatype should be looked at closely. Not to say there should not be uses of Attachment, but rather to evaluate if there is specific scope and bright difference between general metadata of Binary. Is this possibly another 'pattern' we should have? <br>\nAs to name... we need a better name. How about we keep Media, and merge in DocumentReference, so that Media is what survives and DocumentReference goes away?</p>",
        "id": 154025387,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544720595
    },
    {
        "content": "<p>I'm fine with that notion.  Though \"metadata for binary\" would clearly exclude clinical notes as part of the scope - which means we'd need to find a more appropriate home.</p>",
        "id": 154025388,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544721176
    },
    {
        "content": "<p>Well, changing documentReference to 'Metadata for binary' may be a bit too far!</p>",
        "id": 154025392,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1544722401
    },
    {
        "content": "<p>reasonable... so what then is the clear definition of this thing that merges Media+DocumentReference? Do we also merge in Attachment? <br>\nAre there others from this list that are really general (clearly many are clearly distinct)?<br>\n    Attachment is used in the following places: RelatedArtifact, ProdCharacteristic, BodyStructure, Claim, ClaimResponse, Communication, CommunicationRequest, Consent, Contract, DiagnosticReport, DocumentReference, ExplanationOfBenefit, HealthcareService, Library, Media, Patient, Person, Practitioner, Questionnaire, QuestionnaireResponse, RelatedPerson, SubstanceNucleicAcid, SubstancePolymer, SubstanceProtein and SubstanceSpecification</p>",
        "id": 154025402,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544723349
    },
    {
        "content": "<p>none of those others look general... okay just needing to merge Media and DocumentReference</p>",
        "id": 154025403,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544723454
    },
    {
        "content": "<p>How about \"Attachment\" as the new resource name?</p>",
        "id": 154025404,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544723493
    },
    {
        "content": "<p>wow, that was all rather incoherent... sorry</p>",
        "id": 154025405,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544723674
    },
    {
        "content": "<p>Attachment is a data type.  There's lots of places where you'll want to have a binary where the relevant metadata is in the referencing resource.  My leaning would be BinaryMetadata - i.e. Extra/indexing information about a binary stored somewhere.</p>",
        "id": 154025406,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544724346
    },
    {
        "content": "<p>What about the indexing to a Composition?</p>",
        "id": 154025476,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1544736325
    },
    {
        "content": "<p>Notes could be stored in a lot of places, DocumentReference was selected becasue it provides a nice index to all the places</p>",
        "id": 154025477,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1544736380
    },
    {
        "content": "<blockquote>\n<p>Attachment is a data type.  There's lots of places where you'll want to have a binary where the relevant metadata is in the referencing resource.  My leaning would be BinaryMetadata - i.e. Extra/indexing information about a binary stored somewhere.</p>\n</blockquote>\n<p>Yeah, sorry.</p>",
        "id": 154025511,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544741916
    },
    {
        "content": "<p>Re: BinaryMetadata... Is it good to emphasize the 'binary' aspect? binary can contain anything... many people think of binary as in non-text... I am not arguing that the Binary resource needs to be changed. I am just saying that applying that word again to the metadata may be overkill and cause wrong impressions. That said, it likely would be more understood than \"DocumentReference\". <br>\nwe could get very informal \"Blob\"<br>\nor \"Appendix\", \"Extra\", \"Supplement\", \"Adjunct\", \"Auxiliary\", \"Ancillary\",</p>",
        "id": 154025512,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544741965
    },
    {
        "content": "<p>I like ValueAttachment</p>",
        "id": 154025589,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544760318
    },
    {
        "content": "<p>NoteGetter !!</p>",
        "id": 154025590,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544760363
    },
    {
        "content": "<p>(kidding)</p>",
        "id": 154025591,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544760376
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>: <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span>, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> and I have prepared a proposal for merging Media into DocumentReference, and adding Observation.valueAttachment. We've also provided some feedback on your skinny media proposal, <a href=\"https://docs.google.com/presentation/d/1FBbnMKqF6WUv4iDpJuwqrwfqMcxLLpiYaQNg-3otXkc/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/presentation/d/1FBbnMKqF6WUv4iDpJuwqrwfqMcxLLpiYaQNg-3otXkc/edit?usp=sharing\">https://docs.google.com/presentation/d/1FBbnMKqF6WUv4iDpJuwqrwfqMcxLLpiYaQNg-3otXkc/edit?usp=sharing</a>, and some comments on the (still limited) set of use cases, <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=40735720\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/viewpage.action?pageId=40735720\">https://confluence.hl7.org/pages/viewpage.action?pageId=40735720</a>. <br>\nI will attempt to join the O&amp;O on FHIR call tomorrow.</p>",
        "id": 157573192,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1549329972
    },
    {
        "content": "<p>I am not a huge fan of skinny media option,  but wanted to put it out there.</p>",
        "id": 157573238,
        "sender_full_name": "Eric Haas",
        "timestamp": 1549330071
    },
    {
        "content": "<p>In case it's of interest, I just described another related use case for Media (or Observation.valueAttachment, or DocumentReference) at <a href=\"#narrow/stream/179222-finnish-PHR/topic/NutritionIntake/near/157592099\" title=\"#narrow/stream/179222-finnish-PHR/topic/NutritionIntake/near/157592099\">https://chat.fhir.org/#narrow/stream/179222-finnish-PHR/topic/NutritionIntake/near/157592099</a>. <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span></p>",
        "id": 157684786,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1549455028
    },
    {
        "content": "<p>That is indeed a good use-case for DocumentReference. That DocumentReference and image could be used as evidence for an Observation. Most likely as derivedFrom, and would not likely be that the image itself that is considered an observation (valueAttachment). This seems the way you have described it. Right?</p>",
        "id": 157690329,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549460449
    },
    {
        "content": "<p>Pretty much, although I used the Media resource in the original proposal. I did have hard time choosing, though.</p>",
        "id": 157698556,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1549467082
    }
]