[
    {
        "content": "<p>I know the R4 ballot comments are supposed to only apply to changes made... but I have a concern about the current Observation.comment field. The workflow pattern would normally dictate that it be called \"note\" and  be 0..* as well as of type \"Annotation\"</p>\n<p>We have a gforge that was submitted previously about this... and it seems like we would want to change something like this/make sure it was in alignment with the common standards before normative?</p>",
        "id": 153997613,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537281860
    },
    {
        "content": "<p>It was made different on purpose.  With things like an allergy, the expectation is that different people might make comments about the element over time (and thus need the who/when/what aspect of Annotation).  That's done to capture different opinions about the resource as time goes on (and possibly the patient's situation evolves).  It was deemed that that doesn't generally happen for things like a blood pressure reading or lab result.  So Observation just makes allowance for a single freeform comment by the author of the result.  As such, the who and when are already specified elsewhere.  There's an event-note extension defined to support the ability to make comments <em>about</em> a result once it's complete.  If you disagree and feel that capability falls within the 80% for Observation, you can certainly submit a negative vote.  If the work group agrees with the additional evidence you supply, it can yank Observation from normative and migrate the extension into core.  But it'd have to be pretty convincing evidence at this stage.</p>",
        "id": 153997616,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537282750
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17576\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17576\">GF#17576</a> has additional discussion in gForge</p>",
        "id": 153997637,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1537285761
    },
    {
        "content": "<p>This is slated for discussion and looking forward to it.    A couple of things:</p>\n<ul>\n<li>I don't think that NOT following the event pattern is a valid argument since they are <em>quidelines</em> rather that requirements.  (... and... are  less mature than Observatio and have been known to change)</li>\n<li>My argument has been that comment is about the result ( which lloyd articulated better that I have) the event-note extension is about the Obervation  ( i.e. the name - value pair resource as a whole)  But is that a solid argument since the boundaries between can be hard to iron out and does that distinction matter   in the real world?</li>\n<li>If we need more out of .comment then its <a href=\"https://www.google.com/imgres?imgurl=https%3A%2F%2Fwww.denverpost.com%2Fwp-content%2Fuploads%2F2017%2F02%2Fgroundhog_day_001.jpg%3Fw%3D620&amp;imgrefurl=https%3A%2F%2Fwww.denverpost.com%2F2017%2F02%2F02%2Fphotos-groundhog-day-2017%2F&amp;docid=6fpyAtP6Y4AqgM&amp;tbnid=NewlMF-vQi8MXM%3A&amp;vet=10ahUKEwj6orXJgMXdAhWXHzQIHaQcAKgQMwjoASgEMAQ..i&amp;w=620&amp;h=414&amp;bih=718&amp;biw=1309&amp;q=Groundhog%20Day&amp;ved=0ahUKEwj6orXJgMXdAhWXHzQIHaQcAKgQMwjoASgEMAQ&amp;iact=mrc&amp;uact=8\" target=\"_blank\" title=\"https://www.google.com/imgres?imgurl=https%3A%2F%2Fwww.denverpost.com%2Fwp-content%2Fuploads%2F2017%2F02%2Fgroundhog_day_001.jpg%3Fw%3D620&amp;imgrefurl=https%3A%2F%2Fwww.denverpost.com%2F2017%2F02%2F02%2Fphotos-groundhog-day-2017%2F&amp;docid=6fpyAtP6Y4AqgM&amp;tbnid=NewlMF-vQi8MXM%3A&amp;vet=10ahUKEwj6orXJgMXdAhWXHzQIHaQcAKgQMwjoASgEMAQ..i&amp;w=620&amp;h=414&amp;bih=718&amp;biw=1309&amp;q=Groundhog%20Day&amp;ved=0ahUKEwj6orXJgMXdAhWXHzQIHaQcAKgQMwjoASgEMAQ&amp;iact=mrc&amp;uact=8\">GroundHog Day</a></li>\n</ul>",
        "id": 153997653,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537289130
    },
    {
        "content": "<p>I think \"comment\" is typically about the result, but it could also be about the performance of the Observation.  \"E.g. Ran this a day later than planned because child wouldn't let me get a vein when initially scheduled\".  I think Annotations can also cover both event and what was found.  (Those who capture comments aren't that great about semantic boundaries of what they can and can't comment on :&gt;)  I think the big thing here is \"how typical is it for systems to support someone other than the reporter to later adding notes to an Observation?\"  OO's answer to this point has been \"not common\".  And that answer is a perfectly fine reason to diverge from the pattern.  (And it's not even really a divergence - the element is there, just as an extension.)</p>",
        "id": 153997656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537289792
    }
]