[
    {
        "content": "<p>Is it valid to return an Observation having an unknown code in <code>.valueCodeableConcept</code> because the observation has not been performed?  At least, I would also expect something in the <code>.dataAbsentReason</code>. I am however doubting if this is valid/usefull.</p>",
        "id": 258673788,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634887630
    },
    {
        "content": "<p>Moreover, I am missing something like a status field <em>not-done</em>. I don't think the <code>Observation.status</code>  have proper codes for the not performed Observation. </p>\n<p>Or do you argue that at the moment of the request, the Observation is made that there is no known value and thus the Observation.status = <em>final</em></p>",
        "id": 258674137,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634887854
    },
    {
        "content": "<p>Probably <code>status =cancelled</code>?</p>",
        "id": 258674197,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1634887903
    },
    {
        "content": "<p>Perhaps more fitting, but I am still not completely sure it is the right match</p>",
        "id": 258674342,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634887972
    },
    {
        "content": "<p>But is this common practice? Or even allowed?<br>\nIt looks like USCDI describes this method, having the <em>'266927001   Unknown if ever smoked'</em> <a href=\"http://hl7.org/fhir/us/core/2017Jan/ValueSet-us-core-observation-ccdasmokingstatus.html\">http://hl7.org/fhir/us/core/2017Jan/ValueSet-us-core-observation-ccdasmokingstatus.html</a></p>",
        "id": 258674696,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634888219
    },
    {
        "content": "<p>Or set dataAbsentReason = not-performed. <br>\nI think that's better than saying it in value[x]. <br>\nThough I am not 100% sure.</p>",
        "id": 258674753,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1634888265
    },
    {
        "content": "<p>I agree on that, using the dataAbsentReason</p>",
        "id": 258674857,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634888322
    },
    {
        "content": "<p>Depends on what you want to say. If you want to say \"I don't know anything about ... (anamnesis to former behavior or preexisting conditions)\", you can say this in a a code or in dataAbsentReason. <br>\nIf you want to say something like: \"I don't know the current concentration of blood alcohol, because the observation was not performed\", I think it's better to use dataAbsentReason.</p>",
        "id": 258675199,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1634888597
    },
    {
        "content": "<p>Or you can just <strong>not</strong> generate an Observation and return an empty searhset bundle. Indicating that no Observation exists for that requested Observation code/category ect.</p>",
        "id": 258675853,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634889084
    },
    {
        "content": "<p>Moreover, would including an OperationOutcome not be more appropriate to explicitly indicate you don't have any results for a certain type of Observation?</p>",
        "id": 258700728,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634903756
    },
    {
        "content": "<p>hi Ardon, there is a difference between not generating an Observation and an Observation that says something was not performed. So I don't think not generating one will convey the positive knowledge that something didn't happen. If you know the question is \"are there any of these done\" and the answer comes back as \"zero\", then that works. But even then, what you are really saying is \"none were found\". A positive statement that is was not done, at that time, (if you know that to be true) is more information and will be useful when anyone looks at the record.<br>\nOperationOutcome is not really used outside of the actual communication channel - \"OperationOutcome is not designed to be persisted or referenced from other parts of the workflow.\"</p>",
        "id": 258704177,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1634905694
    },
    {
        "content": "<p>Hi Rik! So potentially, you can answer any request with a bare-bone, generated, resource to indicate that the Observation's value is unknown? <br>\nRegarding the US core smokingstatus profile: wouldn't it for example be an improvement to have a constraint like vital signs (\"if there is no a value a data absent reason must be present\") to indicate that the smoking status is unknown? Instead of making <code>Observation.valueCodeableConcept</code> mandatory?</p>",
        "id": 258705762,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634906556
    },
    {
        "content": "<p>Or does the <em>'266927001 Unknown if ever smoked</em>' actually mean that the an observation has been made/performed with the patient, but the patient does not recall if the patient has even smoked?</p>",
        "id": 258705990,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634906669
    },
    {
        "content": "<p>According to US Core <a href=\"http://hl7.org/fhir/us/core/general-guidance.html#missing-data\">Missing Data Guidance</a>:</p>\n<blockquote>\n<p>For coded data elements:</p>\n<div class=\"codehilite\"><pre><span></span><code>example, preferred, or extensible binding strengths (CodeableConcept datatypes):\n    if the source systems has text but no coded data, only the text element is used.\n    if there is neither text or coded data:\n        use the appropriate “unknown” concept code from the value set if available\n        if the value set does not have the appropriate “unknown” concept code, use unknown from the DataAbsentReason Code System.\n</code></pre></div>\n\n</blockquote>",
        "id": 258721149,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1634913718
    },
    {
        "content": "<p>I think it's fine - in general - to have an Observation that is in process and doesn't have either a value or a dataAbsentReason.  It would be bad practice to have a value and then have an extension that says \"but I don't really have one\".  It's just that your Observation instance wouldn't comply with US Core - because US Core doesn't typically care about \"in-progress\" observations.</p>",
        "id": 258744392,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634923522
    },
    {
        "content": "<p>Thnx Yunwei for the missing data guidance, interesting stuff. </p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, I can follow the reasoning for Observations that are <strong>in process</strong> . I am more interested in the situation where no observation/measurements, by a health professional, have been made about someone's smoking status (or allergy intolerances etc). The observation is not in process then. Should the system, according to USCDI (or even FHIR), explicitly generate clinical related resources indicating the relevant values are unknown upon a search?  </p>\n<p>In my opinion, most resources are not particularly well modelled for that, one example would be the status values of Observation. Moreover, I don't think it is necessary to explicitly generate a clinical related resource for this.  </p>\n<p>If I am a client and retrieve the US core smoking status resource with an <em>Unkown if every smoked</em> value, I expect the healthcare provider at least made an observation or tried to get the smoking status from the patient or a relatedperson. It is then possible to use the <em>final</em> status and potentially fill performer ect.</p>",
        "id": 258940011,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1635157325
    },
    {
        "content": "<p>If you're 'supposed' to make an observation but get no  data, then you can have an Observation with a data-absent reason of not-performed.  I guess the question is whether there are legitimate reasons to say \"you're supposed to observe smoking information\" - if there is, then I agree that 'value' shouldn't be mandatory.</p>",
        "id": 258964638,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635171156
    },
    {
        "content": "<p>+1 to this on Allergy - we might not know the severity of an allergy but require the severity (and unknown is not a viable option).</p>",
        "id": 259321840,
        "sender_full_name": "Vivian Neilley",
        "timestamp": 1635378081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"311758\">@Vivian Neilley</span> - criticality is the appropriate property in the AllergyIntolerance Resource and that can be populated with 'unable-to-assess' or not completed at all. Severity is a property of an associated reaction and that is not a mandatory element either.</p>",
        "id": 259330986,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1635386438
    }
]