[
    {
        "content": "<p>Does anybody have any idea as to when the OccupationalData resource will be formally available (and therefore present on Forge and ClinFHIR)?  Many thanks.</p>",
        "id": 153995884,
        "sender_full_name": "Jon Behr",
        "timestamp": 1536695363
    },
    {
        "content": "<p>The resource has been retired and replaced with profiles on Observation and other resources</p>",
        "id": 153995885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536695465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks will investigate those further</p>",
        "id": 153995886,
        "sender_full_name": "Jon Behr",
        "timestamp": 1536695606
    },
    {
        "content": "<p>Oh wait, I misunderstood (thought you meant the elements were available amongst other resources). According to the Scope and Usage, it says \"This content is preliminary and has not yet undergone proper review by the appropriate Workgroups.\" But, if as you say, this has been retired, what would be the best approach to defining detailed employment history and role definition?</p>",
        "id": 153995889,
        "sender_full_name": "Jon Behr",
        "timestamp": 1536696140
    },
    {
        "content": "<p>There's an implementation guide for this purpose here: <a href=\"http://hl7.org/fhir/us/odh/2018Sep/\" target=\"_blank\" title=\"http://hl7.org/fhir/us/odh/2018Sep/\">http://hl7.org/fhir/us/odh/2018Sep/</a></p>",
        "id": 153995892,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536696259
    },
    {
        "content": "<blockquote>\n<p>Excuse my ignorance - does this mean the occupationalData will only available as a resource to use in the US? The elements within it look laregly transferable (am UK based).</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"196816\">@Jon Behr</span> The OccupationalData resource won't be available for use anywhere.  It was a proposed resource that has been removed.  It will not be in any official FHIR release.  The OccupationalData implementation guide has been balloted as U.S. specific because the project that's driving it was U.S. sponsored and we didn't have others at the table.  If there's international interest, a generified version (without U.S.-specific bindings and rules) could be published, with the U.S.-specific IG defined as a subset.  Ideally we'd want at least 2-3 other countries at the table for that.</p>",
        "id": 153996246,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536761935
    },
    {
        "content": "<p>Yes.  I created the original draft resource working with the ODH team, but that's now been replaced with the ODH <a href=\"http://hl7.org/fhir/us/odh/2018Sep/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/odh/2018Sep/index.html\">profile/IG</a>, as Lloyd says.</p>",
        "id": 153996255,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536762382
    },
    {
        "content": "<p>Thanks for the clarification <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  -   I represent an occupational health company in the UK and we would certainly have an interest in utilising such a resource.  I'm sure others would too.</p>",
        "id": 153996256,
        "sender_full_name": "Jon Behr",
        "timestamp": 1536762549
    },
    {
        "content": "<p>Any other (non-US) participants want to throw their hat in the ring?</p>",
        "id": 153996257,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536762617
    }
]