[
    {
        "content": "<p>The ODH (Occupational Data for Health) team and PHWG would like to get feedback from the implementer community regarding the extent that you currently capture or plan to capture occupational health data and how you do that (or plan to).  If you're not entirely sure what this includes, the draft <a href=\"http://build.fhir.org/occupationaldata.html\" target=\"_blank\" title=\"http://build.fhir.org/occupationaldata.html\">OccupationalData</a> resource may help give an idea.  It's been in the build as draft for the January and May cycles and some helpful comments have been received, but it would be good to get a broader idea of what the community would like to see going forward in this regard for FHIR.  The main options are to progress the resource further or to instead represent the data as a profile (primarily on Observation).  We want to answer the question of whether this this data is or is intended to be treated as somewhat independent and unique in regard to other types of observations and whether it should typically be recorded and kept together (leaning toward a resource) or whether much of it may be recorded and collected and used independently (leaning toward a profile).</p>",
        "id": 153966691,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1528126043
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"194474\">@George Dixon</span> <span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span> <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> <span class=\"user-mention\" data-user-id=\"191859\">@Amit Popat</span> ?</p>",
        "id": 153967061,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1528208012
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 153967063,
        "sender_full_name": "lori fourquet",
        "timestamp": 1528208309
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192231\">@Galen Mulrooney</span> ?</p>",
        "id": 153967065,
        "sender_full_name": "lori fourquet",
        "timestamp": 1528208695
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span></p>",
        "id": 153967068,
        "sender_full_name": "lori fourquet",
        "timestamp": 1528208897
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> ?</p>",
        "id": 153967070,
        "sender_full_name": "lori fourquet",
        "timestamp": 1528209139
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191485\">@Ron Shapiro</span> ?</p>",
        "id": 153967071,
        "sender_full_name": "lori fourquet",
        "timestamp": 1528209166
    },
    {
        "content": "<p>I would lean towards a resource rather than a profile, as there are use cases where one would want to query occupational data across patients (i.e., select everyone who has been working in the shipbuilding industry). While recognizing that profiles on observations are useful - especially where certain kinds of information are not captured uniformly for every patient (i.e., I've modeled (chromosomal) sex as an observation because it's a clinical test that is only done on some persons , while administrative gender is an attribute of every person), occupational history is relatively uniform (even across jurisdictions) and lends itself to a resource (and those who don't need it don't have to instantiate it).  My $.02 anyway.</p>",
        "id": 153967077,
        "sender_full_name": "Galen Mulrooney",
        "timestamp": 1528210788
    },
    {
        "content": "<p>The question isn't \"what we might want\", but \"how do systems currently store this information\".</p>",
        "id": 153967085,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528211552
    },
    {
        "content": "<p>I have way too limited experience. But if I put my Privacy hat on, and Privacy does apply to employment data just as much as it does health data... It seems this might be more controllable as a Resource than a profile on Observation.  We must have good controls on Observation, so this is not a really strong argument. However the data captured here is so very different than typical Health observations that it just feels wrong. So, give my vote very low weight, I vote for Resource.   -- I look forward to EHR vendors perspective, and VHA perspective (where it is more convoluted).</p>",
        "id": 153967106,
        "sender_full_name": "John Moehrke",
        "timestamp": 1528212963
    },
    {
        "content": "<p>Most of my feedback on this topic has been documented in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14465\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14465\">GF#14465</a> already</p>\n<p>To summarize:</p>\n<ul>\n<li>\n<p>Observation includes Social History, so we expose a lot of occupational data using Observations, such as School/Employment Status (Employed | Retired | Unemployed | Part time | Student), Work hazards (Vibration | Hazardous materials | Heavy lifting/twisting | Loud noises | Medical/Clinical work | Repetitive motion | Shift/Night work), Hazardous equipment operation (Yes | No), Activity level work (Desk/Office | Heavy physical work | Moderate physical work | Occasional physical work), Military service (Yes | No), Branch of military ( Army | Navy | Airforce | U.S. Coast Guard | Marine Corps), Current military status(Active duty | Reserves | Veteran), Military discharge (Honorable | Dishonorable | Medical) etc.</p>\n</li>\n<li>\n<p>Employment-related demographics are also captured.  Examples of the employment demographics (not represented as Social History Observations) include: employer organization, occupation code, position, employee status (full time | part time | retired | military etc.), employment type (long term leave | short term leave), hire date, term date, retire date, title, a contact (of who could verify employment) as well as military base location, etc.</p>\n</li>\n</ul>",
        "id": 153967892,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1528402995
    },
    {
        "content": "<p>Good summary. What is described under social is typically captured as charted observations. This can vary by client and specialty configuration. <br>\nWhat is captured under employment is standard and rarely altered configuration. </p>\n<p>Probably not all that helpful but it depends. </p>\n<p>Pls forgive any fat finger typos, Zulip and phone ...</p>\n<blockquote>\n<p>Most of my feedback on this topic has been documented in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14465\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14465\">GF#14465</a> already</p>\n<p>To summarize:<br>\n* Observation includes Social History, so we expose a lot of occupational data using Observations, such as School/Employment Status (Employed | ..... <br>\n* Employment-related demographics are also captured.  Examples of the employment demographics (not represented as Social History Observations) include: employer organization, occupation code, position, employee status ...</p>\n</blockquote>",
        "id": 153968673,
        "sender_full_name": "George Dixon",
        "timestamp": 1528808033
    },
    {
        "content": "<p>I lean completely towards profile of Observation.  Observations apply to assessment responses, diagnostic tests and other sorts of collected data.  We put these in the same context as we would any other sort of Social History observation, which fits into the same bucket in our database as diagnostic results.  Querying occupation data can be done on observation using category fields, as well as value sets (which our product does support).  Much of Social history collected for a patient follows the same pattern as occupational data.</p>",
        "id": 153974472,
        "sender_full_name": "Keith Boone",
        "timestamp": 1531237456
    },
    {
        "content": "<p>If this is not a new resource, where would the relationship between patient, employer, and information regarding that specific employment be captured?</p>",
        "id": 153975217,
        "sender_full_name": "Danielle Friend",
        "timestamp": 1531517627
    },
    {
        "content": "<p>I think the notion of \"Employment\" as a resource makes sense - one instance = one job.  That would mirror how this information would typically be captured in v2.  OccupationalData seems to be more of a reporting structure gathering a full employment history including a bunch of observation-like elements.  At least one of the challenges with the resource as structured is that it doesn't allow you to easily put different access controls on different parts of a patient's employment history.  Separating out each job gives you a clear status for the resource.</p>",
        "id": 153975221,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531519179
    },
    {
        "content": "<p>Hello!<br>\nWhat resource should we use to capture data about the employment and education of the patient?</p>\n<p>We're going to capture the following dataset:</p>\n<p><strong>Employment info</strong><br>\n- company name<br>\n- job title<br>\n- date of enrollment</p>\n<p><strong>Education info</strong><br>\n- level of education (incompleted, degree etc)<br>\n- educational organization<br>\n- dates of education (start &amp; end)</p>\n<p>Is it correct to capture the data about employment and education as observations (list + observations with category: “social history”)?</p>",
        "id": 160573356,
        "sender_full_name": "Mike Ryzhikov",
        "timestamp": 1552399959
    },
    {
        "content": "<p>Right now, our leaning is indeed to use Observations.</p>",
        "id": 160575524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552401450
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 160575533,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552401456
    },
    {
        "content": "<p>You can also look at the <a href=\"http://hl7.org/fhir/us/odh/2018Sep/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/odh/2018Sep/index.html\">ODH IG</a>.  It doesn't look like it currently includes everything that you want, but there's definitely overlap.</p>",
        "id": 160583940,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1552407200
    },
    {
        "content": "<p>That's the one Rob.</p>",
        "id": 160722399,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1552507313
    }
]