[
    {
        "content": "<p>Is anyone aware about the status of the official address extension ? (see <a href=\"https://jira.hl7.org/browse/FHIR-20743\">https://jira.hl7.org/browse/FHIR-20743</a>  and <a href=\"https://jira.hl7.org/browse/FHIR-25938\">https://jira.hl7.org/browse/FHIR-25938</a>)</p>\n<p>I'm asking this because we'd like to pre-adopt this extension for the Italian base address profile, but before doing that I'd like to understand:</p>\n<ul>\n<li>if it will become an official UV extension or not ; </li>\n<li>and in case what will be its ID (\"official-Address\" ? \"Address-official\" ? \"address-official\" ?)</li>\n</ul>",
        "id": 199024370,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1590673714
    },
    {
        "content": "<p>Otherwise we have to create another local extension that does exactly the same thing...  :-)</p>",
        "id": 199024541,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1590673808
    },
    {
        "content": "<p>The second won't likely be discussed until mid-June.  For the second, why isn't the absence of an 'official' extension enough to know something <em>isn't</em> an official extension?</p>",
        "id": 199027847,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590675408
    },
    {
        "content": "<p>there are several usage scenarios in which the address is captured without asking if it is the official address or not, because it is not relevant. The absence of this official-address flag doesn't imply therefore that that address could not be the official one (and in the 80% of the cases it is).</p>",
        "id": 199030588,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1590676639
    },
    {
        "content": "<p>in any case for what concern the possible pre-adoption, the intent for the IT address is to use for the time being only the boolean, so both discussed options could be fine. For that purpose I'd like to know if any of the two will be likely sooner or later adopted and in case what could be the extension id.</p>",
        "id": 199031135,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1590676874
    },
    {
        "content": "<p>The second one probably won't be talked about until mid to late June.  Once it's landed we could at least agree on the name, though don't know how quickly the proposed extension will make it into the CI build</p>",
        "id": 199031917,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590677190
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  are you aware about any decision about this extension (at least for the name ?)</p>",
        "id": 208216768,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1598535234
    },
    {
        "content": "<p>Not yet</p>",
        "id": 208225899,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598539343
    },
    {
        "content": "<p>Is there any plan ?</p>",
        "id": 208337679,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1598618965
    },
    {
        "content": "<p>In terms of applying the first, a lot of application tends to happen pretty close to ballot - and we're still finalizing timelines for that.  (Though someone can always volunteer to make the change and get it done sooner.)  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> Thoughts on when <a href=\"http://jira.hl7.org/browse/FHIR-25938\">FHIR#25938</a> will get tackled?</p>",
        "id": 208348077,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598624184
    }
]