[
    {
        "content": "<p>Canada is working on a policy document for identifier and code systems - what the URIs should be, what should be registered, where it should be registered, etc.  Most of the document is not Canadian-specific and may be of interest to others.  Feel free to add comments/provide feedback.  And don't be afraid to challenge assertions you think are out-to-lunch.  If there's general interest, we could also look at migrating this to a wiki page and potentially pointing to it from a future version of the FHIR spec.  <a href=\"https://docs.google.com/document/d/1ClF3XpIrE2FiIDG7K7VD3pPjOPx3T950Sfi1Ip8ORcU/edit#heading=h.641auhfi9fvs\" target=\"_blank\" title=\"https://docs.google.com/document/d/1ClF3XpIrE2FiIDG7K7VD3pPjOPx3T950Sfi1Ip8ORcU/edit#heading=h.641auhfi9fvs\">https://docs.google.com/document/d/1ClF3XpIrE2FiIDG7K7VD3pPjOPx3T950Sfi1Ip8ORcU/edit#heading=h.641auhfi9fvs</a></p>",
        "id": 153880630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490987023
    },
    {
        "content": "<p>This would actually make this topic a lot easier to navigate.  Thinking of my experience with the CDCREC codes was very ad hoc placing calls to CDC to try to find the right person etc and eventually using a URN since we ran out of time.  ...  But isn't there an HL7 project to address some of this stuff already?  I don't know where that has landed.</p>",
        "id": 153880659,
        "sender_full_name": "Eric Haas",
        "timestamp": 1491072939
    },
    {
        "content": "<p>I'm not aware of a project to deal with this.  If there is one, pretty sure it didn't come through MnM - which I would have expected.</p>",
        "id": 153880660,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491079227
    },
    {
        "content": "<p>I think this is a great idea, and will follow (and possibly comment) with interest...</p>",
        "id": 153880661,
        "sender_full_name": "David Hay",
        "timestamp": 1491091928
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> The document does not indicate that it is focused on Canada. What part is \"Canada-specific\"?</p>",
        "id": 153880671,
        "sender_full_name": "Robert McClure",
        "timestamp": 1491148629
    },
    {
        "content": "<p>Look for the section \"What should the root be/where to register\"</p>",
        "id": 153880673,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491150807
    },
    {
        "content": "<p>The short version of that for us is that we extended our OID Registry with a new column. Assumption is that if that is populated, it is then the preferred URI -- for FHIR. If a new system comes up (didn't happen so far), it shall also have an OID. The only reason for URIs instead of OIDs is readability (readability also is constant reason for debate... very deep sigh), so we try to be as readable as possible. If that makes for a lengthy URI, then so be it; we imposed no max so far.</p>",
        "id": 153880678,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1491166847
    },
    {
        "content": "<p>Interestingly enough system URIs turn out to be as resolvable as OIDs. If you don't register them properly in one or more recognized registries: you will not resolve them. A tiny error in the URI string can be just as killing as one in an OID.</p>",
        "id": 153880682,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1491168246
    },
    {
        "content": "<p>We'd want our URIs to be valid FHIR URLs, which imposes a limit of 64 characters on the \"id\" portion of the OID.  (Speaking of which, I should note that in the paper :))</p>",
        "id": 153880684,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491168561
    },
    {
        "content": "<p>The difference is that if you make a typo in an OID, you can end up with a \"valid\" OID, so even if you have checking to make sure that OIDs are \"legitimate\", the problem won't get caught.  That issue is much less likely (and much eaiser to detect) with URIs.  OIDs are never resolvable - looking something up in a registry isn't resolution.  URLs are resolvable by using the DNS system and hitting a server.  If you have to fall back to a registry, then there's no significant difference other than that FHIR registries are ususally RESTfully searchable.  OID registries, not so much - at least not historically.</p>",
        "id": 153880686,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491171146
    },
    {
        "content": "<p>OIDs were poorly registered in jurisdictions other than ours, true. Typos in our jurisdiction are always caught in the qualification process. We check every level and audit their implementation strategy.<br>\n.<br>\nThe net effect of a typo is that you cannot process that codesystem. Even in URIs it can be subtle. Would you know there's a typo in this one? <a href=\"https://referentiemodel.hng.org/tabellen/nhg-tabel-45-diagnostische-bepalingen\" target=\"_blank\" title=\"https://referentiemodel.hng.org/tabellen/nhg-tabel-45-diagnostische-bepalingen\">https://referentiemodel.hng.org/tabellen/nhg-tabel-45-diagnostische-bepalingen</a>. Identifiers is even more tricky, because it may go undetected for a longer period if the vendor makes a typo in setting the base at a new customer.<br>\n.<br>\nAnyway. The main point of the document is to stress what they are, how important it is you get them right, and what \"get them right\" means. I think it's a great initiative. I already added a number of comments that are hopefully helpful, and linked to it from our best practices wiki.</p>",
        "id": 153880711,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1491191237
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   I was thinking of the \"FHIR Repository Requirements Project\".  But that seems broader than this document.</p>",
        "id": 153880806,
        "sender_full_name": "Eric Haas",
        "timestamp": 1491237654
    },
    {
        "content": "<p>Yeah.  That's about what the registry should do.  This paper is more about what should be put in the registry.</p>",
        "id": 153880808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491239134
    }
]