[
    {
        "content": "<p>I am looking at an implementation guide where a summary document is being accessed through a FHIR API. The document is generated on the fly by an HIE type arrangement when the client requests a summary view of a set of data held by the HIE.</p>\n<p>The document is returned as a bundle that contains a composition, and a bunch of sections referring to other content. I have several questions from this:<br>\n- is IHE working on something like this?<br>\n- this would be an ettension on the $generate operation, yes?<br>\n- the composition that comes back, should it be identified? Should it have a version identifier?</p>",
        "id": 153875163,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488859449
    },
    {
        "content": "<p>What's the purpose of it being a document rather than just a bundle of related information?  Is there a value to instructing the recipient to consume the content in a particular order?</p>",
        "id": 153875165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488863753
    },
    {
        "content": "<p>it's not that important. It is a composition, and it's in a bundle. And it has a few propereries of documents - wholeness, integrity....</p>",
        "id": 153875178,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488872681
    },
    {
        "content": "<p>IHE had some discussions around medication lists. The idea was to send out a query \"give me medicationList, flavour=simplified, dates=last2months...\" the result would be a document of sorts.</p>",
        "id": 153875207,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488882829
    },
    {
        "content": "<p>It would be good to ask this question on the IHE stream...   IHE is not working on this topic, nor is it aware of the current solution. I was introduced to it a few weeks ago, and it looks interesting. I would agree that it is missing various capabilities/constraints that would make it more useful and align it better with what a source could do, and what a consumer might want. I thus think it might be a useful thing to have some trial-implementation investigate.</p>",
        "id": 153875224,
        "sender_full_name": "John Moehrke",
        "timestamp": 1488891455
    },
    {
        "content": "<p>My guess as to why a Document is the target is so that the consuming system gets some assurance of completeness, authenticability, context, stewardship, etc...  Where FHIR REST api is very helpful to get results, these additional attributes are not part of a REST contract. If this guess is indeed what is driving this operation, then it needs to be more clearly said. Else the server is simply assembling the same data into a potentially less easy package to manipulate, which I don't understand why a client would choose a document over a REST api in that case.</p>",
        "id": 153875225,
        "sender_full_name": "John Moehrke",
        "timestamp": 1488891735
    },
    {
        "content": "<p>Indeed, there is no active work item. Hopefully when we get there, we have some clarity from these discussions.  There is quite a difference between \"get me a medication list\" and \"get me the patient's medication data\". That was not clear at first, so we ended up putting the project on hold.</p>",
        "id": 153875230,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488895613
    },
    {
        "content": "<p>A $everything query response also has wholeness and integrity.  (And attestation too - if you think of the server as a device capable of attestation).  That doesn't make a query response a document.  </p>",
        "id": 153875252,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488911027
    }
]