[
    {
        "content": "<p>Hi,</p>\n<p>One of our source systems allows us to create generic roles. These are roles wherein one to many people can participate in, but typically not at the same time. These roles typically relate to being a member of a specific care team, but may be just part of the larger Organization (like a clinic). </p>\n<p>A role could be something like Code Blue Team Nurse 1, or Red Clinic Nurse 2.</p>\n<p>We have been looking at PractitionerRole, however PractitionerRole seems to be defined as a role for a singular Practitioner; whereas I would need to define a role that many different Practitioners can have. These roles are fairly permanent, and do not change from one patient/encounter to another. </p>\n<p>What would be the best resource for this?</p>\n<p>Thank you.</p>",
        "id": 182986101,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1575917066
    },
    {
        "content": "<p>What information do you want to record for a role other than a description of the role?<br>\nRole could be code.</p>",
        "id": 183024430,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1575947915
    },
    {
        "content": "<p>Are you interested in 'role' (which is a capacity a person has, independent of what they do) or a 'participation' - a specific function the individual has within a team?  It sounds like you want the latter, which would be captured using CareTeam.</p>",
        "id": 183057629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575983609
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I feel like it's a combination of the two, both role and participation. For the role aspect, this would be PractitionerRole, correct?</p>",
        "id": 183172534,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1576080809
    },
    {
        "content": "<p>Yes</p>",
        "id": 183174647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576082064
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 183174678,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1576082095
    }
]