[
    {
        "content": "<p>Hi all, <span class=\"user-mention\" data-user-id=\"191660\">@Harold Solbrig</span> recommended I reach out. I advise a nonprofit that does telehealth delivery in rural India, Kyrgyzstan, Syria (<a href=\"http://intelehealth.org\">intelehealth.org</a>). </p>\n<p>The biggest pain point for their community health workers is manual data entry - they currently write heart rate, blood pressure, height, weight, etc on paper and then enter it into an Android app that is compatible with FHIR or other interoperable formats -- I am currently screening vendors for devices and EHRs. </p>\n<p>Do you have an example of commodity sensors (e.g. pulse oximeter, blood pressure monitor, heart rate, other vitals) that are integrated into <a href=\"http://openmrs.org\">openmrs.org</a> (what the NGO runs) or another open source EHR compatible with FHIR? </p>\n<p>Thanks! Feel free to forward if you know someone appropriate who I might chat with about this, as it would improve efficiency significantly in these low-resource community health settings.<br>\nJaan</p>",
        "id": 273714162,
        "sender_full_name": "Jaan Altosaar",
        "timestamp": 1646170523
    },
    {
        "content": "<p>Hopefully someone can come along and give a better answer. <br>\nI know there are consumer-grade personal health devices that support bluetooth such that it would be possible to capture readings in an Android app. My suspicion is that this would be custom work and fairly device-specific to capture the readings and save into the openmrs android client. <br>\nI did a cursory search of the openmrs github and didn't see anything device-related there (doesn't mean it doesn't exist). <br>\nAs mentioned in another thread, there is a DevicesOnFHIR group who likely are closer to this type of thing and may be able to better answer: <a href=\"https://www.iheusa.org/devices-fhir\">https://www.iheusa.org/devices-fhir</a>, as well as a #devices stream here you could try. Good luck.</p>",
        "id": 273825235,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1646235511
    }
]