[
    {
        "content": "<p>Are anyone aware of any open source terminology services that includes  UI and as well handle the actual process/workflow around versioning and draft/editing/authoring the actual terminology - does Snapper/Shrimp fit into this picture <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> ? Or what about Trifolia <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> (I'm aware that Trifolia is backed by a FHIR server) ?  Are these solutions complementary and/or overlapping? Are anyone aware of other alternatives?</p>",
        "id": 216636383,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1605285208
    },
    {
        "content": "<p>Snapper does editing of terminology resources (CodeSystem, ValueSet, ConceptMap), and a very minimal amount of workflow support, but we don't recommend it for very large-scale CodeSystems. It's not open-source, though. Shrimp is a CodeSystem/ValueSet browser, is also not open-source, but is free to use. They are both designed to work against any conformant FHIR terminology server, but YMMV based on both the server implementation and the content you're pointing them at (e.g. Shrimp relies on certain filters being available on a CodeSystem to work well). Obviously, we typically use them with Ontoserver (also not open-source and not free). <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> does that sound right?</p>",
        "id": 216955201,
        "sender_full_name": "Jim Steel",
        "timestamp": 1605575399
    },
    {
        "content": "<p>Snapper is actually free to use (see <a href=\"https://ontoserver.csiro.au/snapper2/licence.html\">https://ontoserver.csiro.au/snapper2/licence.html</a>), and should work with any capable FHIR terminology server, not just Ontoserver.  However, it is not open source and doesn't provided guided workflow.</p>",
        "id": 216958477,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1605578581
    },
    {
        "content": "<p>An interesting post</p>",
        "id": 216958956,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605579122
    }
]