[
    {
        "content": "<p>Hey, I'm trying to integrate with Open Epic and I get Observation resources of Laboratory but only with the test name. No code is specified. I guess they don't provide it and its not something that I did wrong.<br>\nI want to get the Loinc code of each lab test.  Did someone try to do the same? If so, how did you do it? Is it a common thing to do?</p>",
        "id": 223411862,
        "sender_full_name": "Itay Goren",
        "timestamp": 1611166163
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> <span class=\"user-mention\" data-user-id=\"191936\">@Michael Donnelly</span></p>",
        "id": 223419261,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611169511
    },
    {
        "content": "<p>What test patient are you using?  Note that not all lab tests will have LOINC codes, even in production deployments (most/many will, but not all).  For example, historical results and scanned results may not have LOINC.</p>",
        "id": 223429534,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611174023
    },
    {
        "content": "<p>i actually use productions patients and doesn't see it.<br>\nthe resources are \"new\" - from 2018. and the lab tests are basic. for example: EO%, URINE GLUCOSE, URINE BILIRUBIN</p>",
        "id": 223475021,
        "sender_full_name": "Itay Goren",
        "timestamp": 1611211821
    },
    {
        "content": "<p>If you are using production patients, can you reach out to <a href=\"mailto:open@epic.com\">open@epic.com</a> and provide us information on what organization's endpoint you are connected to?  I'd rather investigate production issues using Epic support channels, rather than chat.fhir.</p>",
        "id": 223533915,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611246652
    },
    {
        "content": "<p>sent a mail, thanks!</p>",
        "id": 223538067,
        "sender_full_name": "Itay Goren",
        "timestamp": 1611248349
    },
    {
        "content": "<p>We need an example application integrated with Epic to download a single patient's records to a local database able to work with the Epic FHIR testing sandbox. The first milestone would need to display a tree of synchronized documents, records, and test results. Do we have a sample github repo where they connect and download the fhir data from Epic FHIR testing sandbox</p>",
        "id": 267973298,
        "sender_full_name": "Anurag Agrawal",
        "timestamp": 1642137073
    }
]