[
    {
        "content": "<p>We've implemented authorization in Vonk, based on the <a href=\"http://docs.smarthealthit.org/authorization/scopes-and-launch-context/\" target=\"_blank\" title=\"http://docs.smarthealthit.org/authorization/scopes-and-launch-context/\">SMART scopes and launch context</a>. Basic question is: How do others provide an Open ID Connect Provider where users can configure their scopes for testing? Preferably without maintaining our own.</p>\n<p>More background:<br>\nSince Vonk is a FHIR Server and not an end-user application (it has no UI), the expected flow is:<br>\n1. User interacts with some application X.<br>\n2. X retrieves an access-token by redirecting the user to an Open ID Connect Provider.<br>\n3. X interacts with Vonk, with the access-token as Authentication header.<br>\n4. Vonk validates the token and restricts access based on the scopes (like user/*.read) and - if present - a compartment defined by a launch scope (e.g. patient=123).</p>\n<p>For users to test this on the public endpoint (after we deployed this), we need that OIDC Provider. And for testing purposes it would be useful if they can configure their own scopes. Users can then use Postman or another REST client as a dummy for application X.</p>\n<p>From tests so far I found:<br>\n- SMART Sandbox is only meant to work with it's own FHIR Server (you cannot configure the 'audience'), and we cannot get it to provide the SMART claims in the access token.<br>\n- Grahame's server is capable of using HL7 authorization, but states that that is not really OAuth (let alone OIDC), plus from <a href=\"http://wiki.hl7.org/index.php?title=Health_Intersections_FHIR_Server_login_documentation#User_Resource\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Health_Intersections_FHIR_Server_login_documentation#User_Resource\">this documentation</a> I cannot make up how to configure that.</p>",
        "id": 153927961,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1515425955
    },
    {
        "content": "<p>the HL7 server isn't what you are looking for. I use it as an identity provider from the authorization server, equivalent to facebook or google. I wrote my own OIDC provider, as did other implementation. I also use google and facebook as OIDC providers, but they are at a different point in the workflow</p>",
        "id": 153928024,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515441258
    }
]