[
    {
        "content": "<p>Can an FHIR operation returns both Resource and OperationOutcome?</p>",
        "id": 153954901,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1525029684
    },
    {
        "content": "<p>You can't return both.  If you want both, set the Prefer header to <code>return=OperationOutcome</code>, then query for the version created by the operation based on the Location header.</p>",
        "id": 153954902,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525030554
    },
    {
        "content": "<p>Could you not just have two \"OUT\" parameters for the operation?</p>",
        "id": 153954951,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1525083597
    },
    {
        "content": "<p>well, that depends on whether Yunwei means an 'operation' in the general sense - what the spec calls 'interactions', or if he means a $operation.</p>",
        "id": 153954956,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525084497
    },
    {
        "content": "<p>Lloyd answered the first, you answered the second</p>",
        "id": 153954957,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525084508
    },
    {
        "content": "<p>:-)</p>",
        "id": 153954958,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1525084541
    },
    {
        "content": "<p>I mean the spec defined $ operation. such as ValueSet.$expand returns ValueSet resource. Can I return both OperationOutcome and ValueSet?</p>",
        "id": 153955066,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1525115966
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/operations.html#response\" target=\"_blank\" title=\"http://build.fhir.org/operations.html#response\">build.fhir.org/operations.html#response</a> : If there is only one out parameter, which is a Resource with the parameter name \"return\" then the parameter format is not used, and the response is simply the resource itself</p>",
        "id": 153955072,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525118570
    },
    {
        "content": "<p>so answer is: unless that sentence applies, you can add an operation outcome. If this sentence does - and it does for $expand - then returning a parameters resource with the expansion <em>and</em> an operation outcome will be legal but I bet none of the clients would handle it.  Mine won't (though I'll update it at some stage0</p>",
        "id": 153955073,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525118654
    },
    {
        "content": "<p>The returning a \"resource with the expansion <strong>and</strong> an operation outcome\" was a thought that I had at one point for dealing with identifying when the server returns a limited expansion (typically because returning the full expansion would be too costly), but with $expand having only the 'return' parameter it wasn't really an option - at least one that clients would be able to deal with, as Grahame says.  But it is interesting that we don't consider it to be \"illegal\" to do so, and maybe it's something that would have some utility and we could consider in the future (for \"limited expansions\" and similar situations).</p>",
        "id": 153955561,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1525306948
    }
]