[
    {
        "content": "<p>How does operationOutcome work when performing a search and utilizing  \"_include\"?<br>\nExample: When performing a search for explanation of benefit by a patient's identifier and the search is to include Practitioner and an error occurred with the practitioner resource.  How would the practitioner reference error be represented in the bundle?</p>\n<p>Would the operationOutcome resource be returned as an entry along with the entry of the explanation of benefit, since the explanation of benefit was successful?  If so, how would we denote that the operationOutcome was just for the Practitioner resource only?</p>",
        "id": 169603886,
        "sender_full_name": "Mona O",
        "timestamp": 1562189645
    },
    {
        "content": "<p>Is the error that you don't have the Practitioner to include? Or that some sort of server error occurred during the retrieval internally of the Practitioner?</p>",
        "id": 169605816,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1562191727
    },
    {
        "content": "<p>Possibility 1 is that the error causes the entire query to fail, in which case you don't get a Bundle back at all - just an OperationOutcome.  The OperationOutcome might describe that the issue was with executing the _include and diagnostic information might even let you figure out which practitioner record caused the problem.  Alternatively, you could treat the query as a success and return results, possibly even including some of the Practitioner resources.  You could then include an OperationOutcome as one of the entries with a 'warning' indicating that one/some of the Practitioners weren't retrieved and why.</p>",
        "id": 169606744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562192797
    },
    {
        "content": "<p>The situation I was thinking of is  explanation of benefit was successful, but the practitioner resource had a server error.  I wanted to confirm that I should still return the explanation of benefit resource as entry, but would the operationOutcome resource be returned as an entry to represent the practitioner resource had a server error (unsure where to explicitly call out the practitioner resourced had an error within the operationOutcome resource) or if the practitioner resource should still be an entry.</p>",
        "id": 169607486,
        "sender_full_name": "Mona O",
        "timestamp": 1562193656
    },
    {
        "content": "<p>There isn't really a \"should\".  You can choose to error out.  You can choose to return what you can with a warning.  Which is appropriate depends on what you think is safest and most appropriate for the client</p>",
        "id": 169607815,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562194074
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  How is an OperationOutcome associated back to a specific reference?  In the original example an ExplanationOfBenefit search is requested by identifier. If \"practitioner/123\" is referenced in EOB, but due to server error retrieval of practitioner \"123\" could not be performed to include the practitioner  resource within the bundle.  How should the OperationOutcome be represented to indicate the entry is specifically for the reference \"practitioner/123\"?</p>",
        "id": 172003213,
        "sender_full_name": "Mona O",
        "timestamp": 1564459054
    },
    {
        "content": "<p>Is this an error in the execution of the search - so doing a query against EOB and an _include on EOB.care-team or something and some practitioners come back but this one doesn't?  It wouldn't be reflected in issue.expression - the best that could do is point to the _include parameter.  The details about the specific reference that failed would have to be in the text of issue.detail.  (If you want to share that information discretely for some reason, I guess you could define an extension.)</p>",
        "id": 172003664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564459779
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , you have the scenario correct. Would most implementers not include an OperationOutcome for the missing practitioner entry? Would we be adding confusion by including an OperationOutcome in this scenario? The thought for including the OperationOutcome in this situation is to inform the consumer that the practitioner information couldn't be included at this time (issue.severity would be \"information\" ).</p>",
        "id": 172004351,
        "sender_full_name": "Mona O",
        "timestamp": 1564460921
    },
    {
        "content": "<p>In most cases, typical response would be for the overall query to be successful but to include an OperationOutcome as part of the bundle with a warning message.  (Warning is probably more appropriate than 'information' because the information returned isn't \"complete\".  Information would be more like \"here are the places I checked\")</p>",
        "id": 172004592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564461345
    }
]