[
    {
        "content": "<p>Hello,<br>\nSay I'd like to return a non-fatal OperationOutcome in a history bundle (which has history entries present as well). I'm not sure how to do so while meeting the constraints of the Bundle resource ( <a href=\"https://www.hl7.org/fhir/bundle.html#invs\">https://www.hl7.org/fhir/bundle.html#invs</a> ):</p>\n<ol>\n<li>Since <code>Bundle.type='history'</code>, by constraint <code>bdl-2</code> I can't have <code>entry.search.mode = 'outcome'</code></li>\n<li>Since <code>Bundle.type='history'</code>, by constraints <code>bdl-3</code>/<code>bdl-4</code> the OperationOutcome entry must have <code>entry.request</code> and <code>entry.response</code> BackboneElements, neither of which seem to make sense for an OperationOutcome</li>\n</ol>\n<p>What's the best way to format non-fatal OperationOutcomes in a history Bundle?</p>",
        "id": 236548066,
        "sender_full_name": "James Jahns",
        "timestamp": 1619631425
    },
    {
        "content": "<p>Right now, the answer is \"there isn't one\" - can you submit a change request for us to address this in a future release?</p>",
        "id": 236549700,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619632064
    },
    {
        "content": "<p>Submitted change request: <a href=\"https://jira.hl7.org/browse/FHIR-32011\">https://jira.hl7.org/browse/FHIR-32011</a></p>",
        "id": 236558008,
        "sender_full_name": "James Jahns",
        "timestamp": 1619635503
    },
    {
        "content": "<p>Similar to this, I would like to include an informational OperationOutcome as the Paramater.resource alongside other Parameter objects in a Parameters object.</p>\n<p>The other Parameter objects would be \"expected results\" for the operation and then there would be an \"extra\" Parameter object for this informational OperationOutcome (that describes why potential results weren't included as Parameter objects in the result).</p>\n<p>I can't find anything that precludes this, other than the OUT Parameter is defined as:<br>\nUse=OUT<br>\nName= return<br>\nCardinality=0..*<br>\nType=Bundle</p>\n<p>and an OperationOutcome is not a Bundle.</p>\n<p>Is there some provision for being able to sneak an OperationOutcome in there?  Or does the OperationDefinition above preclude it?</p>",
        "id": 243822407,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1624557177
    },
    {
        "content": "<p>The OperationDefinition precludes it.  In this case, the return would be a Bundle, not a Parameters instance, so there's no ability to send an OperationOutcome as well.</p>",
        "id": 243937063,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624637439
    }
]