[
    {
        "content": "<p>I'm working on storing operator, organization and operation. Operator information should easily go to practitioner resource. Organization to organization resource. These both will be referenced from study observation \"performer\" key. Study observation resource groups these together. My question is what would be the best way to present the operation made. There is 3 options what practitioner can make: measurement, update for measurements or calibration for device.</p>",
        "id": 157672307,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1549440003
    },
    {
        "content": "<p>Can you explain what \"update for measurements\" means?  (Also, <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> )</p>",
        "id": 157695749,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549465007
    },
    {
        "content": "<p>can you explain what you mean by 'study observation' too?</p>",
        "id": 157713816,
        "sender_full_name": "Eric Haas",
        "timestamp": 1549478367
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  It's observation  resource which contains information that it's a spirometry stydy. It  has references to chain(tree stucture) of other resources and observations(protocol, phase, measurement mode, breath, flow&amp;variable), device, binary, height, weight, BMI etc... and \"groups\" them together.  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> If practitioner makes new study to patient then he/she makes measurement. If this practitioner goes back to study and updates some some information to existing study then it's update.</p>",
        "id": 157755623,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1549521585
    },
    {
        "content": "<p>Second or third measurements would be treated as additional Observations, not as updates.  You can group them under a \"grouper\" observation linking them as members.  The timestamps would tell you the order they were done in.  Differentiating a measurement done for calibration purposes could be differentiated using the workflow-reasonCode extension I suppose</p>",
        "id": 157756478,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549523071
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I edited my message I wrote wrong in the original. So it's a measurement every time measurement is done. Update when practitioner goes back to study and add's or modifies some information to study.</p>",
        "id": 157756578,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1549523278
    },
    {
        "content": "<p>Actually there is 4 fields I need to store in relation to the operation: operation(measurement/update), operationID, operationTime, and username of practitioner who made that operation. (real name of practitioner goes to practitioner resource) These are the \"fields\" from our application what I'm struggling to find the place to store them.</p>",
        "id": 157757057,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1549524063
    },
    {
        "content": "<p>That sounds like Provenance.  That lets you capture what action/operation happened on the record, who did it and when.  Username would be an extension.</p>",
        "id": 157785606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549553927
    },
    {
        "content": "<p>if you don't have a Practitioner resource to put into Provenance.agent.who.reference; then put the username into Provenance.agent.who.identifier.</p>",
        "id": 157785905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549554134
    },
    {
        "content": "<p>I admit I don't understand your use case but I  don't think that Observation should be used as a top level grouping resource when this sounds more like a <em>report</em> to me aka a <em>DiagnosticReport</em> or even a <em>Composition</em>.</p>",
        "id": 157794896,
        "sender_full_name": "Eric Haas",
        "timestamp": 1549560269
    },
    {
        "content": "<p>Thanks a lot for the answers! :)</p>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Yes there is actually observation in top of my structure. I might have to change it to DiagnosticReport if using observation is not right way to group everything. This has been a big project to fit all data from our software to FHIR. I have tried to make it so it would follow FHIR specifications. But I must admit that there must be some mistakes along the way since I started this whole project with 0 knowledge of FHIR. There has been fairly much of guessing where to put this and that. I have tested my resources as a bundle to <a href=\"http://hapi.fhir.org/baseDstu3/\" target=\"_blank\" title=\"http://hapi.fhir.org/baseDstu3/\">http://hapi.fhir.org/baseDstu3/</a> along the way.</p>\n<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Provenance seems just what I was looking for. I will use CREATE for \"measurement\" and UPDATE for update. Id can be used as id of resource and recorded as time of operation.</p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> now I have practitioner, provenance and organization to work with. I'm planning that organization and practitoner could be referenced from \"performer\" of observation. And practitioner from agent.whoReference of Provenance.  I could actually use identifier of practitioner to present username? What would be identifier system to use if I put username as value of practitioner.identifier?</p>",
        "id": 157849132,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1549621475
    },
    {
        "content": "<p>typically usernames are much like identifiers, they have a value and a domain... For example: <a href=\"mailto:JohnMoehrke@gmail.com\" title=\"mailto:JohnMoehrke@gmail.com\">JohnMoehrke@gmail.com</a>... the value is JohnMoehrke, the domain (system) is <a href=\"http://gmail.com\" target=\"_blank\" title=\"http://gmail.com\">gmail.com</a>.</p>",
        "id": 157869156,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549641443
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  What if there is only a username and password?  Password is of course not stored.  It's either internal user. So you decide your username whereby You log in to our software. So for me it could be laurikarp12 for example.  Or it can be windows group based or windows user based username. For example:  GRP\\GROUP-USERS or GRP\\LAURI.  I found this: <a href=\"https://www.hl7.org/fhir/valueset-identifier-type.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-identifier-type.html\">https://www.hl7.org/fhir/valueset-identifier-type.html</a>. Could I use this as a type of identifier. Code ACSN Accession ID sounds something that I'm trying to store? I've been trying to find some examples for this but with no luck. Any help would be much appreciated! :)</p>",
        "id": 158010847,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1549868280
    },
    {
        "content": "<p>Could this be the way to present this username? Example:</p>\n<p><code>       \"identifier\": [\n          {\n            \"type\": {\n              \"coding\": [\n                {\n                  \"system\": \"http://terminology.hl7.org/CodeSystem/v2-0203\",\n                  \"code\": \"ACSN\"\n                }\n              ]\n            },\n            \"value\": \"karpla\"\n          }\n        ],</code></p>\n<p>So this identifier would go to practitioner resource.</p>",
        "id": 158012817,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1549871132
    }
]