[
    {
        "content": "<p>Why we do not have OperationDefinitions for basic FHIR API like CRUD, Search, History etc?</p>",
        "id": 153855632,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478417551
    },
    {
        "content": "<p>The basic REST API methods are covered in the CapabilityStatement (aka Conformance) under <code>CapabilityStatement.rest.resource.interaction</code>. There's a spot for a textual description there but it's really mostly just a binary \"yes/no do i support this thing?\"</p>",
        "id": 153855639,
        "sender_full_name": "James Agnew",
        "timestamp": 1478436787
    },
    {
        "content": "<p>:( i.e. hardcoded</p>",
        "id": 153855656,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478462810
    },
    {
        "content": "<p>What information are you trying to convey? I wouldn't say that I've found the options in capabilitystatement to be limiting so far..</p>",
        "id": 153855658,
        "sender_full_name": "James Agnew",
        "timestamp": 1478462996
    },
    {
        "content": "<p>What the difference between Operations as OperationDefinition resource and basic FHIR API?</p>",
        "id": 153855659,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478463083
    },
    {
        "content": "<p>I guess mainly the fact that the built-in operations (create/read/etc) all have their semantics completely spelled out by the FHIR spec, where operations are intended to have their semantics spelled out via an OperationDefinition resource. I don't understand why you'd want an operationdefinition for the built-in ones? What information are you trying to convey?</p>",
        "id": 153855660,
        "sender_full_name": "James Agnew",
        "timestamp": 1478463211
    },
    {
        "content": "<p>I'm trying to generate swagger spec for FHIR. Just uniformity principle - all REST API described as .... Isn't Operations are capabilities or capabilities are operations (Occam's razor)</p>",
        "id": 153855661,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478463323
    },
    {
        "content": "<p>Well, I could see how it would be useful for that one use case.</p>\n<p>Seems like an annoying burden for server developers to have to meet though just to avoid having to look in two places in the capability statement when generating your swagger.</p>",
        "id": 153855663,
        "sender_full_name": "James Agnew",
        "timestamp": 1478463591
    },
    {
        "content": "<p>Yes :) complexity started by small inconsistencies and then hacking on top of it recursively. Semantically,  are not Operations defined in OperationDefinitions  at the same time server capabilities?</p>",
        "id": 153855664,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478463870
    },
    {
        "content": "<p>Why do we need two concepts for one entity?</p>",
        "id": 153855665,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478463906
    },
    {
        "content": "<p>I guess because you have to draw the line somewhere when deciding how much complexity to add.. I mean, even if you did generate OperationDefinitions for the FHIR built-in operations, you wouldn't be able to convey all of the information you would need to in the existing resource. </p>\n<p>E.g. what would an OD look like for the update operation? There is nowhere in there for you to specify what HTTP verb it requires.. Nor is there a way to convey the conditional URL that is allowed, or the extra headers. In the end if you wanted to be able to just automatically generate swagger from an OD, you would need to extend OD quite a bit and in the end you're just re-creating swagger in another form.</p>\n<p>Ultimately that's way more complex than just saying \"yes/no i support update\"</p>",
        "id": 153855666,
        "sender_full_name": "James Agnew",
        "timestamp": 1478464314
    },
    {
        "content": "<p>This problems brings  us to the right direction -  that OperationDefinition should be extended to include such type of information.  Swagger generation is only one use case. Now we use code generation for FHIR resources, the same way OperationDefinitions could be used to generate API Calls, Generic UIS. Swagger has good support for client generation and generic Swagger UI.</p>",
        "id": 153855667,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478464673
    }
]