[
    {
        "content": "<p>In the case that an invalid or unsupported json-patch request body is sent to a server, it presents an interesting challenge for what to populate in the OperationOutcome.issue.expression, since that field is a FHIRPath expression, but the request isn't FHIR (or FHIRPath-based patch).</p>\n<p>Example:</p>\n<div class=\"codehilite\"><pre><span></span><code>PATCH &lt;base url&gt;/Resource/123\n\n[\n   {\n      &quot;path&quot;:&quot;/attribute&quot;,\n      &quot;op&quot;:&quot;replace&quot;,\n      &quot;value&quot;: &quot;replacementValue&quot;\n   }\n]\n</code></pre></div>\n<ul>\n<li>Option 1: Interpret the PATCH as a PUT and return the expression in reference to the Resource.  i.e. <code>Resource.attribute</code> could be the expression if that value is invalid.</li>\n<li>Option 2: If the need is to point more to an invalid operation, Option 1 may not be possible.  That may be more of a <code>$this[0].op</code>.  The request wasn't FHIR, so I'm curious for thoughts on this.</li>\n<li>Option 3: Expressing the FHIRPath as if the original request was a FHIRPatch (Parameters-based) request presents a challenge if you want to point to a particular <code>Parameters.parameter[0].part[?].valueString</code> because part is index-based, but the request wasn't supplied that way.</li>\n</ul>\n<p>I lean towards Option 1, but recognize that it may not work for all expressions, hence option 2.  Not a fan of option 3.</p>",
        "id": 216912173,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1605551459
    },
    {
        "content": "<p>I'm not a super fan of any of the options. this is something we didn't think of</p>",
        "id": 216933404,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605561386
    },
    {
        "content": "<p>probably the least worst answer is to just write FHIRPath against the json (or xml in the other case) directly per #2</p>",
        "id": 216933488,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605561437
    },
    {
        "content": "<p>Not being a FHIRPath expert, and in the absence of a FHIR Resource, am I interpreting \"$this[0].op\" (or $this[0].path or $this[0].value) being the closest to a least worst representation?</p>",
        "id": 216937366,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1605563375
    },
    {
        "content": "<p>yes</p>",
        "id": 216938397,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605563930
    },
    {
        "content": "<p>And if the location that fails is due to a change of another field (via invariant), but the field itself wasn't changed, Option 1 is the only thing I think you can do.<br>\nFor me I think Option 1 is the only real option, as you needed to know from the client what the oringinal thing you were patching was to be able to work it out, so if the error comes back as that in the resource, I'm ok with that.<br>\ne.g. Invarint on patient that all active fields have a DOB entered, and a patch sets a patient with no DOB to active.</p>",
        "id": 217138974,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1605708811
    },
    {
        "content": "<p>I'm guessing there isn't a one size fits all here.  The OperationOutcome might be able to point to the expression within the patch and say that changing the active indicator is the problem because other invariants are unfulfilled, or it could additionally point directly to the fields like DOB that weren't populated.  If an \"update\" operation was sent, $this[0].op might be used to point to the invalid operation.</p>\n<p>Option 1 allows for Patient.active rather than Option 2's $this[0].value being an expression of the problem.  Option 1 allows somewhat of an intuitive representation of where in the resource the problem exists.  Option 2 is there if you have to point to a specific part of the patch request</p>",
        "id": 217189974,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1605730203
    }
]