[
    {
        "content": "<p>[As a developer creating APIs that exchange data via FHIR, I want to return good OperationOutcomes so that third parties using my APIs can write robust applications]</p>\n<p>In a scenario where<br>\n- custom operations are used, and<br>\n-  the input is a Parameters resource containing parameters <br>\n     -- both of simple and complex datatypes and <br>\n     -- where there might be repetitions, </p>\n<p>how can I return meaningful data in an OperationOutcome that allows the consumer code to identify the error and recover in a production environment?<br>\nSpecifically: </p>\n<ul>\n<li>\n<p>How is the parameter at fault identified? Is the xpath really useful to anyone? Is it realistic to expect that the caller would save the request text every time, so that in case of error they are able to apply the xpath and get to the parameter?</p>\n</li>\n<li>\n<p>Has anyone got round this by, for example, creating extension called \"fieldName\" and \"fieldValue\" to make it easier to pinpoint the specific data item that has caused the error?</p>\n</li>\n</ul>\n<p>The issue is not so much if the error is triggered during development (as the devs will have an opportunity to analyse the request message they sent). But when an error happens in live scenarios, the application consuming the FHIR needs to get over the error and carry on.</p>\n<p>Example:<br>\n- custom operation to search for free appointment slots at a number of HealthcareServices<br>\n- Input is:  HealthcareService Identifiers (1..*), date range<br>\n- error: one of the HealthcareServices (which was a valid entry yesterday) has just been wound down and is shut from today onwards.<br>\n- expected flow: OperationOuctome says Service ID =1234 is no longer valid,  third party code removes the specific entry and runs the search again, having appropriately warned the user.OperationOutcome that allows code to recover and carry on</p>\n<p>Thank you</p>",
        "id": 153975674,
        "sender_full_name": "Silvia Lillie",
        "timestamp": 1531813558
    },
    {
        "content": "<p>OperationOutcome is intended to be useful for more than just operations.  \"Field name\" would be specific to Parameters, so we'd rather have a generic solution.  XPath and FHIRPath provide that.  They're simple position-based paths, so pretty easy to parse and process.</p>",
        "id": 153975763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531834196
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ,</p>\n<p>so you mean that API consumers are likely to have a way of surfacing all the various types of errors from the FHIR-handling libraries up to the business logic classes?<br>\nI wouldn't assume that my API consumers have a FHIR server at their end, although we strive to use FHIR for the data in transit. </p>\n<p>And, as the supplier of the API, how do you provide support if all you have to go by is the error code and the FHIR path (and not the actual value that was the problem)?  Would you log absolutely everything going in and out ahead of the strings being processed?</p>",
        "id": 153976271,
        "sender_full_name": "Silvia Lillie",
        "timestamp": 1531996710
    },
    {
        "content": "<p>An API consumer may or may not have the ability to surface the error location or other information.  It may be that all it'll do is keep track of success vs. failure and perhaps display a big red X in the event of the latter.  However, the API tries to allow a useful/reasonable amount of detail to be communicated back.  The details about what the problem was would be conveyed in OperationOutcome.details - as either a local code or text or both.  And you could include a full stack trace or equivalent in OperationOutcome.diagnostics.  That doesn't mean you might not also log the failure, but you should be able to convey enough information in the OperationOutcome that you wouldn't have to rely on that.</p>",
        "id": 153976342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532010379
    }
]