[
    {
        "content": "<p>Hi <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> Looking at Questionnaire, it seems that there are certain boolean elements that are optional, but for which processing systems and validators are <em>de facto</em> forced to assume a definitive element value if the element is absent. Examples are <code>Questionnaire.experimental</code> (even a modifier field) and <code>Questionnaire.item.repeats</code>. E.g. if the latter is missing, I must assume a value in order to judge whether a QuestionnaireResponse with multiple matching items is valid or not.</p>\n<p>Accordingly, I expected there to be default values defined in the documentation (I thought I already knew the two examples above default to \"false\"). Failing to find them, I finally realized that there is a rule saying that base resource definition cannot have default values (<a href=\"http://hl7.org/fhir/R4/structuredefinition.html#invs\">sdf-22 on StructureDefinition</a>). What is the reasoning behind this restrictions? And how is an implementations supposed to deal with (or just know) such apparently \"tacit defaults\"?</p>",
        "id": 209497868,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599650265
    },
    {
        "content": "<p>FHIR doesn't support default values, but it does have a notion called \"meaning if missing\" (e.g. <a href=\"http://build.fhir.org/questionnaire-definitions.html#Questionnaire.item.repeats\">http://build.fhir.org/questionnaire-definitions.html#Questionnaire.item.repeats</a>).  There probably should be a \"meaning if missing\" on experimental - can you submit a change request?</p>",
        "id": 209512244,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599659255
    },
    {
        "content": "<p>Ah right, I missed that (given that it isn't there for <code>experimental</code>). I see <a href=\"https://www.hl7.org/fhir/elementdefinition-definitions.html#ElementDefinition.meaningWhenMissing\"><code>ElementDefinition.meaningWhenMissing</code> is MarkDown</a>. Is there any way of accessing this information in a machine-readable way or are tools generally expected to have this information hand-coded into them?</p>\n<p>Will open a JIRA ticket for <code>experimental</code>.</p>",
        "id": 209515974,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599660750
    },
    {
        "content": "<p>Ticket <a href=\"https://jira.hl7.org/browse/FHIR-28454\">FHIR-28454</a></p>",
        "id": 209517611,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599661378
    },
    {
        "content": "<p>The information isn't necessarily going to be straightforward to interpret - e.g. Resource.language.  So no, no expectation for computable processing.  We actually used to have explicit default values, but that created its own challenges.</p>",
        "id": 209520313,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599662533
    }
]