[
    {
        "content": "<p>The OR examples on the FHIR STU3 Search page show how to match on one or more values for a single parameter.  However, we're trying to do ORs across different parameters such as:</p>\n<p><a href=\"http://.../fhir/baseDstu3/Patient?_id=218,_lastUpdated=gt2018-05-02\" target=\"_blank\" title=\"http://.../fhir/baseDstu3/Patient?_id=218,_lastUpdated=gt2018-05-02\">http://.../fhir/baseDstu3/Patient?_id=218,_lastUpdated=gt2018-05-02</a></p>\n<p>Is this supported in the FHIR search spec?  The HAPI Server is giving inconsistent query results based on the ordering of the querystring parameters and I'm not sure if it's a HAPI issue.</p>",
        "id": 153968075,
        "sender_full_name": "Anthony Sute ",
        "timestamp": 1528477341
    },
    {
        "content": "<p>That's not legal FHIR syntax.  If you want to do OR across search parameters you'll need to use _query or GraphQL, though neither are widely supported</p>",
        "id": 153968085,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528481271
    },
    {
        "content": "<p>One other option would be to use _filter. Unfortunately, this is not that widely supported, too. <br>\nYou could use OR searches in the following way:<br>\n[base]/Patient?_filter=_id eq  218 or _lastUpdated co 2018-05-02</p>",
        "id": 153968090,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1528482586
    },
    {
        "content": "<p>I'd actually meant to type _filter rather than _query :)</p>",
        "id": 153968098,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528485317
    },
    {
        "content": "<p>Thanks Lloyd.  I'm curious if the syntax I showed might be something to consider in an upcoming spec to more easily express OR queries?  I would think that the use of the comma to specify multiple values for a single parameter to OR against would be conceptually straightforward to extend to multiple parameters instead?</p>\n<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> - HAPI doesn't raise an error for the OR syntax above that Lloyd indicated was illegal.  Does HAPI attempt to parse OR queries across multiple parameters?  Thanks in advance!</p>",
        "id": 153968103,
        "sender_full_name": "Anthony Sute ",
        "timestamp": 1528486512
    },
    {
        "content": "<p>I suspect it would be a parsing challenge.  Also, we're trying to draw bounds over how complex we make RESTful query.  But you're welcome to submit a change request</p>",
        "id": 153968129,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528493631
    },
    {
        "content": "<p>but you should not. _filter is the only rational way to do this syntax. The fact that is not widely supported is not related to syntax but to complexity. We should not create additional syntaxes for the complexity</p>",
        "id": 153968130,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528493732
    },
    {
        "content": "<p>The classic RESTful way to do OR is to do multiple GET... you don't get one result, but you do get your OR result</p>",
        "id": 153968376,
        "sender_full_name": "John Moehrke",
        "timestamp": 1528730459
    },
    {
        "content": "<p>I think HAPI is correct not to report this as an error. You simple asked for a Patient having an _id of either '218' or '_lastUpdated=gt2018-05-02'. The latter will never yield a result though, since an _id is not allowed to have _ or = characters (see <a href=\"http://Patient?_id=218,_lastUpdated=gt2018-05-02\" target=\"_blank\" title=\"http://Patient?_id=218,_lastUpdated=gt2018-05-02\">Resource Identity</a>)</p>",
        "id": 153969603,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1528977225
    }
]