[
    {
        "content": "<p>We want send out the nurse's worklist - bladder care, colon cleaning, and administer some midazolam.<br>\nThe group that's working on this found that ServiceRequest could be used for all of these - because the focus of this is the services that the nurse should do.<br>\nI am not sure about the boundary between ServiceRequest or MedicationRequest. In this case (or in any case), does it make sense to create a ServiceRequest for describing the nurse activity, instead of the MedicationRequest?</p>",
        "id": 258979441,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635177175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span> <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> ?</p>",
        "id": 258979492,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635177201
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> I think this may plug into the discussions of order details. Depends on where this discussion is happening.</p>",
        "id": 258979653,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635177254
    },
    {
        "content": "<p>I would have thought that medication administration orders were sent out using MedRequest using a MAR.</p>",
        "id": 258979666,
        "sender_full_name": "Melva Peters",
        "timestamp": 1635177259
    },
    {
        "content": "<p>That is my leaning as well, but the boundaries were not clear. So I'm seeking for agreement from Patient Care and OO, and if there's agreement on these boundaries, we should perhaps make it clear in the resource.</p>",
        "id": 258987095,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635180498
    },
    {
        "content": "<p>There are more places where this happens. We can order medications using CarePlan as well.</p>",
        "id": 258987288,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635180595
    },
    {
        "content": "<p>The concern I have is that if we have all of that, we can't make simple things like a medication list</p>",
        "id": 258987371,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635180618
    },
    {
        "content": "<p>I understood that MedReq would never be used in combination with ServReq.  But where there are similarities, e.g., order details, they should be modeled as similar as possible based on a common pattern.  So perhaps the Request pattern should be updated with request details and use the recently adopted ServiceRequest. orderDetail as the template.</p>",
        "id": 258987759,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1635180792
    },
    {
        "content": "<p>We should also provide guidance for implementers about the boundaries. At this moment, there's nothing in servicerequest that says \"this should not be used for ordering medications\"</p>",
        "id": 258989517,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635181534
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> can I add a Jira tracker item to add to ServiceRequest the information \"one shall not use ServiceRequest to provide medication orders or medication service orders\" ?</p>",
        "id": 259014537,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635193033
    },
    {
        "content": "<p>(in the workflow call today there was good consensus for that)</p>",
        "id": 259014697,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635193099
    },
    {
        "content": "<p>also pinging <span class=\"user-mention\" data-user-id=\"441371\">@Bart Decuypere</span></p>",
        "id": 259014719,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635193106
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> How would you make clear that a MedicationRequest is a Medication Administration Request, in which a physician asks a nurse to administer medication to a patient?</p>",
        "id": 259058145,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1635231403
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> MedicationRequest.intent does not seem to have a suitable value for this purpose.</p>",
        "id": 259058381,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1635231612
    },
    {
        "content": "<p>MedicationRequest.intent doesn't need to say \"please administer\" because that is what MedicationRequest says already</p>",
        "id": 259060903,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635233512
    },
    {
        "content": "<p>The intent is whether this is an order for a series of actions, or just for one specific action</p>",
        "id": 259061032,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635233576
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"441371\">@Bart Decuypere</span> there may be some clarification or changes to do to differentiate those things. Can you please tell us the difference?</p>",
        "id": 259063994,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635235544
    },
    {
        "content": "<p>A physician's order to administer the medication is only the order to administer it. Not the order to obtain the medication. A pharmacist will never give you a medication because there is a referral prescription nursing for medication.</p>",
        "id": 259064319,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1635235739
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191437\">@Arianne van de Wetering</span> I think this is also what you were requesting - a way to clearly separate the \"logistics\" and \"clinical\" aspects of the prescription - right ?</p>",
        "id": 259064437,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635235807
    },
    {
        "content": "<p>AFAIK, in Belgium a medication prescription (MedicationRequest) is both \"clinical\" and \"logistics\", a referral prescription nursing for medication is only \"clinical\". As the patient is not capable of administring the medication to him/herself, the physician orders a nurse to do so.</p>",
        "id": 259065800,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1635236836
    },
    {
        "content": "<p>In the Netherlands we indeed distinguish explicitly the therapeutical request/intention and the logistics for supplying the medication. In FHIR this has resulted in separate profiles on MedicationRequest (one for the therapeutic information in a concept we call 'medication agreement' and one for the logistic dispense request) and MedicationDispense (again one for the the therapeutic information in a concept we call 'administration agreement' and one for the logistic dispense). More information on those concepts: <a href=\"https://informatiestandaarden.nictiz.nl/wiki/mp:V9_2.0.0_Ontwerp_medicatieproces_ENG#Introduction_of_relevant_terms\">https://informatiestandaarden.nictiz.nl/wiki/mp:V9_2.0.0_Ontwerp_medicatieproces_ENG#Introduction_of_relevant_terms</a></p>",
        "id": 259075647,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1635243201
    },
    {
        "content": "<p>The distinction would be reflected in whether there's a MedicationRequest.dispenseRequest.  That's what authorizes the distribution of medication.  If it's not present, then a MedicationRequest is solely an \"order to administer\".</p>",
        "id": 259095073,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635254646
    },
    {
        "content": "<p>Sure.</p>",
        "id": 259135218,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1635270692
    }
]