[
    {
        "content": "<p>Hi all, </p>\n<p>Happy New Year!!</p>\n<p>I am trying to find the best element in the resource DiagnosticReport where to fill the Ordering Provider (the physician who requested the exam).<br>\nWhen I read the description for the ResultsInterpreter element it says \"The practitioner or organization that is responsible for the report's conclusions and interpretations.\", I take it as the physician who ordered the test will be the one who will take conclusions of the report and pass it on to the patient. <br>\nAm I right to think like that? And to use this element as the OrderingProvider</p>\n<p>What makes me doubt also is that in ServiceRequest resource, we have the requester element, that specifically says \"The individual who initiated the request and has responsibility for its activation.\", here it is clear that we must use the OrderingProvider.</p>\n<p>Thanks for the attention</p>",
        "id": 221625829,
        "sender_full_name": "PhillipFry",
        "timestamp": 1609838095
    },
    {
        "content": "<p>Exactly. The ordering provider is available via DiagnosticReport.basedOn(ServiceRequest).requester , so you'll need both resource types. DiagnosticReports are not about details of the request, those are on ServiceRequest.</p>",
        "id": 221634210,
        "sender_full_name": "René Spronk",
        "timestamp": 1609844827
    },
    {
        "content": "<p>So, i will need to exchange the information in a Bundle that contains both the ServiceRequest and DiagnosticReport?</p>",
        "id": 221636879,
        "sender_full_name": "PhillipFry",
        "timestamp": 1609846709
    },
    {
        "content": "<p>Whether or not one communicates these in one single Bundle depends on the context. What's your use case?</p>",
        "id": 221640481,
        "sender_full_name": "René Spronk",
        "timestamp": 1609849634
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"375979\">@PhillipFry</span>, to clarify, yes, the ordering provider (e.g., referring physician) is recorded in ServiceRequest.requester, which can be referenced from the DiagnosticReport via basedOn. </p>\n<p>The resultsInterpreter is the person who interpreted the diagnostic test. For example, this is a the radiologist \"reading\" CT images, and who is legally responsible for their interpretation.</p>\n<p>Neither of these are <em>identified</em> as the person responsible for delivering the results to the patient.</p>",
        "id": 221672681,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1609866400
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> and <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> for the explanation.<br>\nIt was very useful!</p>",
        "id": 221672969,
        "sender_full_name": "PhillipFry",
        "timestamp": 1609866545
    }
]