[
    {
        "content": "<p>Within ServiceRequest, is there a typical pattern for documenting the different individuals involved in ordering a test or procedure? One of the more complicated scenarios is where a practitioner without full ordering credentials may \"order\" a test that then is verified/authorized by a different provider with full ordering credentials. On top of that, there may be some insurance \"pre-auth\" that has to happen. How are these different roles captured in ServiceRequest? Which one goes in ServiceRequest.requester? Are the other roles captured in a Provenance record (role of verifier?) Or does .requester change as the intent goes from \"plan\" to \"order\"? Or does a Task with .type of \"approve\" capture the authorization for the order?</p>",
        "id": 161086619,
        "sender_full_name": "Craig Newman",
        "timestamp": 1552935954
    },
    {
        "content": "<p>Typically the fine-grained responsibilities are captured using Provenance (data enterer, initial proposer, etc.) and only the individual who 'signs' is captured on the resource.  You could also reflect the order as being done in response to a 'proposal' by the non-credentialed individual.  The Pre-auth would be represented using Claim.</p>",
        "id": 161089527,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552938205
    },
    {
        "content": "<p>If a ServiceRequest moves from a proposal from an non-credentialed person to an order approved by a credentialed person, would that typically just be an update to ServiceRequest.intent in a new version of the existing resource, or would a new ServiceRequest resource be created with a .intent of \"order\" and a reference back to the proposal resource in .basedOn?</p>",
        "id": 161348477,
        "sender_full_name": "Craig Newman",
        "timestamp": 1553177495
    },
    {
        "content": "<p>New ServiceRequest with a basedOn link.  'intent' is considered immutable</p>",
        "id": 161360171,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553184447
    },
    {
        "content": "<blockquote>\n<p>New ServiceRequest with a basedOn link. 'intent' is considered immutable</p>\n</blockquote>\n<p>Really?  if that is true one would think it'd be documented somewheres.</p>",
        "id": 161391916,
        "sender_full_name": "Eric Haas",
        "timestamp": 1553199323
    },
    {
        "content": "<p>I think its just like any other element,... dealer's choice .... you can create new versions or new resources.   Are we talking about the base spefication here?</p>",
        "id": 161392061,
        "sender_full_name": "Eric Haas",
        "timestamp": 1553199439
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> who considers it immutable besides you? I can't see how the spec does</p>",
        "id": 161392343,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1553199655
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/request-definitions.html#Request.intent\" target=\"_blank\" title=\"http://build.fhir.org/request-definitions.html#Request.intent\">http://build.fhir.org/request-definitions.html#Request.intent</a></p>",
        "id": 161396445,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553203056
    },
    {
        "content": "<p>Even the 'short name' mentions that it's immutable in the pattern</p>",
        "id": 161396457,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553203073
    },
    {
        "content": "<p>If there are places where the relevant usage notes haven't propagated into specific request resources from the pattern, please submit a change request.</p>",
        "id": 161396531,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553203122
    },
    {
        "content": "<p>Got it, thx. It says 'expected' - not required or mandated. That is sort soft for such a characterisation</p>",
        "id": 161398006,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1553204435
    },
    {
        "content": "<p>There are reasons for exceptions, for example clarifying that an 'order' is in fact an 'original-order' once that fact is confirmed.</p>",
        "id": 161398968,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553205367
    },
    {
        "content": "<p>Seems like a very important implementation detail To be buried in the comment field for the pattern element.  How many folks are going actually find and read  that.  .</p>",
        "id": 161425474,
        "sender_full_name": "Eric Haas",
        "timestamp": 1553238580
    },
    {
        "content": "<p>How many other immutabke elements are there?</p>",
        "id": 161425692,
        "sender_full_name": "Eric Haas",
        "timestamp": 1553238884
    },
    {
        "content": "<p>It was surfaced in the short description too.  I'm not aware of others.</p>",
        "id": 161451880,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553264695
    }
]