[
    {
        "content": "<p>Hi folks,<br>\nHave there been any discussions about expanding/increase the cardinality of \"organization.partOf 0..1\"?<br>\nWe have use cases where hospitals have more than one type of roll-up, e.g. to a regional authority as well as a traditional organizational hierarchy.<br>\nAlternately, a relatedOrganization (0..*) that specifies both organization(reference) and relationship(codeableConcept) may be more robust.<br>\nAre there any other implementers that have implemented a similar use case?<br>\nThanks for any thoughts you can provide!</p>",
        "id": 153858409,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1479999652
    },
    {
        "content": "<p>I've encountered the same problem today, trying to use Organization to model ad-hoc groups of Organizations for access control when information sharing. A given organization will almost certainly be a member of more than group.</p>",
        "id": 153858417,
        "sender_full_name": "Dunmail",
        "timestamp": 1480004252
    },
    {
        "content": "<p>I looked at Group, but this is constrained so that it can't represent a Group of Organizations</p>",
        "id": 153858418,
        "sender_full_name": "Dunmail",
        "timestamp": 1480004289
    },
    {
        "content": "<p>I agree that relatedOrganization (0..*) would be a good fit as it would also cover relationships other that \"part of\", e.g. affiliation between hospitals, clinics, etc. If not in the core, maybe we can have a standard extension for this?</p>",
        "id": 153858443,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1480014564
    },
    {
        "content": "<p>There has been some discussions around this, but its more around assoications rather than part-of, and fits into your use-case. This is likely to be a seperate thing.</p>",
        "id": 153858577,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1480238025
    },
    {
        "content": "<p>We are facing the exact same problem -- in our case, we need to represent a hospital (or a clinic) may belong to multiple ACO (Accountable Care Organization) networks. So if a hospital Organization H1 belongs to  2 separate Organization resources ACO1 and ACO2, then we should be able to have references to both ACO1 and ACO2 within the H1 resource. </p>\n<p>I also second the approach suggested by  <span class=\"user-mention\" data-user-id=\"192143\">@Ken Sinn</span> to have a relatedOrganization (0..*) attribute.</p>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  -- since this seems to have come up multiple times with valid use cases, should we open this as an enhancement request in gForge?</p>",
        "id": 153872523,
        "sender_full_name": "Sandeep Giri",
        "timestamp": 1487374819
    },
    {
        "content": "<p>The draft resource proposal is here:<br>\n<a href=\"http://wiki.hl7.org/index.php?title=OrganizationAffiliation_FHIR_Resource_Proposal\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=OrganizationAffiliation_FHIR_Resource_Proposal\">http://wiki.hl7.org/index.php?title=OrganizationAffiliation_FHIR_Resource_Proposal</a><br>\nLooking for comments on seperate resource vs property of org.<br>\nConsidering how often these are likely to happen, how much history you are going to want to retain here into the future, and effect on the size of the resource as it gets older.<br>\n(seperate resource doesn't have these specific issues)</p>",
        "id": 153872526,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487375731
    }
]