[
    {
        "content": "<p>Hi<br>\nAre there any recommendations on how to interpret Organization.telecom.use?</p>\n<p>There is a rule saying <em>home</em> cannot be used for organizations. I dont really see that <em>temp</em> or <em>mobile</em> really applies either? That leaves only *work * and <em>old</em>. </p>\n<p>Is <em>use</em> applicable for organizations at all? If so, what option is the recommended?</p>\n<ol>\n<li>Use no value to indicate a contact phone, and <em>old</em> if the number is no longer applicable, <em>work</em> should not be used</li>\n<li>Use <em>work</em> to indicate a contact phone, and <em>old</em> if the number is no longer applicable, and also set Use 1..1, as in, either the phone is in use (<em>work</em>) or not (<em>old</em>)</li>\n<li>Use <em>work</em> with some distinct meaning that differentiates it from no value at all (what is then the meaning of work?), and use <em>old</em> for numbers that a no longer applicable</li>\n<li>Other option?</li>\n</ol>",
        "id": 183559673,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1576510351
    },
    {
        "content": "<p>temp could apply, though agree it wouldn't be common.  I don't know there's any specific preference here.  It might be something the spec could provide guidance on.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>?</p>",
        "id": 183561258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576511244
    },
    {
        "content": "<p>I feel using <em>work</em> feels best for the normal \"contact phone\" which the patient is supposed to call.</p>\n<p>Do you have any idea of requirements for being able to express telephone hours (we have such requirements)? As in, telephone is open 8.00 am-5.00 pm mon-fri etc. </p>\n<p>Probably will have to create an extension on Telecom in the Organization profile...Worth reporting a jira to get it into the standard set of extensions?</p>",
        "id": 183562660,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1576512051
    },
    {
        "content": "<p>Sure</p>",
        "id": 183567491,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576514929
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-25381\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-25381\">https://jira.hl7.org/browse/FHIR-25381</a></p>",
        "id": 183641500,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1576583967
    }
]