[
    {
        "content": "<p>We are looking at how to represent organizational hierarchies in a Swedish context. There are two nationally defined hierarchy levels that are important. Roughly translated into English it would be:</p>\n<ul>\n<li>Main parent organization - Like a region/county, or a private care provider</li>\n<li>Department/Division - Belonging to the above. On what \"level\" these are set is defined locally by the parent organization. </li>\n</ul>\n<p>At the moment the Organization resource has a partOf 0..1, and I can see options to use it for either of the above. But we would ideally want to include both in the same resource as both are relevant for evaluating e.g. access to healthcare information. </p>\n<p>So I guess my questions are:</p>\n<ul>\n<li>If we have a requirement like the above, which one should sit in the Organization.partOf?</li>\n<li>Are there others that have a need for multiple \"partOf\" Organizations?</li>\n<li>Would it be an idea to increase the Organization resource with having multiple partOf, each being a backbone element with the Organization reference, but also with a associationType or similar which could be a codedText</li>\n</ul>\n<p>I also saw this topic which is similar (but not necessarily based on the same requirements):<br>\n<a href=\"#narrow/stream/179166-implementers/topic/Location.2EmanagingOrganization.20cardinality\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Location.2EmanagingOrganization.20cardinality</a></p>",
        "id": 228410797,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1614692549
    },
    {
        "content": "<p>I guess the default meaning of partOf is 'being a child [or child of child, etc] (in the org chart) of', with the assumption that the aim is to go for a pure direct parent-child relationship.  It seems in addition to that you'd like to add (from all 'offspring' orgs) a reference to the 'main parent org' - an extension  perhaps ? Note that such reference is strictly taken not necessary as one can 'walk the references' all the way to the main parent org.</p>",
        "id": 228414151,
        "sender_full_name": "René Spronk",
        "timestamp": 1614693892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 228421642,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614696541
    },
    {
        "content": "<p>Is it really that clear that Organization.partOf refers to the direct parent?</p>\n<p>We could have something like this:</p>\n<p>1 - County/Region - <strong>Nationally defined org level 1</strong><br>\n1.1 - Hospital - not nationally defined, but locally relevant<br>\n1.1.1 - Department x, often associated with some main specialty - <strong>Nationally defined org level 2</strong><br>\n1.1.1.1 - sub-department, maybe associated with a subcategory of the above specialty - not nationally defined, but locally relevant<br>\n1.1.1.1.1 - Ward - not nationally defined, but locally relevant - not nationally defined</p>\n<p>There are use cases for:</p>\n<ul>\n<li>Who is my direct org parent</li>\n<li>Who is my owner on national level 1</li>\n<li>Who is my owner on national level 2</li>\n</ul>\n<p>Traversing through the full hierarchy every time is not great. </p>\n<p>Of course, we could always go the route of extensions and handle these Swedish parent org levels. But I would have thought that others have similar requirements to support more than one \"partOf\". Or incorporating other elements into the Organzation resource to define organizational belonging. </p>\n<p>These national levels define ownership of data and are used in the national framework for evaluating whether a reader of information is allowed to access information from a certain owner.</p>",
        "id": 228422546,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1614696875
    }
]