[
    {
        "content": "<p>Has any one represented a flag on a patient for 'Organ Donor'? An extension? an observation? </p>",
        "id": 153896198,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499348279
    },
    {
        "content": "<p>Would that fall into the same category as blood type for this tracker? <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12913\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12913\">GF#12913</a></p>",
        "id": 153896203,
        "sender_full_name": "Eric Haas",
        "timestamp": 1499350532
    },
    {
        "content": "<p>A Consent? :)</p>",
        "id": 153896222,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499357446
    },
    {
        "content": "<p>We have 2 distinct issues we're trying to map into FHIR.  First is the Consent to be an Organ Donor and second is the actual determination that a patient is an active candidate to be an organ donor.  In our case, we are analyzing the patients data for indications that a patient is a candidate (i.e. brain death, on ventilator, etc.) and sending an alert to the Organ Donor Program management folks so they can visit the family of the patient.  If we need to capture this determination, we would likely use Condition for that purpose.</p>",
        "id": 153896245,
        "sender_full_name": "Jim Kreth",
        "timestamp": 1499367392
    },
    {
        "content": "<p>Thanks for explaining your use-case. SO this would not be a case of an \"advanced\" consent directive (like a organ donor card use-case). You are more working on the near-critical workflow it seams. A consent of some kind would be gained, likely by authorized decision maker, guardian, etc. The Consent resource should be able to handle that. The Consent resource is focused on documenting the facts of a ceremony with the patient (or authorized proxy) regarding consent/authorization/directive.  It is not involved in the steps leading up to that ceremony, not even for Privacy Consent (the dominant focus so far). In the case of Organ Donation authorization/consent/directive; we have also not really modeled this yet, so there are likely holes and improvement opportunities. So we do encourage engagement with that. See <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> </p>",
        "id": 153896249,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499367973
    },
    {
        "content": "<p>As of right now, we are implementing DSTU2.  Using Consent to capture the donor consent makes perfect sense.  We may implement Consent ahead of our full migration to STU3 as it's a clean addition.  I think we'd still leverage Condition to manage the fact that a patient is an OD candidate (with or without current consent) which would provide a status lifecycle for the associated clinical workflow around organ procurement and transplant coordination.  A combinations of codes and bodySite could be used to define specific \"donations\" allowed.</p>",
        "id": 153896262,
        "sender_full_name": "Jim Kreth",
        "timestamp": 1499377201
    },
    {
        "content": "<p>I think that an administrative flag for 'is organ donor' is not a consent. It's a suggestion that there is a consent on record. Note, though, that consent to be an organ donor is one of the as yet undescribed uses of Consent</p>",
        "id": 153896299,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499404877
    },
    {
        "content": "<p>I would suggest that the Donor state is an Advanced Directive and can be handled as per all others.</p>",
        "id": 153896332,
        "sender_full_name": "David Pyke",
        "timestamp": 1499430184
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I don't see the advantage of adding a flag to Patient, over simply querying for Consent resources for this Patient that are organ donor type. I admit that we dont yet have that modeled, but it seems better than just a flag. I expect that organ donor status of YES/NO is not sufficient. Some are willing to donate some organs but not others. etc. Can you explain your rational?</p>",
        "id": 153896337,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499433490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193133\">@Jim Kreth</span> can you provide details on how you used DSTU2 Consent for this? I know the committee would love to see it, so that we can get more comfortable that the use-case is supported. Do you have improvement opportunities for us to work on? Please submit CR for any adjustments you see needed. It would be nice to get an example donor consent into the core model too.</p>",
        "id": 153896338,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499433615
    },
    {
        "content": "<p>I am working with a legacy system that has a flag 'is registered donor' on the patient record. I absolutely agree that by itself, this flag is not sufficient - but that's what they have, and what they need to publish, for emergency care provider usage</p>",
        "id": 153896423,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499549849
    },
    {
        "content": "<p>And while sharing around among systems, the complete consent may not flow about, but its existence on the patient could certainly be useful, informing others that they may need to treat things differently, without the full context.</p>",
        "id": 153896446,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499652329
    }
]