[
    {
        "content": "<p>Hi, my team is currently discussing the appropriate use of the Organization.type field. Is it ok to store a hospital department specialisation (e.g. \"neurology\") there or is it only for wider types like \"hospital department\"?<br>\nWe do not want to identify the departments using the type, but make it possible to ask something like \"all patients that have been to some neurology department in the past year\".</p>",
        "id": 195556897,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1588077592
    },
    {
        "content": "<p>I would go with Location and/or HealthcareService to capture the specialisation of a department. Organization would be the whole hospital, the wards locations of this organization.</p>",
        "id": 195562929,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1588080252
    },
    {
        "content": "<p>A \"hospital department\" is not always expressible by location, at least not in the US. FHIR Location is a physical place, and a \"neurology department,\" for example, may span multiple locations.</p>",
        "id": 195564874,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1588081032
    },
    {
        "content": "<p>Organization can be used to describe parts of an organization. Organization is not just for top-level organization.  As Vassil outlines some physical locations host many sub components of many organizations.   This is why there is the Organization.partOf element, so that these parts of the a larger organization can declare their relationship to a higher organization.</p>",
        "id": 195565589,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588081382
    },
    {
        "content": "<p>I tend to agree with <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , since hospital departments are often also organizational units with eg. their own director.</p>",
        "id": 195566854,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1588081946
    },
    {
        "content": "<p>I can tell you that as part of the PlanNet/PDex work, the payor community is planning on using <a href=\"http://hl7.org/fhir/R4/organizationaffiliation.html\" title=\"http://hl7.org/fhir/R4/organizationaffiliation.html\">OrganizationAffiliation</a> to represent this sort of information. I understand that on face, it seems that resource might only be for linking two organization entities, but I believe they are using it to capture information about things like Neurology department. In particular this is because <code>OrganizationAffiliation.specialty</code> for things like a speciality, and <code>OrganizationAffiliation.code.</code> You would then use that to connect to referenced <code>Organization</code> playing varying roles.</p>",
        "id": 195582070,
        "sender_full_name": "Robert McClure",
        "timestamp": 1588088180
    }
]