[
    {
        "content": "<p>Was wondering if US Core specifies how we can document orthostatic blood pressure? Orthostatic BP requires clinicians to document diastolic and systolic BP while the patient is seated or lying down, and then again when patient is standing. So you'd have two separate observations, one for seated/lying down, one for standing.</p>\n<p>I don't see a clear way to document the patient's position in the BP Profile (<a href=\"https://build.fhir.org/ig/HL7/US-Core/StructureDefinition-us-core-blood-pressure.html\">https://build.fhir.org/ig/HL7/US-Core/StructureDefinition-us-core-blood-pressure.html</a>)</p>\n<p>Has anyone come across this? Could the Observation.method element work here?</p>",
        "id": 255644815,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1633034446
    },
    {
        "content": "<p>I imagine your Observation would be <a href=\"https://loinc.org/34553-8/\">https://loinc.org/34553-8/</a> with all the various components in the component list of said observation.</p>",
        "id": 255645232,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1633034633
    },
    {
        "content": "<p>But no, US Core doesn't address it as it isn't part of USCDI</p>",
        "id": 255645421,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1633034720
    },
    {
        "content": "<p>Oh interesting -- so if I need to do orthostatic BP, i am basically unable to strictly adhere to the US Core BP profile, correct? That profile is binded to very specific LOINC codes.</p>\n<p>If this is the case, would you recommend using the US Core BP profile, but then utilizing the 34553-8 LOINC codes (and it's subsets)?</p>",
        "id": 255647591,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1633035649
    },
    {
        "content": "<p>I think if you have a normal BP measurement you output a US Core conformant BP Observation. If you have a orthostatic BP measurement you output such conformant to base FHIR. US Core doesn't say \"All BP measurements shall be output as this\". It does say, \"If you have this specific observation (normal BP) then these are the conformance rules.\"</p>",
        "id": 255779756,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1633109374
    },
    {
        "content": "<p>Thanks Daniel. Was curious if we should consider a US Core profile for Orthostatic BP? I feel like I'm seeing these more and more -- was curious if others are seeing this in their clinics.</p>",
        "id": 255802222,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1633119704
    },
    {
        "content": "<p>Not sure what is meant here by orthostatic blood pressure.  Literally, orthostasis means that your sympathetic nervous system compensates when you go from supine to standing and your blood pressure remains the same.  Orthostatic hypotension means your blood pressure falls when you stand. Many individuals actually have a lower blood pressure standing than supine, but not enough to cause symptoms.  Not sure either what \"Normal Blood Pressure\" means.  Normal varies with age and by individual to some extent.  Blood pressure is usually measured while sitting, not supine or standing.  The diagnosis of high blood pressure, hypertension, requires 2 measurements 4 weeks apart that are above some specified level (blood pressure being a panel of 2 measurements, systolic and diastolic).</p>",
        "id": 255961083,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1633277151
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> In the interim, I'm thinking about building an orthostatic BP profile within my own organization -- it would be modeled after existing US Core BP, except the LOINC codes would be binded to the orthostatic codes you provided. I think that's the best way to go -- but just wanted to bounce that idea off you.</p>",
        "id": 256770269,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1633712241
    },
    {
        "content": "<p>Sounds reasonable to me. Once you get it done, you might submit it to the USCore people for inclusion in the next version of it. After all USCDI doesn't state only non-orthostatic panel BP measurements, it says systolic and diastolic. That way the next group won't have to ask the same question.</p>",
        "id": 256777013,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1633714812
    }
]