[
    {
        "content": "<p>Hi all, basically my question is: is there a FHIR implementation for dummies type of guide out there? </p>\n<p>I am a student helping a health tech organization with implementing FHIR. I am trying to give them an overview of what they need to do. They collect patient data through an app and web service. They want to be able to use this data for machine learning models, and also want to be able to tell future clients that their services can be integrated with the client's EHR (given the client is using FHIR). </p>\n<p>I understand the data structures really well but getting lost as I read about implementation and architecture. I have written some scripts to convert the organization's patient data to FHIR resources, and am now validating the structures. I'm not sure what comes next. Should we have scripts to convert FHIR resources into our data structure? Am I supposed to set up a server and API?</p>",
        "id": 162813435,
        "sender_full_name": "AK",
        "timestamp": 1554727559
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/overview-dev.html\" target=\"_blank\" title=\"http://build.fhir.org/overview-dev.html\">http://build.fhir.org/overview-dev.html</a></p>",
        "id": 162824195,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554735375
    },
    {
        "content": "<p>There are also a lot of video tutorials available - if you search for \"FHIR devdays videos\", you can find a lot of good content.</p>",
        "id": 162824838,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554735832
    },
    {
        "content": "<p>Hi AK.  If your question is specifically about the use of FHIR with machine learning, while there is a lot of interest in the FHIR community, there is not a well established playbook yet.  In particular, recommendations of how to generate analytical data sets from FHIR resources are still being worked on, and the approach may depend on the specifics of your environment.  The \"analytics on FHIR\" stream would be a good place for follow up discussion on that topic.</p>",
        "id": 162828882,
        "sender_full_name": "Brian Wright",
        "timestamp": 1554738524
    },
    {
        "content": "<p>Thank you for your replies <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192016\">@Brian Wright</span></p>",
        "id": 162894003,
        "sender_full_name": "AK",
        "timestamp": 1554801523
    }
]