[
    {
        "content": "<p>We are implementing a service where you can query for critical information, either for a given timeframe (lastupdated) or for a given patient. we've chosen to use the Flag resource, since no specific resource object existed for this data . We are going to support two types queries; Flag?_lastupdated=date and Flag?patient=123. What is the best way to identify that this is critical information, not just an ordinary Flag object?<br>\nWould the Operations parameter be a good way to define this, and if so, is using both a search and an operation in the same GET query supported?</p>",
        "id": 153846548,
        "sender_full_name": "Odd A. S. Dahl",
        "timestamp": 1473168344
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192254\">@Odd A. S. Dahl</span> Flag always represents \"important\" information - specifically long-standing information.  So it wouldn't necessarily be used for a 1-time critical lab value, but it would be used for a severe latex allergy.  It would also be used to indicate less critical but still important things such as \"patient is pregnant\".  One of the challenges with returning \"critical\" information is the question of \"critical to whom?\" - what a GP, nurse, pharmacist psychiatrist or dentist would deem \"critical\" would all differ.</p>",
        "id": 153846567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473172847
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> We get the critical information from the EPJ system database, so it is up to them to present the information that is deemed critical. We also use classification codes to (coding: system/code) to organize the information so that the consumers can filter on what they are interested in.<br>\nIs it valid to use an Operation as a part of a search query? E.g. Flag?_lastUpdated=%3E2016-08-22T13:51:58&amp;_lastUpdated=%3C2016-08-31T13:52:04<strong>$operationname</strong>?</p>",
        "id": 153846676,
        "sender_full_name": "Odd A. S. Dahl",
        "timestamp": 1473255339
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192254\">@Odd A. S. Dahl</span>, operation invocations aren't actually queries, but they can work similarly, depending on what parameters you need to pass them.  So you'd be able to do this:<br>\n[base]/Flag/$operationname?_lastUpdated=ge2016-08-22T13:51:58&amp;_lastUpdated=le2016-08-31T13:52:04</p>\n<p>There's more information on operations here: <a href=\"http://hl7.org/fhir/operations.html\" target=\"_blank\" title=\"http://hl7.org/fhir/operations.html\">http://hl7.org/fhir/operations.html</a></p>\n<p>That said, that's a pretty tight time-window . . . :)</p>",
        "id": 153846709,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473277173
    }
]