[
    {
        "content": "<p>Hello! In a Swedish context we need to be able to present the owner of the data included in FHIR resources. The owner is defined to be a Care provider (lv1) and a care unit (lvl 2), which could for example be a region within Sweden and then a medical responsible unit at a hospital.  A typical scenario is that a consumer who retrieves an Observation resource, also need to get information about the owner lvl1 and 2.<br>\nWe have considered the following alternatives:</p>\n<ol>\n<li>Use one or two extensions directly from Observation resource.</li>\n<li>Use extensions within the referenced performer Organization. A consumer would then need to include/look up this Organization to know more about the information owner of the Observation. </li>\n</ol>\n<p>Since this is needed to support swedish law, it is something that most of the cases always needs to be included in one way or the other. It means that for alternative 1, we would need to include this extension for almost all profiles (not only Observations) that carry patient data.</p>\n<p>My question is: Is there another way, in FHIR, to represent ownership of resources similar to this?</p>",
        "id": 264265878,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1639035789
    },
    {
        "content": "<p>If there are any resources created by organization X, where the 'ownership' is a different organization Y, the option 2 won't work. This could potentially happen (?) if things are outsources from one organization to another one, or organization X updating a data item originally created by organization Y. </p>\n<p>Option 1 sounds the least attractive option to me. Option 2 is slightly better. Have you looked at Provenance ? Depending on the Swedish legal definition of 'ownership' this may well fit your requirement. It has the advantage that a Provenance may reference multiple resources. </p>\n<p>Could describe 'ownership' (what does that mean in your context) without using the word 'owner'?</p>",
        "id": 264266378,
        "sender_full_name": "René Spronk",
        "timestamp": 1639036262
    },
    {
        "content": "<p>Is this in any way tied in to the GDPR (EU privavcy law) legislation as adopted in Sweden ?</p>",
        "id": 264266475,
        "sender_full_name": "René Spronk",
        "timestamp": 1639036358
    },
    {
        "content": "<p>this does sound like provenance</p>",
        "id": 264267269,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639037029
    },
    {
        "content": "<p>This seems to be very much like the Provenance profile that US-Core created for \"Basic Provenance\" --  <a href=\"https://www.hl7.org/fhir/us/core/basic-provenance.html\">https://www.hl7.org/fhir/us/core/basic-provenance.html</a></p>",
        "id": 264302219,
        "sender_full_name": "John Moehrke",
        "timestamp": 1639057338
    }
]