[
    {
        "content": "<p>Hi guys, I'm having some very specific information which should be attached to a Domain Resource, so that they can be exchanged. There is no matching other Resource so that I thought about attaching a Parameters resource to my extended Domain Resource. Is this a good practice? Or should I create a whole new DomainResource for this purpose and attach this to my extended Resource?</p>",
        "id": 153909601,
        "sender_full_name": "Emre Avsar",
        "timestamp": 1505974855
    },
    {
        "content": "<p>If you need a \"custom\" resource, look at Basic.  It's intended to be used for this purpose.  Parameters resource instances aren't persisted or queriable.</p>",
        "id": 153909602,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505975229
    },
    {
        "content": "<p>OK. We're using FHIR only for the API, inside we have our domain specific model. We don't have any necessity to query parameters, but I read this line in the doc, which made me think about using it or not:</p>\n<blockquote>\n<p>This special resource type is used to represent the operation request and response.<br>\n(<a href=\"https://www.hl7.org/fhir/parameters.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/parameters.html\">https://www.hl7.org/fhir/parameters.html</a>)</p>\n</blockquote>\n<p>Seem's like not related to Resources, but more into Operation Input-Output without any Resource. Am I correct with this assumption?</p>",
        "id": 153909603,
        "sender_full_name": "Emre Avsar",
        "timestamp": 1505975457
    },
    {
        "content": "<p>Yes.  That's what Parameters is for.</p>",
        "id": 153909604,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505975611
    },
    {
        "content": "<p>Alright. Thanks. I'll follow the Basic resource (didn't realized that it existed until now).</p>",
        "id": 153909606,
        "sender_full_name": "Emre Avsar",
        "timestamp": 1505976283
    }
]