[
    {
        "content": "<p>Looking at the various Paradigms supported by FHIR, wouldn't it be better to call them: CRUDS, Composition, Message and Service ?  REST isn't an architecture (REST implies CRUDS, but not the other way around), CRUDS could be implemented on other protocol stacks. Document implies text whereas one may wish to do Compositions without text (CDA is a profile on Composition which requires text).</p>",
        "id": 153890011,
        "sender_full_name": "René Spronk",
        "timestamp": 1494923666
    },
    {
        "content": "<p>probably technically more accurate if you pust CRUDS+HTTP but who knows what that means?</p>",
        "id": 153890161,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495000865
    },
    {
        "content": "<p>So what's the HTTP architectural aspect that one wouldn't have when implementing CRUDS (let's say) as 5 webservices ? What does it add (from an architectural standpoint) beyond CRUDS ?</p>",
        "id": 153890212,
        "sender_full_name": "René Spronk",
        "timestamp": 1495033200
    },
    {
        "content": "<p>From a marketing perspective - and a recognition perspective - I think it makes sense to stick with the term REST</p>",
        "id": 153890228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495038578
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> In training courses the Architects keep hammering me - which is why I'd really want to move away from using REST as the name of a paradigm. \"CRUDS (over HTTP)\" or \"CRUDS (based on REST)\" are probably things I can get away with.</p>",
        "id": 153890350,
        "sender_full_name": "René Spronk",
        "timestamp": 1495093481
    },
    {
        "content": "<p>so change your slides...</p>",
        "id": 153890351,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495093546
    },
    {
        "content": "<p>Nobody commented on the suggested change from Document to Composition, i.e. allowing for compositions that don't have text in their \"sections\" versus documents (a profile thereof which requires text). We're seeing use cases (e.g. NHS Digital) where sections have no text,  receivers can create text if it so pleases them. To allow for Documents without text is a bit of a misnomer, hence the suggestion to use Composition.</p>",
        "id": 153890352,
        "sender_full_name": "René Spronk",
        "timestamp": 1495093790
    },
    {
        "content": "<p>I don't understand what you think is different there</p>",
        "id": 153890361,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495101122
    },
    {
        "content": "<p>In the mind of most people, a \"document\" contains text.  A composition may consist of sections (without text) and entries, and as such may not contain any text. So the paradigm (in my mind) is \"Documents (with or without text)\" or \"Composition\" whereby the latter has the advantage/disadvantage that to most who read the term it'll be an entirely new one. If we call it Document we'll have to subsequently tell them that documents may have no text, which goes contrary to expectations. From a pure marketing standpoint Document works better, for it's the more familiar one in healthcare.  </p>",
        "id": 153890372,
        "sender_full_name": "René Spronk",
        "timestamp": 1495109635
    },
    {
        "content": "<p>I think the larger majority (silent) is fine with the use of RESTful. I don't think CRUDS is all that more helpful.</p>",
        "id": 153890391,
        "sender_full_name": "John Moehrke",
        "timestamp": 1495119876
    },
    {
        "content": "<p>If we're talking about a FHIR Document, we're talking about text and human-readability.  That's an intrinsic part of the paradigm.  We don't have the notion of passing around arbitrary bundles</p>",
        "id": 153890399,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495123763
    },
    {
        "content": "<p>(Unless we're doing messaging, services or REST)</p>",
        "id": 153890400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495123786
    },
    {
        "content": "<p>so a composition that doesn't have text but is still wrapped up inside a document bundle? Why would it be useful to do that if the composition doesn't have any text int it?</p>",
        "id": 153890416,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495131016
    },
    {
        "content": "<p>Why do 13606 or OpenEHR do compositions? It's not because of the textual part, it is the fact that one creates a hierarchical structure of selected FHIR resources that are semantically grouped (and profiled) into sections and subsections. That's a very specific kind of bundle.</p>\n<p>Text is not essential in such a context. There is no trigger event, and it's client side orchestrated, so no, that's not messaging. <br>\nThis reflects how the NHS is currently using composition, it reflects most of the use of CCDA and CCD (where any text is basically ignored by almost all recievers, who just strip out the coded entries). We need to reflect the actual use of such structures in the FHIR standard itself.  Insisting that text shall be present seems a folly - one can create a profile that requires text (that would be the CDA on FHIR profile), but out of the box a section should not require text, just as resources in general are not required to have text.</p>\n<p>This thread proposed to call the wider architectural paradigm \"Composition\" (i.e. with or without text), and to use \"Document\" for a profile on \"composition\" which requires text.  </p>",
        "id": 153890497,
        "sender_full_name": "René Spronk",
        "timestamp": 1495177433
    },
    {
        "content": "<p>so I think you are still talking about packaging things up in a bundle of type document, but without text, and without the document obligations. </p>",
        "id": 153890505,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495187088
    },
    {
        "content": "<p>if so, that's wrong. it's not Document. It should be Bundle of type collection. and then it's perfectly legal</p>",
        "id": 153890506,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495187122
    },
    {
        "content": "<p>I missed the fact that collection has been added, but OK, let's call it that at the bundle level. I can include hierarchies based on Composition and Section within it - but those still require text.<br>\nWhy does Composition have to be a document and have text ? If I replace document with package or structure in its definition everything still holds true: <br>\n\"A set of healthcare-related information that is assembled together into a single logical &lt;strike&gt;document&lt;/strike&gt; &lt;add&gt;package&lt;/add&gt; that provides a single coherent statement of meaning, establishes its own context and that has clinical attestation with regard to who is making the statement. While a Composition defines the structure, it does not actually contain the content: rather the full content of a &lt;strike&gt;document&lt;/strike&gt; &lt;add&gt;package&lt;/add&gt; is contained in a Bundle, of which the Composition is the first resource contained.\"</p>",
        "id": 153890515,
        "sender_full_name": "René Spronk",
        "timestamp": 1495196253
    },
    {
        "content": "<p>Collections have no notion of sections and subsections.  The organization of the data in a Collection would not be hierarchical, it would be an interlinked web.  So far, FHIR does not support the organization of data into a hierarchy for exchange except for human-readability purposes.  And I can't conceive of a use-case where imposing a hierarchy on naturally non-hierarchical data would make sense for computability purposes.</p>",
        "id": 153890522,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495202592
    },
    {
        "content": "<p>So we'd need to start with a use-case.  And the use-case would need to move beyond \"other standards have done this\".</p>",
        "id": 153890523,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495202626
    },
    {
        "content": "<p>\"Why does Composition have to be a document and have text\" - it doesn't. Only when used in a document in the document paradigm do document expectations apply. You can - and we do - use Composition in the other paradigms. You could create a task to clarify the latter part of the text you quoted, that those rules apply to it's usage in the Document context</p>",
        "id": 153890542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495215005
    },
    {
        "content": "<p>Done - <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13426\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13426\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13426</a></p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Use cases include epSOS, where the burden of generating human narrative is up to the receiver because of language differences between the EU countries; English NHS which burdens the receiver with creating a visualisation of the data (they have good profiling at the resource level, so a receiver can be expected to create clinically safe text); most of CCD/CCD-A where receivers ignore the narrative, they're only interested in the structured data. </p>\n<p>As for why people would choose a \"hierarchical collection\" instead of a \"meshed net of resources\": I guess the human mind works that way (grouping items), and with-the-CDA-templating-mindset (which I know some FHIR core team members to abhor): sections are easier to profile than meshed nets of interlinked resources.</p>",
        "id": 153890597,
        "sender_full_name": "René Spronk",
        "timestamp": 1495265946
    },
    {
        "content": "<p>My question is \"what's the purpose of a table of contents if you don't have human readability?\".  You can share all of the discrete data without imposing the burden of sections and sub-sections.  Sections and subsections have no value computably - their sole purpose is organizing the narrative content for presentation.  If a receiver is expected to generate their own narrative, why can't they also generate their own hierarchy based on their own conventions?  In FHIR terms, why not just send the underlying resources and let the receiver generate the composition structure?  Because it's not as though you have a proper attestation of known content by the sender if you don't have the text the sender actually saw.</p>",
        "id": 153890602,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495286811
    },
    {
        "content": "<p>I agree that computably there's little difference in terms of overall semantics. But it's not about that, it's about the human aspect. If one likes to work top-down (pick the 5 most relevant resources [and associated leaf-resources] for categories (sections) x, y, z) appeals to some, whereas other may go for a fully meshed interconnected set of resources.  <br>\nPersonally I don't care either way, they are just 2 different ways of organizing the data, and more important yet, 2 rather different views on how one wishes to do profiling. If one cares to profile (in v3 speak) clinical statements at the section level, a hierarchy is the way to go for. If you wish to do profiling (only) at the individual resource level,  a fully meshed interconnected set of resources will be your thing. <br>\nMost importantly to me, I see the use-case, so I just want to make sure FHIR supports it next to documents-which-require-text-and-have-other-CDA-like-doc-properties (like attestation). </p>",
        "id": 153890618,
        "sender_full_name": "René Spronk",
        "timestamp": 1495299837
    },
    {
        "content": "<p>sure it supports it. Other than the loose wording you quoted that implied that Composition is only used in documents, I haven't seen any other problem - nor is it a problem with the paradigms, to me. </p>",
        "id": 153890628,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495309210
    },
    {
        "content": "<p>I don't see a problem with the current paradigms; but if one starts thinking about the use of Composition as part of a collection-bundle (for which we effectively already have implementations, although these still use the document bundle without any text anywhere), or Compositions as the focal resource of a FHIR message (could be useful, have to think about that one), aren't we introducing new paradigms? I don't think so.<br>\nThis thread started with the thought of renaming some of the paradigms. CRUDS (REST) will probably be the name I'll use for one of them, the other is likely to become either \"Compositions (Documents, Hierarchical collections)\" or (for marketing/simplicity reasons) \"Documents (with &amp; without text)\"</p>",
        "id": 153890653,
        "sender_full_name": "René Spronk",
        "timestamp": 1495349466
    },
    {
        "content": "<p>so I don't think that it's write to change the Document paradigm to allow for non-document behaviour. I just think that using Composition like this is something else. Perhaps it's not a documented paradigm per se, but I'm not sure that's a problem</p>",
        "id": 153890657,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495359787
    },
    {
        "content": "<p>agree - although if we start seeing use of the paradigm in production we'll have to add some documentation, probably as  a new paradigm.</p>",
        "id": 153890662,
        "sender_full_name": "René Spronk",
        "timestamp": 1495366321
    }
]