[
    {
        "content": "<p>Is there a modeling principle at work here?</p>\n<ul>\n<li><code>Immunization.performer.actor</code> allows Reference(Practitioner | PractitionerRole | Organization)</li>\n<li><code>Condition.asserter</code> allows Reference(Practitioner | PractitionerRole | Patient | RelatedPerson | Device)</li>\n</ul>\n<p>... is there an underlying reason for these differences and other, when all point back to <a href=\"http://build.fhir.org/participant.html#Participant\">http://build.fhir.org/participant.html#Participant</a> as a basis for design?</p>",
        "id": 240102123,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621885576
    },
    {
        "content": "<p>because the build points back; the committees don't, but the purpose of the build is to encourage the committees to consider the standardisation</p>\n<p>However I think I asked this; the argument was the immunizations are special and can't be performed by patients on themselves, or by related persons to them, and that devices also do not perform them (they may be used).</p>\n<p>I think that it's wrong domain analysis, but I'm not the expert. However this is a domain analysis question, not a design methodology issue</p>",
        "id": 240124627,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621897770
    },
    {
        "content": "<p>In this case I wasn't actually thinking about Patients, but rather about Organizations. FHIR currently allows us to say that an organization performed or at least acted in an immunization but not to say that an organization asserted or recorded a condition.</p>",
        "id": 240129684,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621902106
    },
    {
        "content": "<p>From a methodological perspective, it might be good for us to think about pointing to a pattern and specifically documenting any deviations, so if you are excluding a member of the pattern or including something that's not part of the pattern, you would explain why. I understand this may be too high a bar; just thinking about how to drive more consistency and clarity of documentation.</p>",
        "id": 240129793,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621902201
    },
    {
        "content": "<p>I think complaining about the inability of an Organization to be an asserter is reasonable.  Sometimes all you know it \"Payer XYZ told me this happened\".  And that's still better than nothing.</p>",
        "id": 240132492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621905089
    },
    {
        "content": "<p>my clients give vaccines all the time</p>",
        "id": 240133891,
        "sender_full_name": "Eric Haas",
        "timestamp": 1621906948
    },
    {
        "content": "<p>+1 to both points. I can file an issue on these; is there any broader methodological step we should be taking along the lines I mentioned above?</p>",
        "id": 240136155,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621909827
    },
    {
        "content": "<p>no. I don't think so. The point of the pattern work is to make the committees think about this</p>",
        "id": 240158012,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621932134
    },
    {
        "content": "<p>Methodology shift would be to remind people that when choosing alternatives for resource targets, the 80% rule doesn't apply.  I.e. once you decide a reference is 'in' from an 80%, you should allow all targets that are 'reasonable', even if some aren't currently super-common.</p>",
        "id": 240162116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621934830
    },
    {
        "content": "<blockquote>\n<p>The point of the pattern work is to make the committees think about this</p>\n</blockquote>\n<p>You mean, making them <em>document</em> their thought process is out of scope for the pattern methodology <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>? (I'm OK with this, just want to make sure I understand where you're drawing the distinction.)</p>",
        "id": 240206881,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621957209
    },
    {
        "content": "<p>I would love them to document, but I live in the real world ;-)</p>",
        "id": 240206929,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621957233
    },
    {
        "content": "<p>Added:</p>\n<ul>\n<li><a href=\"http://jira.hl7.org/browse/FHIR-32773\">FHIR-32773</a></li>\n<li><a href=\"http://jira.hl7.org/browse/FHIR-32774\">FHIR-32774</a></li>\n</ul>\n<p>for the specific missing participants here; won't propose any methodological changes at this time.</p>",
        "id": 240207920,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621957611
    },
    {
        "content": "<p>I added comments to those Jira issues to also consider using CoedeableReference</p>",
        "id": 240249853,
        "sender_full_name": "Paul Denning",
        "timestamp": 1621976601
    },
    {
        "content": "<p>I'm not sure I follow -- what kind of \"CodeableConcept\" would be available for a person or organization? Are you thinking like an identifier? We already have <code>Reference.identifier</code> when this is known <span class=\"user-mention\" data-user-id=\"194174\">@Paul Denning</span> .</p>",
        "id": 240252850,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621978268
    },
    {
        "content": "<p>You might just have \"asserted by a 'payer'\" - i.e. you're capturing the type of organization or type of provider, but not specifically who.</p>",
        "id": 240258265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621981680
    },
    {
        "content": "<p>Hmm. I'm not sure that's consistent with how we use CodeableReferences elsewhere, and I'm not sure it's what Paul has in mind.</p>",
        "id": 240264014,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621986177
    },
    {
        "content": "<p>That's true, actually.  Perhaps CodeableReference should only be allowed for resources that are primarily identified by their code (e.g. Medication, Substance, etc.)  Thoughts <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>?</p>",
        "id": 240264763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621986790
    },
    {
        "content": "<p>Well, you could argue that the pattern is similar - a particular clinician or 'my immunologist'</p>\n<p>But the CodeableReference pattern really applies when the resource being referred to an effectively an instantiation of the reference grammar behind the coding system. E.g. you can turn RxNorm codes into Medication Resources, and so you can see 'an RxNorm code' or 'a Medication resource' as functionally interchangeable</p>\n<p>That's not some thing that applies here - a Practitioner is not an instantiation of the logical model of 'a kind of practitioner', instead, you would be using the codeable part as a short cut to the one attribute of the referenced type that might substitute. We could document that as a pattern variant, one we allow for purposes of operational efficiency, but we'd have to be sure that wit was obvious which attribute was intended. </p>\n<p>So in this case, there's both a methodological question and domain questions: is just referencing a type of practitioner a meaningful thing? <span class=\"user-mention\" data-user-id=\"194174\">@Paul Denning</span> hasn't provided actual use cases or business analysis</p>",
        "id": 240265968,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621988101
    }
]