[
    {
        "content": "<p>Hi,<br>\nTrying to find the best fit for Ward Transfers in the Encounter Resource. <br>\nCurrently we just hold 1 record for the full encounter in FHIR Encounter (shows latest location/Ward)<br>\nWe need to capture Ward transfers data -Patient went from WardA to B to c</p>\n<p>There seem to be 2 choices<br>\nLocation - holds Location,Status,Type,Period</p>\n<p>use PartOf to capture additional encounters that belong to the main Encounter<br>\nEncounter allows a flexible nesting of Encounters using the partOf element. For example:</p>\n<div class=\"codehilite\"><pre><span></span><code>A patient is admitted for two weeks - This could be modeled using a single Encounter instance, in which the start and length are given for the duration of the whole stay. The admitting doctor and the responsible doctor during the stay are specified using the Participant component.\nDuring the encounter, the patient moves from the admitting department to the Intensive Care unit and back - Three more detailed additional Encounters can be created, one for each location in which the patient stayed. Each of these Encounters has a single location (twice the admitting department and once the Intensive Care unit) and one or more participants at that location. These Encounters may use the partOf relationship to indicate these movements occurred during the longer overarching Encounter.\n</code></pre></div>\n\n<p>Wondered which option others had chosen?<br>\nPartOf seems to give the option of capturing additional data (for example if Care provider/Specialty changed at same time) as you can utilise all the Encounter fields</p>\n<p>Location would mean capturing the data as nested locations (arrays) - from experience arrays can be difficult to report from</p>\n<p>Does anyone have any experience in which way they went  &amp; why?</p>",
        "id": 233448929,
        "sender_full_name": "Leonie Bedford",
        "timestamp": 1617783012
    },
    {
        "content": "<p>Using sub-encounters would make sense if the organization had distinct identifiers for each and you had a notion of discharge/admission between the sub-encounters.  Organizations typically have specific policies about what constitutes an encounter and a sub-encounter.  If none of those come into play, stick with a single encounter and use Encounter.location</p>",
        "id": 233592919,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617849034
    }
]