[
    {
        "content": "<p>Hello, <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> ,  we are trying to map participating providers table on Fhir (it's a table describing for each medical provider what health plans he is registered with). Could you please give an advice on how to better map such table on a Fhir resource, maybe there are some examples? We are currently considering Group resource, and each group will consist of providers list registered with some health plan. We were thinking to reference health plan as Reference/Organisation, but there is no such reference object in Group resource. We would like to suggest you extend Group resource with a group.subject field which will be a reference to any Fhir object.</p>",
        "id": 153928841,
        "sender_full_name": "Varvara",
        "timestamp": 1516019427
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194124\">@Varvara</span> we have been designing a Catalog that overlaps some of the things you described.<br>\nCatalog is Composition profile that contains a set of EntryDefinitions. Each entryDefinition can be for example lab procedures. So you can have a list of the lab procedures that this institution supports, and how they are defined.</p>",
        "id": 153928842,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516019612
    },
    {
        "content": "<p>not sure about the financial aspects of those, we are still looking at the definitions - i just wanted to give you that context.</p>",
        "id": 153928843,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516019645
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194124\">@Varvara</span> There is a new resource in development called ProductPlan (name may change, see <a href=\"http://build.fhir.org/productplan.html\" target=\"_blank\" title=\"http://build.fhir.org/productplan.html\">http://build.fhir.org/productplan.html</a>) which will contain the plan information and  this will be part of an overall directory structure being lead by Patient Administration, <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>, so that one can search for providers who are part of the network or otherwise accept particular plans.</p>",
        "id": 153928850,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1516021059
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> , <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> do we want to align Catalog with this discussion?<br>\nEsp the part of \"overall directory structure\" - there may be overlaps.</p>",
        "id": 153928852,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516021298
    },
    {
        "content": "<p>pinging <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span> <span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span> JFY</p>",
        "id": 153928853,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516021346
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> We will probably be discussing this in PA on Thursday Q2 at the WGM, that would be a good time I think to understand what each needs and plan a way forward.</p>",
        "id": 153928855,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1516021558
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , thank you very much for your sharing your experience on this topic, the new version of the EntryDefinition resource  seems very useful for a lot of cases, not only this one. We are considering to use it after Fhir version update, thank you again!</p>",
        "id": 153934110,
        "sender_full_name": "Varvara",
        "timestamp": 1517396947
    },
    {
        "content": "<p>Be aware that EntryDefinition isn't an approved resource.  It may end up being used as a pattern for other resources (e.g. Substance, Device, Medication) rather than as a stand-alone resource</p>",
        "id": 153934132,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517407288
    }
]