[
    {
        "content": "<p>Am I right to assume, that token search never returns partial matches? I mean, we wouldn't want the search for identifier \"1\" to return a result with identifier \"11\", right?<br>\nBut what if I want to search for a partial code, e.g. search for all ICD-10 diagnoses that start with \"F17\". Is that possible? Is there a modifier for that (like, the opposite of \":exact\")? <br>\nIf I read this correctly, the :text modifier does in fact do a partial search but not on the value of the code but instead on the display (which may not contain the actual code).</p>",
        "id": 153844630,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471876089
    },
    {
        "content": "<p>you're looking for subsumption, not partial match</p>",
        "id": 153844678,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471898260
    },
    {
        "content": "<p>Um. yes, that could work. Assuming I have the whole ICD-10 catalogue as a structured ValueSet. <br>\nOk next use case: In Germany, we have identifiers for Health-Care providers in which the first two digits have a meaning (=association with an administrative district) and I was wondering if there was a way to search for all instances of Organization where the identifier starts with \"xx\". (I'd guess that there are other identifier systems out there, where prefixes have a search-worthy meaning?)</p>",
        "id": 153844765,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471937072
    },
    {
        "content": "<p>assuming you have a terminology server that understands ICD-10. yes</p>",
        "id": 153844769,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471939455
    },
    {
        "content": "<p>and no, we haven't defined anything like that. I guess you'd want to define a custom modifier. It doesn't sound like common practice to me</p>",
        "id": 153844770,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471939496
    },
    {
        "content": "<p>If your code system and terminology server provided a filter like \"concept regex 'xx.*'\" then it might be possible</p>",
        "id": 153844842,
        "sender_full_name": "Jim Steel",
        "timestamp": 1471992182
    }
]