[
    {
        "content": "<p>Hi,</p>",
        "id": 153884880,
        "sender_full_name": "Mahmoud Alakraa",
        "timestamp": 1492384987
    },
    {
        "content": "<p>We want to transfere Password choosen by patient as a part of patient resource, and we are confused what is the best way to pass this sensitive information throw the connection?</p>",
        "id": 153884881,
        "sender_full_name": "Mahmoud Alakraa",
        "timestamp": 1492384987
    },
    {
        "content": "<p>it is better to have the authentication information outside patient resource.  Patient password should be stored seperately. You can create a custom extension to pass the login and password information</p>",
        "id": 153884890,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1492413733
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192704\">@Mahmoud Alakraa</span> FHIR is a data model and interaction model for the healthcare specifics. It is designed to be built on-top of normal http REST security models. Such as SMART profile of OAuth. The security workgroup has worked hard to keep security out of the model, and in re-usable security layers. This is not to say that security (passwords) are 'more sensitive'; that is not the point. The point is to separate the layers, and leverage technology (security) that is developed for all types of domains.</p>",
        "id": 153884904,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492430116
    },
    {
        "content": "<p>thank you very much <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  <span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span> </p>",
        "id": 153884932,
        "sender_full_name": "Mahmoud Alakraa",
        "timestamp": 1492466766
    },
    {
        "content": "<p>This issue related not only to password extension. Many of our clients asked for such type of functionality. Couple of times we discussed ability to introduce <em>resource attributes filters</em> or <em>masks</em>. Now  FHIR search has <em>_elements</em> parameter, but it does not work with <em>read</em> and other operations - i would recommend to introduce something like <em>VisibleElements</em> resource, which could be attached to Operation and interpreted like filter for resource  content.</p>",
        "id": 153885616,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1492926267
    },
    {
        "content": "<p>_elements does work with read</p>",
        "id": 153885622,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492943954
    }
]