[
    {
        "content": "<p>In DSTU2, an update operation creates a new version of the resource with the contents that were provided in the update, without looking at the previous version. For example, if I want to update the name of a patient, I can't send an update operation with just the name - I must first read the current version, then modify the name and send the update request with all the contents. Is there Patch functionality planned for STU3, so I don't need the entire transaction of read-modify-write? (i.e. tell the server exactly what changes I want to make, and it will apply the \"patch\" on its own)</p>",
        "id": 153857528,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1479385506
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192982\">@Shlomy Reinstein</span> <br>\nyes this is part of STU3: <a href=\"http://build.fhir.org/http.html#patch\" target=\"_blank\" title=\"http://build.fhir.org/http.html#patch\">http://build.fhir.org/http.html#patch</a></p>",
        "id": 153857563,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1479394382
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 153857575,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1479397371
    },
    {
        "content": "<p>It's sort of sad that the FHIR designers left this more functional approach where you wouldn't change a resource, but rather create a new version of it. Yes, it puts a bit more load on the client, but it would bring us a step further away from <a href=\"https://youtu.be/-6BsiVyC1kM\" target=\"_blank\" title=\"https://youtu.be/-6BsiVyC1kM\">\"place-oriented programming\"</a> (which looks like a pervasive issue in our industry).</p>",
        "id": 153858020,
        "sender_full_name": "Thomas Herchenroeder",
        "timestamp": 1479759239
    },
    {
        "content": "<p>so I think he's wrong; if you go to a non-place orientated programming approach, you move the core problem from 'managing the space' to 'identifying the fact', given that you can no longer identify the fact by it's location. And I say this as someone who built a very large commercially successful insert only database</p>",
        "id": 153858083,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479788662
    },
    {
        "content": "<p>and in fact my server is almost an insert database. And FHIR is almost an insert only database, where the resource id (<a href=\"http://fhir3.healthintersections.com.au/open/Patient/1\" target=\"_blank\" title=\"http://fhir3.healthintersections.com.au/open/Patient/1\">http://fhir3.healthintersections.com.au/open/Patient/1</a>) is a partial identity, and the specific versions of the resource are the real identities, and resource versions are immutable facts. </p>",
        "id": 153858084,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479788762
    },
    {
        "content": "<p>and my server PATCH operation is a facade over that fact</p>",
        "id": 153858085,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479788779
    },
    {
        "content": "<p>this works just like a version control system. Though maybe if that's all he's saying... that's what we did, and PATCH is just a facade method on it. Which is useful</p>",
        "id": 153858086,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479788826
    },
    {
        "content": "<p>So PATCH is returning a new version of the resource? That would be nice. But like with version control systems, you might run into merge issues when you are not patching the latest version of the resource.</p>",
        "id": 153858107,
        "sender_full_name": "Thomas Herchenroeder",
        "timestamp": 1479807836
    },
    {
        "content": "<p>you can only patch on the latest version</p>",
        "id": 153858112,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479809107
    },
    {
        "content": "<p>FHIR lets you look at things either way - a version control/insert only sequence, or a record operation. We could never commit to supporting the first only until everyone rewrites their systems...</p>",
        "id": 153858113,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479809163
    }
]