[
    {
        "content": "<p>Simplest use-case for patient-authored procedures would be a patient filling out a \"recent medical history\" questionnaire and the response being transformed into appropriate resources.  Another would be a patient-managed PHR.  Perhaps when we get to a world where all electronic information is instantly available to the patient there'd be no need for a patient to author records because there'd already be an electronic version from an authoritative source - but we're a long way from there.  And even then, you'd have patient-authorship of patient-performed procedures - exercises, training regimens, etc.</p>",
        "id": 153993836,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536243985
    },
    {
        "content": "<p>(split from Pulse Oximetry thread <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> )</p>",
        "id": 153993837,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536244028
    },
    {
        "content": "<p>Thanks for starting a specific thread. From what you indicate a possible use-case is where a patient has self-diagnosed (not to say that in a negative way) a need to do something. Like your examples of an exercise regimen.  They could then attach the daily progress as Observations to that Procedure. right?   Why Procedure vs CarePlan in this case? Seems both are possible, not clear the distinction.</p>",
        "id": 153993843,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536244754
    },
    {
        "content": "<p>In the exercise regime, it could be it was self-inspired and reported.  Or it could have been ordered by a clinician - but still performed/reported by the patient or their relative.</p>",
        "id": 153993845,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536244957
    },
    {
        "content": "<p>CarePlan describes what was intended and lets you capture a general status on a particular activity - e.g. \"yes I'm doing my exercises\" or \"no, I haven't been doing my exercises\".  Individual procedures would show exactly which exercises were done and when.</p>",
        "id": 153993846,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536245011
    }
]