[
    {
        "content": "<p>Is there a place where we could store additional patient information for a form of sport (for example: Archery, Badminton, Cricket, Bowling.)<br>\nWe would need this for hospitals specialized in sport injuries.</p>\n<p>These are a few places where we can imagine putting this information but would like to know what the best approach would be.    </p>\n<ul>\n<li>Create a new basic resource with a custom code system</li>\n<li>Using the group resource (does not really feel like the correct fit)</li>\n<li>Create a patient resource extension.</li>\n</ul>\n<p>At this stage we would only need this information for intraoperability reasons (within our systems) but would love to model it at the right place if we would need this in the future for interoperability aswell</p>",
        "id": 190158475,
        "sender_full_name": "Sandro Zbinden",
        "timestamp": 1583835903
    },
    {
        "content": "<p>Presumably this would be on an Observation or Condition?  ICD-10 codes get incredibly precise sometimes, so you may find what you need there.  Otherwise, I expect you're looking at an extension.</p>",
        "id": 190180619,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583851791
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thanks a lot for your response.</p>\n<p>Perhaps I did not express myself clearly in the first message. The sports are used as information for scientific evaluations and are not directly related  to hospitalisation. Therefore, we believe that Condition is the wrong resource because only clinically relevant information should be stored there.</p>\n<p>As we try to achieve intraoperability of different hospitals, we would like to avoid extensions. Otherwise we have separate extensions for all hospitals with extra patient attributes.</p>\n<p>We have now read that observations can also be used for demographic characteristics. However, we fear that we are modelling something that does not belong here. Observations are intended to record measurements and subjective points in time assasments. And we think this information isn't a measurement or an assasment.</p>\n<p>Would it be better to create a new profile for a basic resource in this case.</p>",
        "id": 190188960,
        "sender_full_name": "Sandro Zbinden",
        "timestamp": 1583855493
    },
    {
        "content": "<p>So you're just interested in \"what sports does this individual play\" and correlating that with what issues they have?</p>",
        "id": 190189393,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583855663
    },
    {
        "content": "<p>If so, Observation would be the correct way to capture that information.</p>",
        "id": 190189424,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583855679
    },
    {
        "content": "<p>In my mind it is an Observation, and it is of clinical relevance. Observations act as supporting-information for Conditions (sports injury) or Procedures (treatment thereof).</p>",
        "id": 190189529,
        "sender_full_name": "René Spronk",
        "timestamp": 1583855720
    },
    {
        "content": "<p>We are talking about top athletes. These people are practicing a sport. The information is comparable to a profession. The data is usually collected by a patient administration system (ERP). It is not health professionals who ask this question. </p>\n<p>Usually these values come from a patient administration system (ERP) interface. Should such systems not only write to administrative resources and not to clinical ones like Observation?</p>",
        "id": 190190793,
        "sender_full_name": "Sandro Zbinden",
        "timestamp": 1583856332
    },
    {
        "content": "<p>Observation isn't necessarily clinical.  It's about capturing point-in-time assertions about the subject, particularly where the assertions are time-bound or may have subjectivity.</p>",
        "id": 190192611,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583857173
    },
    {
        "content": "<p>If you have a complex model that describes the details of the sport and multiple different aspects, then looking at Basic might be appropriate, but if you just want to capture some basic information like \"what do you play?\", \"how many hours a week do you play?\", etc. then Observation would be appropriate.</p>",
        "id": 190192822,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583857266
    },
    {
        "content": "<p>Ok got it. Thanks a lot for your help!</p>",
        "id": 190204162,
        "sender_full_name": "Sandro Zbinden",
        "timestamp": 1583862960
    }
]