[
    {
        "content": "<p>Hi - new to FHIR here. <br>\n<strong>Wondering if there's a FHIR resource or extension that exists out there that I could use to store a patient's status (e.g. \"new\", \"inactive\", \"ineligible\"). I'd like to associate a status (one of a list that I specify) to each Patient.</strong> Here's what I've considered:</p>\n<ul>\n<li>I didn't find anything on the Patient resource that seems to match this. Meta &gt; tags seem flexible enough, however this is pretty core/business-logic data, not metadata, so it didn't seem like a great fit. <a href=\"https://www.hl7.org/fhir/resource-definitions.html#Meta.tag\" target=\"_blank\" title=\"https://www.hl7.org/fhir/resource-definitions.html#Meta.tag\">https://www.hl7.org/fhir/resource-definitions.html#Meta.tag</a></li>\n<li>I've done a basic search for \"status\" here: <a href=\"http://hl7.org/fhir/STU3/extensibility-registry.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/extensibility-registry.html\">http://hl7.org/fhir/STU3/extensibility-registry.html</a> and here: <a href=\"https://registry.fhir.org/\" target=\"_blank\" title=\"https://registry.fhir.org/\">https://registry.fhir.org/</a> but I didn't find anything that quite fit our requirements. </li>\n</ul>\n<p>Before I go ahead and just build my own Extension, I thought I'd ask if anyone knows of one that seems like a good fit. <br>\nAlso, if anyone has any particularly useful resources for creating a first basic extension, I'd appreciate that too.</p>",
        "id": 190876665,
        "sender_full_name": "T J",
        "timestamp": 1584463376
    },
    {
        "content": "<p>You see patients usually during encounters (<a href=\"http://hl7.org/fhir/encounter.html\" target=\"_blank\" title=\"http://hl7.org/fhir/encounter.html\">http://hl7.org/fhir/encounter.html</a>). Encounter has a status. If this doesn't help, it's generally a good idea to consider other ressources which may reference the ressource you are dealing with, when you don't find something where you would expect it.</p>",
        "id": 190943191,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1584513804
    },
    {
        "content": "<p>I just noticed that the value set for Encounter.status is required, so you can't use your own status codes. So maybe this was not what you were looking for...</p>",
        "id": 190947289,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1584518270
    },
    {
        "content": "<p>Patient has an 'active' flag that covers active vs. inactive.  The notion of 'new' (presumably to the organization responsible for the patient) would need to be captured as an extension - it's too fuzzy to have much value in general exchange.  The notion of ineligible would need to be tied to \"for what?\" - is it relevant to a clinical study?  A planned procedure?  A type of insurance?  Where the concept gets captured will be driven by what they're ineligible for.</p>",
        "id": 190982046,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584539419
    },
    {
        "content": "<p>Since I need the set of possible \"statuses\" to meet our needs exactly, I think an Extension is the way to go. Thanks very much for the help!</p>",
        "id": 190985405,
        "sender_full_name": "T J",
        "timestamp": 1584540926
    },
    {
        "content": "<p>How about group? <a href=\"https://www.hl7.org/fhir/group.html\" title=\"https://www.hl7.org/fhir/group.html\">https://www.hl7.org/fhir/group.html</a></p>",
        "id": 192716414,
        "sender_full_name": "Apmis Ainad",
        "timestamp": 1585856850
    },
    {
        "content": "<p>Group is if you're wanting to allow a collection of individuals to be a subject rather than just a single individual</p>",
        "id": 192717110,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585857198
    },
    {
        "content": "<p>Also status is in some form of context...<br>\n(especially things like eligibility for one thing but not another) so EpisodeOfCare might help with context.</p>",
        "id": 192778132,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1585906091
    }
]