[
    {
        "content": "<p>Hello, We are implementing the Scenario for Standalone Launch for Patient using the app and accessing the data from EHR. We are having following Queries where we need suggestions:</p>\n<p>1&gt; How does the Patient Revocation actually works in the workflow? Who initiates the revocation_endpoint URL and How it is informed to Resource Server that token is revoked by patient?</p>\n<p>2&gt; Is it mandatory for the app to declare the Intent of data usage and if app has not declared, do we need to mandatorily provide the alert to the Patient after their login identification?</p>\n<p>3&gt; Is it mandatory for app to have the questionnaire towards HIPAA and data Usage and if app has not entered the questionnaire then do we need to mandatorily provide the alert to the Patient after their login identification?</p>\n<p>Please suggest. Thanks in advance.</p>",
        "id": 251530803,
        "sender_full_name": "Nihar",
        "timestamp": 1630489406
    },
    {
        "content": "<p>I'm not understanding the 3rd question.  The first 2 questions are best raised on <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a></p>",
        "id": 251573381,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630508183
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : Thank you so much. I will also raise the same to Smart Streams.  Also, In 3rd Question, what is mean is that there are some general questionnaires to get the details related to the apps working and dealing with patient data like \"Where does this app would store user data?\". And based on those details alerting the patient for the same. Is this required or not...??</p>",
        "id": 251576023,
        "sender_full_name": "Nihar",
        "timestamp": 1630509055
    },
    {
        "content": "<p>You mean \"does this app have to communicate to the patient where it's going to store information\"?  I believe SMART only requires communication to the patient about permissions to the FHIR data store being authorized.  No communication is required about access to data stores that aren't using SMART for authorization.  However, this too would be best asked on the <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a> stream.</p>",
        "id": 251576853,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630509352
    }
]