[
    {
        "content": "<p>I want to send glucose and vital signs data from my patient platform to my GP. The patient platform does FHIR REST. The GP does Edifact email. Hence there is an intermediary service that translates FHIR to Edifact and REST to email.</p>\n<p>There are several options to make this work:</p>\n<p>- Define Operation that explicitly states the endpoint should translate and where to send it to<br>\n- Use MessageHeader that states actual source/target and leave it up to endpoint configuration outside of FHIR that this leads to a transform<br>\n- ...?</p>\n<p>The MessageHeader route is attractive in a messaging country such as ours, but MessageHeader has a drawback in that MessageHeader.enterer|author are fixed to Practitioner which basically means that Patient authored content is not supported. Considering both are optional I could just leave those out and leave the MessageHeader.data tell the receiver that it was patient authored.</p>\n<p>Any suggestion or advice? Should I file a tracker for supporting patients in the MessageHeader resource?</p>",
        "id": 153869218,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485427348
    },
    {
        "content": "<p>Use Provenance to identify that the data came from the Patient.  Use meta tag value PATAST to indicate the data is Patient Asserted. Also, since you are translating you might want to have another Provenance record for the translation and add marking to the data with TRSLT. These meta tags are indicators of integrity attribution <a href=\"http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html\">http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html</a> </p>",
        "id": 153869243,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485445179
    },
    {
        "content": "<p>Wow. Didn't see that one coming. I'll start reading. Thanks for the suggestion</p>",
        "id": 153869246,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485446159
    },
    {
        "content": "<p>I will note that we have discussed this in committees but I don't think this has made it into examples or to the Security/Privacy Module page.. but it should. So if you make good examples, or have questions... please help.  Getting realworld experience is important.</p>",
        "id": 153869254,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485447986
    },
    {
        "content": "<p>Could you use Observation.performer with a reference to the Patient to convey that the Patient was responsible for that vitals observation value?</p>",
        "id": 153869290,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1485460802
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> In general it may be useful to have PATAST / Provenance resource, although almost all of its contents would be of little use when translation from FHIR to legacy formats such as EDIFACT or HL7v2.  TRSLT (you probably meant: MAPPED, which is a better fit IMHO) would make sense if translating <em>to</em> FHIR, but the other way around it doesn't come into play at all. <br>\nAlexanders question is about how one instructs the receiving side to \"go translate this, en route to designated receiver\". In my mind that's an operation (e.g. \"TranslateToEdifactAndRoute\") with as input parameters a bundle of resources, a referenced sending resource, a referenced recieving resource, as well as some other stuff. </p>",
        "id": 153869322,
        "sender_full_name": "René Spronk",
        "timestamp": 1485501956
    },
    {
        "content": "<p>If the request about how to make a service that executes some process, then yes an Operation is appropriate. I didn't understand that. </p>",
        "id": 153869352,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485520038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191360\">@Michelle M Miller</span> yes and we will. The problem arises when we would do Bundle.type Message + MessageHeader. MessageHeader has an author which at present can only be a Practitioner. That doesn't fly with Patient authored contents, so in the messaging paradigm the Patient is not a supported sender</p>",
        "id": 153869353,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485520103
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Rene and I spoke briefly F2F about this as well. I'm pretty sure Operation is the best way forward. However we depend a little on what the server is willing to offer. At present that is a SOAP based interface that accepts content-type <em>/</em> in SOAP:Body</p>",
        "id": 153869354,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485520511
    },
    {
        "content": "<p>When it comes to services, many API types are available. One can always define an API using server friendly interaction technology with FHIR defined parameters.</p>",
        "id": 153869355,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485520657
    },
    {
        "content": "<p>Sure, I suppose a SOAP:Body with a &lt;Parameters/&gt; resource that contains what you would preferably POST to a FHIR RESTful endpoint, but instead POST using SOAP is equally valid and very close to what you would do if the endpoint had actually been RESTful</p>",
        "id": 153869356,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485520801
    },
    {
        "content": "<p>As long as the SOAP interface passes the contents along to the appropriate translation or responds with an HTTP 500 / SOAP:Fault we're good to go -- Functionally the SOAP:Fault matches the OperationOutcome</p>",
        "id": 153869357,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485520906
    },
    {
        "content": "<p>I think patient-authored messages is a long way outside the 80% for messaging.  So I'd lean towards using an extension if you wanted to convey that.</p>",
        "id": 153869411,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485575455
    }
]