[
    {
        "content": "<p>My team is working on a system for IVF practices in which workflows and general patient management are often targeted towards more than one patient at a time (e.g. male and female going through IVF, Patient/partner/surrogate, etc...) </p>\n<p>Part of the challenge is that a couple may come in for a treatment cycle, and then a few years later one of the patients comes back with another partner for another cycle. </p>\n<p>Is there a recommended way to handle this scenario? Our idea is to extend the EpisodeOfCare resource to be able to refer to a group of patients rather than just a single patient. That EpisodeOfCare would then be used as a container for all of the shared events (contracts, consents, communications, etc...).</p>\n<p>Any issues with that approach? </p>\n<p>Thanks for any guidance you can provide.</p>",
        "id": 253025570,
        "sender_full_name": "Taylor Stein",
        "timestamp": 1631496569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Would very much appreciate your thoughts on this. Thanks!</p>",
        "id": 253135619,
        "sender_full_name": "Taylor Stein",
        "timestamp": 1631557165
    },
    {
        "content": "<p>You could certainly link Group activities to EpisodeOfCare instances specific to each paricipant.  You wouldn't want to share content across groups.  E.g. The new partner doesn't have the right to see information related to the sessions with the old partner.</p>",
        "id": 253139715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631558837
    },
    {
        "content": "<p>Absolutely - The thinking is that if/when a patient group changed, then a new EpisodeOfCare would be created with the new set of participants. </p>\n<p>The model would look something like this:<br>\n<a href=\"/user_uploads/10155/mxNYEnNqeAGnyCaK0NpmRvxw/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/mxNYEnNqeAGnyCaK0NpmRvxw/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/mxNYEnNqeAGnyCaK0NpmRvxw/image.png\"></a></div><p>Patient 1 is only involved in Episode 1 and can therefore only see Event 1<br>\nPatient 2 is involved in both Episodes 1/2 and can therefore see Events 1/2<br>\nPatient 1 is only involved in Episode 2 and can therefore only see Event 2</p>",
        "id": 253154207,
        "sender_full_name": "Taylor Stein",
        "timestamp": 1631564565
    },
    {
        "content": "<p>An Event can't have a subject of an EpisodeOfCare.  The 'subject' would need to be a Group.</p>",
        "id": 253163539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631568516
    },
    {
        "content": "<p>Thanks! That makes sense</p>",
        "id": 253320157,
        "sender_full_name": "Taylor Stein",
        "timestamp": 1631651893
    }
]