[
    {
        "content": "<p>I'm currently profiling the Patient resource for France. I need to extend the address datatype in this way:</p>",
        "id": 153896812,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1499936151
    },
    {
        "content": "<ul>\n<li>remove the use dataelement (0..0) of the address datatype and replace it by the extension fr-address-use which uses a specific ValueSet for France,</li>\n</ul>",
        "id": 153896814,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1499936238
    },
    {
        "content": "<p>-add a new dataelement (fr-address-code-insee) which doesn't exist in the standard.</p>",
        "id": 153896815,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1499936295
    },
    {
        "content": "<p>I want to use this new adress datatype for specifying the adress element and the contact element of the Patient resource, but I don't find how to indicate in Forge that the adress dataelement is no longer an address datatype but a fr-address-datatype.</p>",
        "id": 153896816,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1499936450
    },
    {
        "content": "<p>In general, removing elements impedes interoperability.  It means that a system that normally populates the element - and has data for it - must customize their interface to exclude that element just for the privilege of not having their data rejected by your system.  Given that you're free to ignore data you don't need/want, it's far better to just not mark the element as \"mustSupport\" - meaning systems are free to not pay any attention to it or have the capability of populating it, but that it's not <em>wrong</em> for them to send it if they have it.  </p>\n<p>I'll leave it to others to respond to the Forge question.  (Typically Forge questions are answered fastest on the 'conformance' stream.)</p>",
        "id": 153896869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499965187
    },
    {
        "content": "<p>I'm fascinated by the idea that French addresses are so unlike those elsewhere that the regular address element cannot be at least partially populated. I'd say that if this is truly the case, we need to revisit the address data type.</p>",
        "id": 153896973,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1500077315
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193416\">@Isabelle GIBAUD </span> We have done similar for the German Patient profile, including using a German Address profile:<br>\n<a href=\"https://simplifier.net/BasisprofilDE/patient-de-basis\" target=\"_blank\" title=\"https://simplifier.net/BasisprofilDE/patient-de-basis\">https://simplifier.net/BasisprofilDE/patient-de-basis</a><br>\n<a href=\"https://simplifier.net/BasisprofilDE/address-de-basis\" target=\"_blank\" title=\"https://simplifier.net/BasisprofilDE/address-de-basis\">https://simplifier.net/BasisprofilDE/address-de-basis</a><br>\nTo achieve this in Forge, load your Address profile and your Patient profile into Forge, select the address element in the Patient profile's element tree and click on the \"+\" next to \"Type(s)\". Then select the tab \"Custom Types\", where your address profile should be available.</p>",
        "id": 153896978,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1500108476
    },
    {
        "content": "<p>In fact, we need/want the dataelement \"use\" spécified in the address standard datatype, but the valueSet related to this element is REQUIRED and this valueSet is not suitable for France. in my mind, required means that I can't change the values specified in the valueSet. That's the reason why I removed the \"use\" datelement and replaced it by another one related to the right valueset. Is it possible keeping the\" use\" dataelement and changing the valueSet?</p>",
        "id": 153897076,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1500301106
    },
    {
        "content": "<p>Thanks Stefan. It works !</p>",
        "id": 153897077,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1500301389
    },
    {
        "content": "<p>no you can't replace the value set. but it would be interesting to see why it's considered unsuitable - what codes do you use?</p>",
        "id": 153897664,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500639769
    },
    {
        "content": "<p>For example we would like to have the billing address, the death address, the vacation address, etc.</p>",
        "id": 153897683,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1500644609
    },
    {
        "content": "<p>Billing address might actually make sense as a change requests - applies to Practitioners, Patients and Organizations and I suspect it's pretty common.  How is vacation address different in behavior from \"temp\"?  Death address would likely be an extension rather than a use.</p>",
        "id": 153897695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500646701
    },
    {
        "content": "<p>what's a billing address if it's not the official addresss?</p>",
        "id": 153897696,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500647044
    },
    {
        "content": "<p>yes what is a death address?</p>",
        "id": 153897697,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500647086
    },
    {
        "content": "<p>It's common to have bills sent to an accountant or billing agency, not your \"official\" address.  (Or a student might have bills sent to the bank of mom &amp; dad :))</p>",
        "id": 153897710,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500650235
    },
    {
        "content": "<p>You also might be a student living at one location, but your bills go to your parents. (Edited: didn't finish reading Lloyd's comment before writing this)</p>",
        "id": 153897712,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1500652594
    },
    {
        "content": "<p>And the death address would be the executor of your estate.</p>",
        "id": 153897714,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1500652634
    },
    {
        "content": "<p>Depends on whether \"death address\" = where to send mail after you're dead or where did you die?</p>",
        "id": 153897742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500667716
    },
    {
        "content": "<p>or where to send you after you die...</p>",
        "id": 153897745,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500669188
    },
    {
        "content": "<p>or where to send you to die ;-)</p>",
        "id": 153897746,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500669200
    },
    {
        "content": "<p>Wouldn't (shouldn't) the billing address be part of Coverage.payor?</p>",
        "id": 153897753,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1500671024
    },
    {
        "content": "<p>That would make \"billing\" an implicit information, at least</p>",
        "id": 153897754,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1500671141
    },
    {
        "content": "<p>... and I really want to know what a death address is (including the use case ;)</p>",
        "id": 153897755,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1500671228
    },
    {
        "content": "<p>valueset related to the adress-use: Residence at birth (home address at time of birth), vacation address, billing address, second residence address, facility of origin adress, facility of destination address. I don't know exactly how french implemeters use the daeth address, I'm going to ask.</p>",
        "id": 153903868,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1503936686
    },
    {
        "content": "<p>oups, w</p>",
        "id": 153903869,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1503936716
    },
    {
        "content": "<p>oups, the french community would like to add these values to the valueSet AdressUse. What do you think?</p>",
        "id": 153903870,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1503936777
    },
    {
        "content": "<p>i think at least some of them are very unlikely to be added, but others might be.</p>",
        "id": 153903885,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1503947033
    },
    {
        "content": "<p>I'd say the candidates for adding are vacation address and billing address - though I'd need an explaination of how the use of a vacation address would differ from any other temporary address.  Origin and delivery I'd expect to be separate specific attributes on a SupplyRequest or SupplyDelivery (and they are - though you have to traverse to Location).  I'd expect the same if we create a resource to deal with patient transport.  Residence at birth sounds like an extension.  I'd need a better explaination of the purpose of \"second residence address\".</p>",
        "id": 153903898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503960115
    },
    {
        "content": "<p>Hello all,<br>\nFrançois and I worked last week with the french vendors  and we aggreed on the following, regarding the address type valueset:<br>\n- The vacation address and cottage property (the second residence) address are definitely temporary addresses,<br>\n- We will create an extension for the birthPlace address, this is not an address type.<br>\n- What I called death address is in fact the deathPlace (the patient died at the hospital, at home, in the street, etc.). This is a place and not an address. We will create an extension for the deathPlace.<br>\n- Finally, the french vendors would like to add two values to the ValueSet AdressType: billing address and care address.<br>\nbilling address: a student who has bills sent to their parents or a migrant who has bills sent to their embassy.<br>\ncare address: the address (which can be different from home address) where the patient can be visited (chronic care, retirement home for example).<br>\nDoes it make sense?<br>\nThanks</p>",
        "id": 153905437,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1504989735
    },
    {
        "content": "<p>please create a task for those additions. THey will be considered for R4. I think this is now a good proposal (though that is no guarantee of adoption)</p>",
        "id": 153905442,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504989985
    },
    {
        "content": "<p>I suspect \"billing address\" will have an easy ride - it's a common use-case and it makes sense for patient's, practitioners and organizations.  Care address will be a tougher sell.  It only applies to addresses for Patient.  As well, if the patient lives at a retirement home, would that not be their new home address?  You may find it helpful to describe why the existing codes couldn't work and find other countries where this is done too.</p>",
        "id": 153905485,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504993564
    },
    {
        "content": "<p>By \"create a task\" you mean \"create a change request in gForge\"?<br>\nThanks</p>",
        "id": 153907534,
        "sender_full_name": "François Macary",
        "timestamp": 1505323319
    },
    {
        "content": "<p>yes</p>",
        "id": 153907581,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505325679
    },
    {
        "content": "<p>And the care address, if not at home, may be temporary and change. Such as when on respite care at another family members home.</p>",
        "id": 153918948,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1510355003
    }
]