[
    {
        "content": "<p>Hi All,</p>\n<p>I'd like to use the patient-relatedPerson extension (defined here by HL7: <a href=\"https://www.hl7.org/fhir/extension-patient-relatedperson.html\" title=\"https://www.hl7.org/fhir/extension-patient-relatedperson.html\">https://www.hl7.org/fhir/extension-patient-relatedperson.html</a>) to be able to refer to a RelatedPerson from a given Patient as the contact, rather than using the existing Patient.contact field. </p>\n<p>The problem I'm running into is the Constaints imposed on Patient.contact (<a href=\"https://www.hl7.org/fhir/patient.html#invs\" title=\"https://www.hl7.org/fhir/patient.html#invs\">https://www.hl7.org/fhir/patient.html#invs</a>), Expression: \"name.exists() or telecom.exists() or address.exists() or organization.exists()\"</p>\n<p>I'm wondering how the above extension would work naturally with this constraint? Having both a relatedPerson reference and static fields on Patient.contact (that refer to the same person) would likely to lead to inconsistent data if you were to update the RelatedPerson but not your patient.contact fields or vice-versa. Has anyone thought about this or have ideas for how to reconcile? </p>\n<p>I remember seeing that there were modifier extensions that you can put on required fields to indicate that they're just serving as a placeholder, but I'd really prefer not to introduce that.</p>",
        "id": 196375781,
        "sender_full_name": "Spencer Evans",
        "timestamp": 1588717209
    },
    {
        "content": "<blockquote>\n<p>I'm wondering how the above extension would work naturally with this constraint?</p>\n</blockquote>\n<p>It seems that the answer is, the <a class=\"stream\" data-stream-id=\"179254\" href=\"/#narrow/stream/179254-patient-administration-WG\">#patient administration WG</a> expects you to denormalise the contact details into the Patient resource even if you reference the RelatedPerson resource</p>",
        "id": 196377554,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588718435
    },
    {
        "content": "<p>which would be so that every user can make that same assumption too</p>",
        "id": 196377581,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588718458
    },
    {
        "content": "<p>When sending an extension, there's generally an expectation to populate as many core elements as possible as accurately possible as some eventual receivers of the instance likely won't recognize the extension.</p>",
        "id": 196378323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588719037
    },
    {
        "content": "<p>denormalizing and doing 2-way syncing to any edits made b/t the fields on Patient.contact and the RelatedPerson seems like a pretty big overhead to maintain. I also see it leading to unintended consequences. eg, what should happen if someone edits the name on <a href=\"http://Patient.contact.name\" title=\"http://Patient.contact.name\">Patient.contact.name</a> field, should that be understood as changing who the contact is referring to, or fixing a typo on the person's name? </p>\n<p>I don't love my solution but I think I'm going to fall back to one of:</p>\n<ol>\n<li>just put the extension on Patient itself (not Patient.contact)</li>\n<li>add a value to Patient.contact.organization to fulfill the constraint with: { display: \"unknown\" } then continue with the extension on Patient.contact as originally planned.</li>\n</ol>\n<p>I think option 1 is definitely preferable since the organization could be very confusing to others later, but I wanted to throw it out there as an option too.</p>",
        "id": 196926382,
        "sender_full_name": "Spencer Evans",
        "timestamp": 1588959401
    },
    {
        "content": "<p>If your interest is in maintaining consistent demograhics, you're probably looking at Person - which can link to Patient, RelatedPerson, and can be pointed to by Patient.contact.  But you're absolutely expected to maintain the values in multiple places.  You can propagate them automatically from Person, but you can't expect systems to follow links to find demographics.</p>",
        "id": 196929018,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588960663
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<blockquote>\n<p>Person [...] can be pointed to by Patient.contact.</p>\n</blockquote>\n<p>only via an extension though, correct? </p>\n<p>anyways, thanks for the feedback and thoughts -- helpful as always!</p>",
        "id": 196936621,
        "sender_full_name": "Spencer Evans",
        "timestamp": 1588964440
    },
    {
        "content": "<p>Correct.  In general, maintaining shared demographics is considered an uncommon behavior</p>",
        "id": 196937135,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588964699
    },
    {
        "content": "<p>Just seeing another avenue: Lloyd, what do you think about using <a href=\"https://www.hl7.org/fhir/extensibility.html#Special-Case\" title=\"https://www.hl7.org/fhir/extensibility.html#Special-Case\">https://www.hl7.org/fhir/extensibility.html#Special-Case</a> on Patient.contact.organization that indicates to look at the Patient.contact extension where system = \"<a href=\"http://hl7.org/fhir/StructureDefinition/patient-relatedPerson\" title=\"http://hl7.org/fhir/StructureDefinition/patient-relatedPerson\">http://hl7.org/fhir/StructureDefinition/patient-relatedPerson</a>\"</p>",
        "id": 196937754,
        "sender_full_name": "Spencer Evans",
        "timestamp": 1588965012
    },
    {
        "content": "<p>Using that extension is fine - but you should still maintain the demographics in both places.</p>",
        "id": 196938270,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588965281
    }
]