[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12150\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12150\">GF#12150</a> came up in pharmacy, and it was determined that this was a more broad concern than just pharmacy. Essentially: how should servers handl \"patient friendly\" displays vs. practitioner display (for .text fields)</p>",
        "id": 153852329,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870084
    },
    {
        "content": "<p>I wanted to bring it up out here to get an idea of how everyone is handling this today</p>",
        "id": 153852330,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870110
    },
    {
        "content": "<p>The obvious example is Medication SIGs. Doctors: 1 Tab PO, BID. Patient: 1 tablet by mouth twice a day</p>",
        "id": 153852331,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870139
    },
    {
        "content": "<p>right now, there's only 1 field for the display to go. So, we were going to flex ours by who is signed in. Practitioners see what they woudl see in our system. Patients see what we would put on discharge</p>",
        "id": 153852332,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870194
    },
    {
        "content": "<p>This gets \"weird\" because the FHIR resource changes field values depending on who is calling</p>",
        "id": 153852333,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870213
    },
    {
        "content": "<p>It also becomes a problem when a practitioner-facing app wants to send something to patients that would be consistent with what they would see in a portal or on discharge instructions</p>",
        "id": 153852334,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870263
    },
    {
        "content": "<p>sounds like 2 different elements to me</p>",
        "id": 153852335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475870562
    },
    {
        "content": "<p>Agree, but this means text essentially explodes? Can't it apply to pretty much any resource and field display?</p>",
        "id": 153852336,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870598
    },
    {
        "content": "<p>(which is why pharmacy sent to FMG)</p>",
        "id": 153852337,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870612
    },
    {
        "content": "<p>really? doesn't sound that likely to me?</p>",
        "id": 153852338,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475870616
    },
    {
        "content": "<p>I would think that it would apply to a lot of text fields, but could be wrong. I know discharge instructions generally do this for more than just meds</p>",
        "id": 153852339,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870727
    },
    {
        "content": "<p>Note: I agree it's likely two fields, just curious how we decide when to have a text and patientFriendlyText </p>",
        "id": 153852340,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870777
    },
    {
        "content": "<p>or if it will just be naming convention like patient/subject was</p>",
        "id": 153852341,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870796
    },
    {
        "content": "<p>I think we should be clear about which other elements might have the same issue before deciding what to do about it </p>",
        "id": 153852342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475870879
    },
    {
        "content": "<p>Ok, I'll do some internal research so I can add some of that to the GF issue.</p>",
        "id": 153852343,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475870941
    },
    {
        "content": "<p>Hopefully in the meantime some others can weigh in :)  I know some patient viewable trys to translate to patient language as well...</p>",
        "id": 153852344,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475871064
    },
    {
        "content": "<p>Agree that it should be a separate element with the intended use clearly provided.  In some cases it might be core, in other cases it could be an extension on the base string.</p>",
        "id": 153852360,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1475877635
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> , I think this same issue applies to display text for lab result observations, and other kinds of observations.  The LOINC code display text is very un-friendly for display to patients.  I also have found through Argonaut testing that servers are inconsistent on what they put into Observation.code.text vs Observation.code.coding.display.  In at least some cases, Cerner return a more patient-friently text value in Observation.code.text corresponding to the code display value.  While other servers include the same text in both values.</p>",
        "id": 153852366,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1475880470
    },
    {
        "content": "<p>Cerner are doing the right thing there</p>",
        "id": 153852367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475882023
    },
    {
        "content": "<p>Categorization of services would also fit into this issue also.<br>\n(Difference between a patient searching for services, and a practitioner searching for services), and also with billing, what appears on an invoice/claim.</p>",
        "id": 153852417,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476055603
    },
    {
        "content": "<p>Can we consider two separate approaches: one for codeable concepts (e.g., lab test names) vs. pure text (e.g., medication instructions)?  The first by introducing in the data type a \"patient friendly\" text rather than having to create a separate field every time this is needed, and the second leaving it to the resources to determine whether such an attribute is relevant.</p>",
        "id": 153852743,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1476309663
    },
    {
        "content": "<p>is patient special? is it educated vs non-eduated? </p>",
        "id": 153852747,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476312054
    },
    {
        "content": "<p>Can doctor-friendly vs. patient-friendly be handled as a variant on a translation? This may also come up in other contexts (e.g, precise legal text vs. layperson summary).</p>",
        "id": 153852762,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1476316690
    }
]