[
    {
        "content": "<p>Hi all,<br>\nHow can I capture a \"transition of care\" event in FHIR? what resource can I use? \"communication\" ?</p>",
        "id": 154020985,
        "sender_full_name": "Emad Elagouz",
        "timestamp": 1543298919
    },
    {
        "content": "<p>A transition of care generally means that there's a new encounter, or a referral that's been actioned or something like that.  So it would typically be an Encounter or a ServiceRequest or a Task that deals with one of those two things.  Communication is about recording \"Person A was given this information\".</p>",
        "id": 154020986,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543299604
    },
    {
        "content": "<p>Thanks Lloyd for your reply.<br>\nProcessRequest has limited set of actions (cancel | poll | reprocess | status) which I dont think fits the transition of care (toc).<br>\nEncounter: It does represent the whole encounter, where the  toc can be considered as part of an encounter (i think)<br>\nTask: looks promising but still too generic.</p>\n<p>The main information that we want to capture is the patient, source ward and target ward. may be some other metadata like date.</p>",
        "id": 154020991,
        "sender_full_name": "Emad Elagouz",
        "timestamp": 1543304515
    },
    {
        "content": "<p>Use Encounter : either add a new location to the same encounter or close the existing encounter and create a new one for the new location</p>",
        "id": 154021071,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1543331799
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197144\">@Emad Elagouz</span> I don't understand \"looks promising but still too generic\".  Task is intended to be generic.  The specific event is conveyed by the Task.code.</p>",
        "id": 154021078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543336160
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I prefer to use a resource that fits the business description of ToC. Being too generic means that we will have to workaround or use fields in a way that is not intended for them and might cause confusion later on. For example, how can I represent the target ward? I can use \"requester\" to represent the source ward. May be I am missing something?</p>\n<p>I appreciate you reply, thanks Lloyd :)</p>",
        "id": 154021168,
        "sender_full_name": "Emad Elagouz",
        "timestamp": 1543355834
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> I am building an API, and one of the endpoints should retrieve the list of awaiting ToC. I am afraid that encounter might cause confusion to the users of the API. Get Encounters has a different meaning than Get pending ToCs...What do you think?</p>\n<p>Thanks for you time :)</p>",
        "id": 154021174,
        "sender_full_name": "Emad Elagouz",
        "timestamp": 1543356007
    },
    {
        "content": "<p>Encounter is where this kind of data is usually found - you can surely use something different in your implementation, but it won't be very interoperable</p>",
        "id": 154021176,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1543357100
    },
    {
        "content": "<p>OK cool.<br>\nThanks Michele :)</p>",
        "id": 154021182,
        "sender_full_name": "Emad Elagouz",
        "timestamp": 1543359510
    },
    {
        "content": "<p>The intended performer of the Task is the \"owner\" - so that would be your target ward.</p>",
        "id": 154021192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543360974
    },
    {
        "content": "<blockquote>\n<p>How can I capture a \"transition of care\" event</p>\n</blockquote>\n<p>I followed the rest of the discussion with interest, but I'm not sure it got to the heart of the matter. what does it mean to capture a transition of care? To record that the patient was transferred, or to propose it?</p>",
        "id": 154021453,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543458660
    },
    {
        "content": "<p>Hey Grahame, long time no chat :)</p>\n<p>Well, normally it happens after the patient leaves the ward and before he/she reaches the destination. Either way i don't think it should make a big difference, as the information captured in the resource i am looking for should be the same: Patient, Source Ward, Destination Ward, Status (transferred, pending, etc), Dates (date of the transfer if it already happened, date of the request if it not)..</p>\n<p>For time being I've used a custom resource to hold my information, which breaks the FHIR specs. So I was looking for an appropriate resource to use. It would be great if I could find a \"Transfer\" resource that capture that information or something closer. Encounter looks the closest thing, but I am afraid that it can be confusing as it has other clinical meaning.</p>",
        "id": 154021471,
        "sender_full_name": "Emad Elagouz",
        "timestamp": 1543461557
    },
    {
        "content": "<p>this is about moving the patient around?</p>",
        "id": 154021527,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543482459
    },
    {
        "content": "<p>I would expect this to be a ServiceRequest, <span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> how have you profiled this?</p>",
        "id": 154022459,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543836003
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  yes</p>",
        "id": 154024001,
        "sender_full_name": "Emad Elagouz",
        "timestamp": 1544424491
    }
]