[
    {
        "content": "<p>Patient. generalPractitioner provides a reference to a Practitioner resource. We would like to record the following information: period in which the practitioner was the 'generalPractitioner' for a given patient, and the reason why a member changed from one practitioner to another e.g. patient moved, physician quality problem, physician staff attitude, maximum age reached, etc. Any hints?</p>",
        "id": 153871315,
        "sender_full_name": "Angelica Garcia Gutierrez",
        "timestamp": 1487029242
    },
    {
        "content": "<p>Look at CareTeam</p>",
        "id": 153871318,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487029303
    },
    {
        "content": "<p>The element on Patient is intended to represent core demographic information like \"who's the patient's current GP?\" and \"where's the patient's usual pharmacy?\".  Management information of who's responsible for what care when is the domain of CareTeam.</p>",
        "id": 153871319,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487029362
    },
    {
        "content": "<p>Awesome! CareTeam will be helpful to record all the PCPs associated with a patient. However, I couldn't find a place to record the reason for leaving/changing a group. Should that be an extension?</p>",
        "id": 153871325,
        "sender_full_name": "Angelica Garcia Gutierrez",
        "timestamp": 1487029568
    },
    {
        "content": "<p>Extension is one option.  Or if you want more detail, you can look at Provenance - which will let you not only capture what changed, but when it was changed, who changed it, who authorized it, etc.</p>",
        "id": 153871327,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487029818
    },
    {
        "content": "<p>Could be possible to add a 'EndingReason' field to the CareTeam resource instead?</p>",
        "id": 153871329,
        "sender_full_name": "Angelica Garcia Gutierrez",
        "timestamp": 1487030344
    },
    {
        "content": "<p>All things are possible.  But you'd need to make the case that that vast majority of systems that track and manage care teams capture \"end reason\" on each role.  Whether that's an easy case to make or a hard one to make, I have no clue.</p>",
        "id": 153871330,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487031573
    },
    {
        "content": "<p>If you want it in before the STU 3 publication freeze on Sunday, you'd best move fast submitting your change request (and the PC work group may not get to it in time)</p>",
        "id": 153871331,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487031618
    },
    {
        "content": "<p>Thank you for your input.</p>",
        "id": 153871334,
        "sender_full_name": "Angelica Garcia Gutierrez",
        "timestamp": 1487032916
    },
    {
        "content": "<p>This does feel like extension territory to me too, and I agree with Lloyds explanation of Patient.GP and CareTeam.</p>",
        "id": 153871336,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487033542
    }
]