[
    {
        "content": "<p>In Germany we name a patients stay in a hospital a \"case\" and if the patient moves from ward to ward during his stay we call this a \"stay\". So, the hierarchy for a patient in a hospital from admission to discharge is \"1 patient has 1 case has n stays\". Now my question: how would I model the case: with an EpisodeOfCare or with an Encounter?<br>\nDocumentation of EpisodeOfCare says that it would be known as \"case\" in exisiting systems but 8.10.3.1. Expected Implementations reads a bit different as there are more generic categories are listed.<br>\nSo, what is a case in a hospital?<br>\nThanks!</p>",
        "id": 161246227,
        "sender_full_name": "André Sander",
        "timestamp": 1553088124
    },
    {
        "content": "<p>i would say encounter fits best for you. I might be used as a container for all events while patient stays in hospital</p>",
        "id": 161365654,
        "sender_full_name": "Leonid Toporkov",
        "timestamp": 1553187822
    },
    {
        "content": "<p>Igor, stays are interesting... Are wards/departments so segmented that there's a separate concept? Is that because they're generally on different systems?</p>",
        "id": 161373683,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1553193186
    },
    {
        "content": "<p>Neither the US nor the NL has analogous concepts to my knowledge. US has admissions that are bucketed into financial accounts or grouped into episodes (for care over many admissions) but in terms of a distinct container for each department's piece of an admission...that'd just a transfer within the admission. NL has admissions (opnames) linked by episodes (zorgtrajecten) in some capacity.</p>",
        "id": 161373914,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1553193343
    },
    {
        "content": "<p>As Leonid says, Encounter fits best for you.  If the patient moves from ward to ward, for whatever reason, you most likely would use locations within the overarching hospital Encounter. So your 'stays' corresponds to hospital 'locations', while the case, from admission to discharge, is an Encounter. There can be one or more episodes of care associated with the hospital stay/case, but these are to be  associated with the clinical pathway(s) (clusters of Encounters around a specific specialism / diagnosis) that emerge from the admission, both in terms of inpatient and outpatient care. An admission / encounter can also be part of an existing episode of care that started with a previous admission or an outpatient Encounter.</p>",
        "id": 161390571,
        "sender_full_name": "Sebastiaan van Sandijk",
        "timestamp": 1553198306
    },
    {
        "content": "<p>See also <a href=\"#narrow/stream/179166-implementers/topic/Encounter.20Hierarchy\" title=\"#narrow/stream/179166-implementers/topic/Encounter.20Hierarchy\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Encounter.20Hierarchy</a> where this very same topic (or something quite like it) was discussed.</p>",
        "id": 161427622,
        "sender_full_name": "René Spronk",
        "timestamp": 1553241478
    },
    {
        "content": "<p>Thank you very much for your replies. I think the difference are mainly based in the fact that a \"case\" is a \"billing unit\" and not medical driven. Unfortunately, we tend to organize everything around billing and not about the patient... So, for now I will use Encounter to map a \"case\" to FHIR. Thanks for your help  - really appreciate this community!</p>",
        "id": 161435908,
        "sender_full_name": "André Sander",
        "timestamp": 1553250196
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"213583\">@Igor Zaus</span>  You may want to discuss this issue with the german FHIR community over at <a href=\"#narrow/stream/179183-german-(d-a-ch)\" title=\"#narrow/stream/179183-german-(d-a-ch)\">https://chat.fhir.org/#narrow/stream/179183-german-(d-a-ch)</a> ;-)</p>",
        "id": 161460952,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1553270790
    }
]