[
    {
        "content": "<p>is 'break the glass' functionality is some how supported or even required by FHIR?<br>\nand another Q-how is patient consent treated in FHIR if at all?</p>",
        "id": 263989878,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1638877834
    },
    {
        "content": "<p>Supported, yes, required, no. Security guidance can be found at <a href=\"http://build.fhir.org/security.html\">http://build.fhir.org/security.html</a></p>",
        "id": 263993316,
        "sender_full_name": "René Spronk",
        "timestamp": 1638880049
    },
    {
        "content": "<p>Break-Glass is an operational thing. FHIR is a Interop and Data-Model thing. They are on different layers of a Systems-Design.   As Rene points out, there are some mentions of Break-Glass around Consent resource and on the Security pages. These are discussion around the intersection of the concept. We expect that some Consents will need to record that the patient has allowed or disallowed break-glass. We expect that a RESTful API might need a way to convey that the user has invoked their authorized break-glass privilage.</p>",
        "id": 263997675,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638882463
    },
    {
        "content": "<p>I've not come across situations where <strong>patients</strong> consent to BTG. This has been, where I've seen it implemented, a jurisdictional / HIE permitted  option... not a patient permitted option. The pattern I'm most familiar with is that a provider queries... is returned some or no data, but it is indicated that <strong>data was omitted</strong> due to a consent directive... and if it is supported, the provider then invokes a BTG query which returns everything but which lays down a mandatory audit record including the provider's \"override\" justification.</p>",
        "id": 264056814,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1638904615
    },
    {
        "content": "<p>Understood. And I agree. The cases I have seen are where a patient refuses consent, but the overall policy includes a 'patient and clinician safety' override (break-glass). Where the patient is NOT allowed to deny break-glass. BUT there was also countries that came forward with a setting where the patient was allowed to deny and deny break-glass. So we modeled that in the Consent resource.</p>",
        "id": 264071595,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638911130
    },
    {
        "content": "<p>I will note that the country in question, eventually backed down to the clinicians, and removed the regulated policy that would have allowed the patient to deny break-glass.</p>",
        "id": 264071775,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638911221
    },
    {
        "content": "<p>There are still cases where the patient would consent allowing most uses, but where there is a clause that \"Dr. Bob\" shall never be given my data, not even if my life is in danger.</p>",
        "id": 264071923,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638911288
    },
    {
        "content": "<p>I think the original post contained two separate questions, but the masterful weaving together of the two concepts is still mesmerizing <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 264087637,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1638918829
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/patient.20consent.20and.20'break.20the.20glass.20Qs/near/264087637\">said</a>:</p>\n<blockquote>\n<p>I think the original post contained two separate questions, but the masterful weaving together of the two concepts is still mesmerizing <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>\n</blockquote>\n<p>yes, these were 2 not related Q</p>",
        "id": 264264172,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1639033946
    }
]