[
    {
        "content": "<p>My publisher issue has been solved, so I'm going to repurpose this thread.  </p>\n<p>I wonder whether anyone here has experience in modelling the concept of \"patient eligibility for a [procedure type]\"? I would like to avoid having to precoordinate the whole concept into the observation code. Any thoughts on having \"eligibility for a procedure\" in the code and \"[procedure type]\" in the component.code? I haven't found this concept being tackled in any of the public IGs that I'm familiar with, so suggestions would be greatly appreciated.</p>",
        "id": 224363032,
        "sender_full_name": "Halina Labikova",
        "timestamp": 1611855312
    },
    {
        "content": "<p>seems like something the <a class=\"stream\" data-stream-id=\"179283\" href=\"/#narrow/stream/179283-Da-Vinci\">#Da Vinci</a>  streams might be answering...</p>",
        "id": 224374968,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611860211
    },
    {
        "content": "<p>Sounds like prior authorization</p>",
        "id": 224403212,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1611872679
    },
    {
        "content": "<p>Are you talking about clinical eligibility (age, health condition, consent, etc.) or coverage eligibility?  The latter would indeed by prior authorization, which uses the Claim and ClaimResponse resources.  If you're in the U.S., then the Da Vinci PAS IG is the right target</p>",
        "id": 224431047,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611896302
    },
    {
        "content": "<p>Thanks for the answers! I was referring to clinical eligibility.</p>",
        "id": 224695801,
        "sender_full_name": "Halina Labikova",
        "timestamp": 1612167282
    },
    {
        "content": "<p>Maybe related to indications of a procedure.</p>",
        "id": 224751022,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1612196551
    },
    {
        "content": "<p>Clinical eligibility requirements are typically expressed as \"preconditions\" in the protocol (PlanDefinition) or order (RequestGroup or sometimes directly on the request resource).   Measures that drive eligibility are typically captured as Observations.  We've discussed whether CoverageEligibilityRequest and CoverageEligibilityResponse (which are currently insurance-focused) should be generalized to support capturing eligibility assertions for other types of programs, but so far no one has actively pushed for this.</p>",
        "id": 224751094,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612196580
    }
]