[
    {
        "content": "<p>I'm looking for guidance on how to correctly link a patient to a location (i.e. their bed, room). I suppose this applies to any in-patient setting, but in particular I'm working on long-term-care where the room/bed really defines where a patient is living long-term. Can anyone help explain the linkage?</p>",
        "id": 217645637,
        "sender_full_name": "James Wood",
        "timestamp": 1606147070
    },
    {
        "content": "<p>Via Encounter I guess</p>",
        "id": 217649998,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606148828
    },
    {
        "content": "<p>Thanks for the answer -- that's the only answer I've found online, but I'm not clear what that actually means. What is the type of encounter that would link a patient to the location?</p>",
        "id": 217651085,
        "sender_full_name": "James Wood",
        "timestamp": 1606149314
    },
    {
        "content": "<p>When the patient is admitted create an Encouter resource referencing the patient  (via <a href=\"http://hl7.org/fhir/encounter-definitions.html#Encounter.subject\">http://hl7.org/fhir/encounter-definitions.html#Encounter.subject</a>) and the location (via <a href=\"http://hl7.org/fhir/encounter-definitions.html#Encounter.location\">http://hl7.org/fhir/encounter-definitions.html#Encounter.location</a>). <br>\nLocation is a list, so if the patient moves around add a new location and mark the previous one as no longer current setting location.period.end</p>",
        "id": 217652282,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606149909
    },
    {
        "content": "<p>A patient can only have a tracked location if they're part of an inpatient encounter.</p>",
        "id": 217829591,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606262117
    },
    {
        "content": "<p>? where is that documented - I searched for \"Location track\" in the FHIR spec, no matches..</p>",
        "id": 217856526,
        "sender_full_name": "René Spronk",
        "timestamp": 1606293390
    },
    {
        "content": "<p>What systems track the location of patients outside of an inpatient encounter?  We track their contact information (physical and mailing addresses), but I'm not aware of any business flow that tracks a patient's actual physical location at any point in time...</p>",
        "id": 217948215,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606344584
    },
    {
        "content": "<p>I'm aware of a HIS in Israel that tracks all patients in real-time, as well as clinicians, and mobile pieces of equipment (among other things). Is some patient has an heart attack, the nearest clinicians are paged. I admit this is an extreme use case, but it does point out that tracking is not limited to specific types of encounter.</p>",
        "id": 217975395,
        "sender_full_name": "René Spronk",
        "timestamp": 1606379337
    },
    {
        "content": "<p>Specialty ambulatory clinics would also want to track equipment, providers and patients, wouldn't they? It seems that even urgent care centers would want to know which exam rooms are occupied, and which provider(s) and patient are in each occupied room...</p>",
        "id": 218025389,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1606412416
    },
    {
        "content": "<p>One system would use AuditEvent. Each change in location is recorded. Thus a query against location AuditEvents for a given asset (agent) and you would see the current location and past locations.... Not unlike how Google Maps tracks you...</p>",
        "id": 218294387,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606747212
    },
    {
        "content": "<p>How are they doing the tracking?  If they are using a RFID tag or something, that could be a Device, which could reference the patient it is assigned to (independent of Encounter).  <em>Normally</em> the RFID tag would be issued to a patient at the start of an encounter (whether it is  an admission, outpatient encounter), but if you are doing non-encounter based tracking (like maybe home care, which is more about the EpisodeOfCare than Encounter) then maybe you could just use a Device-&gt;Patient without Encounter in the middle.  Conceptually you'd have an Encounter where that tag was assigned to the patient (e.g. the nurse gives them the tag), but the actual tracking could be encounter-independent.</p>",
        "id": 218326403,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1606761256
    },
    {
        "content": "<p>So really, you aren't tracking the patient, you are tracking their location-emitting device.  So if their dog swallows it, technically you'd be tracking the patient's dog, not the patient.  But that's probably what you actually mean anyway.</p>",
        "id": 218326464,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1606761297
    },
    {
        "content": "<p>yes, that is reality</p>",
        "id": 218329624,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606762692
    }
]