[
    {
        "content": "<p>Looking at the definitions for <code>Patient.link</code>, all the <a href=\"http://hl7.org/fhir/valueset-link-type.html\">link types</a> (<code>replaces</code>, <code>replaced-by</code>, <code>refer</code>, <code>seealso</code>) explicitly describe linking from a Patient to a Patient. When/how would linking to a RelatedPerson occur? The comment at <a href=\"http://hl7.org/fhir/patient-definitions.html#Patient.link.other\">http://hl7.org/fhir/patient-definitions.html#Patient.link.other</a> mentions \"Referencing a RelatedPerson here removes the need to use a Person record to associate a Patient and RelatedPerson as the same individual.\", but I'm not clear on where or how this would happen.</p>\n<p>Maybe it's designed for scenarios like: Alice is a patient, and Alice is also a caregiver for Bob, so we'd have 3 resources</p>\n<ul>\n<li><code>Patient/alice</code>: links as <code>seealso</code> to <code>RelatedPerson/alice-as-caregiver-for-bob</code></li>\n<li><code>Patient/bob</code></li>\n<li><code>RelatedPerson/alice-as-caregiver-for-bob</code></li>\n</ul>\n<p>It's not clear to me that this is a good/helpful thing to declare in Alice's Patient record. Are there real-world systems that use this behavior today? If so we might want to update the <a href=\"http://hl7.org/fhir/valueset-link-type.html\">link types</a> to reflect this usage; if not we might want to deprecate this usage.</p>",
        "id": 245465142,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625848164
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 245473414,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625852117
    },
    {
        "content": "<p>You're exactly right that this is the case that it's there to cover.<br>\nAnd I thought there was an example on that page like that, with mother and child, which would be common in maternity. Both exist as patients, and the relationship too.</p>",
        "id": 245519513,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625876130
    },
    {
        "content": "<p>We could clarify that text a little further though.</p>",
        "id": 245519592,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625876224
    },
    {
        "content": "<p>We definitely have that linkage in our DB on multiple independent products in our portfolio too.<br>\n<span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> (and others) do you guys store that linkage internally too?</p>",
        "id": 245519649,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625876293
    },
    {
        "content": "<p>If this is an intended use case, the text I want to clarify is on the codes in the link type value set, so it's clear which would apply (also giving a more detailed example in the element definition couldn't hurt).</p>",
        "id": 245527179,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625888312
    }
]