[
    {
        "content": "<p>Hi,<br>\nIn one of our source systems, a patient can have multiple relationships with departments (FHIR Organization). I am trying to figure out a method of showing this relationship. </p>\n<p>I want to be able to show that one patient can have multiple relationships with organizations, with a status, start and end date. I have looked through the FHIR resources and have not been able to find a resource that would accomplish this, nor an extension. Would it be best to have an extension on Patient to show these? Or is there something better?</p>\n<p>Thank you.</p>",
        "id": 162076141,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1553887028
    },
    {
        "content": "<p>what kind of association are we talking about?</p>",
        "id": 162076237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553887086
    },
    {
        "content": "<p>Just a reference to the resource is all I really want, as I will have the department as an organization in FHIR.</p>",
        "id": 162076276,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1553887124
    },
    {
        "content": "<p>what kind of relationship? \"this patient is associated with this organization\" doesn't have any meaning to me.</p>",
        "id": 162076440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553887252
    },
    {
        "content": "<p>The relationship essentially just shows the status of the patient within that specific department. Some of the statuses are: active, waitlist, deceased, discharged and transferred.</p>",
        "id": 162076743,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1553887525
    },
    {
        "content": "<p>They look like Encounters</p>",
        "id": 162076988,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1553887789
    },
    {
        "content": "<p>with departments represented as Location, not Organization</p>",
        "id": 162077056,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1553887809
    },
    {
        "content": "<p>The same patient could have multiple relationships with the same department - They might be 'active' with the radiology department for a CT scan but waitlisted for an MRI</p>",
        "id": 162077074,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553887836
    },
    {
        "content": "<p>Agree with Michele that this sounds like appointments/encounters</p>",
        "id": 162077099,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553887866
    },
    {
        "content": "<p>This system has Visits (which are Appointments/Encounters), and then has an entirely separate section from the visits for setting the clients status within the department.</p>\n<p>I'll see where I can put this in Appointment/Encounter. Thank you for your help.</p>",
        "id": 162077537,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1553888233
    },
    {
        "content": "<p>What would the overall status be for someone who is active for one service and waitlisted for another with the same department?</p>",
        "id": 162077814,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553888457
    },
    {
        "content": "<p>In this system, clients can only be waitlisted for the actual department, not the services that will be provided within that department. So an example would be that they are waitlisted to get into the Alpha Home Support department.</p>",
        "id": 162078349,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1553888911
    },
    {
        "content": "<p>The other resource to check is EpisodeOfCare which can track across encounters/admissions.</p>",
        "id": 163332768,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1555273272
    },
    {
        "content": "<p>(very useful in community scenarios)</p>",
        "id": 163332777,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1555273311
    },
    {
        "content": "<p>(or tracking across conditions)</p>",
        "id": 163332833,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1555273348
    }
]