[
    {
        "content": "<p>Hello,<br>\nI wanted t understand the scenario where Patient is referred as a 'recorder' or 'asserter' or 'performer' etc.  From a business stand-point is it correct to assume that the patient being referred in the 'Patient' resource for these fields,has to be same patient who is the 'subject ' of that resource. e.g. If a 'Condition' resource  has 'subject':Patient/P1, then wouldn't it becorrect to assume that Condition.recorder:Patient/P1?. Fundamentally if a relative or next-of-kin reports the condition then ideally it should be recorded in RelatedPerson and not Patient. I understand that FHIR doesn't constrain this behavior and if we try -we can allow other Patients other than the 'subject' to be recorders/asserters/performers etc. But purely from a real-world standpoint , is it possible that Patient/P2 'records' the condition for 'subject':Patient/P1?</p>",
        "id": 215880257,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1604684844
    },
    {
        "content": "<p>Hi Tushar,</p>\n<p>Nice catch.  Yes, that's indeed the assumption, but you're right that we don't state explicitly anywhere that the Patient who's pointed to in .subject is expected to be the same patient elsewhere.  I'm not sure where in the specification would be the appropriate place to put the clarification, and I'm not sure we can force it as an invariant.  At minimum, please submit a change request for us to clarify this.  Ideas on where to do so would be welcome too...</p>",
        "id": 215911396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604701444
    },
    {
        "content": "<p>what about mother reporting on child?</p>",
        "id": 216013269,
        "sender_full_name": "John Moehrke",
        "timestamp": 1604852165
    },
    {
        "content": "<p>One of the two would be a RelatedPerson</p>",
        "id": 216016465,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604856577
    },
    {
        "content": "<p>If it's the child's record, the reporter mom would be RelatedPerson.</p>",
        "id": 216016536,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604856637
    }
]