[
    {
        "content": "<p>I have been in some discussions around a concept of storing 'age' as a proxy for date of birth for Patient (as an extension) - this is to handle uncertain and approximations to date of birth e.g.. around 70 years old; in their 50s.  Has anyone addressed this before?  It seems not at all useful as a quantity by itself; would need to record when the age was asserted. </p>",
        "id": 153861342,
        "sender_full_name": "Brett Esler",
        "timestamp": 1481070563
    },
    {
        "content": "<p>I thought that was the purpose of being able to state that the birth date was \"1950\", maybe an extension that covers the certainty of the values. Some people know that there birthday is 20th January, but it could have been 1923, 24 or 25! As records were lost at the time (more unlikely now)</p>",
        "id": 153861402,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481075690
    },
    {
        "content": "<p>Does that mean it's legal in FHIR to use</p>\n<div class=\"codehilite\"><pre>&lt;birthDate value=&quot;1950&quot; /&gt;\n</pre></div>\n\n\n<p>?</p>",
        "id": 153861406,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481076487
    },
    {
        "content": "<p>yes</p>",
        "id": 153861407,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481076525
    },
    {
        "content": "<p>Oh right.  I thought <code>date</code> had to be an xs:date.</p>",
        "id": 153861408,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481076593
    },
    {
        "content": "<p>Perhaps I should read the spec first:<br>\n\"union of xs:date, xs:gYearMonth, xs:gYear\"</p>",
        "id": 153861409,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481076693
    },
    {
        "content": "<p>y</p>",
        "id": 153861410,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481076813
    },
    {
        "content": "<p>How would you handle the situation that <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> raised where I know that I was born on January 3, say, but I'm not sure what the year was?  Do we just pick a year that's close and assume that's good enough?  How would that work in a data matching scenario because a different system may have picked a different year?</p>",
        "id": 153861412,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481080121
    },
    {
        "content": "<p>&lt;birthDate value=\"1924-01-03\"&gt;<br>\n&lt;extension url=\"...date-certainty\"&gt;<br>\n&lt;valueCode value=\"EAA\" /&gt;<br>\n&lt;/extension&gt;<br>\n&lt;/birthDate&gt;<br>\nThis is used in quite a few Australian govt minimum datasets (MDS) - VINAH, SHS, SCTT, PCEHR, CWH.<br>\nThose 3 letters are a code where each letter designates the level of accuracy of that component (A = Accurate, E=Estimated, U=Unknown) in Day, Month, Year sequence (but if we were to do this as an international standard, I'd probably recommend going in YMD order)</p>",
        "id": 153861413,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481080762
    },
    {
        "content": "<p>We've already added exactly this extension to our own (internal, unpublished) patient model. But I was wondering if there was a more generic -- i.e. non-Australian-specific -- solution.  Also, the codes here conflate 3 separate pieces of information and become difficult to use in a semantic context.  (They feel _very_ 1980s to me!)  Furthermore, now that you don't have to state day or month, the use of a 3-character code would not always be appropriate.</p>",
        "id": 153861418,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481083617
    },
    {
        "content": "<p>no there is not a more generic extension. I've neve seen anything like that outside AS4590 and it's impacted areas</p>",
        "id": 153861432,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481087571
    },
    {
        "content": "<p>By way of another pattern to consider, FamilyMemberHistory has an age choice of data types (Age, Range, or String) with a corresponding estimatedAge boolean.  This allows for saying \"estimated 70 years old\" or \"estimated 50-60 years old\"</p>",
        "id": 153861865,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1481121741
    },
    {
        "content": "<p>...which is age at death. The tricky thing about this is it's 'age at a date'</p>",
        "id": 153861939,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481137601
    },
    {
        "content": "<p>I get your point, but I would clarify that the FamilyMemberHistory.age isn't defined as age at death, but instead defined as \"The age of the relative at the time the family member history is recorded\" with another attribute to indicate when recorded -- FamilyMemberHistory.date</p>",
        "id": 153861978,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1481146261
    },
    {
        "content": "<p>There are other attributes for FamilyMemberHistory.deceasedAge or FamilyMemberHistory.deceasedRange, too.</p>",
        "id": 153861979,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1481146334
    },
    {
        "content": "<p>duh I knew I should've checked that </p>",
        "id": 153861980,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481146356
    },
    {
        "content": "<p>The French philosopher Jean Baudrillard has a relevant model in Simulacra et Simulation.  He discusses the four classifications of images - originals, copies, copies of copies, and simulacra; which is used within some Radiology departments as a model for describing reference vs diagnostic quality images vs synthetic avatars and simulacra such as the Talairach-Tournoux Brain Atlas.  The AEU model of Accurate, Estimated, Unknown is roughly similar in purpose... estimating the knowability and quality of the purported knowledge.  </p>\n<p>Michelle's point about \"the age of the relative at the time the family member history is recorded\" is similar in quality to the problem of a Radiology department scanning an analog radiograph with a flatbed digital scanner.   </p>\n<p>It's an interesting trend, and will only grow with the advent of wearable biometric devices.  Is the quality of a weight measurement at home the same as at a hospital?  Is there a difference between a calibrated device taking the measurement, and an individual copying that data in by hand?  I haven't seen any coding or standard besides Baudrillard's model (and now the Australian AS4590 standard, thank you!), but there seems to be a growing need for such a model.</p>",
        "id": 153862372,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481220261
    },
    {
        "content": "<p>I am looking for a solution to include the Patient´s age to a document Bundle (R4), but did not find any explicit representation of the age. The document itself is a snapshot of an assessment, which has a Patient resource. After reading the FHIR specs and FHIR chat i´ve found two possible ways. (Samples below)</p>\n<ul>\n<li>Add an Observation to the Bundle entries with a specific Loinc-code and stores the age in the value field. The observation would have the reference to the patient in the subject field. </li>\n<li>Add an extension to the Patient resource using the valueAge field</li>\n</ul>\n<p>Observation</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n  &quot;resourceType&quot;: &quot;Observation&quot;,\n  &quot;status&quot;: &quot;final&quot;,\n  &quot;category&quot;: [\n    {\n      &quot;coding&quot;: [\n        {\n          &quot;system&quot;: &quot;http://terminology.hl7.org/CodeSystem/observation-category&quot;,\n          &quot;code&quot;: &quot;survey&quot;,\n          &quot;display&quot;: &quot;Survey&quot;\n        }\n      ]\n    }\n  ],\n  &quot;code&quot;: {\n    &quot;coding&quot;: [\n      {\n        &quot;system&quot;: &quot;https://loinc.org/&quot;,\n        &quot;code&quot;: &quot;30525-5&quot;,\n        &quot;display&quot;: &quot;Age&quot;\n      }\n    ]\n  },\n  &quot;subject&quot;: {\n    &quot;reference&quot;: &quot;Patient/af224d54-281e-4dcc-b5ed-f665c253d302&quot;\n  },\n  &quot;valueQuantity&quot;: {\n    &quot;value&quot;: 10,\n    &quot;unit&quot;: &quot;years&quot;,\n    &quot;system&quot;: &quot;http://unitsofmeasure.org&quot;,\n    &quot;code&quot;: &quot;a&quot;\n  }\n}\n</code></pre></div>\n<p>Extension for age</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n  &quot;resourceType&quot;: &quot;Patient&quot;,\n  &quot;id&quot;: &quot;d8badb6f-ae3d-425d-b679-968c7b18bde7&quot;,\n  &quot;extension&quot;: [\n    {\n      &quot;url&quot;: &quot;http://example.com/fhir/StructureDefinition/patient-age&quot;,\n      &quot;valueAge&quot;: {\n        &quot;value&quot;: 50\n      }\n    }\n  ]\n  ...\n}\n</code></pre></div>\n<p>Which variant is the preferred one to include the patient´s age? what are the pros/cons?</p>",
        "id": 260124910,
        "sender_full_name": "Bela Bara",
        "timestamp": 1635941851
    },
    {
        "content": "<p>I tend to suggest age is an observation on a patient that is true at a particular instant in time. </p>\n<p>Your observation almost looks right but you ought to add the Observation.effective[x] field in there that says when this is true. Age makes no sense without the context of when.</p>\n<p>In terms of Patient, I wouldn't ever usually suggest putting too much on there that is likely to change regularly or predictably. I think really carefully about using address within Patient, especially if it being used to give context to other data. Age would be a definite no for me in almost every case.</p>",
        "id": 260129263,
        "sender_full_name": "Benjamin Green",
        "timestamp": 1635944133
    },
    {
        "content": "<p>+1 for Observation. The Extension doesn't capture the date of the age assessment.</p>",
        "id": 260129672,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1635944331
    },
    {
        "content": "<p>Just for curiosity, age can be calculated from the timestamp of the Bundle (or Composition) and Patient's birthday. What is the reason to have a standalone age observation in a bundle?</p>",
        "id": 260135998,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1635947248
    },
    {
        "content": "<p>Another option for you is that if you want to express a date as \"how old was the patient when\", you can use the <a href=\"http://build.fhir.org/extension-relative-date.html\">relative-date</a> extension with a base event of 'birth'.</p>",
        "id": 260137955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635948154
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191451\">Patrick Werner</span> <a href=\"#narrow/stream/179166-implementers/topic/Patient.20age/near/260129672\">said</a>:</p>\n<blockquote>\n<p>+1 for Observation. The Extension doesn't capture the date of the age assessment.</p>\n</blockquote>\n<p>Would you have the same opinion, if the Extension recorded the date?</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n  &quot;resourceType&quot;: &quot;Patient&quot;,\n  &quot;id&quot;: &quot;59150120-b184-4d21-9e73-2123af083ccc&quot;,\n  &quot;extension&quot;: [\n    {\n      &quot;url&quot;: &quot;http://example.com/fhir/StructureDefinition/patient-age&quot;,\n      &quot;extension&quot;: [\n        {\n          &quot;url&quot;: &quot;age&quot;,\n          &quot;valueAge&quot;: {\n            &quot;value&quot;: 50\n          }\n        },\n        {\n          &quot;url&quot;: &quot;recordedDate&quot;,\n          &quot;valueDate&quot;: &quot;2021-11-03&quot;\n        }\n      ]\n    }\n  ]\n}\n</code></pre></div>",
        "id": 260152450,
        "sender_full_name": "Bela Bara",
        "timestamp": 1635953941
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191506\">Yunwei Wang</span> <a href=\"#narrow/stream/179166-implementers/topic/Patient.20age/near/260135998\">said</a>:</p>\n<blockquote>\n<p>Just for curiosity, age can be calculated from the timestamp of the Bundle (or Composition) and Patient's birthday. What is the reason to have a standalone age observation in a bundle?</p>\n</blockquote>\n<p>Due to some privacy constraints the birthday is not accessible, only the age is known.</p>",
        "id": 260152749,
        "sender_full_name": "Bela Bara",
        "timestamp": 1635954051
    },
    {
        "content": "<p>By doing it this way, the age extension is not part of the resource. The server would be responsible for calculating and injecting the extension, at the point when the resource is served. Essentially changing the contents of the resource but not updating the resource. </p>\n<p>An observation model, the resource would never change. The data recorded is part of the resource. </p>\n<p>Either of these methods can expose the patients birth date however. I query for the Patient resource on Jan 3 and get age 50. I query again on Jan 4 and the response is 51. What is the patient birthdate?</p>\n<p>Also either method, you need to return the UOM as well. 50 yr/mo/day/hr/min</p>",
        "id": 260153715,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1635954435
    },
    {
        "content": "<p>I would lean towards an extension present on each individual resource in the bundle that reflects the patient's age at the time relevant to that resource (e.g., either Lloyd's suggestion of <code>relative-date</code> to <code>birth</code> or something similar).</p>\n<p>To continue the example above, it's fine that you are querying on Jan 3 and Jan 4, and the patient is currently 50 or 51.  But an <code>Observation</code> in the bundle was made when the patient was 50 (or 48, etc.), regardless of the patients <em>current</em> age.</p>\n<p>Putting 'current age' over old data can cause patient safety issues (e.g., the doc thought they were looking at something from this year, but it was from 5 years ago).</p>",
        "id": 260155435,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1635955114
    },
    {
        "content": "<p>If the resource is \"Patient\" what is the \"patients age relevant to the resource\". <br>\nIf the requirement is to keep the patients birthdate private, then providing a means to derive that birthdate doesn't seem to meet the requirement.</p>\n<p>Yes, an age extension on an Observation would be the age at the time of the Observation. An age on a Condition would be age at diagnosis, age at recorded, age at last occurrence or age at resolution?</p>",
        "id": 260156051,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1635955327
    },
    {
        "content": "<p>For the patient record, probably the patient's current age.</p>\n<p>I am just noting that if you have a relevant <code>Observation</code> in a bundle that was made when a patient was 48 and you hide dates, you need to make it clear that the observation was taken when the patient was 48, even if they are currently 50.</p>\n<p>Your question about which age is represented is exactly my point.  The context of the age calculation needs to be specific.  If there is only one in a bundle (e.g., current age), and that is displayed instead of DOB, it is prone to errors.</p>",
        "id": 260157038,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1635955712
    },
    {
        "content": "<p>Recalculation of the patient´s age is probably not an issue, because the document Bundle is a snapshot of an assessment, therefore the resources/extensions will not be changed later on. Though, it has to be clear, what is the relative date to the age calculation.</p>",
        "id": 260158281,
        "sender_full_name": "Bela Bara",
        "timestamp": 1635956269
    },
    {
        "content": "<p>Just for capturing the Age should I use an entire Observation resource?</p>",
        "id": 273532590,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646072616
    },
    {
        "content": "<p>Instead Identifier can have an option to make value as number or string right? That way we can add age as number inside patient identifier &amp; make it query using &lt; less than or greater than &gt; ?</p>",
        "id": 273532691,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646072670
    },
    {
        "content": "<p>What would be the meaning of an Age in the Patient though?  First seen, last updated, current?  Age can be calculated by looking at the Patient's Birth Date quite easily and does not have those errors.</p>",
        "id": 273532960,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1646072807
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179166-implementers/topic/Patient.20age/near/260157038\">said</a>:</p>\n<blockquote>\n<p>For the patient record, probably the patient's current age.</p>\n<p>I am just noting that if you have a relevant <code>Observation</code> in a bundle that was made when a patient was 48 and you hide dates, you need to make it clear that the observation was taken when the patient was 48, even if they are currently 50.</p>\n<p>Your question about which age is represented is exactly my point.  The context of the age calculation needs to be specific.  If there is only one in a bundle (e.g., current age), and that is displayed instead of DOB, it is prone to errors.</p>\n</blockquote>\n<p>Would the Observation.effective date be helpful as part of the record?</p>",
        "id": 273533054,
        "sender_full_name": "Bret H",
        "timestamp": 1646072863
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  You're absolutely correct. But I don't have any date of birth in my source data. I have only age. I dont want to subtract age number with current year and make date of birth as YYYY format. Because as a data, its a misrepresentation. </p>\n<ul>\n<li>FHIR definition of observation is ambiguous \"simple assertions made about a patient\". \"I'm a male\"  is also an simple assertion about me. Then Why Gender is in Patient resource when Age is not.</li>\n</ul>",
        "id": 273533296,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646072988
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span>  I did not understand why Age has to be in observation in first place?. I agree Observation make sense. But why? .</p>",
        "id": 273533886,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646073241
    },
    {
        "content": "<p>Yes, data is messy.  I would probably suggest picking a day for the DOB (e.g., January 1st, date of import, whatever), then marking the date with an extension to flag that it was done that way.</p>\n<p>It would be no less accurate than Age in the general case, and workflow could be used to address it (e.g., ask the patient their actual birth date at next visit).</p>\n<p>I do not see a generic extension to mark data that way yet, but I only looked quickly so it may be there (or one could be proposed)</p>",
        "id": 273534287,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1646073450
    },
    {
        "content": "<p>so far i see the best way to capture age is  (current year - Age in the source data ) as the DOB in patient resource accepts yyyy format as well.</p>",
        "id": 273534835,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646073735
    },
    {
        "content": "<p>Still its messy</p>",
        "id": 273534847,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646073744
    },
    {
        "content": "<p>Yes, but if you use Age you also need to ensure that you always keep it up to date (e.g., increment age next year) <em>and</em> ensure that it is only done once, ensure that downstream systems that read the age have context, etc.</p>\n<p>Practically speaking, I have seen several incidents because a patient's Age was out of sync when a practitioner read it.. I tend to try and steer people away from using it.</p>",
        "id": 273535339,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1646073988
    },
    {
        "content": "<p>got it</p>",
        "id": 273535445,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646074041
    },
    {
        "content": "<p>I have a doubt. Can we query birthDate only with year using lt and gt?</p>",
        "id": 273535499,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646074071
    },
    {
        "content": "<p>yeah it works</p>",
        "id": 273535862,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646074238
    },
    {
        "content": "<p><a href=\"http://hapi.fhir.org/baseR4/Patient?birthdate=lt1995&amp;birthdate=gt1993\">http://hapi.fhir.org/baseR4/Patient?birthdate=lt1995&amp;birthdate=gt1993</a><br>\nLike this we can use</p>",
        "id": 273535937,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646074280
    },
    {
        "content": "<p>which is safe for now</p>",
        "id": 273535945,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646074285
    },
    {
        "content": "<p>Putting age in an 'identifier' would absolutely be a bad idea.  When sending data in FHIR, it's important to respect the meaning of the element - and 'age' is definitely <em>not</em> a unique identifier for the patient.  If you need to transmit age, Observation is best, extension (ideally with two components so you can communicate 'age' as well as 'as of when?') is second best.</p>",
        "id": 273536115,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646074365
    },
    {
        "content": "<p>Not all existing FHIR sources like say Azure API for FHIR allows us to modify structure defintion. Then how can we make extension queryable ?</p>",
        "id": 273536855,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646074699
    },
    {
        "content": "<p>FHIR defintion of observation is difficult to understand. \"simple assertions made about a patient, device or other subject.\". I'm a male, is also a simple assertion but gender is in Patient resource right?</p>\n<p>I don' t understand what simple assertion is</p>",
        "id": 273537672,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646074963
    },
    {
        "content": "<p>In a simple term if you do not know where to put some statement it likely goes to the Observation. :)</p>",
        "id": 273538422,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1646075295
    },
    {
        "content": "<p>Ok. I have to agree to that. <span class=\"user-mention\" data-user-id=\"192195\">@Shamil Nizamov</span> .</p>",
        "id": 273540410,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646076280
    },
    {
        "content": "<p>You don't have to modify the structure definition to use an extension - extensions are built into the resource in all locations they're allowed - and I presume Azure has support for extensions.<br>\nTo make an extension searchable, you just define a SearchParameter for it - and configure the relevant server to support it.  Depending on the SearchParameter and the server, that can be as simple as uploading it or sticking it into the correct file location.</p>",
        "id": 273544443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646078051
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I agree. The vital part of the question remains same. Why observation?.</p>",
        "id": 273584715,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646103255
    },
    {
        "content": "<p>Where else? Age is mostly of clinical relevance, whereas the patient is about demographic/administrative details of the patient. Birthdate fits with the latter category, whereas age doesn't. Observation has the advantage that it allows one to specify the author of the observation and the date that the observation was made. Age may be an estimate, and may or may not be based on all sorts of other things such as x-rays of the hand.</p>",
        "id": 273603735,
        "sender_full_name": "René Spronk",
        "timestamp": 1646122920
    },
    {
        "content": "<p>I have a use case to list all the female  gender patients with in a age group of 20 to 40</p>",
        "id": 273605230,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646123717
    },
    {
        "content": "<p>Here age is not clinical reference. Its just a sub set of patient demographics</p>",
        "id": 273605262,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646123735
    },
    {
        "content": "<p>A reason for gender in Patient is it is commonly part of identifying a person. But that is gender for bureaucratic purposes, not sex for clinical purposes, which would be an observation.</p>",
        "id": 273609506,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1646125833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>  your there. You're nearly getting to what I'm pointing out here. FHIR built on top of pareto's principle and they believe that 20% of world's most used data forms the FHIR resources.</p>",
        "id": 273611418,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646126877
    },
    {
        "content": "<p>The standard's decision of 20% is not my 20%.</p>",
        "id": 273611484,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646126898
    },
    {
        "content": "<p>that's the problem</p>",
        "id": 273611489,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1646126902
    },
    {
        "content": "<p>Ah, but that's the nature of standardization for a global context-independent market. And that's why we have extensions.</p>",
        "id": 273614083,
        "sender_full_name": "René Spronk",
        "timestamp": 1646128284
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> . Add to that, that there are ways to get your edge case results. But as an edge case, the model is not optimized for you, and you thus will need to work harder.</p>",
        "id": 273626059,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646134102
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"202825\">Vibin_chander</span> <a href=\"#narrow/stream/179166-implementers/topic/Patient.20age/near/273584715\">said</a>:</p>\n<blockquote>\n<p>Why observation?.</p>\n</blockquote>\n<p>I would ask, \"Why store a calculable field anywhere?\" I certainly understand the need for age observations. \"When you are rolled through the ER door, unconscious, the provider says patient appears to be male, appears to be 50-60 years old....\" But if you know something about the birthdate then you can calculate for any criteria you want. Having the hard and fast discrete data point on which to make the calculation, trumps the need to have assorted stored aggregate values. </p>\n<p>Try saying, \"I want all patients that have an age observation with the value between 20 and 40 where the observation was taken between 2020-2021.\" You likely aren't going to get what you want. \"All patients with birthdate between 1982-2002.\" Is likely more precise.</p>",
        "id": 273637247,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1646140139
    },
    {
        "content": "<p>Age is a point-in-time value.  Observation is where we capture point-in-time values.  In general, we try to avoid persisting age at all because working with is complex.  (\"2.3 years ago they were 32 years old\" is somewhat miserable to work with.)</p>",
        "id": 273653413,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646146824
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"202825\">Vibin_chander</span> <a href=\"#narrow/stream/179166-implementers/topic/Patient.20age/near/273605230\">said</a>:</p>\n<blockquote>\n<p>I have a use case to list all the female  gender patients with in a age group of 20 to 40</p>\n</blockquote>\n<p>Patient?gender=female &amp;birthdate=lt2002-03-01&amp;birthdate=gt1982-03-01</p>",
        "id": 273659317,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1646149114
    },
    {
        "content": "<p>One key thing to be aware of is that the data in a resource is 'static' unless the server receives an update - and if there's an update, then the version changes and a new entry gets added to history.  So, for example, if you created a Patient instance with an 'age' extension, that age can't change dynamically.  It's fixed until/unless someone sends an update to change the Patient record.</p>",
        "id": 273663390,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646150517
    }
]