[
    {
        "content": "<p>We are working on a use case about retrieving patient’s contraindications (in STU3). We are looking into using Flag and Condition resources for this purpose.<br>\nWe noticed that R5 has specialized ClinicalUseIssue resource that has contraindications in scope. This can, however, only be used for medication contraindications, because the subject cannot be a patient. <br>\nDoes someone have any advice on how to exchange contraindications with a patient as subject? Are there any known implementations?</p>",
        "id": 205585903,
        "sender_full_name": "Jorn Duwel",
        "timestamp": 1596199483
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  any thoughts on this?</p>",
        "id": 205585960,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1596199525
    },
    {
        "content": "<p>what is a patient contraindication?</p>",
        "id": 205586136,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596199666
    },
    {
        "content": "<p>(the answer to this question should point in the right direction - is it an indication to not do something, or is it a condition that disadvises something...)</p>",
        "id": 205586552,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596199959
    },
    {
        "content": "<p>I think I should have said 'possible contraindications'. Our functional model defines the from a patient's perspective. An example would be pregnancy that could be seen as a contraindication given certain medicines.</p>",
        "id": 205586586,
        "sender_full_name": "Jorn Duwel",
        "timestamp": 1596199986
    },
    {
        "content": "<p>so if you define it, you'd say something like \"a condition that...\"?</p>",
        "id": 205586644,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596200029
    },
    {
        "content": "<p>in that case, the patient has a condition, and that condition has contraindications. it's not the patient that has contraindications, right?</p>",
        "id": 205586726,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596200075
    },
    {
        "content": "<p>ClinicalUseIssue stores information such as \"dont give this medication during pregnancy\". You combine it with patient information (that they are pregnant).</p>",
        "id": 205586734,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596200077
    },
    {
        "content": "<p>contraindications of a medication are in the clinicaluseissue</p>",
        "id": 205586754,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596200094
    },
    {
        "content": "<p>(what Rik said)</p>",
        "id": 205586764,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596200100
    },
    {
        "content": "<p>If you want to record that a (text book) contraindicated situation has arisen for real, then you can use DetectedIssue for that. It is intended for decision support results, more so than perhaps something that is entered in the patient record</p>",
        "id": 205587005,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596200260
    },
    {
        "content": "<p>And what if someone has decided that a condition can be seen as a contraindication for certain medicines: will it then be a Flag?</p>",
        "id": 205587319,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1596200450
    },
    {
        "content": "<p>Extra note: the functional model leaves the decision if a 'possible contraindication' (avoiding the word condition here ;)) combined with certain medication indeed is a contraindication to the caregiver.</p>",
        "id": 205587400,
        "sender_full_name": "Jorn Duwel",
        "timestamp": 1596200498
    },
    {
        "content": "<p>That's ok. FHIR, as in these resources, doesn't do any of this automatically.</p>\n<p>The caregiver can make the decision, based on standard information in the ClinicalUseIssue  (what doesn't go well with what) and the information in the patient record (especially their Conditions, and of course the medication itself). </p>\n<p>They can also be helped by decision support (some of the lookup can be done by software, to some degree), but ultimately it's up to a human.</p>",
        "id": 205588519,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596201277
    },
    {
        "content": "<p>Flag, DetectedIssue and Condition are patient-specific.  ClinicalUseIssue is patient independent and definitional.  In general, DetectedIssue is a warning that comes back from decision support.  Flag is a sticky on the patient chart that warns other practitioners about something to be careful about.</p>",
        "id": 205591684,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596203336
    }
]