[
    {
        "content": "<p>There is a standard extension for patient for birth place that is currently defined as a general extension, and as a result does not have a prefix of patient- on it.<br>\nThis is the only current standard extension on patient that doesn't have the prefix.<br>\nTracker 12974 requests to update the extension url. Refer to this page to see how out of place it looks.<br>\n<a href=\"http://build.fhir.org/patient-profiles.html\" target=\"_blank\" title=\"http://build.fhir.org/patient-profiles.html\">http://build.fhir.org/patient-profiles.html</a><br>\nPatient is FMM5, thus seeking feedback from the community on this one.</p>",
        "id": 153923998,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1512882367
    },
    {
        "content": "<p>Half of Observation extensions don't start with Observation.:</p>\n<ul>\n<li>1)  I do not consider the extensions to be at the same FMM as the resource.</li>\n<li>2) I don't think they need t o prefix with the resource especially if they can be used by other resources.</li>\n</ul>",
        "id": 153923999,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512884645
    },
    {
        "content": "<p>I dont think birthPlace makes any sense not on patient?</p>",
        "id": 153924006,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1512889023
    },
    {
        "content": "<p>Birth Place may make sense in any 'role resource' played by a person. Any resource which has Birth Date as part of its data could also have Birth Place, as these (under the 'code napoleon') assist to uniquely identify a person.</p>",
        "id": 153924009,
        "sender_full_name": "René Spronk",
        "timestamp": 1512894322
    },
    {
        "content": "<p>Practically speaking does anyone store them for RelatedPerson or Practitioner?</p>",
        "id": 153924014,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1512895989
    },
    {
        "content": "<p>Some of the patient- extensions could be useful for person. Is birth place much different to birth time or nationality? Both of which are defined only for patient.</p>",
        "id": 153924140,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1512955292
    },
    {
        "content": "<p>That's a reasonable question - any Patient extension that might be something of interest as part of shared demographics should probably support Person too, even if there are no use-cases for it on Practitioner or RelatedPerson</p>",
        "id": 153924144,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512959472
    }
]