[
    {
        "content": "<p>Why do patient.contact.relationship and. relatedPerson.relationship use different valuesets?</p>",
        "id": 183705905,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1576627585
    },
    {
        "content": "<p>RelatedPerson.relationship defines their basis for acting, while contact.relationship defines why you might want to contact them, so they're not identical use-cases.  But I don't know why different code systems were chosen.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 183719947,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576644050
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> what do you mean by \"basis for acting\"?</p>",
        "id": 183720096,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1576644266
    },
    {
        "content": "<p>RelatedPerson is someone who can act on behalf of the patient on the basis of their relationship with the patient - that's the primary reason for the existence of the resource.  They can report, perform, author, approve, etc.  Patient.contact entries can't do anything - they can't be pointed to by any other resource.</p>",
        "id": 183720178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576644386
    },
    {
        "content": "<p>Interesting, my reading of the opening paragraph to RelatedPerson gives me the opposite impression, that the patient.contact is the more \"important\" of the two options when it comes to doing actions (decision making vs \"attribution of information\") with the the patient. </p>\n<p><strong>Related Person Narrative</strong><br>\n```RelatedPersons typically have a personal or non-healthcare-specific professional relationship to the patient. A RelatedPerson resource is primarily used for attribution of information, since RelatedPersons are often a source of information about the patient. For keeping information about people for contact purposes for a patient, use a Patient's Contact element. Some individuals may serve as both a Patient's Contact and a Related Person.</p>\n<p>Example RelatedPersons are:</p>\n<ul>\n<li>A patient's wife or husband</li>\n<li>A patient's relatives or friends</li>\n<li>A neighbor bringing a patient to the hospital</li>\n<li>The owner or trainer of a horse</li>\n<li>A patient's attorney or guardian</li>\n<li>A Guide Dog```</li>\n</ul>",
        "id": 183721003,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1576645628
    },
    {
        "content": "<p>It's certainly possible for the same individual to appear in both places, but they can only be pointed to by other resources if they're a RelatedPerson.</p>",
        "id": 183721054,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576645689
    },
    {
        "content": "<p>contacts is really just to provide a list of next of kin or other key people who might need to have information communicated to them.</p>",
        "id": 183721065,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576645725
    },
    {
        "content": "<p>Would it be fair to say that if i were to choose ONE way to communicate this type of information, that \"Related Person\" would be the generally more robust and flexible approach?</p>",
        "id": 183721127,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1576645803
    },
    {
        "content": "<p>You shouldn't plan to use just one way.  You use Patient.contact for information about patient contacts.  You use RelatedPerson for anyone who is authoring, performing, receiving or otherwise acting on behalf of a patient.  Other systems are going to expect contacts to be in Patient.contact - they're not going to go searching for RelatedPersons.  (And there may well be many contacts who don't have RelatedPerson records because they aren't 'actors'.)</p>",
        "id": 183721279,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576646055
    },
    {
        "content": "<p>I asked a similar question a while back (<a href=\"#narrow/stream/179166-implementers/topic/relationship.20in.20Patient.2Econtact.20and.20RelatedPerson\" title=\"#narrow/stream/179166-implementers/topic/relationship.20in.20Patient.2Econtact.20and.20RelatedPerson\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/relationship.20in.20Patient.2Econtact.20and.20RelatedPerson</a>) but I don't think we ever resolved it. In my mind there is a distinction between the relationship the person has to the patient and the role they play. An \"aunt\" may be an emergency contact or may be a guardian. The relationship is not necessarily indicative of a particular role.</p>",
        "id": 183748724,
        "sender_full_name": "Craig Newman",
        "timestamp": 1576675010
    },
    {
        "content": "<p>I agree that the concept of \"relationship\" and \"role\" can be different things. The patient.relationship valueSet is conceptually sticks to just  \"role\" (insurance, emergency contact) than a \"relationship\" (aunt, uncle, neighbour) - while the valueset for related person covers both of the concepts of role and relationship. Both lists are missing some fairly common and important roles like legal guardian, power of attorney, teacher, caregiver ...)</p>",
        "id": 183752725,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1576678118
    },
    {
        "content": "<p>And are both extensible too.</p>",
        "id": 185154024,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1578515776
    }
]