[
    {
        "content": "<p>In remote patient monitoring patient authentication is quite important. The only way I know how to represent this property in FHIR is via the AuditEvent. It has a user authentication type code. But the only option appears to be 'log in/out'. What if it is an Android or iOS device that provides facial or voice recognition, or fingerprint? How would I represent that in the AuditEvent?</p>",
        "id": 153837051,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1468092000
    },
    {
        "content": "<p>Brian, I am not clear on what you are wanting to put into the AuditEvent; but I am worried that you want to put the authentication credentials into the AuditEvent... Please don't ever put authentication credentials into ANY audit. What are you trying to accomplish? I would like to help understanding this so that I can help.</p>",
        "id": 153837131,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468174344
    },
    {
        "content": "<p>I thought he referred to the method of authentication, not the credentials </p>",
        "id": 153837140,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468184415
    },
    {
        "content": "<p>I meant the ID and name, not the password or whatever auth token was used.<br>\nThat's the whole point of the Audit isn't it? To know who did what?</p>",
        "id": 153837150,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468196798
    },
    {
        "content": "<p>There s an example for Login <a href=\"http://hl7-fhir.github.io/audit-event-example-login.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/audit-event-example-login.html\">http://hl7-fhir.github.io/audit-event-example-login.html</a> </p>",
        "id": 153837169,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468201962
    },
    {
        "content": "<p>The AuditEvent.agent.userId would be the place to put the primary identifier for the user. The <a href=\"http://AuditEvent.agent.name\" target=\"_blank\" title=\"http://AuditEvent.agent.name\">AuditEvent.agent.name</a> can contain a descriptive text, although I would recommend against any unnecessary descriptive elements in AuditEvent. Where unnnecessary is something that can be discovered by the auditEvent analysis tool -- like looking up the name in a directory.</p>",
        "id": 153837171,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468202175
    },
    {
        "content": "<p>Yes, in this example that you've provided we do have the username(userId.value) and the name which is the descriptive part.</p>",
        "id": 153837172,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468202532
    },
    {
        "content": "<p>(sorry, cross posted. Wrong Brian here. Thought it was another thread discussion)<br>\nAnd yes, agree with Grahame's answer here.<br>\nCould either extend the valueset to include other authentication methods, or include an extension on the subtype element and when using the login value, to provide a more detailed auth type value.</p>",
        "id": 153837173,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468202796
    },
    {
        "content": "<p>Need <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> to add clarity. The authentication is not something that we have heard is important in our auditEvent. Those federation systems (SAML, OAuth, Kerberos, etc) will typically do their own logging in their own system; it is this that one would go to for this deeper understanding. As <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> indicates, an extension could be used. It would however be good to present the need to see if committee finds it compelling to add as core, or even core extension. </p>",
        "id": 153837308,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468240754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I'm wondering if this will get easier if the AuditEvent resource provides a generic vehicle for recording additional attributes. I think in the case of third-party authentication and authorization (e.g. OpenID Connect or UMA) where the authentication/authorization service doesn't necessarily belong to the same domain as the FHIR server, it is important for the FHIR server to autonomously record sufficient evidence that it has done its job in authenticating and ensuring authorization. So although the respective UMA/OpenID Connect services will do their own auditing, the FHIR server also needs to record enough information to provide the evidence for authentication/authorization and enable audit.</p>",
        "id": 153837365,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1468268087
    },
    {
        "content": "<p>I've seen patient id incorporate source ID system on a routine basis, e.g., \"ID from state DMV\".  Would authentication source be a reasonable aspect of source of ID also?</p>",
        "id": 153837369,
        "sender_full_name": "Robert Horn",
        "timestamp": 1468269732
    },
    {
        "content": "<p>I have also seen implementations that serialize and base64 encode the SAML or JWT token, and save it in the altId which is an infinite size string.  The problem with this is that you then end up with HUGE blot on the audit log service, thousands of exact copies of base64 blobs.</p>",
        "id": 153837371,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468269911
    },
    {
        "content": "<p>Yes, that's a bad idea.  I was thinking of something much shorter and more useful.  Right now the IDs tend to be something like id^issuer-of-ID.  I was considering ID^issuer-of-ID^authenticator  or incorporating authenticator with issuer.</p>\n<p>Another consideration is using DICOM's \"authentication event\" <a href=\"http://dicom.nema.org/medical/dicom/current/output/chtml/part15/sect_A.5.3.12.html\" target=\"_blank\" title=\"http://dicom.nema.org/medical/dicom/current/output/chtml/part15/sect_A.5.3.12.html\">http://dicom.nema.org/medical/dicom/current/output/chtml/part15/sect_A.5.3.12.html</a>.  From an audit perspective I find tracking of the event of authenticating much more interesting than all the many places that the ID might then be used.</p>",
        "id": 153837373,
        "sender_full_name": "Robert Horn",
        "timestamp": 1468270271
    },
    {
        "content": "<p>Best to get ONE audit entry by the Authentication service that expresses the characteristics of the authenticaiton event. Then all the other audit events only need refer to the session authenticaiton identitifcaiton</p>",
        "id": 153837374,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468270288
    },
    {
        "content": "<p>Right now the authentication event is described in terms of login and logout, but we tried to have it cover the other authentications.</p>",
        "id": 153837375,
        "sender_full_name": "Robert Horn",
        "timestamp": 1468270349
    },
    {
        "content": "<p>and this is already what authenticaiton services (saml, oauth, kerberos, etc) already do record in their own way. trying to get them to convert it to a FHIR specific format is hopeless</p>",
        "id": 153837376,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468270352
    },
    {
        "content": "<p>Not just hopeless, a waste of resources.  I was thinking for those cases where someone is looking for a format to use.</p>",
        "id": 153837379,
        "sender_full_name": "Robert Horn",
        "timestamp": 1468270453
    },
    {
        "content": "<p>\" I'm wondering if this will get easier if the AuditEvent resource provides a generic vehicle for recording additional attributes\" - that's called an extension</p>",
        "id": 153837383,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468271781
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span> -- FHIR already defines a well behaved extension mechanism. The parent standard in ATNA --- DICOM --- allows well-behaved xml based extension. So in either paradigm you have defined ways to extend.  That said, the extension should be careful.</p>",
        "id": 153837637,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468327855
    },
    {
        "content": "<p>Grahame, I did mean the method of authentication such as finger print, voice recognition, BTLE UDS, facail recongition, etc. It would mirror the content of the UAC segment in V2 messaging.</p>",
        "id": 153838890,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1468661053
    },
    {
        "content": "<p>John, Hope I clarified my question. Looks like there are two Brian's in this thread that got short-circuited!</p>",
        "id": 153838891,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1468661281
    },
    {
        "content": "<p>I DO like the value set idea.</p>",
        "id": 153838892,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1468661338
    },
    {
        "content": "<p>I really think that the authentication strength/method should be reported only by the Actor responsible for authenticating. In a Federated Identity model this is a third party. In SAML there is an element that carries the method used to authenticate. So Relying Parties can know. SAML has a vocabulary rooted at urn:oasis:names:tc:SAML:2.0:ac:classes.  So there is a vocabulary already in existence. However when you look at it you see that this kind of a vocabulary is very hard to make and manage.  Everyone reporting this will simply fill the audit log with unnecessary duplication. I recommend you record the unique instance identifier from the federation authority, and the user identity it claims. This way an audit log analysis can discover more from the log entries that the federation authority records. -- This is simply the principle I urge for all elements in the audit log, to record in the audit log identifiers, not data.</p>",
        "id": 153838904,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468676494
    }
]