[
    {
        "content": "<p>Hi everyone! We are developping an application to be used by pediatric palliative care units to coordinate children’s healthcare in a context of palliative cares. But we are new to FHIR and still trying to figure out how to implement it on the best possible way.<br>\nFor the patients data for instance, the Patient ressource covers well most of the information we have (name, contact data, date of birth etc). But we also need to include:</p>\n<p>Date of 1st contact<br>\nContact origin<br>\nContact motive<br>\nInclusion date<br>\nWeight at inclusion<br>\nHeight at inclusion<br>\nLansky score<br>\nPlace of death</p>\n<p>Should we create an extension to the Patient resource or instead do something like:</p>\n<ul>\n<li>\n<p>use ReferralRequest where<br>\n\"Date of 1st contact\" is authoredOn<br>\n\"Contact origin\" is requester<br>\n\"Contact motive\" is type (or reasonCode ? )</p>\n</li>\n<li>\n<p>use Encounter where<br>\n\"Inclusion date\" is period<br>\nthe fact that it is the first contact is coded in type<br>\nthe incomingReferral points to the ReferralRequest created above</p>\n</li>\n<li>\n<p>use Observation for \"Weight at inclusion\", \"Height at inclusion\", \"Lansky score\" <br>\nbasedOn points to the ReferralRequest created above<br>\ncontext points to the Encounter created above</p>\n</li>\n</ul>\n<p>And \"Place of death\" could be added as an exension of Patient.</p>\n<p>What is the best way to include these data ?<br>\nSorry if my question seems basic, I just started to work with FHIR, it is all very new to me</p>",
        "id": 153890090,
        "sender_full_name": "Luma Delaplace",
        "timestamp": 1494942655
    },
    {
        "content": "<p>Hi Luma,<br>\nGood question.  I would say, you should had those derivative elements as extension in patient in order to ease calculus. But I am new to FHIR too.</p>\n<blockquote></blockquote>\n<p>I am really interested in the official answer too.</p>",
        "id": 153890106,
        "sender_full_name": "natus",
        "timestamp": 1494952656
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193845\">@Luma Delaplace</span> always try to avoid extensions where ever it is possible. Extensions have a negative impact on the interoperability of the resource,  as it is only interpretable by systems which are aware of an extension. Other systems are just ignoring the data which is stored in the extension fields.</p>",
        "id": 153890112,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1494960642
    },
    {
        "content": "<p>its unclear from the context what you are trying to achieve and what the definitions of many of these data elements are (such as what does contact refers to).  But it looks like you are heading in the right direction.  In FHIR clinical resource  directly reference the patient resources an encounter or episode of care resources.   Many patient characteristics can be represented with Observation while  problems and conditions are handled by Condition.  Regarding the extension there is a standard  <a href=\"http://build.fhir.org/extension-birthplace.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-birthplace.html\">birthplace extension</a> in FHIR and I think a deathplace extension is perfectly appropriate.  Possibly even worthy of submitting a tracker.</p>",
        "id": 153890113,
        "sender_full_name": "Eric Haas",
        "timestamp": 1494962764
    },
    {
        "content": "<p>this seems like data related to clinical trial selection rather than to the patient directly. </p>",
        "id": 153890164,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495000983
    },
    {
        "content": "<p>I don't see anything clinical-trial related here.  It seems more like an EpisodeOfCare.  That would let you capture some of this and you could group other things.  If you do extend, I'd probably extend the episode rather than the patient overall.  Place of death definitely makes sense as an extension on patient.</p>",
        "id": 153890230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495038826
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> Extensions are actually pretty common in FHIR and are a fine way to meet certain types of requirements.  Certainly you should try to find a \"core\" way to do things first, but many of these items don't strike me as \"core\" elements.</p>",
        "id": 153890231,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495038902
    },
    {
        "content": "<p>my point was, try to avoid extensions if you can do the same with core resources. If you have to extend first have a look at existing core extensions. If you still can't find an extensions wich fits your needs create an extension. I always tell it like this to our students because their intuitive is to use a patient resource and persist everything within the patient as extensions.</p>",
        "id": 153890233,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1495039099
    },
    {
        "content": "<p>Agree with your approach.  Extensions on Patient should be related to their demographics.  Information about their care should generally be elsewhere.</p>",
        "id": 153890235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495039437
    },
    {
        "content": "<p>I'm co-worker of Luma Delaplace she's not available actually, I transmit some answer.</p>",
        "id": 153890469,
        "sender_full_name": "Emmanuel Chevallier",
        "timestamp": 1495137046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"eric@montagesystems.com.au\" data-user-id=\"487\">@Eric Browne</span> Haas<br>\nThe application's aim is to allow palliative care units to better coordinate the children healthcare. It is more focused on events (encounters and/or episode of care) and less (at least for now) on keeping record of strictly clinical data (treatment, medical exams, etc). By contact I meant contact information, so adress and telecom.</p>\n<p>Here is the data we are ask to include and the attributes of the Patient resource we are thinking in using :<br>\nID --&gt; identifier<br>\nSex --&gt; gender<br>\nLast name --&gt; name<br>\nFirst name --&gt; name<br>\nDate of birth --&gt; birthDate<br>\nAddress --&gt; address<br>\nDate of death --&gt; deceased[x]</p>\n<p>Technical specification also included the following : <br>\nDate 1st contact : the date the first contact is made between the palliative care unit and the patient/or patient care unit. It is usually a phone call<br>\nContact origin : the person / oragnisation/ practitionner who made the 1st contact<br>\nContact motive : the reason of the 1st contact<br>\nInclusion date : the date of the first encounter with the child patient<br>\nWeight at inclusion : the weight of the child patient at the first encounter with the palliative care unit<br>\nHeight at inclusion : the height of the child patient at the first encounter with the palliative care unit<br>\nLansky score : : the lansky score of the child patient at the first encounter with the palliative care unit<br>\nPlace of death : the place where the child patient deceased (if deceased)</p>\n<p><span class=\"user-mention\" data-user-email=\"grahame@healthintersections.com.au\" data-user-id=\"10\">@Grahame Grieve</span> Grieve<br>\nOur data is indeed not related to clinical trial, but the palliative care units want statistics on their activities (for all patients, how many encounters of type x in a given period of time, etc)</p>\n<p>As advised <span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\" data-user-id=\"14\">@Lloyd McKenzie</span> McKenzie, we are thinking to not to extend the Patient resource and keep only demographic data in it (except for the place of death which would be an extension of Patient).</p>",
        "id": 153890470,
        "sender_full_name": "Emmanuel Chevallier",
        "timestamp": 1495137051
    },
    {
        "content": "<p>My leaning would be to have place of death an extension on Patient (and it makes sense to request it as a \"standard\" extension).  Date of 1st contact would be EpisodeOfCare.period.start.  The remainder would be extensions on EpisodeOfCare.</p>",
        "id": 153890479,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495141689
    },
    {
        "content": "<p>Note that you could fully model out the initial contact as a Communication, Encounter, Observations for height, weight, lansky score.  And it would be best to not have that information in multiple places.  So ideally, your extensions would be \"References\" pointing to the appropriate resources.  </p>",
        "id": 153890480,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495141794
    }
]