[
    {
        "content": "<p>My organization is going to begin requiring whether a patient prefers to have an interpreter present. Was curious how others are approaching this? We see this extension, and are planning to use this -- is this the best approach? </p>\n<p><a href=\"https://www.hl7.org/fhir/extension-patient-interpreterrequired.html\">https://www.hl7.org/fhir/extension-patient-interpreterrequired.html</a></p>\n<p>How do people feel about incorporating this into the official Patient data model, especially for US Core? This seems like a very beneficial data element to track.</p>",
        "id": 269525796,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1643259238
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base/StructureDefinition-au-patient.html\">HL7 AU Patient</a> includes the extension as guidance.</p>",
        "id": 269527935,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1643261505
    },
    {
        "content": "<p>It might make sense as a standard extension.  Feel free to submit a change request</p>",
        "id": 269641360,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643319197
    },
    {
        "content": "<p>I hope you make the US Core extension a little more robust. For instance, if the Dr. speaks English I don't need/want an interpreter. If they speak French then I do. Perhaps it's an extension on languageCommunication instead of Patient.</p>",
        "id": 269643946,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1643320216
    },
    {
        "content": "<p>This seems like an extension that would ideally be international, rather than U.S.</p>",
        "id": 269658668,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643327025
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> I agree on your point of view -- I would want something similar. But I'm also thinking that perhaps this is something that is handled by each EHR. For example, at my company, I am thinking we could use this extension, but when writing to FHIR our code would check if the patient's primary language was English -- if so we could default the interpreter_required element to the value indicating 'no interpreter required'</p>\n<p>Also, I think this may vary from one hospital to another -- some patients may have English as a language and yet still want an interpreter -- so I'm thinking that we would want this the extension to stay as-is, and then EHR's can programmatically fill it in based on the preferences at the hospital.</p>\n<p>Thoughts? I am guessing we are already seeing stuff like this elsewhere.</p>",
        "id": 270083725,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1643654996
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"408229\">Daniel Tam</span> <a href=\"#narrow/stream/179166-implementers/topic/Patient.20--.20Interpreter.20required/near/270083725\">said</a>:</p>\n<blockquote>\n<p>...but when writing to FHIR our code would check if the patient's primary language was English -- if so we could default the interpreter_required element to the value indicating 'no interpreter required'</p>\n</blockquote>\n<p>What if the Patient primary language was French and the Provider was Fluent French? Would you still mark it as interpreter required?</p>",
        "id": 270089224,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1643656846
    }
]