[
    {
        "content": "<p>Is there a resource in DSTU3 that represents a workflow to track Patient Education on issues like Obseity, Smoking or Dialysis Adequacy?</p>",
        "id": 153858525,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1480104146
    },
    {
        "content": "<p>If you're interested in conveying \"this sort of information was shared\", look at 'Communication'.  If you want to track that there was an educational session (e.g. smoking cessation counselling session), look at 'Procedure'.</p>",
        "id": 153860736,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1480955787
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192784\">@ravi.kuchi</span> (And sorry for the slow response)</p>",
        "id": 153860738,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1480955806
    },
    {
        "content": "<p>How would you model Patient Education space?  If a patient was educated prior to treatment, ways to learn, possible learning difficulties?</p>",
        "id": 153989936,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1534892436
    },
    {
        "content": "<p>Delivering traning/education to a patient would be Procedure (or just Communication if all you're doing is giving them a pamphlet or pointing them to a website).  Assessments of optimal learning styles, learning difficulties would be Observations</p>",
        "id": 153990456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535040825
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 153993220,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1536097640
    },
    {
        "content": "<p>Resurrecting this for a slightly different angle:  do we have a resource for representing the actual education content that is being communicated? I.e. the resource that would be referenced by Communication.content?  If there is pre-built educational material for topics like availability of community resources like babysitters, information about how to give insulin injections, how to take a blood pressure reading, information about fall risk, etc..   DocumentReference seems like it might be the answer for the content - then you can use Communication to track when/if that was communicated to the patient.  DocRef doesn't feel exactly right, but it is the best I see.</p>",
        "id": 233661413,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1617892029
    },
    {
        "content": "<p>We don't have a resource that fully describes educational material - e.g. delivery mode, comprehension level, literature support, etc.  However, DocumentReference is the best home we have.  And if someone wanted more, profiling DocumentReference would be the most likely path forward.</p>",
        "id": 233667186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617893916
    }
]