[
    {
        "content": "<p>I am working on a project in which FHIR-data for a given patient is being exchanged between multiple doctors and the patient herself. Some types of data (e.g. a vital sign) can come from either the patient or a doctor, with the source encoded in the standard way, e.g. in <code>Observation.performer</code>. How a piece of information is handled by doctors (and their clinical systems) can depend strongly on whether it comes from another doctor or the patient. E.g. patient-reported information might be associated with a much lower certaintly (as e.g. <a href=\"http://(http://build.fhir.org/observation-definitions.html#Observation.performer)\" target=\"_blank\" title=\"http://(http://build.fhir.org/observation-definitions.html#Observation.performer)\">the description of <code>Observation.performer</code></a> explicitly acknowledges) and be classified differently in the clinical system. So although <code>Observation.performer</code> is not an is-modifier, the link with certainty would seem to implicitly move it close to <a href=\"http://build.fhir.org/conformance-rules.html#isModifier\" target=\"_blank\" title=\"http://build.fhir.org/conformance-rules.html#isModifier\">the description of is-modifier property</a>, e.g.</p>\n<blockquote>\n<p>Typical examples of elements that are labeled \"Is-Modifier\" are elements such as \"status\", \"active\", \"refuted\", or \"certainty\" that invert or negate the meaning of the resource (or element) that contains them. </p>\n</blockquote>\n<p>My question is how to mark and best handle such implicit uncertainties (patient reported vs. \"real medical\" information) in fields that are not is-modifers. I also encountered this in the context of an extension which effectively marks some data as being patient-reported - here, the question would be whether (or under what circumstances) such an extension should be a modifier-extension.</p>",
        "id": 154020419,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1542878945
    },
    {
        "content": "<p>I think patient-reported vs. practitioner-reported is rather a qualifier than a modifier. While <em>certainty</em> per se can be anything from \"highly unlikely\" to \"absolutely certain\", a patient reported Information would only lower the probability of the information being correct by a <em>small</em> amount, but never to the point of negation. However, if in a specific scenario like yours, the information of who performed the Observation is very important and should never be ignored by anyone you're exchanging the data with, you might want to mark it as \"must-support\".</p>",
        "id": 154020421,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542882239
    },
    {
        "content": "<p>Thanks, a case-by-case- approach sounds sensible given that it is probably a bit of a gray area. On some other resources, there are explicit is-modifier fields for this sort of thing (e.g. <code>Condition.verificationStatus</code>) which is of course nicer than being forced to add a modifier-extension.</p>\n<p>Incidentally, I guess a similar question pops up in the context of resources generated by data extraction services <span class=\"emoji emoji-1f604\" title=\"smile\">:smile:</span></p>",
        "id": 154020433,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1542886456
    },
    {
        "content": "<p>Why do you need an externsion to tell if the observation is from patient or not. You can get that from the url pattern of Observation.performer.reference. (eg: patient/xxx vs practitioner/xxx)</p>",
        "id": 154020552,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542912851
    },
    {
        "content": "<p>There's a difference between \"who performed\" and \"who captured the information in the record\".</p>",
        "id": 154020566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542919194
    },
    {
        "content": "<p>If a patient reports their HDL cholesterol to a new doctor, the Patient isn't the \"performer\" of the observation - that would be some unknown lab.  They're simply the \"reporter\" of the Observation.</p>",
        "id": 154020568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542919237
    },
    {
        "content": "<p>What <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> mentioned in his first post were those performed by patient self, such as blood pressure.</p>",
        "id": 154020572,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542927484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Right, these would be <code>Observation</code> instances reflecting measurements the patient really carried out herself (weight, temperature etc). <br>\n<span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> The extension I meant is from another context: a certain type of FHIR documents that carry either information provided by the patient or by doctors. Since for our use case these are conceptually distinct, we have an extension capturing that classification.</p>",
        "id": 154020594,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1542974027
    },
    {
        "content": "<p>There's a difference between \"performed by\" vs. \"provided by\".  Performed by can be captured with the performer.  However, if you want to distinguish who provided the information rather than who made the measurement, that requires an extension</p>",
        "id": 154020612,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542987360
    },
    {
        "content": "<p>Right, that is probably a better way to think about the document extension we have (which may then be a modifier extension if the context makes this information essential).</p>",
        "id": 154020779,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1543220928
    },
    {
        "content": "<p>I think you mis-understand what modifier does.   It does not mean that it makes some content more important or essential as you stated.   It changes the meaning of the parent element.   Every element is essential in one context or another.   Must support is use to require it and the user ignores something at their peril.</p>",
        "id": 154020884,
        "sender_full_name": "Eric Haas",
        "timestamp": 1543250287
    },
    {
        "content": "<p>Also the element Condition.verificationStatus does the same thing as Observation.status.   They are both marked as modifiers since the status ‘entered in error’  nullifies the meaning of the resource.   I think Condition.clinicalStatus is not a modifier and the committee whiffed on that one.</p>",
        "id": 154020885,
        "sender_full_name": "Eric Haas",
        "timestamp": 1543250610
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  ?  Fixing to create a tracker to get rid of the modifier flag on Clinical status.  Your thoughts</p>",
        "id": 154020886,
        "sender_full_name": "Eric Haas",
        "timestamp": 1543250717
    },
    {
        "content": "<p>That was unfortunately a poor formulation on my part: by \"context\", I meant the specific use-case (associated with specific profiles) not the \"runtime context\". I just meant to say that the use-case would determine whether a particular extra piece of information needs to profiled in using a modifier extension (namely exactly if that information changes the meaning of the parent element).</p>",
        "id": 154021058,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1543327789
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I think Condition.clinicalStatus is gray.  On one hand, it doesn't have entered-in-error, which is the default reason why most other statuses are considered modifiers.  That said, on the other hand, PC still wanted it to be a modifier since it does have inactive, which is saying that there is no longer evidence of the condition (so it is negating the current presence of the condition).</p>",
        "id": 154021218,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1543372563
    },
    {
        "content": "<p>It’s still s patient condition</p>",
        "id": 154021475,
        "sender_full_name": "Eric Haas",
        "timestamp": 1543464830
    },
    {
        "content": "<p>I don't see an Observation \"reporter\" extension.  I would support one being added, though, since we've (speaking as an implementer now) wrestled with this same question as well.  <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> are you planning to log a change request asking for a core extension?</p>",
        "id": 154021671,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1543499718
    },
    {
        "content": "<p>Patient reported data can also have a Provenance record indicating that it is reported by the Patient.</p>",
        "id": 154021689,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543503363
    },
    {
        "content": "<p>There is also the possibility you can use security tags to indicate the assessed \"Integrity\" of that data. See the security tags for integrity <a href=\"http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html\">http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html</a></p>",
        "id": 154021690,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543503407
    },
    {
        "content": "<p>Tag that may be of interest:<br>\nUNRELIABLE  <br>\n<a href=\"http://terminology.hl7.org/CodeSystem/v3-ObservationValue\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/v3-ObservationValue\">http://terminology.hl7.org/CodeSystem/v3-ObservationValue</a>   <br>\nunreliable  <br>\nSecurity metadata observation value used to indicate that the veracity or trustworthiness of an IT resource (data, information object, service, or system capability) for a specified purpose of use is perceived to be or deemed by policy to be inadequate.</p>",
        "id": 154021693,
        "sender_full_name": "Drew Torres",
        "timestamp": 1543504342
    },
    {
        "content": "<p>That is what we are planning on using to highlight patient reported data before an end user reviews the data.</p>",
        "id": 154021694,
        "sender_full_name": "Drew Torres",
        "timestamp": 1543504381
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> We weren't planning to - in our case (for <code>Observation</code>),  the key piece of information is that the measurement was performed by the patient, so <code>performer</code>actually does the job. I was mainly just trying to understand whether (and if so, how) one should somehow further flag the fact that data was collected by the patient and hence on a different certainty-level. <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span>  Thanks for the further options! Given the no. of approaches, I get the feeling this is something that needs to be explicitly settled in each use-case so that clients know what to look for.</p>",
        "id": 154021697,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1543504781
    },
    {
        "content": "<p>certainly unreliable might be true, but why not use PATAST which is more specifically identifying that it was patient asserted?  Some patients are unreliable, but not all of them</p>",
        "id": 154021698,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543504784
    },
    {
        "content": "<p>yes, a core specification like FHIR needs to provide many possible solutions. An Implementation Guide would define how those using that implementation guide choose to do it the same way.</p>",
        "id": 154021699,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543504853
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>! I missed that while skimming the list. I will switch our strategy to leverage that.</p>",
        "id": 154021701,
        "sender_full_name": "Drew Torres",
        "timestamp": 1543505020
    },
    {
        "content": "<p>.. which is the better option anyway. For even clinician-reported observations may be considered unreliable/less reliable depending on who made the observation. In general a healthcare practitioner trusts their direct colleagues, and maybe less so when the data was sources from elsewhere (e.g. data recieved from a foreign hospital). As such 'reliability' is in the eye of the beholder. Much better to document where the data came from, and leave any interpretations as to the trustworthyness of that source up to whoever is using the data.</p>",
        "id": 154023894,
        "sender_full_name": "René Spronk",
        "timestamp": 1544353086
    }
]