[
    {
        "content": "<p>Why doesn't US Core (and related IGs which use SMART for patient-scoped access) require clients to use compartment search?</p>",
        "id": 219669458,
        "sender_full_name": "John Timm",
        "timestamp": 1607725019
    },
    {
        "content": "<p>Why would it?  Compartment search is just an alternate syntax.  It doesn't provide any additional capabilities...</p>",
        "id": 219670212,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607725630
    },
    {
        "content": "<p>If the AuthN/AuthZ is patient-scoped, then I would assume the intention is to only allow the patient access to their own data. Restricting to Patient compartment search is more compatible with that intent than \"standard\" search.</p>",
        "id": 219728057,
        "sender_full_name": "John Timm",
        "timestamp": 1607807266
    },
    {
        "content": "<p>Can you provide an example? I think I am missing something in this question...</p>",
        "id": 219728730,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1607808139
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192334\">@John Timm</span> The correspondence between SMART scopes like <code>patient/*.read</code> and FHIR's \"Patient Compartment\" is imperfect. For example, related resources required to make sense of a Patient's observations, encoutners, etc would generally be exposed to an app with <code>patient/*.read</code> permissions, even though they might not be technically in the patient's compartment.</p>",
        "id": 219782664,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607895376
    },
    {
        "content": "<p>Because of these distinctions, it's easier to avoid the compartment syntax and its (appealing but not-quite-accurate) promise of simplicity/correctness.</p>",
        "id": 219782677,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607895405
    }
]