[
    {
        "content": "<p>In PA  we're durrently discussing the Patient.link.type ValueSet:<br>\n<a href=\"http://hl7-fhir.github.io/valueset-link-type.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/valueset-link-type.html\">http://hl7-fhir.github.io/valueset-link-type.html</a><br>\nWe're wondering what the usecases for \"seealso\" and \"refer\" are and what the disambiguation is. <br>\nAlso: how do these link types relate to the concept of \"Person\" as the linking element for multiple active Patient records?</p>\n<p>If anyone uses \"seealso\"/\"refer\" link types and has feelings against them being removed from the valueSet, please speak up!</p>",
        "id": 153850294,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474490452
    },
    {
        "content": "<p>Hi Simone, we are using \"refer\" in Ontario: our MedicatioDispense resource has a refercne to a \"point-in-time\" Patient resource with information that was captured by a pharmacy at the time of dispense. This Patient resource in turn has a refernce to our \"master\" Patient resource.</p>",
        "id": 153850316,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1474510046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span>: So are you linking two Patient resources across different systems, stating that they are both the same person?<br>\nOr is this more like having a duplicate Resource in one system with one being \"correct/active\" and the other being an inactive, possibly incorrect/outdated relic?</p>",
        "id": 153850371,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474551515
    },
    {
        "content": "<p>You are using \"refer\" type link bidirectionally. Interestingly the \"refer\" doesn't seem to satify your usecase very well, since it states </p>\n<blockquote>\n<p>The patient resource containing this link is in use and valid but *not* considered the main source of information about a patient.</p>\n</blockquote>\n<p>However they can't be both \"*not* considered the main source\".  In our discussion, we did recognize the requirement for bidirectional references, so we propose to rename \"replace\" to \"replaced-by\" and introduce an additional type \"replacing\" for the backreference from the active to the inactive Patient. </p>",
        "id": 153850390,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474552072
    },
    {
        "content": "<p>We are wondering, if there is a use case for having linked Patient resources within the same system and have them both \"valid and active\".</p>",
        "id": 153850391,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474552200
    },
    {
        "content": "<p>It sounds to me like your point-in-time copy of the patient should be inactive to prevent this Resource from accidentially being used instead of the master record, no?</p>",
        "id": 153850392,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474552372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>, our use is not bi-directional: it goes in one direction from the \"point-in-time\" inactive Patient resource to the current/active resource. We have clear explanation in our specification that the former (inactive) resource should only be used for investigation (call a pharmacy) if MedicationDispense is \"suspicious\", i.e. this might be an error/wrong identity on a dispense or a fraud (someone pretended to be a different person to get a drug). It's not about police investigation here, but rather about a clinical need to remove the wrong dispense event from the patient's list of medications.</p>",
        "id": 153850397,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1474553071
    }
]