[
    {
        "content": "<p>How can i map patient created by and datetime, updated by and datetime, merged by and reason to FHIR resources?</p>",
        "id": 273794727,
        "sender_full_name": "Sirisha Rao",
        "timestamp": 1646221883
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Can you suggest something here?</p>",
        "id": 273794969,
        "sender_full_name": "Sirisha Rao",
        "timestamp": 1646222014
    },
    {
        "content": "<p>Those go into Provenance</p>",
        "id": 273826588,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1646235985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  How different is AuditEvent from Provenance?</p>",
        "id": 273848193,
        "sender_full_name": "Sirisha Rao",
        "timestamp": 1646243375
    },
    {
        "content": "<p>AuditEvent is a record held in the Audit system and is a record of access, etc.  Provenance is a record of change/history that accompanies a Resource</p>",
        "id": 273849301,
        "sender_full_name": "David Pyke",
        "timestamp": 1646243773
    },
    {
        "content": "<p>Here is the scope text from the FHIR core for Provenance</p>\n<p>The Provenance resource tracks information about the activity that created, revised, deleted, or signed a version of a resource, describing the entities and agents involved. This information can be used to form assessments about its quality, reliability, trustworthiness, or to provide pointers for where to go to further investigate the origins of the resource and the information in it.</p>\n<p>Provenance resources are a record-keeping assertion that gathers information about the context in which the information in a resource was obtained. Provenance resources are prepared by the application that initiates the create/update etc. of the resource. An AuditEvent resource contains overlapping information, but is created as events occur, to track and audit the events. AuditEvent resources are often (though not exclusively) created by the application responding to the read/query/create/update/etc. event.</p>",
        "id": 273850275,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646244071
    },
    {
        "content": "<p>Not going to copy the AuditEvent definition -- but to add that AuditEvent is usable for events well beyond those recorded in Provenance. including workflow steps, security activities, privacy activities, etc -- <a href=\"http://build.fhir.org/auditevent.html#bnc\">http://build.fhir.org/auditevent.html#bnc</a></p>",
        "id": 273850595,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646244179
    }
]