[
    {
        "content": "<p>We  are considering potential HL7 Connectathon track in San Diego surrounding Patient Reported Observations  (e.g., collecting nutrition data or BGs using there Iphone).  My particular interest in bringing this up is to uncover any issues with the Observation resource as it relates to Patient Reported Observations.  Things like vague or relative timing of events.. ( e.g., before breakfast) and other things I am not aware of.   If you are interested in participating as either a client (app) or server or both, can suggest a scenario or two and can pull yourself away from the beach while in San Diego  Let me know and I will consider putting together a Connectathon track together.  </p>",
        "id": 153892752,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496869743
    },
    {
        "content": "<p>Eric,<br>\nBy patient reported observations do you mean having a patient take and report his/her own pulse and things like that? Or even take a measurement with a medical device but record the results manually since the device has no communication capability?</p>",
        "id": 153892755,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1496869886
    },
    {
        "content": "<p>I'd like to participate in such a track, by both device and manually. In general, I think there could be quite a few  helpful tracks that cover \"Patient entered data\", not just in regards to Observation - vitals. <br>\nBesides some of the basic workflows I can think of, it'd be interesting to have a scenario surround the full workflow - first entering the data, then retrieving the data and how that data is presented if a practitioner has or has not verified it's accuracy. I.e. should the status of a hand entered, maybe misspelled, allergy be shown as \"active and confirmed\" or \"active but unconfirmed\".</p>",
        "id": 153892773,
        "sender_full_name": "Danielle Friend",
        "timestamp": 1496876587
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>  yes to both.   and <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span>  my interest is specifically in the Observation resource maturity but those are things that could be explored in this context an applied to other resources.</p>",
        "id": 153892795,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496880141
    },
    {
        "content": "<p>Well we certainly make extensive use of the Observation resource in PHD/PoCD mapping. As you know we have two requests for updates on the Observation; addition of PINF and NINF  as well as NAN for consistency with V2 messaging in the dataAbsentReason and the addition of the DeviceComponent as well as Device and DeviceMetric for the Observation.device element.</p>",
        "id": 153892893,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1496915181
    },
    {
        "content": "<p>Provenance would be critical to give attribution to the Patient. I understand Observation includes a performer which can be Patient. At least we should consider requiring Provenance so that all patient attributed data can be easily discovered, not just Observations.</p>",
        "id": 153892963,
        "sender_full_name": "John Moehrke",
        "timestamp": 1496926357
    },
    {
        "content": "<p>May be also useful to look at using the security-label of PATAST <a href=\"http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html\">http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html</a> </p>",
        "id": 153892964,
        "sender_full_name": "John Moehrke",
        "timestamp": 1496926442
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>  re those trackers need to schedule when you can be on an OO call - Next Week perhaps.  The first is unlikely and the second likely ( but would like Healthcare Devices input on it ).  see the followups in the tracker.</p>",
        "id": 153892976,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496933358
    },
    {
        "content": "<p>There's a reasonable prospect of being joined by openMHealth for this. And there's another related stream I'll be proposing that will bring participants interested in this subject as well</p>",
        "id": 153893010,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496955665
    },
    {
        "content": "<p>OK so it sound like a tract then.  I will be the titular lead but welcome other candidates.    <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  would like to see Prov used too but  category could be used for filtering and searching too.</p>",
        "id": 153893016,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496956472
    },
    {
        "content": "<p>Yes. I can work with you on getting Prov in there. </p>",
        "id": 153893101,
        "sender_full_name": "John Moehrke",
        "timestamp": 1497011113
    },
    {
        "content": "<p>I have just only started work on  the <a href=\"http://wiki.hl7.org/index.php?title=201709_Patient_Reported_Observations\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201709_Patient_Reported_Observations\">Patient Reported Observations Connectathon track</a> and before I go much further in fleshing out the details, I would really like to get some feedback and suggestion from you all specifically regarding the Scenarios:  Are these 2 scenarios appropriate use cases.   In regards to self reporting of observations What are the specific \"pain points\" and other issues that you would like to focus on when interacting.  Issues we have identified are fuzzy times and ambiguous responses.   In addition I had assumed that there is typically a gateway device rather than a directly link to a Personal HealthCare Device.  Should we include both \"architectures\"?</p>",
        "id": 153894813,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498070755
    },
    {
        "content": "<p>Remember the focus of the track is on how well Observation can handle this data.</p>",
        "id": 153894814,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498070819
    },
    {
        "content": "<p>Also what servers would be up for participating in this tract?</p>",
        "id": 153894882,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498088453
    },
    {
        "content": "<p>would work with any of the generic servers? I don't think I need to do anything?</p>",
        "id": 153894889,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498096391
    },
    {
        "content": "<p>I don't think so either.  Maybe handle the standard extensions.   </p>",
        "id": 153894898,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498106590
    },
    {
        "content": "<p>think you should add that - just work with the generic servers . Does this link with the lastN stream?</p>",
        "id": 153894906,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498112608
    },
    {
        "content": "<p>You could add what you expect from the FHIR server. Should it validate incoming Observations (and reject invalid ones) for example?</p>",
        "id": 153894926,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1498129399
    },
    {
        "content": "<p>I think it would require that the server is one that supports Provenance. Patient generated data needs good Provenance. And clients that utilize the Observation might want to look to Provenance to understand the source of the data.</p>",
        "id": 153894930,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498135105
    },
    {
        "content": "<p>@GG  the lastN is a different stream and i'd rather keep them separate.  I have a full plate with two streams plus the argonaut scheduling.</p>",
        "id": 153894963,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498143955
    },
    {
        "content": "<p>perhaps you should cross-reference the streams in the doco? they seem somewhat related. Appreciate the load problem ;-)</p>",
        "id": 153895011,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498163050
    }
]