[
    {
        "content": "<p>Hello everyone,</p>\n<p>I'm currently working on my first FHIR project (loving it this far!).<br>\nHowever, we ran into a problem we cannot find any solution for. We're trying to poll for updated encounters while including the relevant patient object in the response.</p>\n<p>Our URL looks something like this: <a href=\"http://baseUrl/Encounter?_lastUpdated=gt2021-10-26T09:00&amp;_include=Encounter:subject&amp;_include=Encounter:location\">http://baseUrl/Encounter?_lastUpdated=gt2021-10-26T09:00&amp;_include=Encounter:subject&amp;_include=Encounter:location</a></p>\n<p>When testing this against one of the public R4 test servers, we're able to get the referenced patient via 'encounter.getSubject().getResource()', which is the standard as far as I can tell.</p>\n<p>However, when performing the same requests against one of our company's own test servers, we're always receiving a null value. We've compared the returned JSONs multiple times, but as far as we can tell there's not really anything wrong/different between the two.</p>\n<p>Has anyone else encountered similar problems before?</p>\n<p>Kind regards</p>\n<p>Brian</p>",
        "id": 276049192,
        "sender_full_name": "Brian Poncelet",
        "timestamp": 1647868880
    },
    {
        "content": "<p>Does your own test server supports includes? Many servers do not.</p>",
        "id": 276050851,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1647869686
    },
    {
        "content": "<p>Yes, the relevant Patient is included in the response.</p>",
        "id": 276056124,
        "sender_full_name": "Brian Poncelet",
        "timestamp": 1647871974
    },
    {
        "content": "<p>not being able to see the search set Bundle, it is hard for us to help you... further, if you say the content is in the search set Bundle, then this is likely a question for your interface tooling.</p>",
        "id": 276057004,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647872376
    }
]