[
    {
        "content": "<p>Why is this a US Realm extension not a standard element?</p>",
        "id": 153858667,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1480329059
    },
    {
        "content": "<p>because of the 80-20 rule? I don't think the religion of a patient is relavant for the determination of the treatment</p>",
        "id": 153858671,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1480339386
    },
    {
        "content": "<p>Really - a number of religions restrict the treatments allowed (eg. transfusions) similar to how they restrict food (eg. pork) and end-of-life handling. Based on the 80% guideline I think we need to look at whether religion is normally recorded - and certainly for North America and the middle east it is.</p>",
        "id": 153858690,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1480347458
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> , is it the religion itself that's relevant to communicate or the actual limitations in treatments caused by the religion? The latter seem to be covered fairly well by DetectedIssue.</p>",
        "id": 153858693,
        "sender_full_name": "Viktor Jernelöv",
        "timestamp": 1480347983
    },
    {
        "content": "<p>What I know is that I have never in a potential treatment setting been asked for my DetectedIssues or for a list of foods restrictions (other than intolerances) or treatment restrictions (other than drug intollerances) or end-of-life requirements - but I have often been asked my religion - so I'm guess that is what is still recorded.</p>",
        "id": 153858694,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1480348529
    },
    {
        "content": "<p>And the doctor inferring your treatment restrictions from your recorded religion is fine with you? As for 80/20: I have never been asked for my religion in Dutch Healthcare. I guess the same applies to most of Europe, though I can't be certain there. </p>",
        "id": 153858699,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1480352370
    },
    {
        "content": "<p>It would lead them to ask questions which otherwize may not be required, or answeredable if you have died.</p>",
        "id": 153858700,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1480353614
    },
    {
        "content": "<p>I would expect to be asked my religion for a hospital admission here in Australia. So <br>\n- Europe : no<br>\n- USA: yes<br>\n- Australia: yes (inpatient)<br>\n- India: yes<br>\n- Middle East: yes<br>\n- Canada: <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> ?<br>\n- South America: <span class=\"user-mention\" data-user-id=\"191839\">@diego kaminker</span> <br>\n- Russia- @<strong>nicola (RIO)</strong> ?<br>\n- China - <span class=\"user-mention\" data-user-id=\"192102\">@Jingdong(JD) Li</span> / <span class=\"user-mention\" data-user-id=\"192103\">@Lin Zhang</span> ?</p>\n<p>any advance on this list?</p>",
        "id": 153858713,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480358446
    },
    {
        "content": "<p>Canada yes</p>",
        "id": 153858714,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1480358540
    },
    {
        "content": "<p>No religion is asked in Russia (like John Lennon wanted ;)</p>",
        "id": 153858729,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1480360019
    },
    {
        "content": "<p>In Germany you're asked if you're admitted to a hospital that's being operated by a religious organization. Mostly, so they know whether to send the priest or the mullah for spiritual support, no immediate impact on treatment or diet :)<br>\nI'd be fine with keeping this an extension, though. Maybe even better a national extension, because I'd expect the ValueSets to be vastly different in every country. ( you know, like \"Jedi\" is only a religion in Australia :D )</p>",
        "id": 153858743,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1480367905
    },
    {
        "content": "<p>Now that I think of it... I think it's being asked  in conjunction with the queston of whether you require spiritual services. That doesn't sound like something that'd be captured with patient demographics... And might even be something that's independent from the patient's actual religion. Being admitted to a hospital may even make the atheist want to see a priest.</p>",
        "id": 153858745,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1480368219
    },
    {
        "content": "<p>yes, the value set varies, but that's no reason to not make it core (else we'd have hardly anything in core!)</p>",
        "id": 153858748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480368917
    },
    {
        "content": "<p>Private and community operated hospitals in Germany ask for religion as well, at least the majority of the ones I know.</p>",
        "id": 153858755,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1480369405
    },
    {
        "content": "<p>I'm not sure if Canada is “yes\". In Ontario, we don't store religion in the provincial Client Registry and I'm not even sure if it's allowed to be stored by privacy regulations. I think this should stay as an extension.</p>",
        "id": 153858764,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1480370513
    },
    {
        "content": "<p>France is not only \"no\": It's forbidden. <br>\nMore specifically, religion, ethnie, race are data items forbidden to ask and to record in any health record.</p>",
        "id": 153858869,
        "sender_full_name": "François Macary",
        "timestamp": 1480407995
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> , so does France have visiting priests etc in hospital? how do they know who to visit?</p>",
        "id": 153858876,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480411248
    },
    {
        "content": "<p>Not from the HIS.  Sure thing!<br>\nWe're not very keen of priests visits in hospitals or clinics, anyway. When there are, its very informal and not ICT driven.</p>",
        "id": 153858888,
        "sender_full_name": "François Macary",
        "timestamp": 1480412141
    },
    {
        "content": "<p>ok thanks. </p>",
        "id": 153858891,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480412418
    },
    {
        "content": "<p>The question has been post to some social groups  in our HIT community.</p>",
        "id": 153859075,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1480461538
    },
    {
        "content": "<p>Most responses: definitely not.</p>",
        "id": 153859076,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1480461538
    },
    {
        "content": "<p>k thanks</p>",
        "id": 153859078,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480463539
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> - you have enough information to create a task now</p>",
        "id": 153859079,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480463590
    },
    {
        "content": "<p>To make it a bit more complicated,<br>\nIn gemarny religion may be asked, but then you have to ask the patient if this may be recorded an communicated due to privacy issues at least in some states</p>",
        "id": 153859139,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1480493157
    },
    {
        "content": "<p>Thanks everyone for the feedback on this issue, and PA appreciates this and confirms that the property is not to be a core property, and we are hapily providing an extensibly bound standard extension for where people desire to share the information, it can be communicated appropriately.</p>",
        "id": 153859152,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1480494674
    },
    {
        "content": "<p>I mean, in China.</p>",
        "id": 153859166,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1480496862
    },
    {
        "content": "<p>There is no direct/explicit requirements for patient religion in the official guidelines about how to write patient records.</p>",
        "id": 153859167,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1480496862
    },
    {
        "content": "<p>It can be as an extension, just didn't seem right for it to be a US Realm specific thing.</p>",
        "id": 153859230,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1480507838
    },
    {
        "content": "<p>@Victor DetectedIssue doesn't seem appropriate given \"This resource is also not intended to be used in defining general prohibitions on actions such as \"No NSAIDs\", \"No solid oral dose forms\" or \"No MRIs - metalic tatoos\". These guidelines can be captured using the AllergyIntolerance, and/or Flag resources. Similarly this resource is not to be used to capture clinical facts that may imply contraindications such as pregnancy, breast feeding, patient preferences, past procedures, etc.\"</p>",
        "id": 153859239,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1480508750
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> right you are, DetectedIssue doesn't seem like the intended resource for this kind of information. Thanks for pointing that out. Given the case you gave where knowing the religion of a patient would trigger the clinician to ask some more detailed questions they otherwise wouldn't have asked, Flag itself would seem more appropriate. In combination with AllergyIntolerance and maybe Condition (and even Observation?) one should be able to cover the different  needs.</p>",
        "id": 153859248,
        "sender_full_name": "Viktor Jernelöv",
        "timestamp": 1480511775
    },
    {
        "content": "<p>it was pegged to be removed from US-Core back in September.  But needed a tracker.  It will be voted on Tuesday at US Realm and is already been preapplied.</p>",
        "id": 153860184,
        "sender_full_name": "Eric Haas",
        "timestamp": 1480841243
    }
]