[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span> and I were looking at Patient.link as a way to link a mother's Patient resource to a RelatedPerson resource for a mother to her child. This seems to be a valid use case based on the fact that Patient.link.other allows a reference to a RelatedPerson and the mother/newborn linking section 8.1.9 includes this in the example. But all of the descriptions of .link and all of the values in the Required value set for Patient.link.type only seem to deal with Patient-to-Patient linkages. Can someone confirm that .link is the right way to link a Patient and RelatedPerson resource when both resources are for the same individual (as opposed to using Person)? And if so, is seealso the right link type?</p>",
        "id": 200725362,
        "sender_full_name": "Craig Newman",
        "timestamp": 1591996487
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 200727800,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591998187
    },
    {
        "content": "<p>I put in a CR last year asking for this clarification -- <a href=\"https://jira.hl7.org/browse/FHIR-23009\">https://jira.hl7.org/browse/FHIR-23009</a></p>",
        "id": 200765095,
        "sender_full_name": "John Moehrke",
        "timestamp": 1592052978
    },
    {
        "content": "<p>Brian's response in the Jira ticket seems in line with what we need to do.</p>\n<p>The intent is that these are links to the SAME individual, including where the individual has mutliple patient resources, and multiple relatedperson resources.<br>\nFor example, Brian as a Patient can link to Brian as a RelatedPerson (patient = Ethan, Relationship = father).<br>\n(as demonstrated in the examples in the section of the spec <a href=\"http://hl7.org/fhir/patient.html#maternity\">http://hl7.org/fhir/patient.html#maternity</a>)<br>\nWe will propose the text to clarify this in the spec page, to ensure it's not miss-interpreted</p>",
        "id": 200893800,
        "sender_full_name": "Craig Newman",
        "timestamp": 1592230202
    },
    {
        "content": "<p>The only remaining question may be the right \"type\" to use. Is \"seealso\" appropriate?</p>",
        "id": 200893889,
        "sender_full_name": "Craig Newman",
        "timestamp": 1592230227
    }
]