[
    {
        "content": "<p>Hello! We are using Patient.Contact elements to store multiple contacts such as providers, insurance, personal, etc. However, the Contact object does provide a UniqueID for each Contact generated in the array object. This of course causes serious problems when doing CRUD operations. Is there a plan to either add an identifier of some kind for each Contact within Patient resource or consider separating Contacts into its own resource that can be referenced to Patient? I do not see any change in the structure between DSTU2 and STU3 thus we are getting very creative (aka development hack) in identifying a Contact within Patient when there is more than one. Insights appreciated! Thanks, Lauren</p>",
        "id": 153884802,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1492201932
    },
    {
        "content": "<p>It's not an issue for CRUD in FHIR because when you do a U, you're updating the entire patient record - so you're replacing one snapshot of all the patient's contacts with another.  You *can* put an id element on each one if you wanted to manipulate them using an operation or something.</p>",
        "id": 153884818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492236674
    },
    {
        "content": "<p>id *attribute* in XML. </p>",
        "id": 153884850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492291149
    },
    {
        "content": "<p>can you clarify what the problems are?</p>",
        "id": 153884851,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492291175
    },
    {
        "content": "<p>Good Morning! </p>\n<p>Our concern is the fact that you are doing an update to the entire Patient record for one of many contacts. Does this make sense given a Patient could have a large number of contacts and the Patient record is critical for all other resources as a reference? Is there any concern of data corruption, etc.? Granted, you could use RelatedPerson to handle contacts where each contact would be its own record, however, based on the description this appears to be more for family members not healthcare, insurance, or other non-family member contacts. Also, yes there is _history for the resource record so you can see the previous version. However, it may make more sense to take something that is changing at a different rate than true Patient demographic information to separate these concepts.</p>\n<p>Reminder: We are using a Mongo-based HAPI FHIR API to collect patient-generated health data from mobile applications. We are not connected to an EHR where the Patient records would be more likely managed by an administrator of the healthcare entity. Our mobile apps do not allow a patient to change their demographic information, however, we are allowing patients to enter their Contacts information which in turn touches their Patient record.</p>\n<p>Our other concern is the ability to identify uniquely and update a given contact within the array of contacts in the Patient resource. There is no unique identifier available for a contact. We are attempting to create a unique ID by concatenating fields however this is not 100% full proof either.</p>\n<p>It would be nice if Contacts was either its own resource with a reference back to the Patient resource or to make Contacts within the Patient resource more like Components in Observation where each component has a code to uniquely identify the entered value[x].</p>\n<p>Hopefully this additional detail helps.<br>\nThanks,<br>\nLauren</p>",
        "id": 153885266,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1492696290
    },
    {
        "content": "<p>I agree.. It seems RelatedPerson does overlap Patient.contact... and would, as you nicely point out, better support CRUD operations. I would like to see Patient.contact removed, favoring RelatedPerson.</p>",
        "id": 153885268,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492696612
    },
    {
        "content": "<p>RelatedPerson is intended for people who will \"do\" things - author data, perform services, attest to information.  In general, a patient isn't likely to have more than 10 or so contacts - people listed as \"next of kin\", \"emergency contact\", etc.  It's not to capture their family physician or pharmacy - that goes elsewhere.</p>",
        "id": 153885279,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492700508
    },
    {
        "content": "<p>Perhaps that is where Patch might be an option for you? ( <a href=\"http://hl7.org/fhir/http.html#patch\" target=\"_blank\" title=\"http://hl7.org/fhir/http.html#patch\">http://hl7.org/fhir/http.html#patch</a> )</p>",
        "id": 153885297,
        "sender_full_name": "David Hay",
        "timestamp": 1492710744
    },
    {
        "content": "<p>regarding generating ids for contacts - if it was it's own resource, you'd have to come up with a primary key for it anyway. So why would it be easier to give it an id if it was a resource of it's own not an entry in another resource?</p>",
        "id": 153885346,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492719540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> &amp; <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - Agree, RelatedPerson serves a different purpose but a resource like it for Contacts (business, insurance, or other personal) would be nice.</p>\n<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> - Thanks for the suggestion for Patch! I have shared this with our development team.</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - Sorry if I was unclear. We are suggesting a unique ID or additional codeable concept (in addition to relationship) for the contact within Patient.contact array. This would certainly help the CRUD operations to be more efficient rather than creating a key of concatenated fields to search for a given contact within the array. If the Contacts were its own resource, the ID would be handled per the structure of FHIR and ideally allow for a reference back to the Patient resource of course.</p>\n<p>Our use case may be a bit more robust than an EHR where a Contact (per cited definition) is for anyone that can be contacted about the patient. In our case, we are attempting to store healthcare contacts (physicians, nurses, dentists, etc.) and organizations/clinics (pharmacy, hospital, lab, nursing home, etc.), insurance company contact info, and other personal contacts (family, friend, co-worker, lawyer, etc.) of interest to the patient.</p>\n<p>Thanks again for the continued support as we continue to make the FHIR framework work with PGHD!</p>\n<p>~Lauren</p>",
        "id": 153885464,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1492777097
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193326\">@Lauren Wolejsza</span> when I look at the definition of Patient.contact vs the scope and usage on the RelatedPerson Resource; they seem identical. RelatedPerson includes the examples you speak of. It is true the RelatedPerson can be used in more ways, but that should be expected of a Resource vs an element.  In  what way do you see RelatedPerson described that restricts you?</p>",
        "id": 153885466,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492778617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> - Hi John! It may be that our approach is not the right one. When I think of a contact within the Patient resource, I think of someone who is the primary POC, next of kin, POA, or the individual(s) identified on a HIPAA form. Basically, the person who the doctor's office or hospital is going to call about a Patient's status. When I think of RelatedPerson resource, I think of anyone else beyond those in Patient.contact. Yes, the definitions for both do overlap hence some of the confusion.</p>\n<p>I guess then the question is how can these 2 similar elements/resources be better defined to be clearer for those of us attempting to utilize FHIR.</p>\n<p>Interested in your thoughts given our use case.</p>",
        "id": 153885475,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1492780873
    },
    {
        "content": "<p>My opinion... Patient.contact should be removed, thus it would be clear RelatedPerson would be the right solution. This would be easier to 'secure', and better support individual updates. As a privacy/security person, I prefer smaller --right sized-- resources. I don't have knowledge of arguments against this, except for the number of resources. That seems like a non-issue.  </p>",
        "id": 153885477,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492781168
    },
    {
        "content": "<p>RelatedPerson exists to be an actor - someone who can do things, the same as the Patient or any Practitioner.  Recording the phone number of a patient's mother or power of attourney is a very different thing.  I'm not a fan of squishing these two use-cases together - nor of imposing the complexity of requiring separate resources for someone who just wants to capture a patient's \"next of kin\"</p>",
        "id": 153885495,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492789001
    },
    {
        "content": "<p>why not? In the old days there was storage space and network bandwidth issues.. I don't think they apply anymore. The benefit of more finegrain resources is my rational for my preference.</p>",
        "id": 153885498,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492789406
    },
    {
        "content": "<p>Because sending one RESTful transaction is a whole lot easier than sending 20.  Next of Kin typically aren't independently identified objects - at least not in v2.  </p>",
        "id": 153885508,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492800697
    },
    {
        "content": "<p>But you have a unique id... the id on the contact itself</p>",
        "id": 153885523,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492806590
    },
    {
        "content": "<p>I don't know whether it's right for .contact to be in Patient or outside, but I do know that RelatedPerson and Patient.contact are not at all the same thing</p>",
        "id": 153885524,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492806650
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> The definitions and examples are the same thing between Patient.contact and RelatedPerson.... I don't see any distinction. It looks to me like it is just an architectural difference. What is your perceived difference that makes them \"not at all the same thing\"?</p>",
        "id": 153885635,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492961964
    },
    {
        "content": "<p>RelatedPerson is essentially a \"user\" - someone who can take responsibility for actions.  Patient.contact is just a bunch of names and phone numbers.</p>",
        "id": 153885645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492978749
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - Can you send me an example in JSON of a Patient.contact with a unique ID? I do not see any id elements associated with Patient.contact. The Patient ID is not unique to each contact. The only \"id\" so to speak would be the enumeration in the Patient.contact array and that is not truly full proof.</p>",
        "id": 153885736,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1493042682
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - Thank you for all the clarifications, however, the current specification definitions for these resources are not quite as distinct as you are describing. If the 2 places to store non-patient contact information, it would be helpful if these definitions were clearer. At this point, we are going to move forward using Patient.contact (DSTU2) and re-evaluate/recommend using RelatedPerson for future refactoring work (STU3) for this mobile application.</p>",
        "id": 153885738,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1493043149
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193326\">@Lauren Wolejsza</span> Your criticism is well-taken.  Would you be willing to submit a change request to get this clarified in the next release?  (Propose a change link at the bottom of each page in the spec.)</p>",
        "id": 153885749,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493045760
    },
    {
        "content": "<p>{ \"resourceType\" : \"Patient\",<br>\n  \"contact\" : {<br>\n    \"id\" : \"5228797b-b4a3-4723-aab2-b20e1cda6c8c\",<br>\n   \"name\" : {<br>\n     ....<br>\n    }<br>\n  }<br>\n}</p>",
        "id": 153885776,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1493059816
    },
    {
        "content": "<p>hello all, in our ipad app, in on of the screen we are storing the patients's contact persones. for that we are using RelatedPerson. in related person we have the patient's reference. so that we can get the patient from RelatedPerson. but what we want is get/ search  perticular patient's contact person. so how to get that please help.</p>\n<p>thank you.</p>",
        "id": 153885916,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493123398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - Thanks for the code example. This would be for the Patient resource and not for each individual contact in the array. This is where an contact id would be helpful.</p>",
        "id": 153885917,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1493124783
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - Certainly.</p>",
        "id": 153885918,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1493124823
    },
    {
        "content": "<p>the id is on the contact not the patient resource</p>",
        "id": 153886019,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1493154233
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - Where did this \"id\" element come from? It is not cited in the specification anywhere? Is this meant as an extension? In other words, it is not obvious that an ID is created/available for each contact within the Patient array. Sorry if I am missing something here.</p>",
        "id": 153886276,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1493294647
    },
    {
        "content": "<p>Read about Resource, it is the template at the top of all resources... <a href=\"http://hl7.org/fhir/STU3/resource.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/resource.html\">http://hl7.org/fhir/STU3/resource.html</a></p>",
        "id": 153886278,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493294837
    },
    {
        "content": "<p>Resources have an inheritance hierarchy - most resources inherit from DomainResource and all inherit from Resource.  These elements aren't shown to avoid clutter/redundancy.  However, in STU3, there's also an explicit line that lists them.  E.g. \"Elements defined in Ancestors: id, meta, implicitRules, language, text, contained, extension, modifierExtension\"</p>",
        "id": 153886281,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493298374
    },
    {
        "content": "<p><em>contact</em> does not inherit from <em>Resource</em>, <em>contact</em> is a <em>BackboneElement</em> and so gets <em>id</em> by inheritance from <em>Element</em>.<br>\nSame result, slightly different mechanism.</p>",
        "id": 153886361,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1493335498
    },
    {
        "content": "<p>Thanks for paying attention and actually answering the question asked <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> <span class=\"emoji emoji-263a\" title=\"smile\">:smile:</span></p>",
        "id": 153886362,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493335839
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for giving me the starting point to find it.</p>",
        "id": 153886363,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1493335942
    }
]