[
    {
        "content": "<p>We have an emerging requirement to be able to store a collection of patient preferences for a patient, regarding their treatment by a system. WHilst these are not overtly clinical, we do need to share them with others (via APIs) and as such we are looking towards FHIR,</p>\n<p>Has anyone else looked at this? We are currently discounting extensions of Patient, don't really want to use Observations (so as not get mixed up with the clinical ones) and as such are edging towards QuestionnaireResponse.</p>",
        "id": 178958074,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1571927592
    },
    {
        "content": "<p>can you describe some of these preferences?</p>",
        "id": 178961863,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571929688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> timely, since I spoke to Maria Moen about this today. Let's discuss here</p>\n<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> there's a CDA specification for this already. Have you looked at that for suitability?  When you say that you want to 'share them with others' do you mean, you want to share the documents, or you want to share the preferences? </p>\n<p>I'm interested in comments on this generally - I'm wondering whether we should leave this to the CDA spec, or whether this is something we should take on</p>",
        "id": 178977333,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571938852
    },
    {
        "content": "<p>I support FHIR encoding. just not clear to me what these preferences are...and many things discussed as preferences are today addressed by Consent resource. (One can have a privacy preference that is encoded in a Consent that has no organizational binding)</p>",
        "id": 178978354,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571939520
    },
    {
        "content": "<blockquote>\n<p>many things discussed as preferences are today addressed by Consent resource.</p>\n</blockquote>\n<p>But didn't you just agree to take this use case away from the Consent resource?</p>",
        "id": 178978792,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571939809
    },
    {
        "content": "<p>take what away? I have not heard what this set of preferences are?</p>",
        "id": 178979000,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571939939
    },
    {
        "content": "<p>if a preference is \"I prefer feather pillows\"... then, yes I think this is NOT appropriate in Consent.</p>",
        "id": 178979076,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571939993
    },
    {
        "content": "<p>if the preference is \"Catholic\", then yes i think it is not appropriate in Consent.</p>",
        "id": 178979191,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571940031
    },
    {
        "content": "<p>I think we are talking about this use case:</p>\n<blockquote>\n<p>Advance Care Directives: Consent to instructions for potentially needed medical treatment (e.g. DNR)</p>\n</blockquote>\n<p>Which was removed from Consent in R4</p>",
        "id": 178979207,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571940043
    },
    {
        "content": "<p>but I have not seen a definition from Richard on what preferences are</p>",
        "id": 178979216,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571940049
    },
    {
        "content": "<p>DNR has not been removed from Consent</p>",
        "id": 178979451,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571940202
    },
    {
        "content": "<p>really? because it sure looks like it to me looking at <a href=\"http://build.fhir.org/consent.html\" target=\"_blank\" title=\"http://build.fhir.org/consent.html\">http://build.fhir.org/consent.html</a></p>",
        "id": 178979709,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571940336
    },
    {
        "content": "<p>Privacy Consent Directive: Agreement to collect, access, use or disclose (share) information.<br>\nMedical Treatment Consent Directive: Consent to undergo a specific treatment (or record of refusal to consent).<br>\nResearch Consent Directive: Consent to participate in research protocol and information sharing required.</p>",
        "id": 178979788,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571940364
    },
    {
        "content": "<p>middle bullet</p>",
        "id": 178979805,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571940374
    },
    {
        "content": "<p>specifically \"refusal\"</p>",
        "id": 178979817,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571940380
    },
    {
        "content": "<p>well, ok</p>",
        "id": 178979890,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571940438
    },
    {
        "content": "<p>BUT.... the small team would LOVE for those that want to fill the gaps to attend their meeting and help... as the small team engaged today are very privacy focused, so therefore not experts in other things</p>",
        "id": 178980007,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571940518
    },
    {
        "content": "<p>and note... call is on right now for that</p>",
        "id": 178980032,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571940533
    },
    {
        "content": "<p>We did remove Advance Directives (DNR, HealthCare Proxy, etc.) from the Consent resource (for R5) but we can still have treatment preferences (no Medication of type X, etc.) So, if these are Advance Directives, that's in the world of CDA or potentially Contract as they go outside what Consent could actually represent.  I would need to see examples of <span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> means so that I can point him to the people best able to give him useful direction</p>",
        "id": 178986142,
        "sender_full_name": "David Pyke",
        "timestamp": 1571943999
    },
    {
        "content": "<p>We do have an 'intent' of 'directive' available on all of the Request resources.</p>",
        "id": 178987094,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571944664
    },
    {
        "content": "<blockquote>\n<p>We do have an 'intent' of 'directive' available on all of the Request resources.</p>\n</blockquote>\n<p>I don't think I understand that.</p>",
        "id": 178991695,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571947539
    },
    {
        "content": "<p>Is there a context for these preferences too? There are a few of these in the encounter.hospitalization backbone.<br>\nI'm also more in favour of obs than questionnaire, and when looking for prefs, typically you only want one, and update them individually.<br>\nAnd use a specific category to join them all together.</p>",
        "id": 178997737,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571951297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> You can express any MedicationRequest, ServiceRequest, DeviceRequest, CommunicationRequest, CarePlan, etc. as a patient directive</p>",
        "id": 179011728,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571963299
    },
    {
        "content": "<p>are there any examples of this in the spec? Are we sure everyone would notice a difference between a preference and an actual? I am still not quite understanding what one of these looks like and what it would be saying vs the normal kind of those resources.</p>",
        "id": 179043914,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572005867
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> can you please clarify what you mean by patient preferences, in light of all the guessing going on here?</p>",
        "id": 179043970,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572005918
    },
    {
        "content": "<p>Are these 'clinical' or 'legal' preferences or simpler things like what do you want (prefer) for lunch (assuming not on restricted diet) or do you prefer single or multi-patient room, or do you not want certain people (relatives?) visiting you, etc.?</p>",
        "id": 179046413,
        "sender_full_name": "John Silva",
        "timestamp": 1572008095
    },
    {
        "content": "<p>They're a stated preference.  How obliged (legally or otherwise) depends on context and the nature of the preference.  (The same is true of orders.)</p>",
        "id": 179047314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572008779
    },
    {
        "content": "<p>So is this 'obliged' status represented by some property with a valueSet ?</p>",
        "id": 179047861,
        "sender_full_name": "John Silva",
        "timestamp": 1572009227
    },
    {
        "content": "<p>Nope.  It's context driven - in both cases.  The level of obligation depends on who's asking and what they're asking for, not how strongly they might want it.</p>",
        "id": 179051452,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572011842
    },
    {
        "content": "<p>Apologies - I seem to have led you in the wrong direction. I'm not currently focused on preferences like DNR etc (or indeed any other form of advance directive). My requirements are more mundane, along the lines of \"Prefers appointment letters in the post\". I appreciate this maybe not a role for FHIR.</p>",
        "id": 179053784,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1572013410
    },
    {
        "content": "<p>Thankyou . I don't think this is off-topic.. but you can see how we all try to help...</p>",
        "id": 179056646,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572015334
    },
    {
        "content": "<p>If these preferences were able to be standardized, then yes we could handle them.</p>",
        "id": 179056677,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572015352
    },
    {
        "content": "<p>If they are more regional, or specific to an organization, then Questionnaire and QuestionnaireResponse is a good choice. In that case someone could design a form, and keep patient specific answers as needed</p>",
        "id": 179056797,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572015421
    },
    {
        "content": "<p>so, the question we need to understand better is if there is a body of people that want to define a set of preferences such as you define, and get to gether therir ideas with the expectation of coming up with a plan.</p>",
        "id": 179056911,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572015492
    },
    {
        "content": "<p>Other examples include \"prefers room with sea view\" or \"deliver NYT newspaper\" (yes, these are production use examples). In our FHIR training courses we use an extended Basic resource to capture such patient preferences.</p>",
        "id": 179409124,
        "sender_full_name": "René Spronk",
        "timestamp": 1572421796
    },
    {
        "content": "<p>so there is some things that are integrated into Patient, such as Patient.communication, Patient.gender, <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a>, there are some others that are extensions on Patient  <a href=\"http://build.fhir.org/patient-profiles.html\" target=\"_blank\" title=\"http://build.fhir.org/patient-profiles.html\">http://build.fhir.org/patient-profiles.html</a></p>",
        "id": 179436321,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572445198
    },
    {
        "content": "<p>should we keep extending Patient this way? Or should we think about a resource specific to preferences? The advantage of a preferences resources is that could be more easily managed by a Patient author, where the Patient resource would tend to not be something  the patient user would have rights to change; thus any preferences stored in Patient would need to go through an administrative path. Seems this is an opportunity to enable the patient to be empowered to set their own preferences</p>",
        "id": 179436596,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572445347
    },
    {
        "content": "<p>My thought is because these are so varied, that a patient freetext  note is likely the best way to track them.</p>",
        "id": 179448519,
        "sender_full_name": "David Pyke",
        "timestamp": 1572451701
    },
    {
        "content": "<p>My leaning is to handle preferences as Observations.  They're essentially a name-value pair and are time-bounded.  You can create the codes at whatever granularity you need to be able to search on.  You can use a category to grab all the preferences if you ever wanted to.</p>",
        "id": 179448584,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572451751
    },
    {
        "content": "<p>This topic needs to be considered as PC WG (<span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span> , <span class=\"user-mention\" data-user-id=\"192135\">@Stephen Chu</span> , <span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span> , <span class=\"user-mention\" data-user-id=\"191395\">@Dave Carlson</span> ) is working on this area of their Care Plan DAM 2.0.  They are addressing the topic of Advance Directives (@maria  moen), patient preference, and other nuanced concepts like obligations, prohibitions ( after preferences used in planning become actual decisions the patient or their health care agent has made to ask for or prohibit a certain specific service during a specific encounter).  We also cover the differences between patient wishes (advance Directives) which are authored by the patient (this includes a mixed bag of things from consents to assign a health care agent and designated alternates, to wishes concerning donation of organs and tissues, to wishes for things that might happen after death, to generalized wishes about the care experience a patient would want if being cared for and unable to communicate for his or her self) and Medical Orders for Life Sustaining Treatment (MOLST/POLST etc ) which are authored by a physician and signed by a patient or his/her health care agent.  </p>\n<p>I think it is very useful to explore the potential FHIR resources for use  as the Domain Analysis Modeling is happening.  It really helps in a DAM to clarify if the concepts being described are most closely related to Observation, Consent, ServiceRequest, or what ever.  It just ensures the DAM is more immediately actionable.  And, if the DAM authors can't figure out what FHIR Resource(s) would  be appropriate, then that identifies a gap we should start thinking about.  </p>\n<p>As patient-centered care and patient-directed exchange becomes more of a real thing, it needs to be clear (and generally agreed) how to represent  patient preferences.  And, the clarity needs to extend to a good range of things from advance directives to more mundane stuff like pharmacy of choice (Walgreen's Westerly on Franklin St), room preferences (private, I can pay for it),  place of care preferences (nursing home close to my kids so they can visit me more easily), food preferences (no apple sauce-I hate it) , pain medication preferences (no Percoset, it makes me sick) , and care experience preferences (if I'm just laying in a bed, a heavy blanket makes me feel more secure. I love classical music, but hate opera. Please use heavy blankets and play soothing classical music as often as possible.)</p>",
        "id": 189967975,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1583581612
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> - what are you doing to represent advanced directives in gravity with FHIR? FHIR Consent seems inadaquate (also see <a href=\"#narrow/stream/179166-implementers/topic/Question.20on.20.20advance.20directives.20as.20Consent\" title=\"#narrow/stream/179166-implementers/topic/Question.20on.20.20advance.20directives.20as.20Consent\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Question.20on.20.20advance.20directives.20as.20Consent</a>)</p>",
        "id": 190128578,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1583796100
    },
    {
        "content": "<p>added Preference to <a href=\"https://confluence.hl7.org/display/FHIR/Resource+Types\">https://confluence.hl7.org/display/FHIR/Resource+Types</a>. These could indeed be Observations, possibly with a Category or explicit membership in a List. One key distinction is that they may have varying levels of constraint: items from a living will may need more thorough attention than a playlist.</p>",
        "id": 207973192,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1598367250
    },
    {
        "content": "<p>It would be good to explore how most systems currently capture these - I suspect they do it using Observation unless you're getting into Consent/Contract stuff.</p>",
        "id": 207977270,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598368953
    }
]