[
    {
        "content": "<p>What's the best resource to make a communication from a Patient to a Provider using a patient portal? The communications can either be just a bit of text ('Feeling better today doc') or a request for a repeat medication. I had thought that MedicationRequest would be best for the latter - but there are some practical issues in implementing this, so looking for a more 'generic' resource.</p>\n<p>All these communications go into the providers inbox, so I'm wondering if a Task resource makes sense (after all, the provider is expected to do something with the communication - even if just to read it). Communication seems like a fit  - but it isn't supposed to represent the actual flow  - and is an 'event' rather than a 'request' in the workflow paradigm...</p>",
        "id": 244984999,
        "sender_full_name": "David Hay",
        "timestamp": 1625532779
    },
    {
        "content": "<p>Task is appropriate if there's a request involved (particularly if a response is desired).  If it's just sharing of information - the FHIR equivalent of an email, then Communication is appropriate.</p>",
        "id": 244985793,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625534012
    },
    {
        "content": "<p>(Not what it was designed for, but numerous implementations have landed on it for that purpose, so I guess there's an attraction to using FHIR for secure email - rather than actually using secure email for secure email... <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 244985842,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625534065
    },
    {
        "content": "<p>That's interesting - I interpreted the following line in the Communication scope &amp; boundary to mean that it wasn't supposed to be the actual 'message' itself. Given it's actual use by the community - perhaps that should be updated?</p>\n<blockquote>\n<p>It does not represent the actual flow of communication</p>\n</blockquote>",
        "id": 244992421,
        "sender_full_name": "David Hay",
        "timestamp": 1625542265
    },
    {
        "content": "<p>It can represent the flow of communication if \"in progress\".  I'm not sure we want to give a lot of encouragement in this space.  We definitely <em>don't</em> want it to start being used as a message wrapper.</p>",
        "id": 244995514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625547220
    }
]