[
    {
        "content": "<p>Has anyone implemented the concept of a patient's preferred pharmacy in FHIR? I imagine it would be an Organization resource, but I'm not sure of the best way to link it to a patient as a preference.</p>",
        "id": 153969187,
        "sender_full_name": "Benjamin Flessner",
        "timestamp": 1528925679
    },
    {
        "content": "<p>HealthcareService might be a better choice here as a single organisation can own many pharmacies.</p>",
        "id": 153969189,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1528925799
    },
    {
        "content": "<p>At one point PA had pointed to using Patient.generalPractitioner.  I believe the intentention is to do it through CarePlan.  While one organization might own multiple pharmacies, each pharmacy will itself be an Organization.  A single pharmacy would likely have multiple HealthcareServices - they might provide general dispensing, medication councilling, custom compounding, flu vaccination and possibly a few other things.  Each would be a separate HealthcareService instance.</p>",
        "id": 153969247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528931752
    },
    {
        "content": "<p>In NZ, many pharmacies are branches of the same organisation (legal entity) - these are regarded as Facilities (Locations in FHIR terms), often   under common ownership, that provide healthcare services - the most common of which is, of course, general dispensing.  It would be informative to see how this maps to use cases in other countries.</p>",
        "id": 153969309,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1528937354
    },
    {
        "content": "<p>Organization isn't limited to legal entities in FHIR.  They're \"groups of people with shared responsibility\".  The set of folks working in a pharmacy qualify, even if they're not a distinct legal entity.</p>",
        "id": 153969311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528937439
    },
    {
        "content": "<p>Understood - but that's how the NZ Health Provider Index is implemented. Organisation-&gt;Facility (Location)-&gt;HealthcareService-&gt;Provider.</p>",
        "id": 153969315,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1528937582
    },
    {
        "content": "<p>I think you're going to encounter some challenges with that.  Neither Locations nor HealthcareService can take on responsibility.  And we're not going to add those resources to properties that involve responsibility.</p>",
        "id": 153969342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528938785
    },
    {
        "content": "<p>There are always challenges in implementing Service Provider Directories. :) In terms of legal responsibilities - the link from Healthcare Service to Organisation should satisfy our requirements.</p>",
        "id": 153969422,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1528943606
    },
    {
        "content": "<p>We are planning on maintaining a record of the patient's preferred pharmacy as communicated to the enterprise via digital forms and/or directly via our enterprise mobile app. <br>\nWe maintain a separate Pharmacy DB (non-FHIR) of a national pharmacy directory. <br>\nAll we would need in our FHIR repository is a reference to the pharmacy's unique identifier in the context of the patient for systems to retrieve the complete pharmacy record from the Pharmacy Directory.<br>\nI am looking for some guidance as to a simple, efficient manner to model this need in our FHIR repository. Thank you!</p>",
        "id": 275659103,
        "sender_full_name": "Yuval Romm",
        "timestamp": 1647526635
    },
    {
        "content": "<p>I'm not fully understanding your scenario.  Are you asking how to 'wrap' the non FHIR system to have a FHIR interface?</p>",
        "id": 275672435,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647531466
    },
    {
        "content": "<p>Relevant: <a href=\"http://community.fhir.org/t/how-can-we-send-patient-preferred-pharmacy/2439\">http://community.fhir.org/t/how-can-we-send-patient-preferred-pharmacy/2439</a></p>",
        "id": 275673420,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647531799
    },
    {
        "content": "<p>Years ago the Netherlands used an extension (on Patient) to capture the 'preferred Pharmacy', akin to the GeneralPractitioner. [they have moved away from this approach since then]</p>",
        "id": 275692712,
        "sender_full_name": "René Spronk",
        "timestamp": 1647536381
    }
]