[
    {
        "content": "<p>A discussion came up today at the IHE Radiology meeting, and we were trying to figure out how to map a particular DICOM tag into FHIR.</p>\n<blockquote>\n<p>Confidentiality Constraint on Patient Data Description (0040,0031) \"Special indication to the modality operator about confidentiality of Patient information (e.g., that he should not use the Patient's name where other patients are present.\" </p>\n</blockquote>\n<p>The DICOM attribute is just plain text.</p>\n<p>I don't think that the patient-importance extension maps correctly, since this could cover more than VIP status. I don't think it lines up with Consent either. Is this an appropriate use of Flag? Encounter.specialCourtesy?</p>",
        "id": 154018291,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1542168292
    },
    {
        "content": "<p>sounds like a security label to me</p>",
        "id": 154018299,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542171098
    },
    {
        "content": "<p>Thanks, I was looking in the resources, and didn't think about labels.</p>",
        "id": 154018450,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1542207927
    },
    {
        "content": "<p>Yes, confidentiality would be a security-tag, thus use the meta.security element that is present in every FHIR Resource. Your vocabulary should leverage the HCS vocabulary, but this is extensible so any vocabulary will do based on local policies.</p>",
        "id": 154018487,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542211262
    },
    {
        "content": "<p>Note that ImagingStudy might possibly need to do like DocumentReference, in that these are meta resources. Their own meta.security is the tag for themselves, so they need to carry an element (metadata) for the security-tag of the object they are describing. In the case of DocumentReference this is done with DocumentReference.securityLabel which is describing the security-tags of the attached Binary. For ImagingStudy there might be a need to have a ImagingStudy.securityLabel to do similar for the DICOM object. This enables the metadata resource (ImagingStudy, DocumentReference) to have different security-tag (usually less restrictive) than the object they describe.</p>",
        "id": 154018491,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542211453
    },
    {
        "content": "<p>I'm not sure how far down this needs to go. The DICOM attribute is in the patient demographics module, and the description includes:</p>\n<blockquote>\n<p>Special indication to the modality operator about confidentiality of Patient information (e.g., that he should not use the Patient's name where other patients are present).</p>\n</blockquote>\n<p>The use case wasn't applying this element to an ImagingStudy. Instead we were considering how a modality would populate a DICOM instance if it was extracting information from a FHIR server, rather than from the typical DICOM modality worklist server. We weren't able to find where we would look to populate this element (or conversely, what expectations we should impose on the FHIR server if we expect a modality to be able to create instances from the information the FHIR server provides).</p>",
        "id": 154018511,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1542212461
    },
    {
        "content": "<p>okay, the Patient.meta.security should be sufficient</p>",
        "id": 154018536,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542214448
    }
]