[
    {
        "content": "<p>How does one support real-time location tracking for Patients ? One can track locations for encounters, but that's not really useful here as that would be the 'prereserved bed', not 100s of locations where the patient is know to be if they wander the corridors.</p>",
        "id": 154022494,
        "sender_full_name": "René Spronk",
        "timestamp": 1543846543
    },
    {
        "content": "<p>We'd been considering using Device for RTLS.  The Device would basically represent the RFID tag that is given to the patient.  We haven't really gotten into the details, and right now we'd need an extension on Device to represent the physical coordinates.  I'm interested in where this discussion goes.</p>",
        "id": 154023252,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1544039650
    },
    {
        "content": "<p>If the coordinates are reported by the device that would be a pair of observations</p>",
        "id": 154023256,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544039884
    },
    {
        "content": "<p>Extension on device would be static    Why not reference a location</p>",
        "id": 154023257,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544039940
    },
    {
        "content": "<p>Wasn't there some discussion about using geo-location data format/standards ?   Was there thought of having a FHIR GeoLocation data type?</p>",
        "id": 154023319,
        "sender_full_name": "John Silva",
        "timestamp": 1544047592
    },
    {
        "content": "<p>there is an extension: <br>\n<a href=\"http://build.fhir.org/extension-geolocation.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-geolocation.html\">http://build.fhir.org/extension-geolocation.html</a></p>\n<p>on Address</p>",
        "id": 154023326,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544048565
    },
    {
        "content": "<p>Location already allows for capturing lat/long coordinates as attributes of the Location.  But if those were rolled up into a datatype then Observation.value[x] could capture them.  It would also better lend to other uses as a datatype (calculations, geo-fencing, various other GIS-related operations, etc.)</p>",
        "id": 154023327,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1544048581
    },
    {
        "content": "<p>could use Obs as it is with a lat and lon components with value int.</p>",
        "id": 154023328,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544048791
    },
    {
        "content": "<p>This may not just be about lat/long, which would be the raw data, but it may have a translation for humans, i.e. the patients location is \"hallway 2 in building 7\", or \"17, main street\". That could be a Location resource, or mapped from the long/lat using some translation logic.<br>\nIt would be an Observation (done by the Device), not just a Device resource. We'd have to extend Observation with a valueReference (or: valueLocation) to reference a Location resource (which holds both the geolocation as well as human-interpretable descriptions of the geolocation, and an optional address).</p>",
        "id": 154023392,
        "sender_full_name": "René Spronk",
        "timestamp": 1544085571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 154024343,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544495199
    },
    {
        "content": "<p>Not something that I've had to try out, and the level of detail that is here feels more like an operation rather than a property or extension on a resource.<br>\nHowever the result of the operation could be a location resource, maybe.<br>\nAlso interested in if there are more than just where is this patient, but rather where are all the patients...</p>",
        "id": 154024359,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1544503585
    },
    {
        "content": "<p>And device does sound pretty right to me, the automated tracking of the patient would have to come from some form of device, which does have a location reference on it. So that could be either contained with the current values, or if it as a known registered location, reference that instance.</p>",
        "id": 154024360,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1544503681
    },
    {
        "content": "<p>In general this is about real time asset tracking. An operation sounds like a proper way of doing this if one has the use case \"where's X now?\" - but sometime you may wish to track where something has been in the past, much like a fitness tracker. Like a valueSampledData in an Observation.</p>",
        "id": 154024381,
        "sender_full_name": "René Spronk",
        "timestamp": 1544522061
    },
    {
        "content": "<p>Yes but you do not need a 'device' to provide geo-coordinates; e.g. a set of lat/long for locations within a hospital (hard-wired or in a DB).   Not sure if this has already been discussed before but you could imagine use cases where each Location (or Organization) has it's own geo-location (rectangular or otherwise); this is why it might be nice to have a reusable DataType.</p>",
        "id": 154024383,
        "sender_full_name": "John Silva",
        "timestamp": 1544525019
    },
    {
        "content": "<p>We have actually implementet Location tracking of patients (as a part of assisted living services) using the Location resource. The use case description includes the need for more accurate location data (velocity, accuracy etc.) as well as the need to send Location measurements from the device only when the device is outside a predefined geofence. I tink we got an implementation of this profile running somwhere in Trondheim, but I have not gotten around to getting any actual information about how it did work out for them.  </p>\n<p>The profile should be remade as well because I added the altiture to an extension for some reason, I think it was the vendor that preferred information about the metric used as part of the element name, not so smart in hindsight however. I guess we could use the Observation for this, but it seemed that the Location resource was a better fit and should cover this use case \"A Location is valid without an address in cases where it could be purely described by a geo-coded location in remote areas, or when recorded by a device.\"</p>",
        "id": 159591402,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1551346255
    },
    {
        "content": "<p>what are folks doing with this?</p>\n<ul>\n<li>Observation + extension valueLocation?</li>\n<li>Observation + components?</li>\n<li>Other?</li>\n</ul>",
        "id": 167431114,
        "sender_full_name": "Eric Haas",
        "timestamp": 1559769440
    }
]