[
    {
        "content": "<p>Does anyone know why the datatype for Patient.birthDate is 'just' a date, whereas Patient.deceased may be a dateTime? This question just came up during my training course.</p>",
        "id": 153852285,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1475843630
    },
    {
        "content": "<p>I should know as I'm from PA, but I don't know for sure. Here's my best answer:</p>\n<p>The full DOB is relevant in the perinatal phase and is then recorded as part of your perinatal observations/background. Immediate thereafter the time is irrelevant and the only thing you need in the rest of your life is the date. This is a defining property of \"you\".</p>\n<p>Deceased time is probably captured during a comparable process to the perinatal phase, but the difference here is that there is no \"after period\" or \"rest of your life\". So I guess that once entered it remains that way.</p>\n<p>That being said, it would not have harmed anyone if birthDate would have been a dateTime since date is a valid subtype of dateTime.</p>",
        "id": 153852286,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1475844026
    },
    {
        "content": "<p>Thanks Alexander, both for the answer, as for a nice demonstration of how this forum works. </p>",
        "id": 153852287,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1475844757
    },
    {
        "content": "<p>Note: birth date *use* to be a dateTime. But it was moved to just the date since you don't need (nor do most people know) the time. There is now an extension for those edge cases that do need the birth time (eg: NICU for first few days)</p>",
        "id": 153852297,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475851619
    },
    {
        "content": "<p>I'm not sure if they talked about the deceased at the same time or not, but I would have assumed the same use cases apply and maybe it was just missed?</p>",
        "id": 153852298,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475851653
    },
    {
        "content": "<p>Should be a gforge we can find... </p>",
        "id": 153852299,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475851661
    },
    {
        "content": "<p>Tada: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=3731\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=3731\">GF#3731</a></p>",
        "id": 153852300,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475851803
    },
    {
        "content": "<p>For those that want to record the birth time there is an extension. <a href=\"http://hl7-fhir.github.io/extension-patient-birthtime.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-patient-birthtime.html\">http://hl7-fhir.github.io/extension-patient-birthtime.html</a></p>",
        "id": 153852301,
        "sender_full_name": "John Moehrke",
        "timestamp": 1475851834
    },
    {
        "content": "<p>We use that extension in QI-Core, and a question that has come up is why is it modeled as a dateTime? Shouldn't it be a time if all we are capturing is the time?</p>",
        "id": 153852309,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475861605
    },
    {
        "content": "<p>You need the time zone, I don't know if there is such a thing as a time without a zone. And that would require you to put together the birth date and that extension to calculate age</p>",
        "id": 153852310,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475861830
    },
    {
        "content": "<p>time zones only really make sense in context of a full date and time</p>",
        "id": 153852311,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1475861851
    },
    {
        "content": "<p>I see, yes, that makes sense, because a date can't have a timezone and neither can a time, so to capture timezone, it has to be dateTime.</p>",
        "id": 153852315,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475862294
    },
    {
        "content": "<p>I actually think times should have a timezone, but that's a different issue.</p>",
        "id": 153852316,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475862306
    },
    {
        "content": "<p>Yes, the timezone issue on times is the issue. Dates can not have a timezone (in the FHIR context) and as such don't confuse things.<br>\nThe reason this is so important with the birth date is that it is used for identification purposes (which death date isnt) so it is critical that timezones don't interfere with the value, no matter where they were recorded.</p>",
        "id": 153852418,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476055736
    },
    {
        "content": "<p>There was lively debate around time on birthdate. The only reason there is a birthtime extension is because there is no time on birthdate.<br>\nIt would have been completely workable to have used a datetime and then have the convention that the birthdate is the date independant of the timezone - just like we actual do today.</p>",
        "id": 153853153,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476863288
    },
    {
        "content": "<p>Just following up on this topic of why is the patient birth date a date only field, I've written a post on what lead to the current design.<br>\n<a href=\"https://brianpos.wordpress.com/2016/10/19/patient-birth-date-no-time/\" target=\"_blank\" title=\"https://brianpos.wordpress.com/2016/10/19/patient-birth-date-no-time/\">https://brianpos.wordpress.com/2016/10/19/patient-birth-date-no-time/</a></p>",
        "id": 153853296,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476927910
    }
]