[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span> see <a href=\"http://build.fhir.org/request-analysis.html\" target=\"_blank\" title=\"http://build.fhir.org/request-analysis.html\">http://build.fhir.org/request-analysis.html</a> - the task list is driven from the file \\source\\[name]\\[name]-tasks.ini, where [name] is the pattern name e.g. request. </p>\n<p>The Ini file has a series of entries </p>\n<p><code>[pattern.path]\nResource=tasks</code></p>\n<p>where </p>\n<ul>\n<li>pattern.path is something like Event.subject - the element in the pattern that the issue is about</li>\n<li>Resource is the name of the resource on which the issue is being raised - e.g. there is no mapping for pattern.path, and there should be</li>\n<li>Tasks is a semi-colon delimited list (no spaces)</li>\n</ul>",
        "id": 165486522,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557703723
    },
    {
        "content": "<p>This looks great. I will review with the group on Tuesday and provide feedback.</p>",
        "id": 165498286,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557723533
    },
    {
        "content": "<p>more, for people's review:<br>\n- I added  a new page: <a href=\"http://build.fhir.org/patterns.html\" target=\"_blank\" title=\"http://build.fhir.org/patterns.html\">http://build.fhir.org/patterns.html</a><br>\n- I added a new set of patterns that are much more tight and suitable for code generation<br>\n- I use the pattern as a reference target: Communication.recipient</p>\n<p>I still have some issues to sort out.</p>",
        "id": 165560367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557775237
    },
    {
        "content": "<p>A couple of questions:<br>\n1) do workgroups have the ability to create patterns as they see fit or is it similar governance to resources?<br>\n2) will we be able to create patterns in Implementation Guides?<br>\n3) can WGs start changing their resources to use the patterns now, i.e. I'm assuming the build tools now support the patterns?</p>",
        "id": 165561017,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557775792
    },
    {
        "content": "<p>1. It should definitely be a lower bar than resources, but it's also a team activity. So I propose that new patterns should be created via MnM<br>\n2. Yes, you already can, but they won't quite have the same implication<br>\n3. yes as far as I can see, the support is complete.</p>",
        "id": 165561328,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557776040
    },
    {
        "content": "<p>by #2, I guess I was asking if I can create a pattern and use it in my resources.  Will the igpublisher support that?</p>",
        "id": 165561413,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557776085
    },
    {
        "content": "<p>at the moment, if you use a pattern:<br>\n- the table and uml view show the pattern<br>\n- the detailed description shows the pattern and expands it <br>\n- everything else expands the pattern</p>",
        "id": 165561435,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557776092
    },
    {
        "content": "<p>#2 - no, not at that level. and harder for me. I'll put it on the wishlist</p>",
        "id": 165561480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557776117
    },
    {
        "content": "<blockquote>\n<p>at the moment, if you use a pattern:<br>\n- the table and uml view show the pattern<br>\n- the detailed description shows the pattern and expands it <br>\n- everything else expands the pattern</p>\n</blockquote>\n<p>that looks good.  basically the pattern is used at definition time, but is invisible to the actual definitions and other tools.  nice.  thank you for your work on that!</p>",
        "id": 165561706,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557776296
    },
    {
        "content": "<p>now we just need to start abstracting out the proper patterns and get resources to use them.</p>",
        "id": 165561725,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557776315
    },
    {
        "content": "<p>there's plenty of work to do there. I'm going to write an analysis looking for reference continuity into the patterns page</p>",
        "id": 165561782,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557776364
    },
    {
        "content": "<p>I'm not overly thrilled with this.  Participant-Contactable and Participant-Living should never be used without also having PractitionerRole as an option.  I'm very concerned that designers will somehow feel that these patterns trump applying the 80% rule - and they don't.  I also think that 'hiding' the list of available resources behind pattern names does a disservice to readers.  It adds a level of indirection to understanding what's going on.</p>",
        "id": 165562595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557776950
    },
    {
        "content": "<p>I understand that these might be the patterns that happen to be easy to create interfaces on, but we should be driven by the combinations of resources that are actually commonly supported.</p>",
        "id": 165562632,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557776991
    },
    {
        "content": "<p>indirection is kind of useful too.</p>",
        "id": 165562736,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557777031
    },
    {
        "content": "<p>Also, I'm not terribly clear on who we're creating programmatic interfaces for or what they need.</p>",
        "id": 165562747,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557777047
    },
    {
        "content": "<blockquote>\n<p>Participant-Contactable and Participant-Living should never be used without also having PractitionerRole as an option.</p>\n</blockquote>\n<p>Get rid of the stupid distinction between Practitioner and PractitionerRole.  I've already created a GForge tracker item on this because I see this over and over again (\"Practitioner should never be an option without having PractitionerRole as an option\").</p>",
        "id": 165562758,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557777057
    },
    {
        "content": "<p>but actually this has nothing to do with 80% or any %. The question is: does the pattern override the need for analysis specific to the context</p>",
        "id": 165562786,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557777084
    },
    {
        "content": "<p>Indirection is only useful if it's aligned with how people think of the data - and I'm not sure that these are.  The names are artifacts of what was easy to create interfaces on.</p>",
        "id": 165562805,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557777107
    },
    {
        "content": "<p>The pattern can't override the need for context-specific analysis.  That needs to reflect what most systems do.  If not, we're throwing away a core tenet of FHIR (for questionable benefit).</p>",
        "id": 165562921,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557777176
    },
    {
        "content": "<p>There's a degree of truth to that. There's 2 reasons to create patterns - so we can use them in design, or so that they can be used in implementations</p>",
        "id": 165562959,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557777216
    },
    {
        "content": "<p>if the pattern is useful in design time, the indirection is useful.</p>",
        "id": 165563231,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557777425
    },
    {
        "content": "<blockquote>\n<p>I also think that 'hiding' the list of available resources behind pattern names does a disservice to readers.  It adds a level of indirection to understanding what's going on.</p>\n</blockquote>\n<p>Contrary to this, I feel that the 'hiding' does a better job of further communicating the purpose of a field.  Looking at Communication.receiver vs Communication.sender,  I can see that a receiver is intended to be a Participant, but sender is different.  If sender was converted to Reference(Participant | HealthcareDevice), I suddenly get a better view who/what might be sending Communications.</p>\n<p>Committees will be able to look at these common interface patterns and assume that they have been vetted by many committees and users and can start with the classes in those patterns.  If they decide that the pattern classes fit their use cases, then the can reference the pattern directly.  If not, they can be explicit.  Implementers/spec-readers will know, however, that the committee made a conscious choice to deviate from the pattern as opposed to now where we wonder how explicit a committee was being.  When I looked at the list of class combos that Grahame spit out, there were some that just caused me to go \"huh?\".  I suspect that many of those slight differences will go away now that committees can see (and potentially adopt) the common interface pattern.</p>",
        "id": 165563611,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557777693
    },
    {
        "content": "<p>The vetting by other work groups doesn't matter when a WG is evaluating their own use.  Just because Patient or Device is allowed as a participation in some places doesn't mean it will meet the 80% criteria for your domain.  We want differences to go away that are there unnecessarily.  We <em>don't</em> want differences to go away that are caused by legitimate domain differences.  Providing an 'easy' reference makes it much more likely that the appropriate analysis won't happen.</p>",
        "id": 165564090,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557778022
    },
    {
        "content": "<blockquote>\n<p>The vetting by other work groups doesn't matter when a WG is evaluating their own use.  Just because Patient or Device is allowed as a participation in some places doesn't mean it will meet the 80% criteria for your domain.  We want differences to go away that are there unnecessarily.  We <em>don't</em> want differences to go away that are caused by legitimate domain differences.  Providing an 'easy' reference makes it much more likely that the appropriate analysis won't happen.</p>\n</blockquote>\n<p>Except that implementers will push back if the appropriate analysis hasn't happen.  \"Why is Device included in the list of X for this data element?\" will always be a question that gets asked of a workgroup and a resource.  And the workgroup will need to justify the use of these resources.</p>",
        "id": 165564208,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557778107
    },
    {
        "content": "<p>I agree that splitting Practitioner and PractitionerRole is problematic, but I think there's little chance of that being reversed at this stage.  And if it's not, its absence from these patterns is going to cause huge problems.  The issue is that \"what's easy to interface\" and \"what's useful to combine\" are different criteria.</p>",
        "id": 165564219,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557778118
    },
    {
        "content": "<p>Implementers aren't doing a great job of pushing back now.  And in general implementers don't push back because there's too much stuff, just when there's too little.  The methodology is supposed to push back against \"too much\" - and the patterns approach is going to create problems with that.</p>",
        "id": 165564259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557778169
    },
    {
        "content": "<blockquote>\n<p>Implementers aren't doing a great job of pushing back now.  And in general implementers don't push back because there's too much stuff, just when there's too little.  The methodology is supposed to push back against \"too much\" - and the patterns approach is going to create problems with that.</p>\n</blockquote>\n<p>I don't understand your concern as specific to these interface patterns.  When I'm looking for a participant, I go and look at existing resources to see what they have and I start from that.  I then add or delete or leave as specified according to my needs.  How is that going to be any different with these patterns?  They provide a wonderful starting point.</p>",
        "id": 165564674,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557778549
    },
    {
        "content": "<blockquote>\n<p>Indirection is only useful if it's aligned with how people think of the data - and I'm not sure that these are.  The names are artifacts of what was easy to create interfaces on.</p>\n</blockquote>\n<p>What Grahame has introduced is basically just syntactic sugar (<a href=\"https://en.wikipedia.org/wiki/Syntactic_sugar\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Syntactic_sugar\">https://en.wikipedia.org/wiki/Syntactic_sugar</a>)</p>",
        "id": 165564793,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557778616
    },
    {
        "content": "<p>The pattern is useless as a starting point if you diverge from the starting point because you then need to replace the pattern with a full enumerated list.  And you'll also have people ragging on you about why you didn't use the pattern.</p>\n<p>The syntactic sugar is driven by \"which classes have resources elements\" as opposed to \"which resources are commonly used together\" - and those are completely different lists.  The latter might be useful.  The first isn't useful for design - and is likely to lead to poor design choices.</p>",
        "id": 165565320,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557779018
    },
    {
        "content": "<blockquote>\n<p>The pattern is useless as a starting point if you diverge from the starting point because you then need to replace the pattern with a full enumerated list.  And you'll also have people ragging on you about why you didn't use the pattern.</p>\n</blockquote>\n<p>a) Just because I need to diverge doesn't make the pattern useless.  That argument would apply equally to the Request and Event pattern - why do we have MedicationRequest since I could just use the Request pattern.  Because the WG took the pattern and analyzed it and diverged where they felt the need to.  This would work the same with these interface patterns <em>except</em> that if I didn't diverge, I can just use the syntactic sugar to represent the list of classes.</p>\n<p>b) If a committee can't elaborate on why they didn't use the pattern, then that might be a reason why they should have used it.  \"Your data element looks like a participant, but you only have Patient and RelatedPerson, are you sure that the other resources in the Participant pattern aren't appropriate?\" looks like a totally justified question that I better have an answer to.</p>",
        "id": 165565697,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557779246
    },
    {
        "content": "<blockquote>\n<p>The syntactic sugar is driven by \"which classes have resources elements\" as opposed to \"which resources are commonly used together\" - and those are completely different lists.  The latter might be useful.  The first isn't useful for design - and is likely to lead to poor design choices.</p>\n</blockquote>\n<p>This objection would be to the current content of the patterns and not to the use of the patterns per se.  I am actually with you on the content, but Grahame just started with a common set of resources.  We need to push back on the patterns to see if they are correct.</p>",
        "id": 165565891,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557779371
    },
    {
        "content": "<p>Moving away from the discussion of the patterns that Grahame created, I'd like to explore the use of these interface patterns as a way for a resource creator to delay defining the specific set of resources that would be referenced by a data element.  I'm thinking of CatalogEntry and ChargeItemDefinition.</p>\n<p>Would it make sense to have metadata around a pattern as to whether it was open or closed?  By open, I mean a pattern that a content creator could to add by simply tagging their resource.  By closed, to get a new resource added would require a tracker item.</p>\n<p>As an example, ChargeItemDefinition.instance would be Reference(ChargeableItem) and ChargeableItem would be an open interface.  Then the resources that would be considered to be ChargeableItems would add some tag in their definition to be included in the list.</p>",
        "id": 165566300,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557779638
    },
    {
        "content": "<p>The patterns Grahame has defined are <em>not</em> patterns that reflect what WGs have typically done.  They are patterns that reflect what resources have common elements that make them amenable to the construction of interfaces.  I.e. they were designed on the basis of what might be useful to generate code for, <em>not</em> what constitutes good or appropriate design practice.  But the proposal is to push them into design practice.  I think that's a mistake.</p>\n<p>If in implementation, someone wants to process Patients and Practitioners and RelatedPersons with the same set of code, that's a totally appropriate use for these patterns.  But the fact that the resources reflect a particular common set of elements doesn't really have much relevance to appropriateness for use in a given model.  And it's not that helpful for a reader either.  Someone skimming a resource is going to see \"Participant\" and that's not going to tell them anything - it's certainly not going to break any pre-conceived mental presumptions they have about what participant might or might not include, nor is it going to encourage them to think about which of the set of allowed resources they're going to want to constrain out - or mandate support for.</p>",
        "id": 165567356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557780319
    },
    {
        "content": "<p>\"Implementers aren't doing a great job of pushing back...\"  -- from my perspective it seems that push-back is sometimes futile since the resources have already got too much momentum to change at this point; your example of Practitioner and PractitionerRole being a prime example.   Also for folks who are implementers not modelers, there are real-world concerns of 'getting the job done' that have higher priority.   I remember asking the question about why MedicationRequest.category and MedicationAdministration.category have different cardinalities and ended up down a long discussion path that wasn't that fruitful from my perspective as a developer.   It seemed to me that the cardinality difference was an error of omission, not a conscious decision of the committee but it took weeks to get to that understanding.   Yes, we probably need more input from implementers but it is not 'inexpensive' for implementers to get involved and if their efforts aren't seen as productive, they will 'shy away' from participating.</p>",
        "id": 165567359,
        "sender_full_name": "John Silva",
        "timestamp": 1557780321
    },
    {
        "content": "<p>1. I think introducing patterns into the design process as something that can be explicitly referenced by designers is a mistake:<br>\n- it hides what resources are actually available from both the authors and the readers<br>\n- it adds complexity to profiling constraints (and those are complex enough, thanks)<br>\n- it encourages adherence to patterns over adherence to the 80% rule and the latter is more important than the former<br>\n2. If we were going to introduce patterns into the design process, the patterns should be based on whats commonly implemented together, not what happens to have common attributes.  The latter has no place in the design process at all.  If such patterns are going to be used, they belong only in the implementation space.  (Which also means that it would be fine to add Person into the Living Participant pattern, because you'd only care about the attributes, not where they're used.)<br>\nNote: I'm in favor of encouraging greater consistency - and specifically on eliminating as much as possible those errors of omission that create grief.  But I'm not in favor of making the modeling neater at the price of no longer reflecting the reality of what systems do.  Our objective with the FHIR core spec is <em>not</em> to change what data systems capture and false consistency of resource designs when underlying implementations don't reflect that doesn't help anyone.</p>",
        "id": 165568202,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557780895
    },
    {
        "content": "<p>I completely agree with John Silva. I think it sums up exactly the kinds of problems we are facing as well. Some of the resource divergences from patterns seem fairly arbitrary but come at a cost for implementers. While these do get fixed, it requires tremendous effort and time commitment. In the meantime, we address these inconsistencies in code but now the problem has been pushed to all implementers of FHIR. I would favor two views of FHIR, the resource view and a more consistent (and stable) view based on patterns where all participations, for instance, are addressed in a consistent way.</p>",
        "id": 165568613,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557781201
    },
    {
        "content": "<p>the problem is that there is no consistency in participations in the real world. The risk, then, is that we impose a fantasy consistency that isn't real. And it does seem pretty likely to me...</p>",
        "id": 165568776,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557781306
    },
    {
        "content": "<p>we do not have, at this time, a list of which elements represent 'participations' and I think it's only a meaningful thing to say in a derived ontological view of the world (the RIM). Eventually the discussion will morph into 100s of little issues, or a single large discussion about the importance of not being a heretic. That's what Lloyd's afraid of</p>",
        "id": 165569100,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557781537
    },
    {
        "content": "<p>but the community participation issues <span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> raises are real too</p>",
        "id": 165569141,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557781564
    },
    {
        "content": "<p>let's just have the 100s of little discussions</p>",
        "id": 165569195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557781587
    },
    {
        "content": "<p>If you look at performer for instance, there is great variation across resources - naming of attributes, types allowed for choices, attributes that make up the participation in the first place. Yet, they all look roughly the same - give or take a few attributes such as period or required. If the resource wishes to name these things differently, okay. The pattern, on the other hand can be consistent. Often, even the variation in choice types seems odd (sometimes CareTeam is in, sometimes it is out, etc...). I think that there is a lot that could still be done to make the resources more consistent and the patterns useful while still meeting the other requirements of FHIR.</p>",
        "id": 165569239,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557781629
    },
    {
        "content": "<p>ok. analysis for performer:<br>\n<a href=\"/user_uploads/10155/k6LkhfJ5w8GgcLTiEny5E6eY/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/k6LkhfJ5w8GgcLTiEny5E6eY/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/k6LkhfJ5w8GgcLTiEny5E6eY/pasted_image.png\"></a></div>",
        "id": 165570277,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557782463
    },
    {
        "content": "<p>first question:  -  how can a substance or a location be the target of \"Indicates who or what is being asked to perform (or not perform) the ction\" ? (<span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>)</p>",
        "id": 165570440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557782566
    },
    {
        "content": "<p>reposting simpler diagram without crazy outliers:</p>",
        "id": 165570462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557782584
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/u9LJbyV6-SlGEq-NIcyxG4RA/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/u9LJbyV6-SlGEq-NIcyxG4RA/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/u9LJbyV6-SlGEq-NIcyxG4RA/pasted_image.png\"></a></div>",
        "id": 165570485,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557782609
    },
    {
        "content": "<ul>\n<li>a healthcareService should be able to perform a contract, or be linked to a ChargeItem </li>\n<li>same for an ImagingStudy, Observation, DiagnosticReport and MedicationRequest performer - if a care team and and organization can perform it, why not a healthcare service?</li>\n</ul>\n<p>presumably those relate to a process problem</p>",
        "id": 165571137,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557783058
    },
    {
        "content": "<ul>\n<li>Observation and DiagnosticReport don't allow for a Device to perform them. I presume that's a domain based decision - but it's one I think I'd challenge on domain based reasoning.  (actually Observation pulls device off on it's own, but it's effectively a performer)</li>\n</ul>",
        "id": 165571494,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557783335
    },
    {
        "content": "<ul>\n<li>I don't know what grounds there is for allowing an organization to dispense or do a procedure, but not a careteam or  a healthservice</li>\n</ul>",
        "id": 165571574,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557783379
    },
    {
        "content": "<ul>\n<li>MedicationAdministration and RiskAsessement are limited to trace to an individual not a collective source - a domain decision - but why not allow patients or their carers to make RiskAssessments? (and  clinical impressions?)</li>\n</ul>",
        "id": 165571644,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557783464
    },
    {
        "content": "<ul>\n<li>I don't know why care teams and healthcare services can't agree to consents</li>\n</ul>",
        "id": 165571734,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557783533
    },
    {
        "content": "<p>Seems to me that there's 2 orthogonal patterns:</p>\n<ul>\n<li>Collective / Individual</li>\n<li>+/- device</li>\n</ul>",
        "id": 165571919,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557783697
    },
    {
        "content": "<p>HealthCareService (and CareTeam) have both evolved, which is part of the challenge.  The former used to talk about \"a capacity\", but is now being used as a sub-organizational unit.  CareTeam is similar, though it's been around for longer so has propagated further.</p>\n<p>CareTeam or HealthService doing dispenses doesn't really make sense.  I can't imagine a use-case where that would ever be tracked at that granularity in practice.  Same is true for RiskAssessments.  A Patient or care-giver might complete the questionnaire that serves as input to the assessment.  However the determination that you have a 23.7% chance of getting diabetes by age 50 is going to be made by a Device or a Practitioner, never by the patient or caregiver themselves.</p>",
        "id": 165572336,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557784059
    },
    {
        "content": "<blockquote>\n<p>Seems to me that there's 2 orthogonal patterns:</p>\n<ul>\n<li>Collective / Individual</li>\n<li>+/- device</li>\n</ul>\n</blockquote>\n<p>So perhaps just two defined patterns that don't include Device and WGs can add Device if necessary?</p>\n<p>Performer (for the Collective)<br>\nIndividualPerformer (for the non-collective)</p>",
        "id": 165572352,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557784080
    },
    {
        "content": "<p>Consents need to be agreed to be a legal entity.  In general, CareTeams and healthcare services aren't.   They're \"convenience\" organizations that can be used to attribute responsibility.</p>",
        "id": 165572410,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557784108
    },
    {
        "content": "<p>Interesting, when trying to make sense of FHIR participations and choices, I came up with this. Device, as Jean points out is a different dimension potentially: <a href=\"/user_uploads/10155/zdRESEe4YOPj1II_PXFQI3ra/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a>John</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/zdRESEe4YOPj1II_PXFQI3ra/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/zdRESEe4YOPj1II_PXFQI3ra/pasted_image.png\"></a></div>",
        "id": 165572463,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557784200
    },
    {
        "content": "<p>You still need to prune out the ones that don't make sense/would never be supported in a particular use-case.  For example, Patients/RelatedPersons aren't allowed to be the \"performers\" of an immunization.  That's a domain choice reflecting practice.  We're not going to tell Public Health they need to use the pattern just because it makes for neater modeling.</p>",
        "id": 165572523,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557784237
    },
    {
        "content": "<blockquote>\n<p>You still need to prune out the ones that don't make sense/would never be supported in a particular use-case.  For example, Patients/RelatedPersons aren't allowed to be the \"performers\" of an immunization.  That's a domain choice reflecting practice.  We're not going to tell Public Health they need to use the pattern just because it makes for neater modeling.</p>\n</blockquote>\n<p>That's a straw-man argument - why do you think we'd be telling Public Health to use the pattern?  Obviously they wouldn't use it because it doesn't make sense for their use case.</p>",
        "id": 165572560,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557784295
    },
    {
        "content": "<p>I don't know why, or understand why, a location is a choice for performer, I ask others.</p>",
        "id": 165572828,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1557784520
    },
    {
        "content": "<p>My gut is that 1/2 to 2/3 of the places we'd look at using these patterns, at least one of the resources in the patterns would need to be yanked out or one or two would need to be added.  Based on past experience with patterns, I'd also expect that many WGs would feel constrained to use the pattern and wouldn't do the necessary yanking/addition. </p>\n<p>Let me ask a different question.  If I determine what I need is Patient, Practitioner, PractitionerRole, Organization and Device, how does that impact the utility of the interface pattern from a development perspective?  Is it going to have problems because Practitioner and Device are in the mix?  In either event, does it matter whether the pattern is declared on the design side?</p>",
        "id": 165573280,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557784939
    },
    {
        "content": "<blockquote>\n<p>However the determination that you have a 23.7% chance of getting diabetes by age 50 is going to be made by a Device or a Practitioner, never by the patient or caregiver themselves.</p>\n</blockquote>\n<p>Actually, it's made by an algorithm. I don't agree with this for domain reasons. why can't a patient adminster the algorithm? (see openAPS...)</p>",
        "id": 165574202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557785788
    },
    {
        "content": "<p>I agree with Grahame. Are we too focused on the inpatient use case?</p>",
        "id": 165574245,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557785846
    },
    {
        "content": "<blockquote>\n<p>CareTeam or HealthService doing dispenses doesn't really make sense</p>\n</blockquote>\n<p>but organizations do? I'm not seeing the differentiation here</p>",
        "id": 165574258,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557785871
    },
    {
        "content": "<p>I think it is okay if the pattern is more general than the individual resource. In some cases, some options won't be relevant or used much - as long as they are not semantically wrong - e.g., a related person will generally not administer a vaccine but they could if they were trained to do so and needed to reach an isolated population.</p>",
        "id": 165574501,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557786068
    },
    {
        "content": "<p>They key is that the pattern is not more narrow than the collection of resources represented by the pattern such that a resource loosens the constraints of the pattern. I have seen that in FHIR where a resource references ANY when the pattern references a specific set of resource types.</p>",
        "id": 165574659,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557786234
    },
    {
        "content": "<p>Pharmacies are represented as Organizations.  HealthCareService might be used to say \"this clinic/hospital has a pharmacy\", but the dispense would be indicated as coming from the hospital organization or departmental organization.</p>",
        "id": 165575767,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557787292
    },
    {
        "content": "<p>but a Healthcare Service has and acts on behalf of an organization...</p>",
        "id": 165577581,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557789022
    },
    {
        "content": "<p>so clarifying based on off-thread discussion - I'm not arguing that the reference list in the resources is wrong because they don't conform to the pattern. I used the pattern analysis to discover that I disagreed with the analysis in the resources</p>",
        "id": 165577819,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557789284
    },
    {
        "content": "<p>Grahame has clarified off-line that the proposed patterns wouldn't replace the type declarations in the StructureDefinitions, which means that my concern about profiling/validation impact goes away and - depending on publishing decisions - may make my hiding concerns go away as well.</p>\n<p>Is there something that these patterns add that the existing Event/Definition/Request patterns don't in terms of being able to examine analyis choices made by WGs?  The Event/Definition/Request patterns have the additional benefit that their patterns of references allow different expectations for different types of associations.  And they aren't driven by commonality of attributes, they're driven by commonality of usage.</p>",
        "id": 165578106,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557789602
    },
    {
        "content": "<p>That was my understanding as well <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . By patterns, I mean the current three patterns. I was not referring to other patterns but perhaps others were.</p>",
        "id": 165578556,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557790092
    },
    {
        "content": "<p>well, there's 2 different subjects here. one concerns the general utility of the patterns, and the other concerns the particular patterns i chose. I did chose those patterns based on suggested commonality of attributes, and then I did use one of them in a place where it was already used in order to demonstrate what it would look like. Perhaps there are 2 different things at play, but you are way over concerned about the connection</p>",
        "id": 165578687,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557790251
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22142\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22142\">GF#22142</a>,  <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22143\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22143\">GF#22143</a>, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22144\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22144\">GF#22144</a>, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22145\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22145\">GF#22145</a>, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22146\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22146\">GF#22146</a>, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22147\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22147\">GF#22147</a>, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22148\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22148\">GF#22148</a>, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22149\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22149\">GF#22149</a>, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22150\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22150\">GF#22150</a>, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22151\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22151\">GF#22151</a></p>",
        "id": 165580595,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557792137
    },
    {
        "content": "<p>I do not believe that we have ever asked committees to review the list of resources that do or don't refer to a resource that they define</p>",
        "id": 165580616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557792175
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , could we add another column to <a href=\"http://build.fhir.org/request-analysis.html\" target=\"_blank\" title=\"http://build.fhir.org/request-analysis.html\">http://build.fhir.org/request-analysis.html</a> called status with three values: \"In backlog\", \"In progress\", \"Resolved\"? The resolved status is important so we know that a decision was taken and that if there is a divergence from the pattern it is known and expected.</p>",
        "id": 165645840,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557856871
    },
    {
        "content": "<blockquote>\n<p>Committees will be able to look at these common interface patterns and assume that they have been vetted by many committees and users and can start with the classes in those patterns.</p>\n</blockquote>\n<p>I won't be making any assumptions that they have been vetted by any one</p>",
        "id": 165650483,
        "sender_full_name": "Eric Haas",
        "timestamp": 1557860023
    },
    {
        "content": "<p>because I don't believe it has</p>",
        "id": 165650496,
        "sender_full_name": "Eric Haas",
        "timestamp": 1557860039
    },
    {
        "content": "<p>well, the current ones haven't at all. But later that might change. or not</p>",
        "id": 165656850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557864121
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span>  don't know where the source for that would be</p>",
        "id": 165656915,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557864137
    },
    {
        "content": "<p>Same ini file?</p>",
        "id": 165657508,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557864570
    },
    {
        "content": "<p>well, there's 2 different ideas here - the status of the task, and the status of the mapping. And the question of who's authority we are talking about when we make any statements in this regard</p>",
        "id": 165658034,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557864964
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I was referring to the status of the mapping. The status of the task(s) would be handled in GF. There could be multiple tasks targeting a single mapping. As to the authority on the mapping, I am assuming it is the workgroup that owns the resource after collaboration with the FHIR team.</p>",
        "id": 165665961,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1557870720
    },
    {
        "content": "<p>We had a lengthy discussion on the MnM call today about Patterns.  People should come to the next call in two weeks (on the 28th) as I suspect we might talk some more about it.  We agreed that there were three types of \"patterns\":<br>\n1) The existing patterns like Event/Request which are large-scale patterns that are intended to shape resources that want to conform to the pattern.<br>\n2) Category patterns where a resource agrees to defer who is being referenced by one of its data elements to other resources.  The clearest example of these would be CatalogEntry having a reference to a CatalogableItem or a ChargeItemDefinition have a reference to a ChargeableItem.  Resources could then declare that they belong to the CatalogableItem category or the ChargeableItem catagory and could be referenced by the parent resources.  I called these \"open\" patterns in previous postings.  The benefit of this scheme is that the CatalogEntry or ChargeItemDefinition doesn't have to change every time a new resource wants to be cataloged or have a charge definition.<br>\n3) The final pattern type is what Grahame has been posting about.  A combination of a pattern that details the data elements (like #1) and also allows resources to talk about sets of resources (like #2).  There is still some debate over how these patterns would be referenced.  Currently, Grahame has the tooling working so that Communication.recipient is a Reference(Practitioner).  There is an argument that this syntactic sugar does not communicate well with implementers.  So that might not stick.  Instead, what appears to be workable is that a resource data element would be marked as a candidate for a pattern, eg. X.performer should be conformant to the Performer resource pattern.  To declare a different set of resources than the pattern would require an override by the resource owner and a clear reason for why the difference exists.  These reasons would be visible in the specification.</p>\n<p>For both pattern type #1 and #3, we all agreed that better enforcement of the patterns and a more rigorous treatment of differences needed to happen.  The mechanics of this governance are still to be worked out, but it does mean that those of us who are creating resource definitions will need to pay closer attention to build warnings and QA issues.</p>",
        "id": 165686567,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557896593
    },
    {
        "content": "<blockquote>\n<p>the tooling working so that Communication.recipient is a Reference(pattern)</p>\n</blockquote>\n<p>That’s also necessary for pattern type 2, so the question isn’t about the methodology, but about when it should be applied</p>",
        "id": 165686821,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557896984
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>the tooling working so that Communication.recipient is a Reference(pattern)</p>\n</blockquote>\n<p>That’s also necessary for pattern type 2, so the question isn’t about the methodology, but about when it should be applied</p>\n</blockquote>\n<p>Yes, that is correct.  I forgot to make that point in type 2, i.e. that we need the syntactic sugar for type 2 but don't want it for type 3.</p>",
        "id": 165686961,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557897177
    },
    {
        "content": "<p>In all cases, FMG will be the arbiter of a) what resources/elements should conform to a pattern, b) what resources can claim to belong to a category, and c) when a resource data element can claim to use/follow a pattern.  NOTE: (c) might be the same as (a), my notes are a bit fuzzy on this distinction.</p>",
        "id": 165687025,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1557897275
    },
    {
        "content": "<p>I expect the arbiter bit will be a mix of FMG, FHIR-I and MnM.  MnM/FHIR-I will propose, FMG will choose to enforce or not (or push back).  (FHIR-I is involved just because it owns the workflow project - though I guess that could be transferred to MnM.)</p>",
        "id": 165687129,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557897473
    },
    {
        "content": "<p>As an observer of this it seems that having these patterns, formalized or not, is very valuable in getting consistency in the naming and structure of resources developed independently by the different WGs.   As an end-user, I don't necessarily know these WG distinctions and I wonder why the same  structural item (concept/property) is named differently in one resource vs. the other.   I understand the WGs come from their own domain of experience, but to an end user, this domain distinction blurs, because we need to 'get the job done' and consistency helps more than 'domain-specific naming'.    Besides, the (clinical) end users of FHIR do NOT see these naming distinctions, the two groups affected most are the modelers or resource developers but those are few, and the implementers, who, if the standard is working well, are the majority of the users of these resources (patterns).</p>",
        "id": 165701626,
        "sender_full_name": "John Silva",
        "timestamp": 1557914988
    },
    {
        "content": "<blockquote>\n<p>consistency helps more than 'domain-specific naming'. </p>\n</blockquote>\n<p>Actually, our feedback is the opposite. Expecially from the CDA world where all the status code and element names are constant, and we have to explain what those things actually mean in CDA templates...</p>",
        "id": 165709609,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557923189
    },
    {
        "content": "<p>Our objective is to make FHIR intuitive, particularly to 'simple' implementers - those who might only be worrying about a couple of resources.  Having generic names that don't reflect domain conventions significantly increases the learning curve for those people - and loses one of FHIR's key advantages.  Systems that are interested in sharing code that works across many resources are comparatively less common and always more sophisticated, so dealing with naming variations is something they can more reasonably handle - especially if there are mappings indicating which elements are equivalent.</p>",
        "id": 165718656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557930161
    },
    {
        "content": "<p>Give an example, one of my app only deal with Condition resource (patient's problem list). So consistency is not an issue for me. It is more important to be able to communicate with users/physician/provider with FHIR resource.</p>",
        "id": 165721670,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1557932454
    },
    {
        "content": "<p>implementers have roadmaps and some may have several teams. So most teams will start with a couple of resources, then they will add the other resources, or another team will do other resources. Lack of consistency usually hurts much later than when we are starting to adopt.</p>",
        "id": 165853672,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558044775
    },
    {
        "content": "<p>Naming is hardly an issue for them. Most painful is when similar things work rather differently.</p>",
        "id": 165853725,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558044838
    },
    {
        "content": "<p>If the behavior is different, that'll be driven by domain variations, not forced by FHIR.  It certainly sucks when it happens, but the real world is what the real world is.  (I continue to cringe at some of the financial models because they don't do things the 'standard' FHIR way.  But those from the domain consistently say that they're happy and that the models align with how that space works.  It's certainly going to create challenges for those who would prefer that everything worked consistently, but we can't very well tell the whole financial business space to change their business processes to better align with how FHIR would like to see things done.  (As much as part of me might privately like to do just that :&gt;)</p>",
        "id": 165855477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558046436
    },
    {
        "content": "<p>there's a balance here. We can work to reduce unnecessary variation. we can also go too far</p>",
        "id": 165855817,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558046769
    },
    {
        "content": "<p>domain variations is what i mean - different domains model the same real world in different ways.  As an SDO (which developers will read to influence their designs), I believe we have a responsibility to keep some orthodoxy. But i certainly agree we shold support the variety of practices out there.</p>",
        "id": 165860141,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558051255
    },
    {
        "content": "<p>I am not unhappy with the \"design first, pattern later\" approach, just saying that consensus changes, so people should be aware that there will be alignment even after they agree on something.</p>",
        "id": 165860292,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558051425
    },
    {
        "content": "<p>Like most people, I have some times \"this is what we agreed and we will never change.... 5...4...3..2...1.. oh wait...\"</p>",
        "id": 165860394,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558051533
    },
    {
        "content": "<p>I think that step of aligning to a pattern is key. but should be use-case driven. And there I am not sure the 80/20 rule is the criterion.</p>",
        "id": 165860507,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558051653
    },
    {
        "content": "<p>sure, there are not many implementations that handle device and medication in a common way. and the products that are on the border are very few. So the use case to keep them consistent is not in the 80%.</p>",
        "id": 165860581,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558051735
    },
    {
        "content": "<p>but there is no use case to keep them inconsistent either.</p>",
        "id": 165860592,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558051743
    },
    {
        "content": "<p>ok. so I just committed something more - now, the build tools look to see what patterns a set of targets implement, and state this. for an example, see <a href=\"http://build.fhir.org/allergyintolerance-definitions.html#AllergyIntolerance.asserter\" target=\"_blank\" title=\"http://build.fhir.org/allergyintolerance-definitions.html#AllergyIntolerance.asserter\">http://build.fhir.org/allergyintolerance-definitions.html#AllergyIntolerance.asserter</a>. the same information is written into the StructureDefnitions to assist code generators</p>",
        "id": 166146798,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558421199
    },
    {
        "content": "<p>And that is advice to implementers (who might want to use the interface), not guidance for designers - correct?</p>",
        "id": 166151028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558426131
    },
    {
        "content": "<p>yes</p>",
        "id": 166157111,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558431781
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s comment that \"there is no consistency in participations in the real world\" requires some analysis.  Participation in an event is perfectly well-defined, but who or what can participate in what type of event in what role is highly varied. Every participation should have an actor, associated role, an optional time period and optional \"onBehalfOf\", but when you look across FHIR, you find this high-level pattern is broken right and left. The low level particulars of who/what can participate in what type of event is also broken because you find numerous cases where the choices are incomplete due to errors and oversights. FHIR puts great faith in the wisdom of work groups, but committees suck at design -- no matter if we are talking patterns OR particulars.</p>",
        "id": 166201329,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1558464703
    },
    {
        "content": "<p>It's not a question of 'should' - it's a question of what systems actually <em>do</em>.  If systems don't do it, then it doesn't show up in the FHIR spec - regardless of whether it might be good practice or desirable from a modeling perspective.   The places where there are differences because of errors/oversights need to be fixed.  The places where there are differences because \"most real systems don't currently support that\" are legitimate differences.</p>",
        "id": 166205960,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558467954
    },
    {
        "content": "<p>\"If systems don't do it, then it doesn't show up in the FHIR spec - regardless of whether it might be good practice or desirable from a modeling perspective. \"    What evidence do you have for that statement <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>?</p>",
        "id": 166208871,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1558470055
    },
    {
        "content": "<p>That's the FHIR design rules.  The whole 80% principle is that FHIR tries to adhere to what systems actually support in the real world, not what we wish they did.  As a result there will be inconsistencies in resources that are driven by real-world variations in behavior.  The benefit of that approach is that when you look at FHIR you'll get a sense of what you can reasonably expect (as opposed to seeing a model of the theoretical which never actually gets met in practice).</p>",
        "id": 166209161,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558470276
    },
    {
        "content": "<p>That isn't evidence.</p>",
        "id": 166209533,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1558470580
    },
    {
        "content": "<blockquote>\n<p>The low level particulars of who/what can participate in what type of event is also broken because you find numerous cases where the choices are incomplete due to errors and oversights</p>\n</blockquote>\n<p>That is certainly true. And it's a place where more work is required. I don't think Lloyd's response is quite balanced; what the majority systems do is a big part of the input to the design, but it's not the only input. </p>\n<p>It is true that if some pattern isn't being followed, the justification for change in the proposal to the committee isn't \"you aren't following the pattern\", but \"this real world case isn't being considered, and it should be (and, btw, the pattern says)\". See the tasks I created above</p>\n<blockquote>\n<p>Participation in an event is perfectly well-defined, but who or what can participate in what type of event in what role is highly varied. Every participation should have an actor, associated role, an optional time period and optional \"onBehalfOf\"</p>\n</blockquote>\n<p>Maybe, but for example, the time period might be fixed by context for a resource that doesn't represent something that happened over a period of time. Same for role - often fixed by context or element name (though it would be good to have a way to be explicit about that).  And OnBehalf of seems very theoretical to me; I don't see it being used in all but a few legal-ish circumstances</p>",
        "id": 166209638,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558470624
    },
    {
        "content": "<p>tasks back above - <a href=\"#narrow/stream/179166-implementers/topic/Pattern.20Development/near/165580595\" title=\"#narrow/stream/179166-implementers/topic/Pattern.20Development/near/165580595\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Pattern.20Development/near/165580595</a></p>",
        "id": 166209700,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558470679
    },
    {
        "content": "<p>Grahame, I should have said that the pattern of Participation can omit elements if an element is irrelevant in the context where that pattern is used. But the overriding pattern still holds.</p>",
        "id": 166209804,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1558470739
    },
    {
        "content": "<blockquote>\n<p>That isn't evidence.</p>\n</blockquote>\n<p>Not sure what you're looking for.  Are you asking for evidence of disuse?  The onus is actually the other way around in FHIR.  A proponent of having something included in the core specification needs to provide evidence of widespread support (or in limited cases, expected support) for an element to have it included in the specification.</p>\n<p>As an example, most systems don't have the ability to capture patients or devices that perform immunizations.  It might be theoretically possible that that could happen sometimes, but if most systems don't have the ability to capture that, it's not going to be supported by the resource - and thus Immunization would diverge from the pattern of the \"common\" participants.</p>",
        "id": 166210230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558471039
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> you did not reply to my answer to your question about adding another column for the status of a row in <a href=\"http://build.fhir.org/request-analysis.html\" target=\"_blank\" title=\"http://build.fhir.org/request-analysis.html\">http://build.fhir.org/request-analysis.html</a>. If we could add this, it allows the work group to state whether the current state of the row is 'in-progress' or 'resolved'. When resolved, it means all tracker items on the item have been addressed and the deviation (or adherence) to the pattern is known and understood to be correct. It allows us not to relitigate an item that has undergone significant discussion. Another row for comments might also be useful (e.g., summary of decision or gist about open questions).</p>",
        "id": 166214843,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1558474350
    },
    {
        "content": "<p>I'm still thinking about where the source for the row lives</p>",
        "id": 166215066,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558474516
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'm not blindly arguing for globally implementing patterns that no system could possibly populate, but since you brought it up as a justification against patterns, I am curious about how well FHIR does in modeling only what the super-majority of EHR systems actually collect. Again, I'm asking what evidence you have that FHIR has actually held to the design principles you enunciated. If not, then your argument against imposed patterns is substantially weakened.</p>",
        "id": 166216224,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1558475494
    },
    {
        "content": "<p>I'm not sure what evidence you're looking for.  The methodology is the methodology.  It's certainly been adhered to with varying degrees of success (and some of the challenges we've had with adherence has actually been work groups <em>over</em> adhering to patterns rather than focusing on what's common practice).  In any event, the methodology remains the methodology.  Implementers can and should raise tracker items when they feel items are included in a resource that aren't widely supported (as well as the reverse).  In situations where there's a choice between adhering to a pattern or reflecting what most systems do, the current expectation is that work groups will err towards the latter.</p>",
        "id": 166217448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558476395
    },
    {
        "content": "<p>Round up the top 10 EHRs in use today, and see which ones can populate each element in FHIR, starting with the top 20 resources in FHIR. That kind of evidence.</p>",
        "id": 166217732,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1558476607
    },
    {
        "content": "<p>Can use hapi fhir in my application and share with clients?</p>",
        "id": 166217745,
        "sender_full_name": "ksrc murthy",
        "timestamp": 1558476617
    },
    {
        "content": "<p>Please help me.</p>",
        "id": 166217756,
        "sender_full_name": "ksrc murthy",
        "timestamp": 1558476628
    },
    {
        "content": "<p>You'll want <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a> <span class=\"user-mention\" data-user-id=\"220735\">@ksrc murthy</span>.</p>",
        "id": 166217823,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1558476692
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> we do what we can do do to that . but the access is never complete and the answer is never simple or binary.</p>",
        "id": 166218177,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558476952
    },
    {
        "content": "<p>Yeah, ACN I use hapi fhir</p>",
        "id": 166218261,
        "sender_full_name": "ksrc murthy",
        "timestamp": 1558477014
    },
    {
        "content": "<p>And EHRs are only one part of the denominator for evaluation.</p>",
        "id": 166218299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558477061
    },
    {
        "content": "<p>Imperfect evidence is better than no evidence at all, and I'll bet $20 (AU or CA) that the bulk of FHIR doesn't literally follow the 80% rule. If that's the case, we should formally acknowledge FHIR needs another design rule, not just \"it models what's really out there\". I think we are slowly creeping toward that conclusion, anyway.</p>",
        "id": 166218727,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1558477421
    },
    {
        "content": "<p>I disagree with the premise that divergences from the methodology mean we should change the methodology.  An alternative view is that divergences point to a need for better training and governance.  The objective behind the methodology stands - it's more important to reflect what systems do in a standard than what we'd like them to do.  We want to lower barriers to implementation and also set a common understanding about what's reasonable to expect in other systems.</p>",
        "id": 166218996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558477663
    },
    {
        "content": "<blockquote>\n<p>divergences from the methodology mean we should change the methodology</p>\n</blockquote>\n<p>Consistent divergences from the stated methodology mean we should state the methodology more clearly</p>",
        "id": 166220115,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558478654
    },
    {
        "content": "<p>(for what is worth at <a href=\"https://fhir.careevolution.com/master.adapter1.webclient/fhir\" target=\"_blank\" title=\"https://fhir.careevolution.com/master.adapter1.webclient/fhir\">https://fhir.careevolution.com/master.adapter1.webclient/fhir</a> you can see which resources our data model maps to / from - with <a href=\"https://fhir.careevolution.com/Master.Adapter1.WebClient/fhir/resource?type=Encounter&amp;prefix=fhir#to-fhir-mappings\" target=\"_blank\" title=\"https://fhir.careevolution.com/Master.Adapter1.WebClient/fhir/resource?type=Encounter&amp;prefix=fhir#to-fhir-mappings\">mapped elements for each one</a> - we are not an EHR but we aggregate data from a lot of different EHRs and other data sources like payer systems)</p>",
        "id": 166220371,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1558478910
    },
    {
        "content": "<p>(all and only US - based)</p>",
        "id": 166220391,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1558478941
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>divergences from the methodology mean we should change the methodology</p>\n</blockquote>\n<p>Consistent divergences from the stated methodology mean we should state the methodology more clearly</p>\n</blockquote>\n<p>and we should monitor why those divergences appear. I think we need outer feedback loops to see if what we are doing is breaking on the edges - very often it does.</p>",
        "id": 167059361,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559372574
    },
    {
        "content": "<p>To me, it seems that there are a few mechanisms that push towards tunnel vision (\"we are going to do this for these systems because those are the systems we know of today / we are in a hurry / we don't yet see the big issue\") but later it is very hard to broaden, because a decision has been made and \"well, why should we reopen things that were voted already?\"<br>\n(these quotes are meant to be representations, not actual citations)</p>",
        "id": 167059438,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559372710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - thanks for pointing this out.   It sometimes feels like us 'late comers' to the FHIR world have real use cases and real systems that we are dealing with but because the decisions have already been made it's almost impossible to change now.  It seems like there are reasons that decisions had to be made back 4-5 yrs ago based on the 80% principal but the 'contributor world' was relatively small back then that there were most likely very few use cases that were used to make the decisions and now that many more (companies, individuals, new start-ups, government entities) are getting 'into the game' that there may be a need to revisit some of the \"80% decisions\" made previously.</p>",
        "id": 167070348,
        "sender_full_name": "John Silva",
        "timestamp": 1559391670
    },
    {
        "content": "<p>Indeed sometimes we see this. It is not bad to iterate and that is one success of FHIR IMO : we populated the key areas and we managed the scope quite well, now we see that some decisions were made when we had less insight or we did not know what the next person was working on. But now we know and it feels hard to swim upstream and revisit some decisions. I look forward for some methodology aspects to help collaborate faster. And I think these patterns will help.</p>",
        "id": 167075120,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559400057
    },
    {
        "content": "<p>we revisit them on a regular basis, but that doesn't make it an easy process. OTOH, some people's obvious is other people's 'what?\"</p>",
        "id": 167093183,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559429232
    },
    {
        "content": "<p>With FHIR, I believe we've had a deeper degree of implementation and a longer period of review and broader degree of review than we've had with any previous specification before we moved it to \"normative\".  The reality is that we have to lock things down at some point - the cost of change becomes too high and the potential instability becomes a barrier to adoption.  That does mean that those who are late to the party may find that there are some things they might wish were different have limited ability to affect change.  However, the way FHIR is designed, it should be exceptionally rare that there's a use-case that simply cannot be implemented because of the normative decisions.  The worst that should happen is that the locked-in solution is sub-optimal for a particular space and requires an unpleasant work-around.</p>\n<p>The other thing to consider is that there's a lot of FHIR that <em>isn't</em> locked down yet - and this is definitely the time to review and propose changes before things get locked down further.</p>",
        "id": 167095136,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559432839
    },
    {
        "content": "<p>Suggesting the \"Product\" pattern gets some attention then:  Medication and Devices have been aligning with each other but not compete yet and not so easy.<br>\nThey are the same - both have definitions (one is called Knowledge). Both are prt of catalogs. Both can be ordered, or be stated, or be traced, or be supplied...</p>",
        "id": 167403095,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559750173
    },
    {
        "content": "<p>The longer we wait , the more likely we will have <br>\na) genuine and valid divergences in models (hard to resolve)<br>\nb) tendency for \"my baby\" vs \"not invented here\"</p>",
        "id": 167403151,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559750221
    },
    {
        "content": "<p>We could take up a \"product\" pattern on the workflow calls.  (Given that other work is sort of stalled at the moment, that would be a useful thing.)</p>",
        "id": 167412467,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559756760
    },
    {
        "content": "<p>there's no reason not to draft one now... it's the right time to do speculative work like that</p>",
        "id": 167546379,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559882196
    }
]