[
    {
        "content": "<p>Hi, we trying to profile PaymentNotice to be able to pay for an Appointment. In some cases, we would like to express reduction of the patient fee and also the reduction reason. Is there a standard way of profiling this? This kind of information, does it belong to PaymentNotice or PaymentReconciliation? Currently, we are thinking that we should use extensions to express this information but would like to get some more input since it seems unlikely that we are the only ones who had this use case.</p>",
        "id": 228389112,
        "sender_full_name": "Elisabeth Vajta",
        "timestamp": 1614682213
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 228421576,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614696513
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195125\">@Elisabeth Vajta</span> </p>\n<p>The purpose of payment notice is to advise someone that a payment has been received, for example a regulator when payment timing is regulated. The payment notice allows someone to say 'the check arrived'. It is not for the making of payments. Currently, in FHIR R4 we do not have a resource that covers patient statement, R5 will have one called FinancialTransaction which does address patient payment. </p>\n<p>Are you looking for a way to express a way to express the billing of the appointment or the payment of a bill for an appointment or both?<br>\nCan you share a real world example? </p>\n<p>Please feel free to join our FM Accounts, Payments and Statement calls on Thursday, details are in the HL7 conference calendar.</p>",
        "id": 228446599,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1614704962
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> , thanks for your replay. I think I was a bit unclear, we don't want to cover the actual transaction but rather give the information of the payment, both the billing and the payment of the bill if it exist. But I have limited knowledge in this area and would be happy for help for how to interpret how to use the different resources. </p>\n<p>In our use case we have have the actual cost of the appointment, which would be the price of the service, then for a patient we can also have a reduction (in Sweeden we have a high cost protection system which ensures that a patient should not pay above a certain amount each year for their care). The price and the reduction could also be of importance to know apart from the amount which is why I wonder if there is a common way of describing sush a thing? </p>\n<p>The user flow that we are trying to support is that a patient should be able to see if payment has been made for an appointment and if it has we want to give the details of the payment. If the payment hasn't been made the patient should be able to see that and also what should be paid. The transaction step and the actual making of the payment will be done separatly from this and not handled by our FHIR server.</p>",
        "id": 230531601,
        "sender_full_name": "Elisabeth Vajta",
        "timestamp": 1615908084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 230536080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615909546
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195125\">@Elisabeth Vajta</span> As Mary Kay stated above, the PaymentNotice supports advising a party that a payment has been made or received but does not include the actual payment details. Payment is currently handled by PaymentReconciliation which in R4 only addresses insurer payment for claims but in R5 is being expanded to cover patient payment for statements, accounts.</p>\n<p>Could you please clarify whether your use case is to determine the patient portion of a service prior to the service being rendered, in which case a predermination (sent Claim (use=predetermination) and receive ClaimResponse containing the allocation of costs) would be appropriate, or whether this is for previously rendered services where a Claim has been submitted and an adjudicated ClaimResponse or ExplanationOfBenefit received.</p>",
        "id": 231491294,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1616513853
    },
    {
        "content": "<p>I have a related question - The payment notice allows someone to say 'the check arrived'.<br>\nI have a use case where I literally want to say that - to record that payment has been made. I don't need to record the amount just the fact (and don't know the amount). <br>\nBut the amount is a mandatory reference to Money. I can work around by using an empty reference or a blank reference.display but it's a bit ugly. Is there a case for PaymentNotice.amount [0..1]?</p>",
        "id": 231495411,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1616515219
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> can you use the PaymentNotice to say \"the check has arrived\"?  I always thought that was the PaymentReconciliation? </p>\n<blockquote>\n<p>The PaymentNotice resource is used to indicate that a payment is, or is about to occur. <br>\nThe PaymentReconciliation resource serves to correlate payment amounts to the adjudicated claim amounts appearing on one or more ClaimResponses.</p>\n</blockquote>\n<p>I'll admit that I'm slightly confused by the boundary because it seems that if they allowed a status of 'completed' on the PaymentNotice, that could serve to say \"this PaymentNotice has been paid\".</p>",
        "id": 231500705,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616517028
    },
    {
        "content": "<p>Okay, now I'm even more confused because I see this in the table on PaymentReconciliation:</p>\n<blockquote>\n<p>PaymentNotice - An indication that a payment has occured, is about to occur, or has been cancelled.</p>\n</blockquote>",
        "id": 231501227,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616517229
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  my text was a quote from this thread, so I assume that is what PaymentNotice is for (I would never spell it \"check\" ;-)</p>",
        "id": 231505490,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1616518769
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span>fyi on above issue of if PaymentNotice is correct way to say \"the check arrived (but we don't need to say the amount)\"</p>",
        "id": 231799127,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1616678658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> That is exactly what you can say with PaymentNotice. This is used where is is necessary to close the payment loop with the payment issuer or a regulatory body which has payment timing regulations.</p>\n<p>I can see a use case where the amount of the payment is not required, so we can add a Jira ticket to change the cardinality to 0...1.</p>",
        "id": 231801030,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1616679389
    }
]