[
    {
        "content": "<p>How and where do we capture a payor's bank account information, e.g. for a patient who is a selfpayor.<br>\nWe've been thinking Coverage.identifier or Coverage.payor.identifier?</p>\n<p>Specifically in Europe, we'd need to capture<br>\n1. the Account Number (IBAN)<br>\n2. the name of the Bank (presumably optional)<br>\n3. the name of the account Owner<br>\n4. unique mandate reference (in case of direct credit)</p>\n<p>Specifically the last one doesn't fit well in the Identifier data type. So maybe extension? <br>\nIf so, should this be core extension? European extension?<br>\nExtension on Coverage or extension on Patient/RelatedPerson?</p>\n<p>Opinions, please!</p>",
        "id": 153890800,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495475702
    },
    {
        "content": "<p>2a. the BIC (optional as of February 2016, but formally possible as well)</p>",
        "id": 153890804,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495476015
    },
    {
        "content": "<p>Similar question may apply for credit card information...</p>",
        "id": 153890806,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495476099
    },
    {
        "content": "<p>4.) is definitely related to a specific coverage (Patient giving a mandate to credit wifi/phone bills to his account), so that makes it a direct attribute of Coverage, not Coverage.payor. </p>",
        "id": 153890807,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495476603
    },
    {
        "content": "<p>I was about to write just the same ;)</p>",
        "id": 153890808,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495476646
    },
    {
        "content": "<p>But 1)...3) are not identifiers of the coverage, since a bank account may be used for more than one coverage. Like, a father's coverage (as a self payor) for himself and each of his children. That contradicts the meaning of \"identifier\".<br>\nSo, the bank account data is a property of the payor.</p>",
        "id": 153890809,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495476879
    },
    {
        "content": "<p>I guess we don't need the BIC anyhow for two reasons:<br>\na) It was a very special construct during the introduction of SEPA in Europe and is optional since 2016<br>\nb) it can be deducted from the IBAN</p>",
        "id": 153890875,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495522244
    },
    {
        "content": "<p>\"Mandate reference\" is definately an european extension as it is specific for SEPA<br>\nAnd IMHO it is an attribute of the Coverage.Payor as it is an information that this payor has authorized <br>\nto withdraw charges from his account(s)</p>",
        "id": 153890878,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495522983
    },
    {
        "content": "<p>But to make things a bit more complicated: <br>\nNeither Coverage.identifier nor Coverage.payor.identifier are the correct attributes for the bank account information as this information solely identifies an distinct bank account but neither a coverage nor a person.</p>\n<p>I fear there is a lack of attributes here ;)</p>",
        "id": 153890883,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495523525
    },
    {
        "content": "<p>One could misuse a person's/organization's identifier for the bank account, since every bank account or credit card has one single owner, so it is in fact an identifier for the person or organization. But agreed: it feels inadequate.<br>\nI also agree on the specific extension for \"mandate reference\".<br>\nregarding BIC and bank name: right, these are optional for SEPA now. The similar applies to credit cards, where the number also identifies the issuer. I don't know whether there is the need to explicitly identify the bank in other areas.<br>\n For the moment, I would tend to have an optional reference to an Organization(bank), which would make it possible to have the bank name as <a href=\"http://Organization.name\" target=\"_blank\" title=\"http://Organization.name\">Organization.name</a> and the BIC as Organization.identifier (which it is).<br>\nThat leaves open IBAN and bank account owner which has to be put in context, as Peter pointed out:<br>\n\"Patient (=benificiary) A pays service B through bank account (IBAN) C, which is owned by (Patient|RelatedPerson|Organization) D\"</p>",
        "id": 153890886,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495525126
    },
    {
        "content": "<p>(Where D may be identical to A, but not necessarily)</p>",
        "id": 153890887,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495525201
    },
    {
        "content": "<p>To make that complete: at the same time Patient (=benificiary) A pays service X through bank account (IBAN) Y, which is owned by (Patient|RelatedPerson|Organization) Z</p>",
        "id": 153890891,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495525384
    },
    {
        "content": "<p>(Where Z may be identical to A or D, but not necessarily ...)</p>",
        "id": 153890895,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495525462
    },
    {
        "content": "<p>how to express: Service X for Patient A (beeing a child) is covered by Mother B (Related Person) but withdrawn from an account belonging to mothers marital partner C (who is not related to Patient A by any means) . Patchworking can produce interesting constellations :D</p>",
        "id": 153890901,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495525648
    },
    {
        "content": "<p>Well, that \"unrelated\" person in fact would have the relation \"Pays A's rent\" :D</p>",
        "id": 153890902,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495525758
    },
    {
        "content": "<p>At the moment I think at least for that use case the bank account is not an attribute of a person, but of the relation.</p>",
        "id": 153890903,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495525882
    },
    {
        "content": "<p>Neither nor, <br>\nas the mother is the payor by legal means, she is just using the bank account of C to which she has the right of access </p>",
        "id": 153890904,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495525929
    },
    {
        "content": "<p>What I mean is something like:</p>\n<div class=\"codehilite\"><pre><span></span>...\n&lt;payor&gt;\n    &lt;extension url=&quot;http://......./mandate-reference&quot;&gt;\n        &lt;valueString value=&quot;ABCDEF123456&quot; /&gt;\n    &lt;/extension&gt;\n    &lt;reference value=&quot;RelatedPerson/12345&quot; /&gt; &lt;!-- the mother &quot;B&quot; --&gt;\n    &lt;identifier&gt;\n        &lt;extension url=&quot;http://......./bank-account-owner&quot;&gt;\n            &lt;valueString value=&quot;Person C&quot; /&gt; &lt;!-- or possibly a reference? --&gt;\n        &lt;/extension&gt;\n        &lt;system value=&quot;http://............../iban&quot; /&gt;\n        &lt;value value=&quot;DE01234567890123456789&quot; /&gt;\n        &lt;assigner&gt;\n            &lt;reference value=&quot;Organization/98765&quot; /&gt; &lt;!-- the bank --&gt;\n        &lt;/assigner&gt;\n    &lt;/identifier&gt;\n&lt;/payor&gt;\n...\n</pre></div>",
        "id": 153890910,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495527286
    },
    {
        "content": "<p>As an afterthought, using an extension instead of the proposed payor.identifier might make it less ugly ...</p>",
        "id": 153890913,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495527729
    },
    {
        "content": "<p>As a second afterthought: why does payor have cardinality 0..*? What is the use case for having multiple payors for a single coverage? And if there is one, how would they be prioritized?</p>",
        "id": 153890915,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495527944
    },
    {
        "content": "<p>IMHO that looks way to complicated to be right. <br>\nMaybe we lack a ressource or datatype denoting a bank account</p>",
        "id": 153890918,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495529575
    },
    {
        "content": "<p>Agreed. The above proposed example represents what, to me, seems possible right now (apart from the proposed payor.identifier part should really be a complex extension).<br>\nBut maybe a bank account can be considered as a necessary part of a coverage and thus become part of the Coverage resource? It is still at maturity level 2.<br>\nOTOH, a resource or data type may be better if there are other places a bank account will be used.</p>",
        "id": 153890921,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495530436
    },
    {
        "content": "<p>(the latter of course would have to be referenced/used in Coverage)</p>",
        "id": 153890922,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495530539
    },
    {
        "content": "<p>Hi,</p>",
        "id": 153890995,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1495569853
    },
    {
        "content": "<p>Question, is the intent to actually be able to use this to withdraw amounts from the bank account?  If so, wouldn't you also need the routing number? I may be present in one place, but my banking information could be in an entirely different country. In addition, would you need more than one 'set' of account information? It is possible I have one savings account, one checking account and a money management account that could be used to withdraw the funds against (or perhaps the 'rule' becomes only one to keep it from getting too complex)?  </p>",
        "id": 153890996,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1495570090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> <span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span>  just for checking: do you all think the Account resource is not suitable (or shouldn’t be made suitable) for capturing patient’s bankinformation?</p>",
        "id": 153891072,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1495613276
    },
    {
        "content": "<p>Actual payment is part of the coverage, while Account represents internal accounting (debitors + creditors).</p>",
        "id": 153891074,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495613583
    },
    {
        "content": "<p>Depending on the coverage, there may be different bank acccounts in use, which is represented by Account.coverage.<br>\nSo from my point of view: no, Account does not represent a bank account and modifying it for that purpose would also mean rethinking Coverage at least.</p>",
        "id": 153891075,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495613838
    },
    {
        "content": "<p>See also the description of Account.coverage: \"The party(s) that are responsible for covering the payment of this account\"</p>",
        "id": 153891076,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495614218
    },
    {
        "content": "<p>And the description of Coverage: \"Financial instrument which may be used to reimburse or pay for health care products and services. \"<br>\nThis surely includes the actual payment information, like a bank account</p>",
        "id": 153891077,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495614326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> <br>\nRight now the Account resource is not suitable to provide a bank account , and I fear it never will be<br>\nAs <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> wrote, the Account ressource is for internal accounting, <br>\nwe could extend Account to be able to handle external (like bank accounts) but that would lead to a high degree of confusion<br>\nAs we would have</p>\n<p>Account.coverage.account which kinda look like \"recursion level exceeded\"</p>",
        "id": 153891079,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495614399
    },
    {
        "content": "<p>+1 for the recursion argument</p>",
        "id": 153891081,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495614467
    },
    {
        "content": "<p>Ok, that's very clear. Thnx. </p>",
        "id": 153891083,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1495614536
    },
    {
        "content": "<p>So if I am correct we got the following options:<br>\n1.  use a complex extension in Coverage.payor<br>\n2.  add as attribute to Coverage<br>\n3.  new datatype/resource</p>",
        "id": 153891087,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1495615197
    },
    {
        "content": "<p>That's the state of the discussion so far. (3 of course would include a modification of or an extension for Coverage as well)</p>",
        "id": 153891089,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495615372
    },
    {
        "content": "<p>I am leaning towards adding a new backbone element named something like payorInfo or payorBankdetails in Coverage. Not sure if this element will be reused a lot at different places to make it a new datatype. Tracker item worthy?</p>",
        "id": 153891092,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1495615990
    },
    {
        "content": "<p>I would prefer to have some more international feedback on that before actually starting a tracker item.</p>",
        "id": 153891093,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495616275
    },
    {
        "content": "<p>Thinking about bank accounts, I see at least one other use case containing these, which is when practitioners or hospitals send their payment information to some central registry. At least in Germany it is very common that there is a financial compensation when data is sent to a registry.</p>",
        "id": 153891094,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495616552
    },
    {
        "content": "<p>That payment information is, along with sender contact data, often part of the structured document containing primarily patient data.</p>",
        "id": 153891095,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495616742
    },
    {
        "content": "<p>From that point of view, a new resource may be useful, especially in terms of reusable data, like: there is often a special bank account for third-party funding (registries and also clinical trials)</p>",
        "id": 153891096,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495617670
    },
    {
        "content": "<p>@Stefan Lang I agree with your suggestion. a new resource may be useful. Similar to Germany. There are registries in other countries where practitioners and hospitals send their payment information to the registry for financial compensation.</p>",
        "id": 153891106,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1495626260
    },
    {
        "content": "<p>I would expect Account to handle bank accounts.  I would also expect Accounts to have a recursive parent-child relationship.  @<strong>Brian Postlethwaite (new)</strong> ?</p>",
        "id": 153891122,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495632603
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> including recursion, in an implementation this would look like:<br>\nAccount(Profile: \"internal-debitor\") ---0..n---&gt; Coverage ---0...1---&gt; Account(Profile: \"bank-account\")<br>\nor eventually<br>\nAccount(Profile: \"internal-debitor\") ---0..n---&gt; Coverage ---0..n---&gt; Coverage.payor ---0..1---&gt; Account(Profile: \"bank-account\")<br>\nor are you thinking of a direct recursion, leaving the relation between a payor and a bank account undefined:<br>\nAccount(Profile: \"internal-debitor\") ---0..n---&gt; Account(Profile: \"bank-account\")</p>",
        "id": 153891131,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495635540
    },
    {
        "content": "<p>I don't think the notion of a guarantor's bank account should be linked through Coverage at all.  There's no insurance involved and Coverage is only for insurance.  I think Account.guarantor needs to be able to point to the account to be charged for that guarantor - whether a bank account or a credit card account.  The current model also seems to suggest that payment is always drawn first from insurance (coverages) and then from guarantors.  Are we sure this will always be the case?</p>",
        "id": 153891136,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495636519
    },
    {
        "content": "<p>Given that Coverage is only for insurance, why can Coverage.payor be a Patient or a RelatedPerson?</p>",
        "id": 153891141,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495636750
    },
    {
        "content": "<p>There is even an example for a self-payor in Coverage: <a href=\"http://build.fhir.org/coverage-example-selfpay.xml.html\" target=\"_blank\" title=\"http://build.fhir.org/coverage-example-selfpay.xml.html\">http://build.fhir.org/coverage-example-selfpay.xml.html</a></p>",
        "id": 153891142,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495637078
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nAccount.guarantor is by no means useable as we don't use guarantors in Germany at all.<br>\nWhat we need to model is having a person paying for a distinct service during the patients hospitalisation and not someone who guarantees payments for a defined period of time.</p>",
        "id": 153891146,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495637719
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> Given the definition of Coverage, I have no idea why a Patient or RelatedPerson can be a payor.   <span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> You would have an account that tracks all charges to be billed to a particular individual.  Whether that account is for a single service for for 2 years worth of services, you still have a person who is on the hook for paying off that account.  It may be that the term \"guarantor\" carries more bagage than that, but that's the relationship I was meaning.</p>",
        "id": 153891172,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495641354
    },
    {
        "content": "<p>I believe Patient and RelatedPerson were added to support a Use Case that Simone presented.</p>",
        "id": 153891177,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1495643713
    },
    {
        "content": "<p>Also, at one time Coverage had BIC which could have been reworked to support both SWIFT and IBAN but it was requested to be removed by PA (I believe)</p>",
        "id": 153891179,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1495643841
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> Coverage used to have a BI<em>N</em> which had a very constrained scope. <br>\n+1 for a backbone element \"payorBankdetails\" on Coverage <br>\n<span class=\"user-mention\" data-user-id=\"191964\">@Bettina Lieske</span>, <span class=\"user-mention\" data-user-id=\"193158\">@Udo Siefker</span>  : How do you handle this data?</p>",
        "id": 153891515,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1496078998
    },
    {
        "content": "<p>I wonder if a bank account could be a type of Endpoint (\"The technical details of an endpoint that can be used for electronic services...\")</p>",
        "id": 153891516,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1496079389
    },
    {
        "content": "<p>pity there's no uri scheme for banking details <img alt=\":disappointed:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/disappointed.png\" title=\":disappointed:\"> </p>",
        "id": 153891517,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1496080154
    },
    {
        "content": "<p>Hold on! Maybe there is:<br>\n<a href=\"https://tools.ietf.org/id/draft-dold-payto-00.html\" target=\"_blank\" title=\"https://tools.ietf.org/id/draft-dold-payto-00.html\">https://tools.ietf.org/id/draft-dold-payto-00.html</a><br>\ne.g.: <code>payto://sepa/CH9300762011623852957</code><br>\nNot really a great fit, but very much in the spirit of FHIR ;-)</p>",
        "id": 153891617,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1496126187
    },
    {
        "content": "<p>Following up the discussion on PA call on Tuesday, I created Tracker Item <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13471\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13471\">GF#13471</a> for Itroduction of a backbone element \"payor\" 0..* on Coverage, holding the reference to Payor as well as banking details related to a particular payor.</p>\n<p>Please provide examples and use cases that will help us to figure out, what attributes are needed to fully capture banking details for different payment methods in different parts of the world.</p>\n<p>Does anyone see other places where such a data structure would be needed, other than Coverage.payor?</p>",
        "id": 153891903,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1496300090
    },
    {
        "content": "<p>+1 for the tracker item</p>",
        "id": 153891969,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1496347041
    }
]