[
    {
        "content": "<p>Someone pointed me to this:</p>",
        "id": 154001038,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538147929
    },
    {
        "content": "<blockquote>\n<p>I have to guess that most healthcare provider organizations and related EHR vendors still are not aware that in 2008, PDF became an international, OPEN standard (ISO 32000-1, Document Management – Portable Document Format – PDF 1.7). As such, PDF has been recognized worldwide as the most reliable, flexible, and feature-rich document format for information exchange because it supports and manages any type of file format, including structured data, text, graphics, x-rays, and video that are used in the healthcare industry. However, what saddens me is that for the past 10 years, healthcare provider organizations and related EHR vendors still are not familiar with the attributes of the DYNAMIC format of the PDF document (NOT the static format, with which all users are familiar, including the above user and EHR vendor). This is probably one reason why PDF Healthcare, a 2010 Best Practices Guide (BPG) supplemented by an Implementation Guide (IG) (i.e., PDF-H was never a proposed standard) was never accepted by the healthcare information technology industry</p>\n</blockquote>",
        "id": 154001039,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538147941
    },
    {
        "content": "<p>from <a href=\"https://histalk2.com/2018/09/28/weekender-9-28-18/\" target=\"_blank\" title=\"https://histalk2.com/2018/09/28/weekender-9-28-18/\">https://histalk2.com/2018/09/28/weekender-9-28-18/</a></p>",
        "id": 154001041,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538147970
    },
    {
        "content": "<p>my take on this is that no one is asking...</p>",
        "id": 154001042,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538147981
    },
    {
        "content": "<p>they reached out to HL7 back then, but no one was interested...</p>",
        "id": 154001045,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538147999
    },
    {
        "content": "<p>PDF is an horribly complex format to work with</p>",
        "id": 154001051,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1538148212
    },
    {
        "content": "<p>well, that was part of the calculus, yes</p>",
        "id": 154001055,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538148275
    },
    {
        "content": "<p>There are some nice modern PDF libraries for Node that make it all quite trivial.  PDFs are treated basIcally like a &lt;canvas&gt; tag, and all the typical rules of DOM construction and design apply that you would use while rendering a web page.</p>",
        "id": 154001175,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1538191793
    }
]