[
    {
        "content": "<p>Hi folks, we provide Observations in our software via FHIR, which represent 12-lead ECG measurements, to be requested by third-party systems. So far so good. However, our customers are fairly used to get these ECG measurements as PDF report, which they can for example access through our user frontend. Now we want to provide them also via the FHIR REST interface. Obviously I looked at <em>DocumentReference</em> which seems to be the perfect way wrapping such a PDF file the “FHIR way”. But I could only find an explicit reference to the Encounter and besides that only <em>DocumentReference.context.related</em>. Would it be best practice to use this for referencing the Observation? At least it is a valid search parameter, but for me it seems quite sloppy to blindly search for DocumentReferences that might coincidently relate to the desired Observation…</p>\n<p>On the other hand <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> wrote in <a class=\"stream-topic\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers/topic/Documents\">#implementers &gt; Documents</a>:</p>\n<blockquote>\n<p>So if you have a GET request with a non-fhir mime type as accept, it is fine to directly return the binary</p>\n</blockquote>\n<p>In the end this PDF file is a <em>representation</em> of the Observation itself. So from my understanding it would make sense to react on a request for one single Observation with HTTP-header <code>Accept: application/pdf</code> by directly returning the respective PDF file. Would that be a valid alternative from FHIR perspective?</p>\n<p>P.S.: same situation goes for the Encounter which also has a PDF representation – but there the DocumentReference makes at least more sense to me…</p>",
        "id": 181131157,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574182412
    },
    {
        "content": "<p>No, that would be non-standard</p>",
        "id": 181131408,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1574182565
    },
    {
        "content": "<p>The PDF must be referenced (as binary resource) or contained  (base64 endoded) by / in a FHIR resource - either Observation or DiagnosticReport or DocumentReference</p>",
        "id": 181131506,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1574182650
    },
    {
        "content": "<p>Observation can have a value of type attachment - the document will be part of the observation. Observation can also be basedOn a Document Reference.</p>",
        "id": 181131972,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1574182926
    },
    {
        "content": "<p>Ah ok, Attachment would be good. The value itself has quantity <code>0..1</code> and is already used for the sampled (ECG) data. Does it make sense to use a component for it with valueAttachment inside the Observation?</p>",
        "id": 181132385,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574183226
    },
    {
        "content": "<p>I'd go for a DiagnosticReport with the PDF in presentedForm and the observation(s) in result</p>",
        "id": 181135565,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1574185181
    },
    {
        "content": "<p>That's the way lab results that have a textual description and discrete values are usually represented as</p>",
        "id": 181135664,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1574185228
    },
    {
        "content": "<p>I thought about that either, but don't find a DiagnosticReport to be the right fit according to its description. Neither the PDF nor the Observation itself contain a diagnosis - which is, by definition, to be made by a physician. Our results are pure measurements and maybe containing some signal processing results - but not a diagnosis...</p>",
        "id": 181139513,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574187753
    },
    {
        "content": "<p>in that case then you should publish it as a DocumentReference-&gt;Binary; from which an Observation can be basedOn</p>",
        "id": 181139565,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574187802
    },
    {
        "content": "<p>note that the \"Document\" in DocumentReference is the degraded definition of document from http, not the CDA definition of document</p>",
        "id": 181139679,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574187878
    },
    {
        "content": "<p>if I understand this correctly, the Observation.valueQuantity is valued with some number... that is derived from the ekg , the the best wayis to reference the DocumentReference with  the <strong>existing</strong>  Observation element <code>derivedFrom</code>.</p>",
        "id": 181141211,
        "sender_full_name": "Eric Haas",
        "timestamp": 1574188839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  I don't agree with making the focus of the measurement the DocumentReference instead of the Observation we already have DiagnosticReport to wrap observations....</p>",
        "id": 181141504,
        "sender_full_name": "Eric Haas",
        "timestamp": 1574189035
    },
    {
        "content": "<p>and that doesn't work for you I'd like to know why</p>",
        "id": 181141902,
        "sender_full_name": "Eric Haas",
        "timestamp": 1574189280
    },
    {
        "content": "<p>I meant derivedFrom. as I understood the document was evidence from which the Observation is derived. right&gt;</p>",
        "id": 181142363,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574189525
    },
    {
        "content": "<blockquote>\n<p>Neither the PDF nor the Observation itself contain a diagnosis - which is, by definition, to be made by a physician. Our results are pure measurements and maybe containing some signal processing results - but not a diagnosis</p>\n</blockquote>",
        "id": 181179832,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574225637
    },
    {
        "content": "<p>The resource is named 'DiagnosticReport' because it's usually provided by a Diagnostic Service to help with diagnosis. I believe you're reading too much into the name there, perhaps due to language issues. It's certainly common that most diagnostic reports do not actually contain a diagnosis. </p>\n<p>And what you are dealing with is certainly intended to be a diagnostic report with a PDF (presentedForm) and maybe some supporting structured data in observations from the ECG</p>",
        "id": 181179894,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574225756
    },
    {
        "content": "<p>if there's some wording in the definitions beyond the name that make you think DiagnosticReport is not right, what is it?</p>",
        "id": 181179939,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574225784
    },
    {
        "content": "<p>Besides the name I also did not really see fit in the Scope and Usage description. It lists laboratory results or imaging as example and \"Other diagnostics, e.g. Cardiology\" which sounded to me more like findings or medical letters rather than technical results of a medical device. Whereas Observation literally lists EKG data, which is why we have been using only those resources being linked directly to an Encounter and Patient.<br>\nHowever, the way you describe it now I understand we should probably use DiagnosticReport as additional wrapper for each Observation, which contains the PDF as attachment.</p>",
        "id": 181183672,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574232236
    },
    {
        "content": "<p>that's our (well, my, at least) expectation. do you want to create a change proposal for us to clarify the EKG/ECG use cases?</p>",
        "id": 181183736,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574232338
    },
    {
        "content": "<p>Yes, I think that would be worth doing, since also other ECG vendors usually provide PDF versions of their measurements. So I think this might be a quite common thing to do in that realm.<br>\nI didn't have the chance to create a change proposal yet so I'm a newbie <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span> could you point me in the right direction where to do this?</p>",
        "id": 181183923,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574232692
    },
    {
        "content": "<blockquote>\n<p>I meant derivedFrom. as I understood the document was evidence from which the Observation is derived. right&gt;</p>\n</blockquote>\n<p>To answer to <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>: no, technically speaking it would even be the other way round. The Observation contains all signals of the ECG measurement as they are coming from the device. The PDF is visualising these together with patient data and some technical information about the measurements. As such it is more a courtesy to the consumers of the FHIR interface, since they don't need to worry about visualising the ECG themselves in the right way. This is why I'd rather understand the Observation and the PDF as two representations of the very same thing. <br>\nSo thinking about this definition it makes more and more sense to me using DiagnosticReport.presentedForm...</p>",
        "id": 181184386,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574233532
    },
    {
        "content": "<p>At the bottom of every page in the FHIR spec is a \"propose a change\" link.  You'll need to create an HL7 Jira account first.  (Unfortunately there isn't an immediate link on how to do that when you click on \"propose a change\" - I'll see what we can do about that.  In the meantime, the link to create an account is here: fhttps://jira.hl7.org/secure/Dashboard.jspa  We just changed to Jira this weekend.)  Once your account is approved, you can submit change requests.  If you have any issues with the process, post here or send me a PM.</p>",
        "id": 181188222,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574238853
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>I meant derivedFrom. as I understood the document was evidence from which the Observation is derived. right&gt;</p>\n</blockquote>\n<p>To answer to <span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span>: no, technically speaking it would even be the other way round. The Observation contains all signals of the ECG measurement as they are coming from the device. The PDF is visualising these together with patient data and some technical information about the measurements. As such it is more a courtesy to the consumers of the FHIR interface, since they don't need to worry about visualising the ECG themselves in the right way. This is why I'd rather understand the Observation and the PDF as two representations of the very same thing. <br>\nSo thinking about this definition it makes more and more sense to me using DiagnosticReport.presentedForm...</p>\n</blockquote>\n<p>Sorry, I misunderstood. So you are you using Observation as the EKG example shows? <a href=\"http://build.fhir.org/observation-example-sample-data.html\" target=\"_blank\" title=\"http://build.fhir.org/observation-example-sample-data.html\">http://build.fhir.org/observation-example-sample-data.html</a>. Or is there improvements there? I at one point tried to create a EKG specific Resource but it got no interest. <br>\nThe link to a DocumentReference which is the rendering would be through a pointer from the DocumentReference.context.related to the Observation. Thus to find that DocumentReference for your Observation, you search using DocumentReference with the parameter -related equal to your Observation.  This order of linking from DocumentReference to the Observation follows the REST pattern of the object created second points at the object that was created first (in a likely case).</p>",
        "id": 181210351,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574259314
    },
    {
        "content": "<p>Yes, our Observations look quite like that example. We did not use any extensions. For transmitting the measurement values and meta data we have good experience using this resource, so I don't think a dedicated ECG resource would be necessary.</p>",
        "id": 181218002,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574263963
    },
    {
        "content": "<p>To summarise, there would be two valid options to augment the Observation with a PDF representation:</p>\n<ol>\n<li>DocumentReference with content.attachment for the PDF and context.related for the Observation</li>\n<li>DiagnosticReport with presentedForm for the PDF and result for the Observation</li>\n</ol>\n<p>Following <span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span>'s statement, the DiagnosticReport would be the expected way to go for such ECG reports.</p>\n<p>Besides, we also have a similar situation with the Encounter, where we provide a PDF report containing <em>all</em> relevant information (i.e. multiple ECGs, vital parameters, patient data, measurements, trends, etc...). You could call it a summary report for an entire Encounter. In that situation I feel the DocumentReference to be the resource of choice.</p>\n<p>D'accord?</p>",
        "id": 181218714,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574264392
    },
    {
        "content": "<p>well this is why these parts of FHIR are in \"Standard for Trial Use\"... we all need to try things and see how they work. The hope is that we align quickly, but sometimes it takes a longer time to come to Trial Use feedback inspired decision.</p>",
        "id": 181223641,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574267452
    },
    {
        "content": "<p>My preference given what you have described is DocumentReference. If however you had a FHIR encoding of the report, then DiagnosticReport with the PDF in presentedForm would be more clear winner. The bad part of this is that consuming applications need to look in two places. This was the same struggle we had with \"clinical notes\"... <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html\">https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html</a></p>",
        "id": 181223855,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574267574
    },
    {
        "content": "<p>Thanks for sharing that link! Though I agree this is not a satisfying solution:</p>\n<blockquote>\n<p>In order to enable consistent access to scanned narrative-only clinical reports the Argonaut Clinical Note Server SHALL expose these reports through both DiagnosticReport and DocumentReference by representing the same attachment url using the corresponding elements listed below</p>\n</blockquote>\n<p>This seems just to be a workaround for the unsharp definition of those two resources, instead of clarifying the usecases or maybe even merging them into one single resource type. Apparently, I am not the only one struggling with those definitions...</p>\n<p>Furthermore, the guide goes on:</p>\n<blockquote>\n<p>If servers properly categorized scanned reports and used the correct resource per report type (e.g. Pathology scan in DiagnosticReport) this wouldn’t be required.</p>\n</blockquote>\n<p>Funny and somewhat contradictory statement, being in an implementation guide...<br>\nAnyhow, this still leads me to the conclusion from my previous post.</p>",
        "id": 181230740,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574271605
    },
    {
        "content": "<p>I think the confusion may stem from the term \"\"Other diagnostics, e.g. Cardiology\"  we can possibly list them all but making this clearer that it include results from all kinds of diagnostic procedures such as... might be an improvement..</p>\n<p>I don't think the DiagnosticReport.presentedForm should have pdf of  <strong>\"just the tracing\"</strong>  but should be a representation of the entire report.  The DiagnosticReport.results would have the sampled data in a structured format and if you are supplying <strong>\"just the tracing\"</strong> as a convenience then use DiagnosticReport.media as a key image.</p>\n<p><a href=\"/user_uploads/10155/p7WZfmpI2-DihZ3Qu2yhh8dt/Untitled.png\" target=\"_blank\" title=\"Untitled.png\">Untitled.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/p7WZfmpI2-DihZ3Qu2yhh8dt/Untitled.png\" target=\"_blank\" title=\"Untitled.png\"><img src=\"/user_uploads/10155/p7WZfmpI2-DihZ3Qu2yhh8dt/Untitled.png\"></a></div>",
        "id": 181231353,
        "sender_full_name": "Eric Haas",
        "timestamp": 1574272007
    },
    {
        "content": "<blockquote>\n<p>a workaround for the unsharp definition of those two resources, instead of clarifying the usecases </p>\n</blockquote>\n<p>It results from messy work flow, and a lack of confidence in trading partners, which encourages further lack of confidence</p>\n<blockquote>\n<p>or maybe even merging them into one single resource type</p>\n</blockquote>\n<p>Well, we could do that. But that doesn't serve other use cases. And if we keep doing that merging, we'll end up with one resource called 'Stuff'</p>",
        "id": 181278413,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574315646
    },
    {
        "content": "<p>Fair enough. From a vendor's point of view, it is always good to have clear implementation instructions. So if there is no generically better way to have those overlapping resources, the recommendations of  the aforementioned guidance might in fact be the only way. And when it comes to standards I'd rather follow rules, even if they don't make entirely sense in my specific use case, instead of having too much freedom leading to unnecessary discussions during development.<br>\nThat said, I'd vote for a better description of both resources DiagnosticReport and DocumentReference, mentioning the overlap and the boundaries, respectively. <br>\nI found two existing Jira issues, so I'll comment on them instead of raising another: </p>\n<ul>\n<li><a href=\"https://jira.hl7.org/browse/FHIR-19250\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-19250\">https://jira.hl7.org/browse/FHIR-19250</a></li>\n<li><a href=\"https://jira.hl7.org/browse/FHIR-19249\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-19249\">https://jira.hl7.org/browse/FHIR-19249</a></li>\n</ul>",
        "id": 181281011,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574319893
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I agree. In our case, the PDF does contain more information than <em>just the tracing</em> and is considered a self-explanatory report, which in fact is in many cases the only data that is actually shared between end-consumers (e.g. cardiologists). All traces are in vector format. Though DiagnosticReport.media.link again is a DocumentReference, which might carry a PDF as attachment, I would refrain from using the term \"image\" for such a report. </p>\n<p>However, it brings another thought into the discussion: if following the (unofficial) Clinical Notes Guidance from above, everyone should implement _both_ DiagnosticReport and DocumentReference for one _same_ PDF. If so - shouldn't the resources reference each other?</p>",
        "id": 181281432,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574320453
    },
    {
        "content": "<p>I don't think that everyone should do that. I think that EHRs should just tell clients that diagnostic reports will appear as normal diagnostic reports, but some externally/patient provided diagnostic reports may appear in patient documents, since that's how the system works. </p>\n<p>But the US vendors didn't believe that would absolve them of risk, so they chose to put them in both. THe obvious flaw to me is that they won't pick up patient provided documents not categorised as diagnostic reports. I don't know if there's good data about the % like that though</p>",
        "id": 181281729,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574320915
    },
    {
        "content": "<blockquote>\n<p>Fair enough. From a vendor's point of view, it is always good to have clear implementation instructions. So if there is no generically better way to have those overlapping resources, the recommendations of  the aforementioned guidance might in fact be the only way. And when it comes to standards I'd rather follow rules, even if they don't make entirely sense in my specific use case, instead of having too much freedom leading to unnecessary discussions during development.<br>\nThat said, I'd vote for a better description of both resources DiagnosticReport and DocumentReference, mentioning the overlap and the boundaries, respectively. <br>\nI found two existing Jira issues, so I'll comment on them instead of raising another: </p>\n<ul>\n<li><a href=\"https://jira.hl7.org/browse/FHIR-19250\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-19250\">https://jira.hl7.org/browse/FHIR-19250</a></li>\n<li><a href=\"https://jira.hl7.org/browse/FHIR-19249\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-19249\">https://jira.hl7.org/browse/FHIR-19249</a></li>\n</ul>\n</blockquote>\n<p>thanks.</p>",
        "id": 181303210,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574342446
    },
    {
        "content": "<p><span aria-label=\"info\" class=\"emoji emoji-2139\" role=\"img\" title=\"info\">:info:</span> raised new ticket for the linking question: <a href=\"https://jira.hl7.org/browse/FHIR-25243\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-25243\">https://jira.hl7.org/browse/FHIR-25243</a></p>",
        "id": 181616396,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1574408862
    }
]