[
    {
        "content": "<p>I have a sort of funky use case: around 60% of the Spirometer devices in The Netherlands come from 2 sources. Apparently those devices cannot do anything beyond PDF as output and the underlying function results are unobtainable. Sort of fortunately it is textual PDF, and again sort of fortunately you can run PDF to Text and process from there. Like I said: a funky use case.</p>\n<p>The thing is this: I want to send the base PDF along with the extracted observation information. The PDF concerns a panel of results. I thought of doing that inside the Observation.text as &lt;object type=\"application/pdf\" width=\"100%\" height=\"100%\" data=\"data:application/pdf;base64,JVBER...\"/&gt; but there is an invariant txt-1 in the way:</p>\n<div class=\"codehilite\"><pre>The narrative SHALL contain only the basic html formatting elements described in chapters 7-11 (except section 4 of chapter 9) and 15 of the HTML 4.0 standard\n</pre></div>\n\n\n<p>The object tag is in chapter 13 of the HTML 4.0 standard.</p>\n<p><img alt=\":question:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/question.png\" title=\":question:\"> Am I principally looking in the right place by looking into Observation.text?<br>\n<img alt=\":question:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/question.png\" title=\":question:\"> Why is there an invariant referring to HTML 4.0 when Resource.text is actually XHTML?<br>\n<img alt=\":question:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/question.png\" title=\":question:\"> I understand that &lt;object/&gt; opens up a realm of hacking possibilities but does that outweigh the potential for rich Resource.text?</p>\n<p>For reference of what the result could look like using &lt;object/&gt;: <a href=\"http://40.68.112.13/fhir/Bundle/spirometer-panel?_format=html\" target=\"_blank\" title=\"http://40.68.112.13/fhir/Bundle/spirometer-panel?_format=html\">http://40.68.112.13/fhir/Bundle/spirometer-panel?_format=html</a></p>",
        "id": 153856865,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479149479
    },
    {
        "content": "<p>Sounds like you have a need for a DocumentReference.</p>",
        "id": 153856867,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479149946
    },
    {
        "content": "<p>How so? I can convey the thing in Observation.valueAttachment and I will, but I would like it rendered to the user directly</p>",
        "id": 153856868,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479150029
    },
    {
        "content": "<p>Note: we are talking loosely coupled systems so I need to send everything in 1 Bundle. There's no following links from contents possible</p>",
        "id": 153856869,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479150075
    },
    {
        "content": "<p>You can put anything you want into a Bundle... so it can include DocumentReference. I was recommending DocumentReference so that the PDF could be more accessible, more completely described (meta)... But if you think that is not needed, then yes put it inside. I am just offering observations on options available.</p>",
        "id": 153856873,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479152078
    },
    {
        "content": "<p>While a DocumentReference doesn't help me in my initial question which is about rendering it as part of the Observation.text, it could lead me on a different path for Observation.valueAttachment. However currently I have all meta I need in the Observation already. (Patient, Author, Filename, Filetype etc.)</p>\n<p>Looking at DocumentReference it looks as if instead of Observation as focal Resource, I could have used DocumentReference and connect the parsed stuff through DocumentReference.context.related.ref. Is that what you where hinting at?</p>",
        "id": 153856874,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479152444
    },
    {
        "content": "<p>possibly, yes. I was simply noticing the source of truth was a Document (PDF), so it occurred to me that it might be then best initially stored/indexed in DocumentReference. Many objects get decomposed out of documents.</p>",
        "id": 153856875,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479152584
    },
    {
        "content": "<p>A valid point. I must say I was mostly focussing on what came out of the PDF, rather than the PDF being source. So do you know of any example as funky as mine that could serve as prior art/source of inspiration?</p>",
        "id": 153856876,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479152685
    },
    {
        "content": "<p>Definitely not a fan of allowing Object.  You can do an image reference to it as a contained Binary though.   I wonder if Observation.related should also support Binary and/or DocumentReference?  I suspect there'll be lots of Observations that are based on things that aren't directly expressible as FHIR.</p>",
        "id": 153856887,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479165735
    },
    {
        "content": "<p>I'm sure both are possible improvements to Observation, but that still does not address:</p>\n<p>1. The Human readable part in Observation.text<br>\n2. The duplication of data in Observation.text + .valueAttachment of potentially a lot of data<br>\n3. The question why HTML 4.0 is called for in an XHTML context<br>\n4. The question whether or not FHIR should limit HTML instead of leaving it implementers (even if that comes with a big fat warning for &lt;object/&gt;)</p>\n<p>Back in CDA, one could reference between section.text and entries. Actually it feels like that is missing here. If I could link to or from Observation.text and a contained/bundled resource, then I'm golden</p>",
        "id": 153856890,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479166044
    },
    {
        "content": "<p>Did you by any chance check out <a href=\"http://40.68.112.13/fhir/Bundle/spirometer-panel?_format=html\" target=\"_blank\" title=\"http://40.68.112.13/fhir/Bundle/spirometer-panel?_format=html\">http://40.68.112.13/fhir/Bundle/spirometer-panel?_format=html</a>. It sure helps the thing just renders without any particular special software except the browser. It is actually the FHIR part that makes stuff more complicated: none of the links to contained resources render properly.</p>",
        "id": 153856891,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479166414
    },
    {
        "content": "<p>Duplication of data isn't necessarily unusual.  If you go the Binary + img route, you'll avoid duplication - and will still be compliant.  I suspect HTML 4.0 was called out because it was a clean way to identify the non-permitted content.  If there's an equally easy way to refer to the prohibited content using the XHTML spec, feel free to submit a change request proposing wording.</p>",
        "id": 153856894,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479166614
    },
    {
        "content": "<p>I don't think your use-case justifies opening the bag of worms that allowing Object would create.  The whole point of narrative is that it's easy for all implementations to consistently render the narrative.  If you throw Object in, that throws that capability out the window (along with introducing lots of security risks).  Narrative is a fall-back mechanism.  As such, it needs to be relatively simple.</p>",
        "id": 153856896,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479166695
    },
    {
        "content": "<p>Not sure why rendering object would be difficult. You either have the required plug-ins or you don't in the browser/webframe etc. If you don't you can use the standard mechanism for getting it if you so please. But anyway, I don't feel like opening up a can of worm today or any time soon over this, so I've rewritten the &lt;object/&gt; to an &lt;img/&gt; with the same construct. It looses a number of functions that way, such as pages, annotations and then some, but works and is within spec.</p>",
        "id": 153856901,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479167155
    },
    {
        "content": "<p>I checked XHTML just now. The subtitle for XHTML is:</p>\n<div class=\"codehilite\"><pre>A Reformulation of HTML 4 in XML 1.0\n</pre></div>\n\n\n<p>So with that it's probably not weird to go back to HTML 4 for that invariant. XHTML does not have convenient chapters to refer to. No need to file a change request</p>",
        "id": 153856905,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479168030
    },
    {
        "content": "<p>yes that's why reference html 4</p>",
        "id": 153856909,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479170251
    },
    {
        "content": "<p>i didn't follow how referencing between section text and entries would solve this problem</p>",
        "id": 153856910,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479170320
    },
    {
        "content": "<p>I still feel comfortable with not allowing object. If you have a renderer that's customisable enough to support object safely, then you have one that's customisable enough to do it's own rendering and use &lt;object&gt; if it wants to</p>",
        "id": 153856911,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479170383
    }
]