[
    {
        "content": "<p>How would you suggest representing the concept of periodic vs aperiodic values in a FHIR Observation, without using an extension?</p>\n<p>(There is a concept for 'periodic' in SNOMED, but not one for 'aperiodic'.    An example of this is Heart Rate; typically bedside monitors send this as a periodic data, e.g. every 30 seconds, but heart rate from a Pleth device is an aperiodic data value that is only sent when the clinician specifically takes this measurement.)</p>",
        "id": 153968728,
        "sender_full_name": "John Silva",
        "timestamp": 1528819184
    },
    {
        "content": "<p>Depends on what you want. <br>\nif you are talking about \"heart rate\" and not \"today's heart rate for Mr X\", then you are looking at definitions, not observations. <br>\nobservationdefinition does not have any good attribute for this<br>\nactivitydefinition.timing may cover it</p>",
        "id": 153968744,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528824575
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - I'm looking for a way to represent this in the \"observation instances\", because any particular observation (measurement) could have been periodic, e.g. 'essentially continuous' from a monitor, or aperiodic, as when a clinician takes a pleth reading and the pleth returns the \"heart rate\" value (bpm).   Also, this is not specific to \"heart rate\", I used this as an example.   Another example is SpO2, where this could come as a continuous (periodic) measurement from a monitor but it could also come aperiodically from a Lab test result.</p>",
        "id": 153968747,
        "sender_full_name": "John Silva",
        "timestamp": 1528826875
    },
    {
        "content": "<p>Do you mean<br>\n- This observation is of a periodic kind, so similar ones may follow or precede it,  <br>\n- This observation is periodic, so similar ones follow/precede it<br>\n?</p>",
        "id": 153968754,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528831328
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> Actually I don't see any of the two cases i mention as being covered.  you may need an extension, unless <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> i am missing something - is there a way to convey these cases?</p>",
        "id": 153968760,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528832426
    },
    {
        "content": "<p>I don't understand how this information is relevant to a point in time observation?</p>",
        "id": 153968785,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528843946
    },
    {
        "content": "<p>I kind of agree with GG,  but I would think this could be handled in the terminology as a  pre  or post coordinated concept or as an extension.  If it were some sort of device measurement then settings could be discoverable through the deviceMetric.</p>",
        "id": 153968799,
        "sender_full_name": "Eric Haas",
        "timestamp": 1528845465
    },
    {
        "content": "<p>It's relevant to our 'use case' so we need a way to handle this.   At this point I'm leaning towards simply adding a category property with a code to indicate 'periodic' vs 'aperiodic', maybe not the best thing but we don't want to use an extension.   <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  - the data sometimes comes from a device but, as in the example of SpO2, not always (it can come from a device or a lab result).   I could infer the periodic/aperiodic value from the source device, e.g. a monitor vs a lab system, but that might not be sufficient.   There are situations where a value from a monitor can be either periodic or aperiodic, e.g. heart rate from an a-line vs. heart rate from a pleth device,  blood pressure from an a-line vs blood pressure via a cuff reading.</p>",
        "id": 153968909,
        "sender_full_name": "John Silva",
        "timestamp": 1528883674
    },
    {
        "content": "<p>What's your reason for not wanting to use an extension?</p>",
        "id": 153968940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528891783
    },
    {
        "content": "<p>and you still haven't explained why beyond 'it's relevant'</p>",
        "id": 153969002,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528895234
    },
    {
        "content": "<p>Because our internal FHIR server doesn't support extensions; it's a 'minimalistic' implementation</p>",
        "id": 153969086,
        "sender_full_name": "John Silva",
        "timestamp": 1528903865
    },
    {
        "content": "<p>The \"it's relevant\" is about all I can say because the use case may be \"proprietary information\"</p>",
        "id": 153969088,
        "sender_full_name": "John Silva",
        "timestamp": 1528903931
    },
    {
        "content": "<p>well, then, you really need to add extension support, because there's not much we're going to be able to say about something that's proprietary information.</p>",
        "id": 153969209,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528927392
    }
]