[
    {
        "content": "<p>Hello,<br>\ncurrently, we have Oauth2 server for authentication/authorization purpose and i can set roles as Patient, RelatedPerson, Practitioner per each created account. I want to ask that which resource supporting permission part ?<br>\nHow to grant access for one person who has more than one roles such as Patient, RelatedPerson, Practitioner Can i use \"Person\" ?</p>",
        "id": 272227093,
        "sender_full_name": "Tommy Vu",
        "timestamp": 1645086553
    },
    {
        "content": "<p>It sounds  like you're asking how to perform Roles Based Access Control when a user has multiple roles in the system. This really depends on your implementation. The FHIR resources can be just that, resources that you want to protect and have nothing to do with authn/authz except being behind the Policy Decision Point. On the opposite spectrum, your users can map to FHIR resources and you keep your oAuth2 server in sync with FHIR writes.</p>\n<p>Is the use case you have a single Practitioner can have many different roles based on their relationship with the provider's org? See, <a href=\"https://www.hl7.org/fhir/practitionerrole.html\">https://www.hl7.org/fhir/practitionerrole.html</a></p>\n<p>Is the use case you have a single Practitioner can have many different roles based on their relationship with caring for patient(s)? See,<br>\n<a href=\"https://www.hl7.org/fhir/careteam.html\">https://www.hl7.org/fhir/careteam.html</a></p>\n<p>There's also a Permission resource in FHIR r5 that allows for explicit permissions without need for context.<br>\n<a href=\"https://hl7.org/fhir/5.0.0-snapshot1/permission-definitions.html\">https://hl7.org/fhir/5.0.0-snapshot1/permission-definitions.html</a></p>\n<p>I'd be interested in if you really have a single user needing 1 login for Patient and Practitioner roles. That would be a beast and might be just easier to make the user have 2 logins.</p>",
        "id": 272334336,
        "sender_full_name": "Mike Lohmeier",
        "timestamp": 1645137286
    },
    {
        "content": "<p>thanks for your helpful info</p>",
        "id": 272354103,
        "sender_full_name": "Tommy Vu",
        "timestamp": 1645152959
    },
    {
        "content": "<p>I agree with Mike... Note also that Role-Based-Access-Control is usually far more refined than the FHIR resources you mention. Hence PractitionerRole, which has codes... Also these roles tend to be useful beyond just FHIR Resources, meaning all kinds of data, so they tend to be managed in a general User model.  see - <a href=\"http://build.fhir.org/secpriv-module.html#user\">http://build.fhir.org/secpriv-module.html#user</a></p>",
        "id": 272456533,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645217998
    }
]