[
    {
        "content": "<p>Relatively new to FHIR. I wss wondering why there is such a large overlap between the attributes for Person, Patient and Practitioner. </p>\n<p>I am using a model that separates Person from Role (and Location(Coordinates) from Location(Place) from Physical Asset(e.g . 'Calgary Children's Hospital' but let that go for now) and it seems that under the current model there are some risks on the data quality front. </p>\n<p>My question is:  Would it not be better to keep 'Address' information in one place and associate it primarily to the Person resource and then, depending on the context, associate it that same 'block' to Person(Patient) and/or Person(Practitioner)?</p>",
        "id": 153966608,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528045584
    },
    {
        "content": "<p>this is partially a question of denormalization. Should we force all systems to use person, and for all clients to fetch person as well as patient/practitioner? The current arrangement has been debated several times, and denormalization is something that generates continual debate and is quite hard to land. But there's also the fact that across healthcare, people collect and treat data for different roles differently (and legislation like GDPR is making that more pronounced, not less). In fact, very healthcare applications have the some data for both - Person would be an artifical construct. We defined it for the few systems that are actually person repositories.</p>",
        "id": 153966609,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528056461
    },
    {
        "content": "<p>Thanks Graheme</p>\n<p>\"... across heathcare, people collect and treat data for different roles differently...\" exactly. However, if one of the objectives of FHIR is to make healtcare information semantically interoperable, would it not make sense to start with making it structurally agnostic? By extension, if we make the test for existence - and identity - of Person independent of Role, would we not have more flexibility to declare, for example: We know who this Person is independent of the Role, Location or Application?</p>\n<p>I know I've come late to the party, but I have successfully demonstrated the efficacy of the model with GDPR... just wondered how FHIR came to the design decision. Thanks.</p>",
        "id": 153966610,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528060219
    },
    {
        "content": "<p>yes, if that was our only goal, that's definitely what we would have done. But our primary goal is to support interoperability, not force people to make their data semantically consistent</p>",
        "id": 153966611,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528060557
    },
    {
        "content": "<p>You mean 'technically interoperable'?</p>",
        "id": 153966612,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528060675
    },
    {
        "content": "<p>you could call it that, yes</p>",
        "id": 153966613,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528060784
    },
    {
        "content": "<p>Sorry - misspelled your last name on previous comment</p>",
        "id": 153966614,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528060797
    },
    {
        "content": "<p>So... if I could demonstrate a way to make data 'semantically consistent' within the FHIR architecture without messing with the current standard, that would be beneficial?</p>",
        "id": 153966615,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528060921
    },
    {
        "content": "<p>yes for a given marginal sense of 'beneficial'. The data is not how it is because developers don't know how to create semantically consistent data, but because all sorts of business imperatives force people the other way. The most important of which is legacy data, or 'we are bound by our past mistakes'</p>",
        "id": 153966616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528061025
    },
    {
        "content": "<p>Agreed on the 'developers/business' tension to a point, but would argue that no developers I know could work to a standard of semantic interoperability across enterprise applications even if they were asked to.  As you say, the priority is 'fit-for-(a particular) purpose'.  </p>\n<p>WRT legacy data. My business partner and I responded to an RFI from BC Health in Canada to rationalize 40 soon-to-be decommissioned applications with 40Tb of data into an 'off-line' reference store of patient data. The idea is to be able to access this patient history (Post go-live of the new Uber App, in this case Cerner) and get an application independent, integrated view of patient medical history.</p>\n<p>I think we can add something of value here... 'Home FHIR for Legacy Data' ?</p>",
        "id": 153966617,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528061716
    },
    {
        "content": "<p>Is there a need for FHIR Legacy Data applications?</p>",
        "id": 153966667,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528111580
    },
    {
        "content": "<p>I'm not sure what you are asking</p>",
        "id": 153966668,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528112611
    },
    {
        "content": "<p>Maybe I'm not sure, either... I'm coming at healthcare data from a purely semantic POV - On a technical scale I am for all intents and purposes practically illiterate. </p>\n<p>Having said that, would it help the FHIR cause to demonstrate its interoperability capabilities on low risk, high impact remediation of legacy data?</p>",
        "id": 153966669,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528113023
    },
    {
        "content": "<p>I think we've got a few runs on the board, but more runs on the board are always good. Perhaps your best goal would be to get your application here: <a href=\"http://www.fhir.org/implementations/registry\" target=\"_blank\" title=\"http://www.fhir.org/implementations/registry\">http://www.fhir.org/implementations/registry</a>. This would allow you to describe your work in a multipage PDF document. Work is scheduled on this in a couple of months time to make it much better</p>",
        "id": 153966670,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528116807
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153966675,
        "sender_full_name": "John O'Gorman",
        "timestamp": 1528123658
    },
    {
        "content": "<p>There are also the use cases where the Patient, Person and Pracitioner are all in different systems (potentially built by different orgs), so denormalization is quite normal here.<br>\nUsing the external Person resource can be done to link across all the systems, and manage where changes are - even if isn't able to update - but be used in manual processes to rectify</p>",
        "id": 153970898,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1529536410
    }
]