[
    {
        "content": "<p>This topic has been brought up a few times.</p>\n<p>Has anyone found a performant means of leveraging FHIR for storage AND update in the case where millions of patients have hundreds of data points that may need cleaning/normalization for downstream application? </p>\n<p>I am aware that FHIR as a standard was not intended to be a persistence layer, but has the opportunity to be leveraged as such. One of our requirements is not only persistence, but also the ability to update data based on normalization standards and internal IP. Given the nesting inherent with FHIR the concern is that updating and inserting codes/concepts would be incredibly inefficient with FHIR as a persistence AND transformational store. We have had experience using JSON within MonogoDB where those transformations are incredibly time-intensive from a computational standpoint.</p>\n<p>Alternatively, transforming FHIR into a RDB structure offers the potential for better data transformation performance, but what standards out there are in use?</p>",
        "id": 273095711,
        "sender_full_name": "Jacek Slowikowski",
        "timestamp": 1645712859
    },
    {
        "content": "<p>Hello, I am on the \"Gender Harmony\" project (<a href=\"https://github.com/HL7/fhir-gender-harmony\">https://github.com/HL7/fhir-gender-harmony</a>) and looking to publish the IG.  I am looking for the repo to be built here <a href=\"https://fhir.github.io/auto-ig-builder/builds.html\">https://fhir.github.io/auto-ig-builder/builds.html</a> but can't find it.  Can anyone assist?</p>",
        "id": 273097297,
        "sender_full_name": "Andrew Schutzman",
        "timestamp": 1645713540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"455354\">@Andrew Schutzman</span> this would be a question for <a class=\"stream\" data-stream-id=\"179252\" href=\"/#narrow/stream/179252-IG-creation\">#IG creation</a></p>",
        "id": 273143891,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645733778
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"478301\">@Jacek Slowikowski</span> there's no standard fhir --&gt; RDB transform because (a) people disagree about the way to transform some of the OO patterns to relational structures and (b) once you resolve those disagreements, the transform is relatively straight forward and (c) no consensus has emerged that it's worth standardising one approach given (a) and (b).</p>\n<p>There's some general commentary here: <a href=\"http://www.healthintersections.com.au/?p=2776\">http://www.healthintersections.com.au/?p=2776</a></p>",
        "id": 273144487,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645733916
    },
    {
        "content": "<p>Will check it out, thanks</p>",
        "id": 273145396,
        "sender_full_name": "Andrew Schutzman",
        "timestamp": 1645734438
    },
    {
        "content": "<p>thanks, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 273185908,
        "sender_full_name": "Jacek Slowikowski",
        "timestamp": 1645760845
    }
]