[
    {
        "content": "<p>About the Person resource</p>\n<p>I was planning to add a tracker issue for addition of Person.deceased, Person.maritalStatus and Person.communication. As it turns out two of these proposition has been raised before by <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> . Both deceased and maritalStatus change to the Person resource is refused by the workgroup on the basis: \"The Person resource is not intended to be the demographic store for all patients/people.<br>\nIts core usage is for the very basics and linkages.\"</p>\n<p>I think this explanation misses something vital in the description of the Person resource, its intended purpose and it's actual use. The description of the resource states plainly: \"Demographics and administrative information about a person independent of a specific health-related context.\"</p>\n<p>The first two use-cases mentioned:<br>\n\"A set of demographics that can be used to co-ordinate the maintenance of this de-normalized information across practitioners, patients and/or related persons<br>\ne.g. link known resources of the different types together within a system<br>\nA state/network based Master Person Index\"</p>\n<p>This is the exact opposite of the reasoning for rejecting these changes, I think this is a mistake that will cripple the standard for these central use-cases. The master Person Index is a central part of the healtcare sector in most countries.</p>\n<p>Is there a way to reopen the issues in GForge, or should I add my own change requests?</p>",
        "id": 162986208,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1554886517
    },
    {
        "content": "<p>I still stand by my issues and thus agree with you. You die as a Person, not in your role as Patient or Practitioner. Same goes for marriage. FHIR currently does not let you die or marry as a Person. That's awkward at best. In some respects V3 had this figured out better. </p>\n<p>As for your questions on how to re-raise the issue: I'd recommend opening a new ticket with a pointer to the old one.</p>\n<p>Note that Person came late to the game in FHIR because the consensus was that in the 80% of implementations  there's no Person registry. Only Patient and Practitioner. The same reasoning is behind why there is no link between RelatedPerson and Patient.contact</p>",
        "id": 162986569,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554886839
    },
    {
        "content": "<p>Thanks for the reply <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> </p>\n<p>I will add a new issue in GForge then. Hoping it will get better traction this time around.</p>",
        "id": 162991403,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1554891637
    },
    {
        "content": "<p>I'm wondering why people think it's bad that FHIR resists you dying as a person?</p>",
        "id": 162994362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554894693
    },
    {
        "content": "<blockquote>\n<p>You die as a Person, not in your role as Patient or Practitioner. Same goes for marriage.</p>\n</blockquote>\n<p>Well, that's not really how the data in FHIR was modelled.  We don't strictly model the properties of an entity in the real word onto the equivalent entity in the model, we model the data to match the process around it.   E.g. you have a diet as a Person, yet, the diet element is placed on Encounter.  Why?  Because we figured the dietary preferences are registered as part of the admission.  That's why Person is not a person, but the <em>demographic information around a Person</em>. And similarly, a Patient is not a patient in the real world, but the data we register in the process around Patient. It's a record, not the patient itself.</p>",
        "id": 163002555,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1554901863
    },
    {
        "content": "<p>Sure. But wouldn't you agree that dying and marrying is a Person record property more than it is a Patient record property?</p>",
        "id": 163002714,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554901952
    },
    {
        "content": "<p>I.e.: you may not have Person registry, but if you do, then dying and marrying would certainly be part of it</p>",
        "id": 163002807,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554902024
    },
    {
        "content": "<p>In the medical context, I think you die as a patient.  In my opinion, marriage, however, isn't a medical condition so it would be attached to a person.</p>",
        "id": 163003019,
        "sender_full_name": "David Pyke",
        "timestamp": 1554902168
    },
    {
        "content": "<p>The patient may die, but the administrative record of that would likely end up on the Person record (if you have one), while the clinical circumstances may live in Patient context. Assuming you have both a Patient and a Person registry, my guess is that the master file is Person for death recording and the Patient record would need to be in sync with that</p>",
        "id": 163005351,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554903796
    },
    {
        "content": "<p>Can a doctor die as a Patient, while his Person and Practitioner record live on? Would you always check a Patient record to see whether or not Person happened to be dead? Or would you delete a Person record because the Patient died and you cannot register his death properly?</p>",
        "id": 163005546,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554903961
    },
    {
        "content": "<p>If a practitioner dies, they become delisted as a practitioner. Why would you keep a practitioner on file if they're dead?</p>",
        "id": 163005758,
        "sender_full_name": "David Pyke",
        "timestamp": 1554904099
    },
    {
        "content": "<p>Most patient records have a death property (in the systems I've worked with).  Everything is registered against the patient MRN/eMPI, so yes, you would check the patient record to see if they're dead.</p>",
        "id": 163005846,
        "sender_full_name": "David Pyke",
        "timestamp": 1554904188
    },
    {
        "content": "<p>If you don't have a Person registry, all bets are off, but if you do, you really want an essential property like Death there. Sure you'll delist Practitioner once his death as a patient becomes known. It's unlikely that you would delist his Person record.</p>",
        "id": 163006167,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554904415
    },
    {
        "content": "<p>Maybe having a Person registry is not in the 80%, but once you have a Person registry then Death will be &gt;80%.</p>",
        "id": 163006342,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554904524
    },
    {
        "content": "<p>Sounds like you have a case for an extension, then.</p>",
        "id": 163006383,
        "sender_full_name": "David Pyke",
        "timestamp": 1554904562
    },
    {
        "content": "<p>That may be what we end up with, not what I would aim for. Death and MaritalStatus are a first class property in my mind.</p>",
        "id": 163006503,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554904646
    },
    {
        "content": "<blockquote>\n<p>Sounds like you have a case for an extension, then.</p>\n</blockquote>\n<p>That is one af the key questions here. Does it end up in a standard extension or as a integrated part of the Person resource. I believe death, communication and maritalStatus is well inside the 80% and that this should be included as part of the standard, as this is key information in every Master Person (or Patient) index. Other properties like when they arrived to the Kingdom (for imigrants), if they are listed as eligible to wote in Sami elections (actually a thing here in Norway) or known fake identities is clearly outside the 80% and absolutely should be solved by extensions.</p>\n<p>I you are specially interested and know the Norwegian language you can se the model for the Norwegian master Person Index here:<br>\n<a href=\"https://skatteetaten.github.io/folkeregisteret-api-dokumentasjon/funksjonell-beskrivelse/\" target=\"_blank\" title=\"https://skatteetaten.github.io/folkeregisteret-api-dokumentasjon/funksjonell-beskrivelse/\">https://skatteetaten.github.io/folkeregisteret-api-dokumentasjon/funksjonell-beskrivelse/</a></p>\n<p>We are now in the process of representing the data for use in the Norwegian healthcare sector and want to expose it to the sector using a FHIR RESTFul API.</p>",
        "id": 163071734,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1554960872
    },
    {
        "content": "<p>@thomas <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> im in the same need of flagging af person as dead - did you guys come up with a proper extension that could eg. make its way into standardized extensions?</p>",
        "id": 183745768,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576672421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> <span aria-label=\"up\" class=\"emoji emoji-2b06\" role=\"img\" title=\"up\">:up:</span></p>",
        "id": 183753097,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1576678404
    },
    {
        "content": "<blockquote>\n<p>@thomas <span class=\"user-mention silent\" data-user-id=\"191375\">Alexander Henket</span> im in the same need of flagging af person as dead - did you guys come up with a proper extension that could eg. make its way into standardized extensions?</p>\n</blockquote>\n<p>Yes, we did in fact make an extension for deceased, its simple only contains the deceased date, except for the fregMetadata (that is data from the Norwegian Master Person Index from IRS-Norway). So the metadata part should not be included in the official extension. <br>\n<a href=\"https://simplifier.net/Grunndata-R4/Deceased\" target=\"_blank\" title=\"https://simplifier.net/Grunndata-R4/Deceased\">https://simplifier.net/Grunndata-R4/Deceased</a><br>\n<span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span></p>",
        "id": 183824733,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1576743482
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> we did not get to extensions yet because we don't use Person so far. Dying or marrying is still impossible I see, so by the time we get to Person we would definitively extend for it.</p>",
        "id": 183828244,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1576747260
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> thx - I'll have a look. <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> im gonna give it a go and post the resulting extension - that I guess could be a candidate for a standardized extension</p>",
        "id": 183828385,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576747379
    },
    {
        "content": "<p>Feel free to submit a change request</p>",
        "id": 183856792,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576770242
    },
    {
        "content": "<p>I ended up with the following: <a href=\"https://docs.ehealth.sundhed.dk/latest/ig/StructureDefinition-person-deceased.html\" target=\"_blank\" title=\"https://docs.ehealth.sundhed.dk/latest/ig/StructureDefinition-person-deceased.html\">https://docs.ehealth.sundhed.dk/latest/ig/StructureDefinition-person-deceased.html</a> - nothing fancy</p>",
        "id": 183940987,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576853109
    },
    {
        "content": "<p>I guess this will show up in R5 then: <a href=\"https://jira.hl7.org/browse/FHIR-20771\">https://jira.hl7.org/browse/FHIR-20771</a> <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span></p>",
        "id": 224001114,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1611641683
    }
]