[
    {
        "content": "<p>Hi, We have implemented an internet facing PHR secured with OAuth2. Now a question has been asked as to whether the infrastructure can be reused for some self service personnel use cases, the first being online access to payslips for health service staff.</p>\n<p>I have no doubt this *can* be done, but would welcome opinions on whether this *should* be done, or if it is outside the intended scope of FHIR. I notice that HL7 had a Personnel Management working group which is now merged into Patient Administration. </p>\n<p>In the first instance we would store payslips (thinking PaymentNotice as a candidate resource type, possibly extended to link to a pdf payslip). Another potential use case is shift selection for bank nurses - Schedule and Slot are possibilities I've identified as candidates.</p>\n<p>Any thoughts/opinions appreciated.</p>",
        "id": 153865717,
        "sender_full_name": "Andy Kendall",
        "timestamp": 1483635945
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193129\">@Andy Kendall</span> At present, there are no resources to represent HR concepts like payroll.  Our general leaning would be to avoid including that in FHIR as it's not terribly healthcare-specific.  However, we'd be guided by the will of the implementer community.  I.e. If lots of independent implementers indicate they want support for (some) payroll concepts in FHIR, then we'd look at doing that.  Unless/until that happens, you'd need to look at the Basic resource.</p>",
        "id": 153865728,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483645293
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, that's really helpful. The Basic resource along with DocumentReference would cover our immediate requirement nicely I think. From what you say, it is doubtful that HR concepts will be included in FHIR - but in our context I suspect that consumers/developers of the HR API will be the same teams who consume the PHR and other FHIR based interfaces and therefore already have the FHIR tooling and skills. This I think is another compelling reason (along with re-use) for us considering FHIR in this context.</p>\n<p>However, payslips are a simple use case - more tricky is the representation of shifts which need to be filled (think self service shift request by ward nurses). My first thought was that Slot and Schedule showed lots of synergies and could be profiled to meet the need - but perhaps that is a step too far - after all to use Basic for this would result in a quite complicated resource which would probably in the end look very like Slot/Schedule and starts to feel more like a reason why FHIR isn't a good choice here. Would you agree with that?</p>\n<p>The general driver here is the push to provide internet access for both Patients and professionals to relevant data held in on-premise systems.</p>",
        "id": 153865883,
        "sender_full_name": "Andy Kendall",
        "timestamp": 1483697264
    },
    {
        "content": "<p>We are modelling our internal system with shifts as slots as you've described in a Community based scheduling application.</p>",
        "id": 153865887,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1483703260
    },
    {
        "content": "<p>And our staff will be paid based on shifts (slots), not appointments, but that's not always the case for us also. </p>",
        "id": 153865888,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1483703311
    },
    {
        "content": "<p>I think Slot and Schedule *should* meet your need for managing shifts.  That's certainly part of their intended scope.</p>",
        "id": 153865928,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483734396
    }
]