[
    {
        "content": "<p>My team is working on implementing CommunicationRequest and Communication as part of a Alerting/Notifications solution.  One of our requirements is the need to escalate to the persons manager if the alert is not acknowledged within a time frame.  This relationship is NOT part of a care team, it's the purely organizational view.  We have AD where we can find a persons manager, but we'd like to front that lookup with either our Practitioner or possibly Person FHIR service.  I've looked through both and can't see where I'd capture a Manages-ManagedBy relationship.  Anyone else had this come up yet?</p>",
        "id": 153881026,
        "sender_full_name": "Jim Kreth",
        "timestamp": 1491418788
    },
    {
        "content": "<p>I would put it on Practitioner or more likely PractitionerRole, not Person.  Person is used purely to say \"these different records are all tied to the same human being\".   Supervisor relationships aren't tied to the human being, they're tied to the specific professional role.  Dr. Smith's back-up as chief cardiologist at hospital 1 is not going to be the same as their back-up as on-call surgeon at hospital 2.</p>",
        "id": 153881028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491419162
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>:  Our typical use case for clinical (patient health &amp; safety) alerts is to escalate to some other identified role in the care-team (e.g. bedside nurse to attending physician).  I see were you're going with PractitionerRole, but our use cases are beginning to stretch into more hospital operations issues.  As an example:</p>\n<p>After a discharge send a notification to house keeping (generic Role) to clean and reset the room.  If that hasn't happened within 1 hour, escalate to the \"manager of house keeping\" (a practitionerRole but resolved to a particular person I'm going to send an SMS message to).  If it still isn't done within 2 hours, send a message to that practitioner's manager.  </p>\n<p>I'm still not sure how I would link 2 individuals together through PractitionerRole.  I guess is what I'm looking for is some recursive relationship on Practitioner or PractitionerRole (with a relationship type).  </p>",
        "id": 153881030,
        "sender_full_name": "Jim Kreth",
        "timestamp": 1491420411
    },
    {
        "content": "<p>PractitionerRole.practitioner is 0..1, so it should be possible to define generic roles without identifying specific individuals.</p>",
        "id": 153881032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491420712
    }
]