[
    {
        "content": "<p>Is there a way to look up listing of Pharmacies in US and find their corresponding NCPDPID?<br>\nI need the Pharmacy specific NCPDPID to send to our  ePrescription vendor, to identify the preferred pharmacy of the Patient. How can I get this Pharmacy listing and the Id associated with it.</p>",
        "id": 208824554,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1599053887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span></p>",
        "id": 208835215,
        "sender_full_name": "Melva Peters",
        "timestamp": 1599058102
    },
    {
        "content": "<p>Check out NCPDP DataQ <a href=\"http://dataq.ncpdp.org/\">http://dataq.ncpdp.org/</a></p>",
        "id": 208839195,
        "sender_full_name": "Shelly Spiro",
        "timestamp": 1599059506
    },
    {
        "content": "<p>NCPDP DataQ is an authoritative source with extensive information, covering all pharmacies in the US.  It is a subscription service.</p>\n<p>Alternatively, your eRx switch (e.g. Surescripts) can provide pharmacy NCPDPIDs, NPI, and supported capabilities.</p>",
        "id": 208852234,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1599064557
    },
    {
        "content": "<p>Thanks. Seems NCPDP DataQ is the only source<br>\nOur eRx partner, DrFirst doesn't expose NCPDPID API unfortunately</p>",
        "id": 208857009,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1599066776
    },
    {
        "content": "<p>DrFirst is an eRx (and other) application provider, I don't believe they are an intermediary (switch).  </p>\n<p>You say you need the NCPDP ID for \"your ePrescription vendor\".  They don't provide any other means to lookup a pharmacy?  Or, is this to build a list of pharmacies in that vendor's product/your implementation?</p>",
        "id": 208879879,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1599077077
    },
    {
        "content": "<p>Within the ePrescription portal / iframe, DrFirst provides the pharmacy listing for us.<br>\nBut they don't expose any API for me to use externally.</p>\n<p>My use case, I want to show a list of pharmacies to my user to preselect their preferred one in our App.<br>\nThis happens before our ePrescription workflow really kicks in.</p>\n<p>So, I am looking for alternate way to load this list of Pharmacies along with NCPDP ID into our application</p>",
        "id": 208880441,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1599077354
    },
    {
        "content": "<p>Even if you do that, what will you do with it? If DrFirst doesn't expose an API, how will you pass that in? As an iFrame parameter?</p>",
        "id": 209862286,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1599881598
    },
    {
        "content": "<p>Is there an identifier system that can be used with pharmacy NCPDP ID? We'd like to generate the Organization record and store the identifier</p>",
        "id": 276225576,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647970213
    }
]