[
    {
        "content": "<p>Hi all,<br>\nWe are looking into a Pharmacy Refill use case wherein we will need to house information about past and current VA prescriptions, tracking information for the deliveries mailed within the last 30 days, keep a list of all of the patient's medicines, along with some patient data including mailing address and email address. Our customer would prefer we use fhirversion DSTU2, but we are willing to use a more recent fhir spec if we find it is a better fit.<br>\nOur thoughts were that DSTU2 MedicationDispense resource would work, but that the STU3 or R4 MedicationRequest resource might be better suited. Does anyone have a take on which of these would work best?</p>",
        "id": 163560049,
        "sender_full_name": "Emily Subocz",
        "timestamp": 1555507788
    },
    {
        "content": "<p>Have you looked at MedicationStatement? <a href=\"https://www.hl7.org/fhir/DSTU2/medicationstatement.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/DSTU2/medicationstatement.html\">https://www.hl7.org/fhir/DSTU2/medicationstatement.html</a> . It is for R3 and R4 as well.  It is a past, present, and future of a patient's medications.</p>",
        "id": 163562882,
        "sender_full_name": "Nathan Hall",
        "timestamp": 1555509567
    },
    {
        "content": "<p>MedicationDispense is the resource for actual dispenses</p>",
        "id": 163563212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555509740
    },
    {
        "content": "<blockquote>\n<p>past and current VA prescriptions</p>\n</blockquote>\n<p>seems a clear case for medicationRequest</p>",
        "id": 163563401,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555509847
    },
    {
        "content": "<blockquote>\n<p>tracking information for the deliveries mailed within the last 30 days</p>\n</blockquote>\n<p>clearly Dispense. medStatement is when the patient says \"i am taking metformin\"</p>",
        "id": 163563489,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555509922
    },
    {
        "content": "<blockquote>\n<p>keep a list of all of the patient's medicines </p>\n</blockquote>\n<p>why not bundle the known dispenses and known prescriptions in a List?</p>",
        "id": 163563534,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555509961
    },
    {
        "content": "<blockquote>\n<p>along with some patient data including mailing address and email address. </p>\n</blockquote>\n<p>you can add a contained Patient resource i nthe list, and add the patient email and other details</p>",
        "id": 163563606,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555509995
    },
    {
        "content": "<p>so your overall resource would be a List (or a bundle?) with the information about prescribed AND dispensed dugs</p>",
        "id": 163563650,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555510032
    },
    {
        "content": "<p>I wouldn't recommend using a 'contained' Patient.  Remember containment isn't for ease of transport, it's because the resource can't stand independently.  If you need to transport everything at once, just package it all up into a Bundle.</p>",
        "id": 163571319,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555514871
    },
    {
        "content": "<p>My reading was that address and email were just some \"circumstancial\" additional data on a patient that was not to be persisted, and the patient was otherwise already known. <br>\nIf the patient mailing address and email are already in the patient resource, indeed best is just to bundle it together and not contained.</p>",
        "id": 163571795,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555515118
    },
    {
        "content": "<p>If it's already known, you don't send it as contained, you just reference the existing resource.</p>",
        "id": 163571967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555515214
    },
    {
        "content": "<p>ok</p>",
        "id": 163572288,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555515389
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , the use case seems to fit with Medication Dispenses which are the actual dispense events for a patient.  You could bundle MedicationDispense with MedicationRequest (prescription/orders) and even MedicationStatements (records of other medications the patient says they may be on) if you have them for a list.</p>",
        "id": 163667342,
        "sender_full_name": "Melva Peters",
        "timestamp": 1555605249
    }
]