[
    {
        "content": "<p>Hello, we've received some information from an API management vendor that there has been a discussion about moving away from HTTP GET requests with PHI in the query string.  To help avoid PHI being logged in the SSL terminating web servers.</p>\n<p>Does anyone know where that conversation is happening?</p>\n<p>Related to the comments in <a href=\"https://www.hl7.org/fhir/security.html#http\" target=\"_blank\" title=\"https://www.hl7.org/fhir/security.html#http\">https://www.hl7.org/fhir/security.html#http</a></p>\n<p>Thanks!</p>",
        "id": 153853215,
        "sender_full_name": "David Teirney",
        "timestamp": 1476901801
    },
    {
        "content": "<p>As long as the requests are encrypted (SSL) the query parameters will also be encrypted: <a href=\"http://security.stackexchange.com/questions/12531/ssl-with-get-and-post\" target=\"_blank\" title=\"http://security.stackexchange.com/questions/12531/ssl-with-get-and-post\">http://security.stackexchange.com/questions/12531/ssl-with-get-and-post</a></p>",
        "id": 153853226,
        "sender_full_name": "Mat Coolidge ",
        "timestamp": 1476902194
    },
    {
        "content": "<p>only the sending and receiving application should have access unless the cert has been compromised and in that case POST wont help anyways</p>",
        "id": 153853228,
        "sender_full_name": "Mat Coolidge ",
        "timestamp": 1476902246
    },
    {
        "content": "<p>this is fundamentally a question about logging policy. If you have PHI in the URL, PHI will appear in the log. and the logs will become covered under HIPAA etc. </p>",
        "id": 153853251,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476905112
    },
    {
        "content": "<p>responding to this by removing PHI from the URLs is fixing the wrong problem, (and assumes that the bodies are never logged - logging these is also a policy choice)</p>",
        "id": 153853252,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476905155
    },
    {
        "content": "<p>Thanks for the information. We've worked with PHI in the HTTP request for a very long time and have policies in place for managing that information when it finally gets decrypted by the SSL terminator and enters the secure network. We've been working with another vendor for API Management that doesn't support PHI within the first line of the HTTP request under their HIPAA compliance statement (due to logging infrastructure within their SaaS offering).</p>\n<p>Just trying to track down the conversation they mentioned regarding the FHIR spec looking to move away from using GET due to this potential PHI logging issue.</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> if you're not aware of any discussion relating to this perhaps I misunderstood what was being discussed with the vendor.</p>",
        "id": 153853257,
        "sender_full_name": "David Teirney",
        "timestamp": 1476909318
    },
    {
        "content": "<p>David, it is commonly misunderstood.  You have outlined the risk correct, in that the risk is inside the secured system behind TLS.  The Security wg has taken care to make sure this risk is understood properly, and gets recognized as an operational requirement.  See <a href=\"http://hl7-fhir.github.io/security.html#http\" target=\"_blank\" title=\"http://hl7-fhir.github.io/security.html#http\">http://hl7-fhir.github.io/security.html#http</a></p>",
        "id": 153853258,
        "sender_full_name": "John Moehrke",
        "timestamp": 1476909711
    },
    {
        "content": "<p>we do say this: With regard to HTTP logs, implementers need to consider the implications of distributing access to the logs. HTTP logs, including those that only cotain the URL itself, should be regarded as being as sensitive as the resources themselves. Even if direct PHI is kept out of the logs by careful avoidance of search parameters (e.g. by using POST), the logs will still contain a rich set of information about the clinical records</p>",
        "id": 153853259,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476909742
    },
    {
        "content": "<p>This said, the misunderstanding that POST is better than GET is incorrect. The observed risk that a off-the-shelf web-server has some logging levels that will log the HTTP GET parameters is true, but they can also be configured to log the whole POST content. This is a case where management of the system configuration and protection of sensitive content need to be done. This is a systems design problem.</p>",
        "id": 153853261,
        "sender_full_name": "John Moehrke",
        "timestamp": 1476909848
    },
    {
        "content": "<p>or, in my language, a policy question</p>",
        "id": 153853262,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476909877
    },
    {
        "content": "<p>yes, a policy question is always a good answer. In my short words it might not have been obvious that the POLICY drives the design. </p>",
        "id": 153853265,
        "sender_full_name": "John Moehrke",
        "timestamp": 1476910170
    },
    {
        "content": "<p>Thanks all for your feedback. For the moment I assume I misunderstood the conversation with the vendor as it appears there are no plans for FHIR to change anything with respect to the use of GET where the request URI will contain PHI.</p>",
        "id": 153853289,
        "sender_full_name": "David Teirney",
        "timestamp": 1476921357
    },
    {
        "content": "<p>you can do patient search by POST - we do allow that, and servers should support that ( though most clients don't bother). Perhaps that is what they were referring to </p>",
        "id": 153853290,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476921419
    },
    {
        "content": "<p>Yes, possibly. Getting patient specific information from every other resource typically uses GET with the patient.identifier as a query param though so no real benefit to using POST for just the search for the patient.</p>",
        "id": 153853291,
        "sender_full_name": "David Teirney",
        "timestamp": 1476921578
    },
    {
        "content": "<p>y. I agree. </p>",
        "id": 153853292,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476921788
    }
]