[
    {
        "content": "<p>Is there anything preventing a server using phonetic searches in the standard queries? eg the 'name' search parameter matching a name of 'smythe' because it sounds like 'smith'?</p>",
        "id": 198631740,
        "sender_full_name": "David Hay",
        "timestamp": 1590379024
    },
    {
        "content": "<p>Only the time to implement and a flag to tell a server to do it.</p>",
        "id": 198694667,
        "sender_full_name": "David Pyke",
        "timestamp": 1590433215
    },
    {
        "content": "<p>From a conformance perspective, servers are allowed to have small variations in behavior around how they do matching, but I have a strong preference for distinct search parameters for distinct behaviors where possible.</p>",
        "id": 198695338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590433844
    },
    {
        "content": "<p>I started adding support for phonetic search to hapi today and have a question: Is the intent that it searches both given and family names (using a phonetic normalizer like soundex)?  That feels like it would generate too many false positives to be useful.  Where can I find a link to the discussion about this?</p>",
        "id": 201789293,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1592949597
    },
    {
        "content": "<p>it hasn't come up before. I would prioritise family name over given name</p>",
        "id": 201790434,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592950227
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> - seems like something PA might have an opinion on?</p>",
        "id": 201790813,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592950469
    },
    {
        "content": "<p>There is. The phonetic search parameter. Otherwise I would be suggesting using the :text modifier to fire it.</p>",
        "id": 201790979,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1592950588
    },
    {
        "content": "<p>I also did some experimentation with other algorithms too (and on org too) <br>\n<a href=\"http://sqlonfhir-r4.azurewebsites.net/fhir/Patient?name-fuzzy=byron\">http://sqlonfhir-r4.azurewebsites.net/fhir/Patient?name-fuzzy=byron</a></p>",
        "id": 201791525,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1592950967
    },
    {
        "content": "<p>according to the spec it sounds like it works the same as name but narrowed to given and family with a phonetic normalizer applied...</p>",
        "id": 201791705,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1592951097
    },
    {
        "content": "<p>maybe I'll just implement it as written but then add a SearchParameter extension to support more useful variants</p>",
        "id": 201791760,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1592951133
    },
    {
        "content": "<p>Or :contains?</p>",
        "id": 201793313,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1592952072
    },
    {
        "content": "<p>I read this topic and have a question in general: How do plan to cope with different languages? </p>\n<p>I'm German and am able to speak English properly (I hope), but sometimes I have difficulty with pronouncing English names. My surname is often pronounced Polish (there it sounds like Pschisucha), although it is Prussian (there it is more link Prezucha). <br>\nAnd I also live in an area, where \"e\" sometimes is used to lengthen a vocal, e.g. Laer is pronounced like Laar (long a like in Russia). In other regions in Germany ae would be pronounced like \"ä\", so Laer wound sound like \"lair\". </p>\n<p>To summarize: Names can be pronounced totally different in different languages, and sometimes a language isn't even clear on how to pronounce a name properly due to regional issues. So I am curious about your solution.</p>",
        "id": 201825902,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1592989833
    }
]