[
    {
        "content": "<p>I am thinking of developing a care network at the national level. Since there are several applications at the national level, the idea is to allow them to communicate with each other using FHIR. For this, I thought of developing a module that scans a database and converts the result into a json object respecting the FHIR format. For the output json object, I will want it to contain all the information for a global patient record. To achieve this goal, I will want to use the bundle, composition resources. Is it a good idea to look at the problem from this angle?</p>",
        "id": 242390942,
        "sender_full_name": "Siriman KONARE",
        "timestamp": 1623438925
    },
    {
        "content": "<p>What sort of updates do you want to happen.  Having a document that's a data dump of everything the system has is a potential option, but it's often overwhelming, frequently contains non-useful information, and doesn't provide a mechanism to make changes.  If you do go this route, you might look at International Patient Summary as a foundation for what you share.  However, if you want systems to be able to build solutions on top of the data via SMART on FHIR or CDS Hooks, then looking at a non-document solution such as International Patient Access might be a better bet.</p>",
        "id": 242397127,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623442297
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .  The ideas is to share information using a FHIR bridge that enable to map databases to FHIR and conversely to map FHIR to any database in our network. So I think IPS may be a good foundation. But what I don't understand what do you mean about non-document solution</p>",
        "id": 242398565,
        "sender_full_name": "Siriman KONARE",
        "timestamp": 1623443216
    },
    {
        "content": "<p>Most FHIR solutions use REST interfaces to allow direct query and update of data (transforming the data to and from their internal data store).  That's much more flexible and often more useful than documents.  IPS is really helpful in situations when there's no hope of the 'consuming' system being able to query the data source directly (but a patient or other person might be able to carry a document and share it).  If you're in a situation where direct query is possible, exposing your data as individual resource endpoints might be preferable.</p>",
        "id": 243862695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624579990
    }
]