[
    {
        "content": "<p>Just reading a post-mortem of an information leak, and found this policy:</p>\n<ul>\n<li>Regular code audits to identify any places where PII is stored and / or transmitted, and regular review of the necessity of each instance found. If there's a chunk of code that shows you your email address on a route that's no longer used after other changes, get rid of it.</li>\n<li>Identification of PII in the code base and database, so developers immediately know if the code they're working with stores or transmits PII and precisely the kind of information that needs to be considered.</li>\n<li>Ensuring that the definition of personally-identifiable information is disambiguated entirely, so that there's no question or subjective interpretation of what should be treated differently at all.</li>\n</ul>",
        "id": 153865767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483656134
    },
    {
        "content": "<p>it made me wonder about FHIR. Take the following statement:</p>\n<ul>\n<li>PII found in healthcare records is some of the most reliable available and has a good black market value</li>\n<li>in the FHIR specification, all information that can directly identify individuals is found in the following resources: Patient, RelatedPerson, Practitioner, Person. </li>\n<li>the personally identifying information can be found both in the resources, and additionally in HTTP logs of FHIR API access</li>\n<li>Note that for most practitioners, some identifying information is publicly available through national practitioner registries</li>\n<li>Though the other resources do not contain information that directly identifies an individual, the identify can be determined by matching the information with other databases (including some publically available) and generally needs to be treated with the same care</li>\n<li>De-identification of healthcare data is difficult and prone to causing data leaks or data quality issues</li>\n</ul>",
        "id": 153865775,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483656465
    },
    {
        "content": "<p>do people agree with that statement? would it be useful in the spec somewhere?</p>",
        "id": 153865777,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483656477
    },
    {
        "content": "<p>Yes</p>",
        "id": 153865811,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1483660285
    },
    {
        "content": "<p>For the second bullet, is it worth calling out \" - including when these are 'contained' within other resources\".  As well, this information may show up in narratives, extensions and/or Reference.display elsewhere.</p>",
        "id": 153865816,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483660609
    },
    {
        "content": "<p>yes worth calling out both of those things</p>",
        "id": 153865817,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483660685
    },
    {
        "content": "<p>Would there be utility in an explicit ability to flag data elements as containing PHI?  It should be possible to do this in some cases at the international level and tighten it further in IGs.  (Not sure if we should treat Patient information as PHI if it's about a cow or a chicken?)</p>",
        "id": 153865818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483660712
    },
    {
        "content": "<p>In fact, we could categorize elements as both PII and PHI, with values of \"always\", \"never\" and \"potential\" - with potential items being constrainable to \"always\" or \"never\" in IGs based on the element use.</p>",
        "id": 153865819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483660816
    },
    {
        "content": "<p>I think we do it by resource - one of the name resources, a resource in one their compartments, and other resources </p>",
        "id": 153865820,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483660937
    },
    {
        "content": "<p>Grahame, We do express these things on the Security page. I welcome improvements. </p>",
        "id": 153865890,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483707189
    },
    {
        "content": "<p>PII (there are various acronyms) -- They are all defined as Identifiers bound with Information. If you break the bind between information and identifiers then you just have data and identifiers. This is fundimentally what De-Identification does, it breaks the binding. Of course De-Identification is a process to reduce the risk to an a project defined level, for a project defined purpose, and a project defined environmnet. So the only automatic algorithm for de-identification is | /dev/null</p>",
        "id": 153865891,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483707339
    },
    {
        "content": "<p>Adding to that... note that many elements found in the 'other' resources carry enough information to uniquely identify patients. These are the \"Indirect\" or \"Quasi\" identifiers that De-Identification processes will warn you about.  This is just a fact of medical data, it is descriptive about the subject. Thus de-identification as a process to reduce risk, one that never gets to zero (exception /dev/null)</p>",
        "id": 153865892,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483707721
    },
    {
        "content": "<p>This is also why I have tried, however feeble, to get Patient, Practitioner, Person, and RelatedPerson to be thinner.. that is more focused on identification, and less 'information'. It is true that one can remove elements from within a Resource, but it is much easier to kill the Reference to break the bind between identifier and data. --- On this topic, I think these Resources are good. ---- Putting a \"Security Considerations\" in the four Resources might be helpful to our reader. </p>",
        "id": 153865893,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483707758
    },
    {
        "content": "<p>article on the topic <a href=\"https://healthcaresecprivacy.blogspot.com/2015/02/is-it-really-possible-to-anonymize-data.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2015/02/is-it-really-possible-to-anonymize-data.html\">https://healthcaresecprivacy.blogspot.com/2015/02/is-it-really-possible-to-anonymize-data.html</a></p>",
        "id": 153865895,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483707833
    },
    {
        "content": "<p>We might find it useful, and I expected the RDF efforts to help tag each element within each Resource in a way that helps with automated De-Identification. The first step of De-Identification is to create a total inventory of all elements, then classify those elements as : Direct-Identifier, Quasi-Identifier, and Data. This is the first step, as one then knows they must remove (or change) the Direct-Identifiers; and they must address the risk presented by the Quasi-Identifiers.</p>",
        "id": 153865896,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483708054
    },
    {
        "content": "<p>BUT we must all recognize that, medical data is about the subject, so medical data is almost always Quasi-Identifier. If it was not, then it would not be useful medical data... Somewhat self defining for healthcare.... SO, Quasi-Identifiers are on a spectrum of risk. For example body weight is mostly just data, unless it is on the extreme of the spectrum then it quickly approaches being an identifier.</p>",
        "id": 153865897,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483708205
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> We have tags for data that has been de-identified... this because of the above fact that medical data is by definition always about the subject. Hence why _confidentialiity \"N\" is actually on a IT security scale, way up in 'highly sensitive' space... We start in the highly sensitive security space, and go higher or lower based on the data, the patient, the situation, etc.</p>",
        "id": 153865898,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483708383
    },
    {
        "content": "<p>Just realized that my words might seem to be discouraging of the original proposal to update the FHIR specification. I didn't mean to discourage improvement. I just get overly worried about specification text that is trying simply to inform and warn, becoming perceived and used as if it was  normative. Security and Privacy are hard... (as is safety, treatment, etc)...</p>",
        "id": 153865900,
        "sender_full_name": "John Moehrke",
        "timestamp": 1483713144
    },
    {
        "content": "<p>well, when i look at the security page, I don't see it directly addressing this, and my text proposed above would go to the security page. And I agree that it would be useful to reference the note from the 4 identifying resources</p>",
        "id": 153865932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483735464
    },
    {
        "content": "<p>I don't think that any of your comments invalidated the original idea, though they did suggest word-smithing improvements to it </p>",
        "id": 153865933,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483735499
    },
    {
        "content": "<p>I'm skeptical that there's value to defined in classifying the elements in regard to \"Direct-Identifier, Quasi-Identifier, and Data\". I think it's more useful to classify the resources. But if you wanted to go and do that, we certainly can do it, and RDF is the way that this stuff would manifest best (though it would find it's way into the structure definitions too)</p>",
        "id": 153865934,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483735585
    },
    {
        "content": "<p>Practitioner does have information that identifies the provider, but since it is not linked to any health information about them as a patient, is it really PII?</p>",
        "id": 153865940,
        "sender_full_name": "Mike Robert",
        "timestamp": 1483736181
    },
    {
        "content": "<p>PII isn't necessarily healthcare specific. It's any identifying info.</p>",
        "id": 153865942,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1483736895
    },
    {
        "content": "<p>IE: if I had your birthdate and mother's maiden name, I could probably do some wicked social engineering hacks and steal things</p>",
        "id": 153865943,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1483736926
    },
    {
        "content": "<p>The healthcare data (PHI) could be used for other nefarious plans, but that may or may not be the target</p>",
        "id": 153865944,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1483736991
    },
    {
        "content": "<p>Good points, thanks.</p>",
        "id": 153865948,
        "sender_full_name": "Mike Robert",
        "timestamp": 1483738114
    }
]