[
    {
        "content": "<p>Anyone know if there's a link from <a href=\"http://hl7-fhir.github.io/observation.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/observation.html\">Observation</a> to the order it is fulfilling (i.e., OBR-2 Placer Order Number in v2)? We want to carry the placer number through to results and I'm not seeing where it would go. Perhaps I'm just having a senior moment. <img alt=\":older_man:\" class=\"emoji\" src=\"static/third/gemoji/images/emoji/older_man.png\" title=\":older_man:\"></p>",
        "id": 153815876,
        "sender_full_name": "Burke Mamlin",
        "timestamp": 1458156958
    },
    {
        "content": "<p>OBR corresponds to DiagnosticReport, and that has the link</p>",
        "id": 153815887,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458161039
    },
    {
        "content": "<p>Plan is for Observation to be able to point to it's corresponding Order - that will be part of the fallout from the Workflow process</p>",
        "id": 153815925,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458168239
    },
    {
        "content": "<p>OK that little nugget I missed  - how exactly are we proposing to do that and If we go that route the I think the mash up of DR and Obs is essentially complete and we don't need both. </p>",
        "id": 153815958,
        "sender_full_name": "Eric Haas",
        "timestamp": 1458177094
    },
    {
        "content": "<p>Every \"event\" type resource that can be the result of a request should have a \"request\" (or equivalent) element 0..* Reference(varies) that points to the request resource that could have resulted in that action (orders, encoded orders, reflex orders, recommendations, plans, proposals, etc.).  In this case, I'd expect DiagnosticOrder, ReferalRequest, ProcedureRequest and CarePlan at a minimum.</p>",
        "id": 153815960,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458179020
    },
    {
        "content": "<p>It may be that DR isn't needed anymore, I don't know.  But certainly you're not going to have a DR just because someone made an order.</p>",
        "id": 153815962,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458179066
    }
]