[
    {
        "content": "<p>We have been looking into how to represent a planned and booked admission (to be admitted to a ward as an inpatient). If you look at an IP waiting list, this could be one of the rows. </p>\n<p>As a comparison, a planned or booked appointment can both be represented using the Appointment resource. This may later result in a visit to the hospital (Encounter resource). </p>\n<p>How should we represent:<br>\n1. A planned admission (no admission date decided, but on an IP waiting list)<br>\n2. A booked admission (an admission date/TCI date has been decided, likely also the ears <br>\nOur initial idea was/is to use the Appointment resource also for this, and create an Encounter on admission. Is this correct?  </p>\n<p>Or should Appointment be seen as only for outpatient settings, and not a planned/booked ward stay? If so, what resource should be used?</p>\n<p>Thanks!</p>",
        "id": 166278207,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1558538483
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 166278784,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558538773
    },
    {
        "content": "<p>Encounters are meant to be used for any kind of encounter. The description of Encounters states that this covers the life cycle of encounters starting with the pre-admit. Encounter.status has the option 'planned' and as such would go a long way. <br>\nIn general the use of scheduling resources like Appointment would only add value if you're really doing resource scheduling, with schedules/blocked slots.  etc. Appointment.status does have a 'wait-list' value, and in effect that status is the one you'd need prior to a pre-admit or admit.<br>\nSo, IMHO, waiting-list = Appointment, booked admission = pre-admit = Encounter.</p>",
        "id": 166337220,
        "sender_full_name": "René Spronk",
        "timestamp": 1558594339
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> Pre-admit is intended for situations where you're doing billable work against the encounter before the actual admission.  This could include pre-admission paperwork, room preparation, etc.  It's <em>not</em> intended to act as a placeholder for a visit that's scheduled.  Appointment supports both proposed and booked appointments.  Proposed appointments can exist that don't have a time/date specified.  So I would lean towards Appointment, status=proposed, no dateTimes for wait-list and Appointment=booked for booked admissions.</p>",
        "id": 166367647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558622884
    },
    {
        "content": "<p>Hmm. Encounter.status being planned means just that - planned (according to the value set, and the text for the Encounter resource). In your context that could be the equivalent of a pre-admit (and financial stuff) but it needn't be. <br>\nYes, you could do an Appoint with status 'proposed' without any date/time, and that would be kind of a waiting list. Given that there is an explicit status code 'wait-list' for Appointment that's probably a better fit than 'proposed'. Proposed has all sorts of workflow consequences for scheduling applications, it's meant to trigger them to create AppointmentResponses.</p>",
        "id": 166368523,
        "sender_full_name": "René Spronk",
        "timestamp": 1558623447
    },
    {
        "content": "<p>Ah.  Missed waitlist - that's definitely a better status.  \"Encounter instances may exist before the actual encounter takes place to convey pre-admission information, including using Encounters elements to reflect the planned start date or planned encounter locations. In this case the status element is set to 'planned'.\"  That's not the same as a wait-list scenario.  That said, we should wait for a response from <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> as his work group is responsible for both resources.</p>",
        "id": 166374835,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558627417
    },
    {
        "content": "<p>Very good and useful input!</p>\n<p>To summarize a bit, and this makes sense to me:</p>\n<ul>\n<li>Encounter.status=planned is intended for pre-admission activities occurring before the patient arrives to the hospital, and those could be billable. </li>\n<li>Appointment.status=waitlist is intended for a patient that is waiting for an appointment to be booked but no time is yet decided</li>\n<li>Appointment.status=booked is intended for a patient who has received a time for their appointment, and also then a TCI date for admission.</li>\n</ul>\n<p>To me this makes sense, and it also clearly divides the responsibility between the planning/booking phase (belonging to the Appointment), and the outcome phase (what is actually done, belonging to the Encounter). </p>\n<p>Scheduling of resources is also very important. And In my head, that belongs to the Appointment (which is also what <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> is getting at), even for IPs as I would see bed capacity as a resource that is needed in a similar way as I would see a doctor being needed for an OP appointment. Do you share this view?</p>\n<p>I also feel there are benefits with using Appointment for both OP and IP as you can work with the same resources in your planning phase. If you need to book a ward stay, you look at Appointment with status=waitlist, same as you would for an OP appointment. </p>\n<p>It is also important to be able to differentiate planning from actual outcome data. The intended planned length of an appointment needs to be separated from the duration of the encounter. Using Encounter.period together with Encounter.status=planned for the intended length of stay is not a good idea as that will get overwritten with the actual start/end when the encounter starts (status=arrived/in-progress).</p>\n<p>The actual use case we are looking at now is an elective surgery. It seems clear that an Appointment is needed in a room at the surgery department,  but we are considering whether to have a separate Appointment for the ward stay as they likely are not always planned and booked together (appointment for procedure could be booked, but there are no beds available to book at the ward, or vice versa).</p>",
        "id": 166453084,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1558705137
    },
    {
        "content": "<p>As for you summarization, I'd agree with those resources and status codes shown at the top of your post (but mind you, we haven't heard from the actual working group responsible for these resources). <br>\n<a href=\"https://vimeo.com/305046230\" target=\"_blank\" title=\"https://vimeo.com/305046230\">https://vimeo.com/305046230</a> is an intro level tutorial about scheduling. Scheduling has a wide range of functionality, and involves all sorts of resources, one of which may be the patient (but there doesn't have to be a patient at all). Appointment is for IP, OP, telephone call, skype consult, surgery, or whatever else you can think of.</p>",
        "id": 166454468,
        "sender_full_name": "René Spronk",
        "timestamp": 1558706070
    },
    {
        "content": "<p>It's certainly possible to book multiple appointments for an overall event if you need different \"resource sets\" for different slots.  (The surgical suite would need to be booked for a different period of time than the recovery room or the ward)</p>",
        "id": 166460218,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558709788
    },
    {
        "content": "<p>All the above makes sense. <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span><br>\nMaking it easy for me.</p>",
        "id": 168923428,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1561455918
    }
]