[
    {
        "content": "<p>I'm trying to wrap my head around where the triggers specified within each <code>action</code> element of a PlanDefinition resource would actually be used in a workflow.  I understand that a <code>PlanDefinition</code> is meant to define a set of possible actions that are patient-agnostic.  I also understand that executing the <code>$apply</code> operation is meant to generate the corresponding request resources like <code>CarePlan</code> and <code>RequestGroup</code> which can be focused on a Patient context.  But those request resources don't contain any <code>TriggerDefition</code>-valued elements, so it appears triggers only appear at the definitional level.</p>\n<p>How is this expected to work in practice?  The documentation on <a href=\"https://www.hl7.org/fhir/workflow.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/workflow.html\">Workflows</a> and <a href=\"https://www.hl7.org/fhir/plandefinition.html#12.18.3.3\" target=\"_blank\" title=\"https://www.hl7.org/fhir/plandefinition.html#12.18.3.3\">applying a PlanDefinition</a> don't say much about triggers.  Is the expectation that triggers are registered when a <code>PlanDefinition</code> is created and then indirectly referenced by the corresponding request resources (e.g., via  <code>RequestGroup.instantiatesCanonical</code>) after the <code>$apply</code> operation has been called?  It seems like either the documentation could use some clarification on this topic (a possibility) or I am missing something (pretty likely).  Any thoughts are appreciated!</p>",
        "id": 179262086,
        "sender_full_name": "David Winters",
        "timestamp": 1572288188
    },
    {
        "content": "<p>The trigger element is intended to represent a fairly broad set of use cases: 1) a named-event, conceptually the same as the \"hook\" pattern in CDS Hooks, i.e. a named, pre-coordinated event understood by both sides of the interaction. 2) a data-event, patterned after database triggers, and 3) a periodic trigger, which would be invoked by a scheduler. As far as when any of those are actually invoked, that's really a part of the implementation strategy. The most common use case I've seen applied is the first one, and it is generally (though not always) mapped directly to a CDS Hooks hook definition. We are also working on aligning the trigger element in R5 with the upcoming changes to the subscription resource, so that will result in some changes to the trigger element.</p>",
        "id": 179288099,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1572306825
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>; your response confirms my understanding after reading <a href=\"http://www.hl7.org/fhir/clinicalreasoning-cds-on-fhir.html#representing-hooks\" target=\"_blank\" title=\"http://www.hl7.org/fhir/clinicalreasoning-cds-on-fhir.html#representing-hooks\">the clinical reasoning documentation</a>.  I'll take another look at that and see if I have any other gaps in my understanding.</p>",
        "id": 179320226,
        "sender_full_name": "David Winters",
        "timestamp": 1572348454
    }
]