[
    {
        "content": "<p>Hi<br>\nI was looking into the medication domain. What resource should be used for planned administrations? E.g. a patient should be given a tablett of drug x this evening at 20.00?</p>\n<p>The MedicationAdministration resource contains a MedicationAdministrationStatus element, but does not have a Planned status. </p>\n<p>It feels strange to use the MedicationDispense resource as nothing has been dispensed (it does not have a planned state either), and the dispensing feels like something else than a planned administration. </p>\n<p>How should this use case be handled? </p>\n<p><a href=\"https://www.hl7.org/fhir/medicationadministration.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/medicationadministration.html\">https://www.hl7.org/fhir/medicationadministration.html</a> <br>\n<a href=\"https://www.hl7.org/fhir/valueset-medication-admin-status.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-medication-admin-status.html\">https://www.hl7.org/fhir/valueset-medication-admin-status.html</a><br>\n<a href=\"https://www.hl7.org/fhir/medicationdispense.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/medicationdispense.html\">https://www.hl7.org/fhir/medicationdispense.html</a></p>\n<p>Thanks!</p>",
        "id": 154022421,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1543820123
    },
    {
        "content": "<p>You should use a MedicationRequest.  You are request that a patient receive a medication.  on the request, you would not have a dispenseRequest section as no dispensing is being requested.  you would set the MedicationRequest.intent to 'plan'.</p>",
        "id": 154022426,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1543824989
    },
    {
        "content": "<p>MedicationAdministration and MedicationDispense are actual events that has taken place.  MedicationRequest is an request for a medication.  It has an intent attribute that includes \"planned\".</p>",
        "id": 154022529,
        "sender_full_name": "Melva Peters",
        "timestamp": 1543852785
    },
    {
        "content": "<p>Thanks for the answers! I looked at the intent element on MedicationRequest:</p>\n<p><strong>proposal</strong>    The request is a suggestion made by someone/something that doesn't have an intention to ensure it occurs and without providing an authorization to act<br>\n<strong>plan</strong>    The request represents an intension to ensure something occurs without providing an authorization for others to act<br>\n<strong>order</strong>   The request represents a request/demand and authorization for action<br>\n<strong>instance-order</strong>   The request represents an instance for the particular order, for example a medication administration record.</p>\n<p>I see two use cases here: <br>\n<strong>1. The clinician says \"patient x should have 2 tablets of drug y 3 times per day for one week\" </strong>(I see this as the actual \"prescription\")<br>\n*Would this be a MedicationRequest with intent=order?</p>\n<p><strong>2. The nurse is presented with an administration chart of all the planned administrations for patient x, e.g. \"2 tablets of drug y at 6am\", \"2 tablets of drug y at 12am\" and \"2 tablets of drug y at 6pm\"</strong><br>\n*Wouldnt this be three separate resource instances? (This is the case I asked about in my initial question.)<br>\n*You seem both to suggest to set <em>MedicationRequest.intent=plan</em>, but the description for plan doesnt seem to fit this use case (there is authorization by the clinician to act). Could this be seen as three instances of MedicationRequest with <em>intent=instance-order</em>?</p>",
        "id": 154022776,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1543934360
    },
    {
        "content": "<p>Yes, both of your examples would be an actual order and not a plan.  A MedRequest with intent=plan would be more akin to a clinician reviewing your health problems and saying \"you should start taking low-dose aspirin once a day\".  There is no authorization implied, but the hope is that the patient will follow the instructions.</p>",
        "id": 154022803,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1543942707
    },
    {
        "content": "<p>The intent=instance-order is intended to create separate entries on to a Medication Administration Record for your 2nd use case.</p>",
        "id": 154022885,
        "sender_full_name": "Melva Peters",
        "timestamp": 1543955067
    },
    {
        "content": "<p>instance-order was introduced exactly for that purpose: \"a patient should be given a tablet of drug x this evening at 20.00\"</p>",
        "id": 154023891,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1544348577
    }
]