[
    {
        "content": "<p>PlanDefinitions have actions and possibly sub-actions.  Actions may also contain input and output dataRequirements.   My question is if there is a defined mechanism for context between actions? </p>\n<p>For instance, if I have a trigger event on an action and that trigger can provide me with the Resource that it was created for is there a way to share that Resource information (context) with other actions.  So if the event fired because of a new Condition and the input requirements for additional actions contained a Condition is there a means to set the Condition that triggered the event to that which is required as the input for the other actions? </p>\n<p>Another example comes from a project that I am working on where there are actions that are defined to create different types of reports (FHIR Bundles).   The output dataRequirement for that action is Bundle.  Is there a way to share that with other actions such as validate-report, encrypted-report, send-report .... ? </p>\n<p>Or is this something that is left to IG's to define how they use PlanDefintion for workflow and eca-rules?</p>",
        "id": 225087910,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1612388941
    },
    {
        "content": "<p>Bumping this back up to the top incase anyone has ideas</p>",
        "id": 225753076,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1612902813
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 225776828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612915613
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214452\">@Rob Dingwell</span> , the input/output data elements were introduced to support this type of data flow between actions, but the base specification isn't prescriptive about how it works. There's an example <a href=\"http://build.fhir.org/ig/HL7/cqf-recommendations/PlanDefinition-cpg-common-registration.xml.html\">here</a> of a registration process that does similar things to what you are describing and uses the input/output data elements to coordinate data between the actions. A lot of the behavior is implied though, so would welcome feedback on how to make that more explicit.</p>",
        "id": 225790760,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1612928260
    },
    {
        "content": "<p>We've also agreed to introduce the notion of a \"name\" to the input/output data requirements in the PlanDefinition: <a href=\"https://jira.hl7.org/browse/FHIR-27752\">https://jira.hl7.org/browse/FHIR-27752</a></p>",
        "id": 225790924,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1612928454
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> .  I'll take a look at the jira issue and see what is being proposed</p>",
        "id": 225894501,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1612985512
    }
]