[
    {
        "content": "<p>I'd like to ask for some opinions on the use of the address for a temporary \"future\" destination visa vis using Q/QR.  The use case is a review of a patient's vaccination requirements for a specific country for upcoming travel.  One approach is to use Patient.address.use = \"temp\", Patient.address.country for the destination the patient intends to travel, and perhaps using Patient.address.period for a future period.  The other approach is to use Observation through Q/QR using some agreed to Observation.Code to represent the destination.  Both have challenges, particularly having a very vague address on a patient that may never materialize, unless a new use of \"planned destination\" would be added.  Q/QR may be more appealing as there would be a form in play, so it could be done as part of the questions rather than the patient's demographics.  Any pros/cons for either approach, or alternative are welcome.  Thank you!</p>",
        "id": 153971874,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1530036132
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191418\">@Joginder Madra</span> <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> ?</p>",
        "id": 153971885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530036847
    },
    {
        "content": "<p>We talked a bit about this today the first thought is that it does not strike us as something that is immunization-specific.  Our conversation naturally gravitated around Patient.address.use, but it does sound like there is a whole other interaction here that goes beyond stating a temporary address</p>",
        "id": 153971975,
        "sender_full_name": "Joginder Madra",
        "timestamp": 1530048952
    },
    {
        "content": "<p>It would not be immunization specific, but that is the one that started the discussion, e.g., \"I'm traveling to XYZ next month, what should I be current on - required, recommended, etc.\".  Other use cases with a \"future\" \"temporary\" address could surely be found.  Including potentially such temporary, future destinations as a search parameter works, but if you want to record what was used, then we are back to having it part of a resource.  Let's see whether others pick up this question.</p>",
        "id": 153971983,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1530051133
    },
    {
        "content": "<p>My leaning would be Observation where the effective time is in the future</p>",
        "id": 153972025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530076665
    }
]