[
    {
        "content": "<p>This part of the regs.... \"FHIR Bulk Data Access (Flat FHIR) (v1.0.0: STU 1), including mandatory support for the “group-export” “OperationDefinition”\"   What are minimum required resources that we must support?   I see USCDI and US Core Guide... but that seems like a lot of search criteria to support.  Does anyone know what the minimum search resources/categories that we must support on this type of request?</p>",
        "id": 192318711,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1585603215
    },
    {
        "content": "<p>The US code resources  making up the USCDI set. There are no search criteria in bulk export though, you have just to support the export of those resources.</p>",
        "id": 192319457,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1585603646
    },
    {
        "content": "<p>So is the supported resource exported completely based off the group i pre-determine?   I.e    Let's say group is all patients on zoloft.   Then choose to bulk export their demographics. I get the full demographics for all the patients meeting the group criteria?</p>",
        "id": 192320734,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1585604338
    },
    {
        "content": "<p>Yes</p>",
        "id": 192323391,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1585605958
    },
    {
        "content": "<p>The way you implement groups is up to you though, there are no requirements for that</p>",
        "id": 192323464,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1585605982
    },
    {
        "content": "<p>In our server we do not support defining groups using criteria</p>",
        "id": 192323485,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1585606004
    },
    {
        "content": "<p>Thanks for the responses.   I don't want to confuse the ePHI export criteria which is in effect in 36 months with the Population Query (g)(10) and what parameters need to be supported here.  I'm specifically looking for g 10 population query information no, ePHI bulk export.  Thanks.</p>",
        "id": 192326703,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1585608137
    },
    {
        "content": "<p>For the non-bulk API you have to support whatever US Core specifies, so yes, all those search parameters etc.</p>",
        "id": 192330132,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1585611090
    }
]