[
    {
        "content": "<p>I'm wondering how people are populating Encounter.location when multiple \"levels\" of locations are known. If a patient is in a bed which is in a room which is in a ward (I'll cut off the example at this level, but it could extend further upwards), are all of those Location resources expected to be listed in Encounter.location or is only the most granular location populated and then the hierarchy determined based on Location.partOf (assuming that Location.partOf for the bed points to the Location resource for the room and that Location.partOf for the room points to the Location resource for the ward, etc)? We are trying to figure out how to translate PV1-3 of a v2 message into Encounter.location. Thanks.</p>",
        "id": 175247736,
        "sender_full_name": "Craig Newman",
        "timestamp": 1568040084
    },
    {
        "content": "<p>I'm currently struggling with the very same dilemma. I did note that the last Encounter example in R4 has a location which wraps Ward, Room, and Bed all into the same Location Resource (Correction: Location element, the reference is only used for the display and there is no external resource) .</p>\n<div class=\"codehilite\"><pre><span></span>{\n      &quot;location&quot;: {\n        &quot;display&quot;: &quot;Ward 1, Room 42, Bed 1&quot;\n      },\n      &quot;status&quot;: &quot;active&quot;,\n      &quot;period&quot;: {\n        &quot;start&quot;: &quot;2017-02-01T09:27:00+10:00&quot;,\n        &quot;end&quot;: &quot;2017-02-01T12:15:00+10:00&quot;\n      }\n    }\n</pre></div>",
        "id": 175401010,
        "sender_full_name": "Angus Millar",
        "timestamp": 1568177247
    },
    {
        "content": "<p>Typically only the most granular is captured.  The hierarchy is reflected in the location definition and doesn't need to be communicated in the instance.</p>",
        "id": 175427361,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568206169
    },
    {
        "content": "<p>The hierarchy can be searched using the part-of search parameter.</p>",
        "id": 175427481,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568206225
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> is part-of recursive?  I.e. if A is part of B is part of C is part of D, will a search for part-of=D include locations A, B and C?</p>",
        "id": 175427548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568206285
    },
    {
        "content": "<p>(if not, is it reasonable to make it so?)</p>",
        "id": 175427571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568206306
    },
    {
        "content": "<p>This has not been defined, but something that I would like to discuss with Fhir I<br>\nFor org, loc and encounter.<br>\nAs I'm sure there are other resources that fit this pattern.<br>\nIs very similar to Hierarchy terminologies</p>",
        "id": 175681230,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1568431122
    }
]