[
    {
        "content": "<p>Hi!<br>\nI have a question regarding if it is possible to set use case based rules in profiles. I want to use the same profile but for different use cases and want a certain element or attribute to be mandatory/optional.<br>\nHere is one example:<br>\nProfile on the encounter resorce: First time when posting the encounter we need the start time on the period.start attribute and we need status=in-progress. When updating the encounter with status=finished we want to require an end time. Is it possible to somehow connect the cardinality on the period.end attribute to be 0..1 when status=in-progress and 1..1 when status=finished?<br>\nDo anyone have a suggestion on how to solve this? Maybe by applying implicitRules?</p>",
        "id": 202085825,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1593176211
    },
    {
        "content": "<p>Seems like you can add an invariant in your profile</p>",
        "id": 202089534,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593178216
    },
    {
        "content": "<p>Invariant can only make use of data within the instance - it can't make use of environmental context (e.g. whether something is sent as a POST or PUT, or what system a request is coming from).  You can express such rules in text in a profile, but there's no way to enforce them computably with a single profile - you'd need multiples.  And even then, you'd need extensions in your CapabilityStatement to allow declaring distinct profiles for different usage contexts</p>",
        "id": 202095015,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593180573
    },
    {
        "content": "<blockquote>\n<p>period.end attribute to be 0..1 when status=in-progress and 1..1 when status=finished?</p>\n</blockquote>\n<p>this could be done inside the instance, if that is all it is required, right?</p>",
        "id": 202096229,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593181135
    },
    {
        "content": "<p>With that in mind, this sounds like 2 different types of transactions and thus 2 profiles.</p>",
        "id": 202096301,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593181165
    },
    {
        "content": "<p>Yes, but what needs to be true on create vs. update couldn't be</p>",
        "id": 202097230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593181604
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 202343173,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1593451842
    }
]