[
    {
        "content": "<p>Hi everyone</p>\n<p>We are mapping existing consult note data to FHIR. As the clinical notes resource isn't in FHIR spec at the<br>\nmoment, we've decided to use the DocumentReference resource as the resource to map to.</p>\n<p>In our application, when a user goes to create a Consult Note, they first select the patient, and then create the consult note attached to that patient. It is not linked to anything like an appointment or a procedure, just a patient. The format of the consult note is not structured data, it is a series of \"headings\" or \"questions\" and then the responses/answers in text format under each heading.</p>\n<p>What we're looking for is some kind of sense check or feedback on the mapping that we've done. We're hoping to get some of that here. We have already completed fairly extensive mapping exercises in house, but feel a wider community opinion will be useful too. </p>\n<p>Attached below is the structure.</p>\n<p><a href=\"/user_uploads/10155/VBJtmDa4V7kbmoP7jDzhawP9/consultNoteStructure.jsonc\">consultNoteStructure.jsonc</a></p>",
        "id": 230807954,
        "sender_full_name": "Ernus",
        "timestamp": 1616037300
    },
    {
        "content": "<p>Using DocumentReference for capturing consult notes is consistent with industry choice.  However, having different attachments for each section is unusual.  Typically you'd just have a text document, a PDF document, a CDA document or perhaps all of the above - each representing different renderings of the same content.  Most systems won't know how to render multiple sections coming from distinct attachments.</p>",
        "id": 230810044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616039273
    },
    {
        "content": "<p>(And kudos on reaching out to the community to double-check your design <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span> )</p>",
        "id": 230810106,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616039304
    },
    {
        "content": "<p>Lloyd, are you implying that each content entry is a different representation of the same content or can it be different parts?  \"There may be multiple content element repetitions, each with a different format.\"  Maybe I am not reading that correctly.</p>",
        "id": 230814590,
        "sender_full_name": "Andy Bond",
        "timestamp": 1616044123
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"398280\">Ernus</span> <a href=\"#narrow/stream/179166-implementers/topic/Possible.20Clinical.20Notes.20alternative/near/230807954\">said</a>:</p>\n<blockquote>\n<p>The format of the consult note is not structured data, it is a series of \"headings\" or \"questions\" and then the responses/answers in text format under each heading.</p>\n</blockquote>\n<p>Are these headings/questions formalized somewhere, or could they be? Would QuestionnaireResponse be appropriate?</p>",
        "id": 230819439,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616049414
    },
    {
        "content": "<p>I think what lloyd is saying is the DR would typcical point to single endpoint that represent the whole thing(e.g. one pdf), not several endpoint each represent a different sections.</p>",
        "id": 230876143,
        "sender_full_name": "Eric Haas",
        "timestamp": 1616079040
    },
    {
        "content": "<p>for example see the section in <a href=\"http://hl7.org/fhir/us/core/clinical-notes-guidance.html\">US Core</a>  and the example there...</p>",
        "id": 230876492,
        "sender_full_name": "Eric Haas",
        "timestamp": 1616079161
    },
    {
        "content": "<p>and here is an example transaction to fetch a clinical note that is a pdf: <a href=\"http://build.fhir.org/ig/HL7/davinci-ecdx/specification.html#scenario-3\">http://build.fhir.org/ig/HL7/davinci-ecdx/specification.html#scenario-3</a></p>",
        "id": 230877172,
        "sender_full_name": "Eric Haas",
        "timestamp": 1616079386
    },
    {
        "content": "<p>DocumentReference has support for multiple documents, but that is generally thought of as a JPEG for each page of a multipage document, or different formats of the same document. You may want to also look at DiagnosticReport, which is probably a little richer for your use case, but in FHIR R4 doesn't support \"sections\".  To support structured documents/sections/hierarchy, right now, the main contender is Composition.</p>",
        "id": 230902764,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1616087412
    }
]