[
    {
        "content": "<p>Is it possible to include entities that are not directly related to the current entity, but related through a related entity? </p>\n<p>My scenario is I have a Task that is related to an Encounter and the Encounter has a few Observation relations. How can I, in one query, get the task including the Encounter and the Observations?</p>\n<p>I have been looking at the _include query syntax and docs, but I am unsure if this is the right approach.</p>",
        "id": 223904797,
        "sender_full_name": "Jonas Toft",
        "timestamp": 1611585306
    },
    {
        "content": "<p><code>_include:iterate</code> - if the server supports it</p>",
        "id": 223905324,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1611585542
    },
    {
        "content": "<p>GET /Task?_include=Task.encounter&amp;_revinclude:iterate=Observation.encounter - if you wish to define specific criteria on either Observation or Encounter it gets a bit more tricky, as -(rev)includes don't allow for the expression of any conditions.</p>",
        "id": 223905337,
        "sender_full_name": "René Spronk",
        "timestamp": 1611585550
    },
    {
        "content": "<p>Thanks for the swift reply. Yes, filtering on a criteria would actually be my next investigation to do. Imagine I wanted to only retrieve the Task entities (and relations) related to a specific Organization. Is something like the below even possible/intended use?</p>\n<p>Task?_filter = Task:requester:Organization.identifier eq my_organization_id &amp;_include=Task:encounter&amp;_include=Task:requester:Organization</p>",
        "id": 223909507,
        "sender_full_name": "Jonas Toft",
        "timestamp": 1611587300
    },
    {
        "content": "<p>Support for _filter is pretty rare in servers (so I'm not very familiar with its syntax), and this can probably be supported by regular search in FHIR ..</p>",
        "id": 223911805,
        "sender_full_name": "René Spronk",
        "timestamp": 1611588293
    },
    {
        "content": "<p>As you can probably understand, FHIR is new to me. You refer to a regular search, but I dont know what that is. I did read through the docs at <a href=\"https://www.hl7.org/fhir/search.html\">https://www.hl7.org/fhir/search.html</a>, but did not find any evident answers. In essens I am trying to find out if it is possible to do several \"joins\" and combine that with filtering on any of the joined entities, and returning the entities from the joins. The SQL equivalent would be SELECT x.a,z.b,y.c FROM x JOIN y on x.id=y.id JOIN z on z.Id = x.Id where z.id=\"z_id\"</p>",
        "id": 223941064,
        "sender_full_name": "Jonas Toft",
        "timestamp": 1611599922
    },
    {
        "content": "<p>FHIR doesn't presume that the underlying data is relational.  FHIR's RESTful search mechanism is focused on a single resource.  Including additional resources is possible with _include or _revinclude.  However, there's no ability to include anything that doesn't have a direct relationship.  So if you want to include A and C where A points to B and B points to C, there's no choice but to get B back as well.</p>",
        "id": 223943192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611601034
    },
    {
        "content": "<p>Basic search means: everything on <a href=\"http://build.fhir.org/search.html\">http://build.fhir.org/search.html</a> except for _filter and _query. Task?requester:Organization.identifier=XYZ&amp;_include=Task.encounter&amp;_include=Task.requester:Organization</p>",
        "id": 224014764,
        "sender_full_name": "René Spronk",
        "timestamp": 1611653338
    }
]