[
    {
        "content": "<p>Hi, </p>\n<p>I'm somewhat comfortable with the architecture behind the FHIR RestFUL exchange. I have a question regarding the related persons. Is there a way to designate the RelatedPerson as true being the power of attorney or do I need to make an extension for that resource to verify if the person has that status?</p>",
        "id": 153937399,
        "sender_full_name": "Akeem Leighton Foster Spencer",
        "timestamp": 1518624465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153937404,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518626229
    },
    {
        "content": "<p>How should FHIR define the power of attorneys A.K.A healthcare directives for a related person resource to a patient?</p>",
        "id": 153937409,
        "sender_full_name": "Akeem Leighton Foster Spencer",
        "timestamp": 1518627043
    },
    {
        "content": "<p>I see FHIR has a resource called \"Consent\", should this resource be referenced for validating whether a \"Related Person\" has access to receive information regarding the patient?</p>\n<p>Please advise if anyone is experienced enough and has an understanding in HIPAA compliance when it comes to treatment and conditions occurring to patients</p>",
        "id": 153938211,
        "sender_full_name": "Akeem Leighton Foster Spencer",
        "timestamp": 1518789022
    },
    {
        "content": "<p>I think you might want to look at Contract to record power of attorney</p>",
        "id": 153938227,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1518794000
    },
    {
        "content": "<p>Most systems don't actually transmit the full copy of the power of attorney - they just capture who has it.</p>",
        "id": 153938233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518795808
    },
    {
        "content": "<p>The Consent resource has included in scope the use-case where within a Consent a guardian is granted access, and where a guardian is the one approving a Consent.  As Lloyd has indicated the use-case for recording the legal facts of the Guardians \"Power of Attorney\" contract is not typical for a Healthcare system , or the subject of healthcare communications. It is possible the Contract resource could be used. The Contract resource is there to hold various business contracts.</p>",
        "id": 153938574,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519050073
    },
    {
        "content": "<p>contract can be a possible solution for the \"Design\" (opposed to transactional) aspects of GDPR.</p>",
        "id": 153938576,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519050176
    },
    {
        "content": "<p>but it may require more analysis.</p>",
        "id": 153938577,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519050286
    },
    {
        "content": "<p>e.g. there is a difference between a list of contracts and the list of processing activities.</p>",
        "id": 153938578,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519050354
    },
    {
        "content": "<p>We're going to begin modeling this for OurCareWishes in the next month.  The plan is to support both Contract and Consent.  I'm planning to start with the following fields.</p>\n<div class=\"codehilite\"><pre><span></span>Contract.action.text = &quot;Power of Attorney&quot;\nContract.agent.role.text = &quot;Attorney&quot;\nContract.agent.actor(RelatedPerson)\nContract.signer[0].signature.whoReference(Patient)\nConsent.sourceReference.reference(Contract)\n</pre></div>\n\n\n<p>Seems like the basic Power of Attorney is modeled by the Contract resource; and it has to be in place for the agent to provide Consent.  So, start with Contract, then move onto Consent when that's in place.</p>",
        "id": 153941088,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1519773538
    },
    {
        "content": "<p>I would agree that a Contract is possibly first needed.... but that agreement is based on an unclear 'need' to have the details of the Power of Attorney in a FHIR formatted form. What I am saying is that I don't think that most would ever spend energy putting that very specifically legal kind of a document into a FHIR format. It would be a legal ceremony held outside of healthcare, as it is broader than just healthcare. Yes the healthcare world does need to be informed that there is a legal standing, but that can be done administratively without the need for FHIR encoding. So I am not saying anything against the use of Contract for this purpose, only that we should not look to duplicate all data in a FHIR format.  I might indicate that the copy of the paperwork (really paper) be scanned and simply recorded as a DocumentReference--&gt;Binary; with specific metadata to indicate what the contents are, and that they are not medically relevant, but are administratively and authorization relevant.</p>",
        "id": 153941147,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519824103
    },
    {
        "content": "<p>When thinking about whether to use Contract, ask the question: \"Is the FHIR representation the sole or primary legal representation of this legal instrument?\".  Then ask \"Is there a more content-suitable resource that can satisfy the legal requirements?\".  If the answer to the first is \"yes\" and the answer to the second is \"no\", then you need Contract.  Not everything with legal force necessarily needs to be represented with Contract, even if the legal instrument only exists in electronic FHIR form.  And Contract isn't necessarily your only option.</p>",
        "id": 153941160,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519827650
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Thank you, to Lloyd's post, for the possibility of question #1 answered \"no\" and question #2 being \"no\", this would mean the legal documents supporting disclosure of information must be verified and double checked by the administrator on his/her discretion? The notary public or the IRB who witnessed the parties agree to the settlements in the documents, is that primary entity the administrator needs validation from before sending information to the related persons?</p>\n<p>I just want to understand the workflow when sending statuses to a RelatedPerson instance.</p>",
        "id": 153941190,
        "sender_full_name": "Akeem Leighton Foster Spencer",
        "timestamp": 1519834957
    },
    {
        "content": "<p>If the business case is just knowing that \"RelatedPerson has power of attorney\", all you need is a flag.  Someone looking at the resource would have as much (or as little) trust in the value of that flag as they have in the name, phone number or other information.  Any of that might have been verified by someone (e.g. looking at a drivers license) or not.  If knowledge of the verification is important, you can use Provenance to capture who did the verification and what the source information was, but in typical healthcare workflows, we don't bother with that level of overhead.  It's sufficient to be able to go back and see who set the flag and if there's an issue, to contact them.</p>",
        "id": 153941216,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519836756
    },
    {
        "content": "<p>We had requested to add additional codes to <a href=\"http://hl7.org/fhir/ValueSet/relatedperson-relationshiptype\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/relatedperson-relationshiptype\">http://hl7.org/fhir/ValueSet/relatedperson-relationshiptype</a> in the past and in response the binding of RelatedPerson.relationship was relaxed from Required to Preferred. So, we were able to use some additional codes from <a href=\"http://hl7.org/fhir/v3/RoleCode\" target=\"_blank\" title=\"http://hl7.org/fhir/v3/RoleCode\">http://hl7.org/fhir/v3/RoleCode</a>, e.g. GUARD (guardian) and POWATT (power of attorney)  in our implementation.</p>",
        "id": 153943852,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1520872483
    },
    {
        "content": "<p>I wouldn't want to discourage the improved handling of this information though. As we move towards electronic contract conveyance, eg. signed pdfs and smart contracts, they aren't all going to be on paper, and further identification of these in your 'contracts file' will be more efficient administratively for some than dumping them into a predominantly clinical document repository.</p>",
        "id": 153944166,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1520919470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Bit late to the party. We are also looking at how best to model the presence of LPoA (SNOMED codes) for a patient and who the attorney contacts are. Looking at the options discussed your flag proposal looks feasible. Would this include an extension that references the relatedPerson (contact) or is the suggestion that the provenance resource will carry the contact information? Can you expand on the proposal? Thanks</p>",
        "id": 153974575,
        "sender_full_name": "Simon Knee",
        "timestamp": 1531303071
    },
    {
        "content": "<p>There are two options.  If the power of attorney relationship is the only one you care about (i.e. you don't care that the LPoA is the mother/father/daughter/whatever of the Patient), then just use the RelatedPerson.relationship element.  If you need the personal relationship plus the fact this individual is the LPoA, then you'd use an extension to  convey that they're a LPoA.  Note that you only need to use RelatedPerson at all if you're expecting the person to be an actor in your system - authoring, reporting, receiving, etc.  If you just need contact information, use Patient.contact.</p>",
        "id": 153974642,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531317522
    }
]