[
    {
        "content": "<p>I was looking into Practioner today, and saw that it had no element containing a \"practioner type\" or similar. The use case we have is to be able to say that a practioner is a <em>doctor</em>, <em>nurse</em>, <em>physiotherapist</em> etc.</p>\n<p>Knowing that there is a PractionerRole I was also looking for a reference from Practioner 0..1 or 0..* to PractionerRole indicating what type of role the practioner has. </p>\n<p>Digging into the PractionerRole resource I found that it has exactly what we need as one of its elements, (<em>code</em> and the value set <a href=\"http://hl7.org/fhir/ValueSet/practitioner-role\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/practitioner-role\">http://hl7.org/fhir/ValueSet/practitioner-role</a>).</p>\n<p>I have a couple of questions related to this area...</p>\n<p><strong>Questions</strong><br>\n*How should we say that a practioner is a doctor, dietician, midwife etc?<br>\n*There is the Practioner.qualification element, is that what is intended for this use case? <br>\n<em>If the practioner.qualification element is to be used for this, which element should be used (</em>identifeir* and <em>code</em> seem to me overlapping)?<br>\n*Why is there a reference 0..1 from PractionerRole to Practioner? Seems very strange to me :)<br>\n*Shouldn't there be a reference to PractionerRole from Practioner for this use case?</p>\n<p>Thanks!</p>",
        "id": 169041573,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1561562905
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197234\">@Martin Grundberg</span> The PractitionerRole resource is used to say \"this Practitioner plays this Role at this Organization\".  If all you want to say is \"this Practitioner has the qualifications of a doctor\", then you don't need PractRole but can just use the Practitioner.qualification to indicate this.  You would put the Practitioner's license number in qualification.license (if you know it) and indicate that type of qualification in qualification.code (an example for doctor would be 'MD'.<br>\nThe linkage goes from the Role to the Practitioner which is why the references are the way they are.  One Practitioner can participate in multiple roles and those roles can come and go, so it doesn't make sense to put them on the Practitioner.</p>",
        "id": 169042627,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1561563623
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> !<br>\nWe will then start the simple implementation of just using Practioner.qualification.code and look at if we can find or create a good value set to bind to it. </p>\n<p>We also have a separate use case which is saying something like \"as a practitioner I want to act with role X in organization y\". This would be used when accessing the system or app to get the correct access, information etc. Sounds somewhat related to what the PractionerRole is intended for. Practioners can then act with different roles at different organizations, really regardless of their \"qualifications\".</p>",
        "id": 169044274,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1561564771
    },
    {
        "content": "<p>Yes. That is correct.</p>",
        "id": 169062061,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1561571266
    }
]