[
    {
        "content": "<p>PractitionerRole has specialty, but Practitioner does not.  That seemingly implies that the specialty doesn't follow the human being, but rather lives at the intersection of Practitioner performing a Service at a given Org/Location.  Is that correct?  Or, is it possible to use the Practitioner classification extension to specify specialty?</p>",
        "id": 153903988,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1504046725
    },
    {
        "content": "<p>Deciding this is going to run directly into the problematic question of do you mean \"licensed/certified\" to do something versus \"representing service (types) provided.\" If the former then it's a part of the practitioner but then that does not give clarity regarding what the person actually does. If it's about service (type) provided, then it can change per locality, but is very frequently the same for most or all localities. That ends up meaning implementers want to associate this with the practitioner BUT you also then need to select from the set of services \"available\" for any single location AND you have to understand that some services are not aligned with licensure/certification (may not need it or they just ignore the requirement - remember it's state-defined in the US), and what services are provided can change frequently. To make all this problematic, we essentially use the same phrases (which MIGHT mean code - typically NUCC Provider Taxonomy in the US) to describe the service and to describe the license. I'd love to see this all resolved by including speciality societies (aka CIIC) in the discuss to nail this down. Do you have a working plan for your approach?</p>",
        "id": 153904218,
        "sender_full_name": "Robert McClure",
        "timestamp": 1504194833
    },
    {
        "content": "<p>I think we'll need to raise this with PA in San Diego. I would expect Practitioner to have a list of credentials, the list of licenced/certified attributes of the person. I would then expect PractitionerRole to list the proper subset of those attributes which the provider is permitted to perform at the organization.<br>\nThe downside of this type of structuring is that you need to create/send/manage more small objects for what would in other spheres be a simpler cohesive structure or model.</p>",
        "id": 153904231,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1504208194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , I did log a tracker (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13786\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13786\">GF#13786</a>) on this topic.  Is it possible to pencil it into a PA quarter in San Diego?</p>",
        "id": 153904238,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1504211810
    },
    {
        "content": "<p>Either Wed Q1 or Q2 I think.</p>",
        "id": 153904373,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1504503934
    },
    {
        "content": "<p>I prefer Wed Q2 (if possible)</p>",
        "id": 153904501,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1504634315
    }
]