[
    {
        "content": "<p>What is the purpose of the active field in Practitioner and PractitionerRole. The description in the docs for both of them is identical. If the field is really intended as \"resource created in error\" then isn't it doing a similar function as a soft delete?</p>\n<p>The docs are similarly vague on other resources' active fields too. Could anyone please weigh in on the typical usage behind them?</p>",
        "id": 153985811,
        "sender_full_name": "Yarek Tyshchenko",
        "timestamp": 1534174323
    },
    {
        "content": "<p>Its also intended to be used where the practitioner leaves the organization and should no longer be actively used. But we still want them in the system as there is lots of data that is attributed to them, so don't want to delete the record.</p>",
        "id": 153986022,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1534203575
    },
    {
        "content": "<p>Stops them appearing in default searching/filters etc.</p>",
        "id": 153986023,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1534203595
    },
    {
        "content": "<p>(as well as the entered in error status when you aren't sure if its been used or not yet, or the system doesn't support delete)</p>",
        "id": 153986024,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1534203626
    },
    {
        "content": "<p>That makes sense for Practitioner, but for Role... If a Practitioner is inactive should all their attached PractitionerRoles be also retroactively marked inactive, even if they have their period set in the past?</p>",
        "id": 153986348,
        "sender_full_name": "Yarek Tyshchenko",
        "timestamp": 1534259032
    },
    {
        "content": "<p>A quick guess -- a Practitioner might have had different roles over time, e.g. from an Intern to a Resident to an Attending, etc. and if this info needs to be there for historical purposes then I suppose Role would need to be maintained as well</p>",
        "id": 153986498,
        "sender_full_name": "John Silva",
        "timestamp": 1534277891
    },
    {
        "content": "<p>Thank you that clears it up. From my understanding Roles that are incorrect and can't be 'corrected' with a period should be set as inactive, so they don't appear in normal views. For all other cases period field should suffice.</p>",
        "id": 153986812,
        "sender_full_name": "Yarek Tyshchenko",
        "timestamp": 1534330139
    }
]