[
    {
        "content": "<p>I'm trying to find a system url to use for Practitioner.identifier when the identifier type is a Provider's Tax Identification Number.  The Tax Identification Number (TIN) is assigned by the Internal Revenue Service (IRS).  Is anyone aware of a url or oid that would be appropriate?</p>",
        "id": 153933893,
        "sender_full_name": "Susan Crawford",
        "timestamp": 1517349410
    },
    {
        "content": "<p>those would be regional, so would not be in the core specification.</p>",
        "id": 153933901,
        "sender_full_name": "John Moehrke",
        "timestamp": 1517349644
    },
    {
        "content": "<p>So might be in US-Core (or belong there)</p>",
        "id": 153933904,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517349677
    },
    {
        "content": "<p>Its here:  <a href=\"file:///Users/ehaas/Documents/FHIR/working-build/publish/identifier-registry.html\" target=\"_blank\" title=\"file:///Users/ehaas/Documents/FHIR/working-build/publish/identifier-registry.html\">file:///Users/ehaas/Documents/FHIR/working-build/publish/identifier-registry.html</a></p>",
        "id": 153933914,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517350101
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Hi Eric.  Thank you for the quick response.  When I click on the link you provided, I'm not able to open it up.</p>",
        "id": 153933936,
        "sender_full_name": "Susan Crawford",
        "timestamp": 1517350715
    },
    {
        "content": "<p>oops try this...http://build.fhir.org/identifier-registry.html</p>",
        "id": 153933947,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517351277
    },
    {
        "content": "<p>That worked but I'm still not seeing anything that represents the TIN.  I see the NPI and SSN but not TIN.</p>",
        "id": 153933950,
        "sender_full_name": "Susan Crawford",
        "timestamp": 1517351437
    },
    {
        "content": "<p>FYI.  I found the OID for Employer Identification Number (EIN), which appears to be the same as the Provider Tax ID.  While the preference is to have a resolvable URL, the OID can be used instead.  It's registered in the HL7 OID registry.  The OID is 2.16.840.1.113883.4.4.  Thanks for everyone's help.</p>",
        "id": 153934017,
        "sender_full_name": "Susan Crawford",
        "timestamp": 1517360159
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192882\">@Susan Crawford</span> It sounds like you used Practitioner.identifier to directly associate a Tax ID to the provider. Conceptually, my perspective is that a Tax ID is an identifier of the medical group, and that the association to provider should be through the medical group. Prior to reading this thread, I was planning to model this relationship by associating a Practitioner to an Organization by using PractitionerRole, and then listing the Tax ID as an identifier of Organization.</p>\n<p>Did you consider this? Do you see any drawbacks to this approach?</p>",
        "id": 153972909,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1530545473
    },
    {
        "content": "<p>I too had a need for a TIN and it is not listed in core.  I am torn whether to request it be added  to core since there is US Realm specific even the core include a bunch of us core system prn, ssn, state drivers licenses. etc  or  put the whole wack of US Realm systems id in a separate US FHIR registry or US Core.   But to be expedient.  <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17440\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17440\">GF#17440</a></p>",
        "id": 153973190,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530637620
    },
    {
        "content": "<p>Actually the EIN is commonaly called the TIN and there are ITINs and other tax ids I never knew about too...</p>",
        "id": 153973192,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530637675
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> - I'm curious, what is your perspective on TIN being an identifier of Practitioner vs Organization?</p>",
        "id": 153973209,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1530646542
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195380\">@Kenny Blanchette</span>,  for your question to Susan, I think your suggestion makes sense too. However, I believe there are situations that a Practitioner may not associate with an Organization but one can still have a TIN. In this case where are you going to put it?</p>",
        "id": 153973228,
        "sender_full_name": "jassy",
        "timestamp": 1530650586
    },
    {
        "content": "<p>EIN (TIN) is an org.  list of other Tax ids here....<br>\n<a href=\"https://www.irs.gov/individuals/international-taxpayers/taxpayer-identification-numbers-tin\" target=\"_blank\" title=\"https://www.irs.gov/individuals/international-taxpayers/taxpayer-identification-numbers-tin\">https://www.irs.gov/individuals/international-taxpayers/taxpayer-identification-numbers-tin</a></p>",
        "id": 153973247,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530655294
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>, this helps clarify!</p>\n<p><span class=\"user-mention\" data-user-id=\"192318\">@jassy</span> It may be that we are interpreting the meaning of an Organization differently. As an example, let's consider a single-provider practice. In the resource description, it does state that an Organization is a \"grouping of people or organizations\", implying that a single-provider practice would not be an Organization. However, it also states that an Organization can act as \"support for other resources that need to reference organizations, perhaps as a document, message or as a contained resource.\" This would imply that you could could represent the single provider practice as an Organization with one associated Practitioner. It would also allow you to associate documents and devices to the organization (using DocumentReference.custodian and Device.owner), which cannot reference a Practitioner.</p>",
        "id": 153973811,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1530809225
    },
    {
        "content": "<p>There are many important use cases where a provider needs to be associated to a Tax ID Number (e.g. billing, quality reporting). Both approaches seem valid, but I'm curious if there is somewhat of a consensus on which approach is more widely used. <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> (in case you have a perspective)</p>",
        "id": 153973813,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1530809400
    },
    {
        "content": "<p>I disagree that \" a single-provider practice would not be an Organization.\"  It would and it should. The practitioner and the practice are separate things.</p>",
        "id": 153973817,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530810100
    }
]