[
    {
        "content": "<p>I was wondering why the documentation says that identifier for Practitioner is supposed to be personal, yet NPI numbers and Taxonomy identifiers should be listed under identifier and not under qualification identifiers. Those two things seems like they are ids based on a certified qualification. Thanks</p>",
        "id": 154016847,
        "sender_full_name": "Oliver",
        "timestamp": 1541704749
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 154016852,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541705478
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> , are NPIs specific to a qual?<br>\nIf so then they belong in the identifiers under qual</p>",
        "id": 154016861,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541707942
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> .  The only value set reference there is this - <a href=\"http://hl7.org/fhir/ValueSet/v2-2.7-0360\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/v2-2.7-0360\">http://hl7.org/fhir/ValueSet/v2-2.7-0360</a>, and that isn't relevant or usable without a school valueset and graduation date.  There is obviously a Practitioner Role resource, but my understanding is that that is supposed to be tied to an Organization, and we have situations like Telehealth where certain providers can provide services outside of an Organization, even if they belong to one.  The Practitioner Role and Practice code value sets for that resource aren't really complete anyway.  If licensing information goes there, then I think the NPI and any other identifiers that are Role/Qualification dependent should as well.</p>",
        "id": 154016903,
        "sender_full_name": "Oliver",
        "timestamp": 1541713179
    },
    {
        "content": "<p>Role and qualification dependant are different things. Role dependant would be on PractitionerRole, not Practitioner.qualification<br>\nThe specific definition for NPI would be in a US specific guide, such as US-Core,  it not sure of it is there. We've done similar definitions for the Australian practitioner identifiers in the AU-base guide.</p>",
        "id": 154016909,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541713798
    },
    {
        "content": "<p>I'm pretty sure any healthcare provider can get an NPI without any qualification.  However once you have an NPI, it can be tied to qualifications.  I.e. the NPI identifies who has the qualification.  But the qualification itself is not the NPI.</p>",
        "id": 154016911,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1541713846
    },
    {
        "content": "<p>Is it the same identifier across quals, or do they get another one?</p>",
        "id": 154016912,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541713906
    },
    {
        "content": "<p>The same one.  Each individual gets a single NPI.  That NPI can be associated with whatever quals that individual has.</p>",
        "id": 154016923,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1541714875
    },
    {
        "content": "<p>The NPI number is used for covered entities, primarily for billing, now for everything, but you have to provide your qualifications to get it, so isn't Qualification a prerequisite for the NPI and shouldn't it go there?  I'm asking to profile it properly.  Individuals can have NPIs and their multiple Organizations have NPIs for billing, but I'm just talking about Practitioner use here.</p>",
        "id": 154016933,
        "sender_full_name": "Oliver",
        "timestamp": 1541715973
    },
    {
        "content": "<p>I just looked it up.  Clinical fellows can apply for NPIs as students, without a license.  It's just a random number without any tie to any license.  I guess that's it.</p>",
        "id": 154016934,
        "sender_full_name": "Oliver",
        "timestamp": 1541716197
    },
    {
        "content": "<p>Can they get more than one?</p>",
        "id": 154017037,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541744287
    },
    {
        "content": "<p>Is this question for me?  NPIs are either Type 1 or Type 2.  Type 1 NPIs are tied to an individual's SSN, so they can only have one, but can link more than one specialty under it for use in billing.  Type 2 NPIs are tied to FEINs so organizations can have more than one, like for an organization that has both a lab and a medical practice with two different NPIs for billing/claims.  A doctor could also have an individual Type 1 NPI and a Type 2 NPI for the sole proprietorship they set up.</p>",
        "id": 154017198,
        "sender_full_name": "Oliver",
        "timestamp": 1541780837
    }
]