[
    {
        "content": "<p>What's the argument for breaking PractitionerRole out into its own resource?</p>",
        "id": 153826316,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1462889854
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>, this one's for you :)</p>",
        "id": 153826559,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1462911855
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> :).  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , I was there for discussion about this in January, but in my notes I only recorded lower level details about what would link where and not the high level reasoning for it, and my memory isn't up to the task. </p>",
        "id": 153826569,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1462912130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> is currently enjoying New York City with his wife, we'll have to wait for this cliffhanger to be continued in the next episode...</p>",
        "id": 153828577,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1463650958
    },
    {
        "content": "<p>Hi all,<br>\nwe are currently upgrading our application codebase from DSTU2 to STU3.<br>\nOne model change we stumbled upon was the fact that the PractitionerRole is now a resource on it's own. <br>\nWhat is puzzling me is the fact that the Practitioner does not have a reference to PractitionerRole (while the PractitionerRole does have a reference to Practitioner) Does anybody know the reason for that?</p>",
        "id": 153884991,
        "sender_full_name": "Alexander Hoermandinger",
        "timestamp": 1492525270
    },
    {
        "content": "<p>Yes. All RESTful references are always from the resource that is more likely to be created later towards the resource that was more likely to have existed first. All references are only one direction, because one can always query for reference values...</p>",
        "id": 153884992,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492526192
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 154016333,
        "sender_full_name": "Oliver",
        "timestamp": 1541618409
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> I'm not sure that I understand PractitionerRole right. Can I / Should I use PractitionerRole when I'm referring to something being done 'by the admitting officer' when I have no idea who that was/will be? </p>\n<p>More generally, the Boundaries/Relationships section should have a very explicit section discussing Practitioner vs PractitionerRole. I feel as though this is underdone</p>\n<p>Further, the pattern Reference(Practitioner | PractitionerRole) pattern.... I'm not comfortable describing the rationale for and use of this pattern... have I missed an explanation somewhere in the specification?</p>",
        "id": 174844041,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567560359
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20635\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20635\">GF#20635</a> was approved by PA to make some improvements to the PractitionerRole description. Check that out and see if that helps clarify things.</p>",
        "id": 174901687,
        "sender_full_name": "Craig Newman",
        "timestamp": 1567617103
    },
    {
        "content": "<p>well, it moves things (thanks) but I cannot say that it clarifies things. </p>\n<blockquote>\n<p>Many resource types have a choice of a reference to either a Practitioner resource or a PractitionerRole resource. The latter provides organizational context for the practitioners participation when it is required, otherwise a direct reference to the practitioner may be used.</p>\n</blockquote>\n<p>Is providing an organizational context really worth splitting into 2 different resources? </p>\n<p>And the task doesn't help me understand whether the intent is that you can refer to a role that does not have a known identified person who did/will do it</p>",
        "id": 174921280,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567629885
    },
    {
        "content": "<p>My understanding is as follows:<br>\n- (some) registries manage practitioners independent of who they're working for or what hat they wear.  They just care about demographics.  E.g. Dr. John Smith has a medical degree from XYZ university and is licensed in states A and B.<br>\n- Those registries may <em>also</em> track more detailed information about where Dr. Smith works and in what capacities.  E.g. Surgeon at hospital 1, chief of cardiology at hospital 2 and GP and clinic 3<br>\n- the latter information has its own status and sometimes its own source of truth<br>\n- the original model was Practitioner = 1 person, one organization, one hat.  But that didn't align nicely for the registries that wanted to maintain hat-independent data (and apparently Person didn't work because it didn't deal with qualifications)<br>\n- that got split to Practitioner = 1 person and a whole bunch of roles and organizations; but that broke the referencing model and caused us to have to identify which org + which hat every time we pointed to a practitioner because the practitioner was now ambiguous<br>\n- the solution was to split the roles out as separate resources so you could point to a particular hat or you could point to a practitioner independent of hat, depending on need<br>\n- And yes, you can also have PractitionerRoles that specify organization + hat, but not Practitioner.  E.g. Surgeon at XYZ hospital.</p>",
        "id": 175012427,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567715799
    },
    {
        "content": "<p>maybe it's just me, but it still feels like Reference(Practitioner | PractitionerRole) is a less than optimal solution to this. I feel like it should be possible to come up with a better approach...</p>",
        "id": 175101446,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567802237
    },
    {
        "content": "<p>I wasn't expressing my enthusiasm for the status quo, jut my understanding of the path to the current state.  Personally, I liked the STU 2 solution where Practitioner was always Organization &amp; Role specific.  But that - in part - is because I'm not a heavy user of registries.  I'm not totally sure why Person wasn't deemed to be a solution to the shared demographics &amp; expertise bit.  <span class=\"user-mention\" data-user-id=\"191797\">@Irma Jongeneel</span> do you have further insights into PA's discussions here?</p>",
        "id": 175106715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567806509
    },
    {
        "content": "<blockquote>\n<p>maybe it's just me, but it still feels like Reference(Practitioner | PractitionerRole) is a less than optimal solution to this. I feel like it should be possible to come up with a better approach...</p>\n</blockquote>\n<p>I agree.  I have an open tracker item about this: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=21166\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=21166\">GF#21166</a>.</p>\n<p>We got told in Pharmacy that we needed to have PractitionerRole because we had Practitioner.  The rationale was \"<em>If</em> it is important enough to make it known that a Practitioner picked up meds, then it must be relevant in what capacity this Practitioner was acting. For that you need access to PractitionerRole.\"</p>\n<p>If I buy that rationale, and I'm not sure that I do, then why on earth do we have a separate resource?</p>",
        "id": 175117409,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1567817740
    },
    {
        "content": "<p>I'll note that your item <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22112\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22112\">GF#22112</a> is also symptomatic of this weird split.</p>",
        "id": 175117576,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1567817984
    },
    {
        "content": "<p>right. We're not making sense here. We need to cover 3 things <br>\n- this person did (usually in some implied role) (or will/should do it)<br>\n- this person in this role did it  (or will/should do it)<br>\n- some one in this role did it  (or will/should do it)</p>\n<p>If we think the current arrangement doesn't make sense.... can we fix it? Do we need a break out during the connectathon? a WGM quarter? both?</p>",
        "id": 175121176,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567824523
    },
    {
        "content": "<p>We also need to support the registry use-cases - that's what drove the current arrangement.</p>",
        "id": 175122143,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567826432
    },
    {
        "content": "<p>ok. and those are?</p>",
        "id": 175122160,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567826500
    },
    {
        "content": "<ul>\n<li>this person</li>\n<li>this person works here</li>\n</ul>",
        "id": 175122163,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567826511
    },
    {
        "content": "<p>this person (with these qualifications)<br>\nthis person works here (in this capacity)</p>",
        "id": 175122229,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567826616
    },
    {
        "content": "<blockquote>\n<p>We also need to support the registry use-cases - that's what drove the current arrangement.</p>\n</blockquote>\n<p>Why can't a set of qualifications be optional as well as a set of roles?</p>\n<p>Or create a RegistryPractitioner since it seems that the way more common use case for Practitioner is to be used in clinical resources?</p>",
        "id": 175124042,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1567830108
    },
    {
        "content": "<p>We don't want multiple roles on a resource as that breaks referencing.  Splitting into RegistryPractitioner is certainly a possible outcome, though our preference is single context-independent resources where possible.</p>",
        "id": 175124276,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567830536
    },
    {
        "content": "<blockquote>\n<p>We don't want multiple roles on a resource as that breaks referencing. </p>\n</blockquote>\n<p>I don't know what that means</p>",
        "id": 175124421,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567830817
    },
    {
        "content": "<p>If we had a practitioner resource that had multiple roles on it, it would be useless for referencing in a role-specific way</p>",
        "id": 175124585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567831128
    },
    {
        "content": "<p>Though I suppose we could do something funky like [base]/practitioner/123#rolea if the roles had ids...</p>",
        "id": 175124594,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567831161
    },
    {
        "content": "<p>Or put the role on the referencing resource, if it is really that important.</p>",
        "id": 175124642,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1567831223
    },
    {
        "content": "<blockquote>\n<p>If we think the current arrangement doesn't make sense.... can we fix it? Do we need a break out during the connectathon? a WGM quarter? both?</p>\n</blockquote>\n<p>I would agree to a breakout.  I would hope it wouldn't be during the connectathon because I couldn't make it.  But if it had to be there, I have trust that Grahame could represent my concerns (since they seem to be the same as his).</p>",
        "id": 175124660,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1567831303
    },
    {
        "content": "<p>well, breakouts are informal; they can only lead to recommendations for committees</p>",
        "id": 175125090,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567832134
    },
    {
        "content": "<p>We don't like putting the role (and/or organization) on the referencing resource.  We had that in STU3 and everyone hated it.</p>",
        "id": 175125521,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567832977
    },
    {
        "content": "<p>We do not have something like PractitionerRole in our database, but our Practitioner concept has a type - that in DSTU2 we mapped to practitionerRole.role. In STU3 and R4 there is nothing similar so we had to invent an extension<br>\nSo maybe re-introduce some of those extra elements in Practitioner - or add extensions for them?</p>",
        "id": 175248793,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1568040708
    }
]