[
    {
        "content": "<p>I am interested in associating Practitioners with more specific specialties than what seem to be intended by PractirionerRole.specialty. This information will be used to help determine which Practitioner may be most suited to care for a patient with specific needs. From the SNOWMED codes referenced in the example set on hl7, specialty seems very high level (e.g. Cardiology, Psychiatry, etc.) while I am looking for something more specific like Exercise Therapy (<a href=\"https://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=229065009\">https://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=229065009</a>) or Dietary Needs Eduction (<a href=\"https://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=370847001\">https://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=370847001</a>). It seems like many of the specializations or treatment specialties I am looking for are SNOWMED procedures or regimes and therapies. Are there any best practices around associating Practitioners with procedures or therapies that they specialize in?</p>",
        "id": 270486284,
        "sender_full_name": "Michael Duarte",
        "timestamp": 1643851220
    },
    {
        "content": "<p>The value set specified for PractitionerRole.specialty is only a 'preferred' binding.  You're free to use more detailed codes instead of (or in addition to) the codes listed in the spec.</p>",
        "id": 270489484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643853380
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ! So would the advice be to create our own custom coding for more specific specialties? Or would you suggest trying to find a way to relate the SNOWMED procedure codes to Practitioners in some manner?</p>",
        "id": 270489900,
        "sender_full_name": "Michael Duarte",
        "timestamp": 1643853629
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> - are you aware of more detailed codes available anywhere?</p>",
        "id": 270496110,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643859309
    },
    {
        "content": "<p>Not specifically, it really depends on your context/jurisdiction.<br>\nNot everywhere has SNOMED licensing, and different spaces are going to want to use a different subset, more general, or more specific/detailed (i.e. fine grained sub-specialties)</p>",
        "id": 273158009,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1645741474
    }
]