[
    {
        "content": "<p>Hi all, <br>\nIn a hospital doctors can become a team irrespective of patient. This representation of team is it necessary to use the care team with group or can we use Organization resource to represent as a team. which one is most commonly used?</p>",
        "id": 232717603,
        "sender_full_name": "Mounika",
        "timestamp": 1617263630
    },
    {
        "content": "<p>Organization is a group that can take collective action and have shared responsibility.  Group can be a collective 'subject' of action, but not a collective performer and can't take shared responsibility.  Which is appropriate depends on the objective of grouping them into a 'team'</p>",
        "id": 232754042,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617282916
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <br>\nCan you tell me when to use the Care Team resource?</p>",
        "id": 232778449,
        "sender_full_name": "Mounika",
        "timestamp": 1617291604
    },
    {
        "content": "<p>CareTeam is typically used when a team is specific to a Patient.  However, it can also be used for 'standing' teams when the team has a specific function and each member within the team takes on a particular role in delivering that function</p>",
        "id": 232781562,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617292767
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 232869676,
        "sender_full_name": "Mounika",
        "timestamp": 1617348384
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nCan you clarify me when to use Organization resource and when to use Group resource in creating a team?</p>",
        "id": 233299688,
        "sender_full_name": "Mounika",
        "timestamp": 1617706595
    },
    {
        "content": "<p>What's your use-case?</p>",
        "id": 233350544,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617726810
    },
    {
        "content": "<p>I need to create a team of doctors independent of patient. So what is the best resource is suitable for this use case?</p>",
        "id": 233494856,
        "sender_full_name": "Mounika",
        "timestamp": 1617804875
    },
    {
        "content": "<p>Maybe Organization? Depends on what kind of team it is. Does it represent a group of doctors that come together?</p>",
        "id": 233495505,
        "sender_full_name": "Katerina Nikolova",
        "timestamp": 1617805092
    },
    {
        "content": "<p>CareTeam allows you to specify particular individuals with specific roles.  If you don't need that, then stick with Organization.</p>",
        "id": 233591470,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617847732
    },
    {
        "content": "<p>Can we use Group resource to create team and if we can't, what is the reason for it?</p>",
        "id": 233652416,
        "sender_full_name": "Mounika",
        "timestamp": 1617888744
    },
    {
        "content": "<p>Group can't \"act\" or have responsibility - it can only be acted on.</p>",
        "id": 233666719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617893765
    },
    {
        "content": "<p>I need to represent a research team with its members. How can I link members to a ResearchStudy, other than contactPerson or principalInvestigator?</p>",
        "id": 245943751,
        "sender_full_name": "Astrid van Ginneken",
        "timestamp": 1626259861
    },
    {
        "content": "<p>This seems like a use for CareTeam, though right now there's no standard way to link that into a ResearchStudy.  You could use an extension.  You could also submit a change request asking us to explore adding a standard element or extension in the core spec</p>",
        "id": 245977480,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626277093
    },
    {
        "content": "<p>The research team is not caring for a particular patient. Hence, I am inclined to submit a change request asking the FHIR team to consider adapting the core profile of ResearchStudy to represent the members of the research team and the role of each member. Can you provide me with a link or instruction to submit such a change request?</p>",
        "id": 246428346,
        "sender_full_name": "Astrid van Ginneken",
        "timestamp": 1626683178
    },
    {
        "content": "<p>There's a \"propose a change\" link at the bottom of each page in the spec.  Please note though that CareTeam doesn't need to be patient-specific.  CareTeam is already used for standing teams within institutions like a 'code team' that are completely patient independent.</p>",
        "id": 246451310,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626699723
    },
    {
        "content": "<p>Thank you for your suggestion. Apart from the fact that there is no standard way to link a CareTeam to a ResearchStudy, CareTeam consists of Practitioners. A research team often has members that have nothing to do with patient care, such as secretary, database manager, statistician, financial officer, .... It would be great to have a generic  profile 'Team' that would be more general than CareTeam. This resource can then have members with a reference to Practitioner or Person. Profile Person should than also have a  0..* element 'role' or function. The elements 'contact' and 'principalInvestigator' in ResearchStudy could than be replaced with an element 'ResearchTeam' with a reference to profile Team.</p>",
        "id": 246561070,
        "sender_full_name": "Astrid van Ginneken",
        "timestamp": 1626772133
    },
    {
        "content": "<p>In FHIR terms, all of those people are Practitioners.</p>",
        "id": 246605196,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626794130
    },
    {
        "content": "<p>Practitioner is anyone working in their professional capacity - it includes cab drivers, lawyers, receptionists, you name it.</p>",
        "id": 246605270,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626794163
    },
    {
        "content": "<p>In FHIR, people are broken into 3 categories:<br>\nPatient - actual or potential recipient of care<br>\nRelatedPerson - someone acting on behalf of the Patient based on their personal relationship<br>\nPractitioner - someone acting in their professional capacity.</p>",
        "id": 246605368,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626794212
    },
    {
        "content": "<p>You can't <em>ever</em> have a reference to Person in FHIR.  Person is a linking resource only.  It's used to say that multiple Patients, Practitioners and/or RelatedPersons are the same human being (or animal).  Person can't ever be referenced as an actor or subject.</p>",
        "id": 246605466,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626794264
    },
    {
        "content": "<p>Thank you very much. I have indeed decided to use the reference to Practitioner. However, it would be great if the definition of CareTeam also allows for teams that do not provide care. Also, some members of a research team fulfill more than one role: e.g. principal investigator, contact person, and recruiter. This requires a cardinality of 0..* for participant.role</p>",
        "id": 247174159,
        "sender_full_name": "Astrid van Ginneken",
        "timestamp": 1627287175
    },
    {
        "content": "<p>Just repeat the member for the various roles, as they could also have different periods too.</p>",
        "id": 247176744,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1627289228
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"379277\">@Astrid van Ginneken</span>, can you submit a change request to suggest clarifying the definition to indicate that CareTeam can have a broader use?</p>",
        "id": 247210923,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627310263
    },
    {
        "content": "<p>Youhave mentioned a link 'propose a change', but perhaps you are referring to a different web page than the one I have been using. Can you please paste a URL in your reply, so I can submit my change request?</p>",
        "id": 247300361,
        "sender_full_name": "Astrid van Ginneken",
        "timestamp": 1627369375
    },
    {
        "content": "<p>At the bottom of every page in the FHIR specification, there's a 'propose a change' link.  You'll need to do a 1-time registration process where we have a human review and confirm you seem to be a real human being.  After that, you can propose changes at will <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 247329422,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627390847
    }
]