[
    {
        "content": "<p>We are working to implement a practitioner resource within the QI Core Implementation Guide.  As part of this, we would like to utilize the practitioner-classification extension defined to contain the specialty of the practitioner rather than expand our implementation to include the PractitionerRole Resource.  To populate this value, we are calling out to the NPI Registry in the US to obtain the listing of Taxonomies associated with the Practitioner.  Within this registry there can be multiple values with a primary defined.  The cardinailty of the property is 0-1 which limits our ability to really capture all of these taxonomies returned in this extension.</p>\n<p>We have a couple options I can see:<br>\nCreate our own QI Core Profile to adjust the cardinality<br>\nImplement the PractitionerRole Resource and capture this limited information in the resource.</p>\n<p>My question really is, has anyone else done something similar and how did you handle this?  Are we possibly utilizing this Extension outside the spirit of it's intention?  All of these resources will be stored in a FHIR Server so this wouldn't for a real time messaging of the information.</p>",
        "id": 185639538,
        "sender_full_name": "Larry Shields",
        "timestamp": 1579035551
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 185642370,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579037331
    },
    {
        "content": "<p>What are you linking to the practitioner, and do you care about the Organization they provide that specialty when it is used?</p>",
        "id": 186963589,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1580373114
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  We do not currently care about the organization they provide this service to as it is currently assumed it is within our organization as we're only pulling in our internal providers.  We'll be associating Encounters, Procedures, Conditions and Diagnostic Reports/Observations to the Practitioner.</p>",
        "id": 187306637,
        "sender_full_name": "Larry Shields",
        "timestamp": 1580765573
    },
    {
        "content": "<p>The other complexity you might want to consider is where you have multiple sites, and the practitioner provides different specialties at those sites (and availablility hours, and scheduling etc) PractitionerRole will make all that much easier.</p>",
        "id": 187311471,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1580768592
    }
]