[
    {
        "content": "<p>Is it valid to swap the reference of the \"practitioner\" field in the PractitionerRole resource from one practitioner to another?  </p>\n<p>Assuming the PractitionerRole is meant to represent a particular duty/assignment within an organization (e.g. dental assistant), then would it be appropriate to change the underlying practitioner that is assigned to this role over a period of time, as job duties shift hands from one person to another?  </p>\n<p>For example, if Jacob was once the dental assistant, but was promoted to dental hygienist, his Practitioner resource would still be the same, but we would unassign the reference of the dental assistant PractitionerRole and instead assign him to the dental hygienist PractitionerRole.</p>\n<p>I imagine this is also why PractitionerRole.practitioner is 0..1, rather than 1..1, as if to imply that a role may exist without an assignment (a job opening).</p>\n<p>I'm hoping the answer is yes, because it would help immensely with scenarios we are facing in our implementation where we wish to assign certain references to the <em>job duty</em>, rather than a <em>person entity</em>, so as to allow for swapping of responsibilities seemlessly without editing resources unnecessarily.  For example, we might want to assign a PractitionerRole to a CareTeam, rather than the actual Practitioner, so as to easily allow clinicians to temporarily perform substitutions during a hiatus.</p>",
        "id": 166598409,
        "sender_full_name": "Justin Hopper",
        "timestamp": 1558915469
    },
    {
        "content": "<p>The problem with switching is that all references to that PractitionerRole would now point to the new person rather than the old one - and that's almost certainly not what yo uwant.</p>",
        "id": 166604372,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558925922
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Can you explain why that would not be what I want?  </p>\n<p>It seems to me that if I really cared to ensure references didn't get swapped out unintentionally, that I would have referenced the Practitioner directly rather than a PractitionerRole.  What purpose does referencing a PractitionerRole serve if not to allow interchangeability?</p>",
        "id": 166604823,
        "sender_full_name": "Justin Hopper",
        "timestamp": 1558926673
    },
    {
        "content": "<p>All references to a Practitioner that I can find seem to also allow a reference to PractitionerRole.  Everything seems to be Reference(Practitioner | PractitionerRole), and I struggle to understand why the option.  Why is it simply not Reference(PractitionerRole) in all of these places?</p>",
        "id": 166605006,
        "sender_full_name": "Justin Hopper",
        "timestamp": 1558926992
    },
    {
        "content": "<p>When you point to PractitionerRole and it's tied to a particular Practitioner you're saying \"Dr. Smith did this in his role as Chief Cardiologist at Good Health Hospital\".  If you change the PractitionerRole to link to Dr. Jones, then every procedure, condition, etc. that points to that PractitionerRole would now say \"Dr. Jones did this in his role as Chief Cardiologist at Good Health Hospital\"</p>",
        "id": 166605143,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558927234
    },
    {
        "content": "<p>If you just want to say \"This was done by the Chief Cardiologist at Good Health Hospital\", then don't link it to a Practitioner (ever)</p>",
        "id": 166605155,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558927274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - To follow your scenario, how would/should this be represented: for the last year Dr. Smith's role was that as a \"Resident Cardiologist\" so all procedures s/he did up to that point were in his/her role as \"Resident Cardiologist\", but this past week s/he was promoted to 'Chief Cardiologist\" (big promotion! ;-) )?   How would someone be able to keep track of which procedures s/he performed in previous role vs current role?   Would there need to be a new instance of a Practitioner and PractionerRole created to separate these?</p>",
        "id": 166630348,
        "sender_full_name": "John Silva",
        "timestamp": 1558957933
    },
    {
        "content": "<p>There'd be an end date put on the Resident Cardiologist PractitionerRole and a new PractitionerRole with the the Chief Cardiologist role code and an appropriate effective date.  All new actions they took would be associated with the new PractitionerRole.  The older actions would be tied to the original PractitionerRole.</p>\n<p>Also note that the same Practitioner might have multiple PractitionerRoles in effect simultaneously - with different organizations or sometimes even with the same organization.</p>",
        "id": 166635640,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558962544
    },
    {
        "content": "<p>OK, makes sense.   But what if the procedures referenced the Practitioner rather than the PractitionerRole, or is that not the correct/recommended way?  Is this why there is a 'problem' others mentioned about merging these into one resource?</p>\n<p>BTW, Yes, a nurse can be both a Nurse Manager (or a unit) and a Shift Nurse at the same time; and I'm sure there are many other examples of Practitioners \"wearing multiple hats\" at the same time within an institution.</p>",
        "id": 166638613,
        "sender_full_name": "John Silva",
        "timestamp": 1558964898
    },
    {
        "content": "<p>If you point to Practitioner, then you're just saying \"This was done by Dr. Smith\" - you don't know in what capacity or on behalf of what organization.  So you use Practitioner when you don't know (or care) about anything other than who was the human being.</p>",
        "id": 166639891,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558965810
    },
    {
        "content": "<p>In the US (in some cases), there is 'legal attestation' associated with the specific person who performed a procedure, it can't just be a PractionerRole that performed a procedure if that role is a 'generic role' not linked to a specific Practitioner.  I'm sure there are clinical folks here that can talk more about the specifics of this.   Not sure how this would be modeled though.</p>",
        "id": 166644944,
        "sender_full_name": "John Silva",
        "timestamp": 1558970124
    },
    {
        "content": "<p>You would just point to the PractitionerRole and the PractitionerRole would be tied to a specific Practitioner.  There would be business rules in the server that would prevent the Practitioner for the PractitionerRole from being changed.</p>",
        "id": 166647020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558971996
    }
]