[
    {
        "content": "<p>Hello everyone,</p>\n<p>I'm looking for a resource to explicit that a Practitioner have the access right to all data about an organization (associated Patients, Encounters...).<br>\nAccording to you, what's the best method to implement the information \"the Practitioner have access to Organization A and Organization B associated data\" ?</p>\n<p>We had multiple ideas:</p>\n<ul>\n<li>use PractitionerRole to say that practitioner have an access to an organization</li>\n<li>use Group to list the practitioners that are allowed to access data from an organization</li>\n<li>use Consent resource</li>\n</ul>\n<p>Thanks!</p>",
        "id": 230482753,
        "sender_full_name": "Nicolas Riss | Arkhn",
        "timestamp": 1615887143
    },
    {
        "content": "<p>The Consent resource has this in scope, where the subject is the practitioner. This was a 'feature' added with some use-cases around provider directories. It doesn't 'feel right' as there is no consent act, and likely has nothing to do with consent.</p>\n<p>So, we are working on a more generalized resource in R5 - Permission. It is developing slowly due to many other things the people interested are working on. That said, it can develop much faster with resources. What we first need is explicitly defined use-cases, and examples of how that use-case might look given the Permission resource. Following that would be adjustments to the model. We know of a few adjustments driven by some use-cases. So, please feel free to help develop this for R5.</p>",
        "id": 230503408,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615897824
    },
    {
        "content": "<p>Th Consent resource has that in it's use cases.  Australia used Consent for their practitioner database.  By using a custom Consent.scope and setting the subject to Practitioner, you can use that exact information</p>",
        "id": 230508913,
        "sender_full_name": "David Pyke",
        "timestamp": 1615900342
    },
    {
        "content": "<p>Thanks for your answer :)<br>\nThe use case is to create a tool to search for patient and visualise patient hospital journey, the goal was to limit the practitioner access to his organization and all related resources.<br>\nFinally, we decided to use PractitionerRole, which says like \"he has a research role on this organization and have the right to access data\". We will then adapt the implementation with the R5 Permission resource when released.</p>",
        "id": 231436442,
        "sender_full_name": "Nicolas Riss | Arkhn",
        "timestamp": 1616488364
    }
]