[
    {
        "content": "<p>A business case requires to provide a set of clinics a patient is/was assigned to. This set may change if the patient moves to another place, almost like a catchment area, but should be kept for a historical reason. Patient.generalPractitioner may be used for that but there is no Period element there to indicate when the patient was assigned to a clinic. It’s also possible that the patient had no encounters during that period.</p>\n<p>Trying to avoid adding one more extension, I’d use a contained PractitionerRole with PractitionerRole.code set to the clinic type (e.g., 702854000 - Endocrinology clinic), PractitionerRole.location pointing to the actual location of the clinic, and PractitionerRole.period during which the patient was assigned to the clinic. However, the PractitionerRole resource is the role of the practitioner, not the clinic.  (In this particular business case the patient visits any practitioner with the required specialty in the clinic.)</p>\n<p>Any other ideas?</p>",
        "id": 177629006,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1570549524
    },
    {
        "content": "<p>I think you should use Provenance resource to track such changes.</p>",
        "id": 177648246,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1570561673
    },
    {
        "content": "<p>not clear to me how Provenance helps except to track who/what/where/when/why a change is made. I</p>",
        "id": 177650693,
        "sender_full_name": "John Moehrke",
        "timestamp": 1570563264
    },
    {
        "content": "<p>I think you should consider CareTeam for usecase. That is a CareTeam for each patient that gatheres all the team members regardless of where they practice. I would agree that a PractitionerRole would likely be useful between CareTeam and Practitioner.</p>",
        "id": 177650768,
        "sender_full_name": "John Moehrke",
        "timestamp": 1570563324
    },
    {
        "content": "<p>Provenance tracks 'when' Patient.generalPractitioner changes.<br>\nBut CareTeam seems better.</p>",
        "id": 177651772,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1570563976
    },
    {
        "content": "<blockquote>\n<p>That is a CareTeam for each patient that gatheres all the team members regardless of where they practice.</p>\n</blockquote>\n<p>In this use case it's actually the opposite, the matter is where they practice regardless who is a member of the care team. But I'd also agree that CareTeam seems reasonable.</p>",
        "id": 177654643,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1570565776
    },
    {
        "content": "<p>\"The CareTeam includes all the people and organizations who plan to participate in the coordination\". So if the \"clinic\" in your context can be modeled as Organization, then CareTeam should cover that.</p>",
        "id": 177655107,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1570566096
    },
    {
        "content": "<p>CareTeam can include things like \"primary care clinic\", \"preferred pharmacy\", \"preferred physiotherapy location\", etc.  It can point to individual people or to organizations, depending on the nature of the preference.  (Some patients are tied to a specific GP, others only to a clinic.  When it comes to pharmacies, it's almost always to an organization, but for patients with really complex needs, it could be to a specific pharmacist - regardless of where they're working that day.)</p>",
        "id": 177676242,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570587038
    },
    {
        "content": "<p>The other resource you might consider is EpisodeOfCare. But do think CareTeam is more appropriate.</p>",
        "id": 177692397,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1570609724
    },
    {
        "content": "<blockquote>\n<p>The other resource you might consider is EpisodeOfCare. But do think CareTeam is more appropriate.</p>\n</blockquote>\n<p>There might be no encounters, so CareTeam works better.</p>",
        "id": 177732110,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1570639202
    }
]