[
    {
        "content": "<p>In the UK GP'es are being asked steadily to shoulder specialisms prior to hospitals. Thus GP'es are referring to GP'es etc.  As such a question which may be asked is \"find me all the GP practices in Bradford which have a Dermatology specialist(ism)\" </p>\n<p>It strikes me that a specialism for a GP \"belongs\" to the Practitioner as it will move if he/she does. </p>\n<p>The only place I can see for this atm would be in \"qualification\" but this is a higher level i.e. I am just looking for a gp with a 2ndary specialism as a dermatologist vs having to look through qualifications which may or may not have been filled in etc.  So..... where do specialisms belong? at the practitioner level (&amp; if so where) or the service level (&amp; if so where)?</p>",
        "id": 154010166,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1539853068
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 154010187,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539869770
    },
    {
        "content": "<p>Unfortunately it's not that simple.<br>\nJust because someone has a radiology qualification, does not mean they are doing that everywhere they work. They kinda need the equipment to do it.<br>\nAnd also needs a current registration with the appropriate board etc.<br>\nWhich brings us back to the PractitionerRole resource, which also includes the details of their availability at that location too, which is typically the next step.<br>\nYou can use the _has search parameter to find the practitioners that have the specialty available somewhere, then use the pracrole to get the specific one.</p>",
        "id": 154010337,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1539919292
    },
    {
        "content": "<p>In DSTU2, you can get specialty from Practitioner.practitionerRole.specialty.<br>\nIn STU3 and above, you can get specialty from PractitionerRole.specialty and reference to practitioner using PractitionerRole.practitioner</p>",
        "id": 154010654,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1539981504
    }
]