[
    {
        "content": "<p>I see that in the R4 version of the FHIR spec, a lot of the Practitioner references now allow PractitionerRole references (for example MedicationRequest.performer). We are on STU3, and likely to be for a while, so what's the best way to pre-adopt the PractitionerRole references in STU3?</p>",
        "id": 153966672,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1528119028
    },
    {
        "content": "<p>In STU3, you'll need to use an extension to point to PractitionerRole.  I believe we're supposed to be publishing some standard extensions for that, but I'm not sure where we are with that process.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 153966674,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528123228
    },
    {
        "content": "<p>it's on my todo list</p>",
        "id": 153966733,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528136846
    },
    {
        "content": "<p>If in the UK we decided to allow use of PractitionerRole for fields such as Recorder in MedicationRequest and AllergyIntolerance with the aim of adopting it UK wide, what would be the consequeces/issues that we would see? Would there be any way of negating these issues and if so is this likely to be less effort than dealing with an extra breaking change in STU4 when it arrvives and in dealing with an extra extension in the current resources?</p>",
        "id": 153968913,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1528886864
    },
    {
        "content": "<p>The issues you'd face would be the same as any other non-strictly conformant systems.  You wouldn't be able to use the reference implementations without tweaking them.  You wouldn't be able to use the public test servers.  You won't work with EHRs and other systems when they support R3.  You won't be able to use profile authoring and IG Publishing tools without tweaking those.  You can work around all those limitations with time and money.  But it's questionable whether it'll be more time and money than just using an extension in R3.</p>",
        "id": 153968947,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528891994
    },
    {
        "content": "<p>I made an extension for Case Reporting and need it for DaVinci and likely US-Core.  When you say create it for R3,  does that mean a new version of R3?  or is it going to be a freestanding extension?  Like an IG?</p>",
        "id": 153969058,
        "sender_full_name": "Eric Haas",
        "timestamp": 1528901045
    },
    {
        "content": "<p>At some point we're supposed to create \"standard\" extensions for use with R3 to cover new elements that are in R4.</p>",
        "id": 153969071,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528902096
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I have just searched the R4 current build extension registry and GForge tracker database for suggested standard extensions  to support R3 usage of new R4 elements/ references etc. Has this been proposed yet?</p>",
        "id": 153989581,
        "sender_full_name": "Simon Knee",
        "timestamp": 1534785845
    },
    {
        "content": "<p>It's been proposed and agreed but I don't believe it's yet been implemented.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 153990398,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535033349
    },
    {
        "content": "<p>the current balloted specification explains how they'll be generated but I will only generate them when it passes ballot</p>",
        "id": 153990511,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1535056986
    }
]