[
    {
        "content": "<p>Hi. We been chewing on CareTeam to convey \"preferred care providers\" as this was the direction we got. It feels awkward. What would the category be for that CareTeam? Would you expect the GP there too, even though the GP is attached to Patient as well?</p>\n<p>The CareTeam more logically applies to a team involved with a procedure, treatment or what have you. The only thing that binds \"preferred care providers\" is the fact that the patient indicated a preference of some sort. The pharmacist does not know the obstetrician or the dietician, while they are all part of the CareTeam containing \"preferred care providers\". Or is the idea that each of these providers are part of a distinct one man/organization team?</p>\n<p>Our first and potentially only use case in the longer term, judging by past experience, is the notion of a \"preferred pharmacist\". In The Netherlands you theoretically have choice for every dispense, but in practice most people go to the same pharmacy everytime. Having this preference in a prescribing system makes sense as courtesy to your patient/client. Our CareTeam could look like this:</p>\n<div class=\"codehilite\"><pre>&lt;CareTeam xmlns=&quot;http://hl7.org/fhir&quot;&gt;\n  &lt;category&gt;\n    ???\n  &lt;/category&gt;\n  &lt;name value=&quot;Preferred providers&quot;/&gt;\n  &lt;subject&gt;\n    &lt;reference value=&quot;Patient/1293912&quot;/&gt;\n  &lt;/subject&gt;\n  &lt;participant&gt;\n    &lt;role&gt;\n      &lt;coding&gt;\n        &lt;system value=&quot;http://snomed.info/sct&quot;/&gt;\n        &lt;code value=&quot;46255001&quot;/&gt;\n        &lt;display value=&quot;Pharmacist&quot;/&gt;\n      &lt;/coding&gt;\n    &lt;/role&gt;\n    &lt;member&gt;\n      &lt;reference value=&quot;Practitioner/12893712&quot;/&gt;\n    &lt;/member&gt;\n    &lt;period&gt;\n      &lt;start value=&quot;2017-01&quot;/&gt;\n    &lt;/period&gt;\n  &lt;/participant&gt;\n&lt;/CareTeam&gt;\n</pre></div>",
        "id": 153879854,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1490608481
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191360\">@Michelle M Miller</span> I believe this topic is in your ally?</p>",
        "id": 153879897,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1490619904
    },
    {
        "content": "<p>I'll take your question back to the Patient Care / Learning Health Systems work groups.  The Patient Care FHIR call (on Thurs this week) is cancelled, but we also have a Learning Health System dedicated CareTeam call every Friday.  I'll ask that this be added to the LHS agenda. </p>",
        "id": 153879904,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1490626420
    },
    {
        "content": "<p>I can't make coming or next Friday. I see you keep the LHS minutes on the wiki (<a href=\"http://wiki.hl7.org/index.php?title=LHS_Conference_Calls_and_Meeting_Minutes\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=LHS_Conference_Calls_and_Meeting_Minutes\">http://wiki.hl7.org/index.php?title=LHS_Conference_Calls_and_Meeting_Minutes</a>) so I'll make a note to read those to see what comes out. Is the use case I have outlined enough to support the discussion without my presence?</p>",
        "id": 153879910,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1490633515
    },
    {
        "content": "<p>Yes, that is where the LHS CareTeam meeting minutes are getting published.  In general, our focus has been on the care coordination use case, but I did get confirmation that we can add your use case to the agenda on Friday.  Your use case makes sense, so I don't have any other questions for you right now.</p>",
        "id": 153879915,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1490639381
    },
    {
        "content": "<p>Alright, to add to why CareTeam might not function for the use case this: any public pharmacy here has around 6400 patients. Any hospital has at least 2,5 million patient records. If you keep CareTeams of 1 pharmacy connected to multiple patients you have 6400 CareTams, and a privacy issue when you get that rather large resource (unless you prune to what the requester is allowed to see). The alternative is as many CareTeams as you have patient/pharmacy permutations so 2,500,000 careteams for a regular hospital.<br>\n.<br>\nThe solution that we started the discussion from was an extension in Patient just like the Patient.generalPractitioner is there. There currently is no core extension for that. Depending on the outcome that might be a second way out<br>\n<span class=\"user-mention\" data-user-id=\"191800\">@Ben Schrijver</span> making sure you are aware your use case is discussed here.</p>",
        "id": 153880175,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1490735619
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>  Patient Care had a brief discussion today and concluded that CareTeam doesn't feel like the right way to convey a preferred pharmacy.  Some of the discussion included:</p>\n<ul>\n<li>Presumably, the intent is to capture the preferred pharmacy location/organization - and not a specific pharmacist (practitioner)</li>\n<li>A pharmacy is more like a preferred supplier rather than a care provider</li>\n<li>The preferred pharmacy (at least in the US) could be influenced by the PBM (pharmacy benefit manager)</li>\n<li>Pharmacists (practitioners) can be members of a care team, such as an oncology patient who might have a clinical pharmacist as part of the care team, but that is more of an exception. </li>\n<li>Patient Care would like Patient Admin's feedback (hint, hint @<strong>Brian Postlethwaite (new)</strong>)  on whether Patient.generalPractitioner could be scoped to include all \"patient preferred providers\"</li>\n<li>Presumably, in context of a specific MedicationRequest, MedicationRequest.dispenseRequest.performer can be used.</li>\n</ul>",
        "id": 153881199,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1491520052
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191360\">@Michelle M Miller</span> <span class=\"user-mention\" data-user-id=\"191800\">@Ben Schrijver</span> <span class=\"user-mention\" data-user-id=\"191334\">@Marten Smits</span> <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> <br>\nThanks for that. I'm glad you reached the same conclusion we did. In STU3 we will model the preferred pharmacist as Patient extension. In direct response:<br>\n.</p>\n<blockquote>\n<p>Presumably, the intent is to capture the preferred pharmacy location/organization - and not a specific pharmacist (practitioner)</p>\n</blockquote>\n<p>Yes</p>\n<blockquote>\n<p>A pharmacy is more like a preferred supplier rather than a care provider</p>\n</blockquote>\n<p>At least supplier, but you might also have a good relationship with one ore more employees. Not sure what the impact of the difference would be</p>\n<blockquote>\n<p>The preferred pharmacy (at least in the US) could be influenced by the PBM (pharmacy benefit manager)</p>\n</blockquote>\n<p>It may be, it does not for us obviously. How would that impact how you model it?</p>\n<blockquote>\n<p>Pharmacists (practitioners) can be members of a care team, such as an oncology patient who might have a clinical pharmacist as part of the care team, but that is more of an exception.</p>\n</blockquote>\n<p>Agree</p>\n<blockquote>\n<p>Patient Care would like Patient Admin's feedback (hint, hint <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>) on whether Patient.generalPractitioner could be scoped to include all \"patient preferred providers\"</p>\n</blockquote>\n<p>I would probably agree with that change, although that's sort where 'we' at PA came from with Patient.</p>\n<blockquote>\n<p>Presumably, in context of a specific MedicationRequest, MedicationRequest.dispenseRequest.performer can be used.</p>\n</blockquote>\n<p>Yes, but in order to populate that performer efficiently, you would want to know at prescription time</p>",
        "id": 153881251,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1491549265
    },
    {
        "content": "<p>And when they change the preferred pharmacist, and also want to include the community care manager and their preferred physio, and phsyciatrist and include the dates that these were all appropriate. This now looks like the CareTeam resource that we split from CarePlan and EpisodeOfCare.</p>",
        "id": 153881675,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1491874378
    },
    {
        "content": "<p>And no, wouldn't expect a single CareTeam for 1 pharmacy with all the patients in it, a single careteam for each patient with all the professionals contributing to their care.<br>\nMaybe a contained CareTeam might be sensible.</p>",
        "id": 153881676,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1491874435
    }
]