[
    {
        "content": "<p>I am sending hl7 fhir bundle message regarding pregnancy information. I encountered some difficulties when presenting some information with hl7 structure.<br>\nEx:<br>\n- Pregnancy examination week<br>\n- Is it possible to manage maternity information?<br>\n- number of antenatal care visits in 3 periods<br>\n- number of premature births pregnancy<br>\n-  number of abortion<br>\n- Is the child given vitamin K injections?<br>\nIt's hard to integrate with hl7 :(( please help me</p>",
        "id": 173870296,
        "sender_full_name": "Dongtu",
        "timestamp": 1566470113
    },
    {
        "content": "<p>I used Observation Resource and search any information in LOINC table.  I can't find what I need.</p>",
        "id": 173870558,
        "sender_full_name": "Dongtu",
        "timestamp": 1566470379
    },
    {
        "content": "<p>Pregnancy examination week would be an encounter.  Not sure what's meant by \"manage maternity information\".  # of antenatal visits isn't in LOINC - you'll need to define your own code and/or propose adding it to LOINC.  Preterm births is 11637-6.  Abortions seems a glaring omission in LOINC.  I know this gets asked and tracked in Canada too - strongly suggest proposing it to LOINC.  Vitamin K injection would be captured using MedicationAdministration</p>",
        "id": 173877528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566476941
    },
    {
        "content": "<blockquote>\n<p>Vitamin K injection would be captured using MedicationAdministration</p>\n</blockquote>\n<p>Possibly better MedicationStatement? Depending on whether you are in the workflow (M.Administration) or doing a report (M.Statement)</p>",
        "id": 173886424,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1566483375
    },
    {
        "content": "<p>Are there any rules for define my own code ? I want other international systems to be easy to understand my own code.<br>\nMy code is defined in the document or in the hl7 message structure ?</p>",
        "id": 173936771,
        "sender_full_name": "Dongtu",
        "timestamp": 1566526548
    }
]