[
    {
        "content": "<p>Hi all, I think I've read through the spec, but couldn't figure out how to handle preliminary reports, specifically for labs and  radiology.  Should preliminary versions of a report generate separate observations (linked to the same diagnostic report) or should we replace the values on the existing observation as the values get updated.  A specific example for this could be a blood culture has result \"no growth to date at 24 hours\" that evolves to \"no growth to date at 48 hours\" and finally \"no growth to date a 6 days\".   If we generate separate observations do they all keep their preliminary statuses or do they all switch to final when the culture itself is finalized.  Thanks.</p>",
        "id": 180963040,
        "sender_full_name": "Michael Wang",
        "timestamp": 1574007777
    },
    {
        "content": "<p>The same Observation instance would be updated when the final results are available and the status would be changed.  No need for separate Observation instances (though they would be distinct versions of the same instance).</p>",
        "id": 180963765,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574009111
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  -  \"no growth to date at 48 hours\" -- this sounds like a microbiology result.  Isn't there a FHIR profile that suggests/recommends a way to handle microbiology results?</p>",
        "id": 180968662,
        "sender_full_name": "John Silva",
        "timestamp": 1574018109
    },
    {
        "content": "<p>I'm not aware of existing work in the microbiology space - <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ?</p>",
        "id": 180973065,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574025154
    },
    {
        "content": "<p>yes there is a profile, though I've asked OO to describe it better.</p>",
        "id": 180995922,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574065658
    },
    {
        "content": "<p>I agree that you would keep the same observation resource (same id) and just change the status</p>",
        "id": 180995932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574065679
    },
    {
        "content": "<p>The DiagnosticReport example page gives a couple of ways to structure discrete micro results. Not sure if it's an official profile or not.  <a href=\"http://hl7.org/implement/standards/fhir/diagnosticreport-examples.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/diagnosticreport-examples.html\">http://hl7.org/implement/standards/fhir/diagnosticreport-examples.html</a></p>",
        "id": 181015192,
        "sender_full_name": "Craig Newman",
        "timestamp": 1574083928
    }
]