[
    {
        "content": "<p>I was looking at how to support prescriptions made by e.g. a GP or a clinician at an OP clinic, but where the drugs will be picked up by the patient at the pharmacy and later self-administered by the patient in their home or similar. The prescriber can indicate that the patient is allowed to pick up the same medicine several times at the pharmacy. Later, when the patient has used up their medicines, and are not allowed to pick up anymore at the pharmacy, they will normally call the GP who will renew the same prescription and allow for the patient to pick up more at the pharmacy. It doesnt only have to be medicines, it could also be appliances.</p>\n<p>I assume this is still a <strong>MedicationRequest</strong>. </p>\n<p><strong>Question</strong><br>\nHow should we distinguish these prescriptions from ones that are administered by staff at the hospital settings? </p>\n<p>I have looked a bit, and here are at least what I have found...<br>\n*Use <strong>MedicationRequest.category=discharge</strong>? It somewhat seems to fit the requirement (\"Includes requests for medications created when the patient is being released from a facility\"), and the other categories are not suitable for this use case. </p>\n<p>*Use <strong>MedicationRequest.performer</strong>, by referencing a patient you could indicate that this drug will be administered by the patient. But that can happen in an IP setting as well, so this doesnt feel correct.</p>\n<p>Does the use case make sense? </p>\n<p>Thanks!</p>",
        "id": 157111598,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1548774739
    },
    {
        "content": "<p>You're right, this is a MedicationRequest.  There is a MedicationRequest.category exemplar valueset that includes \"community\" - Includes requests for medications to be administered or consumed by the patient in their home (this would include long term care or nursing homes, hospices, etc.) as well as \"inpatient\" (Includes requests for medications to be administered or consumed in an inpatient or acute care setting) or \"Outpatient\" (Includes requests for medications to be administered or consumed in an outpatient setting (for example, Emergency Department, Outpatient Clinic, Outpatient Surgery, Doctor's office)).  This value set is exemplar only so you can change it.  I would have said that \"community\" is appropriate for your use case.  </p>\n<p>I think category is the right attribute for this use case.  You could use performer, but if the performer changes, it doesn't feel right.</p>",
        "id": 157113265,
        "sender_full_name": "Melva Peters",
        "timestamp": 1548776263
    },
    {
        "content": "<p>I had a look at community and didnt think it was appropriate for the use case, but reading the definition again it does sound right! Thanks!</p>",
        "id": 157113847,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1548776745
    },
    {
        "content": "<p>Oh, interesting. There isn't a Swedish national standard for e-prescriptions and associated transactions as it stands? Or is it just that it doesn't cover refill requests</p>",
        "id": 160217649,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1551979046
    }
]