[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span> ,</p>\n<p>In our country,  the doctor always gives a lot of medicine,<br>\nIf I want to map the Prescription List to HL7 FHIR resource, what should I do.</p>\n<p><a href=\"/user_uploads/10155/y_qLFNn1lRUpFrrqlfURtG70/3085882981_67809e092c.jpg\" target=\"_blank\" title=\"3085882981_67809e092c.jpg\">3085882981_67809e092c.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/y_qLFNn1lRUpFrrqlfURtG70/3085882981_67809e092c.jpg\" target=\"_blank\" title=\"3085882981_67809e092c.jpg\"><img src=\"/user_uploads/10155/y_qLFNn1lRUpFrrqlfURtG70/3085882981_67809e092c.jpg\"></a></div>",
        "id": 153957204,
        "sender_full_name": "Winnicott",
        "timestamp": 1525877406
    },
    {
        "content": "<p>Please refrain from using '@' all as it sends an email to the thousand+ people subscribed to this stream.  Typically PrescriptionList would be handled as a List resource pointing to MedicationRequest resources.  Though if your list is just \"medications the patient is on\" rather than \"current prescriptions\", you might want to use MedicationStatement as well or instead.</p>",
        "id": 153957226,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525878333
    },
    {
        "content": "<p>You can map the individual medication orders to a MedicationRequest.  The set of medications  on your list could be included in a List Resource or a bundle.</p>",
        "id": 153957240,
        "sender_full_name": "Melva Peters",
        "timestamp": 1525879283
    },
    {
        "content": "<p>Bundle is a mechanism for transporting from server to server, but it has no meaning and generally isn't persisted unless you're creating a FHIR document.  List allows you to maintain a currated list of \"current\" medications.</p>",
        "id": 153957258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525880769
    },
    {
        "content": "<p>Thank you guys. The other question is, the scenario is in home-care, if I would like to record the patient whether to take machine, only  Yes he/she taken the medicine. Could I use the Observation Resource  to record this event?</p>",
        "id": 153958191,
        "sender_full_name": "Winnicott",
        "timestamp": 1526106718
    },
    {
        "content": "<p>You could, but MedicationAdministration is probably better if you're recording a single administration or MedicationStatement if you're wanting to answer the general question \"are you currently taking this medication?\"</p>",
        "id": 153958203,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526109187
    }
]