[
    {
        "content": "<p>Is it possible to store \"Number of Previous Hospitalizations\" in Condition resource?</p>",
        "id": 245970678,
        "sender_full_name": "Mohsen Jafari",
        "timestamp": 1626274366
    },
    {
        "content": "<p>Technically speaking you can store any piece of information in any resource \"extension\" attribute list. But doing so means that you now have a custom implementation and only You and those consumers that are \"in the know\" about your custom implementation will know what the value is. I'm not aware of a specific resource where you could store a count (as a calculable field I wouldn't expect one). If you want to know the count, select all the encounters, that are inpatient AND are linked to that condition.</p>",
        "id": 245971970,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626274832
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span>, your answer was really helpful for me. I will use your approach. But one side question: I cannot see an \"extension\" attribute in Condition resource.</p>",
        "id": 245973037,
        "sender_full_name": "Mohsen Jafari",
        "timestamp": 1626275179
    },
    {
        "content": "<p>extensions aren't specific attributes, it's a capability of FHIR: <a href=\"https://www.hl7.org/fhir/extensibility.html\">https://www.hl7.org/fhir/extensibility.html</a></p>",
        "id": 245973531,
        "sender_full_name": "David Pyke",
        "timestamp": 1626275407
    },
    {
        "content": "<p>which is the right answer, but (at the risk of being pedantic) it may also be helpful to know that \"extension\" technically is in fact an attribute of Condition, and other resources.<br>\nIt is inherited, so it doesn't show in Condition itself - except that if you look in the \"Structure\" tab of Condition you will see extension listed on the top right in \"Elements defined in Ancestors:\"</p>",
        "id": 245992601,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1626283844
    }
]