[
    {
        "content": "<p>I have a requirement to model a Patient's new and previous General Practitioner in a message. Is there a best practice to do this? I see that STU3 Patient profile allows many generalPractitioner references, but there doesn't seem to be a way of saying one is the new practitioner and one the former practitioner. I can see that you could link a Patient to a Practitioner to a PractitionerRole and use a role of General Practitioner and then use period to bound the dates for the previous and new Practitiner. However, in the UK patients are generally registered with Practice rather than practitioner, so this wouldn't work.</p>\n<p>As I only have a requirement for new and previous Practitioner, I could use the Patient.link mechanism, creating a patient record linking to the current General Practitioner/Practice, then link to another patient record (for the same patient) detailing their previous General Practitioner/Practice (using link type \"replaces\"). </p>\n<p>Or do I use the EpisodeOfCare resource to hold 2 episodes of care (one for the previous GP/Practice, and one for the new GP/Practice with relevant dates etc.)?Previous and Current General Practitioner</p>",
        "id": 153919494,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1510673543
    },
    {
        "content": "<p>this sounds like a patch operation on the sly?</p>",
        "id": 153919495,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510673602
    },
    {
        "content": "<p>Patient.link is about duplicate patients.  Patient isn't designed to track anything other than the current practitioners.  If you want historical ones, you'll need to use an extension.  (Or look at Patient history)</p>",
        "id": 153919538,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510677490
    },
    {
        "content": "<p>Different EpisodeOfCare entities seems to be the closest one, if different practices are envolved. <br>\nOtherwise I would think of different encounters,</p>",
        "id": 153919563,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1510685939
    },
    {
        "content": "<blockquote>\n<p>Patient isn't designed to track anything other than the current practitioners. </p>\n</blockquote>\n<p>Am I the only one missing some kind of information qualifying the practitioner(s). What does it mean if a patient has more than one practitioner ?</p>",
        "id": 153919565,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1510686263
    },
    {
        "content": "<p>If I frequently move between two locations I may have a usual GP in each location.</p>",
        "id": 153919589,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1510700774
    },
    {
        "content": "<p>You might also have a GP, a dentist and a psychiatrist.  All could be listed.</p>",
        "id": 153919645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510737534
    },
    {
        "content": "<p>agreed, but how do I distinguish ? For now it's JBOP (just a bunch of practitioners). Which puts me back to my initial question: Is  nobody missing information qualifying the practitioner in his relation to the patient, which IMHO can't be an attribute of the practitioner but belongs to the relation.</p>",
        "id": 153919657,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1510738499
    },
    {
        "content": "<p>If you want to start to identify specific relationships, then you're looking at CareTeam.  with Patient.practitioner, you just have to infer based on what PractitionerRoles that Practitioner has.</p>",
        "id": 153919677,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510743486
    },
    {
        "content": "<p>I prefer the EpisodeOfCare with ManagingOrganisation being the practice and current GP being the CareManager but it doesn't show history of GP within an organisation. Wonder if this could be done with an extension allowing sub EpisodeOfCare (or Consultant Episodes within an episode/spell)</p>",
        "id": 153919681,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1510744457
    },
    {
        "content": "<p>type being 100 if using Uk/England codes</p>",
        "id": 153919682,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1510744577
    },
    {
        "content": "<p>OK - thanks for all your input. What seems most sensible is that I use Patient.generalPractitioner for the (new) current practitioner, as that's what would be expected to be held in this field (I can use Organization for just a Practice, or Practitioner linked to Oragnization for the General Practitioner). For the previous Practice/General Parctitioner I'll use EpisodeOfCare (managingOrganization &amp; careManager) as suggested (with period.end set &amp; period.start if that's available). Wouldn't want to be accused of creating a patch operation on the sly !?!</p>",
        "id": 153919725,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1510755844
    }
]