[
    {
        "content": "<p>From reading some of the historical discussions around the whole 'primary' vs. 'secondary' status of Coverage, it appears that this particular concept is subject to the context of the treatment.  What may be primary coverage in some situations may not be in others.  What is the current thinking about how to actually provide that context?  </p>",
        "id": 153857378,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1479331364
    },
    {
        "content": "<p>That context is the claim, and in a claim there may be a list of Coverages, the order of that list constitutes primary, secondary, tertiary, etc.</p>\n<p>What people have previously asked for is an element on the Coverage resource to indicate whether an instance of Coverage is primary, secondary etc - and that depends on the episode. </p>\n<p>We have added an element, now visible in the current build, called 'order' which may contain the relative order of the Coverages. A system could pick in order only those Coverages which apply to an episode and the resulting suite of Coverages would be the primary, secondary etc.</p>",
        "id": 153857530,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479385649
    },
    {
        "content": "<p>Some provider systems have existing elements to record the primary and the secondary coverages for a patient. They may put whatever they think are the primary and secondary coverages in those fields based on the nature of the episodes they deal with - for many providers that would be the first 2 Extended health policies, for others the national plan for the patient followed by an extended health for the patient, for others the Workers Compensation plan followed by the national plan number, etc.</p>",
        "id": 153857534,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479386103
    },
    {
        "content": "<p>The ordering or Coordination of Benefit is usually jurisdictionally determined and not everyone in the jurisdiction will agree. But typically it is:<br>\n1) Risk specific (eg auto) before risk general (extended health)<br>\n2) Your policy before your spouses<br>\n3) general programs (extended health) before specific losses (oncology specific)<br>\n4)general insurance before top-ups and catastrophe covers<br>\n5) payors of first-resort before not-specified before payors of last-resort <br>\n6) Complicated rules for dependants where the parents have remarried.</p>\n<p>And when two or more policies exist which are tied on all of those criteria then funky rules like 'the order of the birthday (in the year not the age) of the subscribers' are employed.</p>",
        "id": 153857535,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479386446
    },
    {
        "content": "<p>Thanks Paul, the 'order' element helps a lot.  We just needed the client to be able to provide some sort of priority for the Coverage.</p>",
        "id": 153857578,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1479404517
    }
]