[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span>, <br>\nIn our application, we need to capture a patient's Primary care provider in order to raise an issue 'Patient does not have a primary care physician<br>\n' if this is the case. I see several ways to do it (in DSTU2, we are currently stuck to it):  </p>\n<ul>\n<li>specify PCP in the <code>Patient.careProvider</code> Reference(Practitioner) and then check if this field has a reference to a practitioner; </li>\n<li>specify PCP in the <code>EpisodeOfCare.careTeam.member</code> Reference(Practitioner) with the <code>EpisodeOfCare.careTeam.role</code> = <code>SCTID: 446050000 Primary care physician (occupation)</code> and then check if current episode of care has a care team member with the SCTID: 446050000 role. </li>\n</ul>\n<p>What is the best approach? I'm wondering if anyone else has a similar use case. And, if so, how they approached it.</p>",
        "id": 153843732,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1471000267
    },
    {
        "content": "<p>why would you not use the first apporach? </p>",
        "id": 153843810,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471031776
    },
    {
        "content": "<p>The problem is that I need to  capture an answer to the question 'Does the patient have adequate access to this provider?   Yes/No' for each Medical Care Provider (to trigger corresponding issues in our application).<br>\nI'm not sure how to save it to a QuestionnaireResponse in the appropriate context (isn't it incorrect to save it to the Practitioner resource as a contained QR, is it?). Should it be a QuestionnaireResponse with source = Patient, item.subject = Practitioner (who is the care provider who we asking the patient about), and item.text = 'Does the patient have adequate access to this provider?'?<br>\nShould this be done through an extension to EpisodeOfCare.team.participant, or there are better ways?</p>",
        "id": 153845823,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1472559871
    },
    {
        "content": "<p>I'm a little lost with what the issue is here.<br>\nA questionnaireresponse would be stored against the patient that just has the values.<br>\nYou could do some pre-population from the patient context to check if either of those 2 fields exist (non standard techniques only at this point) however the result would jsut be storing a boolean to record the snapshot in time of what was observed, or entered for the patient.<br>\nIf you wanted to enter the primary care provider, then yes/no doesn't seem valid.<br>\nIf was a search, could do [base]/Patient?general-practitioner:missing=true or other similar queries.</p>",
        "id": 153845857,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1472590124
    },
    {
        "content": "<p>Sorry, I really was not clear with my questions. In our application, we record Provider Network and capture it as FHIR <code>CareTeam</code> and <code>Practitioners</code> resources, and there are the following options on the form for each Medical Team Member:</p>\n<ul>\n<li>name, role (like Oncologist, Cardiologist, etc), address, telecom</li>\n<li><code>Primary Care Provider</code> true/false</li>\n<li><code>Does the patient have adequate access to this provider?</code> Yes/No<br>\nSo in fact, there were two questions:<br>\n1) Where to store the value showing \"the patient does not have proper access to the practitioner\". This is a boolean value that triggers an issue, and not sure where to store this. Currently, we are storing it in a contained <code>QuestionnaireResponse</code> within the <code>Practitioner</code> resource (which is incorrect because is not in the context of a patient and episode of care).<br>\n2) Should we represent PCP as a <code>CareTeam.participant</code> with 2 roles: role1 = 'Primary Care Physician', role2 = 'PP' Primary Care Provider (<a href=\"http://hl7.org/fhir/ValueSet/v2-0286\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/v2-0286\">http://hl7.org/fhir/ValueSet/v2-0286</a>),<br>\nor as a <code>CareTeam.participant</code> with 1 role = 'Primary Care Physician', and reference in <code>Patient.generalPractitioner</code> to this practitioner;<br>\nor both two roles in <code>CareTeam</code>, and reference in <code>Patient.generalPractitioner</code>. <br>\nI feel confused because there are several possible ways, and I'm not sure which is better.</li>\n</ul>",
        "id": 153845941,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1472655436
    },
    {
        "content": "<p>\"does the patient have proper access\" sounds like an extension - I wouldn't embed a QuestionnaireResponse just to capture a single element.  For the second, Brian was indicating that they're looking at allowing multiple roles for one Practitioner on CareTeam.  In the interim, I'd probably repeat them multiple times. </p>",
        "id": 153845967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1472664047
    }
]