[
    {
        "content": "<p>I am currently mapping the Coverage resource, and I don't see a way to indicate whether the coverage is primary or not. The \"order\" element says not to use it for primary/secondary description. Has anyone implemented this, and if so how?</p>",
        "id": 173926287,
        "sender_full_name": "Caitlin Fisher",
        "timestamp": 1566512188
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 173926503,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566512376
    },
    {
        "content": "<p>Coverage is primary or secondary with respect to a particular claim - what's primary coverage for one claim might be secondary coverage for a different claim/prior authorization.  The ordering is therefore handled on the resource that references the coverage.</p>",
        "id": 173926723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566512605
    },
    {
        "content": "<blockquote>\n<p>The ordering is therefore handled on the resource that references the coverage</p>\n</blockquote>\n<p>I don't see that? (except on CoverageEligibilityRequest)</p>",
        "id": 173927425,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566513308
    },
    {
        "content": "<p>Claim.insurance has a \"sequence\" element that orders the various insurance referenced by the Claim</p>",
        "id": 173927651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566513574
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"236344\">@Caitlin Fisher</span> Coverage won't reserve its order depending upon the claim, however which of you coverages apply may change as a function of circumstance, therefore we don't identify the primary/secondary/tertiary directly on the Coverage resource.</p>\n<p>For example, assume that you and you spouse each have 'family' coverage, then your primary coverage would be your policy and your secondary would be spouses. But if your injury was due to an accident in your car then your auto insurance would likely be primary, your health coverage secondary and your spouses be tertiary. Unless this happened at work in which case Workers Compensation may be primary, your auto secondary, your policy tertiary and your spouses quaternary.</p>\n<p>Within a country there is generally an agreed ordering of policies, called the Coordination of Benefit order. The Coverages would be set in that order then for a given claim you would only select the coverages, in Coverage.order, which are applicable for that claim.</p>",
        "id": 173942198,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1566536220
    }
]