[
    {
        "content": "<p>Hi , Could you let me know which FHIR resource and what attributes represent prior authorization type code and prior authorization number that is submitted to the Pharmacy for medications that need pri-auth. Looks like  Claim.use = proposed and Claim.identifier  are the ones but not sure completely. Thank you.</p>",
        "id": 153983483,
        "sender_full_name": "Shalinee Batri",
        "timestamp": 1533696994
    },
    {
        "content": "<p>It should be ClaimResponse - Claim would be for prior auth request.  ClaimResponse would be the actual prior auth.  <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> , can you confirm the data elements?</p>",
        "id": 153983484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533697112
    },
    {
        "content": "<p>(And how the ClaimResponse would link to the MedicationRequest)</p>",
        "id": 153983485,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533697134
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196531\">@Shalinee Batri</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> A prior authorization would use a Claim resource with Claim.use=\"preauthorization\" (we changed the code value from 'proposed' to 'preauthorization'). The ClaimResponse would return the prior authorization number in ClaimResponse.insurance.preAuthRef and you would supply that in the subsequent Claim.insurance.preAuthRef .</p>\n<p>Also Shalinee, would you mind sharing for which country you are using this?</p>",
        "id": 153983578,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533721022
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  we would be using it for US.  Could you also let me know how it would link to MedicationRequest .</p>",
        "id": 153983594,
        "sender_full_name": "Shalinee Batri",
        "timestamp": 1533724008
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196531\">@Shalinee Batri</span> The MedicationRequest doesn't have an efficient place to hold the Prior Auth Number - I would have expected insurance to be a 0..* complex element containing (at a minimum) coverage 0..1 Reference(Coverage) and preAuthRef 0..* string. Instead the structure is insurance 0..* Reference(Coverage|ClaimResponse) - this assumes that they only way to get a Pre Auth Number is via a ClaimResponse - which is a very heavy way to convey a short string and ignores the reality that the Pre Auth Number may have been supplied in correspondence such as email or a letter or over the phone.</p>\n<p>If in your use case there will always be a ClaimResponse then you could include a reference to that resource, otherwise I'd suggest putting in a ballot comment in the upcoming ballot and reviewing the approach for proper handling of the Pre Auth Number with Financial Management, Attachments and Pharmacy at the September HL7 WGM meeting.</p>",
        "id": 153983598,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533725016
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> To clarify, the Claim is the prior authorization request.  The actual prior authorization record that you'd include with the prescription (if authorization was granted) would be the ClaimResponse, correct?</p>",
        "id": 153983670,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533737038
    },
    {
        "content": "<p>The reason for the full ClaimResponse is that the authorization may be for a particular quantity, for particular frequency, etc.  The pharmacy will need to know exactly what the authorization was for to understand what sorts of substition you can get away with.  It'll also want to know how much is going to be covered when discussing with the patient.</p>",
        "id": 153983672,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533737163
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"196531\">@Shalinee Batri</span> Payors provide a short authorization number or reference, typically less than 14 characters, via whatever means they communicate it: could be via a ClaimResponse but may be on paper or over the phone. While one could send the whole ClaimResponse to the Insurer, or the payors local reference to it (or a logical reference) not the providers local reference to it, it is conventional to just send the string of characters.</p>",
        "id": 153983815,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533761669
    },
    {
        "content": "<p>The question isn't what to send to payers - the question is what to send to the downstream clinical system that needs to know what's preauthorized.</p>",
        "id": 153983882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533764309
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"196531\">@Shalinee Batri</span> The downstream provider in your examples is the party who would typically do the preauthorization. Typically it is done by the same party who does the claim. If there is utility to send the ClaimResponse ok, but more value I would think would come from sending an ExplanationOfBenefit downstream as it has all the information needed and none of the more private provider-payer information.</p>",
        "id": 153983893,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533764815
    },
    {
        "content": "<p>In the case of pharmacy, it's often helpful if the ordering provider does the preauth - because they're the ones who can best fill out any forms - or change to a different drug if the payer requires.  The pharmacy doesn't generally have that information.</p>",
        "id": 153983908,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533766138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  right ! In our case , app is intended for providers who will be querying that if a prior auth required for a medication as per the benefit plan ( PBM ) that patient is holding. If PA is required , so they will send the claim resource (I'm just assuming)  to the Payer and get  response (ClaimResponse ) from Payer back. If it's approved then he might include that  auth number in the med order and send that to preferred pharmacy selected.  This is the workflow that we might be implementing. Still analyzing.</p>",
        "id": 153984001,
        "sender_full_name": "Shalinee Batri",
        "timestamp": 1533785074
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196531\">@Shalinee Batri</span> Right, the prescribing provider may send a preauthorization request and \"... might include that auth number in the med order …\", not the whole preauthorization response from the insurer.</p>",
        "id": 153984053,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533803169
    },
    {
        "content": "<p>@Shalinee just asking the question here, but is there a reason you wouldn't be using the NCPCP transactions created for this purpose?</p>",
        "id": 153984985,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1533919181
    },
    {
        "content": "<p>NCPDP is only relevant in the US</p>",
        "id": 153984999,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533923621
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span>   She is using it for the US, see above.</p>",
        "id": 153985001,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533923758
    },
    {
        "content": "<p>can someone please remind me what is the right way to model Prior Authorization.</p>",
        "id": 163043787,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1554929059
    },
    {
        "content": "<p>as part of our ambulatory workflow, we are adding getting Transportation setup for our patients.  What is the right way to model the Transportation.  It is like an Order or Service Request, and ideally is tied into the Patient and Clinic schedule.</p>",
        "id": 163043941,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1554929206
    },
    {
        "content": "<p>I'm sort of expecting Transportation to end up manifesting as a new resource.  <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> ?</p>",
        "id": 163047193,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554931300
    },
    {
        "content": "<p>Modeling of Transportation may very well be a new resource, but if it is simply a matter of getting authorization for  a coded transportation service then that would be a coded line item on the prior authorization or Claim. For example, T001 = ambulance, &lt; 20 miles, T002 = ambulance 21-100 miles, T003 = ambulance &gt; 100 miles;, T010 = air ambulance , etc.</p>",
        "id": 164070039,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1556102660
    },
    {
        "content": "<p>There are many types of transportation, and ways to charge for it. Especially in community or aged care at home settings too.<br>\nFor example covering the cost of travel to the patient, or taking patients on excursions.<br>\nThese may not involve any form of claims processing too, and just be simple invoicing, or internal charging/reimbursements.</p>",
        "id": 164070438,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1556103195
    },
    {
        "content": "<p>Agreed, but the question was asked in the context of prior authorization so insurance was assumed.</p>",
        "id": 164070722,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1556103546
    }
]