[
    {
        "content": "<p>A surgical procedure should take place for a patient. Before this is done, a ServiceRequest is produced, requesting that Procedure. Before setting the Appointment for that Procedure we need to know the priority , to determine how the priority compares to other Appointments that still have to be planned or are already planned. </p>\n<p>Where would you track this? </p>\n<p>For me the ServiceRequest would be the most logical place, as this would specify the priority of the request (A Procedure or Appointment might not exist yet). The problem is, that the ServiceRequest only allows routine | urgent | asap | stat as values. From our customers we get different and more values (Also differs between customers). A CodeableConcept would therefore be more appropriate, or at least the possibility to use other values, because by mapping to routine | urgent | asap | stat we would lose information.</p>\n<p>Any ideas?</p>",
        "id": 214018215,
        "sender_full_name": "René Störmer",
        "timestamp": 1603267040
    },
    {
        "content": "<p>Do you mean the \"urgency\" of the request as seen by the requester, or the priority that is assigned by the performer?<br>\nFor example we can have 2 urgents, but only one would be the first one to be answered.</p>",
        "id": 214037819,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603279985
    },
    {
        "content": "<p>if you mean the urgency as seen by the requester, i.e. not knowing if that urgency is going to be respected by the performer, we would typically expect a finite set of priority levels.</p>",
        "id": 214037880,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603280043
    },
    {
        "content": "<p>I think the current value set is standard</p>",
        "id": 214037970,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603280115
    },
    {
        "content": "<p>I do not know if there is a reason  why this binding is required shouldn't be preferred (possibly because allowing different values is a great way to mess up screening and assigning)?</p>",
        "id": 214037985,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603280124
    }
]