[
    {
        "content": "<p>I am trying to figure out how to model expected / possible / known complications. We are working on pro-active plans and want to put on a careplan possible problems (conditions) and what to do if that happens. The current Problem clinicalStatus doesnot have the value for \"possible\". Am I looking at the right place? Thanks.</p>",
        "id": 189673476,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1583313643
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191395\">@Dave Carlson</span> Is this question addressed in the Care Plan work you do?</p>",
        "id": 189675823,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1583315963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 189699676,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583334390
    },
    {
        "content": "<p>I can bring it back to the Patient Care work group for consideration...  My initial thought is that the Condition.clinicalStatus should be describing the status of the condition or health concern where the condition, itself, is a risk.  Thus, the risk is an active concern.  Again, we'll discuss on the PC call today at 5pm Eastern to see if we need to clarify or update any of the definitions (clinicalStatus definition and/or clinical status code definitions).</p>",
        "id": 189805831,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1583423778
    },
    {
        "content": "<p>The current definition of active is \"The subject is currently experiencing the symptoms of the condition or there is evidence of the condition.\" which makes sense. There is no value for \"possible risk\". Would be great if that is added. Thanks for bringing this question to the group. Looking forward to the answer.</p>",
        "id": 189808440,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1583425292
    },
    {
        "content": "<p>The condition is the risk, so it's partially perspective of substituting \"risk\" where you read \"condition\".  Look at this example, <a href=\"http://build.fhir.org/condition-example-family-history.json.html\" target=\"_blank\" title=\"http://build.fhir.org/condition-example-family-history.json.html\">http://build.fhir.org/condition-example-family-history.json.html</a>, where the condition.code = family member history of colon cancer.  The status in our example is active.  That doesn't mean that the patient has colon cancer, rather it means the family history / risk is still an active concern.  Status is always a complex discussion within Patient Care, but I will certainly bring it up to see how we can clarify this.</p>",
        "id": 189822818,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1583433574
    },
    {
        "content": "<p>Stated another way, it feels like you are wanting to use status to augment what the condition.code is representing, whereas in our example the code conveys that independently of status.</p>",
        "id": 189823012,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1583433688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span>  Patient Care confirmed my earlier guidance that we would expect the Condition.code to convey Risk of X (such as Risk of Infection).  Patient Care agreed that the clinical status code definitions should be clarified.  We started to edit the definitions, such that:<br>\nactive = The condition is being actively managed or tracked.  For example, the subject is currently experiencing the symptoms of the condition, there is evidence of the condition, or recognition of a risk. <br>\nThat said, we did not have enough time to finish the discussion or take a vote.  Feel free to add yourself as a watcher to <a href=\"http://jira.hl7.org/browse/FHIR-26464\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26464\">J#26464</a>.  We'll probably resume this discussion on Thurs, March 19.</p>",
        "id": 189850157,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1583452207
    },
    {
        "content": "<p>This helps, thanks! But the other problem I have now is that our used SNOMED CT subset doesnot have the \"risk of ...\" codes, that is why I wanted to express the \"risk of\" as a status code.</p>",
        "id": 189879215,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1583490447
    },
    {
        "content": "<p>When Patient Care discussed that, we concluded that there are a subset of risks that rise to the level of concern to warrant management and tracking (e.g. risk of infection, risk of falls, etc).  SNOMED does have some of the common Risk of codes available (e.g. Finding of at risk (finding) SCTID: 281694009 and its children).  Where codes are not available, the resource allows having Condition.code.text without any codings.</p>",
        "id": 189892878,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1583501953
    },
    {
        "content": "<p>Wouldn't Observation and RiskAssessment resources be more appropriate for capturing the \"Risk of...\" statements?</p>",
        "id": 190227295,
        "sender_full_name": "Halina Labikova",
        "timestamp": 1583875634
    },
    {
        "content": "<p>I think RiskAssessment is beter for the probable condition, but there is no way to document for a RiskAssessment what the agreed \"action to take\" will be. In CarePlan you can do this, but not for a RiskAssessment. It look that we cannot put a RiskAssassment  with the associated \"action to take\" on a CarePlan. And that is what we need for Proactive (Palliative) Care Planning.</p>",
        "id": 190297015,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1583941719
    },
    {
        "content": "<blockquote>\n<p>Wouldn't Observation and RiskAssessment resources be more appropriate for capturing the \"Risk of...\" statements?</p>\n</blockquote>\n<p>Refer to <a href=\"http://build.fhir.org/condition.html#scope\" target=\"_blank\" title=\"http://build.fhir.org/condition.html#scope\">http://build.fhir.org/condition.html#scope</a>, which says:</p>\n<blockquote>\n<p>each of the following conditions could rise to the level of importance such that it belongs on a problem or concern list due to its direct or indirect impact on the patient’s health. These examples may also be represented using other resources, such as FamilyMemberHistory, Observation, RiskAssessment, or Procedure.</p>\n</blockquote>\n<p>The key part (for Condition) is rising to a level of concern that warrants ongoing management and tracking.</p>",
        "id": 190440003,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1584044499
    }
]