[
    {
        "content": "<p>Hello everyone, I am new to FHIR/ epic API and I am trying to start developing an integration with our healthcare software using the API.<br>\nThe problem that I have found so far is that I was asked to include clinical notes from our software and upload them to epic. but the endpoint has a mandatory input parameter for the encounter. and I don't manage to find how to create an encounter using the API. any reason why encounters can't be created through the API? we are a telehealth software that attends patients using virtual sessions but don't know how to proceed at this point without creating the encounters in the platform. thank you very much in advance for your help!</p>",
        "id": 218637760,
        "sender_full_name": "Franco Iannolo",
        "timestamp": 1606953449
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span></p>",
        "id": 218638524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606953991
    },
    {
        "content": "<p>Server shall provide a capability statement. Therefore you should be able to request that. In return it should provide you with the necessary details.</p>",
        "id": 218660992,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1606980975
    },
    {
        "content": "<p>Encounter creation is a really complicated API to create, there are a <em>lot</em> of business rules involved, and we just don't have it yet.   Do you have an Epic representative you are working with?   There might be other non-FHIR options (I get that FHIR is probably ideal, but when there isn't infinite time and money to re-build everything in FHIR, sometimes falling back to other methods is a reasonable option).</p>",
        "id": 218700014,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1607005975
    },
    {
        "content": "<p>Also, do you know if the Epic system already has a telehealth encounter for the notes to land on?  I.e. is scheduling of these encounters done in Epic?  And what note type are you wanting to send?  Are these progress notes, or when you say \"notes\" is it really a summary document of what happened during the telehealth encounter that want to get into Epic?  Is there any discrete data (like problem list items or allergies) that you document on the telehealth encounter in your system that should come over discretely?</p>",
        "id": 218700566,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1607006192
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  We want to send notes which contains summary text. Epic has only one type of api for clinical notes which is progress notes. That is where we were trying to create encounter to test that. If there were other clinical notes api like consultation notes which doesnt require encounter then we could have used that too.</p>",
        "id": 218707492,
        "sender_full_name": "Akash Kumar",
        "timestamp": 1607008809
    },
    {
        "content": "<p>Well, we do support more note types than just progress note, but in our API, we require encounter for all of them.  It sounds like your use case is really more like an encounter summary exchange.   Are you working with a specific health system?  Or are you part of our App Orchard program?</p>",
        "id": 218709881,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1607009638
    }
]