[
    {
        "content": "<p>We are trying to present patient's long term problems using FHIR. According to the standard, I should be able to use Condition resource with category=problem-list-item. There are two questions:<br>\n1) problem in the problem list has priorities. <br>\n2) some problem have lable \"present on admission\".  There is V2 table 0859 for that. <a href=\"http://build.fhir.org/v2/0895/index.html\" target=\"_blank\" title=\"http://build.fhir.org/v2/0895/index.html\">http://build.fhir.org/v2/0895/index.html</a><br>\nany suggestion how to solve these two?</p>",
        "id": 154017829,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542058707
    },
    {
        "content": "<p>Find my answer - I should use EpisodeOfCare for priority and POA</p>",
        "id": 154017830,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542059125
    },
    {
        "content": "<p>Condition is something a patient \"has\".  Priority is relevant to a particular context - a particular encounter or a particular practitioner's problem list.  Encounter.diagnosis allows a rank to be associated with the diagnosis and also a flag that it represents an admitting diagnosis.  If you're just dealing with a particular practitioner's problem list, the notion \"present on admission\" is irrelevant because the list spans encounters.  The priority is managed by ordering the List resource instance.  Each practitioner can have their own list and can choose which Conditions are relevant problems and how important they are.  (The psychiatrist, the ob-gyn and the dentist will likely have very different problem List instances for the same patient at the same time.)</p>",
        "id": 154017832,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542059575
    },
    {
        "content": "<p>Our use case is that clinician need to be able to change the order of problem list, moving some problem up/down, and label one or more problems as either \"primary concern\" or \"poa\". I cannot fully rely on the default ordering of a list because, based on existing data, the list is not fully ordered. For example, if there are 5 problems in the list, one is priority 1, one is priority 2 and the rest three are not-prioritized (priority 0). So I need to find a way to passing these information through FHIR API.</p>",
        "id": 154018032,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542121932
    },
    {
        "content": "<p>Primary concern only makes sense in the context of an Encounter - at least in the uses I've seen for that phrase.  You're correct that List doesn't currently support partial ordering, but I think it's reasonable to define a standard extension to support that if that's something that's needed.</p>",
        "id": 154018036,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542122372
    }
]