[
    {
        "content": "<p>Hi all,</p>\n<p>Within the scope of a European Commission supported research &amp; innovation project (<a href=\"http://www.c3-cloud.eu/\" target=\"_blank\" title=\"http://www.c3-cloud.eu/\">http://www.c3-cloud.eu/</a>), we are trying to create our own profile on top of the <code>CarePlan</code> resource via Forge. All is fine while working with DSTU2 resources; however we need to proceed with STU3 and could not make it work in Forge. </p>\n<p>First we downloaded the <code>StructureDefinition</code> of <code>CarePlan</code>from 2016Sep STU3 and tried to open it in Forge (13.2 for DSTU2 1.02), and got invalid resource format exception. Then we noticed that there is a Forge specific pack of STU3 definitions at <a href=\"http://hl7.org/fhir/2016Sep/downloads.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/downloads.html\">http://hl7.org/fhir/2016Sep/downloads.html</a>. We extracted the <code>CarePlan</code> structure definition from that pack, and again tried to open it via Forge, but this time I get the following exception: Unexpected ElementDefinition at index 132 with path '<a href=\"http://CarePlan.participant.id\" target=\"_blank\" title=\"http://CarePlan.participant.id\">CarePlan.participant.id</a>' from basePath = 'CarePlan'. The STU3 version does not have the <code>participant</code> attribute, so it seems like Forge is somehow checking against the DSTU2 version of <code>CarePlan</code>. </p>\n<p>We could not find a STU3 specific release of Forge either. So, my question is, how can we profile a STU3 resource?</p>\n<p>Thanks in advance.</p>",
        "id": 153846087,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1472741736
    },
    {
        "content": "<p>I would also like to create a Profile for a STU3 Task resource.  What is the recommended way to do this?  Can I somehow contribute to a STU3 release of Forge to get this done more collaboratively?</p>",
        "id": 153846107,
        "sender_full_name": "Brian Nantz",
        "timestamp": 1472756134
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> - this is for you to comment on. but this is work in progress</p>",
        "id": 153846146,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472764596
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192507\">@Mustafa Yuksel</span> &amp; <span class=\"user-mention\" data-user-id=\"191856\">@Brian Nantz</span> The current public Forge release (v13.2) is based on a version of the FHIR.NET API that only supports <em>known</em> resource types. If you try to open a StructureDef for an unknown resource type (e.g. a new STU3 resource), then the API fails to deserialize the XML and throws an exception.<br>\nWe've updated the API and Forge to support unknown resource types. The new Forge release is still under development and not available yet. We'll publish a new Forge release in about 2 weeks for the upcoming HL7 WGM. With the new Forge release, you will be able to profile new (STU3) resources based on DSTU2 StructureDefinitions. This requires an custom version of validation.zip and a bit of hacking. Unfortunately the current custom validation.zip on the download section is not 100% correct and needs some corrections. So I am reluctant to release this to the community right now, as I expect to receive a lot of support questions from users - which I don't have time to handle...</p>",
        "id": 153846255,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1472814271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> Thank you so much for the detailed explanation. I am looking forward to trying the new release of Forge. </p>",
        "id": 153846256,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1472816816
    },
    {
        "content": "<p>CarePlan is not a new resource?</p>",
        "id": 153846261,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472818873
    },
    {
        "content": "<p>Correct. However Forge 13.2 does not yet support the new custom validation.zip.</p>",
        "id": 153846262,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1472819739
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> for the roadmap plan!  If there is anything I can help you with to expedite this please let me know.</p>",
        "id": 153846313,
        "sender_full_name": "Brian Nantz",
        "timestamp": 1472845752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191856\">@Brian Nantz</span> thank you for offering to contribute! For now, I need to focus on finishing the next release. After that, I may be able to spend some time on STU3-on-DSTU2  support. Could be that the upcoming Forge release handles the current custom validation.zip, or maybe the xml's still need some corrections - which I would gladly delegate ;p</p>",
        "id": 153846325,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1472849098
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>, when can we expect to have the new Forge release to have STU3 (on-DSTU2) support? </p>",
        "id": 153852462,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1476106990
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192507\">@Mustafa Yuksel</span> we will officially update all our tools to STU3 after publication of the new FHIR spec. There is a preliminary workaround that allows you to create STU3 profiles using the current release. However this requires a bit of hacking and (due to time constraints) we can only provide support for this to our paying customers.</p>",
        "id": 153852463,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1476107364
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> </p>",
        "id": 153852465,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1476108227
    }
]