[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12633\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12633\">GF#12633</a> has been logged to split up Procedure into Procedure and ProcedureStatement.  The proposal is that Procedure would represent detailed information about procedure execution  whereas ProcedureStatement would represent summary information often reported by the patient.</p>\n<p>Patient Care is looking for feedback from implementers:<br>\n1) Do you represent Procedure and ProcedureStatement separately in your system? <br>\nIf so, 2) What are some of the differences in the elements supported?</p>\n<p>Examples might include:</p>\n<ul>\n<li>ProcedureStatement supports fuzzy or estimated performed dates or ages (e.g. when patient was 20 years old; \"early 2014\") whereas Procedures executed during an encounter often have a more precise performedDateTime or performedPeriod (i.e. Age | Range | string data choices not needed).</li>\n<li>Procedures executed may have a reference to the ProcedureRequest (order) whereas ProcedureStatements may not.</li>\n<li>Procedures executed may have a reference to a DiagnosticReport (e.g. surgical note) whereas ProcedureStatements may not.</li>\n</ul>",
        "id": 153892996,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1496946985
    },
    {
        "content": "<p>Most Australian systems keep procedure statements as entries in the medical history, and they are poorly differentiated from Conditions - if they are differentiated at all </p>",
        "id": 153893009,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496955556
    },
    {
        "content": "<p>Why wouldn't PS have a derivedFrom to allow a system to effectively shortcut PR --&gt; PS skipping P altogether?</p>",
        "id": 153893018,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496956870
    },
    {
        "content": "<p>You certainly could skip P.  Both event resources could point to the request.  Main difference is the full procedure will have a lot more detail (and likely a lot of descenadant procedures and other resources) dealing with all of the surgical steps, anaesthesia adjustments, specific devices used, etc.  It would support real-time surgical decision support and would be the foundation for the surgical report.  ProcedureStatement wouldn't typically have components and might summarize procedures done for a period of time (e.g. physio-therapy, exercise, training, etc.)  The corollary is the difference between MedicationStatement and MedicationAdministration.</p>",
        "id": 153893021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496959844
    },
    {
        "content": "<p>What are the principle used to decide when to separate resources, such as Procedure, and when to merge them, for example [x]Request?</p>",
        "id": 153893067,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1496987262
    },
    {
        "content": "<p>Consistency of data elements and whether most implementations tend to treat them (store them, display them, etc.) distinctly</p>",
        "id": 153893074,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496990006
    },
    {
        "content": "<p>As a side note, in addition to using this analysis to determine if two resources are warranted, we can also use this same analysis to determine if a profile is needed on a single resource (e.g. ProcedureStatement could be a profile if it is simply a subset of the Procedure elements).  Hence, our ask to the community to tell us the differences.  </p>",
        "id": 153893132,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1497023034
    },
    {
        "content": "<p>So where Does this leave us with the ReferralRequest, is it now represented by these 2 also? (does that still make sense?)</p>",
        "id": 153896448,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499652700
    },
    {
        "content": "<p>I think Procedure vs. ProcedureStatement is orthogonal to the question of whether to merge ReferralRequest into ProcedureRequest.  (In general, we have more \"event\" resources than \"request\" resources.)</p>",
        "id": 153896484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499698367
    },
    {
        "content": "<p>e.g.,  I refer a cat to the eye doctor using ProcedureRequest and the eye doctor phacos the lens. -  which could be represented by  Procedure or PS ) ....  is there something more to your question Brian?</p>",
        "id": 153896611,
        "sender_full_name": "Eric Haas",
        "timestamp": 1499795729
    },
    {
        "content": "<p>Looks like my mistake, ReferralRequest ==&gt; ProcedureRequest, not Procedure, so the ProcedureStatement doesn't come into it.</p>",
        "id": 153896678,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499814268
    }
]