[
    {
        "content": "<p>We are exploring how we expose a source of clinical procedure data in FHIR. This particular source holds \"body site\" and \"laterality\" in an uncoded form (or as poorly managed codes). We could concatenate the two into a single string to place in Procedure.bodysite.text but this reduces the fidelity of the data and only works in one direction. </p>\n<p>Where we have data sources using SNOMED then I understand the expectation is to use post coordination (which has different issues!) but for scenarios where this is not possible is there a consistent approach?</p>",
        "id": 246070046,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1626340633
    },
    {
        "content": "<p>You can use BodyStructure - either as an independent identified instance or as a contained resource.</p>",
        "id": 246098371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626357869
    },
    {
        "content": "<p>In some cases there are also extensions available</p>",
        "id": 246098403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626357887
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - presumably when using BodyStructure it would have to be via an extension as It is not referenced from procedure itself.</p>",
        "id": 246110982,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1626362975
    },
    {
        "content": "<p>Correct.  There is, however, a standard extension.  (The belief is that, right now, we don't have wide support in systems for more than a simple code - tracking detailed locations or tying observations and procedures to specific tumors, lesions, fetuses, etc. is 'advanced' functionality that properly lives in extension space.  If you don't think that's accurate, you can always file a change request <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 246111282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626363088
    },
    {
        "content": "<p>Thats fine - thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .  The Extension route will be fine for now.</p>",
        "id": 246111733,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1626363251
    }
]