[
    {
        "content": "<p>I am trying to create instances for scheduled procedure. (eg: Patient will have this surgery next week.) So I have a Procedure which is referenced in an Appointment. What is the status for this Procedure? I feel that the only value I can use is \"unknown\" (<a href=\"http://hl7.org/fhir/valueset-event-status.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-event-status.html\">http://hl7.org/fhir/valueset-event-status.html</a>).</p>",
        "id": 169492848,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1562083003
    },
    {
        "content": "<p>I don't think <code>unknown</code> would be appropriate, as the spec says:</p>\n<blockquote>\n<p>The \"unknown\" code is not to be used to convey other statuses. The \"unknown\" code should be used when one of the statuses applies, but the authoring system doesn't know the current state of the procedure.</p>\n</blockquote>\n<p>In my opinion, I'd use <code>preparation</code>.  It's a decent match if you have a liberal reading of the term \"staging activities\" -- and the fact that it maps to the <em>canonical status</em> <code>planned</code> makes me think it is probably the most appropriate status for what you're describing.</p>",
        "id": 169494442,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1562084241
    },
    {
        "content": "<p>That was my first choice. Then I was kindly backed off. Yes <code>Planned</code> is more accurate. Call it <code>Preparation</code> is a little bit strange.</p>",
        "id": 169495071,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1562084696
    },
    {
        "content": "<p>The Workflow model has a Task resource which has intent with 'plan' as a value.  This is where it would be nice to have consistency between the workflow-related resources and the Workflow 'model'.  <a href=\"http://hl7.org/fhir/valueset-task-intent.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-task-intent.html\">http://hl7.org/fhir/valueset-task-intent.html</a></p>",
        "id": 169501914,
        "sender_full_name": "John Silva",
        "timestamp": 1562089294
    },
    {
        "content": "<p>Procedure should only come into existence when some sort of work has actually started on it.  Until then, you just have Appointment and/or ServiceRequest.  Procedure.status of 'preparation' is for things like pre-op tests or registration or getting the surgical suite ready before the patient shows up.</p>",
        "id": 169502961,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562089927
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> But Appointment.reasonReference can reference to a procedure. \"Reason the appointment has been scheduled to take place, as specified using information from another resource.\"<br>\nAnd what you said was my understanding. But then the EventStatus value set (<a href=\"http://build.fhir.org/valueset-event-status.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-event-status.html\">http://build.fhir.org/valueset-event-status.html</a>) states that \"preparation\" is <code>~planned</code>.</p>",
        "id": 169507585,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1562092762
    },
    {
        "content": "<p>If you're booking an appointment because of a Procedure, it's because of the results of the previous procedure, not because of a planned procedure.  (The latter would be handled by pointing to a ServiceRequest.)  Preparation is the 'planning' stage - it's getting stuff ready.  But it's an \"Event\" resource, which means that it doesn't begin until you're doing <em>something</em>.  All ordering/proposing/planning where nothing's been done yet is handled using Request resources.</p>",
        "id": 169508477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562093398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> That makes senses. But ServiceRequest was introduced in R4, what is the equivalent in STU3 and DSTU2?</p>",
        "id": 169516264,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1562099159
    },
    {
        "content": "<p>Proc request</p>",
        "id": 169517551,
        "sender_full_name": "Eric Haas",
        "timestamp": 1562100152
    }
]