[
    {
        "content": "<p>For the value set event-status used for procedure.status, there is a code unknown. In the definition of unknown, it says: “Note: This concept is not to be used for \"other\" - one of the listed statuses is presumed to apply, but the authoring/source system does not know which.”</p>\n<p>Does this imply that there is a way to handle “other”? I have a client who is interpreting this to mean that there is a way to handle other.</p>\n<p>Here is one example of what they are trying to solve:</p>\n<p>If the user system defined “contraindicated” , and we do not know which one to put this as procedure.status, how do you define other in standard value set required?</p>\n<p>Thanks for your help!<br>\nRob</p>",
        "id": 242068212,
        "sender_full_name": "Rob Brull",
        "timestamp": 1623246733
    },
    {
        "content": "<p>Thanks for the specific example; this helps a lot in the analysis, and probably gives you a better sense of how to handle the general case too.</p>\n<p>\"Contraindicated\" isn't really a valid kind of status for a procedure -- but it's a very useful statusReason (<a href=\"http://hl7.org/fhir/procedure-definitions.html#Procedure.statusReason\">http://hl7.org/fhir/procedure-definitions.html#Procedure.statusReason</a>). This might be accompanied by a status like <code>not-done</code> to indicate that the procedure wasn't performed because of a contraindication. Or if the procedure was possibly performed despite the but you  aren't actually sure..  then in that case you could use status <code>unknown</code> -- but you would especially want to populate the reason in this case.</p>",
        "id": 242069673,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623247259
    },
    {
        "content": "<p>You could also have a ServiceRequest with do-not-perform set to 'true' if you're wanting to say \"please don't do this\" as opposed to \"I opted to not do this\".</p>",
        "id": 242071601,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623247937
    },
    {
        "content": "<p>Thanks Josh and Lloyd! That gives me some options.</p>",
        "id": 242082358,
        "sender_full_name": "Rob Brull",
        "timestamp": 1623251937
    }
]