[
    {
        "content": "<p>This <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=11119\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=11119\">GF#11119</a> tracker is comparing and contrasting  ProcedureRequest and DiagnosticRequest -  they are structurally nearly identical in STU3 and as we explain <a href=\"http://build.fhir.org/procedurerequest.html#bnr\" target=\"_blank\" title=\"http://build.fhir.org/procedurerequest.html#bnr\">here</a> lots of overlap in usage.   We are wondering if  there  is a case for combining Diagnosticrequest and ProcedureRequest?  What is the case for keeping them separated?</p>",
        "id": 153866085,
        "sender_full_name": "Eric Haas",
        "timestamp": 1483980207
    },
    {
        "content": "<p>Do existing systems currently track these separately - and are they consistent in the boundaries they draw between the two types?  That should be the primary driver</p>",
        "id": 153866174,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484002723
    },
    {
        "content": "<p>i think they're different because a diagnostic request is actually asking for an outcome - that a diagnostic report be produced. What procedures need to happen varies. Specimen collection, for instance</p>",
        "id": 153866185,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484011849
    },
    {
        "content": "<p>In our system, these are both tracked as orders.  The FHIR boundaries have already caused us some headaches when we tried to use the order catalog to infer the boundaries, which we quickly learned doesn't work well.  From my notes, the following are example order catalog types that might have a mix of diagnostic and non-diagnostic orders, thereby making the identification of which subset to expose as DiagnosticRequest more challenging. </p>\n<ul>\n<li>Women's Services -- radiology tests (diagnostic) as well as orders to check dilation (non-diagnostic)</li>\n<li>RT -- pulmonary function test (diagnostic) and orders to change ventilator settings (non-diagnostic)</li>\n</ul>",
        "id": 153866190,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1484014354
    },
    {
        "content": "<p>does that raise a wider issue about mixed composite orders?</p>",
        "id": 153866192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484015300
    },
    {
        "content": "<p>At the moment, composite orders are expected to be treated as independent orders grouped either by requisition id or as sub-tasks of a common task</p>",
        "id": 153866194,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484015716
    },
    {
        "content": "<p>Isn't the outcome determined by the Task?  I don't really understand what is meant by asking for a outcome  and how that would differentiate them.  A ProcedureRequest for a Specimen draw would be asking for a Specimen.   Or an ProcedureRequest for an upper GI scoping would result in a report as well.  Isnt that the same thing.  was thinking more along the lines of Lloyd's point.  Are these handled separately already?</p>",
        "id": 153866197,
        "sender_full_name": "Eric Haas",
        "timestamp": 1484016451
    },
    {
        "content": "<p>All orders have an outcome.  The main difference is that DiagnosticRequest have a primary outcome that is informational while ProcedureRequests have a primary outcome that is a modification of the subject.  So I would say that an order to check dilation would be diagnostic - you get back a value.  Agree that an order to change ventilator settings would result in a Procedure.</p>",
        "id": 153866198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484017255
    },
    {
        "content": "<p>There are semantic and structural differences between the two.<br>\nSemantically and outcome perspective:-<br>\nDiagnostic procedures are done to detect and diagnose. They may or may not result in change in the patient/subject. <br>\nColonoscopy without biopsy - no change; colonoscopy with biopsy - results in change<br>\nIntervention/therapeutic procedures are intended to produce therapeutic effect, whether that is behavioral or physical - results in change<br>\nStructurally:<br>\nDiagnostic procedure - requires structure to support specimen collection and details<br>\nIntervention/therapeutic procedure - does not involve specimen collection</p>",
        "id": 153866208,
        "sender_full_name": "Stephen Chu",
        "timestamp": 1484023842
    },
    {
        "content": "<p>BTW, there are a number of inconsistencies between the two resources that will need to be resolved, examples:<br>\nDiagnosticRequest.context and ProcedureRequest.encounter<br>\nDiagnosticRequest.occurrence[x] and ProcedureRequest.schedule[x]<br>\nDiagnosticRequest.authoredOn and ProcedureRequest.orderedOn<br>\nDiagnosticRequest.request and ProcedureRequest.order<br>\nDiagnosticRequest.reasonCode   .reasonReference and ProcedureRequest.reason[x] (reasonCodeableConcept | reasonReference)</p>",
        "id": 153866211,
        "sender_full_name": "Stephen Chu",
        "timestamp": 1484026774
    },
    {
        "content": "<p>most of those differences probably need to be reslved anyway</p>",
        "id": 153866212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484029305
    },
    {
        "content": "<p>Still, in my mind the big question is whether implementers are splitting these requests based on the semantic niceties that Stephen and Lloyd described.   If not then I think we should consider combining them.</p>",
        "id": 153866319,
        "sender_full_name": "Eric Haas",
        "timestamp": 1484072332
    },
    {
        "content": "<p>a DiagnosticRequest is fulfilled by the provision of a DiagnosticReport. various procedures may or may not be required to get to that point</p>\n<p>A ProcedureRequest is filfulled by carrying out a procedure. is there intended/required to be a record of fulfillment? </p>",
        "id": 153866321,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484079221
    },
    {
        "content": "<p>all institutions I've worked with have different forms for diagnostic and procedure and supply requests....</p>",
        "id": 153866322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484079302
    },
    {
        "content": "<p>I agree with you, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , that the \"forms\" are not the same.  That said, let me reconcile that statement with my prior comments. <br>\nThe \"forms\" for entering and modifying diagnostic request and procedure request orders differ in our system, too.  However, there isn't a single \"form\" for all diagnostic requests and a single \"form\" for all procedure requests.  The \"forms\" will flex depending on a variety of variables (e.g. orderable, user placing the order, location, encounter type, etc.).  Despite the variances in what is visually shown to the end user, the backend persists all orders (medications, too) in a generic orders schema (i.e. abstracting each attribute/element within the form to be an \"order detail\").  We are able to differentiate medication requests because they all share the same pharmacy order catalog type.  However, that methodology doesn't work to identify diagnostic requests as my prior examples illustrated.</p>",
        "id": 153866369,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1484143162
    }
]