[
    {
        "content": "<p>How to model relation between specific Procedure/ProcedureRequest and Patient Consent?</p>",
        "id": 153973664,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530784380
    },
    {
        "content": "<p>are you talking about consent to operate?</p>",
        "id": 153973677,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530792312
    },
    {
        "content": "<p>Yes</p>",
        "id": 153973682,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530794536
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> ?</p>",
        "id": 153973692,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530797928
    },
    {
        "content": "<p>We have not yet gotten much engagement with those that have the domain knowledge on 'consent to operate'. Thus this is NOT today included in the model. Please bring your use-case to the committee for analysis and inclusion in updates of the Consent resource.</p>",
        "id": 153973695,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530798266
    },
    {
        "content": "<p>It's a modifier.  You append it to the name of an existing criteria</p>",
        "id": 153973700,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530798803
    },
    {
        "content": "<p>Nope... the Consent.scope element has a clear definition to differentiate the various areas of consent, with a vocabulary \"treatment\" readily available for the use-case. What we lack is a understanding on how to use the rest of the elements in Consent for that use-case.   It is possible that Consent.provision.type=permit (allow this to happen - yuck, don't like this), and Consent.provision.actor is the doctor or team authorized to do this, and Consent.provision.data references that procedure that is being authorized to be done..... BUT, This is more of a hack of what is there, not because it was designed to do that.</p>",
        "id": 153973706,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530799136
    },
    {
        "content": "<p>so, no need for isModifier... it is part of the definition</p>",
        "id": 153973707,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530799157
    },
    {
        "content": "<p>AH, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I think your comment was on a different stream \":text vs _text\"???</p>",
        "id": 153973710,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530799222
    },
    {
        "content": "<p>Yes.  Sorry.  Fixed :)</p>",
        "id": 153973716,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530799781
    },
    {
        "content": "<p>In our case we need to link Consent to specific Chemotherapy Procedure Request.</p>",
        "id": 153973721,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530800035
    },
    {
        "content": "<p>I think, this is common case to get consent to do some procedure.</p>",
        "id": 153973724,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530800077
    },
    {
        "content": "<p>Procedure consents are very common.  It's absolutely something that needs to be supported.  We just haven't had people coming to the table asking for them or willing to get involved in the development yet.  Feel free to get the party started...</p>",
        "id": 153973725,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530800159
    },
    {
        "content": "<p>@nicola, How about Consent.scope element of \"treatment\" readily available for the use-case. . It is possible that Consent.provision.type=permit (allow this to happen - yuck, don't like this), and Consent.provision.actor is the doctor or team authorized to do this, and Consent.provision.data references that procedure that is being authorized to be done.....</p>",
        "id": 153973726,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530800174
    },
    {
        "content": "<p>the commitee members are willing.. just simply don't have the domain knowledge... so as I have said, and Lloyd has emphasized... .please get engaged with the CBCP and help develop this. Even putting your use-case into a CR would be a major benefit.</p>",
        "id": 153973729,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530800241
    },
    {
        "content": "<p>I'm thinking about who is a source of reference and who is a target. Let's consider simple use case: Physician recommends some procedure for patient, asks for consent and create order / procedure request, later procedure is completed and documented.  We can have references from ProcedureRequest and Procedure to Consent or Consent can refer ProcedureRequest, which later will be referred by Procedure. Do we have some rule of thumb to decide on reference direction?</p>",
        "id": 153973742,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530801033
    },
    {
        "content": "<p>I am not sure we are both on the same use-case.... Are you speaking of a \"consent to treat\", which is an authorization from the patient to carry out some specific treatment.... Or are you speaking about a \"privacy consent\", which is an authorization to allow some/all data be used for some purpose?  Or are you trying to do both in the same 'consent'? Don't try to combine then into one.</p>",
        "id": 153973750,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530801448
    },
    {
        "content": "<p>First - consent to treat</p>",
        "id": 153973753,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530801551
    },
    {
        "content": "<p>Okay. I would think the Consent would point at the procedure that it is authorizing.  The consent-to-treat would need to point at the procedure it is authorizing. I don't think the procedure would have any need to point at the consent. right?</p>",
        "id": 153973756,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802040
    },
    {
        "content": "<p>May be - but consent can be taken before Procedure instance is created?</p>",
        "id": 153973758,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530802163
    },
    {
        "content": "<p>right... I am noticing that... So, seems when it comes to scheduled actions, ServiceRequest or CarePlan, are the thing that the consent-to-treat is authorizing?</p>",
        "id": 153973759,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802219
    },
    {
        "content": "<p>see.... not subject matter expert....   :-)</p>",
        "id": 153973761,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802240
    },
    {
        "content": "<p>or a Procedure.code = preparation</p>",
        "id": 153973764,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802295
    },
    {
        "content": "<p>Would EpisodeOfCare or Encounter be logical too?</p>",
        "id": 153973765,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802344
    },
    {
        "content": "<p>Patient gives Consent to Provider to do some procedure/treatment, which at that moment is abstract and can be represented as code in .action element. But it would be useful to link this Consent to instances of ServiceRequests/Procedures - so we can see this relationship from data.</p>",
        "id": 153973768,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530802550
    },
    {
        "content": "<p>so the use-case is that they are authorizing the procedure by some vocabulary value?</p>",
        "id": 153973770,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802635
    },
    {
        "content": "<p>Yes. And we need to track this Consent from Order/Request</p>",
        "id": 153973771,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530802683
    },
    {
        "content": "<p>Im not sure I understand what the value of linking them post-hoc? They are linked by 'time'.  I guess you could revise the Consent, but that might not be the right procedural thing, as it would then look like 'revisionist history', might break any digital signature...</p>",
        "id": 153973772,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802726
    },
    {
        "content": "<p>Long shot.... you could use a Provenance to link the future created Procedure, as being in fulfillment of the Consent-to-treat... yuck</p>",
        "id": 153973774,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802813
    },
    {
        "content": "<p>By regulations practitioner has to ask for consent for specific procedure before order it. But later when somebody will inspect procedures, potentially he will be interested in consent</p>",
        "id": 153973775,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530802824
    },
    {
        "content": "<p>right, today this is done by looking based on TIME and the procedure code... If I find a consent-to-treat in the right timeframe, and it has the same procedure code... then it must have been the one to authorize that procedure... right?</p>",
        "id": 153973776,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802895
    },
    {
        "content": "<p>Yes</p>",
        "id": 153973777,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530802920
    },
    {
        "content": "<p>counter... if this is really strict, then one would be in an environment where a ServiceRequest or CarePlan always exists... else no Procedures (beyond emergency) are allowed.</p>",
        "id": 153973778,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802939
    },
    {
        "content": "<p>and if you have a ServiceRequest or a CarePlan... those instances are the ones that the Consent-to-treat points at.</p>",
        "id": 153973780,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530802975
    },
    {
        "content": "<p>so the only hole is an environment that wants to have strict consent-to-treat, but doesn't want to have ServiceRequest or CarePlan... right?</p>",
        "id": 153973781,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530803018
    },
    {
        "content": "<p>emergency exceptions happen...</p>",
        "id": 153973782,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530803056
    },
    {
        "content": "<p>this seems like a reasonable and realistic model... right?</p>",
        "id": 153973784,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530803134
    },
    {
        "content": "<p>Your proposal is to refer ServiceRequest/CarePlan from Consent.data element, is it?</p>",
        "id": 153973786,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530803283
    },
    {
        "content": "<p>Yes. Consent.scope=treatment,  Consent.provision.data points at either a ServiceRequst, CarePlan, or Procedure (in preparation status)</p>",
        "id": 153973787,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530803599
    },
    {
        "content": "<p>Note that there is a mandatory Consent.category.... which I think in when the consent is a consent-to-treat would contain the procedure code.... BUT this is the kind of modeling that needs input from the community.</p>",
        "id": 153973791,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530803820
    },
    {
        "content": "<p>Thank you, think this works for us</p>",
        "id": 153973792,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530804048
    },
    {
        "content": "<p>note: .source could still point at the text that the patient actually saw...  policy might have some value, but likely empty. policyRule very likely empty. verification might be used when the patient themselve can't approve.... Let me know how it works out... best case, give me an example we can put into the spec.</p>",
        "id": 153973793,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530804268
    },
    {
        "content": "<p>Yes, i will create an example, when we finish this module!</p>",
        "id": 153973823,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530814354
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> note this, from the Consent scope:</p>",
        "id": 153973868,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530818103
    },
    {
        "content": "<p>There are four anticipated uses for the Consent Resource, all of which are written or verbal agreements by a healthcare consumer [grantor] or a personal representative, made to an authorized entity [grantee] concerning authorized or restricted actions with any limitations on purpose of use, and handling instructions to which the authorized entity must comply:</p>\n<ul>\n<li>Privacy Consent Directive: Agreement to collect, access, use or disclose (share)*  information.</li>\n<li>Medical Treatment Consent Directive: Consent to undergo a specific treatment (or record of refusal to consent).</li>\n<li>Research Consent Directive: Consent to participate in research protocol and information sharing required.</li>\n<li>Advance Care Directives: Consent to instructions for potentially needed medical treatment (e.g. DNR).</li>\n</ul>\n<p>This resource is scoped to cover all four uses, but at this time, only the privacy use case is modeled. The scope of the resource may change when the other possible scopes are investigated, tested, or profiled.</p>",
        "id": 153973869,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530818105
    }
]