[
    {
        "content": "<p>Hello everyone,<br>\n We are using ProcedureRequest resource for test orders (lab). Is there a way to use one entity to capture all the common stuff on  an order? For example ordering practitioner or cc’list will be the same for all test requests in one order, we would like to avoid repeating the common information</p>",
        "id": 153935585,
        "sender_full_name": "Natalya Pogrebetsky",
        "timestamp": 1517947493
    },
    {
        "content": "<p>Task resource, and workflow execution: <a href=\"http://build.fhir.org/workflow-communications.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow-communications.html\">http://build.fhir.org/workflow-communications.html</a></p>",
        "id": 153935586,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1517947822
    },
    {
        "content": "<p>Thank you Vassil. But ProcedureRequest  resource is not on the workflow- summary list.</p>",
        "id": 153935589,
        "sender_full_name": "Natalya Pogrebetsky",
        "timestamp": 1517948858
    },
    {
        "content": "<p>The general rule in FHIR is \"repeat everything everywhere\".  The reason is that even if in a particular interaction you know that you're passing along a bundle of information where the receiver might be able to \"infer\" that certain information applies multiple places, there's no guarantee that information will be shared in the same packaging structure in the future.  Furthermore, experience with the notion of \"conducted\" context turned out to work rather badly in other HL7 standards.  It was very difficult to specify cleanly what sort of conductance should occur.  And even when well-specified, it was inconsistently implemented.</p>\n<p>So: In FHIR, everything gets asserted on every single resource instance - who the patient is, who the author is, when it was created, who should action it, etc.  This is still pretty light-weight because most of these common elements are references - so you only need to include the URL pointer to the Patient, Practitioner, Organization, Device, etc.</p>\n<p>If a resource doesn't list a subject, that means that there is no subject or the subject is unknown.  It does NOT mean the subject should be inferred from some other element.</p>",
        "id": 153935607,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517952423
    },
    {
        "content": "<p>Natalia, please take a look at <a href=\"http://build.fhir.org/servicerequest.html\" target=\"_blank\" title=\"http://build.fhir.org/servicerequest.html\">http://build.fhir.org/servicerequest.html</a> - unless there's a need to keep backwards compatibility with some existing implementation, it seems that ServiceRequest is the most current resource that represents diagnostic requests (such as lab orders).</p>",
        "id": 153935778,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1518017359
    },
    {
        "content": "<p>Thank you Lloyd and Vassil!</p>",
        "id": 153935780,
        "sender_full_name": "Natalya Pogrebetsky",
        "timestamp": 1518020144
    }
]