[
    {
        "content": "<p>i have one checkbox filed in past surgical history which represent to  \" Laparoscopic procedure/ Hysterectomy\"  . i am confused how to give correct resource type for this field.  before that i was thinking to give procedure with code like =  \"code\": {<br>\n   \"text\":\"Laparoscopic or Hysterectomy\"<br>\n  }  is there any show this resource in better way..</p>",
        "id": 153943762,
        "sender_full_name": "rahul kumar",
        "timestamp": 1520849681
    },
    {
        "content": "<p>Your other two alternatives are QuestionnaireResponse and Observation.  Which is best really depends on how you're expecting the data to be used.</p>",
        "id": 153943823,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520866569
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - A quick follow-up question here. I'm still struggling to understand the boundary between Observation and Procedure, even after reading through the respective resource boundary sections and various Zulip threads. The example we have been thinking through is representing an eye exam. Let's say that the provider performs an eye exam and confirms the patient has does not have optic disc abnormalities. What resources are most appropriate to use? Our current approach is:</p>\n<ul>\n<li>Create a Procedure resource, where Procedure.code is \"Examination of retina (procedure)\" (SNOMED 274798009).</li>\n<li>Create an Observation resource, where Observation .code is \"Optic disc or retinal nerve fiber layer structural abnormalities Left eye by Ophthalmoscopy\" (LOINC 71486-5) and Observation.value is \"Negative measurement finding (finding)\" (SNOMED 442225006).</li>\n<li>Link the two resources using Observation.partOf and referencing the Procedure resource (though the Observation is not required to have a reference to the Procedure)</li>\n</ul>\n<p>The FHIR resource guide (<a href=\"https://www.hl7.org/fhir/resourceguide.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/resourceguide.html\">https://www.hl7.org/fhir/resourceguide.html</a>), section 2.33.2.4, says that physical exams should be represented as Observations. However, in the case where you want to know how the provider performed the exam (i.e. the specific SNOMED code), it seems more conceptually correct to represent the Procedure and Observation separately.</p>\n<p>Maybe more generally, is there any existing documentation that further explain when to use Procedure vs Observation, re your comment about it \"depending on how you're expecting the data to be used\"?</p>",
        "id": 154000304,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1538063093
    },
    {
        "content": "<p>You wouldn't use Procedure at all</p>",
        "id": 154000309,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538063536
    },
    {
        "content": "<p>Procedure is for when you're trying to change the patient in some way.  If all you're trying to do is gather information, that's an Observation, not a Procedure.</p>",
        "id": 154000310,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538063562
    },
    {
        "content": "<p>If you're doing surgery and looking at some things as you go, then that would be a Procedure with component Observations.</p>",
        "id": 154000311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538063606
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, that simple description helps clarify. DiagnosticReport also seems similar. Adding to your points above, and with respect to clinical actions performed to gather information, is it fair to summarize as follows?</p>\n<ul>\n<li>Use Procedure to represent an invasive action performed to gather information (e.g. a biopsy)</li>\n<li>Use DiagnosticReport to represent an imaging test performed to gather information (e.g. a mammogram)</li>\n<li>Use Observation to represent any other general actions performed to gather information (e.g. an eye exam, or a cognitive assessment)</li>\n</ul>",
        "id": 154000322,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1538065035
    },
    {
        "content": "<p>Procedures aren't necesarily invasive.  Counselling and education are still procedures.<br>\nDiagnosticReport is a collector - it represents the \"report\" - and typically points to a whole lot of Observations.  DiagnosticReport gets used for lab and other things, not just Observations</p>",
        "id": 154000325,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538065285
    },
    {
        "content": "<p>If you have suggestions for how to make the resource guidance clearer, feel free to submit a change request</p>",
        "id": 154000326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538065308
    }
]