[
    {
        "content": "<p>I am looking at STU3 resources for implementing, and i now face an issue:</p>",
        "id": 153873531,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108073
    },
    {
        "content": "<p>Use case is simple: <br>\nPrescription is Medication X = brand Y, manufacurer Z, 30 per box, etc. It's a type, as usual in orders.<br>\nWhen administering, we are saying  \"I used THIS specific instance of this medication, lot=123, serial=456, expiry date=76453\". It's an instance, as usual (always) in events.</p>",
        "id": 153873532,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108135
    },
    {
        "content": "<p>Device contains those elements.</p>",
        "id": 153873533,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1488108199
    },
    {
        "content": "<p>Current options in Administration / DeviceUseRequest are to either use a codeableConcept, or point to a medication. Latter seems obviously more appropriate.</p>",
        "id": 153873534,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108199
    },
    {
        "content": "<p>So, the order points to a TYPE resource (medication or device), but the administration must point to what? another device resource instance?</p>",
        "id": 153873535,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108258
    },
    {
        "content": "<p>the way i see it, this requires that systems must implement ONE resource for storing the TYPE information, and ADDITIONALLY ONE RESOURCE FOR EACH PHYSICAL INSTANCE.</p>",
        "id": 153873537,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108327
    },
    {
        "content": "<p>meaning, if I have 10 packs of medication in sotck, each with different lot and expiry date (not to mention serial numbers in each unit), then I would have 11 resources - one for the type and another for each instance.</p>",
        "id": 153873538,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108394
    },
    {
        "content": "<p>I don't see a serial number on Medication. </p>",
        "id": 153873539,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1488108410
    },
    {
        "content": "<p>comments?</p>",
        "id": 153873540,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108418
    },
    {
        "content": "<p>Can you not just refer to the same instance of Medication?</p>",
        "id": 153873541,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1488108426
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> don't worry, serial number will eventually be there (core or extension). but that is not the point here.</p>",
        "id": 153873542,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108457
    },
    {
        "content": "<p>No, because two people administering different medication instances must capture different lot numbers. So needs to be stored diffferently</p>",
        "id": 153873543,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108531
    },
    {
        "content": "<p>Ok, that's beyond me - hoping a pharma person will jump in to assist.</p>",
        "id": 153873544,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1488108609
    },
    {
        "content": "<p>same applies for devices.</p>",
        "id": 153873545,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108626
    },
    {
        "content": "<p>Order \"deviceX, GTIN=12312312312312\". Resource id=1<br>\nDeviceUseStatement = device XY, GTIN=12312312312312, lot=123, expiry=2017-09-09, serial=123, ResourceId=??</p>",
        "id": 153873546,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108759
    },
    {
        "content": "<p>For devices I'd expect a separate device instance for each device as each contains a single UDI equivalent - yes like you've just included above.</p>",
        "id": 153873547,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1488108796
    },
    {
        "content": "<p>i have seen projects crash because of this, and now i need to provide some implementation guidance, so I want to put this to test.</p>",
        "id": 153873548,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488108842
    },
    {
        "content": "<p>thx Paul, for devices, indeed that is the way I can see it working with the current resources - and then each physical instance resource would point to the \"parent\" type, which has the \"static\" info and can even contain other characteristics.</p>",
        "id": 153873550,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488109097
    },
    {
        "content": "<p>It would be a rather large number of devices though, and eventually not all device instances need to contain all the information on the device type. Example, recalling a previous discussion: in each device INSTANCE, you don't have to store if it has latex or not, because it could point to a device TYPE, and the device TYPE says \"has latex\".</p>",
        "id": 153873551,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488109150
    },
    {
        "content": "<p>and this will be definitely fun (or funny) when we have to implement serialization in medication - each medication in a hospital having a unique serial number :)</p>",
        "id": 153873552,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488109198
    },
    {
        "content": "<p>My current idea is to consider a logical pattern for \"physical instance\", and this pattern could be used in either<br>\na) the resources like Medication and Device<br>\nb) in the Event resources</p>",
        "id": 153873553,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488109307
    },
    {
        "content": "<p>in any case, i would say a consistent pattern would be better.</p>",
        "id": 153873554,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488109325
    },
    {
        "content": "<p>logical model</p>",
        "id": 153873555,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488109368
    },
    {
        "content": "<p>Any ideas?</p>",
        "id": 153873556,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488109395
    },
    {
        "content": "<p>When administering or dispensing, some use-cases will allow you to just capture the type with no \"lot\" or similar instance data.  In those cases, you can get away with using the same medication instance.  But if you're going to capture lot information, then the dispense and administrations will absolutely need to point to a different medication than the request.  (In many cases, the references will be at different levels of granularity too - ordering a generic formulation but administering a specific manufactured drug.)  I'm not sure I understand the issue with doing this though . . .</p>",
        "id": 153873568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488123086
    },
    {
        "content": "<p>the operational issue i can see is that we must embed or point to a different resource for each serial number, which means thousands of resources</p>",
        "id": 153873579,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488135542
    },
    {
        "content": "<p>Sure.  Every distinct serial number is a distinct inventory item, so not sure why that would be an issue.  You'd have been doing the same thing in the v2 world.</p>",
        "id": 153873580,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488135773
    },
    {
        "content": "<p>the messages in v2 are a bit more transient. and we never stored the full description of an item for each inventory item, so we never stored \"aspirin 100 mg, bayer, ....., lotX, SerialY\". We'd store the definition and inventory differently: product1: \"aspirin 100 mg, bayer, ...\" . Item 1 = \"product1,lot, serial\".</p>",
        "id": 153873590,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488139476
    },
    {
        "content": "<p>If you don't want them as separate resource instances, you can make them contained.</p>",
        "id": 153873592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488140089
    },
    {
        "content": "<p>this is where i was going with separating: Why not link the definition part, and contain the inventory item part?</p>",
        "id": 153873597,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488141907
    },
    {
        "content": "<p>having separate resources does not mean they would be separate in the application's database, i understand that. but it would seem sensible to at least have a good separation between those two parts - type (definition) vs physical item.</p>",
        "id": 153873598,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488142023
    },
    {
        "content": "<p>It's the same thing.  If you were going to store the inventory information in your database - one vial, lot xyz, manufacturer Q, that would be on the same record as captured what kind of drug it was and what its ingredients were.</p>",
        "id": 153873600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488142314
    },
    {
        "content": "<p>inventory and type information would be in different data structures(tables)</p>",
        "id": 153873601,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488142399
    },
    {
        "content": "<p>for a given clinical event, we have both. But for inventory management, it would be best not to store 20k lines saying \"aspirin, acetylsalisilic acid, bayer, box of 30, price.... lot 1, serial 2, expiry date 3/4\". We'd store one table with aspirin, and another with only the inventory-specific properties</p>",
        "id": 153873603,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488142539
    },
    {
        "content": "<p>maybe unintended consequence: if we need to send \"inventory lists\", i.e. system A tells System B about stock at hand, we'd have a lot of overhead if we have to send one medication resource per inventory item.</p>",
        "id": 153873605,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488143425
    },
    {
        "content": "<p>This has nothing to do with what you store - it's about what you send.  And you need to send both.  If you want to store them separately, you can.</p>",
        "id": 153873606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488144023
    },
    {
        "content": "<p>yes, but the definition part (type) could be by reference, the physical item part by embedding.</p>",
        "id": 153873607,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488144473
    },
    {
        "content": "<p>we can make today's resources work because everything is optional , and I can send only the relevant part. But i see no way to say that \"this aspirin 100 mg, lot 123 is actually a physical instance of the aspirin 100 mg that i have in my catalog\".  Only repeating the description info</p>",
        "id": 153873608,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488144693
    },
    {
        "content": "<p>i think i will bring up the use cases.</p>",
        "id": 153873609,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488144880
    },
    {
        "content": "<p><a href=\"http://fhir3.healthintersections.com.au/open/MedicationAdministration/ihemedadmin0171-a1\" target=\"_blank\" title=\"http://fhir3.healthintersections.com.au/open/MedicationAdministration/ihemedadmin0171-a1\">http://fhir3.healthintersections.com.au/open/MedicationAdministration/ihemedadmin0171-a1</a></p>",
        "id": 153873644,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488154904
    },
    {
        "content": "<p>this is an administration of a single tablet. Using FHIR feels strange (i think the medication Resource will struggle with its identity as definition of a type and physical item). It has some issues: <br>\n1. Don't have serial number, <br>\n2. can't link the medication administration to the instance order and to the original prescription,<br>\n3. I have to \"add\" a resource for the physical item. this is not intuitive. I would rather add the physical item part, not a whole medication resource. Perhaps it is my perspective.</p>",
        "id": 153873646,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488155241
    },
    {
        "content": "<p>I don't know why MedicationAdministration doesn't have basedOn as per the Event pattern.  That would have let you point to the order(s) and seems like something that ought to be in the 80%.  If you're in an environment that does inventory management, the Medication instance with the lot number, etc. would already have existed.  If not, then a contained resource would be appropriate.</p>",
        "id": 153873648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488155727
    },
    {
        "content": "<p>It has \"prescription\" which allows to link to the prescription (i think that is what BasedOn corresponds to), but if I need to link to the instance order, that is not possible</p>",
        "id": 153873750,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488188944
    },
    {
        "content": "<p>Have there been any Change requests resulting from this  discussion? I currently have the problem that I want to create a catalogue of device <em>type</em> resources, but I don't see a way of how to distinguish these \"abstract\" types from the \"instance\" types.</p>",
        "id": 153915037,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1508493712
    },
    {
        "content": "<p>Hi Simone. no updates to the resources yet. I will try to create a few tracker items. Would love to have your input, especially because you are confirming that the difference Type/Physical is relevant.</p>",
        "id": 153915040,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508496530
    },
    {
        "content": "<p>meanwhile, hope you are aware of the Catalog discussions</p>",
        "id": 153915041,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508496551
    },
    {
        "content": "<p>basically the catalog is an \"Authored/Curated list of device types including their relationships and additional metadata\"</p>",
        "id": 153915042,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508496596
    },
    {
        "content": "<p>We discussed a few options at last week's OO conf call and look forward to seeing them mocked up in a way that will help us move forward on an approach for Device.</p>",
        "id": 153915151,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508540257
    }
]