[
    {
        "content": "<p>We use Observation resource to model tumor findings. A tumor finding has many attributes, such as size, shape, location. Since all attributes are part of the same finding, we use a single Observation resource for all the attributes of the same finding, using the Observation.component element - so we have multiple components. How do I create a profile which states the possible attributes? How do I do it with the Forge tool? I don't care about the order of the attributes, I just want to limit the types of attributes and set their structure (e.g. for some attributes we use a ValueQuantity, for others a valueCodeableConcept).</p>",
        "id": 153857327,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1479316747
    },
    {
        "content": "<p>Read up on \"slicing\" here: <a href=\"http://build.fhir.org/profiling.html#slicing\" target=\"_blank\" title=\"http://build.fhir.org/profiling.html#slicing\">http://build.fhir.org/profiling.html#slicing</a> and search for one of the forge video tutorials that demonstrate how slicing is done using the tool</p>",
        "id": 153857350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479325870
    },
    {
        "content": "<p>I did some slicing of components <a href=\"http://healthedatainc.com/go-ftp/micro/gramstain-component.html\" target=\"_blank\" title=\"http://healthedatainc.com/go-ftp/micro/gramstain-component.html\">here</a> </p>",
        "id": 153857366,
        "sender_full_name": "Eric Haas",
        "timestamp": 1479329777
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 153857367,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1479329809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192982\">@Shlomy Reinstein</span> Slicing in Forge is easy: select an element in the tree (must be a list or a type choice element) and click on the \"Slice\" toolbar button. Then you can click on the\"Add Slice\" toolbar button to add individual slicing constraints. Don't forget to assign unique names to your slices.</p>",
        "id": 153857507,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1479381589
    }
]