[
    {
        "content": "<p>On the Profiling page it says \"The extension definition also defines the context where the extension can be used (usually a particular path or a data type) and then defines the extension element using the same details used to profile the structural elements that are part of resources.\", does this mean that an extension can restrict the type of a Resource field, for instance constrain a Reference to certain resource types?</p>",
        "id": 153869251,
        "sender_full_name": "Stefan Dimitrov",
        "timestamp": 1485447231
    },
    {
        "content": "<p>You've got to use a profile if you want to do restriction. I think the latter part of the definition is just saying you use a StructuredProfile resource for both resources and extensions</p>",
        "id": 153869335,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1485509859
    },
    {
        "content": "<p>Can a FHIR profile constrain fields of referenced resources?</p>",
        "id": 153869372,
        "sender_full_name": "Stefan Dimitrov",
        "timestamp": 1485538543
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191606\">@Stefan Dimitrov</span> , you would need to profile each resource where you need to constrain any field. <span class=\"user-mention\" data-user-id=\"191363\">@Vadim Peretokin</span> , I think you mean StructureDefinition (there is no StructuredProfile resource)?</p>",
        "id": 153869374,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1485542150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191606\">@Stefan Dimitrov</span> A profile can assert a target profile for a reference - which would in turn restrict the referenced artifact.  However, a profile can't \"drill down\" into the content of a referenced resource the way it can drill into the components of a data type.  (Note that drilling down into a contained resource or an element of type Resource (e.g. in Bundle.entry) would still be possible in principle, though may not yet be supported by all tools.</p>",
        "id": 153869408,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485575039
    },
    {
        "content": "<p>Sorry, yes meant StructureDefinition.</p>",
        "id": 153869521,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1485797163
    },
    {
        "content": "<p>hello All , may i know what tool is best to create  extension and profiles in fhir? upto now i used clinfhir. as forge doesn't support json as well as STU3. but i come to know that clinfhir is not a standard tool. so whats the alternate to clinfhir? how fhir core extensions and profiles  created. please let me know.</p>\n<p>Thank you</p>",
        "id": 153885707,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493030739
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span> there are a number of different tools that support authoring FHIR profiles. ClinFHIR is originally developed to support clinical connecthatons, so it provides a simplified user interface targeting clinicians (not developers). Forge is aimed to be a reference implementation that tries to support all aspects of FHIR profiling (fairly extensive support, but still work in progress; STU3 release to be published this week). Lantana provides the Trifolia tool, which is also a HL7 profile editor. And there is the MDHT tool, a UML-based modeling tool.<br>\nFHIR core resources and datatypes are usually designed by manually authoring XML and/or JSON source, because the available profiling tools are usually lagging behind (i.e. while authoring the new STU3 release, available profiling tools were still targeting DSTU2).</p>",
        "id": 153885727,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1493041171
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> . what you are saying is , creating the extensions and profile manually is best way. okay. but it's some what difficult and what should i take care while creating them manually? what's the exact process? actually in the begining i tryed that but facing problems. so i used clinfhir. so please help me.</p>",
        "id": 153885876,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493095364
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span>, actually I'm suggesting that you try to pick a tool that you like. Although it is certainly possible to author XML/JSON profiles manually, I wouldn't recommend it as it is quite involved and fairly easy to introduce errors - while developing the tools, we identified and fixed quite a number of errors in the hand-written core resource definitions. ClinFhir works great for basic use cases and has a very friendly user interface, so if you like the tool, please continue to use it! For more advanced scenario's you could use one of the other tools, e.g. Forge. Note that it is trivial to convert FHIR resources between XML and JSON, so although it may be a bit inconvenient, that shouldn't be a show stopper.</p>",
        "id": 153885886,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1493109588
    },
    {
        "content": "<p>again thank you. <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> .  actually we are building an ipad app stu3 support. where forge willn't support stu3 right. present i'm using clinfhir but i don't know whether it's a standard or not. and  for one of the screen we have to create the questions form. so to do that we are planing to use clinfhir(buildScenario) but don't know whether this process is correct? or not?</p>",
        "id": 153885889,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493110184
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span>, we are now finalizing the new Forge for STU3 release and it will be available for download ASAP. There is no \"standard\" tool, FHIR itself defines the standard and there are many tools available that implement (specific parts of) the standard. ClinFHIR is a profiling tool designed and used for HL7 clinical connectathons and it is widely accepted. Forge has also gained a significant user base and has been used in production scenarios since FHIR DSTU1.<br>\nYou already found the Zulip streams, which is a great help for implementers. Don't hesitate to ask your questions in here, as the FHIR community is very helpful. You may even find other developers working on the same problem space.</p>",
        "id": 153885893,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1493111812
    },
    {
        "content": "<p>okay sure. <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> .</p>",
        "id": 153885895,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493112079
    },
    {
        "content": "<p>I'm looking for a sound example use of ElementDefinition.type.targetProfile vs ElementDefinition.type.profile - I have a hard time understanding it so I would like to know if someone can explain it</p>",
        "id": 153891929,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1496312163
    },
    {
        "content": "<p>say the type of element is Reference(Patient)</p>",
        "id": 153891931,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496318896
    },
    {
        "content": "<p>type.profile is a profile that applies to Reference()</p>",
        "id": 153891932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496318910
    },
    {
        "content": "<p>type.targetProfile applies to the Patient part </p>",
        "id": 153891933,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496318919
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I don't follow. Why would type.profile differ from type.targetProfile? Let's say my profiled encounter needs to reference a profiled patient and no other patient profiles. How would profile and targetProfile differ? What is gained?</p>",
        "id": 153891939,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1496328023
    },
    {
        "content": "<p>\"profile\" would assert constraints that apply to the Reference data type.  E.g. whether Reference.reference or Reference.display were required or mustSupport.  \"targetProfile\" would assert constraints that apply to the referenced resource - Patient in this case.</p>",
        "id": 153891940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496328406
    },
    {
        "content": "<p>so \"profile\" (when marking subject in forge) in forge is a referene to Encounter.subject.reference (in my case)?</p>",
        "id": 153891941,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1496329441
    },
    {
        "content": "<p>profile on Encounter.subject would apply to the data type of Encounter.subject (which is Reerence).  targetProfile on Encounter.subject would apply to what the reference points to</p>",
        "id": 153891948,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496331119
    },
    {
        "content": "<p>Is there an example where this is used (eg. DAF or somewhere else)?</p>",
        "id": 153891957,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1496337112
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>  I have an example here for the targetProfile subject: <a href=\"http://chmed16af.emediplan.ch/StructureDefinition-chmed16af-mp-composition.html\" target=\"_blank\" title=\"http://chmed16af.emediplan.ch/StructureDefinition-chmed16af-mp-composition.html\">http://chmed16af.emediplan.ch/StructureDefinition-chmed16af-mp-composition.html</a></p>",
        "id": 153891960,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1496339962
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> - As far as I can see your example does not contain any types that both have profile AND targetProfile. I understand use of the targetProfile</p>",
        "id": 153891962,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1496340322
    },
    {
        "content": "<p>it's pretty unusual to do both, because mostly we don't take the time to profile Reference itself. But since we added .identifier, it becomes more common. Consider: you want to say:<br>\n- you have to provide a reference, and not an identifier<br>\n- the reference has to point to a US patient</p>",
        "id": 153891976,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496350504
    },
    {
        "content": "<p>you need both for that</p>",
        "id": 153891977,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496350508
    },
    {
        "content": "<p>I'll make an example and a gforge to add to profiling doco ... its bound to come up again.</p>",
        "id": 153891980,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496351509
    },
    {
        "content": "<p>Even before Reference.identifier got added, you might want to have made Reference.reference 1..1 (by default it's optional, meaning you can have a Reference that just has a display).  As well, you might want to insist on (or more rarely prohibit) Reference.display.</p>",
        "id": 153891991,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496354705
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - now I sort of get it ... but as you point out, I would also expect it to be uncommon that one profiles the Reference it self (I could be wrong here).  <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> - I'll be looking forward to see your great example :)</p>",
        "id": 153892041,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1496387379
    },
    {
        "content": "<p>yes it's not that common. But it's growing. I've done it - rule out identifier and display</p>",
        "id": 153892042,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496387774
    },
    {
        "content": "<p>It would be nice if the description was better, that's where I looked and it didn't help explain the situation</p>",
        "id": 153892043,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1496387886
    },
    {
        "content": "<p>do you want to create a task?</p>",
        "id": 153892044,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496387903
    },
    {
        "content": "<p>Yeah happily so. Actually how can I search for tasks I've already made - might have reported it before. I don't know how to filter by all tasks I've ever submitted in gforge</p>",
        "id": 153892045,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1496387980
    },
    {
        "content": "<p>Aha, it seems to be <a href=\"http://gforge.hl7.org/gf/my/monitors/\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/my/monitors/\">http://gforge.hl7.org/gf/my/monitors/</a></p>",
        "id": 153892046,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1496388195
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13474\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13474\">Filed</a></p>",
        "id": 153892048,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1496388459
    },
    {
        "content": "<p>thx</p>",
        "id": 153892050,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496388567
    },
    {
        "content": "<p>Please note that the initial Forge STU3 release introduces support for both type.profile and type.targetProfile. However there are still a few bugs in the validation logic were it inspects the wrong field and complains. We're planning to publish a bugfix release shortly that will fix this.</p>",
        "id": 153892059,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1496392534
    },
    {
        "content": "<p>In SD it looks like this....</p>\n<div class=\"codehilite\"><pre><span></span>     &lt;element id=&quot;Basic.subject&quot;&gt;\n    ...\n      &lt;type&gt;\n      &lt;code value=&quot;Reference&quot;/&gt;\n       &lt;profile value=&quot;http://www.fhir.org/guides/ig-template/StructureDefinition/ifr&quot;/&gt;\n      &lt;targetProfile value=&quot;http://hl7.org/fhir/us/core/StructureDefinition/us-core-patient&quot;/&gt;\n       &lt;/type&gt;\n        ...\n</pre></div>\n\n\n<p>Its implemented <a href=\"http://build.fhir.org/ig/Healthedata1/IG-Template/StructureDefinition-template-basic2.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/Healthedata1/IG-Template/StructureDefinition-template-basic2.html\">here</a> and <a href=\"http://build.fhir.org/ig/Healthedata1/IG-Template/StructureDefinition-ifr.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/Healthedata1/IG-Template/StructureDefinition-ifr.html\">here</a> but<br>\na couple of issues with ig-pub tool so not rendering correctly ( see <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13480\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13480\">GF#13480</a>)</p>\n<p>instead of <code>Reference(US Core Patient Profile)</code>  it should be  <code>Identifer Free Reference Data Type(US Core Patient Profile)</code></p>",
        "id": 153892203,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496462649
    },
    {
        "content": "<p>hello all,here my doubt is,  if i create a patient profile based on HL7 Patient resource, and i'm using othere resources as it is. for example in AllergyIntolerance.patient is refering to the base hl7 Patient,  but where as in our case we created the patient profile then again shall i need to create AllergyIntolerance profile which is ponting to our Patient profile? if yes, then un neccesarly i need to create profiles for all the Resources which are pointing to the Patient  right?  please any suggestions? how to solve this. </p>\n<p>Thank you.</p>",
        "id": 153892285,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496646608
    },
    {
        "content": "<p>Within an implementation guide, you can define default profiles for each resource type - so you could declare your patient profile as the default for your IG, meaning there'd be no need to profile any references to Patient so long as your ownly constraint was that they pointed to your patient profile.  If you're not using an ImplementationGuide or you want to control what uses your profiled patient and what uses the generic patient, then you'll need to be explicit with profiles for all resources you use.</p>",
        "id": 153892286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496647763
    },
    {
        "content": "<p>Default profiles use <code>ImplementationGuide.global</code></p>",
        "id": 153892338,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1496707677
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>  for ur resposes. again i'm littlebit confusing. what you are saying is if we maintain our IG . and if i create any profiles(ex: patient) then no need to give that reference in other resources(ex:AllergyIntolerance.patient) manually right? or we have to change in each and every resources(example: if we are using other 40 resources) which are refering to patient?</p>",
        "id": 153892351,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496722054
    },
    {
        "content": "<p>ImplementationGuide.global allows you to define profiles that apply to all resources in your IG that don't explicitly declare other profiles.  If you validate an instance and referecence the IG, those global profiles should automatically be applied.</p>",
        "id": 153892353,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496722325
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  i'm talking about the profiles for example <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-allergyintolerance.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-allergyintolerance.html\">http://hl7.org/fhir/us/core/StructureDefinition-us-core-allergyintolerance.html</a>  here they refering to US core patient profile.</p>",
        "id": 153892355,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496722526
    },
    {
        "content": "<p>They chose to refer explicitly.</p>",
        "id": 153892356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496722618
    },
    {
        "content": "<p>here if i'm using nearly 40 other HL7 resources as it is(not creating the profile). and i'm creating the Patient profile.  but in other resources by default the reference would be patient(hl7) right. in this case shall i need to change that reference to our patient in all the resources manually?</p>",
        "id": 153892357,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496722868
    },
    {
        "content": "<p>You don't need to do that <em>if</em> you define all of your profiles in the scope of an IG, your IG declares that patient profile as a default, and the validator is passed the IG when it performs the validation</p>",
        "id": 153892366,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496723892
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>",
        "id": 153892368,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496723941
    },
    {
        "content": "<p>Hi.. Apologies if this is in the wrong section. I'm trying to use an HL7 extension in one of my profiles, but the IG Publishing tool doesn't seem to like it.  It tells me that I 'must have rows', and I'm unsure what that is.. my XML StructureDefinition is identical to all the examples I can find. </p>\n<p><a href=\"/user_uploads/10155/hNyCsVKGunaEexyfQYSTqQA9/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<p>I've tried both building with and without the StructureDefinition of the extension downloaded from <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a>. (is this necessary when it's an official extension? )</p>\n<p>This is the relevant section of the SD, that when removed allows the IG publisher to finish.</p>\n<p><a href=\"/user_uploads/10155/CSqv--Gi0Mz5j7P1uFbdWYjT/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<p>Appreciate any guidance. Thank you.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/CSqv--Gi0Mz5j7P1uFbdWYjT/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/CSqv--Gi0Mz5j7P1uFbdWYjT/pasted_image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/hNyCsVKGunaEexyfQYSTqQA9/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/hNyCsVKGunaEexyfQYSTqQA9/pasted_image.png\"></a></div>",
        "id": 153892550,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1496777247
    },
    {
        "content": "<p>Can you show the full stack trace?</p>",
        "id": 153892579,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496797874
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span>  They also did not know about the global element until now (because they essentially ignored ig.xml as pretty lame - I assume the idea is to eventually merge ig.json and ig.xml  into a single IG resource). </p>\n<p>Does</p>\n<ul>\n<li>1)  global work even if the SD is being defined in the same IG</li>\n<li>2)  and is it reflected in the snapshot generation <em>even if</em> the element is not listed in the differential since you don't care about it  -   e.g.,  the <code>asserter</code>element  US-Core Condition Profile.</li>\n</ul>",
        "id": 153892673,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496847230
    },
    {
        "content": "<p>Not sure I understand ig.json vs. ig.xml?  Are you talking about the JSON igPublisher config file?  That's something different - though I generate mine from the ImplementationGuide resource instance.  Global should work regardless of where the SD is defined.  My understanding of how it works is that if the validator hits a resource and there's no other profile defined on the resource, the global profile applies.  (I don't know whether/how well this works in the current validator.)</p>",
        "id": 153892685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496854039
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , as i'm new to fhir i'm confusing about the IG. from where to start. as of now just we used the clinical resources. but not yet started the IG. so please any suggesions. </p>",
        "id": 153892869,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496895736
    },
    {
        "content": "<p>ig.json is a build thing - it doesn't contain anything intended for the consumers of the Implementation Guide. Anything for consumers is in ig.xml. Most of the stuff in ig.json is specific to a particular build tool. So they will remain separate</p>",
        "id": 153892871,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496897760
    },
    {
        "content": "<p>Hi All,<br>\nI need help to reference a local Patient profile in Medication Statement Profile. <br>\nBoth the profiles (xml files) are present in the folder structure as shown in the attached snapshot. <br>\nNone of the profiles has been published online and has no external uri/url.<br>\nCan you please suggest how can I reference it. <br>\nI can also attach both the MedicationStatement and the Patient profile files for your reference if required.</p>\n<p>&lt;StructureDefinition&gt;<br>\n...<br>\n...<br>\n...<br>\n&lt;differential&gt;   <br>\n    &lt;element&gt;<br>\n      &lt;path value=\"MedicationStatement.subject\" /&gt;<br>\n      &lt;type&gt;<br>\n        &lt;code value=\"Reference\" /&gt;<br>\n<strong>&lt;targetProfile value=\"<del>../StructureDefinition/dh-Patient</del>\" /&gt;</strong><br>\n        &lt;aggregation value=\"referenced\" /&gt;<br>\n      &lt;/type&gt;<br>\n    &lt;/element&gt;<br>\n  &lt;/differential&gt;<br>\n&lt;/StructureDefinition&gt; </p>\n<p><a href=\"/user_uploads/10155/8BFZpCllgfFcYT5SsykZhA0K/2017-06-13_090823.jpg\" target=\"_blank\" title=\"2017-06-13_090823.jpg\">2017-06-13_090823.jpg</a> </p>\n<p>Thanks.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/8BFZpCllgfFcYT5SsykZhA0K/2017-06-13_090823.jpg\" target=\"_blank\" title=\"2017-06-13_090823.jpg\"><img src=\"/user_uploads/10155/8BFZpCllgfFcYT5SsykZhA0K/2017-06-13_090823.jpg\"></a></div>",
        "id": 153893295,
        "sender_full_name": "Vikas Mittal",
        "timestamp": 1497308991
    },
    {
        "content": "<p>in what context do you want to reference it? </p>",
        "id": 153893306,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497321061
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I have to create a Medication Statement profile where for the MedicationStatement.subject I need to reference the patient profile which has been created and is locally available. We cannot publish the patient profile yet and thus need to find a way to reference it locally. <br>\nIf I am able to reference this correctly and successfully then I will create a json file for Medication Statement and run that through the IG Publisher to create various artefacts. <br>\nThus I need to know the correct syntax to be used in the MedicationStatement profile for referencing! </p>",
        "id": 153893312,
        "sender_full_name": "Vikas Mittal",
        "timestamp": 1497323423
    },
    {
        "content": "<p>oh. so the the context is the IG publisher</p>",
        "id": 153893313,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497324101
    },
    {
        "content": "<p>the IG publisher doesn't have a way to publish something based on something that is not published</p>",
        "id": 153893314,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497324140
    },
    {
        "content": "<p>if you did run the original profiles to produce an IG output you could do a local reference to the definitions.xml.zip output (relative path) by adding a dependency to the ig.json (project) doing the refererencing </p>",
        "id": 153893315,
        "sender_full_name": "Brett Esler",
        "timestamp": 1497324634
    },
    {
        "content": "<p>{<br>\n       \"name\" : \"aubase\",<br>\n       \"location\" : \"<a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base\" target=\"_blank\" title=\"http://build.fhir.org/ig/hl7au/au-fhir-base\">http://build.fhir.org/ig/hl7au/au-fhir-base</a>\",<br>\n       \"source\" : \"resources/base\"<br>\n    }</p>",
        "id": 153893317,
        "sender_full_name": "Brett Esler",
        "timestamp": 1497324643
    },
    {
        "content": "<p>i.e. relative path to an IG output </p>",
        "id": 153893319,
        "sender_full_name": "Brett Esler",
        "timestamp": 1497324685
    },
    {
        "content": "<p>but would need to run Patient profile through ig builder to get an output... </p>",
        "id": 153893322,
        "sender_full_name": "Brett Esler",
        "timestamp": 1497324732
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> <br>\nI will try first what Brett has suggested. will ping back in case i face an issue. Cheers. </p>",
        "id": 153893952,
        "sender_full_name": "Vikas Mittal",
        "timestamp": 1497496366
    },
    {
        "content": "<p>Hello. Can someone please help explain this error-message i get in Forge 16.1  ?<br>\nThe element subject is a reference to a Patient profile which we intend to use.<br>\nHow can i fix this error and make sure that the MedicationStatement profile refers to the correct Patient profile ?</p>\n<p>[Severity: Error] [Code: Invalid] <a href=\"http://test.com/FHIR/profiles/Diagnostics.MedicationStatement/MedicationStatement\" target=\"_blank\" title=\"http://test.com/FHIR/profiles/Diagnostics.MedicationStatement/MedicationStatement\">http://test.com/FHIR/profiles/Diagnostics.MedicationStatement/MedicationStatement</a> (Element 'MedicationStatement.subject' has an invalid type profile constraint '<a href=\"http://test.com/FHIR/profiles/Clinical.Patient/Patient\" target=\"_blank\" title=\"http://test.com/FHIR/profiles/Clinical.Patient/Patient\">http://test.com/FHIR/profiles/Clinical.Patient/Patient</a>'. The target represents a profile on 'Patient' which is incompatible with the element type 'Reference'.)</p>",
        "id": 153896177,
        "sender_full_name": "Gerhard Andreassen",
        "timestamp": 1499331357
    },
    {
        "content": "<p>I think you intend to put it into <code>targetProfile</code>, not <code>profile</code>. Give that a go</p>",
        "id": 153896179,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1499332530
    },
    {
        "content": "<p>Yes, that works. But there is one thing i don't understand. Why don't i get a warning or error on the Patient profile URL, when the URL is invalid ?<br>\nIn the target.profile textfield, i can input whatever, and it still validates. Why is that ?</p>",
        "id": 153896195,
        "sender_full_name": "Gerhard Andreassen",
        "timestamp": 1499346158
    },
    {
        "content": "<p>Forge uses the .NET API to validate your inputs, and the .NET API does not validate primitives of type \"uri\" (which the \"targetProfile\" element is), since it's pretty hard to validate what's a valid uri.  We have found some regexes that try, but I wasn't too sure they were completely right - and frankly people use urls that are not 100% valid - most browsers will still accept them.   So, in the end, we decided not to validate uris in the .NET API Pocos....</p>",
        "id": 153896208,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1499353509
    },
    {
        "content": "<p>Suppose I am implementing a FHIR server. I decide to use a Patient Resource, but only select/implement few of the fields specified in the base specification along with extensions. </p>\n<p>How do i communicate this information to the consumer of my server . Do i need to create new Structural Definition to reflect the modified Patient resource used in my system ? </p>\n<p>As per my understanding,  capability statement exposes resources and what operations they  support on basic level. Is there a mechanism to tell the user of my server what all  fields for a certain resource is expected in my system ?</p>",
        "id": 157656002,
        "sender_full_name": "Ashwin Kandel",
        "timestamp": 1549415404
    },
    {
        "content": "<p>You could create a StructureDefinition with that information, but I don't think there is no standard way for a client to get to that (via API calls)</p>",
        "id": 157656226,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549415682
    },
    {
        "content": "<p>...and it does not really matter: as long as your server generates FHIR-compliant data the client would not much care which fields are actually implemented or not</p>",
        "id": 157656264,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549415726
    },
    {
        "content": "<blockquote>\n<p>...and it does not really matter: as long as your server generates FHIR-compliant data the client would not much care which fields are actually implemented or not</p>\n</blockquote>\n<p>What if client send me a field for a resource whose implemention is not defined in my server ? Should i return OperationOutcome  resource indicating failure message in such case .. ?</p>",
        "id": 157656409,
        "sender_full_name": "Ashwin Kandel",
        "timestamp": 1549415890
    },
    {
        "content": "<p>I'd say no: it  would force the clients to have to craft request specifically for your server</p>",
        "id": 157656498,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549416006
    },
    {
        "content": "<p>Just ignore the data that is not supported</p>",
        "id": 157656505,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549416017
    },
    {
        "content": "<p>The only exception to \"ignore unsupported data\" is if it's a modifier element whose meaning you don't recognize (which would typically be a modifier extension or an unrecognized uri in implicitRules.  In those cases you can't safely process the instance and would need to reject, store it as a text blob of just narrative or invoke some other sort of alternate behavior.</p>",
        "id": 157662630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549424688
    },
    {
        "content": "<p>This is mostly a sanity check as to my understanding of profiling and how to consume on the client side.  Generally my transformation tools want to start with XSD which FHIR already provides.  Consuming the us-core IG for instance, changes some of the resources adds some values sets and search parameters.  That is simple process for the server as I can post those to it.  From the client side, I had hoped to be able to have an  XSD from the snapshot of profiles to create a new definition for the tooling.  But it doesn't sound like that is possible or perhaps even advisable.  In which case, not sure what to do except give the developer the IG and code appropriately.  Is my understanding correct or have I missed something here?</p>",
        "id": 185056325,
        "sender_full_name": "sean zitello",
        "timestamp": 1578432248
    },
    {
        "content": "<p>XDS is able (by far) to express all of the constraints as present in a profile. As such working with XSD only ever will give you a ballpark idea of the validity of a FHIR instance. If you combine XSD with Schematron it gets a bit better, but it'll still be below par. <br>\nFor a mapping kind of tool which is based on XSDs I can see why you'd like to have an XSD for a profiled resource, so at least you can take into account whether certain data elements have been made mandatory or whether they have been removed. I'm not aware that such an XSD generating capacity exists, but I'm not a tooling pundit so perhaps others can chime in.</p>",
        "id": 185184620,
        "sender_full_name": "René Spronk",
        "timestamp": 1578547506
    },
    {
        "content": "<p>Hi,<br>\nI have a Use Case where I need ClinicalImpression reference in Observation(not the other way around).<br>\n I can take Base Observation profile and add it as a resource reference in extensions.<br>\nIs it possible to add ClinicalImpression directly (parallel to subject,context) through profiling and not in the extensions?</p>\n<p>Thanks</p>",
        "id": 185185825,
        "sender_full_name": "Liam",
        "timestamp": 1578549435
    },
    {
        "content": "<p>Nope.<br>\nProfiles work with existing elements in a profile, they do not really add elements.<br>\nA profile adds an extension to a resource  by working with pre-existing extension elements in the resource.</p>",
        "id": 185186038,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1578549763
    },
    {
        "content": "<p>Extensions are the only way to add elements to a resource.</p>",
        "id": 185186059,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1578549809
    },
    {
        "content": "<p>An instance of a resource, say an instance of <a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base/StructureDefinition-au-patient.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/hl7au/au-fhir-base/StructureDefinition-au-patient.html\">AU Base Patient Profile</a> can use extensions not mentioned in that profile.<br>\nMentioning extensions in the profile without giving them a minimum cardinality of 1 (e.g. <a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base/StructureDefinition-au-patient-definitions.html#Patient.extension:birthPlace\" target=\"_blank\" title=\"http://build.fhir.org/ig/hl7au/au-fhir-base/StructureDefinition-au-patient-definitions.html#Patient.extension:birthPlace\">patient-birthPlace</a>) is just documentation.</p>",
        "id": 185186254,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1578550089
    }
]