[
    {
        "content": "<p>Hello Community<br>\nA question: if a request(resource) has multiple profile tags(meta.profile), but couldn't get validated successfully to all the profiles mentioned in meta.profile. What is the expected response for FHIR server , 400 bad request or success(200 or 201)?</p>",
        "id": 276122803,
        "sender_full_name": "Chidamber Kumar",
        "timestamp": 1647902272
    },
    {
        "content": "<p>Here is another question if anyone can answer:<br>\nDoes a Patient profile to hold only SSN as a valid identifier qualifies for slicing ?</p>\n<p>If yes, is it correct to conclude that fixing a value for any element that may occur more than once is called slicing?</p>",
        "id": 276123987,
        "sender_full_name": "Chidamber Kumar",
        "timestamp": 1647903239
    },
    {
        "content": "<p>It depends.  If you can't access some of the profiles, that shouldn't be a problem.  If you can access them and the instance isn't valid against them, it's your choice whether to reject the instance as invalid or accept it anyhow.  (Be aware that you'd need to strip the invalid profile declarations if you subsequently made the instance available to other systems if you wanted <em>your</em> system to be conformant.)</p>",
        "id": 276125711,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647904408
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for replying.<br>\nAnything on the 2nd part of the question?</p>",
        "id": 276126752,
        "sender_full_name": "Chidamber Kumar",
        "timestamp": 1647905112
    },
    {
        "content": "<p>If you were to say that the only identifier allowed had to be an SSN, you wouldn't need to slice.  But that would also be a 'bad practice' profile.  In most cases, you shouldn't prohibit a system from sharing whatever data they have.  It's fine to make SSN mandatory and mustSupport, but you shouldn't stop them from sharing other identifiers they have - so that they can easily use the same interface to share data with you as they use to share data with everyone else.  Best practice would be to slice Patient.identifier and impose the constraints you wish on the slice(s) for the identifier systems/types that you care about, while leaving the slicing open to allow other information that exists to be shared too - even if you might ignore it.</p>",
        "id": 276134582,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647913379
    },
    {
        "content": "<p>make sense<br>\nThanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 276235803,
        "sender_full_name": "Chidamber Kumar",
        "timestamp": 1647974210
    }
]