[
    {
        "content": "<p>What is the current convention for assigning profile names? I could not find any guidelines in the FHIR spec. <br>\nE.g., I created a profile called \"Donor\" based on patient. Can I just name it \"Donor\" or should I always use the project prefix, e.g. \"BbmriDonor\"? Or is this redundant since the URL already  specifies the project (<a href=\"https://fhir.bbmri.de/StructureDefinition/BbmriDonor\" target=\"_blank\" title=\"https://fhir.bbmri.de/StructureDefinition/BbmriDonor\">https://fhir.bbmri.de/StructureDefinition/BbmriDonor</a>)? And what is the convention for profiles with potential naming conflicts, e.g. it is allowed that a profile on Condition is just named Condition, or should it be BbmriCondition to avoid confusion?<br>\nThanks!</p>",
        "id": 171774260,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1564148471
    },
    {
        "content": "<p>There are two names: title and name.  Both should be unique in the context of an implementation guide.  Beyond that, title should be meaningful to humans and not overly long.  Name should be what you would want a Java,.NET or similar class to be named if scoped by a package that contains everything in the IG<br>\n.</p>",
        "id": 171777501,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564150867
    },
    {
        "content": "<p>In short, no need to prefix with the IG name.</p>",
        "id": 171777527,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564150896
    },
    {
        "content": "<p>So, in my example i would use Donor and BbmriCondition as unique names. Thanks for the explanation!</p>",
        "id": 171778606,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1564151586
    },
    {
        "content": "<p>You could even just use 'Condition', but given that you'd likely be using the HL7 Condition resource too and would prefer not to specify org.somewhere.something.foo.Condition, prefixing with Bbmri when it's the same as a FHIR resource is reasonable.</p>",
        "id": 171780387,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564152854
    }
]