[
    {
        "content": "<p>Are there ways to profile the character restrictions on String for a specific element use? For example in a Provider Directory to restrict the email addresses to a subset of the \"String\" characters to the subset of characters allowed for email address (or even smaller subset due to organizational / technical restrictions)...  An email address is a complex amalgamation of two totally different string constraints, joined by a \"@\".  Or is this beyond our profiling ability, and thus it becomes a narrative SHALL statement with appropriate testing scenarios driven by the IG? I don't mind either answer, just don't want to spend energy where it is not possible.</p>",
        "id": 153895511,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498681324
    },
    {
        "content": "<p>sound  like a regex invariant</p>",
        "id": 153895514,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498681365
    },
    {
        "content": "<p>yes. regex is easiest way. could add some fhirpath primitives for common unicode subranges - that's a bit hard in regex</p>",
        "id": 153895515,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498681425
    },
    {
        "content": "<p>Yes,  the email address standard is outright ugly. Many dragons. different for the local-part and the domain... BUT, domains tend to restrict the character set further because of organizational or technical reasons. For example most email platforms forbid some characters allowed by the standard. Some organizations choose to further refine due to internal processing or tools that are plugged into the email system. Hence any regex or fhirpath would be further refined.     ---- But I picked on this one as a examplar of a more general need to subset the character set for the String datatype.</p>",
        "id": 153895517,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498681978
    },
    {
        "content": "<p>We also have an extension for defining a regex on a data element.  And I believe the validator supports it.  <a href=\"http://hl7.org/fhir/extension-regex.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-regex.html\">http://hl7.org/fhir/extension-regex.html</a></p>",
        "id": 153895566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498689145
    }
]