[
    {
        "content": "<p>Hi all! Just an open question to the FHIR community on your experiences with quality assurance of profile authoring besides the use of validators such as the IG Publisher and the Simplifier validator.</p>\n<p>What kind of additional checks/steps do you perform to enforce the right profiling conventions?</p>",
        "id": 218666037,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1606985044
    },
    {
        "content": "<p>Examples, examples, and more examples... built right into your Implementation Guide.... In fact I believe this is so important that I recommend anyone starting an Implementation Guide write examples right after they commit their use-cases to text. This doesn't mean those first examples survive, but examples are key.  I have even included invalid examples just to make sure that my structure definitions will NOT find them valid.</p>",
        "id": 218722491,
        "sender_full_name": "John Moehrke",
        "timestamp": 1607014534
    },
    {
        "content": "<p>I have a post-process I run that checks that I've asserted mustSupport (either true or false) on everything in the differential.  For messages, I also check I've asserted aggregation on references.  Checking the validation output to ensure that each resource is being validated against the expected profiles (particularly relevant for stuff inside bundles).</p>",
        "id": 218744055,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607024425
    },
    {
        "content": "<p>Nice! Does anyone use a StructureDefinition to validate StructureDefinitions?</p>",
        "id": 218851624,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1607097528
    },
    {
        "content": "<p>Actually, I do in some of my test scripts, to ensure we have a generic StrucDefs understood/supported by multiple FHIR servers (which we use in FHIR training courses, e.g. to support the use of $validate). but it's a pain, because the validators produce heaps of different errors/warnings.</p>",
        "id": 218852610,
        "sender_full_name": "René Spronk",
        "timestamp": 1607097862
    },
    {
        "content": "<p>the IG publisher runs additional integrity checks on profiles that the instance validator does not, around consistency of inheritance</p>",
        "id": 219029960,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607297746
    }
]