[
    {
        "content": "<p>I have a <code>Composition</code> profile with a <code>section</code> that has its <code>entry</code> profiled to a choice between <code>Condition</code> and <code>Procedure</code> and I would like to further profile both of these resources.  If the entry was profiled to a single resource reference, I could do this in-line, but I'm not how I would do it where a choice is involved.  I though of a couple options, neither of which I like (but maybe they're my only choices):</p>\n<ul>\n<li>Slice entry once for <code>Condition</code> and once for <code>Procedure</code>.  I don't like this because I'd prefer the data to be interleaved in whatever way makes sense to the authoring clinician which may be seemingly arbitrary and not easily reconstructed mechanically.</li>\n<li>Create separate profiles of <code>Condition</code> and <code>Procedure</code> and reference those profiles instead.  I don't like this because as far as I know, the profiling I require here is unique to this situation, and, while it clearly wouldn't matter once, I'm worried about potential proliferation of profiles and the management problems that will come with that as this kind of thing comes up again and again in the future.</li>\n</ul>\n<p>Any thoughts or suggestions?</p>",
        "id": 153846210,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1472789902
    },
    {
        "content": "<p>my first thought it that you shouldn't be doing that. In your use case, what is called 'procedure' is actually the condition of having had the procedure in the past; just use condition. The split between procedure and condition in medical history is spurious and brings no implementer any value</p>",
        "id": 153846259,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472818739
    },
    {
        "content": "<p>methodologically, the answer is to profile the resources separately, and refer to the profiles. The fact that there is no re-use of the profiles is neither here nor there</p>",
        "id": 153846260,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472818806
    },
    {
        "content": "<p>So it is arguable that we could use <code>Condition</code> instead of <code>Procedure</code> in our medical history (although more on that later), but this is a common pattern throughout our models, so the answer is helpful; thanks.<br>\nAs to whether this is \"neither here nor there\", it does impact us with regards to our model management.  There is a reasonable likelihood that a number of almost identical profiles of the same resource for different use cases will arise and the consequent proliferation of structure definitions will present difficulties; we know this from experience.  Of course, in the past, we have probably been over-prescriptive in our modelling -- although, with the amount of hand-holding with implementers that seems to be required, such levels of prescription has been justified -- but even so, the risk of model prolifieration remains.  Furthermore, if there is a set of constraints that makes sense in only one particular circumstance, being able to profile it in-line helps with the semantics.  Nonetheless, it is what it is, and if we have to explicitly profile each of these, then we'll just have to figure out how to manage it.<br>\nAs far as whether we should <code>Condition</code> and not <code>Procedure</code> in medical history, I agree that this would satisfy the simplistic primary use case.  However, I'm concerned that the loss of semantics from doing so would compromise secondary use cases.  Since secondary use cases is ultimately where the real gains are to be made from digital health, I believe we should be building those considerations into every primary use case.  I understand that that will increase the cost to the implementers and, in the short term at least, they'll get nothing back from it, but, in my opinion, the benefits to the community far outweigh any such concerns.  Of course, with it's 80/20 mind set, FHIR is not well set up for this kind of longer term thinking, but that doesn't mean we should simply push it aside.</p>",
        "id": 153846828,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473386202
    },
    {
        "content": "<p>BTW, I do understand that a medical history may not be the place from which you would want to harvest such data for secondary use anyway; nonetheless, the point still stands.</p>",
        "id": 153846834,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473389409
    },
    {
        "content": "<p>it's always good to be alert long term secondary use but it's also good to consider implemnetation limitations. In particular, the difference between Condition and Procedure is not supported out of the existing medical history records that GPs / Hospitalists keep. It's extremely unlikely that it's coded... in fact, that's been the problem all long....</p>",
        "id": 153846837,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473393501
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nThe docco in the Condition resource does not suggest this use. It mentions pregnancy, but nothing else. Also the patient care work group propose changing Condition.category from a preferred binding to: complaint | symptom | finding | diagnosis to a required binding. <a href=\"http://hl7-fhir.github.io/condition.html#bnr\" target=\"_blank\" title=\"http://hl7-fhir.github.io/condition.html#bnr\">http://hl7-fhir.github.io/condition.html#bnr</a> </p>\n<p>So your proposal to use condition for \"procedure that has occurred\" seems to be novel.</p>",
        "id": 153846841,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473397434
    },
    {
        "content": "<p>hmm. maybe you're right. I'll talk to PC about it in Baltimore</p>",
        "id": 153846842,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473397605
    },
    {
        "content": "<p>do we have any typical examples of medical history?</p>",
        "id": 153846843,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473397642
    },
    {
        "content": "<p>Not to hand. :(</p>",
        "id": 153846844,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473397697
    },
    {
        "content": "<p>I'll get an example or 2</p>",
        "id": 153846845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473397722
    },
    {
        "content": "<p>Another thing that might belong in a medical history is a 'once in a lifetime' administration of a medication. It's been mentioned in my hearing but never explored.</p>",
        "id": 153846846,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473397788
    },
    {
        "content": "<p>immunization? </p>",
        "id": 153846847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473397810
    },
    {
        "content": "<p>I think it is for toxic medications.</p>",
        "id": 153846848,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473397845
    },
    {
        "content": "<p>I understand that we have a real problem with the source data being little better than free text. <img alt=\":disappointed:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/disappointed.png\" title=\":disappointed:\"> </p>",
        "id": 153846854,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473405580
    },
    {
        "content": "<p>In fact, because of how the <code>Condition</code> resource is now documented, we have gone so far as mapping our Uncategorised Medical History Item to <code>Basic</code> in case we need to use that!  Let's hope we don't.</p>",
        "id": 153846855,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1473405671
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> , <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  - I have raised concerns with restricting the scope of Condition by having a required binding to a value set with limited choices.  The proposed change would be inconsistent with DAF / Argonaut (as the IG has support for additional category codes like problem and health concern).  I was on maternity leave when PC decided to add the STU Note, but I think the discussion started as a result of QA - specifically questioning whether the CodeableConcept should be bound to SNOMED instead, per <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10091\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10091\">GF#10091</a>.<br>\nAlso, I will add that we have an open <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10090\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10090\">GF#10090</a> to revamp (expand) the Condition introduction/scope .  The ball is in my court to draft the changes.  I can include examples of conditions as a result of a procedure (e.g. amputee) in my revision.</p>",
        "id": 153846879,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1473428166
    },
    {
        "content": "<p>I would like to add some input agreeing with the raised by Michelle concerns. There was the discussion on Zulip <a href=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Issue.2FGoal.2FAction\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Issue.2FGoal.2FAction\">https://chat.fhir.org/#narrow/stream/implementers/subject/Issue.2FGoal.2FAction</a> on how to represent the Issue/Goal/Action/Outcome model in FHIR, and I was advised by Lloyd McKenzie and Dave Carlson to represent Issues using the Condition resource. As described in the Argonaut IG (<a href=\"http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns\" target=\"_blank\" title=\"http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns\">http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns</a>), our Issues seem to fit as Condition with category=health-concern, or problem, or complaint. So, we need these other categories of Condition in order to be able to represent our model in FHIR, otherwise this resource is not suitable for representing our Issues.<br>\n<strong>Examples of issues in our palliative care management system are the following:</strong></p>\n<ul>\n<li>Patient does not have a primary care physician</li>\n<li>Nausea: Acute due to unknown cause</li>\n<li>Patient is not compliant with Morphine Sulfate</li>\n<li>Patient needs transportation assistance for access to care</li>\n<li>Pain: Acute due to neoplastic disease</li>\n<li>Patient does not understand their copay/deductible obligations</li>\n<li>Caregiver (Jennifer Baker, Wife) has inadequate support</li>\n<li>No documentation of living will</li>\n<li>Patient wants to create a living will</li>\n<li>Patient reports inadequate access to (provider)</li>\n</ul>",
        "id": 153846884,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1473441123
    },
    {
        "content": "<p>thx for the contributions <span class=\"user-mention\" data-user-id=\"191329\">@Aleksandra Pavlyshina</span>. <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> I will try and source some more from my family</p>",
        "id": 153846919,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473462739
    }
]