[
    {
        "content": "<p>I have a question about profiles. Is it considered valid for a profile to reference multiple base resources? For example, <code>Patient</code> and <code>ResearchSubject</code>. We are authoring an implementation guide and want to allow either of these two resources to be used given the capabilities of the server. Consider that some implementers may have custom FHIR servers capable of outputting ResearchSubject, but other who rely on EHR vendor solutions may not. We would make this clear in our guide, but we're not exactly sure if this is the best approach.</p>\n<p>If there is another viable alternative to this scenario, I'd love to hear it!</p>",
        "id": 153975290,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1531669584
    },
    {
        "content": "<p>A given profile is on a single resource.  However, a Reference can certainly reference multiple resources and declare specific profiles for each resource.</p>",
        "id": 153975291,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531669699
    },
    {
        "content": "<p>However, Patient and ResearchSubject are not substitutable.</p>",
        "id": 153975292,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531669712
    },
    {
        "content": "<p>ResearchSubject links a Patient to a ResearchStudy</p>",
        "id": 153975293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531669724
    },
    {
        "content": "<p>No activity is ever done directly to ResearchSubject - all activities happen to Patient.  That patient might be tied to 0..* studies through ResearchSubject.</p>",
        "id": 153975294,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531669766
    },
    {
        "content": "<p>OK - how might Reference be factored in to help here? We're trying to account for some source systems not being able to accommodate the ResearchSubject/ResearchStudy resources at the moment, but we want to support and encourage their use (and provide examples)</p>",
        "id": 153975295,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1531669868
    },
    {
        "content": "<p>So, for clinical trial data exchange we'd allow for the use of Patient alone, but prefer the use of ResearchSubject if possible. Hopefully this makes sense.</p>",
        "id": 153975296,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1531669970
    },
    {
        "content": "<p>You don't really have a choice.  Patient demographic data and linkage to Observations, Procedures, AdverseEvents, etc. is <em>always</em> through Patient, never through ResearchSubject.  So you'll always need to have Patient.  And if you want to communicate that a Patient is part of a particular research study, you'll need ResearchSubject too.</p>",
        "id": 153975299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531672537
    },
    {
        "content": "<p>I see. So in order to really embrace ResearchSubject we'll need to include it in some way, but Patient will always be necessary.</p>",
        "id": 153975309,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1531700032
    }
]