[
    {
        "content": "<p>Has there been any discussion/modelling been done around managing program enrollment information in FHIR? A profile on Eligibility or Account comes to mind. This may be peculiar to US realm, but maybe not. </p>",
        "id": 153838322,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1468517422
    },
    {
        "content": "<p>Not sure if this could map into EpisodeOfCare?<br>\nHere in Australia an organization is required to have an active/approved EpisodeOfCare for many govt programs that funding is allocated to, and from there an account is allocated to the EoC and funding runs through that.<br>\n(I don't how that works in the US though)</p>",
        "id": 153838540,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468542369
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> Yes, related to EpisodeOfCare and/or CarePlan. My initial take on this would be that Program would be a profile on Account to identify the program and the terms of participation. Created once a patient, for example, agreed to participate in a study or government program. But I haven't gotten too deep into this yet. Thanks for the response.</p>",
        "id": 153838715,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1468587214
    },
    {
        "content": "<p>No problems, the contract could hold the details of theofficial agreement, and then the EoC as the container, and the CarePlan to fo the planning with. All makes sense there.</p>",
        "id": 153838824,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468625989
    },
    {
        "content": "<p>Or a profile on Enrollment when that gets flushed out.</p>",
        "id": 153839037,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1468789980
    },
    {
        "content": "<p>Enrollment sounds like a business process similar to admission.  Patients both join and leave programs.  We don't have a resource for \"admission\", just admission and discharge information on Encounter.  My leaning would be for us to follow a similar pattern for program participation.</p>",
        "id": 153839121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468812812
    },
    {
        "content": "<p>In NZ, enrollment in the Health &amp; Disability Sector is principally used in relation to funding-related programmes and is predicated on the distinct, but related, concepts of eligibility and entitlement. For example, eligible patients, who also meet the entitlement criteria, have to enroll with a single general practice in order to receive subsidized treatment.</p>",
        "id": 153839144,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1468816332
    },
    {
        "content": "<p>Enrollment is also used to manage participation in clinical trials and also has an eligibility checking phase, though there generally isn't an entitlement aspect.  (In the end, I think you can treat entitlement as just another aspect of eligibility.)</p>",
        "id": 153839154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468817685
    },
    {
        "content": "<p>Agreed - eligibility and entitlement, in this context, are just different types of qualification criteria. During the NZ National Enrolment System project we landed on eligibility as a precursor to entitlement but I, for one, never found the distinction all that helpful - just indicative of the fact that law is all about making fine, and often artificial, distinctions.</p>",
        "id": 153839225,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1468820780
    }
]