[
    {
        "content": "<p>I have a system where I'm supporting multiple types of appointsments while also fronting a <a href=\"http://3.party\">3.party</a> system for video appointments.  Currently I have,  one-to-one appointments, group appointments, one-to-one video appointments and group video appointments. I'm looking for a proper place to put that piece of the puzzle where I can diiferentiate between them. I imagine that the proper candidate fields would be either service category, service type or appointment type, but I'm open to suggestions. <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> would you happen to have an oppion to this matter?</p>",
        "id": 228232983,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1614606852
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> I would really value any input to this. Maybe <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>  would also have something to say here? I'm currently leaning towards expanding the appointmentType with values such as <code>Remote Consultation</code> or <code>Remote Group Consultation</code>. What's PA's view on this? Were remote appointements something that what on the radar when the Appointment resource was originally crafted?</p>",
        "id": 228563078,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1614764708
    },
    {
        "content": "<p>I don't think we are much help from NL. Virtual Group Appointment for us is serviceType VR (V3 ActCode), with as many .participant.actor(Patient) as privacy would allow to return.</p>",
        "id": 228649277,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1614798663
    },
    {
        "content": "<p>You could imagine .participant.actor(Group) actually for this. Then the Group could say what the criteria for inclusion in that Group are so you know what type of people you would be in the Group with without violating privacy. STU3 and R4 do not support that however. We stopped our efforts in Appointment. All institutions and vendors seem to care about is running a portal with custom backend. They never really went for a FHIR solution.</p>",
        "id": 228649856,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1614798846
    },
    {
        "content": "<p>Ok, thx - ... <code>serviceType</code>says: \"The specific service that is to be performed during this appointment\". I don't see VR as being service type specific. I see that more as an appointment type</p>",
        "id": 228658910,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1614802087
    },
    {
        "content": "<p>We reversed the setup and wrapped the custom backend in FHIR ;)</p>",
        "id": 228659090,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1614802141
    }
]