[
    {
        "content": "<p>I need some advice on the proper entity.role code in Provenance.  I have a piece of software that takes in XML documents or FHIR bundles and creates the opposite version.  I am using a Provenance instance to tie them together (via a DocumentReference for the XML document).  Without reading the definition of 'source', it seems to me that it is most appropriate as the entity (either the XML document or the FHIR bundle) is the source for the transformation to the target.  But the definition seems rather specific and I'm not sure if it applies to my use case:</p>\n<p>\"A primary source for a topic refers to something produced by some agent with direct experience and knowledge about the topic, at the time of the topic's study, without benefit from hindsight.\"</p>\n<p>It is the \"agent with direct experience and knowledge about the topic\" that trips me up.  Would this still apply to a piece of software that transforms an entity into a target?</p>",
        "id": 223921959,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611592020
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 223929914,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611594974
    },
    {
        "content": "<p>I would agree that the current definition is not as clear as it should be. I welcome a jira ticket with recommended improvement.</p>",
        "id": 223930905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611595384
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I can create a JIRA ticket, but I just want to confirm if you think I am right in using 'source' for my use case.</p>",
        "id": 223931006,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611595435
    },
    {
        "content": "<p>I agree that as a Provenance.entity, something that is listed as a source for a <a href=\"http://Provenance.target\">Provenance.target</a>, should simply be a primary source for the event.</p>",
        "id": 223931072,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611595447
    },
    {
        "content": "<p>ok, thx</p>",
        "id": 223931125,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611595466
    },
    {
        "content": "<p>where quotation might be valid... if your <a href=\"http://Provenace.target\">Provenace.target</a> is just re-using data from source</p>",
        "id": 223931146,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611595474
    },
    {
        "content": "<p>it is really a transformation - I'm taking the same data from the source, but transforming into a different format.  Think of a CDA to FHIR or FHIR to CDA transformation (in my use case, it's not CDA, but that's a common transformation).</p>",
        "id": 223931257,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611595526
    },
    {
        "content": "<p>okay, that is not a quote. so, yes source seems right.... or do we might feel we have a core new concept. The vocabulary we have is a perspective on W3C PROV model.<br>\nWhat I am not clear on is... where source is a primary, what do you indicate a source that is not 'the primary'? Or is the word primary not that important?</p>",
        "id": 223931560,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611595679
    },
    {
        "content": "<p>i'm writing up the issue to allow for changing source or create a new concept as needed</p>",
        "id": 223931669,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611595719
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-30580\">J#30580</a> was created</p>",
        "id": 223933051,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611596314
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> If I'm transforming my data and I have an incoming code for the transaction that determines whether I am creating/updating/deleting FHIR data, what should I put for my Provenance.activity?  Should it be just the incoming transaction code?  Should I put when of the CREATE/UPDATE/DELETE codes and a separate coding with my incoming transaction code?  Should I find a different place for my transaction code?</p>",
        "id": 223985717,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611623335
    },
    {
        "content": "<p>I am not understanding what you mean by \"incoming code for the transaction\"? Can you give an example?</p>",
        "id": 223985814,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611623431
    },
    {
        "content": "<p>My incoming XML data contains a transaction type, eg. register organization, deregister organization, no change notification of organization.  Those result in a FHIR transaction bundle that has these REST methods: CREATE or UPDATE for register, DELETE for deregister, UPDATE for no change notification.  I was going to use Provenance.activity to capture the incoming transaction type.  But the binding is extensible and contains CREATE/UPDATE/DELETE, so I'm thinking I should use one of those?</p>",
        "id": 223986075,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611623672
    },
    {
        "content": "<p>in IHE when the activity is to start with CDA and produce FHIR Resources I used<br>\n        &lt;system value=\"<a href=\"http://hl7.org/fhir/w3c-provenance-activity-type\">http://hl7.org/fhir/w3c-provenance-activity-type</a>\" /&gt;<br>\n        &lt;code value=\"Derivation\" /&gt;</p>",
        "id": 223986088,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611623690
    },
    {
        "content": "<p>In IHE, I put the QEDm transaction identifier in Provenance.policy</p>",
        "id": 223986230,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611623823
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>  &lt;fixedUri value=&quot;urn:ihe:pcc:qedm:2017:document-provenance-policy&quot; /&gt;\n</code></pre></div>",
        "id": 223986260,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611623850
    },
    {
        "content": "<p>not clear to me that is better than your proposal which is to put your transaction code into the Provenance.activity....  There is not much experience to use to declare one way or the other.</p>",
        "id": 223986349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611623912
    },
    {
        "content": "<p>I started from the point of viiew that Provenance.activity would be more restricted to the w3c-provenance-activity(s)...</p>",
        "id": 223986393,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611623959
    },
    {
        "content": "<p>I am noticing that the current valueset is very different than STU3... not clear to me this was a good thing</p>",
        "id": 223986482,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611624018
    }
]