[
    {
        "content": "<p>At present, you can describe the provenance of a resource in a fair degree of detail using the Provenance resource. It's based on W3C Prov work, and you can specify the source material, the agents involved, etc. This is good stuff.</p>",
        "id": 153915563,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508812746
    },
    {
        "content": "<p>but what you can't do easily is describe the source of the resource in simple terms - especially if you just have a simple text description of the source from upstream. Provenance is too rich.</p>",
        "id": 153915564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508812793
    },
    {
        "content": "<p>I think we could add to Resource.meta a property</p>\n<p>source : String [0..1] \"A short text description of the source of the data in this resource\" with a note that it is suitable to be used in a popup/flyover in a UI, or etc, and that it is a denormalized summary of full information that may/should also be available in a provenance resource that refers to this resource</p>",
        "id": 153915565,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508812900
    },
    {
        "content": "<p>We have plenty of other parts of Provenance scattered within resources as necessary... (W5)... But, why would this not follow the similar rule we have for W5, that is a resource can add a provenance description if it is critical to that resource. I think adding it to Resource.meta might be going to far and start us down the path of putting all of Provenance into Resource.meta.  What about revisions, are they required to clear this element and add their revision provenance?... Note, I am not necessarily against this change, just want to think out-loud about the potential negative impact.</p>",
        "id": 153915818,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508889994
    },
    {
        "content": "<p>I think that revisions would usually update the content as part of the revision. I agree with your concerns which is why I've taken so long to raise this. But what do you do, no, if all you have is text provenance information? and this is a common refrain....</p>",
        "id": 153915821,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508890449
    },
    {
        "content": "<p>understood.. hence why I am mostly supportive.</p>",
        "id": 153915823,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508890599
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191325\">@Dunmail</span> here you go</p>",
        "id": 153919941,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510825662
    },
    {
        "content": "<p>ok, added this so people can look at it</p>",
        "id": 153921195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511400942
    },
    {
        "content": "<p>Here  <a href=\"http://build.fhir.org/resource.html#Meta\" target=\"_blank\" title=\"http://build.fhir.org/resource.html#Meta\">http://build.fhir.org/resource.html#Meta</a></p>\n<p>right?</p>",
        "id": 153921561,
        "sender_full_name": "Eric Haas",
        "timestamp": 1511574200
    },
    {
        "content": "<p>Yes</p>",
        "id": 153921566,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511578041
    },
    {
        "content": "<p>Could have a comment to explain how this is an alternative to Provenance. That is to explain that it is intended to be a lighter weight way to express the source, and thus can only point at the source and not explain W5. Wonder if the directionality difference between this and Provenance should be explained (Is it likely someone will set source to their Provenance record)?</p>",
        "id": 153921570,
        "sender_full_name": "John Moehrke",
        "timestamp": 1511614189
    }
]