[
    {
        "content": "<p>Hi, <br>\nAs part of our Medications Management application the clinicians can prescribe protocols. The basic details of the protocols are created  and stored so that the clinician can select to 'prescribe by protocol', choose the category of protocols then work through a tree to the protocol required. e.g. Bacterial Infections --&gt; Urinary Tract Infections --&gt; ..... When they select the required protocol the details are returned with most of the order information prepopulated and ready for acceptance / edit by the clinician. It is possible for the protocol to define 'optional' medications and a choice of medications \"OR\" orders. The clinician decides whether to include the optional medications and which of the OR medications at the point of prescribing. <br>\nI would appreciate any help / clarification on:<br>\n1) How should we pass results / handle tree structures in FHIR when another application requests to prescribe via protocol?<br>\n2) How do we provide details of optional medications, OR medications etc.?</p>\n<p>At the moment we are considering bundles of bundles of bundles of MedicationRequests but we are not sure this is the correct / best way to achieve what we need.</p>\n<p>Many thanks<br>\nJulia</p>",
        "id": 153896563,
        "sender_full_name": "Julia Davis",
        "timestamp": 1499730092
    },
    {
        "content": "<p>Look at the RequestGroup.  It's intended to handle requests where there's conditional and/or temporal constraints between them.  So your root would be RequestGroup (probably with intent=proposal) and all of your MedicationRequests would have intent=option.</p>",
        "id": 153896565,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499734776
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\" data-user-id=\"14\">@Lloyd McKenzie</span> McKenzie <br>\nI will take a look at the RequestGroup.<br>\nWe have structures something like those in the attached document. We may receive a request simply for \"protocols\" or we may receive a request for protocols with a name / partial name for searching so there may be multiple levels<br>\n<a href=\"/user_uploads/10155/Epo-h8NOowoYBGAbcsPe51sc/Protocol-Document-for-FHIR-Chat.pdf\" target=\"_blank\" title=\"Protocol-Document-for-FHIR-Chat.pdf\">Protocol-Document-for-FHIR-Chat.pdf</a></p>",
        "id": 153896567,
        "sender_full_name": "Julia Davis",
        "timestamp": 1499739136
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> RequestGroup really does need a better name.</p>",
        "id": 153897610,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500633670
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> What about RequestList, then align it with the List resource (i.e. add RequestList.code to identify the purpose of the list, etc.)?</p>",
        "id": 153897685,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1500645098
    },
    {
        "content": "<p>I think the 'request' bit is the misleading part</p>",
        "id": 153897689,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500646363
    },
    {
        "content": "<p>We don't want to align it with List - it's not necessarily a flat list.  It can group things in complex sequential patterns.  \"Request\" is what we use for proposals, plans and orders.  What other name would you propose <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 153897709,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500650131
    },
    {
        "content": "<p>Plan?</p>",
        "id": 153897728,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1500655852
    },
    {
        "content": "<p>ConditionalAction</p>",
        "id": 153897748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500669629
    },
    {
        "content": "<p>RequestGroup makes it sound like a group of things you've asked to happen - so maybe, TaskGroup</p>",
        "id": 153897749,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500669666
    },
    {
        "content": "<p>That's what RequestGroup is - a group of things you've asked to happen - either a proposed group, a planned group or an ordered group.</p>",
        "id": 153897777,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500757314
    },
    {
        "content": "<p>Hi All,<br>\nThis is very interesting for me to be following as I have looked at the RequestGroup and could see how I could use this  for the protocols but the above conversation has me wondering if I would be using it correctly.<br>\nIf the RequestGroup is a group of things you've asked to happen I can see that working for a selected protocol where there are multiple steps and medications involved as you would be requesting that the medications contained in the protocol are ordered / administered etc. </p>\n<p>I'm not sure though that I should be using this to return the list of available protocols / protocol categories would this resource still be appropriate?</p>\n<p>Also, are there any generally accepted practices when it comes to returning large amounts of data? The application wishing to access the protocol data has documented that all the data should be returned i.e. all the medications, in all the protocols, in all the categories..... this could be a vast amount of data depending on the number of protocols established within an organisation. </p>\n<p>We have suggested that they search for the appropriate protocol category in 1 step and then drill down from there but I would be very keen to hear peoples opinions.</p>\n<p>The original attached document shows the structure for the protocols within the source application.</p>",
        "id": 153897804,
        "sender_full_name": "Julia Davis",
        "timestamp": 1500858660
    },
    {
        "content": "<p>Protocols (definitions of what can/should happen on a patient-independent basis) are covered by PlanDefinition.  Patient specific plans/proposals/orders are handled with RequestGroup.  There are definitely people experimenting with large data sets for FHIR - I'll let them express their experiences/recommendations.</p>",
        "id": 153897806,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500858887
    },
    {
        "content": "<blockquote>\n<p>Look at the RequestGroup.  It's intended to handle requests where there's conditional and/or temporal constraints between them.  So your root would be RequestGroup (probably with intent=proposal) and all of your MedicationRequests would have intent=option.</p>\n</blockquote>\n<p>MedicationRequest.intent is currently bound to valueset MedicationRequestIntent  with a required behaviour. This valueset does not contain \"option\" as a value. Should I file a tracker to update this valueset, or to bind it to the valueset RequestIntent?</p>",
        "id": 153898839,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1501184598
    },
    {
        "content": "<p>Yes, please do. That may be true of the other request resources as well.</p>",
        "id": 153898898,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1501197407
    },
    {
        "content": "<p>We're close to being able to run a report that will identify all of these, but in the meantime, change request is your best bet.</p>",
        "id": 153898956,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501220846
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13704\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13704\">#13704</a></p>",
        "id": 153899273,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1501258224
    },
    {
        "content": "<p>Hi Julia,<br>\nI'd be intersted to know how you tackled this. Does your Medications Mgmt App generate and consume fihr resources? Is it exposed to the FHIR API and reference libraries? </p>\n<p>I'm dealing with something similar with study protocols. The regimen &amp; dosage and allowable dosage &amp; schedule modification are in focus and the requirements similar to those in standard protocols.  <a href=\"https://www.hl7.org/fhir/researchstudy.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/researchstudy.html\">https://www.hl7.org/fhir/researchstudy.html</a> Among other attributes it also contains the “protocol” attribute, which also defines PlanDefinition <a href=\"https://www.hl7.org/fhir/plandefinition.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/plandefinition.html\">https://www.hl7.org/fhir/plandefinition.html</a>). In order to define Study Medication we can use RequestGroups (<a href=\"https://www.hl7.org/fhir/requestgroup.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/requestgroup.html\">https://www.hl7.org/fhir/requestgroup.html</a>. The name is confusing but it does the job. CarePlan <a href=\"https://www.hl7.org/fhir/careplan.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/careplan.html\">https://www.hl7.org/fhir/careplan.html</a> actually does allow 0..* references to RequestGroups, but PlanDefinition doesn't. The PlanDefinition Resource allows ActionDefinitions. </p>\n<p>As to your question on how to \"pass on results\" - do you mean Pre-populating a questionnaire? or Extracting data from a questionnaire after entry and populating other resources? In that case take a look at <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s recent article <a href=\"http://www.healthintersections.com.au/?p=2835\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2835\">http://www.healthintersections.com.au/?p=2835</a> on \"active questionnaires\" .. sounds a bit like science fiction. I'm trying to find out follow up/ people trying it out and am surprised there's not more buzz about it here.<br>\nGustav</p>",
        "id": 153982145,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533463222
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> \"but PlanDefinition doesn't.\" In the PlanDefition space, the <code>definition</code> element can point to another PlanDefinition, which should support what you're after here.</p>",
        "id": 153982233,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1533508636
    }
]