[
    {
        "content": "<p>Hi,<br>\nDuring the Baltimore Working Group infrasutrcture/tech dev meeting (Mon, 7pm), there was a discussion about serializing and putting Provenances in the HEADER of resources.  Kinda wonky, but no criticism from me (or the others I've run this by).  But.... we were wondering if there's any API spec for this yet?  In hind sight, I'm not 100% clear whether that had been something proposed and started and going into R4, or if it was an implementation report by a single implementor, or if it was still at a purely ideation stage.<br>\nThanks!</p>",
        "id": 154008025,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539268970
    },
    {
        "content": "<p>What's the reason for doing that instead of a 'contained' Provenance?</p>",
        "id": 154008028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539269263
    },
    {
        "content": "<p>Well, the Provenance acts as a shadow resource; so there's duplicate message overhead, and query search patterns on Provenances are a bit non-obvious.  </p>\n<p>But I didn't come up with the idea of putting them in the header.  I'm just confirming what was discussed, and trying to... well, follow the provenance trail, actually.</p>",
        "id": 154008042,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539269527
    },
    {
        "content": "<p>As contained, there should be no message overhead.  It would mean it wouldn't be independently queriable, but that might not be essential.  I'm not aware of any formal discussions to convey Provenance in a header.</p>",
        "id": 154008043,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539269730
    },
    {
        "content": "<p>Well, I first heard of the idea from our friends from Australia, so I'm just following along. </p>\n<p>To clarify the use case, the Signature on the Provenance is useful for anybody wanting to sign resources; which then leads to auto-generated Provenances that just have a bunch of crypto signatures in them.  That's where querying them becomes non-obvious.  It's the Consent/Contract/Provenance use case.  i.e. can we get a digital signature (i.e. provenance) riding along with a single resource query?</p>",
        "id": 154008050,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539270312
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - When you have a moment?</p>",
        "id": 154008056,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539270632
    },
    {
        "content": "<p>Indeed it will be documented in R4 (there's a task for that). It's a pretty simple notion: </p>\n<div class=\"codehilite\"><pre><span></span>X-Provenance: {json}\n</pre></div>\n\n\n<p>where the json is a provenance resource with no target. The server fills in the target and commits it to the provenance resources. There's a length limitation, so you don't get to say very much. And the length limitation is variable - some server stacks limit individual headers to 2k or 4k. Some limit total to 8k</p>\n<p>I haven't explored signatures on this yet. </p>\n<blockquote>\n<p>What's the reason for doing that instead of a 'contained' Provenance?</p>\n</blockquote>\n<p>You can do that if you want a contained provenance - which is bad idea. This is for if you want a normal provenance, but don't want a transaction every time.</p>",
        "id": 154008120,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539277083
    },
    {
        "content": "<p>Any chance we can get a link to the R4 task?  We have parties interested in tracking this and putting resources towards implementation and a pilot.</p>",
        "id": 154008135,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539278975
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19298\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19298\">GF#19298</a></p>",
        "id": 154008137,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539279167
    },
    {
        "content": "<p>Thank you very much!  :)</p>",
        "id": 154008139,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1539279258
    }
]