[
    {
        "content": "<p>Just to make sure I understand how to transact a  bundle with a  provenance  referencing it as a target ? -Use  X-provenance or as transaction?</p>",
        "id": 205973883,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596584365
    },
    {
        "content": "<p>Latter.  I don't think something in the Bundle can reference the Bundle.</p>",
        "id": 205974761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596585082
    },
    {
        "content": "<p>The X-Provenance header could certainly be used on any POST/PUT to indicate the Provenance of the content of the POST/PUT. It is an X header, so does require that the server understands.</p>",
        "id": 205979719,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596591080
    },
    {
        "content": "<p>what is the use-case you are trying to satisfy with a Provnance of a bundle?</p>",
        "id": 205979723,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596591095
    },
    {
        "content": "<p>Forwarding a Message using $process-message.  The Message bundle has been modified by an intermediary.  Part of Notifications tracker and resolution.   Scenario is Sent to intermediary - based on business rules and user agreements the Recipient is not forward some content  ( in my example Coverage) so the intermediary forward the message less the Coverage.  Hence the bundle has been modified .  Prov on MessageHeader since that is updated and Prov on Bundle.  A transaction would consist of the Message with POST to operation endpoint and Prov with POST. </p>\n<p>So I am guessing both as well...</p>",
        "id": 205985204,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596598143
    },
    {
        "content": "<p>If the message has been modified, it's a new message, with a new id, and should show the intermediary as the sender. Provenance (contained within the message bundle) could indicate what the original sender was.</p>",
        "id": 205992967,
        "sender_full_name": "René Spronk",
        "timestamp": 1596610058
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> That helps me with my use case.  But  in general if the  the Provenance  target is the Bundle  can't point to the Bundle in the Bundle.   Hence a Transaction or X-prov header <em>Outside</em> of it.</p>",
        "id": 206028924,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596637925
    },
    {
        "content": "<p>How do you plan to use a transaction? A transaction bundle with a message bundle inside it? While you can invoke operations from a transaction bundle, can you invoke \"$process-message\"?</p>",
        "id": 206042099,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596643769
    },
    {
        "content": "<blockquote>\n<p>While you can invoke operations from a transaction bundle, can you invoke \"$process-message\"?</p>\n</blockquote>\n<p>I assumed is possible.  iI there a reason why you cannot? Is it explicitly prohibited.</p>",
        "id": 206060724,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596652271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Sure, but the provenance could reference the MessageHeader resource. \"This message is a transformed message as received from original source X\"</p>",
        "id": 206110839,
        "sender_full_name": "René Spronk",
        "timestamp": 1596698027
    },
    {
        "content": "<p>Pointing to the MessageHeader isn't really the same thing as pointing to the Bundle</p>",
        "id": 206150228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596724939
    },
    {
        "content": "<p>I expected that if a bundle needed to be persisted, that would be an exceptional case. One where one would capture the persisted Bundle in a Binary and create a DocumentReference to capture the metadata about that Binary(Bundle)</p>",
        "id": 206158594,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596728437
    },
    {
        "content": "<p>This would give you an id and means of discovery</p>",
        "id": 206158719,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596728500
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  Thanks again - that is much more practical solution and avoids the issue and extra burden of receivers having to suppor transactions and x-prov.</p>",
        "id": 206182478,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596740234
    },
    {
        "content": "<p>But it doesn't actually say what you want to say...  A Provenance pointing at the MessageHeader says the <em>header</em> has changed.  It doesn't say anything at all about the other resources.  (Though I guess you could have the Provenance point at ALL of the resources in the Bundle.  That would cover everything except the elements that appears only on the Bundle...)</p>",
        "id": 206182716,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596740365
    },
    {
        "content": "<p>Depends on the level of tracing one requires. If it's only \"this message is modified version of a message originally by system X\" then having a provenance associated with the MessageHeader suffices.  The use case (as I recall) was for the intermediary to remove some financial resources from the message.</p>",
        "id": 206266652,
        "sender_full_name": "René Spronk",
        "timestamp": 1596812063
    },
    {
        "content": "<p>Provenance tied to Messageheader doesn't tell you that the message was modified, only that the MessageHeader was modified.</p>",
        "id": 206271460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596814294
    },
    {
        "content": "<p>Just to make sure I understand how this latest suggestion is supposed to work:</p>\n<ol>\n<li>A message bundle is sent from source to intermediary</li>\n<li>Intermediary removes one or more entries from the original bundle, and creates a new message bundle (new <code>Bundle.id</code> and new <code>MessageHeader.id</code>)</li>\n<li>The new message bundle contains an extra Provenance resource pointing to either MessageHeader (René) or to MessageHeader and all other entries in the new message (Lloyd).</li>\n</ol>\n<p>Is that right? Will the provenance resource have enough useful information?</p>",
        "id": 206282947,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596819946
    },
    {
        "content": "<p>If the Provenance is about stuff that's been stripped from the message, there's no way to express that in a Provenance that just points to resources in the Bundle.   To cover that, the Provenance would <em>have</em> to point to the Bundle - which means that it would have to be in the header, given that you can't point to a Bundle from something inside it - at least not right now.</p>",
        "id": 206283246,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596820119
    },
    {
        "content": "<p>the Provenance can point (.entity) at elements removed (.entity.role = removal)</p>",
        "id": 206285041,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596821096
    },
    {
        "content": "<p>the Provenance.target is the output of the activity, the .entity is the input to that activity. the .entity.role is how that input was used in the activity</p>",
        "id": 206285137,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596821150
    },
    {
        "content": "<p>Very exhaustive detail can be recorded in Provenance. not clear to me why one would want to record this exhaustive detail, but we did design Provenance to be able to do it.</p>",
        "id": 206285307,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596821232
    },
    {
        "content": "<p>Provenance.entity.what is Reference(Any). If the removal of entries needs to be recorded, then it seems to me that an identifier would be required in this case, as there is no URL to point to resources in the original message. Will all removed resources have a identifier? Or do you have to require that the entry.fullURL is resolvable, in which case you can use a reference?</p>\n<p>Based on the above, it seems to me that recording what was removed is way too involved and likely not necessary. Which leaves the other interpretation that the \"new message\" needs to indicate that a) it was changed from the original, and b) the original was authored by Z</p>\n<p>Does that sound right?</p>",
        "id": 206287267,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596822122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> How can Provenance point at entities that have no identify outside the message they've now been removed from?</p>",
        "id": 206290309,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596823396
    },
    {
        "content": "<p>Can multiple provenances be sent in the header?</p>",
        "id": 206290381,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596823425
    },
    {
        "content": "<p>if no  id or identity is known, it can always be recorded as .entity.what.display -- okay, not a very satisfying answer. but I am not clear on what is trying to be accomplished.   Provenance is not a journaling-database. If there is a need for a GIT like change tracking, then use GIT.</p>",
        "id": 206297379,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596827151
    },
    {
        "content": "<p>So I've done a simulation here that forwards a message based on  this discussion and guidance from US Core.  Thanks for the feedback:</p>\n<p><a href=\"http://ehaas.pythonanywhere.com/\">http://ehaas.pythonanywhere.com/</a></p>",
        "id": 206760906,
        "sender_full_name": "Eric Haas",
        "timestamp": 1597271820
    }
]