[
    {
        "content": "<p>Hi,</p>\n<p>How would you represent the following scenario:<br>\nA condition for which there is a provisional diagnosis which is later confirmed by histopathology following a biopsy.</p>\n<p>I've created a Condition resource with a \"provisional\" status. I'm using a Procedure resource to represent the biopsy. I'm using DiagnosticReport to represent the histopathology report.</p>\n<p>I want to be able to display both the provisional diagnosis and the confirmed diagnosis.</p>\n<p>My thought was to create an additional Observation resource referenced by the DiagnosticReport which was given the code 371441004|Histologic type (observable entity) and then specify the valueCodeableConcept for the actual diagnosis. Would this be acceptable?</p>\n<p>Cheers,</p>\n<p>Blake</p>",
        "id": 206534639,
        "sender_full_name": "Blake Mumford",
        "timestamp": 1597112656
    },
    {
        "content": "<p>I think there are two points you need to consider:</p>\n<ol>\n<li>It is best to have the confirmed diagnosis also as a Condition with verificationStatus of <code>confirmed</code>(I am assuming the code stays the same) </li>\n<li>If you need to track the provisional and the confirmed conditions, you could use the <code>replaces</code> extension to point from the <code>confirmed</code> Condition to the <code>provisional</code> Condition</li>\n</ol>",
        "id": 206570856,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597150653
    },
    {
        "content": "<p>Thanks for your advice.<br>\nNo, the Condition code may change. For example, a doctor may think that a skin spot is a melanoma but it actually turns out to be a dysplastic nevus when it is examined under the microscope in the laboratory. <br>\nI'll look into the replaces extension.</p>\n<p>FHIR documentation states:<br>\n\"Use Condition when a symptom requires long term management, tracking, or is used as a proxy for a diagnosis or problem that is not yet determined.\"<br>\nThe symptom in this case is a skin lesion/spot of concern and a doctor forms a provisional diagnosis. We then biopsy it to confirm the diagnosis. The diagnosis made on biopsy may or may not be the same as the initial provisional diagnosis.</p>",
        "id": 206661256,
        "sender_full_name": "Blake Mumford",
        "timestamp": 1597210239
    },
    {
        "content": "<p>Most commonly you'd have a single Condition resource that was initially created with one value and then updated to reflect the new, confirmed understanding.</p>",
        "id": 207798444,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598228640
    },
    {
        "content": "<p>Can you track what the provisional diagnosis was when there is only one Condition resource? Using Provenance maybe?</p>",
        "id": 207860502,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1598284389
    },
    {
        "content": "<p>If you update the single Condition resource, then you effectively hide the previous value from analysis.  e.g., when you want to look at whether certain pathology results or workflows have provided diagnostic value.</p>",
        "id": 207914557,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1598316698
    },
    {
        "content": "<p>That's no different than any other sort of update - to an order, an encounter, care plan, etc.</p>",
        "id": 207914869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598317010
    }
]