[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>,<br>\nOur team is implementing code that will programmatically derive CareTeam resource instances based on multiple, disparate resource inputs.  For example, it will derive a CareTeam based off of a combination of discrete <strong>PractitionerRole</strong> resources + existing documented CareTeam resources w/only <strong>Practitioner</strong> CareTeam.participant.member(s).  We want the Provenance for these programmatically derived CareTeams to have a Provenance.agent.type that clearly conveys how the Device agent.who (the software) participated in the generation of the CareTeam.  The existing provenance-agent-type code <strong>assembler</strong> (‘<em>A device that operates independently of an author on custodian's algorithms for data extraction of existing information for purpose of generating a new artifact</em>.’) feels like it might work; however, <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> noticed, based on the resolution to <a href=\"https://jira.hl7.org/browse/FHIR-22494\">this JIRA</a>, that changes are occurring to the terminology binding for Provenance.agent.type.  The JIRA resolution does indicate ‘<em>Add the existing codes as they are useful and specific</em>’, but I want to be sure I am following what this means…</p>\n<p>•   Is this JIRA resolution indicating that the new terminology binding for Provenance.agent.type will be to the <a href=\"http://hl7.org/fhir/valueset-participation-role-type.html\">participation-role-type</a> value set?<br>\n•   If so, does ‘Add the existing codes‘ mean that <strong>all</strong> of the existing codes (including assembler) in the current <a href=\"https://hl7.org/fhir/R4/valueset-provenance-agent-type.html\">provenance-agent-type</a> terminology binding are going to be added to the <a href=\"http://hl7.org/fhir/valueset-participation-role-type.html\">participation-role-type</a> value set?   <br>\n•   If the <strong>assembler</strong> code will be carried forward into the new terminology binding for Provenance.agent.type, do you feel that <strong>assembler</strong> conveys our Device agent.who’s (the software’s) participation in the generation of these programmatically derived CareTeams?  To be clear, our processing is doing more than simply 'extracting' existing information, it has business rules for reasoning with that information before generating a new CareTeam artifact.  i.e., It is not simply performing a mapping of extracted information to a new CareTeam artifact. <br>\n•   If not, is there another code in the new value set that would convey the Device agent.who’s participation in the generation of these derived CareTeams?</p>",
        "id": 204300569,
        "sender_full_name": "David Riddle",
        "timestamp": 1595078697
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 204305897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595088059
    },
    {
        "content": "<p>Ping - <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> :)</p>",
        "id": 205168796,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595884272
    },
    {
        "content": "<p>That CP has been applied to the continuous build, so you can see the result at <a href=\"http://build.fhir.org/provenance.html\">http://build.fhir.org/provenance.html</a></p>",
        "id": 205172701,
        "sender_full_name": "John Moehrke",
        "timestamp": 1595886789
    },
    {
        "content": "<p>There was not any interest at the time to preserving the provenance-agent-type vocabulary, as that was a extraction of concepts out of W3C PROV, and many of the extractions were not clean.   I would welcome a CP that recommends bringing them back. I like all of them.    If they were brought back it would be as the original codeSystem. If that was done, then you could use the same code/system in all versions of FHIR.</p>",
        "id": 205173012,
        "sender_full_name": "John Moehrke",
        "timestamp": 1595887001
    },
    {
        "content": "<p>YES, I think what you have described is the intent of an assembler. An example of a classic assembler is a service that would create a medical summary document.</p>",
        "id": 205173152,
        "sender_full_name": "John Moehrke",
        "timestamp": 1595887104
    },
    {
        "content": "<p>note the codeSystem does live.... <a href=\"https://terminology.hl7.org/CodeSystem-provenance-participant-type.html\">https://terminology.hl7.org/CodeSystem-provenance-participant-type.html</a></p>",
        "id": 205173460,
        "sender_full_name": "John Moehrke",
        "timestamp": 1595887297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>,<br>\nI have logged <a href=\"https://jira.hl7.org/browse/FHIR-28218\">https://jira.hl7.org/browse/FHIR-28218</a> to request that the 'performer', 'assembler' and 'composer' codes from the provenance-agent-type (<a href=\"http://hl7.org/fhir/valueset-provenance-agent-type.html\">http://hl7.org/fhir/valueset-provenance-agent-type.html</a>) value set be carried forward into the new participation-role-type (<a href=\"http://build.fhir.org/valueset-participation-role-type.html\">http://build.fhir.org/valueset-participation-role-type.html</a>) value set.  </p>\n<p>That said, we are still struggling with whether or not 'assembler', defined as ''A device that operates independently of an author on custodian's algorithms for <strong>data extraction of existing information</strong> for purpose of generating a new artifact.\" is an accurate reflection of the role that our software device is playing when it is deriving the CareTeams.  </p>\n<p>Since the software is doing more than simply 'extracting' existing information (it has business rules for reasoning with that information before generating a new CareTeam artifact) and is not simply performing a mapping of extracted information to a new CareTeam artifact, we had a lot of internal debate about the use of the 'assembler' code to convey the devices participation role type.</p>\n<p>The 'device <strong>used by an author to record new information</strong>' verbiage in the composer definition seems to rule out that option, since there is no human author involved in our programmatically derived CareTeam generation.</p>\n<p>I know you indicated  'YES, I think what you have described is the intent of an assembler' above, but I wanted to make sure the fact we are doing more than simply extracting existing information doesn't change your opinion on this.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 206135887,
        "sender_full_name": "David Riddle",
        "timestamp": 1596718227
    },
    {
        "content": "<p>given that we will be taking ownership of these new codes, that they will be just inspired by W3C PROV, then I think we can add any clarification we feel is needed. I see no reason to not add clarification that the assembler is using intelligence or business rules or policy or logic... pick a phrase and recommend it in the CR or a new CR.</p>",
        "id": 206136801,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596718710
    }
]