[
    {
        "content": "<p>Team, In our non-fhir model, we have Treatment records and Signature information (Approver and Reviewer) for each Treatment record.</p>\n<p>On modeling it in FHIR, We found Provenance is the appropriate resource to record signing of other resources (like Procedure in this case)</p>\n<p>Below are our clarifications on how to use Provenance, </p>\n<p>1. when we have multiple signer for the same record. One Practitioner will be approver of the documentation and the other Practitioner will be Reviewer of the Approved documentation -- <br>\n      In this case, my understanding is, we will have 2 Provenance record differentiated by Provenance.activity (as approver and reviewer)</p>\n<p>2. Also, when an approved documentation is getting changed and getting approved again -- <br>\n                in this case, is it ok to update the existing Provenance (overwrite the Approver)? we might lose the history here but is there a better option to dismiss the old Approver and consider only the latest signer.</p>\n<p>please help me if I am missing something here.</p>\n<p>Thanks,<br>\nVijay</p>",
        "id": 153918037,
        "sender_full_name": "Vijay Thangavelu",
        "timestamp": 1510072815
    },
    {
        "content": "<p>Hi Vijay. This is fantastic to see you working on this. Great to get your feedback.  I think your #1 is right. Your #2 is dependent on the kind of versioning supported. If you have a version supporting server, then you would end up with a new version of the documentation, and new Provenance pointing at that version. Specifically all Provenance would point at version specific revisions, expressing why that revision happened. Thus the 'current' revision would only have Provenance of that revision.</p>",
        "id": 153918042,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510075991
    },
    {
        "content": "<p>You would likely need your signatures to be Version specific... I am also very interested in any improvement you can help us with on Signatures.  see <a href=\"http://build.fhir.org/secpriv-module.html#signature\" target=\"_blank\" title=\"http://build.fhir.org/secpriv-module.html#signature\">http://build.fhir.org/secpriv-module.html#signature</a></p>",
        "id": 153918044,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510076248
    },
    {
        "content": "<p>Thanks for your reply John. It really helps.<br>\nYes, our fhir server supports versioning, thats answers my #2 question.</p>\n<p>Version specific target resource was really good one, I missed it initially. </p>\n<p>quick followup question<br>\n if we don't  have an actual signature like blob or image but only have the Practitioner reference, do we still need to populate \"Provenance.signature\" or just Provenance.agant will be sufficient?</p>",
        "id": 153918059,
        "sender_full_name": "Vijay Thangavelu",
        "timestamp": 1510083027
    }
]