[
    {
        "content": "<p>I am looking for a Provider Directory.  We want to be able to search for a provider by specialty, healthcare organization, NPI, first, last, ... for purposes of Referral and Admissions.  What are people using?</p>",
        "id": 153852834,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1476447753
    },
    {
        "content": "<p>Are you aware of the argonaut provider directory project? </p>",
        "id": 153852860,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476472875
    },
    {
        "content": "<p>hi Grahame.  I just looked at the provider directory on Argonaut.  Is it implemented by anyone and if so,  what are they using for the data?  Their own healthcare provider data, or are they fronting something like this <a href=\"https://npiregistry.cms.hhs.gov/registry/\" target=\"_blank\" title=\"https://npiregistry.cms.hhs.gov/registry/\">https://npiregistry.cms.hhs.gov/registry/</a>? with a FHIR facade.</p>",
        "id": 153852861,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1476474005
    },
    {
        "content": "<p>their own data. Suggest you subscribe to the argonaut project email list and track the developement fo the project (or ask questions there)</p>",
        "id": 153852863,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476474979
    },
    {
        "content": "<p>I am on the Argonaut Google group?  Is that what you are referring to?</p>",
        "id": 153852864,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1476475099
    },
    {
        "content": "<p>yes it was</p>",
        "id": 153852865,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476475184
    },
    {
        "content": "<p>This is an active group at the moment. There are some doing this as a centralized installation (such as the Michigan Health Information Network) and there are also products (like Epic/Cerner/Surescript/others) that are exposing their internal directory data for this purpose.<br>\nThe ONC also has a community working on developing the use cases in this space and fostering the wider community to be collaborative here. There has been discussions in this context on potentially exposing NPI/NPPES as a FHIR service, but nothing at present.</p>",
        "id": 153852895,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476490464
    },
    {
        "content": "<p>The argonaut directory work is being proposed to be made international and normative in IHE. This as a FHIR alternative to HPD/SDC profiles that exist using older technology. Discussion is ongoing this week, for next year.</p>",
        "id": 153853182,
        "sender_full_name": "John Moehrke",
        "timestamp": 1476892503
    },
    {
        "content": "<p>This directory work at the Argonaut group is also getting good focus from the ONC's Healthcare Directory Technology Learning Community.<br>\n(Important to note that it is no longer being called a provider directory but a Healthcare directory, as it is not just providers that are exposed via the direcory - recognising the importance of services and supporting health activies, not just a list of providers)</p>",
        "id": 153853269,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476911970
    },
    {
        "content": "<p>Thanks John, Where is the discussion in IHE occurring? Just curious what the overlap is with the folks involved in the argonaut PD efforts.</p>",
        "id": 153853297,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1476927949
    },
    {
        "content": "<p>The discussion in IHE is just starting in the ITI committee where prior directory work was done. <span class=\"user-mention\" data-user-id=\"191646\">@Eric Heflin</span>  proposed it as a work item for 2017.  We just finished the prioritization phase, for which this proposal got high priority. Next week we assess resource availability. The expectation is NOT to compete, but be a place where the good work can be promulgated and maintained. Eric assured us that he and others will do this coordination to assure alignment and separation of responsibilities. </p>",
        "id": 153853360,
        "sender_full_name": "John Moehrke",
        "timestamp": 1476972738
    },
    {
        "content": "<p>We are working on support  NPI registry in a  FHIR format. There are some questions:</p>\n<ul>\n<li>how to interpret identifiers (other_provider_identifier_[x])</li>\n<li>where to put state in identifier (extension?)</li>\n<li>where to save licence number</li>\n<li>where to put nucc taxonomy</li>\n</ul>",
        "id": 153853720,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1477062221
    },
    {
        "content": "<p>These will belong in either the Practitioner.Identifier or Practitioner.Role.Identifier (or the new PractitionerRole resource) depending on if the identifier is unique to the practitioner, or the practitioner at a specific location/role.<br>\nLicenses could be stored in the practitioner qualification.identifiers, as these are not typically location specific, and do not necessarily mean that the practitioner can perform services they have a license for at all locations they work. (As may not be employed for those services ).</p>",
        "id": 153853863,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1477268387
    },
    {
        "content": "<p>Thank you, Brian</p>",
        "id": 153853877,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1477286558
    },
    {
        "content": "<p>California State Bill (SB) 137 requires providers must share specific attributes on each practitioner (see <a href=\"https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201520160SB137\" target=\"_blank\" title=\"https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201520160SB137\">https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201520160SB137</a> ) - some of these (e.g. whether a practitioner is accepting new patients, insurance plans they accept, specifics of their licenses, i.e. licensing state, license number, what hospital admitting privileges they have, etc) are not explicitly defined as attributes in Practitioner resource. Would you recommend that we create extensions in Practitioner to represent these, or is there a better alternative to represent these?</p>",
        "id": 153868311,
        "sender_full_name": "Sandeep Giri",
        "timestamp": 1484786840
    },
    {
        "content": "<p>As a follow up to separate chats I had with <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  and <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> during San Antonio Connectathon : What are some practical ways to associate a Practitioner resource with insurance plans they accept? </p>\n<p>Currently there isn't a resource that represents an insurance plan. There is Coverage, but it is specific to a Patient. We need a way to represent that a Practitioner takes Blue Cross Blue Shield's plan X, Y, and Z,  Aetna's plan A and B, and so on. A common use case is that a patient would want to search for practitioners that have a particular specialty, accept the patient's insurance plan, and are located nearby (within X miles) of where the patient lives. </p>\n<p>Lloyd suggested we can perhaps use the Contract resource to represent insurance plans accepted by an Organization (so any Practitioner providing service under that Organization is assumed to accept such plans). However, an Insurance plan isn't really a contract, and at the same time, I'm not sure if this is enough to require creating a new resource to represent Insurance plans. </p>\n<p>Thoughts?</p>",
        "id": 153868312,
        "sender_full_name": "Sandeep Giri",
        "timestamp": 1484787881
    },
    {
        "content": "<p>What kind of metadata is necessary to describe these insurance plans well enough to search? I agree that Contract is not likely the right object. Might be a useful reason to create a new Resource type.</p>",
        "id": 153868330,
        "sender_full_name": "John Moehrke",
        "timestamp": 1484795048
    },
    {
        "content": "<p>Well, you don't actually want the \"plan\", you want the agreement between an organization and an insurer that the organization will offer services under the plan and the insurer will cover services delivered under the plan by that organization.  Which is sort of contract-like.  The plan itself would presumably just be referenced by identifier/code</p>",
        "id": 153868340,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484796428
    },
    {
        "content": "<p>I agree with Lloyd, it's an agreement between an insurer and a praticioner in a organisation. A practicioner could work in different organisations (eg hospital, and his own doctors office.) with different agreements with different insurers. </p>",
        "id": 153868368,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1484833222
    },
    {
        "content": "<p>Thanks John, Lloyd, and Patrick. </p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  -  to represent an insurance plan, we'd at least need 2 attributes - 1. organization that provides the plan (e.g. Kaisier, Bluecross Blueshield,Cigna, etc.); and 2. the organization-specific name of the plan (e.g. Bronze 60 HMO, Gold PPO, etc.). </p>\n<p>With your suggested structure, separate Contract resources will need to represent a provider organization's agreement with Kaiser, Cigna, etc. respectively (each also defined as a Organization), and within each Contract, use an attribute like valueItem.entity to represent the different insurance plan names? Actually then the names of the plans will need to be defined as a CodeableConcept, which is good, because then the Practitioner search parameters can reference the same CodebleConcept. Does this approach make sense?</p>\n<p>I'm sure definition of an insurance plan requires other attributes to, like plan start/end date (valid for), geographic areas covered, plan type (HMO vs PPO, etc.), and cost attributes such as yearly deductible, OOP max,  etc. for individual/family (although our use case to search for a provider by insurance plan they accept doesn't need these).  I suspect that for these latter attributes, we may need to consider a separate InsurancePlan type resource. </p>",
        "id": 153868423,
        "sender_full_name": "Sandeep Giri",
        "timestamp": 1484849633
    },
    {
        "content": "<p>I dont think a contract s the correct resource either. Its some simple searching attributes that I think belong with the organization. This could be a valid use for the upcoming orgassociation resource. But there is nothing there today specifically for it.<br>\nValid usecase that we do plan to cover, and we will work on this soon - happy to have the implementer to assist directly.<br>\n<span class=\"user-mention\" data-user-id=\"195826\">@Jeff Eastman</span> , do you have this data in your directory, I don't recall.</p>",
        "id": 153868645,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1484931788
    },
    {
        "content": "<p>Sorry to repost, but wanted to recheck if there's any feedback on this: </p>\n<p>California State Bill (SB) 137 requires providers must share specific attributes on each practitioner (see <a href=\"https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201520160SB137\" target=\"_blank\" title=\"https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201520160SB137\">https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201520160SB137</a> ) - some of these (e.g. whether a practitioner is accepting new patients, insurance plans they accept, specifics of their licenses, i.e. licensing state, license number, what hospital admitting privileges they have, etc) are not explicitly defined as attributes in Practitioner resource. Would you recommend that we create extensions in Practitioner to represent these, or is there a better alternative to represent these?</p>",
        "id": 153868735,
        "sender_full_name": "Sandeep Giri",
        "timestamp": 1485023505
    },
    {
        "content": "<p>I'll have a look throught that list of things to work out how to represent these in the STU3 spec.<br>\nThere will be further work done on the Practitioner Qualifications/certifications post STU3 release, but we will be indicating how to support these with the current STU3 work, which is where the Provider Directory work is being modelled, and is anticipated being used.</p>",
        "id": 153868763,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1485126415
    },
    {
        "content": "<p>Is there a specific operation or parameter combination that would be called to download an entire provider directory using FHIR?</p>\n<p>Additionally, if a location/organization links a specialty to a specific direct address, is there a way to represent that relationship in FHIR?</p>",
        "id": 153885501,
        "sender_full_name": "Samantha Mater",
        "timestamp": 1492789725
    },
    {
        "content": "<p>Just do a GET on /Practitioner with no filters (though you may need to do 2 GETs if you want Organizations too.).  Look at HealthcareService if you're wanting to provide contact information for a specific capability within an organization/location.</p>",
        "id": 153885509,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492800807
    },
    {
        "content": "<p>Are there any urls of ProviderDirectories that we can sync up with?  We just got Meteor on FHIR passing the Touchstone ProviderDirectory test scripts, and would like to try to hydrate the system.    </p>",
        "id": 153885950,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1493131777
    },
    {
        "content": "<p>We are looking at doing Provider Referrals and Provider lookups.  We think we will use the current FHIR Provider Resource and tie it to the CMS / NPPES API.  What are some of the more curated sources people are using for this purpose.  Any help is much appreciated.</p>",
        "id": 153886184,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1493224725
    },
    {
        "content": "<p>There is joint work between ONC, Argonaut, and IHE. to Profile a Provider Directory.  <a href=\"http://build.fhir.org/ig/argonautproject/provider-directory/\" target=\"_blank\" title=\"http://build.fhir.org/ig/argonautproject/provider-directory/\">http://build.fhir.org/ig/argonautproject/provider-directory/</a></p>",
        "id": 153886185,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493225149
    },
    {
        "content": "<p>Thanks, will look into that.</p>",
        "id": 153886186,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1493225179
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , do you know of anyone that created an implementation around this specification?</p>",
        "id": 153886378,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1493346499
    },
    {
        "content": "<p>I have no experience with the ONC or Argonaut side of this; I have been involved in IHE side. IHE has just started their work. This week is the IHE workgroup meeting where we worked on this, should be a public comment period in May.</p>",
        "id": 153886415,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493377865
    },
    {
        "content": "<p>Look at the connectathon track from Jan 2017, and a similar track the previous meeting. You might contact a few of the participants and look at the connectathon spreadsheet for server implementations. I know that Epic had something running at the connectathon.  <a href=\"http://wiki.hl7.org/index.php?title=201701_Provider_Directories_and_Scheduling\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201701_Provider_Directories_and_Scheduling\">http://wiki.hl7.org/index.php?title=201701_Provider_Directories_and_Scheduling</a></p>",
        "id": 153886433,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1493394180
    },
    {
        "content": "<p>Any updates on Provider Directory by the community?  Just posted a thread over on the IHE Stream - to the same effect.  Where is Provider Directory IG, Profiles, etc work currently being done?  We are working with the HL7 FHIR Connectathon Track Leadds for Scheduling - who use case incorporates Provider Directory.  If we can get updated Provider Directory efforts publically accessible and reviewed prior to Sept - we can work on updates, and rolling out any new Test Scripts to support Provider Directory.  We want to support both FHIR PD Consumer, and PD Host services.</p>",
        "id": 153894374,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1497885201
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191460\">@Mario Hyland</span> There is the current draft of the IHE mCSD profile (I believe that's what John talked about above): <a href=\"http://ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_mCSD_Rev1.0_PC_2017_05-17.pdf\" target=\"_blank\" title=\"http://ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_mCSD_Rev1.0_PC_2017_05-17.pdf\">http://ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_mCSD_Rev1.0_PC_2017_05-17.pdf</a><br>\nComment period has just closed last Friday.</p>",
        "id": 153894377,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1497886316
    },
    {
        "content": "<p>Thanks Stefan... correct -- I responded to Mario over on the IHE thread (he is making me feel like a dog chasing my tail) --- That would be for the 'classic' for for HPD. I presume you are interested in the FHIR form for HPD -- which is renamed \"Mobile Care Services Discovery\" (mCSD). This rename because for the FHIR form we combined CSD and HPD; the CSD editors showed up to the face-to-face meeting, and thus they got to pick the name of the combined profile.. :-) The public comment form is at <a href=\"http://www.ihe.net/Public_Comment/#IT\" target=\"_blank\" title=\"http://www.ihe.net/Public_Comment/#IT\">http://www.ihe.net/Public_Comment/#IT</a></p>",
        "id": 153894380,
        "sender_full_name": "John Moehrke",
        "timestamp": 1497886460
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> - trying to get everyone connected to this topic and work stream \"connected\" :)  - appreciate the link - are comments published (or IHE Private)?  I was wondering if anyone from the Argonaut project submitted comments?</p>",
        "id": 153894382,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1497890115
    },
    {
        "content": "<p>IHE is an open-process. However the comment deadline just happened, so they have not yet been brought together comprehensively. This will be done over the coming week, and disposition will happen. You can join IHE mailing lists, and follow their FTP... FREE.</p>",
        "id": 153894384,
        "sender_full_name": "John Moehrke",
        "timestamp": 1497892714
    },
    {
        "content": "<p>Further to what John wrote, although the deadline has passed,   please feel free to submit comments. If they are too late for this cycle, we can try to integrate them into a later cycle, or as a CP if appropriate.</p>",
        "id": 153894394,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1497898600
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> I realize that efforts are underway with IHE, and similarily there have been work products and efforts underway with HSPC, Argonauts and the large FHIR Community.  There have been a few HL7 FHIR Connectathons which have focused on PD as part of another test track Scheduling.  Ensuring we capture the correct use cases, it should be easy for these groups to review how the IHE draft standard would apply to their efforts.  While IHE references the FHIR Resources, do you know if any work is currently underway to constrain the HL7 FHIR Resources with FHIR Profiles?  Currently, many are leveraging Furore Simplifier and Forge tools (see <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> for further information) - while <span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span> and AEGIS work to create FHIR Test Scripts to test FHIR implementations.</p>",
        "id": 153894401,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1497902954
    },
    {
        "content": "<p>At this time, the IHE documentation process does not use Structure Definition, CapabilityStatement, or ImplmentationGuide. We're aware of Simplifier and Forge, and <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> did a great presentation of them for the IHE. I would like to see that change, but it is going to take some work to get there. The more people we have in committees who are willing to do the work, the quicker we can switch. Trust me, we are aware of this gap.<br>\nA more immediate concern for me is getting feedback on whether mCSD is compatible with the other provider directory efforts.   We'd hoped to get committe feedback on that, but it doesn't appear to have been done. I'd be grateful if someone with knowledge of the other directory efforts was able to provide input, in whatever form.</p>",
        "id": 153894411,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1497903800
    },
    {
        "content": "<p>Likewise, we would like for the threads on this topic to find multual common ground to form a basis to build on.  Are you the IHE lead on this effort?</p>",
        "id": 153894417,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1497906347
    },
    {
        "content": "<p>Mario, I'm co-chair of the IHE commitee responsible for mCSD; and I'm on the IHE task force looking at general FHIR issues. <span class=\"user-mention\" data-user-id=\"193299\">@Luke Duncan</span> is the profile author for mCSD. Speaking for Luke, I'll say either of us would be happy to receive any feedback provided.</p>",
        "id": 153894420,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1497906860
    },
    {
        "content": "<p>Hello, and thanks for your collective work on FHIR. I have been watching from the sidelines with enthusiasm. I have some comments on the Provider Directory standard here: <a href=\"http://www.fhir.org/guides/argonaut/pd/\" target=\"_blank\" title=\"http://www.fhir.org/guides/argonaut/pd/\">http://www.fhir.org/guides/argonaut/pd/</a> I am. currently trying to reconcile the real-world role of NPPES and this standard. And part of the problem with this is that the use cases listed on that page for provider directory are, not actually use cases, but functions. Use cases typically include the reasons why someone needs a functionality, as well as documenting the functionality. The functionality listed there could be summarized as \"search for and get provider data\". But full use cases should include. \"transmit the data required to enable finding provider data in order to support the routing of healthcare data to them\" and \"transmit data needed for determining the appropriateness/credentials/specialty and availability of a provider for a potential patient referral\" or \"transmit the data that allows patients to find doctors in order to make appointments\" and \"providing data for researchers to be able to study providers\".  Those are the reasons that search is necessary and should be included in the use cases on those page.  Without those it is impossible to determine if NPPES should be a compliant provider directory because the \"real\" reasons that an HL7 FHIR Provider Directory should exist are not actually listed. Is this something that can be easily corrected? These concepts are included in the discussions from the 2016 provider directory workshop as well as use cases outlined in the IHE provider directory specification... so I hope that it is reasonable to surface these. Frankly it would be enough to add the sentence \"the purpose of the provider directory is to facilitate further interoperability efforts and the study thereof\". But it even missing something that high-level.</p>",
        "id": 168220943,
        "sender_full_name": "Fred Trotter",
        "timestamp": 1560628212
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194659\">@Daniel Chaput</span> <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 168221142,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560628626
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/HL7/VhDir/\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/VhDir/\">http://build.fhir.org/ig/HL7/VhDir/</a> is probably the most relevant recent effort btw <span class=\"user-mention\" data-user-id=\"225426\">@Fred Trotter</span> . <a href=\"http://build.fhir.org/ig/HL7/VhDir/general-guidance.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/VhDir/general-guidance.html\">http://build.fhir.org/ig/HL7/VhDir/general-guidance.html</a> provides context and a bit of the use case flavor you're asking about here.</p>",
        "id": 168222182,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560630812
    },
    {
        "content": "<p>(This is the \"continuously integration\" build for that guide; under active development.)</p>",
        "id": 168222222,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560630865
    },
    {
        "content": "<p>Brilliant. My problem is solved.</p>",
        "id": 168224558,
        "sender_full_name": "Fred Trotter",
        "timestamp": 1560635791
    },
    {
        "content": "<p>If you log a tracker through the link on the core spec I'll make sure those cases are also described in there too.</p>",
        "id": 168232875,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1560653670
    },
    {
        "content": "<p>Applied for access to <a href=\"http://gforge.hl7.org\" target=\"_blank\" title=\"http://gforge.hl7.org\">gforge.hl7.org</a> which I assume is the write place to make such a ticket.</p>",
        "id": 168255947,
        "sender_full_name": "Fred Trotter",
        "timestamp": 1560697364
    },
    {
        "content": "<p>Ok, next question. I have credentials that I have found in NPPES that are not found in the current credential list. <br>\n<a href=\"http://hl7.org/fhir/v2/0360/2.7/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/v2/0360/2.7/index.html\">http://hl7.org/fhir/v2/0360/2.7/index.html</a><br>\nand <br>\n<a href=\"http://hl7.org/fhir/v2/0360/2.7/v2-0360-2.7.cs.json.html\" target=\"_blank\" title=\"http://hl7.org/fhir/v2/0360/2.7/v2-0360-2.7.cs.json.html\">http://hl7.org/fhir/v2/0360/2.7/v2-0360-2.7.cs.json.html</a><br>\nAlso, the current credential list lacks any url to the manager of the credential. For instance, a CHT - Certified Hand Therapists is a credential that can only be obtained through the The Hand Therapy Certification Commission at <a href=\"http://www.htcc.org/\" target=\"_blank\" title=\"http://www.htcc.org/\">http://www.htcc.org/</a> So it should be possible for someone to validate that credential through that organization. In fact, assuming credentialing is in scope, when a given credential is associated with one and only one source, we should be linking to that source, to facilitate the credentialing process. Eventually, those sources should have provider directories of their own, so that they can automate the credentialing process. But at least linking to them seems prudent. There are some credentials like 'MD' and 'DO' that are verified by specific schools attended... and can even be acquired internationally, so there is no \"single source of truth\" but it does seem like if there is a \"single source of truth\" we should list it, especially if we want them to have provider directories eventually. I want to propose 1 that we add all of the credentials that are \"in the wild\" in NPPES 2. that we add the fields \"is_credential_single_sourced (true/false)\" and \"credential owner name\" and \"credential owner url\" and \"credential owner provider directory url\" to this data structure. How, where and to whom do I make that proposal?</p>",
        "id": 168256734,
        "sender_full_name": "Fred Trotter",
        "timestamp": 1560698844
    },
    {
        "content": "<p>You are 100% right there. And one of the areas that will need further profiling during the next stage of the VhDir guide with the US specific credential providers etc. I was wondering who would be the appropriate registrar of these things, ONC, HHS, CMS, HL7? (the credential providers, not the identifier/qualification values)<br>\nIn Australia we've started doing that in the au-base IG.<br>\nSo could be another alternative to put these in US-Core and link into the VhDir IG, as these values are going to be used outside the directory too.</p>",
        "id": 168272620,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1560728715
    },
    {
        "content": "<p>Is there any guide on how to create a sample FHIR Provider directory server?<br>\nThere is a <a href=\"https://confluence.hl7.org/display/PA/Connectathon+Jan+2019+at+WGM\" target=\"_blank\" title=\"https://confluence.hl7.org/display/PA/Connectathon+Jan+2019+at+WGM\">Connectathon Jan 2019 at WGM</a> , but is there a guidance/tool on how to load IG and sample data to the FHIR Server?</p>",
        "id": 168349026,
        "sender_full_name": "Elkhan Yusubov",
        "timestamp": 1560806783
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 168364340,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560825400
    },
    {
        "content": "<p>given that this is an international problem, and that we do need to support cases where healthcare providers are switching countries and given that HL7 is the only international body on your list, I suppose that it makes sense that HL7 should ultimately own the \"master list\". <br>\nIn the short term tho.. I think we should be adding a \"country_jurisdiction\" to the fields I just suggested in order to create a two-level namespace. I expect that M.D. etc probably can be verified by a single source in many countries and so it makes sense to use an appropriate country code there, in addition to the other values. While this seems like overkill, I expect that the assertion that \"this Dr obtained their MD in spain\" is exactly the type of long term benifits that the provider directory should be able to support... </p>\n<p>But I still do not know how I go about getting new columns and new rows added this file that is being used today. How do I get that done?</p>",
        "id": 168369112,
        "sender_full_name": "Fred Trotter",
        "timestamp": 1560832543
    },
    {
        "content": "<p>HL7 doesn't own <em>any</em> list of provider information.  We define standards for sharing information via registries.  We don't maintain a provider registry of our own and (to my knowledge), have no intention of doing so.</p>",
        "id": 168369280,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560832800
    },
    {
        "content": "<p>Sorry to be unclear, but I was not talking about lists of providers (although there do appear to be lots of them in the OID registry, so I am unclear what you mean when you say there is no list of providers..). but I am instead discussing lists of provider credentials, which lives here: <a href=\"http://hl7.org/fhir/v2/0360/2.7/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/v2/0360/2.7/index.html\">http://hl7.org/fhir/v2/0360/2.7/index.html</a></p>",
        "id": 168369454,
        "sender_full_name": "Fred Trotter",
        "timestamp": 1560833062
    },
    {
        "content": "<p>And those are credential types...</p>",
        "id": 168380822,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1560847485
    },
    {
        "content": "<p>Is there a weekly or monthly meeting for a group that works on VhDir (Validated Healthcare Directory)?</p>",
        "id": 168618212,
        "sender_full_name": "Elkhan Yusubov",
        "timestamp": 1561053245
    },
    {
        "content": "<p>You can ask questions on it in the <a class=\"stream\" data-stream-id=\"179317\" href=\"/#narrow/stream/179317-VHDir---Validated-Healthcare-Directory\">#VHDir - Validated Healthcare Directory</a> stream, which is where some of the discussions go on.<br>\nThe development side has mostly wrapped up with the closing publication steps almost done.<br>\nPatient Administration is the group that handles this, and we are having weekly calls Wed 3pm eastern US, and you're welcome to post questions to the VhDir channel, or the <a class=\"stream\" data-stream-id=\"179254\" href=\"/#narrow/stream/179254-patient-administration-WG\">#patient administration WG</a> channel ahead of the call for discussion, so that others can prepare for the questions.<br>\n<a href=\"https://confluence.hl7.org/display/PA/2019-06-26+Conference+Call+Agenda\" target=\"_blank\" title=\"https://confluence.hl7.org/display/PA/2019-06-26+Conference+Call+Agenda\">https://confluence.hl7.org/display/PA/2019-06-26+Conference+Call+Agenda</a></p>",
        "id": 168653238,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1561088452
    },
    {
        "content": "<p>@Fred and <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> the list Fred's link refers to is provider degrees, which generally lead to licensure. Additional certifications, e.g. the hand therapy certification noted earlier in the thread, is a different kind of credential and I would be careful not to lump actual educational degrees leading to licensure with other, non-degree certifications or certifications that are in addition to the degree or license. Depending on the type of certification, having one will not by itself enable an individual to practice without having a degree and license first.</p>",
        "id": 171112441,
        "sender_full_name": "Gail Kocher",
        "timestamp": 1563393692
    },
    {
        "content": "<p>Hello dear colleagues, same as a time at birth, this same question keeps coming back: Provider Directory. IHE mCSD/ILR, VHDir or Argonaut? What is the difference? Which one to use to build or is there anything to re-use/upgrade? I think I am missing something important here and hope for help from the collective experience, please.</p>",
        "id": 223997897,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1611637470
    }
]