[
    {
        "content": "<p>Our terminology server creates SNOMED, LOINC, and other CodeSystem resources from 3rd party artefacts (eg SNOMED's RF2 source files).  These come to us with a client-provided hash-based signature which we want to surface so that there's traceability from the CodeSystem in the terminology server to the source via this client-provided hash.<br>\nI had thought of this as Provenance following this: <a href=\"http://hl7.org/fhir/provenance.html#6.3.4.5\" target=\"_blank\" title=\"http://hl7.org/fhir/provenance.html#6.3.4.5\">http://hl7.org/fhir/provenance.html#6.3.4.5</a> but am struggling with where the hash should go.</p>",
        "id": 159473999,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1551230529
    },
    {
        "content": "<p>Probably an extension</p>",
        "id": 159475146,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551232009
    },
    {
        "content": "<p>And would I use Device to represent the software itself (as the transforming agent)?</p>",
        "id": 159480089,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1551239202
    },
    {
        "content": "<p>y</p>",
        "id": 159480705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551240175
    },
    {
        "content": "<p>the hash could go into Provenance.signature. There is nothing against any form of signature being used. You would put the hash value into Provenance.signature.data. What you do need to do is find a MIME-Type for that kind of 'file'.. as in a file that is nothing but a SHA-256 hash value. I don't know of a mime-type for this, but that doesn't mean there isn't one... if there isn't one, then you create your own mime-type following the mime-type extentibilty method.</p>",
        "id": 159522219,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551279839
    },
    {
        "content": "<p>there is no requirement that Signature contain a cryptographic signature. Local policy, or Implementation Guides, would restrict. There are plenty of places just capturing ink-on-paper in a JPEG and putting that image there.</p>",
        "id": 159522479,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551280069
    },
    {
        "content": "<p>SHA-256 sounds like an MD5 file which has mimetype text/plain</p>",
        "id": 159522807,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1551280286
    },
    {
        "content": "<p>true. but it wouldn't hurt to be a bit more specific. text/plain+sha256</p>",
        "id": 159523128,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551280548
    },
    {
        "content": "<p>+sha256 would be nice, but using unregistered suffixes is explicitly discouraged</p>",
        "id": 161042587,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1552901738
    }
]