[
    {
        "content": "<p>We are looking at creating Provenance instances for resource we ingest into our system, mainly to document when and from where they were imported. After reviewing Provenance, it seemed <code>activity</code> was the key element for indicating <em>what</em> actually happened (creation, update, signing...). So a mapping like this seemed appropriate for us</p>\n<ul>\n<li><code>activity</code>: \"CREATE\" (from <code>http://terminology.hl7.org/CodeSystem/v3-DataOperation</code>)</li>\n<li><code>agent.type</code> = \"performer\" (from <code>http://terminology.hl7.org/CodeSystem/provenance-participant-type</code>)</li>\n<li><code>agent.who</code> = Reference to the (customer-specific) system doing the ingestion</li>\n</ul>\n<p>But then I noticed that the  <a href=\"http://hl7.org/fhir/R4/provenance-example.json.html\">simplest Provenance example in the spec</a> does not use <code>activity</code>, and that the <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-provenance.html\">US Core IG Provenance profile</a> does not declare <code>activity</code> must-support (and does not use it in <a href=\"http://hl7.org/fhir/us/core/Bundle-c887e62f-6166-419f-8268-b5ecd6c7b901.json.html\">this official example</a>). Hence the following questions:</p>\n<ol>\n<li>How is one supposed to understand what happened with the target resource if <code>activity</code> is not used (as in the two examples linked above)? E.g. should it be inferred from <code>agent.type</code> (if present) or does it implicitly default to resource creation? I am thinking particularly of scenarios in which one cannot reference specific versions of the target resource (not possible on our system), so that provenance instances for creation and update would have exactly the same target.</li>\n<li>Following on that, is the usage of <code>activity</code> and <code>agent</code> I suggested above appropriate for our case?</li>\n</ol>",
        "id": 248325220,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628067328
    },
    {
        "content": "<p>We interestingly use agent.who as the reference to the document it came from, not necessarily the source system. Would be interesting to see how others are implementing (<a href=\"https://github.com/GoogleCloudPlatform/healthcare-data-harmonization/blob/master/mapping_configs/hl7v2_fhir_r4/projector_library/datatypes.wstl\">https://github.com/GoogleCloudPlatform/healthcare-data-harmonization/blob/master/mapping_configs/hl7v2_fhir_r4/projector_library/datatypes.wstl</a>)</p>",
        "id": 248341527,
        "sender_full_name": "Vivian Neilley",
        "timestamp": 1628079290
    },
    {
        "content": "<p>Noted. The security wg is addressing some fantastic Change Requests from the last ballot. The issues you are pointing at are clearly within this set of questions. The use of the Change Request system is very important to improving the specification.</p>",
        "id": 248341981,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628079619
    },
    {
        "content": "<p>The vocabulary binding to .activity is going to radically change. It should be only recommending event type codes, and the .activity is intended to hold a code that expresses the type of event that caused the change. The current vocabulary has a large number of inappropriate codes.</p>",
        "id": 248342243,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628079810
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> seems you are describing an activity of importing data. so you would want an .activity that says importing.  -- There does not seem to me to be a good code in the valueSet given (as I said above, this is known to be a useless valueset).<br>\nI don't think that you would be doing a \"CREATE\" as you are importing, not creating.<br>\nWe should find a good code for Import. In IHE I used <code>http://hl7.org/fhir/w3c-provenance-activity-type#Derivation</code>    I am not sure that is the right code to use either.</p>",
        "id": 248343853,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628080755
    },
    {
        "content": "<p>so you can see why few have used .activity... it is indeed poorly defined.</p>",
        "id": 248344183,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628080977
    },
    {
        "content": "<p>as to the question (1)... I am not sure I fully understand your question.  If the question is about the .target and how to handle when version specific targets are not supported? This is not something we address. If you have creation times, you can correlate creation times with the provenance recorded with that time, and thus all other provenance are updates in the order of time. You can even just sort the provenance by time and the oldest one is most likely a create. Time is the best key you have if you don't have a versioning FHIR server.</p>",
        "id": 248344654,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628081249
    },
    {
        "content": "<p>the agent.type would differentiate multiple agents from each other. So you might have an agent for the source that sent you the data, and one for the system doing the import.<br>\nAgain, this vocabulary is poor, and we are working on it.  Would be good to get feedback on the kinds of things you want to say about agents.</p>",
        "id": 248345025,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628081477
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311758\">Vivian Neilley</span> <a href=\"#narrow/stream/179166-implementers/topic/Provenance.20-.20understanding.20what.20happened/near/248341527\">said</a>:</p>\n<blockquote>\n<p>We interestingly use agent.who as the reference to the document it came from, not necessarily the source system. Would be interesting to see how others are implementing (<a href=\"https://github.com/GoogleCloudPlatform/healthcare-data-harmonization/blob/master/mapping_configs/hl7v2_fhir_r4/projector_library/datatypes.wstl\">https://github.com/GoogleCloudPlatform/healthcare-data-harmonization/blob/master/mapping_configs/hl7v2_fhir_r4/projector_library/datatypes.wstl</a>)</p>\n</blockquote>\n<p>This is wrong. the reference document would go in an .entity. A document can't be an .agent.</p>",
        "id": 248345146,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628081545
    },
    {
        "content": "<p>I thank you both for bringing these forward. It is inspiring me to make R5 better. I might also work on an informal IG on Provenance similar to what I have done for Basic Audit <a href=\"http://build.fhir.org/ig/JohnMoehrke/BasicAudit/branches/main/index.html\">http://build.fhir.org/ig/JohnMoehrke/BasicAudit/branches/main/index.html</a></p>",
        "id": 248345385,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628081702
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, thanks for all the feedback and for picking up all these themes! There are several interesting issues here so I will try to separate them a bit:</p>\n<p><strong>Value sets bound to <code>activity</code> and other elements</strong><br>\nYou hit the nail on that one, I was indeed very confused about them and what would be an appropriate choice for a given case <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> (e.g. having things like \"analyte\" or \"origin\" as possible codes for an <em>activity</em>). Great you are working on those! </p>\n<p><strong>Appropriate code for activity in our case</strong><br>\nThis was indeed smt. I was unsure about, not only because of the bound value set.  I think my key confusion is whether the Provenance is talking about (1) the data itself, independent of the specific technical incarnation, or (2) the specific technical artefact I am creating on my system. If it's talking about (2), then \"CREATE\" seems appropriate since I am indeed creating a new artefact on my system (the one I point to in <code>target</code>). If it's talking about (1), then \"CREATE\" is clearly not the full story since the activity that actually happened was that data flowing in from one system was piped into a new artefact on my system But I would certainly be happy with a code saying \"importing\", only , as you say, there is no obvious candidate.</p>\n<p><strong>Interpreting Provenance without explicit activity</strong><br>\nWhat I meant by my question (1) was this: If I am given a Provenance resource with only <code>target</code> = A and <code>agent</code> = B (and <code>recorded</code> = T), it seems all I know is \"Agent B did <em>something</em> to resource A and recorded it at time T\". Even if I can time order different Provenances instances, this seems quite vague . E.g. there would be no way to distinguish updating, reviewing, signing, adding a security label etc. I suppose I'm simply struggling to understand what useful information I can extract from this. A more concrete way of asking this would be this: Suppose I have a UI and the users can click on a resource to see a brief summary of its provenance in a pop-up (this is essentially our use case). If I have an \"activity-less Provenances\", what could I display to users (that would bring them value) in that pop-up?</p>\n<p><strong>What I would like to say about agents in our current use case</strong><br>\nIn our case, we basically want to say that a particular instance of our ingestion pipeline (so basically a Device) moved this piece of data onto to our system from somewhere else (we will typically not know what that \"somewhere else\" is). So it is a non-human actor that blindly passes the data on without looking into or modifying it. For <code>agent.type</code>, I had a hard time finding a good code to communicate that the ingestion system is just piping the data into a different system without modifying it. Most of the existing codes other than the very generic \"performer\" seem to indicate more active involvement than in my case - in general, the value set seems mainly targeted at human actors. I see that the US Core Provenance profile add the participation type code \"transmitter, which is a good match for our use case, so that seems like a very sensible addition.</p>",
        "id": 248350259,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628084084
    },
    {
        "content": "<p>BTW just let me know if you need Jira issue for smt. specific.</p>",
        "id": 248351006,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628084406
    },
    {
        "content": "<p>Agreed. Activity depends on reconciliation of the data - which is handling fhir to fhir after initial mapping - thus - activity wouldn't be as relevant (it would always create, then be reconciled).</p>",
        "id": 248354221,
        "sender_full_name": "Vivian Neilley",
        "timestamp": 1628085973
    },
    {
        "content": "<p>so the current plan for the activity valueset is to change to Example binding, and include just a handful of codes. So would love to hear of codes being used as those would be good handful. -- <a href=\"https://jira.hl7.org/browse/FHIR-33020\">https://jira.hl7.org/browse/FHIR-33020</a></p>",
        "id": 248374557,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628094974
    },
    {
        "content": "<p>more specifically on Provenance.activity - <a href=\"https://jira.hl7.org/browse/FHIR-32517\">https://jira.hl7.org/browse/FHIR-32517</a></p>",
        "id": 248374675,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628095045
    },
    {
        "content": "<p>I think you might be looking to .activity when you should be looking for .reason... but the current model does not make this clear. There is big changes coming to .reason -- <a href=\"https://jira.hl7.org/browse/FHIR-32354\">https://jira.hl7.org/browse/FHIR-32354</a></p>",
        "id": 248374882,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628095136
    },
    {
        "content": "<p>I agree with your assessment that the Provenance is more about the activity than the RESTful action. Although recording the RESTful action is sometimes all that can be done, and is not uncommon for a FHIR Server to be able to automatically do. Thus an initial instance of some target resource might have a simple Provenance, as recorded by the FHIR Server, and a more comprehensive Provenance as recorded by the session level application/service that knows more. Might even have others.</p>",
        "id": 248375320,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628095332
    },
    {
        "content": "<p>We do have a request for clarity for systems that are just transforming - <a href=\"https://jira.hl7.org/browse/FHIR-26313\">https://jira.hl7.org/browse/FHIR-26313</a></p>",
        "id": 248375674,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628095521
    },
    {
        "content": "<p>Security workgroup meets on Mondays - Here is the agenda/minutes from this week with the details on how to participate.<br>\n<a href=\"https://confluence.hl7.org/display/SEC/2021-08-02+FHIR-Security+Meeting+Agenda\">https://confluence.hl7.org/display/SEC/2021-08-02+FHIR-Security+Meeting+Agenda</a></p>",
        "id": 248375988,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628095678
    },
    {
        "content": "<p>Thanks for the JIRA links <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> - reviewing the issues I realized that \"assembler\" is probably the more appropriate <code>agent.type</code> for us.</p>\n<blockquote>\n<p>so the current plan for the activity valueset is to change to Example binding, and include just a handful of codes. So would love to hear of codes being used as those would be good handful. -- <a href=\"https://jira.hl7.org/browse/FHIR-33020\">https://jira.hl7.org/browse/FHIR-33020</a></p>\n</blockquote>\n<p>I just saw the  activity codes from <a href=\"http://terminology.hl7.org/CodeSystem/iso-21089-lifecycle\">http://terminology.hl7.org/CodeSystem/iso-21089-lifecycle</a> (part of the bound VS in the latest build).  On a quick review, these look like a very useful selection for our world (if they are free to use, cf. <a href=\"#narrow/stream/179202-terminology/topic/Term.20of.20use.20for.20core.20CS.20with.20ISO.2021089.20Lifecycle.20Event.20codes\">this thread</a>)..  One curious thing about that code system, though, is that it is does not contain an obvious code for a plain create (\"originate\" seems close, but the definition sounds more convoluted).</p>",
        "id": 248581604,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628236609
    },
    {
        "content": "<p>almost all valuesets in Provenance will be moving to example and just have a handful of useful codes.</p>",
        "id": 248600929,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628250789
    }
]