[
    {
        "content": "<p>Hi All!</p>",
        "id": 153820462,
        "sender_full_name": "Gunther Meyer",
        "timestamp": 1460119829
    },
    {
        "content": "<p>I recently attended the ONC Provider Directory, and Brian mentioned that the work on the Provider Registry Implementation Guide has started.</p>\n<p>I was wondering if we could use the Provider Registry to store API information.  </p>\n<p>The Use Cases would be something like the following: <br>\nAs a patient I want to connect to my Doctor’s Hospitals’ or Clinic’s or Practice’s EHR’s API using a mobile app, knowing only my provider’s name and maybe practice/hospital.<br>\nOne example of this could be the Sync 4 Science initiative in the USA.</p>\n<p>The patient or user could find their provider and org, and from there an App could pick up the URL of, so, the conformance statement.</p>\n<p>Regards</p>\n<p>Gunther</p>",
        "id": 153820463,
        "sender_full_name": "Gunther Meyer",
        "timestamp": 1460120342
    },
    {
        "content": "<p>This is something that we'd like to consider the directory resources could handle, and there is a new resource proposal in the continuous build that is the intiial draft of the endpoint resource to be considered. (Very draft)</p>",
        "id": 153820592,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1460336663
    },
    {
        "content": "<p><a href=\"http://hl7-fhir.github.io/endpoint.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/endpoint.html\">http://hl7-fhir.github.io/endpoint.html</a></p>",
        "id": 153820593,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1460336683
    },
    {
        "content": "<p>This is not currently linked from any indexes as yet either.</p>",
        "id": 153820594,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1460336704
    },
    {
        "content": "<p>Thanks for sharing Brian, going through it now.</p>",
        "id": 153820649,
        "sender_full_name": "Gunther Meyer",
        "timestamp": 1460376864
    },
    {
        "content": "<p>Jeff from MiHN has had a quick look also and noted that there are some minor differences to their definition which I plan to review and incorporate.</p>",
        "id": 153820991,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1460439126
    },
    {
        "content": "<p>(They have an extension on basic to create a DSTU2 conformance resource for this)</p>",
        "id": 153820992,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1460439158
    },
    {
        "content": "<p>So I think the area that is least defined, but probably will require some prototyping to test out the variability, is payload  (type and format).</p>\n<p>I think ii mixes the concepts of purpose (why would you use the endpoint) with a definition of what is passed in and what is returned.<br>\nI think we can define purpose well.  Definition of parameters sounds more like conformance or definition of meta-programming to me, and if that is the case I'd suggest defer it.</p>\n<p>e.g. Some codified way of saying <br>\n'This is a Careplan CCDA Document and you need to use XDS.b to retrieve it' makes sense</p>\n<p>Also, Public Key seems to require some additional information, such as the purpose of the key</p>",
        "id": 153821192,
        "sender_full_name": "Gunther Meyer",
        "timestamp": 1460464636
    }
]