[
    {
        "content": "<p>Is there a difference between Provenance.period (activity = enter) and Provenance.recorded? Might .recorded be deprecated?</p>",
        "id": 161104023,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1552949865
    },
    {
        "content": "<p>Quite a difference.  Provenance.recorded is when the activity was recorded into the resource.  Provenance.period is when the change to the provenanced resource happenened</p>",
        "id": 161104132,
        "sender_full_name": "David Pyke",
        "timestamp": 1552949964
    },
    {
        "content": "<p>often these are at the same time.. but one might detect a change, but not able to record a Provenance until later.    A good question would be if the recorded element really needs to be a core element, or could be a core extension to help simplify the Provenance resource.</p>",
        "id": 161143271,
        "sender_full_name": "John Moehrke",
        "timestamp": 1552996860
    },
    {
        "content": "<p>That's kind of the conceptual distinction I see, but I'm not seeing an application.</p>\n<p>The VA has a lot of actions that are captured without distinction - entered, signed, verified, e.g. It's assumed that the verification time and the verification entry time are the same - the knowledge work is being done on the EHR.</p>\n<p>There a few case where there might be some daylight between the two times, e.g., \"dictated.\" But we don't capture \"entry of 'dictated' time.\" If it were important, there could be another activity. </p>\n<p>As it is, having two fields seems to blur the lines between model and meta.</p>",
        "id": 161155019,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1553005738
    },
    {
        "content": "<p>I've been struggling with this too. My use case is converting a v2 VXU (immunization event message) into FHIR resources. A number of things happen (1) the vaccine is given, (2) the immunization event is recorded in the EHR, (3) a v2 message is created and (4) that v2 message is transformed into FHIR resources.  Would Provenance.period be (1) or (2)? Does it matter that the v2 message, doesn't actually contain a value for step (2)? Would Provenance.recorded be (2), (3) or (4)? And which of these steps is the actual \"activity\" that the Provenance resource is tracking?</p>",
        "id": 161344255,
        "sender_full_name": "Craig Newman",
        "timestamp": 1553174543
    },
    {
        "content": "<p>I think the only way to answer that is to define an Implementation Guide that covers your specific use-case. The core FHIR specification is not going to decide one way or the other. Core specifications are open to all reasonable needs. An Implementation guide would get specific.</p>",
        "id": 161400885,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553207125
    },
    {
        "content": "<p>In Craig's example, Immunization already has 1 (Immunization.occurrence) and 2 (Immunization.recorded), so neither would be in Provenance.</p>\n<p>For properties that are not in the resource, my assumption is that you'd put whatever record activity(ies) that you want to track in Provenance.  </p>\n<p>Which is why it looks to me like Provenance.recorded is a redundant and partial representation of Provenance.occurred where Provenance.activity = \"record\".</p>\n<p>(And I'd be uncomfortable putting administration time in there. It is part of the process by which the information was generated, and if you squint hard you could consider it \"meta,\" but as an atoms-not-bits activity I think it's disqualified. It's a business object, not an annotation.)</p>",
        "id": 161860835,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1553694793
    },
    {
        "content": "<p>Just because immunization has them doesn't mean they wouldn't also appear in Provenance.  Resources often contain a subset of Provenance information.  The Provenance record will duplicate that information - otherwise it'd be pretty useless to search on.</p>",
        "id": 161871286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553700806
    },
    {
        "content": "<p>For reference there is a complete walk through of the intended overlap between Provenance elements and the various Resources. See <a href=\"http://build.fhir.org/fivews.html#mappings\" target=\"_blank\" title=\"http://build.fhir.org/fivews.html#mappings\">http://build.fhir.org/fivews.html#mappings</a></p>",
        "id": 161872643,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553701741
    }
]