[
    {
        "content": "<p>While trying to compose a Provenance resource to annotate stuff that is extracted from a V2 message and posted on a server, I just realized, that Provenance doesn't fit this use case very well. I hardly find any useful values to fill in, if the agent is a middleware engine.</p>",
        "id": 153826613,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462920437
    },
    {
        "content": "<p>Would the V2 message I pulled the stuff from be considered an \"entity\" in this context?</p>",
        "id": 153826615,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462920495
    },
    {
        "content": "<p>Simone, please explain why you see it as not useful? Rene did find it useful to explain where the v2 object came from, and to point at a copy of the original in Provenance.entity</p>",
        "id": 153826616,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462920508
    },
    {
        "content": "<p>Yes, Povenance.entity would be the information used in creating the 1..* Provenance.target resources</p>",
        "id": 153826617,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462920542
    },
    {
        "content": "<p>I'm not saying Provenance isn't useful, but I am having trouble fitting things like \"name of the middleware system\", \"id of the original message\" into it or picking proper values for agent.role etc.</p>",
        "id": 153826618,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462920665
    },
    {
        "content": "<p>I do have an example that I have not yet integrated into the build that Rene did...</p>",
        "id": 153826619,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462920682
    },
    {
        "content": "<p>Oh yes please! That would be helpful!</p>",
        "id": 153826620,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462920703
    },
    {
        "content": "<p>Rene worked on it... this might be his blog on the topic  <a href=\"http://www.ringholm.com/docs/04350_mapping_HL7v2_FHIR.htm\" target=\"_blank\" title=\"http://www.ringholm.com/docs/04350_mapping_HL7v2_FHIR.htm\">http://www.ringholm.com/docs/04350_mapping_HL7v2_FHIR.htm</a></p>",
        "id": 153826621,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462920779
    },
    {
        "content": "<p>of course things change from blog articles, so check with him... </p>",
        "id": 153826622,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462920791
    },
    {
        "content": "<p>Hah. That's fun. The place where Rene captured the fact, that the Agent is in fact a software (agent.type) is missing in the resource definition ...</p>",
        "id": 153826623,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462921116
    },
    {
        "content": "<p>likely now Provenance.agent.role</p>",
        "id": 153826624,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462921403
    },
    {
        "content": "<p>reason.text to capture the fact that this is the result of a message transformation doesn't work either because reason is a Coding not a CodableConcept</p>",
        "id": 153826625,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462921433
    },
    {
        "content": "<p>I would be glad to put an example into the specification... Just need a few eyes to look one example over before we put it in. I would suggest you work with Rene and suggest one example.</p>",
        "id": 153826626,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462921469
    },
    {
        "content": "<p>love to get these suggestions as CPs... need real-world input. </p>",
        "id": 153826627,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462921549
    },
    {
        "content": "<p>ok, let's set up the scenario:  We have some sort of middleware device that receives some sort of non-FHIR input (e.g. a V2 message, a CDA document, a CSV file...)  and extracts FHIR resources from this input and posts them on a server. The resulting transaction is supposed to include a provenance resource that captures <br>\na) some information about the middleware (type, vendor, version...)<br>\nb) information about the data source (type/format, identifier (original filename or messageID ) to trace it back)<br>\nc) if known,  information about the software that created the original input<br>\nd) if known, information about the user that created the information in the first place (e.g. from the EVN-Segment)</p>",
        "id": 153826629,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462923257
    },
    {
        "content": "<p>Would a) c) and d) be all agents, or would any of them be a relatedAgent?</p>",
        "id": 153826630,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462923333
    },
    {
        "content": "<p>The roles (<a href=\"http://hl7-fhir.github.io/valueset-provenance-agent-role.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/valueset-provenance-agent-role.html\">http://hl7-fhir.github.io/valueset-provenance-agent-role.html</a>) could be<br>\na) assembler<br>\nc) composer<br>\nd) author<br>\n...does that make sense?</p>",
        "id": 153826631,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462923429
    },
    {
        "content": "<p>I don't know how to fit b) into the entity part of provenance. Though the entity.role \"derived\" seems like a good fit, it seems that the entity itself is expected to be a FHIR resource.</p>",
        "id": 153827036,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462995923
    },
    {
        "content": "<p>I created <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996</a> to keep track of this.</p>",
        "id": 153827063,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462997840
    },
    {
        "content": "<p>Oh, I just realized we talked about Rene, but didn't tag him. So: <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> : Care to chime in? :)</p>",
        "id": 153828873,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1463756141
    },
    {
        "content": "<p>[#9996] Summary: Using Provenance resource to annotate content derived from non-FHIR sources </p>",
        "id": 153839693,
        "sender_full_name": "Glen Marshall",
        "timestamp": 1468945165
    },
    {
        "content": "<p>Original comment:</p>\n<p>While trying to compose a Provenance resource to annotate stuff that is extracted from a V2 message and posted on a server, I just realized, that Provenance doesn't fit this use case very well. I hardly find any useful values to fill in, if the agent is a middleware engine.</p>\n<p>Here's the Scenario:</p>\n<p>We have some sort of middleware device that receives some sort of non-FHIR input (e.g. a V2 message, a CDA document, a CSV file...) and extracts FHIR resources from this input and posts them on a server. The resulting transaction is supposed to include a provenance resource that captures <br>\na) some information about the middleware (type, vendor, version...)<br>\nb) information about the data source (type/format, identifier (original filename or messageID ) to trace it back)<br>\nc) if known, information about the software that created the original input<br>\nd) if known, information about the user that created the information in the first place (e.g. from the EVN-Segment)</p>\n<p>Would a) c) and d) be all agents, or would any of them be a relatedAgent?</p>\n<p>The roles (<a href=\"http://hl7-fhir.github.io/valueset-provenance-agent-role.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/valueset-provenance-agent-role.html\">http://hl7-fhir.github.io/valueset-provenance-agent-role.html</a>) could be<br>\na) assembler<br>\nc) composer<br>\nd) author</p>\n<p>...does that make sense?</p>\n<p>I don't know how to fit b) into the entity part of provenance. Though the entity.role \"derived\" seems like a good fit, it seems that the entity itself is expected to be a FHIR resource and nothing else...</p>\n<p>Help, please!</p>\n<p>Proposed response: </p>\n<p>Accepted with modification: include the following non-normative guidance:<br>\n1.  The middleware, original input, and use are all agents.  They act independently of each other, so are not relatedAgent.  Each is associated with a Provenance instance.        <br>\n2.  Middleware is an assembler for the purposes of Provenance.  Other agents are assigned roles per the role vocabulary definitions.<br>\n3.  Metadata, if known, should be associated with each of the agents.  Any missing values should be null or default, depending on the defined cardinality in Provenance.</p>",
        "id": 153839694,
        "sender_full_name": "Glen Marshall",
        "timestamp": 1468945184
    },
    {
        "content": "<p>Also,  the Provenance.entity might point at a copy of the raw data received (e.g. the HL7 v2 message). This might have been saved as a Binary resource for this purpose.</p>",
        "id": 153839697,
        "sender_full_name": "Glen Marshall",
        "timestamp": 1468945245
    },
    {
        "content": "<p>Hi Simone.  I think this is a good use case because it involves which actor roles are used based on what is being imported and how.  I'll give you my opinion piecemeal so it's easier to respond to.  </p>\n<p>1) The provenance information that is extracted from the original file/data should be extracted and identified in the new resource that is created.  The system should be able to pull that out if it's a readable file.  </p>\n<p>2) I don't think information about the software that created the original data/file matters or will be available in a majority of cases unless they have referenced the device used to author the documents.  What I'm getting at is the original software probably doesn't matter.</p>\n<p>3) The middleware is IDed as an agent.  I think it's a related agent to the local system, which is also IDed as as agent, but I think the value sets are lacking to describe this.  </p>\n<p>4)  The most important point in this whole thing for me is the agent role.  In this case, I'm talking about the local system acting as an agent and taking the message or CDA document and turning it into a resource.  If it is taking a message or PDF or flat file or anything that is reproduced on a 1:1 basis, I think the role should always be author.  It is authoring a new resource from existing data but isn't making any changes.  If I as a downstream system see this, I will know I don't have to dig any deeper or validate anything because \"author\" is used in these 1:1 cases.  If the local system is disassembling a larger document but keeping all the data intact (1:1) during the resource creation process, then \"author\" should still apply, even though the end result is distributed among more than one resource.  Even though an algorithm is being used to perform the disassembly and creation, you can still trace everything back to the original file and nothing has been modified.  That is important because it relates to downstream validation and use.  If, however, you are using logic or algorithms to alter the source data or reduce or modify anything in the full set, then assembler or composer apply.  That role ID should be reserved to ID changes that have been applied in my opinion.  It's assembler if the process is automated, without human intervention and decision-making.  It's composer if someone is actually intervening and adding their logic or selections to the software that is used to perform the action.  In that case, the human is also acting as an agent and needs to be referenced.  </p>\n<p>The larger point here is that me as a downstream system can use that scheme to figure out if I need to validate the results further or check the original to see if I can trust it as a complete data set.  The agent role matters to me for that reason.  If I see author I can just move on, if I see either of the other two, there are additional steps that I may have to implement to ensure data fidelity.  I think we should probably talk about this and define it somewhere in the spec because the implications for system operations are large.</p>",
        "id": 153839717,
        "sender_full_name": "Oliver",
        "timestamp": 1468947517
    },
    {
        "content": "<p>Note this discussion is in support of us coming to a resolution on <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\">GF#9996</a></p>",
        "id": 153839792,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468959168
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> we really need your input, suggestion, improvements.</p>",
        "id": 153839794,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468959202
    },
    {
        "content": "<p>I think Simone captures the requirements pretty well. </p>",
        "id": 153840538,
        "sender_full_name": "René Spronk",
        "timestamp": 1469177224
    },
    {
        "content": "<p>An analogy: if you were to receive a translation (in English) of a Chinese clinical document, you'd like to know who the translation-agent was (a human, presumably one could look up their qualifications [the qualifications of the translator arent part of the provenance resource itself], or Google Translate). Yes, it would also be nice to know the original author of the document, but that may be a different provenance resource than the provenance resource which focuses on the \"translation\" activity. Maybe the v2-FHIR middelware solution should create two provenance resources ? (not sure) . <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  deals with the actual use case, so she's best positioned to make a recomendation..</p>",
        "id": 153840539,
        "sender_full_name": "René Spronk",
        "timestamp": 1469177594
    },
    {
        "content": "<p>The Provenance that the middleware can apply is only at the perspective from the middleware. </p>\n<p>1. It receives from sender X, payload Y.<br>\n2. It optionally saves payload Y as a FHIR Binary Resource (Y')<br>\n3. It disassembles Y into some number of Z FHIR Resources (Z(n)) which it creates<br>\n4. It creates a Provenance record P, with <br>\n       P.target all of Z(n); <br>\n       P.agent[0] - self as assembler; <br>\n       P.agent[1] is X as a ???; <br>\n       P.entity is Y' as source</p>\n<p>What we learn is that for the P.agent[1], we don't have a way to say 'source' for the role of that agent. So we have a need of new vocabulary.</p>",
        "id": 153843252,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470779667
    },
    {
        "content": "<p>I think the provenance resource will most likely be used for debugging purposes.<br>\nWhatever the middleware algorithm is, that authors/assemples the Resources: It can potentially be flawed.<br>\nAnd whenever such a flaw is detected, there needs to be a way to backtrace, which resources have been affected.</p>\n<p>It may also be that the original author (the sending software system) was affected e.g. by a system update and exported flawed data. In that case it would be helpful if I could trace back the Resources not only to the middleware but also to the original authoring system. However, I don't think there is a requirement to trace back to the original data enterer (the user of the authoring system). Most of the time this information can be retrieved from the source data (e.g. V2 EVN-Segment) and I don't see a use case that would require this to be searchable.</p>\n<p>I can imagine that having the original data as binary attachment will be helpful for debugging purposes. E.g. if a Resource looks suspicios, you can take a look at the original data to figure out whether the middleware or the original sending system is to blame.</p>\n<p>Beyond that I don't have any other requirements. However, that's from my Middleware point of view. Server implementers may have different use cases altogether for the provenance Resource.</p>\n<p>In the end: since the provenance Resource creates an enormous overhead in the communication and will most likely be implemented only reluctantly, I'd vote for: the simpler, the better!</p>",
        "id": 153843671,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1470946054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Given your post, I think my proposal aligns with it? Where as Glen's proposal added additional elements that you discounted. I agree the intermediary should only be responsible for the things that the intermediary can see from its perspective. If original author is necessary for a use-case then original content should have included author provenance, which would have been processed by the intermediary just like any content. This encapsulated provenance is source provenance not intermediary provenance.   correct?</p>",
        "id": 153843740,
        "sender_full_name": "John Moehrke",
        "timestamp": 1471014128
    },
    {
        "content": "<p>Security WG will discuss proposed change for <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\">GF#9996</a> today. Mostly explanation keeping with discussion here in chat and workgroup. Adding an explanation to the Provenance page explaining how middleware that transforms information on import might record this fact in a Provenance record.</p>",
        "id": 153855995,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478625549
    },
    {
        "content": "<p>Sorry, I missed you tagging me with your last question. I don't understand \"This encapsulated provenance is source provenance not intermediary provenance?\" What do you mean by \"encapsulated provenance\"?</p>",
        "id": 153855996,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478625946
    },
    {
        "content": "<p>Hi Simone.  The source data might include 'provenance' (likely in source data format). That kind of provenance is very helpful to explain the history of the source data prior to the middleware doing anything. That provenance is to the middleware, just like all the other source data... that is it is source data that the middleware imports, transforms, and hopefully properly created FHIR Resouces. What I was pointing out is that that provenance is not the topic of the CR, the topic of the CR is what Provenance record should the middleware create to explain what the middleware did.    That said, my proposal in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\">GF#9996</a> does have a paragraph explaining this. Hopefully we can get the words improved.</p>",
        "id": 153855997,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478626319
    },
    {
        "content": "<p>In this case, the answer is: yes :)</p>",
        "id": 153855998,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478626404
    },
    {
        "content": "<p>do you like the proposal in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\">GF#9996</a>?</p>",
        "id": 153855999,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478626539
    },
    {
        "content": "<p>Using Binary attachment to store the original V2 message -&gt; agreed.<br>\nSo we'd have something like Provenance.source.data of type reference with choice of (Binary|Bundle|ImagingStudy and whatnot)?<br>\nI think it would be useful to have at least have also a Provenance.source.identifier. If I know that a certain V2 message was sent in error, I'd want to be able to search by messageControlId and figure out which Resources have been created from this message without having to parse all of the binary attachments.</p>",
        "id": 153856003,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478627059
    },
    {
        "content": "<p>Interesting... Wonder if this is more of a Binary responsibility... </p>",
        "id": 153856007,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478627944
    },
    {
        "content": "<p>or does that call for treating the original v2 message as Document, and thus using DocumentReference to hold this identifier metadata?</p>",
        "id": 153856008,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478628026
    },
    {
        "content": "<p>The _has-parameter doesn't support chaining, so having it in the Binary resource won't help.</p>",
        "id": 153856009,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478628269
    },
    {
        "content": "<p>It has to be an attribute of Provenance</p>",
        "id": 153856010,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478628304
    },
    {
        "content": "<p>\"Give me all Observations created from the V2 message with controlId 123456\" would have to be something like <code>/Observation?_has:Provenance:target:source-identifier=123456</code><br>\n...assuming Provenance.source.identifier had a search attribute named \"source-identifier\"<br>\nThere's no way to use chaining like Provenance.source:Binary.identifier or something like that with the _has-Parameter</p>",
        "id": 153856011,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478628572
    },
    {
        "content": "<p>so, we should add an element to Provenance.entity.identifier to be used only when Provenance.entity.reference is Binary? Otherwise we create an element that can be in conflict with a FHIR native Resource that is pointed to by Provenance.entity.reference.</p>",
        "id": 153856013,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478628767
    },
    {
        "content": "<p>Ah, no! I think the solution is much easier:<br>\nentity.reference needs to be changed from Datatype \"uri\" to Datatype \"Reference\"</p>",
        "id": 153856014,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478629030
    },
    {
        "content": "<p>but it is URI because it might not always be a FHIR native object. Even in your case the content might be stored somewhere else, not as a FHIR Binary; but as just a HTTP object. </p>",
        "id": 153856015,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478629117
    },
    {
        "content": "<p>Then it can be either a literal reference to a Binary/Document.... and/or a logical reference hlding only an identifier: <a href=\"http://build.fhir.org/references.html#logical\" target=\"_blank\" title=\"http://build.fhir.org/references.html#logical\">http://build.fhir.org/references.html#logical</a></p>",
        "id": 153856016,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478629119
    },
    {
        "content": "<p>Reference.reference may point at non-FHIR stuff: <a href=\"http://build.fhir.org/references.html#literal\" target=\"_blank\" title=\"http://build.fhir.org/references.html#literal\">http://build.fhir.org/references.html#literal</a></p>",
        "id": 153856017,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478629180
    },
    {
        "content": "<p>seems we have a new discussion... do we do as you recommend, and thus can't point at source that are not FHIR objects.... or we add an identifier.</p>",
        "id": 153856018,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478629191
    },
    {
        "content": "<p>hmmm,that must have happened after this was modeled in Provenance this way.</p>",
        "id": 153856019,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478629225
    },
    {
        "content": "<p>so, we can change agent.reference to a Reference, and remove agent.type as it is unnecessary?</p>",
        "id": 153856020,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478629245
    },
    {
        "content": "<p>Logical References were introduced during Baltimore WGM</p>",
        "id": 153856021,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478629259
    },
    {
        "content": "<p>guess I can get rid of entity.display too.</p>",
        "id": 153856022,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478629357
    },
    {
        "content": "<p>you mean \"entity.type\"? I guess so. I have never seen any other Resource that has a reference to a choice of targets and adds a \"type\" attribute to specify which it is. I guess FHIR implementers are used to deal with this kind of ambiguity</p>",
        "id": 153856023,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478629452
    },
    {
        "content": "<p>type was there to support uri that was not a FHIR object. So, now that these are in the definition of the Reference datatype they are unnecessary </p>",
        "id": 153856024,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478629517
    },
    {
        "content": "<p>I updated <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\">GF#9996</a> with this new information as part of the proposed resolution.</p>",
        "id": 153856025,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478629664
    },
    {
        "content": "<p>Actually, I'm not really sure how searching for a logical reference works.<br>\n...wait. I'll ask that in another thread...</p>",
        "id": 153856027,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478630284
    },
    {
        "content": "<p><img alt=\":thumbs_up:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/thumbs_up.png\" title=\":thumbs_up:\"> for the resolution of <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9996\">GF#9996</a></p>",
        "id": 153858021,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1479759462
    }
]