[
    {
        "content": "<p>hello all, can any one explain the purpose of provenance resource? </p>",
        "id": 153885450,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492762327
    },
    {
        "content": "<p>Provenance captures details about where data came from - specifically what were the actions and/or data sources that led to the creation of one or more resource version instances.  It lets you capture things like author, data enterer, data entry system, informant, witness, supervisor, entry location, attestation time, source record id, etc.  In theory, there'll be a Provenance instance associated with every single resource version on a server, though in practice not all servers will support it and of those that do, not all will necessarily capture Provenance for every single resource</p>",
        "id": 153885452,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492762809
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ,sorry for not asking exact doubt, actually i have not understand this, in concent resource.and  how to implement that ? </p>\n<p>in consent resource given.</p>\n<p>Consent Directives are executed by verbal acknowledge or by being signed - either on paper, or digitally. Consent Signatures will be found in the Provenance resource (example consent and signature). Implementation Guides will generally make rules about what signatures are required, and how they are to be shared and used.</p>\n<p>so please help.</p>",
        "id": 153885455,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492764182
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span> can you explain what kind of a signature you need? Most of the time today (FHIR 80% rule) there are no digital signatures, only a scanned into PDF of a persons ink signature on their paper consent. If you could explain your current system, I can help you understand how to represent it. I also am very interested in your current system as I lead the Privacy/Security efforts in FHIR and we are open to engagement.</p>",
        "id": 153885467,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492779197
    },
    {
        "content": "<p>hello <span class=\"user-mention\" data-user-email=\"johnmoehrke@gmail.com\" data-user-id=\"98\">@John Moehrke</span>,we are building an ipad app, for one of the screen we are creating the Patient consent form. in that form we are creating the questions like <br>\n1.CARDIOPULMONARY RESUSCITATION: for a patient in cardiac or respiratory arrest<br>\n A) Do Not Resuscitate B) Attempt Resuscitation <br>\n2.VENTILATION: for a patient in respiratory distress<br>\n A) Do Not Intubate and Ventilate B) Intubate and Ventilate <br>\netc.<br>\nuser is going to sign on concent form and we are going to create a leagal doc.<br>\nfor example patient has HIV and he doesn't want to tell that info to a doctor etc.<br>\nso how to manage the user access like<br>\n1.not showing atall<br>\n<a href=\"http://2.no\" target=\"_blank\" title=\"http://2.no\">2.no</a> access<br>\n3. access &amp; edit.</p>",
        "id": 153885681,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493007212
    },
    {
        "content": "<p>actually we want to create these questions as part of concent and capture the signiture. while doing the R&amp;D i gone through the provenance resource. there i found the signiture and what our doubt is can we use rovenance resource to capture that? or any otherway? and how to manage the user access?</p>",
        "id": 153885684,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493015458
    },
    {
        "content": "<p>I know that the committee working on the Consent resource would be interested in your usecase. It seems you have two things you are controlling with that consent. The first part seems to be what is called an 'Advanced Directive', the second part would be a Privacy Directive. The Consent model would have you create two Consent resources to represent these things, and link them together.  You should create a stream topic specific to that so that you get good input.</p>",
        "id": 153885723,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493040903
    },
    {
        "content": "<p>On the Signature... what kind of a signature do you get from the patient? Do the patients have digital identities with which the make digital signatures? There are few regions I am aware of that have this, and even where it exists it is not used much. Thus most patient signatures are the old style ink-on-paper. These could be represented in the Provenance.signature.blob as a scanned image of that ink-on-paper. This however doesn't really require Provenance, as Consent.source[x] would work just as well.</p>",
        "id": 153885726,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493041123
    },
    {
        "content": "<p>And I'd also question is the login context also relevant here, was it a patient portal that they do self service via, or is it a provider app that they hand over to the client for \"signing\". As the identify of the user may also be just as important.</p>",
        "id": 153886079,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1493185465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> . it's a provider app.</p>",
        "id": 153886080,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493185896
    },
    {
        "content": "<p>We have a similar mobile app (not currently in fhir) that we grab the image of the signature, along with the geo-code co-ords of the location of the device to provide assurance that the patient was there. Wasn't considering that we'd be using Provenance when we port it to FHIR, as its just data on the consent (in our case its a confirmation that the service was delivered - and hence we can pay the provider).</p>",
        "id": 153886082,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1493186148
    },
    {
        "content": "<p>okay. thank you. <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> .</p>",
        "id": 153886083,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493186297
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  I am using ClinFHIR in that scenarioBuilder,we are creating questions,but confusing little bit to create questions of type group.</p>",
        "id": 153886086,
        "sender_full_name": "Mounika",
        "timestamp": 1493186911
    },
    {
        "content": "<p>Consent has the Consent.source[x] to put your scanned image of the patient ink signature on the paperwork that is exactly what they signed. No need to go to provenenace.signatue for this.  HOwever, it could also be recorded in a Provenance.signature as simply a scanned image of an ink on paper signature. It is possible, but for Consent there is already a more upfront solution.</p>",
        "id": 153886134,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493209193
    },
    {
        "content": "<p>thank you  <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> .</p>",
        "id": 153886643,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493699640
    },
    {
        "content": "<p>Hi All,<br>\n While creating Patient resource ,Provenance will get created.In the same manner while updating the Patient,How can we retrieve the Provenance resource? Can anyone suggest me??<br>\nThanks in advance.</p>",
        "id": 184647931,
        "sender_full_name": "rekha",
        "timestamp": 1577968626
    },
    {
        "content": "<p>use _revinclude search parameter. The example given for this parameter is the use-case for getting all provenance for search results. <a href=\"http://build.fhir.org/search.html#revinclude\" target=\"_blank\" title=\"http://build.fhir.org/search.html#revinclude\">http://build.fhir.org/search.html#revinclude</a></p>",
        "id": 184650275,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577971297
    },
    {
        "content": "<p>Are we as an EHR vendor, expected to keep a provenance history?  Reading the examples, Hospital A prescribes a med.  Hospital B accepts that med into their chart.   By the documentation, Hospital B now becomes the owner.    When i export that record to hospital C,  i can only send one provenance record.  Its seems logical to send my current provenance (Hospital B)    So question is, should i store previous provenance that i receive from incoming records?  TL:DR, should i keep only the most recent provenance record for each item?</p>",
        "id": 194225880,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1586984011
    },
    {
        "content": "<p>it's not clear what you are asking. As a matter of internal design, the answer is that you will need to keep audit records for everything, and sometimes those will include provenance infomration. Typically when you need to store the provenance, you need to keep it. </p>\n<p>If you're asking about what to expose on a FHIR interface... then the requirements are less all-encompassing, though they trend in the same direction</p>",
        "id": 194226833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586984421
    },
    {
        "content": "<p>Let me try to clarify and do this in small chunks.   First, an ER doctor prescribes a new medication for a patient.  He sends that medication w/ its provenance to me in my EHR via FHIR or C-CDA.  I reconcile and save this new med in my EHR.   What do i store as provenance, the original ER doctors information, or my own info because i accepted it into my system?</p>",
        "id": 194228202,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1586985126
    },
    {
        "content": "<p>who's you? the doctor?</p>",
        "id": 194228288,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586985178
    },
    {
        "content": "<p>Correct, i'm a provider in my EHR reconciling what i received from the ER doc.</p>",
        "id": 194228599,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1586985360
    },
    {
        "content": "<p>IMHO: Two Provenance instances: one for the creator, one for the person that accepted/reconciled.</p>",
        "id": 194261806,
        "sender_full_name": "René Spronk",
        "timestamp": 1587018549
    },
    {
        "content": "<p>Tom, are you asking about the Provenance IG, or about the basics of EHR requirements, or about the capability built into the Provenance resource?</p>",
        "id": 194296255,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587040562
    },
    {
        "content": "<p>I am looking for guidance as an EHR vendor as we are frequently exchanging data (send and receive) with external sources.   My core question is do i  as an EHR vendor need to store ALL the provenance i  have received to share with the next source i share this information with, or to i just store the most recent only because that's all the FHIR resource has is room for one provenance per record?   So if i received a med from an ER with a provenance from Dr. ER that is in the FHIR transaction.    Per the Basic Provenance guide example, if i incorporate that with no changes into my EHR, i am now the author, (Dr. EHR). <br>\nQuestions:  Must i as an EHR vendor store both provenance records for that med?  Dr. ER's creation and Dr EHR's acceptance?<br>\nWhen i export this med and share it down the line with the next provider, do i just send the most recent provenance (Dr. EHR) since i only have room for one in the FHIR message?<br>\nThanks, hoping i'm making more sense now.</p>",
        "id": 194300399,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1587042466
    },
    {
        "content": "<p>Some of your question is about Legal EHR requirements, a topic that is neither FHIR specific nor HL7 specific. There is a HL7 specification on EHR Legal Medical Records requirements that might be informative to you. </p>\n<ul>\n<li><a href=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=86\" title=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=86\">https://www.hl7.org/implement/standards/product_brief.cfm?product_id=86</a></li>\n<li><a href=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=18\" title=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=18\">https://www.hl7.org/implement/standards/product_brief.cfm?product_id=18</a></li>\n</ul>",
        "id": 194302680,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587043362
    },
    {
        "content": "<p>Some of your question is about the FHIR IG on \"Basic Provenance\"</p>\n<ul>\n<li><a href=\"http://hl7.org/fhir/us/core/basic-provenance.html\" title=\"http://hl7.org/fhir/us/core/basic-provenance.html\">http://hl7.org/fhir/us/core/basic-provenance.html</a><br>\n<span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  will likely have some clarifications too</li>\n</ul>",
        "id": 194302827,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587043424
    },
    {
        "content": "<p>You are not required to take on the Author role when you have received the data from outside. The expectation here is that the one that sent you the data would send you the author Provenance, and you would store this author Provenance; so that if you send the data somewhere else then you would have the author Provenance to forward along.</p>",
        "id": 194303052,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587043499
    },
    {
        "content": "<p>You would also be expected to store who sent you the data, so that you could inform someone downstream from you, the provenance of the data.</p>",
        "id": 194303333,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587043603
    },
    {
        "content": "<p>There is no limit to the number of Provenance you can have on any data object. I am wondering where you got that impression.</p>",
        "id": 194303432,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587043644
    },
    {
        "content": "<p>I think your last question is around a data object that was created in the ER, forwarded to EHR1, forwarded to your system EHR2. I think you would be expected to save the author Provenance from ER, and the transmitter Provenance from EHR1, and you would create a transmitter Provenance if you send the data to someone else.</p>",
        "id": 194303949,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587043820
    },
    {
        "content": "<p>in this way there is a provenance chain that can be followed. If the EHR1 transmitter Provenance was not saved, then there would be a break in this provenance chain, thus there would be broken provenance.</p>",
        "id": 194304079,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587043879
    },
    {
        "content": "<p>At this link, Figure 2 suggests that Dr. Accepted is the new author, i think this is where our confusion is coming from.  <br>\n<a href=\"http://hl7.org/fhir/us/core/basic-provenance.html\" title=\"http://hl7.org/fhir/us/core/basic-provenance.html\">http://hl7.org/fhir/us/core/basic-provenance.html</a></p>\n<p>From Figure 2:<br>\nDr. Accepted is the latest author after verifying the problem on 5/2018 and accepting the problem data into their local data store, since it went through an interactive reconciliation process. This type of authorship change is only relevant for data fit for reconciliation, such as medications, allergies, problems. If Dr. Accepted had saved other clinical content into his EHR that aren’t reconciled but simply stored, such as clinical notes, that content must retain its original author.</p>",
        "id": 194309397,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1587046104
    },
    {
        "content": "<p>Your point:<br>\nThere is no limit to the number of Provenance you can have on any data object. I am wondering where you got that impression.</p>\n<p>However, isn't there a limit to what you can send in the FHIR message?</p>",
        "id": 194310096,
        "sender_full_name": "Tom Lipcsey",
        "timestamp": 1587046376
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"279788\">Tom Lipcsey</span> <a href=\"#narrow/stream/179166-implementers/topic/Provenance/near/194309397\" title=\"#narrow/stream/179166-implementers/topic/Provenance/near/194309397\">said</a>:</p>\n<blockquote>\n<p>At this link, Figure 2 suggests that Dr. Accepted is the new author, i think this is where our confusion is coming from.  <br>\n<a href=\"http://hl7.org/fhir/us/core/basic-provenance.html\" title=\"http://hl7.org/fhir/us/core/basic-provenance.html\">http://hl7.org/fhir/us/core/basic-provenance.html</a></p>\n<p>From Figure 2:<br>\nDr. Accepted is the latest author after verifying the problem on 5/2018 and accepting the problem data into their local data store, since it went through an interactive reconciliation process. This type of authorship change is only relevant for data fit for reconciliation, such as medications, allergies, problems. If Dr. Accepted had saved other clinical content into his EHR that aren’t reconciled but simply stored, such as clinical notes, that content must retain its original author.</p>\n</blockquote>\n<p>The  \"since it went...\" clause in this paragraph is recognizing that Dr Accepted has added value to the data by reviewing it in the context of reconciliation. If it is just imported , this would not be the case, it would be more like I described above.<br>\nI would agree that the title of this section seems to use a generic term \"Accepting...\" which might be read the way you read it. <br>\nYou could enter a CR that would be handled in the next revision.</p>",
        "id": 194311680,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587047062
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"279788\">Tom Lipcsey</span> <a href=\"#narrow/stream/179166-implementers/topic/Provenance/near/194310096\" title=\"#narrow/stream/179166-implementers/topic/Provenance/near/194310096\">said</a>:</p>\n<blockquote>\n<p>Your point:<br>\nThere is no limit to the number of Provenance you can have on any data object. I am wondering where you got that impression.</p>\n<p>However, isn't there a limit to what you can send in the FHIR message?</p>\n</blockquote>\n<p>Not practically. yes there are often technical constraints, but those constraints are not likely to be met by a few Provenance instances.</p>",
        "id": 194311873,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587047143
    },
    {
        "content": "<p>For the R4 US Core Provenance profile are we required to support versioning?  Are we required to support versioning for any of the R4 US Core profiles?</p>",
        "id": 203735667,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1594656968
    },
    {
        "content": "<p>I don't think so. It is clearly easier to track changes with versioning support. But my understanding of Basic Provenance is that it is just looking for recording Provenance of the import activitity, not that it is recording all the specific changes made during that import.</p>",
        "id": 203749434,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594663798
    },
    {
        "content": "<p>Hi all. Need a help understand  on understanding Provenance profile and how it should be used : <a href=\"https://www.hl7.org/fhir/provenance.html\">https://www.hl7.org/fhir/provenance.html</a> . <br>\nAre we suppose to provide audit trail for every other single resource ( CarePlan, Goal etc..) via Provenance or it should be used as a audit trail for all the resources combined ?<br>\nPlease let me know if my question makes sense. Thanks in advance!</p>",
        "id": 219116958,
        "sender_full_name": "Seikh Bahar",
        "timestamp": 1607365127
    },
    {
        "content": "<p>The guide does say that 1 provenance resource can be a provenance for a set of records. I, personally, think of provenance resource as applying to a single other resource. But I can see the use case of 1 provenance to represent a panel + the observations. Or perhaps there is a set of procedures that typically occur in lock step but are recorded individually for whatever reason. Perhaps there would be 1 provenance for all items modified during an encounter. (one person modifies multiple items simultaneously (bound by event)). </p>\n<p>To me it would be reasonable that you'd have a set of provenance for a single resource or a set of provenance for a set of tightly bound other resources, but to have 1 set of provenance for the 1 set of all other resources, seems like a stretch. </p>\n<p>If you do, you'll have to make sure the agent is clear. Dr. Bob and Dr. Bill and Dr. Dan were the agents of change of all resources. Really, all 3 of them changed all the resources at the same time?</p>",
        "id": 219125199,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1607368723
    },
    {
        "content": "<p>We use a single provenance to describe all the resources created in a transaction bundle that was created by data exchange tooling. It also points to a device resource (<code>agent.whoReference</code>) representing the software and version of the tool used to create the bundle.</p>",
        "id": 219129993,
        "sender_full_name": " Bob Milius",
        "timestamp": 1607370961
    },
    {
        "content": "<p>Generally, there's one Provenance per 'action'.  Some actions manipulate a bunch of resources at once.</p>",
        "id": 219151859,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607382808
    },
    {
        "content": "<p>Thank you everyone for your thoughtful response. In simpler words, we are trying to communicate metadata of an event to a patients health not the metadata of the table record itself. Did I get it right?</p>",
        "id": 219407138,
        "sender_full_name": "Seikh Bahar",
        "timestamp": 1607552201
    },
    {
        "content": "<p>Provenance is typically more about the 'record' side of things than the 'health' side of things.  If you take a CDA document and run an extraction routine to produce a bunch of resources, that's not a \"health\" action at all.  It is, however, a 'system' action, and as a single action, it would typically produce a single Provenance instance.</p>",
        "id": 219427761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607570131
    },
    {
        "content": "<p>Hi everyone. I'm trying to parse the PDEX SHALL requirements related to Provenance (as a payer implementing the IG).</p>\n<ul>\n<li>In addition to the <code>searchRevInclude</code> interaction, is the expectation that a client application should be able to query a bundle/resource and then return to the FHIR server _n_ days later and get the provenance for that bundle/resource using the bundle/resource reference?</li>\n<li>The timestamp that's captured in the <code>recorded</code> field  should always be the Date/Time that the payer received the information or created the bundle -- is that correct?</li>\n</ul>",
        "id": 227488886,
        "sender_full_name": "Anusha",
        "timestamp": 1614108403
    },
    {
        "content": "<p>You might want to ask on <a class=\"stream\" data-stream-id=\"235286\" href=\"/#narrow/stream/235286-Da-Vinci-PDex\">#Da Vinci PDex</a></p>",
        "id": 227496746,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614111534
    },
    {
        "content": "<p>hi<br>\nI wonder about the difference between Provenance author and the recorder of a clinical act (such as procedure). what is the difference?<br>\nthanks!</p>",
        "id": 254386523,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1632324550
    },
    {
        "content": "<p>For a lab result the author could be the lab itself and the recorder the EHR system (and/or person) that received that lab report</p>",
        "id": 254387536,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632324928
    },
    {
        "content": "<p>(as an example)</p>",
        "id": 254387721,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632324984
    },
    {
        "content": "<p>that would be a good one to make into an example of Provenance in the core spec. Can you write that up with example as a CR?</p>",
        "id": 254388253,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632325184
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>{\n        &quot;resourceType&quot;: &quot;Provenance&quot;,\n        &quot;id&quot;: &quot;8-bfe992b8d8644f48b459fffebd2df7d6&quot;,\n        &quot;meta&quot;: {\n            &quot;profile&quot;: [\n                &quot;http://hl7.org/fhir/us/core/StructureDefinition/us-core-provenance&quot;\n            ]\n        },\n        &quot;target&quot;: [\n            {\n                &quot;reference&quot;: &quot;DiagnosticReport/4.bfe992b8d8644f48b459fffebd2df7d6&quot;\n            }\n        ],\n        &quot;occurredDateTime&quot;: &quot;2015-08-11T07:13:28.14+00:00&quot;,\n        &quot;recorded&quot;: &quot;2015-08-11T07:13:28.14+00:00&quot;,\n        &quot;activity&quot;: {\n            &quot;coding&quot;: [\n                {\n                    &quot;system&quot;: &quot;http://terminology.hl7.org/CodeSystem/v3-DataOperation&quot;,\n                    &quot;code&quot;: &quot;CREATE&quot;\n                }\n            ]\n        },\n        &quot;agent&quot;: [\n            {\n                &quot;type&quot;: {\n                    &quot;coding&quot;: [\n                        {\n                            &quot;system&quot;: &quot;http://terminology.hl7.org/CodeSystem/v3-ParticipationType&quot;,\n                            &quot;code&quot;: &quot;AUT&quot;,\n                            &quot;display&quot;: &quot;Author (originator)&quot;\n                        },\n                        {\n                            &quot;system&quot;: &quot;http://terminology.hl7.org/CodeSystem/provenance-participant-type&quot;,\n                            &quot;code&quot;: &quot;author&quot;\n                        }\n                    ],\n                    &quot;text&quot;: &quot;Originating organization&quot;\n                },\n                &quot;who&quot;: {\n                    &quot;reference&quot;: &quot;Organization/86ebdb60-e00a-e511-943a-8cdcd4a8b5cd&quot;,\n                    &quot;display&quot;: &quot;EDW Patient Record Authority&quot;\n                }\n            },\n            {\n                &quot;type&quot;: {\n                    &quot;coding&quot;: [\n                        {\n                            &quot;system&quot;: &quot;http://hl7.org/fhir/us/core/CodeSystem/us-core-provenance-participant-type&quot;,\n                            &quot;code&quot;: &quot;transmitter&quot;\n                        }\n                    ],\n                    &quot;text&quot;: &quot;Transmitter&quot;\n                },\n                &quot;who&quot;: {\n                    &quot;display&quot;: &quot;EdwLabsLoad&quot;,\n                    &quot;identifier&quot;: {\n                        &quot;use&quot;: &quot;official&quot;,\n                        &quot;system&quot;: &quot;http://anthem.com/typeid/Application&quot;,\n                        &quot;value&quot;: &quot;292&quot;\n                    }\n                },\n                &quot;onBehalfOf&quot;: {\n                    &quot;display&quot;: &quot;SystemUser&quot;,\n                    &quot;identifier&quot;: {\n                        &quot;system&quot;: &quot;urn:ietf:rfc:3986&quot;,\n                        &quot;value&quot;: &quot;urn:uuid:3539c314-6e5b-4864-87c1-1195e7e2adcd&quot;\n                    }\n                }\n            }\n        ]\n    }\n</code></pre></div>",
        "id": 254390493,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632326088
    },
    {
        "content": "<p>^ example from our system - author is EDW (an external system we get data from), transmitter is EdwLabsLoad - the sub-system we use to import that data</p>",
        "id": 254390626,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632326152
    }
]