[
    {
        "content": "<p>We are looking to Provenance vs an extension to indicate whether the UDICarrrier string was hand entered or by a barc code scanner for the Device resource, but the question of scope arose since not all the information in the Device resource is entered by bacrode scanner.   How is Provenance when only a portion of the data in the  target resource applies to agents involved?    </p>",
        "id": 153856389,
        "sender_full_name": "Eric Haas",
        "timestamp": 1478809341
    },
    {
        "content": "<p>Provenance resource is an identification of the provenance of that version... someone could use multiple versions of your Device resource with diffeent provenance... but that would be very awkward. Why is it important to record that different parts come by different pathways? I might suggest that this might be good evidence that we Device is too-big... meaning it should be smaller resources that can better be represented, tracked, and protected.</p>",
        "id": 153856396,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478810457
    },
    {
        "content": "<p>I think that would be a path to insanity - that the scope should be picked by minimal provenacne tracking requirements. </p>",
        "id": 153856433,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478815419
    },
    {
        "content": "<p>you can use target with a # on it, where what follows # is the id of the element in the resource that the provenance refers to. This is problematic, but any solution to what you propose will be less than ideal, I think. </p>",
        "id": 153856434,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478815478
    },
    {
        "content": "<p>is hand entering a UDI without validation anything but a weird edge case?</p>",
        "id": 153856435,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478815505
    },
    {
        "content": "<p>based on  a comment from VA and <span class=\"user-mention\" data-user-id=\"191968\">@Ioana Singureanu</span>  maybe she can provide a little more context.</p>",
        "id": 153856437,
        "sender_full_name": "Eric Haas",
        "timestamp": 1478815908
    },
    {
        "content": "<p>I think it has to due with data reliability</p>",
        "id": 153856439,
        "sender_full_name": "Eric Haas",
        "timestamp": 1478815946
    },
    {
        "content": "<p>There is a fundamental of REST, and thus FHIR Resources... When you say to Create or Update, you are attesting to EVERYTHING in that Resource. You don't get to claim just parts of it. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> made this clear in a thread this week.</p>",
        "id": 153856536,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478876368
    },
    {
        "content": "<p>yes, if you create/update, you are responsible for the entirety. But that doesn't mean that you can report that the provenance of some of the information to you was at a finer granularity. </p>",
        "id": 153856603,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478896482
    }
]