[
    {
        "content": "<p>We are looking at creating Provenance instances for DocumentReference resources.  Suppose I have a PDF of a doctor's letter written by Dr. Doe in 2019. In 2021, the user Alex Doenot now uploads this PDF to a FHIR system, wrapped in a DocumentReference. We now have two levels of provenance information: (1) that for the PDF i.e. the actual  core data (\"authored by Dr. Doe in 2019\"), and (2) that for the FHIR resource (\"created by Alex Doenot in 2021\"). </p>\n<p>My question is: Given that one can only point to the DocumentReference resource, how can one use Provenance to transmit provenance information about the contained PDF (\"provenance (1)\")? I suppose one could split the contained PDF off into a Binary resource, provide that with a separate Provenance, and then point to it from a DocumentReference (if one can actually get the PDF, that is).  But I am wondering if there is a solution that avoids this overhead and allows associating provenance of both type (1) &amp; (2) directly with the DocRef resource.</p>",
        "id": 248943918,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628575944
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 248976561,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628601121
    },
    {
        "content": "<p>As you indicate, the easiest and most straight forward is to have to document in a Binary. In this way the DocumentReference can point at the Binary as can your Provenance.</p>",
        "id": 248977573,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628601625
    },
    {
        "content": "<p>The other configuration, where document is encoded into the <a href=\"http://DocumentReference.content.attachment.data\">DocumentReference.content.attachment.data</a>, is not yet supported in FHIR. There is an approved CR by FHIR-I that promises to give us a way to point at an element within a target resource. There is not enough details in the approved CR for me to predict how this will work. Provided this happens sometime in R5, you would be able to have a Provenance that points specifically at the .data element.</p>",
        "id": 248977945,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628601819
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>! - being able to point to an element seems like a useful development.</p>",
        "id": 248989561,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628607036
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> I believe it is this <a href=\"https://jira.hl7.org/browse/FHIR-23076\">https://jira.hl7.org/browse/FHIR-23076</a> and this <a href=\"https://jira.hl7.org/browse/FHIR-21284\">https://jira.hl7.org/browse/FHIR-21284</a>. I am also waiting on these for a project</p>",
        "id": 249012176,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1628617685
    },
    {
        "content": "<p>A follow-up on this: Parallel to the question of resource vs. content, there is also the question of what it means to be the author or such a resource. Specifically, in the scenario above Alex Doenot creates a resource. What, in that case, is then the appropriate <code>agent.type</code>? It looks like it could be \"author\" from <a href=\"http://terminology.hl7.org/CodeSystem/provenance-participant-type\">http://terminology.hl7.org/CodeSystem/provenance-participant-type</a> . The definition is: </p>\n<blockquote>\n<p>A party that originates the resource and therefore has responsibility for the information given in the resource and ownership of this resource</p>\n</blockquote>\n<p>That sort of half-way matches: Alex originated the resource and has the ownership (e.g. can completely delete it from our system). But can Alex be said to be \"responsible for the information given in the resource\"? That, again, seems to sound like it's about the <em>content</em>, i.e. the doctor's letter. In other word, using this code might cause people to think Alex wrote the doctor's letter.</p>\n<p>What do you think? Are there any alternatives? (I didn't see anything obvious in the value set).</p>",
        "id": 249218862,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628764817
    },
    {
        "content": "<p>How to send request questionnaire response json with retrofit<br>\n<a href=\"/user_uploads/10155/3CHlIcvVfPSau7hvJrkxj00-/image.png\">image.png</a> <a href=\"/user_uploads/10155/VJoTi3NtVwhumt06VxcVq5WL/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/3CHlIcvVfPSau7hvJrkxj00-/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/3CHlIcvVfPSau7hvJrkxj00-/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/VJoTi3NtVwhumt06VxcVq5WL/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/VJoTi3NtVwhumt06VxcVq5WL/image.png\"></a></div>",
        "id": 249223992,
        "sender_full_name": "Tú Nguyễn M.",
        "timestamp": 1628768854
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"431749\">@Tú Nguyễn M.</span>, to post a new unrelated question, please open a separate discussion thread (use the button \"New topic\" at the bottom of the screen. This discussion thread is about topic in the headline (\"Provenance for resource vs. content of resource\").</p>",
        "id": 249225414,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628769731
    },
    {
        "content": "<p>I think that the DocumentReference resource is metadata about the document. Thus applying the author agent of the document to the DocumentReference does not seem wrong to me. Especially since most of the elements in the DocumentReference are direct copies of elements from the document content, especially if the document content is a FHIR-Document or a CDA document.</p>",
        "id": 249226006,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628770131
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"194703\">Morten Ernebjerg</span> <a href=\"#narrow/stream/179166-implementers/topic/Provenance.20for.20resource.20vs.2E.20content.20of.20resource/near/249225414\">said</a>:</p>\n<blockquote>\n<p>Hi <span class=\"user-mention silent\" data-user-id=\"431749\">Tú Nguyễn M.</span>, to post a new unrelated question, please open a separate discussion thread (use the button \"New topic\" at the bottom of the screen. This discussion thread is about topic in the headline (\"Provenance for resource vs. content of resource\").</p>\n</blockquote>\n<p>sr. I will fix the topic</p>",
        "id": 249226111,
        "sender_full_name": "Tú Nguyễn M.",
        "timestamp": 1628770197
    },
    {
        "content": "<p>I would NOT expect a Provenance on a DocumentReference to be about the author of the content. I would expect it to be about the event and agents that caused the DocumentReference to exist. The most interesting part might be WHO pushed the button to create the DocumentReferenence. It is not uncommon for a document to be authored for some purpose, and later a DocumentReference is created to publish that content for external partners to see.</p>",
        "id": 249226429,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628770429
    },
    {
        "content": "<p>When the author is both causing the document to exist, and publishing it using a DocumentReference, then it would be true that there would be a Provenance on the DocumentReference that indicated authorship of the DocumentReference.</p>",
        "id": 249226546,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628770495
    },
    {
        "content": "<p>In IHE terms, this is likely more closely what the SubmissionSet, which is a manifest of Document Entries, documents, and folders; in the activity of publishing them to the Registry. Sometimes one-for-one, but possibly one SubmissionSet holds many documents by many authors.</p>",
        "id": 249226719,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628770603
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179166-implementers/topic/Provenance.20for.20resource.20vs.2E.20content.20of.20resource/near/249226006\">said</a>:</p>\n<blockquote>\n<p>I think that the DocumentReference resource is metadata about the document. Thus applying the author agent of the document to the DocumentReference does not seem wrong to me. </p>\n</blockquote>\n<p>Just to make sure I'm understanding you right: When you say \"the author of the document\" in the above, who do you mean? Is it Dr. Doe who originally created the PDF file (and wrote the letter in it), or is it Alex Doenot who wrapped this PDF in a DocumentResource and stored it? I am contemplating capturing Alex as as an agent of type \"author\" for the DocRef, not Dr. Doe. (If I understand you last comment right, Alex is indeed the appropriate agent, just wanted to make sure)</p>",
        "id": 249227734,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628771294
    },
    {
        "content": "<p>right. sorry that I lost track of the details of your scenario.</p>",
        "id": 249228455,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628771714
    },
    {
        "content": "<p>So do I sometimes <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>. So it is indeed appropriate to mark Alex as an author in <code>Provenance.agent.type</code>?</p>",
        "id": 249229227,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628772162
    },
    {
        "content": "<p>yes, alex would seem to me to clearly be the author of the DocumentReference.</p>",
        "id": 249230836,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628773141
    },
    {
        "content": "<p>Great, thanks again <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> !</p>",
        "id": 249231164,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628773305
    }
]