[
    {
        "content": "<p>How do we handle Auth in FHIR server while implementing Provider Directory API as per CMS mandate? Has anybody implemented it before? Should it be an anonymous call or bypass Auth or add credentials/token beforehand for provider directory API call?</p>",
        "id": 245163862,
        "sender_full_name": "Vidhi Shah",
        "timestamp": 1625656747
    },
    {
        "content": "<p>As per <a href=\"https://fhirblog.com/2019/01/15/provider-directories-part-2/\">https://fhirblog.com/2019/01/15/provider-directories-part-2/</a>, we should include the access token for the provider directory api call, are there any other options out there or any other system has implemented it?</p>",
        "id": 245164011,
        "sender_full_name": "Vidhi Shah",
        "timestamp": 1625656846
    },
    {
        "content": "<p>This is a question of policy. HL7 is not a body that is responsible for policy. <br>\nGenerally a provider directory tends to need to be public readable,  but the content it returns must be highly trustworthy. This usually is sufficiently covered with classic https which will authenticate the server to the client so that the client knows it is properly connected to the server it intended to connect to. <br>\nThere might be reason to have user/client tokens (aka OAuth) for read/search operations simply for record keeping, meaning that the access control rule allows everyone that provides a legitimate user token (aka OpenID-Connect) - where legitimate is a policy.<br>\nbut very constrained on who can create/update/delete.  Often each entry will be associated with an organization, and thus only a select few (role) at that organization are allowed to create or change.<br>\nALL, Guesses at a realistic Policy. <br>\nI cover this use-case in my HL7 FHIR Privacy &amp; Security tutorial that is scheduled for next week. <a href=\"https://healthcaresecprivacy.blogspot.com/2021/06/fhir-security-privacy-tutorial.html\">https://healthcaresecprivacy.blogspot.com/2021/06/fhir-security-privacy-tutorial.html</a></p>",
        "id": 245170173,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625660330
    },
    {
        "content": "<p>We implemented them to be Open (unsecured) APIs with rate limiting in place.</p>",
        "id": 245174733,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1625662685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , thanks for sharing the information. CMS Mandate does not state clearly about its Authorization status, it only defines that the information should be available publicly. Also, if you have any upcoming session on this, would love to join</p>",
        "id": 245178574,
        "sender_full_name": "Vidhi Shah",
        "timestamp": 1625664324
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"421559\">@Nirmal Fernando</span> , thanks for sharing. Do you have any public documentation for your FHIR Implementation/ APIs?</p>",
        "id": 245178758,
        "sender_full_name": "Vidhi Shah",
        "timestamp": 1625664389
    },
    {
        "content": "<p>The CMS requirements are for public, open access -- there should not be an authentication step for clients to read/search (\"make provider directory information publicly available via a standards-based API\").</p>",
        "id": 245202925,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625673491
    },
    {
        "content": "<p><a href=\"https://www.cms.gov/about-cms/obrhi/faqs/faqs\">https://www.cms.gov/about-cms/obrhi/faqs/faqs</a> provides background:</p>\n<ul>\n<li><em>The Provider Directory API must be publicly available and exclude the security protocols related to user authentication and authorization and any other protocols that restrict the availability of this information to particular persons or organizations (see 85 FR 25543).</em></li>\n</ul>",
        "id": 245203092,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625673585
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"368655\">@Vidhi Shah</span>, Re: your comment that \"CMS Mandate does not state clearly about its Authorization status\", see my excerpt from the CMS FAQ above. It's refreshingly clear, I'd say! (Note that David's blog post from 2019, which you link to, is not about how to meet the CMS mandate; it's just a blog post that happens to be about the topic of provider directories. It's important for you not to equate these.)</p>",
        "id": 245203274,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625673644
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Thanks much</p>",
        "id": 245273528,
        "sender_full_name": "Vidhi Shah",
        "timestamp": 1625721950
    }
]