[
    {
        "content": "<p>So suppose I import a file and from that file, I generate many patients and stemming from them, many FHIR resources. </p>\n<p>Given the Provenance elements are all the same except target (which is an array), is it appropriate to create one mega-Provenance with a ton of targets? Or one per Patient resource and associated clinical resources? Or one per resource?</p>",
        "id": 262123455,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637352781
    },
    {
        "content": "<p>I'd vote for one mega, for every record that was touched during the transaction.<br>\nA logical grouping by patient makes sense, but you are duplicating data.<br>\nYou might have to have 1 per resource depending on how you data store works and your indexes.</p>",
        "id": 262127584,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1637354890
    },
    {
        "content": "<p>Yeah, good points.</p>\n<p>It might need to be 2 mega Provenances, though, if there are some Creates and some Updates (as the Provenance action would differ)</p>",
        "id": 262140326,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637361333
    },
    {
        "content": "<p>FWIW - I would probably do one per patient - as eventually that provenance resource could connect back to consent at the patient level.</p>",
        "id": 262189643,
        "sender_full_name": "Vivian Neilley",
        "timestamp": 1637422961
    },
    {
        "content": "<p>Oh great call</p>",
        "id": 262208041,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637446966
    },
    {
        "content": "<p>One Provenance per Patient.   Also, there is movement to add a .subject to Provenance in R5.</p>",
        "id": 262320204,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637588898
    },
    {
        "content": "<p>It might be good to add this kind of guidance to Provenance. Can you create a CR asking for Provenance notes to speak to your use-case and the best-practice to create one Provenance per Patient? There has not been much discussion of an import of multiple-patients anywhere. Is this a bulk-data use-case or something else?</p>",
        "id": 262320437,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637589019
    },
    {
        "content": "<p>I'm not sure I know how to create a CR. Any guidance where I might learn?</p>",
        "id": 262362974,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637607624
    },
    {
        "content": "<p>Use case is a historic load of a CSV of patients/claims</p>",
        "id": 262363095,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637607649
    },
    {
        "content": "<p>You go to <a href=\"http://jira.hl7.org\">jira.hl7.org</a> and follow the magic footprints selecting FHIR Core as the specification and Provenance as the resource.  PM me if you need further guidance.</p>",
        "id": 262363903,
        "sender_full_name": "David Pyke",
        "timestamp": 1637607979
    },
    {
        "content": "<p>at the bottom of every page of the FHIR specification is a \"Propose a change\" link.</p>",
        "id": 262370309,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637611312
    },
    {
        "content": "<p>Sure, done<br>\n<a href=\"https://jira.hl7.org/plugins/servlet/mobile#issue/FHIR-34366\">https://jira.hl7.org/plugins/servlet/mobile#issue/FHIR-34366</a></p>",
        "id": 262378116,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637615488
    }
]