[
    {
        "content": "<p>I see that publicKey was removed from endpoint and suggested to use an extension.  Will there be a standard extension defined or should we just set up our own?</p>",
        "id": 153879500,
        "sender_full_name": "Luke Duncan",
        "timestamp": 1490277496
    },
    {
        "content": "<p>Luke, can you explain your use-case? The only use-case we have where it would be helpful to publish the publicKey in the Endpoint is where that endpoint is an asynchronous communication type. So of the types of endpoints, this only applies to Direct. Isn't it more appropriate for Direct to publish those Certificates with the Provider? As the Certificate is not just an endpoint, but an identity, and signing. --- Note it isn't there either... so ultimately it should be somewhere, but where is the most appropriate?</p>",
        "id": 153879504,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490280185
    },
    {
        "content": "<p>I believe it was to allow organizations or practitioners to receive communication by being able to look up the certificate to encrypt the message before sending.</p>",
        "id": 153879555,
        "sender_full_name": "Luke Duncan",
        "timestamp": 1490290908
    },
    {
        "content": "<p>Okay, so your usecase is an asynchronous messaging such as Direct. Understood. I just wanted to make sure there was no misunderstanding, or new use-case that was not understood.</p>",
        "id": 153879558,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490291232
    },
    {
        "content": "<p>Is it then right to create an Endpoint for each Direct address? I am not against this, just wanting to understand the potential ramifications.</p>",
        "id": 153879560,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490291269
    },
    {
        "content": "<p>As an FYI,  I looked back at my the argonauts did with the provider directory work:<br>\n<a href=\"http://argonautwiki.hl7.org/index.php?title=Provider_Registry_Implementation_Guide\" target=\"_blank\" title=\"http://argonautwiki.hl7.org/index.php?title=Provider_Registry_Implementation_Guide\">http://argonautwiki.hl7.org/index.php?title=Provider_Registry_Implementation_Guide</a><br>\nThe don't specify where the PKI certificate should go.  They do put the DIRECT address in an extension.</p>",
        "id": 153879564,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1490292537
    },
    {
        "content": "<p>certainly needed to support Direct usecases. I could see why it might be a US extension. </p>",
        "id": 153879572,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490295896
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> has this been discussed in Argonaut?</p>",
        "id": 153879577,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490297864
    },
    {
        "content": "<p>The Argonauts didn't discuss including a public Key in Endpoint. We did originally use an extension for the Direct address before updating to EndPoint</p>",
        "id": 153879583,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1490298296
    },
    {
        "content": "<p>latest design here: <a href=\"http://build.fhir.org/ig/Healthedata1/Argo-PD/StructureDefinition-argo-endpoint.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/Healthedata1/Argo-PD/StructureDefinition-argo-endpoint.html\">http://build.fhir.org/ig/Healthedata1/Argo-PD/StructureDefinition-argo-endpoint.html</a></p>",
        "id": 153879584,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1490298301
    },
    {
        "content": "<p>we added direct-project to this value set <a href=\"http://build.fhir.org/valueset-endpoint-connection-type.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-endpoint-connection-type.html\">http://build.fhir.org/valueset-endpoint-connection-type.html</a></p>",
        "id": 153879586,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1490298349
    },
    {
        "content": "<p>...will make it more clear that wiki is no longer place to reference for Argo PD</p>",
        "id": 153879588,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1490298379
    },
    {
        "content": "<p>Brett, that connection type is in STU3. But there is no element in Endpoint to hold the Certificate. I though it was being moved into an Extension, but seems not to have shown up there. I also don't see it in your Healthdata1 extension...So for Direct, it is needed somewhere</p>",
        "id": 153879590,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490299630
    },
    {
        "content": "<p>Yes, after discussion we removed the public key to be put into extensions where its purpose will be very explicit as to why it is there.<br>\nExpected uses were for encrypting so only the recevier can get them (as you've noted above), checking the signature to ensure that the content wasn't tampered with, and others.</p>",
        "id": 153879610,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1490310017
    },
    {
        "content": "<p>Brian, is that still in an existing CR that we can track?</p>",
        "id": 153879729,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490364115
    },
    {
        "content": "<p>In looking at Argonaut Directory, it seems they never had in-scope to publish the Certificate in the directory. Presumably the DNS CERT mechanism is sufficient? If so, then this need is indeed not core and might not even have any urgency. I would have expected USA interest.</p>",
        "id": 153879730,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490364185
    },
    {
        "content": "<p>There is no current CR for that. We processed a CR to remove it, in preference to having extensions to determine usage.</p>",
        "id": 153879767,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1490482835
    }
]