[
    {
        "content": "<p>It appears that the fhir-xhtml.xsd schema doesn't allow the following attributes on .text.div, or at least the publisher doesn't accept them and adds an error in the QA.</p>\n<div class=\"codehilite\"><pre><span></span><code>&lt;text&gt;\n&lt;div xmlns=&quot;http://www.w3.org/1999/xhtml&quot;\n          xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;\n          xsi:schemaLocation=&quot;http://www.w3.org/1999/xhtml http://hl7.org/fhir/R4/fhir-xhtml.xsd&quot;&gt;\n...\n</code></pre></div>\n<p>The publisher generates the following error:</p>\n<div class=\"codehilite\"><pre><span></span><code>txt-1: The narrative SHALL contain only the basic html formatting elements and attributes described in chapters 7-11 (except section 4 of chapter 9) and 15 of the HTML 4.0 standard, &lt;a&gt; elements (either name or href), images and internally contained style attributes [htmlChecks()]\n</code></pre></div>\n<p>Removing those attributes fixes the issue but having them is useful since they allow a XML editor perform correct auto-completion and validation. The Eclipse XML editor, for example, recognizes the schema and doesn't have an issue with these attributes but the publisher flags them as invalid.</p>",
        "id": 216758452,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605399250
    },
    {
        "content": "<p>There's an explicit declaration in the spec that schema declarations aren't permitted in exchanged instances - pointing to a schema is a security risk.</p>",
        "id": 216761457,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605403244
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I wasn't aware of that part of the spec. Thanks! At the moment I do have XML schema declarations on all resources (structures and their examples)  in my IG content but the .text.div ones are the only ones being flagged with errors in the QA.</p>\n<p>I might be able to add the schema info to my IDE to avoid having it in the files themselves. Not sure if the IDE will allow me to specify this for the .text.div content if the different namespace is implied in the FHIR tooling and I won't be able to use a different namespace like \"fhirhtml:\". </p>\n<p>Not a real issue. I just thought this is something that can be addressed by the publisher. Maybe add this as a configuration option for the IG to try to keep the QA report cleaner if a user chooses to bypass that check?</p>",
        "id": 216763275,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605405713
    },
    {
        "content": "<p>The publisher strips out schema declarations on the root - because we do use them when authoring instances.  It's not set up to strip declarations inside the instance though.</p>",
        "id": 216763480,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605405988
    },
    {
        "content": "<p>Good to know. So if validation is applied to the built version, it sounds like stripping out this content for .text.div, or any other ones, might be an option?  Also, is it the location that is the problem, or is it that i also can't configure the namespace prefix mappings?</p>",
        "id": 216764066,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605407136
    },
    {
        "content": "<p>There should be no need to declare a schema on anything other than the root.  You need to declare the namespace on the div, but no need for a schema declaration</p>",
        "id": 216766152,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605410100
    }
]