[
    {
        "content": "<p>I have the need to pull patient data from one FHIR server and push that data into another FHIR server. With this task I have some questions:<br>\n- With which pull mechanism do I get the data from the source server ? With a FHIR-REST-search-request I could request the resource of one single patient. Or I could design a search request that pulls all Observations of that patient. But how could I get a deeper nested resource network from the server with all resources somehow belonging to the single patient?<br>\n- How can I push the pulled data into the target server with as few effort as possible ? The data could possibly contain referential dependencies so that I perhaps have to order the resources to be stored, so that the validator does not complain about missing reference targets. But how to cope with cyclic dependencies ? What happens with the metadata of the transfered data ? The import time will surely differ. Can it be ensured that the IDs of all resources stay the same after the transfer?</p>",
        "id": 177511667,
        "sender_full_name": "Georg Fette",
        "timestamp": 1570449074
    },
    {
        "content": "<p>Pull mechanisms - what subset are you choosing? Do you know about the problems with information dripping out of scope? You should start with the _history interaction first</p>",
        "id": 177512578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570449929
    },
    {
        "content": "<p>I’m not sure how import times are important?</p>",
        "id": 177512635,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570449963
    },
    {
        "content": "<p>I am mainly interested in the data itself and not the meta data or history data</p>",
        "id": 177512668,
        "sender_full_name": "Georg Fette",
        "timestamp": 1570450005
    },
    {
        "content": "<p>Ids is hard. Can you be sure you won’t get clashing ids with information sources from elsewhere?</p>",
        "id": 177512675,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570450018
    },
    {
        "content": "<p>hm, I would also be content with new IDs, but they should be consistent within the network of resources belonging to my patient</p>",
        "id": 177512714,
        "sender_full_name": "Georg Fette",
        "timestamp": 1570450076
    },
    {
        "content": "<p>You have to track them all and update the references in subsequent data</p>",
        "id": 177514949,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570452069
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>  Bulk data export/import may fit your need. <a href=\"https://build.fhir.org/ig/HL7/bulk-data/\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/bulk-data/\">https://build.fhir.org/ig/HL7/bulk-data/</a></p>",
        "id": 177520636,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1570456150
    }
]