[
    {
        "content": "<p>I have not found guidance on how to record Pulse Oximetry. In my case it is patient reported.   Again a huge number of LOINC codes, not clear which to chose.</p>",
        "id": 153992855,
        "sender_full_name": "John Moehrke",
        "timestamp": 1535996616
    },
    {
        "content": "<p>Coincidentally, I was working on a measure that needed exactly this today, so I found this in the US Core profiles:</p>",
        "id": 153992874,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1536009275
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/us/core/Observation-oxygen-saturation.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/us/core/Observation-oxygen-saturation.html\">https://www.hl7.org/fhir/us/core/Observation-oxygen-saturation.html</a></p>",
        "id": 153992875,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1536009276
    },
    {
        "content": "<p>I have more information than that profile describes. I have a comment, but also a symptom (shortness of breath, dizziness, etc). I have some details about the assistance device, but not enough for a Device resource. Do I just add these as more .component elements?</p>",
        "id": 153992947,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536064827
    },
    {
        "content": "<p>You can send a comment with the existing profile using event-note extension.  Shortness of breath, etc. would be a distinct Observation as it's interpretable independently from the pulseox reading.</p>",
        "id": 153992981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536070034
    },
    {
        "content": "<p>okay, one Observation would link to the other.. right? which direction?</p>",
        "id": 153992984,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536070558
    },
    {
        "content": "<p>Unless one is derived from the other, there'd be no more an explicit link than there is between a blood pressure and a pulseox that happened to be made at the same time.  You could create a \"panel\" Observation that groups them as members if that's important/relevant.</p>",
        "id": 153992988,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536071002
    },
    {
        "content": "<p>I think there are  better ways to do this like placing the symptoms etc in the procedure and using  Observation to record the actual measurement and linking it to the procedure.</p>",
        "id": 153992995,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536072080
    },
    {
        "content": "<p>you have  extensions for reasonCode for symptoms or Observation.note extension for more notes ( we are discussing with PC Observation.note extension v Observation.comment at the WGM. )</p>",
        "id": 153992998,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536072228
    },
    {
        "content": "<p>additional characteristic in my case is that these are patient reported... so there is no procedure</p>",
        "id": 153992999,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536072249
    },
    {
        "content": "<p>sounds like Condition to me but that is fuzzy area</p>",
        "id": 153993002,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536072414
    },
    {
        "content": "<p>on the UI for submitting Pulse Ox is a dropdown for selecting additional symptioms... so the patient is submitting a measured value, and then being asked to think about if they had one of those symptoms</p>",
        "id": 153993003,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536072419
    },
    {
        "content": "<p>each time they enter...</p>",
        "id": 153993004,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536072451
    },
    {
        "content": "<p>So .. . they may be reasons or just more indepenent ( other than the same encounter ) Observations or Conditions?  W</p>",
        "id": 153993007,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536072516
    },
    {
        "content": "<p>re not using device.  you could hang the text blob Observation device  reference display (although Lloyd might frown on that  :-))</p>",
        "id": 153993008,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536072700
    },
    {
        "content": "<p>that is exactly what I was thinking of doing... including Lloyd frown...   Given that this is patient generated it is hard to justify creating (potentially) a new Device resource each time an Ox observation is made. I don't have an ability to relate each Ox to a specific device.</p>",
        "id": 153993009,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536072833
    },
    {
        "content": "<p>but I mostly just have a 'type of device'... so not clear how that alone is recorded.</p>",
        "id": 153993010,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536072865
    },
    {
        "content": "<p>I am surprised that an implementer has never opened a tracker for a deviceCode.</p>",
        "id": 153993014,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536073279
    },
    {
        "content": "<p>I could do that</p>",
        "id": 153993015,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536073364
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17793\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17793\">GF#17793</a></p>",
        "id": 153993017,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536073812
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Why \"no procedure\"</p>\n<blockquote>\n<p>additional characteristic in my case is that these are patient reported... so there is no procedure</p>\n</blockquote>\n<p>Patients can be the source of a procedure, no?</p>",
        "id": 153993494,
        "sender_full_name": "Robert McClure",
        "timestamp": 1536161235
    },
    {
        "content": "<p>technically, no problem... my point is that this is simply self entered Pulse Ox data. I have no way to relate it to a Procedure. There is no information that I can use to invent a Procedure.  Lastly, no EHR that I know of allows a Patient to create a Procedure (most specifc to my case, Cerner doesn't).. but technically the current FHIR specification does seem to allow a Patient to be the recorder and asserter of a Procedure.</p>",
        "id": 153993503,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536161639
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Regarding <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17576\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17576\">GF#17576</a>, do you know which quarter this discussion is planned?  </p>\n<blockquote>\n<p>we are discussing with PC Observation.note extension v Observation.comment at the WGM. </p>\n</blockquote>",
        "id": 153993560,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1536175763
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> regarding the comment</p>\n<blockquote>\n<p>no EHR that I know of allows a Patient to create a Procedure (most specifc to my case, Cerner doesn't)</p>\n</blockquote>\n<p>FYI, functionally speaking, Cerner does allow a patient to self-report a procedure (albeit via proprietary APIs at the moment).  Once reconciled to the patient's chart, the practitioner gets \"credit\" for recording the procedure.</p>",
        "id": 153993563,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1536176037
    },
    {
        "content": "<p>what requires clarification <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> ?  You said it must be done by proprietary API. This is a FHIR discussion thread. full-stop.<br>\nWhy would the practitioner get credit for a Procedure that a patient generated?   <br>\nThe overall use-case I have is purely patient generated pulse-Oximetry data; so I don't know what the use of discussing Procedure is. I am not saying that the system can't notice the patient generated Observation and update that Observation to point at an existing Procedure. I simply don't have that data, I can't record the Procedure. I can only record the Observation.</p>",
        "id": 153993584,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536181293
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> for the confusion.  I wasn't trying to influence the broader Pulse Ox discussion, but instead, I was trying to shed some clarification on the following statements you made:</p>\n<blockquote>\n<p>Lastly, no EHR that I know of allows a Patient to create a Procedure (most specifc to my case, Cerner doesn't).. but technically the current FHIR specification does seem to allow a Patient to be the recorder and asserter of a Procedure.</p>\n</blockquote>\n<p>To elaborate, the Patient Care workgroup added Procedure.asserter and recorder as part of <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12633\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12633\">GF#12633</a>.  The specific use case is around \"procedure statements\", which can be part of past medical/surgical history.  The scope of Procedure indicates it can be used for current procedures (often asserted/recorded by a practitioner) as well as historical procedures (often asserted/recorded by a patient or related person).  I used Cerner in my earlier comments as an example of an EHR that supports capture of patient-reported procedures (e.g. procedure statements).  While our patient-recorded procedures are written using a proprietary API <em>at the moment</em>, we <em>are</em> moving towards supporting FHIR APIs for the writes.</p>",
        "id": 153993682,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1536231977
    },
    {
        "content": "<p>I would be interested in realistic (not theory) use-cases for a Patient authored Procedure. I think that is a different thread than Pulse Ox self-reported measurement. right? How would a Pulse Ox measurement be a use-case for creating a Procedure? I certainly see how it could be correlated to a CarePlan or prescription or other that initiated the use of Oxygen machine. Overall I would like to see a discussions of Patient authoring of Procedures on a different thread.</p>",
        "id": 153993695,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536234191
    }
]