[
    {
        "content": "<p>Looking through the list here, I noticed something odd. <a href=\"https://www.hl7.org/fhir/v3/PurposeOfUse/vs.html\">https://www.hl7.org/fhir/v3/PurposeOfUse/vs.html</a></p>\n<p>Clinical trials is listed both under \"Research\" Level 1 PoU, but also under \"Treatment\" Level 1 PoU. The description doesn't really differentiate them</p>\n<p><strong>Treatment Clinical Trials</strong> - To perform one or more operations on information for conducting scientific investigations to obtain health care knowledge. Use of the data iincludes basic and applied research such as biomedical, population origin or ancestry, translational research, and disease, discipline, specialty specific healthcare research and clinical trial research.</p>\n<p><strong>Research Clinical Trials</strong> - To perform one or more operations on information for conducting scientific investigations to obtain health care knowledge. Use of the data iincludes basic and applied research such as biomedical, population origin or ancestry, translational research, and disease, discipline, specialty specific healthcare research and clinical trial research.</p>",
        "id": 210457712,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1600380543
    },
    {
        "content": "<p>Curious for thoughts here. Pretty big PoU loophole, it would seem.</p>",
        "id": 210457731,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1600380558
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 210457867,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600380651
    },
    {
        "content": "<p>I agree. I welcome the oversite and recommendations for improvements. The PurposeOfUse vocabulary has not been used beyond a few of the primary codes. I would recommend a Change Request be entered in the terminology JIRA  <a href=\"https://terminology.hl7.org/1.0.0/CodeSystem-v3-ActReason.html\">https://terminology.hl7.org/1.0.0/CodeSystem-v3-ActReason.html</a></p>",
        "id": 210460978,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600383014
    }
]