[
    {
        "content": "<p>We're looking at the valueset <a href=\"http://hl7.org/fhir/v3/PurposeOfUse/vs.html\" target=\"_blank\" title=\"http://hl7.org/fhir/v3/PurposeOfUse/vs.html\">http://hl7.org/fhir/v3/PurposeOfUse/vs.html</a> within the context of Consent.provision.purpose (Consent.except.purpose in STU3). Specifically in Ontario, we need to grant providers/practitioners emergency access to a protected patient record if there is risk of harm to the patient, or risk of harm to others (and the patient is unavailable to provide consent).<br>\nThe PurposeOfUse ValueSet includes the two following values:<br>\n<strong>ETREAT</strong>: \"To perform one or more operations on information for provision of immediately needed health care for an emergent condition.\"<br>\n<strong>PATSFTY</strong> : \"To perform one or more operations on information in processes related to ensuring the safety of health care.” </p>\n<p>We would much prefer to use the following two values from the ActReason codesystem:<br>\n<strong>OVRTPS</strong>: To perform one or more operations on information to which the patient has not consented for third party safety.  Usage Notes: The patient, while able to give consent, has not. However, the provider believes that access to masked patient information is justified because of concerns related to the health and safety of one or more third parties.<br>\n<strong>OVRER</strong>: “To perform one or more operations on information to which the patient has not consented by authorized entities for treating a condition which poses an immediate threat to the patient's health and which requires immediate medical intervention. Usage Notes: The patient is unable to provide consent, but the provider determines they have an urgent healthcare related reason to access the record.”</p>\n<p>Our question is this:<br>\nPurposeofUse ValueSet is an extensible binding. Is ETREAT considered a generalization of OVRTPS, and is PATSFTY considered a generalization of OVRER? Or are they sufficiently different concepts that we can use OVRTPS and OVRER instead? (particularly in light of OVRTPS and OVRER being under the _ActConsentInformationAccessOverrideReason ActReason hierarchy)</p>\n<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Is this an appropriate forum for discussion, or should I raise this through the vocab listserv?</p>",
        "id": 159745553,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1551471514
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"199026\">@k connor</span> ?</p>",
        "id": 159746633,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551472394
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"192248\">@Alexander Mense</span> as well</p>",
        "id": 159753608,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551477985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192143\">@Ken Sinn</span> If the emergency access is an overarching policy which applies to all patients regardless of their consent, I think a better design would be to leave it out of individual consents and treat it as as an overarching policy. So while others will answer the valueset details, I'm wondering if there is a reason you're planning to encode emergency access in individual consents.</p>",
        "id": 159755040,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551479287
    },
    {
        "content": "<p>Actually, I think that ETREAT is more likely to be a generalization of OVRER.  But it's somewhat difficult for me to be sure of that based on those definitions.  Probably I would be inclined to say that, as you seem to be asking, if either OVRTPS or OVRER more accurately captures the intended meaning that you are trying to represent, then in this case with the extensible binding it would be acceptable to use one of those codes instead of being forced to use ETREAT or PATSFTY.  I do also agree, though, that we need to have Kathleen  or John or Alexander or someone in the group weigh in on how close the intended meanings of these codes actually are (including whether the intention was or is for any of them to be equivalent or specializations/generalizations).</p>",
        "id": 159782804,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1551510852
    },
    {
        "content": "<p>The purposeOfUse vocabulary has layers to it. That is why there is a number in the first column <a href=\"http://build.fhir.org/v3/PurposeOfUse/vs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/PurposeOfUse/vs.html\">http://build.fhir.org/v3/PurposeOfUse/vs.html</a>. I am not sure these groupings are absolute, as in it is forbidden to consider BTG in cases not part of Emergency Treatment which is part of Treatment. I think they are grouped this way to give guidance to the intended understanding. I might be wrong, and they might be absolutes. I know I have heard <span class=\"user-mention\" data-user-id=\"199026\">@k connor</span> indicate that the groupings are to be used for automated policy rule language.</p>",
        "id": 159868888,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551654028
    }
]