[
    {
        "content": "<p>Is it expected that a server which does not normally allow upsert to a client-defined ID will accept a PUT to the location of a deleted resource?</p>\n<p>From the spec language in delete (\"Resources that have been deleted may be \"brought back to life\" by a subsequent update interaction using an HTTP PUT.\") and Update as Create (\"...to PUT a resource to a location that does not yet exist on the server\") it seems like the answer would be yes, but the connection between the two is not quite spelled out. If a deleted resource is considered to be a location that <em>does</em> exist on the server, the wording could state that more explicitly.</p>",
        "id": 168413322,
        "sender_full_name": "Paul Church",
        "timestamp": 1560872449
    },
    {
        "content": "<p>A PUT to the location of a deleted resource is more like an update than an upsert as the record 'exists'.  However, there isn't necessarily an 'expectation'.  Servers that don't permit upserts can choose to support 'undelete' updates.  (And similarly, systems that support upserts could choose for business reasons to prohibit 'undelete' updates.)</p>",
        "id": 168420480,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560877263
    },
    {
        "content": "<blockquote>\n<p>Servers that don't permit upserts can choose to support 'undelete' updates</p>\n</blockquote>\n<p>uh? since undelete is supported via 'upsert' I don't know how to make sense of that</p>",
        "id": 168438612,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560880495
    },
    {
        "content": "<p>My understanding is that \"upsert\" means \"create if it doesn't exist, update it if it does\".  In the case of a deleted record, the record 'exists' - it's just flagged as deleted, so it would always be an update, not an upsert, no?</p>",
        "id": 168469617,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560906703
    },
    {
        "content": "<p>well, it's semantics, I guess.</p>",
        "id": 168469686,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560906792
    },
    {
        "content": "<p>My point stands I think - someone could prohibit client-assigned ids on a true 'create', but could still allow resurrecting of a deleted resource.  (And could similarly allow client-assigned ids on a create, but (for some reason) prohibit resurrecting deleted resources.  Correct?</p>",
        "id": 168470039,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560907323
    },
    {
        "content": "<p>One distinction is about which fields are allowed to vary on an update.  If it's an \"upsert\", then these wouldn't apply.  If it's an \"undelete/update\" then I would expect they would.</p>",
        "id": 168471941,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1560910505
    },
    {
        "content": "<p>True.  And you wouldn't want a delete followed by an undelete to bypass your 'update' rules.  (e.g. changing the patient or prescriber on a MedicationRequest).  In fact, that's probably important enough to call out in the spec.  <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>, care to submit a change request? :)</p>",
        "id": 168473340,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560912854
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22714\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22714\">GF#22714</a></p>",
        "id": 168474470,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1560915060
    }
]