[
    {
        "content": "<p>I'm getting some URL resolution errors where the referenced link actually exists. <br>\nFor example, The error is <code>The link 'http://hl7.org/fhir/us/core/3.2.0/StructureDefinition-us-core-patient.html' for \"US Core Patient version 3.2\" cannot be resolved</code> but that link actually resolves when selecting it in the IG. <br>\nAny suggestions on why this error is happening? <br>\nHere's the link to the CI build QA Report: <a href=\"http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/qa.html#internal\">http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/qa.html#internal</a></p>",
        "id": 226747330,
        "sender_full_name": "May Terry",
        "timestamp": 1613606693
    },
    {
        "content": "<p>Do you have a declared dependency to that (exact) version of US-Core?  Have you checked for case errors?  Case must be exact.</p>",
        "id": 226748607,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613607503
    },
    {
        "content": "<p>Thanks for the quick reply, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .  ah...Interesting. Seems to be a couple of things going on - the IG Publisher seems to be not happy with validating URLs that redirect to another absolute URL. So our original link is <a href=\"http://hl7.org/fhir/us/core/3.2.0/StructureDefinition-us-core-patient.html\">http://hl7.org/fhir/us/core/3.2.0/StructureDefinition-us-core-patient.html</a> but when accessing it, resolves to <a href=\"http://hl7.org/fhir/us/core/2021Jan/StructureDefinition-us-core-patient.html\">http://hl7.org/fhir/us/core/2021Jan/StructureDefinition-us-core-patient.html</a>.  Changing our link to the absolute URL <a href=\"http://hl7.org/fhir/us/core/2021Jan/StructureDefinition-us-core-patient.html\">http://hl7.org/fhir/us/core/2021Jan/StructureDefinition-us-core-patient.html</a> fixes the \"resolve\" error but then introduces a ImplementationGuide.dependency[1].url warning. <code>The jira specification file appears to be out of date with the versions, artifacts and pages currently defined in the IG. A proposed revised file to be reviewed and, if appropriate, submitted as a pull request against the XML folder in https://github.com/HL7/JIRA-Spec-Artifacts. To see the differences, perform a file compare on 'template/jira-current.xml' (a normalized view of what is in Github) and 'template/jira-new.xml' (reflects current IG content)</code>.  <br>\nSince we only reference US Core 3.2 in documentation within a markdown file and not directly in any substantial artifact (e.g.: profile), should it matter?</p>",
        "id": 226751150,
        "sender_full_name": "May Terry",
        "timestamp": 1613609479
    },
    {
        "content": "<p>When you have an IG dependency, there's a specific URL assigned to that that you're required to use.  (You can - and should - actually use a {{site.data.fhir....}} variable to reference that URL - that way if you ever change what version you depend on, the URL will automatically change everywhere it needs to).  The validator explicitly checks that all references to HL7 artifacts are declared properly as references.  If the URLs aren't exactly correct, it'll yell.</p>",
        "id": 226754076,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613611934
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> There may be a misunderstanding.  We aren't talking about a IG dependency. This is just a link that is part of our narrative.  We want to refer to documentation in a particular version of US Core. We aren't doing anything except trying pointing the user to an HTML page. The page exists on the web, like any other page on the web.  Why the error message?</p>",
        "id": 226754596,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1613612449
    },
    {
        "content": "<p>Right now, if you want to point to something in another IG, there's an expectation of a dependency on that IG.  I know there's a way around it, but I forget what it is.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>?</p>",
        "id": 226755439,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613613227
    },
    {
        "content": "<p>It is perfectly reasonable in a narrative to draw comparisons between several versions of the same profile, with links, explaining how the profiled changed from version to version to version. This restriction to only link to pages in IGs that are declared dependencies should be eliminated.</p>",
        "id": 226799814,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1613649639
    },
    {
        "content": "<blockquote>\n<p>This restriction to only link to pages in IGs that are declared dependencies should be eliminated.</p>\n</blockquote>\n<p>Easy to say, but in fact, editors routinely reference the wrong thing, and this check picks it up</p>",
        "id": 227543119,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614137787
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - what's the process so Mark can bypass it for the specific links he wants to reference (without declaring a dependency)?</p>",
        "id": 227543606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614138215
    },
    {
        "content": "<p>there is no process. It's reasonable for us to have one though</p>",
        "id": 227543845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614138474
    }
]