[
    {
        "content": "<p>Has anyone used or developed FHIR resources for Quality Program building?</p>\n<p>I see that there are FHIR resource for Measure and MeasureReport so wondering if anyone has anything for Programs.</p>",
        "id": 153997450,
        "sender_full_name": "Joseph Sadlon",
        "timestamp": 1537216883
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 153997459,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537219792
    },
    {
        "content": "<p>Yes, we have been running the Measure and MeasureReport resources through various use cases in the past several connectathons, including a HEDIS IG from NCQA, and working now on an IG that includes 3 of the 2018 AU CMS program measures for cancer screening. We'll be running those in the <a href=\"http://wiki.hl7.org/index.php?title=201809_Clinical_Reasoning#QDM_Mapping\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201809_Clinical_Reasoning#QDM_Mapping\">Clincal Reasoning Track</a> in Baltimore.</p>",
        "id": 153997464,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1537220374
    },
    {
        "content": "<p>Hi - I stumbled upon this thread while I was thinking through a use case that I think may fit in this stream:</p>\n<p>A value based payment program needs the clinical cancer staging information for each patient under the care of an APM participant. To calculate relevant quality measures, an extract of clinical cancer staging information is required bi-annually from the EHRs of participating providers for their attributed patients.  Having successfully extracted the data from CEHRT calculations of measures are performed and reported back to the participants and the program administration.</p>\n<p>I'd welcome anyone's suggestions - </p>\n<p>Aaron</p>",
        "id": 154013100,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1540779950
    }
]