[
    {
        "content": "<p>We have a need to represent approximate measurements in FHIR for a project where we are mapping a legacy data flow. The flow has the following value comparators. When using Observations with Quantity then the \"required\" valuseset for comparator at <a href=\"http://hl7.org/fhir/STU3/valueset-quantity-comparator.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/valueset-quantity-comparator.html\">http://hl7.org/fhir/STU3/valueset-quantity-comparator.html</a> does not include \"approximately\" - any suggestions on options here...</p>\n<p><a href=\"/user_uploads/10155/v-o8BEqf5A_RyrpED1cwnHVH/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/v-o8BEqf5A_RyrpED1cwnHVH/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/v-o8BEqf5A_RyrpED1cwnHVH/pasted_image.png\"></a></div>",
        "id": 153971450,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1529920448
    },
    {
        "content": "<p>All of the others allow for strict mathematical comparison.  My leaning would be to treat \"approximately\" as something else - though, given it modifies the meaning, having it as core would be good.  Can you submit a change request?</p>",
        "id": 153971464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529921888
    },
    {
        "content": "<p>we discussed this at length early in the project, and looked at both PPD and NPPD in the v3 spec, and the openEHR approximate approach</p>",
        "id": 153971479,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529922580
    },
    {
        "content": "<p>in the end, we just found that there was little use in practice, hence, leaving it to extension.</p>",
        "id": 153971480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529922601
    },
    {
        "content": "<p>I don't think it would be a modifier extension, though</p>",
        "id": 153971481,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529922609
    },
    {
        "content": "<p>Ignoring the extension when I see x = 5, I infer that x is definitely not 4.  Paying attention to the extension, I see x~=5, where I infer that x may be 4.  If paying attention to the extension negates your prior understanding, that makes it a modifier...</p>",
        "id": 153971488,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529923570
    },
    {
        "content": "<p>I think you've gone out on a limb with that intepretation</p>",
        "id": 153971491,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529923760
    },
    {
        "content": "<p>I don't understand how it can be out on a limb.  If an extension can falsify an understanding reached by ignoring the extension, then the extension can't be safe to ignore.</p>",
        "id": 153971492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529923961
    },
    {
        "content": "<p>Thanks you've cofirmed my suspicion that we need to use an extension. I've had a look and can't see any standards ones so we will create our own. We'll discuss within our implementation team whether we go for modifierExtension or not.</p>\n<p>With regards to \"raising a change request\" then I'm not sensing a concensus there, so I'll leave it for others to progress that.</p>",
        "id": 153971523,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1529926178
    },
    {
        "content": "<p>You actually can't have modifier extensions inside Quantity, which is part of the challenge here.</p>",
        "id": 153971549,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529937138
    },
    {
        "content": "<p>I recently came across the same problem. Have there been any developments on this in the meantime?</p>",
        "id": 217419894,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1605888087
    },
    {
        "content": "<p>No changes to the spec in this space.</p>",
        "id": 217509876,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605978629
    },
    {
        "content": "<p>Would there be sufficient interest in defining a standard extension? <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> and I would like to avoid to define an extension for this purpose in the realm of HL7 Germany as a national extension.</p>",
        "id": 218454706,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1606843687
    },
    {
        "content": "<p>You can certainly submit a change request for us to add a 'standard' extension.  We'll have to settle the question of whether it's a modifier or not.</p>",
        "id": 218493567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606863164
    }
]