[
    {
        "content": "<p>In Questionnaire Item of type QuantityType (<a href=\"http://build.fhir.org/codesystem-item-type.html#item-type-quantity\" target=\"_blank\" title=\"http://build.fhir.org/codesystem-item-type.html#item-type-quantity\">http://build.fhir.org/codesystem-item-type.html#item-type-quantity</a>) where does Quantity itself goes in question?</p>",
        "id": 153869784,
        "sender_full_name": "Awais Akhtar",
        "timestamp": 1486037749
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192913\">@Awais Akhtar</span> As per <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\">http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions</a>, questions should only be raised in one place at a time.  I've deleted your question on the forum.  The Questionnaire doesn't include the answer, it just defines the question.  The answers to a Questionnaire are submitted using QuestionnaireResponse.  There you'd send a Quantity in QuestionnaireResponse.item.answer.valueQuantity</p>",
        "id": 153869814,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486062441
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Sorry about posting it twice. But what about question in questionnaire like: how much vitamins you take daily(mg or g). Does Questionnaire Item contains Quantity where we can define units? or there is other way?<br>\nthanks for response :)</p>",
        "id": 153869851,
        "sender_full_name": "Awais Akhtar",
        "timestamp": 1486084448
    },
    {
        "content": "<p>I think this extension is what you are looking for<br>\n<a href=\"http://build.fhir.org/extension-questionnaire-unit.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-questionnaire-unit.html\">http://build.fhir.org/extension-questionnaire-unit.html</a><br>\nYou select the Item.type to be quantity and then include this extension to indicate which units should be applied (you may be able to select convertible units of that type - as in if a distance measurement might request <code>m</code> but you could provide <code>mm</code>, but not <code>kg</code>)</p>",
        "id": 153869853,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1486087593
    },
    {
        "content": "<p>You really need an extension to describe a Question with the type quantity? Is it not possible to use the code element of item? </p>",
        "id": 153870276,
        "sender_full_name": "Florian Schrinner",
        "timestamp": 1486385584
    },
    {
        "content": "<p>The extension is not to define that its a quantity type, its to select he unit system for the quantity type item</p>",
        "id": 153870430,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1486454639
    },
    {
        "content": "<p>ok, let me try to describe my question a little bit more detailed. Let's say we define a Question in STU 3 Candidate Version. In Item we set type-&gt;quantity. You suggested to use the extension to select the unit for the quantity. My Question was if it is really necessary to use an extension. I mean, the type quantity is in the standard and there should be a standardised way to define the settings for a quantity. And I suggested to use the concept element of the item or in in the Current Build the code element to do this. But I see why this is not the best idea. Ok, the unit extension is in the core-extensions of questionnaire so I guess it is the best way at the moment, but maybe it should later go into the Questionnaire Structue definition. I mean this is a use case you need very often (weight, height, age, duration) </p>",
        "id": 153870839,
        "sender_full_name": "Florian Schrinner",
        "timestamp": 1486637648
    },
    {
        "content": "<p>It's always a question of \"how common do we think support for this is in implementer systems\".  It's an extension because right now we don't think 80%+ of systems that handle questionnaires formally handle defining the allowed units for a Quantity.  (Actually, it's doubtful that 80% of them support Quantity either, but making the use of that type an extension would be particularly painful, so we include it in core.)</p>",
        "id": 153870877,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486652036
    },
    {
        "content": "<p>I wonder when we can use QuantityType if there is no quantity in there. I mean we can then just use unit extension with Integer, decimal or string type but will be missing comparator.</p>",
        "id": 153870944,
        "sender_full_name": "Awais Akhtar",
        "timestamp": 1486684822
    },
    {
        "content": "<p>If you want to fix your unit, that's the best choice.  Quantity is really for when you want to allow the user to specify the unit.</p>",
        "id": 153870951,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486688999
    }
]