[
    {
        "content": "<p>Hi all,</p>\n<p>I have a question regarding how other FHIR users are retrieving all the current medication resources associated with a patient profile. It looks like there may be different approaches in theory, but I'm wondering what other have used in practice. In this link - <a href=\"https://fhir.cerner.com/millennium/dstu2/medications/medication-statement/#querying-for-active-medications\" target=\"_blank\" title=\"https://fhir.cerner.com/millennium/dstu2/medications/medication-statement/#querying-for-active-medications\">https://fhir.cerner.com/millennium/dstu2/medications/medication-statement/#querying-for-active-medications</a> - Cerner discusses the approach of using MedicationStatement as well as MedicationOrder (MedicationRequest) to ensure that draft orders are included. According to the FHIR docs, it looks like this should be a valid approach, as MedicationStatement is commonly used as \"the summarization of a patient's 'active medications' in a patient profile'\". However, I've run into issues retrieving MedicationStatement in a couple different sandboxes - HSPC: <a href=\"https://www.hspconsortium.org/developers/sandbox/\" target=\"_blank\" title=\"https://www.hspconsortium.org/developers/sandbox/\">https://www.hspconsortium.org/developers/sandbox/</a> and SmartHealthIt: <a href=\"https://www.launch.smarthealthit.org\" target=\"_blank\" title=\"https://www.launch.smarthealthit.org\">https://www.launch.smarthealthit.org</a> - but can retrieve medication resources via MedicationRequest. I'm curious if this is indicative of real EHRs or is maybe a limitation in the implementation of the FHIR servers in these sandboxes? Can any real-world implementers shed some light on how they go about retrieving all active medications from real EHRs?</p>\n<p>Thanks,<br>\nMichael</p>",
        "id": 154020852,
        "sender_full_name": "Michael Growette",
        "timestamp": 1543241120
    },
    {
        "content": "<p>In Argonaut, most U.S. EHRs have agreed to use MedicationStatement to reflect the medications that a patient is \"believed\" to be on - but there's no guarantee across all EHRs that looking at MedicationStatement alone will give you everything.</p>",
        "id": 154020871,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543246538
    },
    {
        "content": "<p>Great, thank you!</p>",
        "id": 154021056,
        "sender_full_name": "Michael Growette",
        "timestamp": 1543326507
    },
    {
        "content": "<p>Michael - we considered very carefully using the Epic FHIR endpoints for our patient portal. Leaving AuthN, AuthZ aside (whole different can of worms) - the FHIR endpoints didn’t contain some important information that was needed like number of refills left and so on. We had to fall back to using the WCF services instead but to answer your question - the MedicationStatement returns the same payload as the legacy API so it is the right one to use. There is a Status parameter you can use but I’d combine it with the Category parameter to further narrow down the list (especially for patient-reported meds). The missing information actually became more important later with DiagnosticReports and Observations in our case - there were workflows that couldn’t be accomplished just using FHIR like letting the patient aware that there are new test results and marking them as read. Only sharing it as a caution ahead in case you are thinking of using FHIR to power up a portal too.</p>",
        "id": 154021070,
        "sender_full_name": "Veliyan Georgiev",
        "timestamp": 1543331787
    },
    {
        "content": "<p>Hi. on How to get all active medications - depends on what you mean by active medications</p>",
        "id": 154021550,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543485921
    },
    {
        "content": "<p>there is no single universal definition of what is \"active\" or \"current\" medication.</p>",
        "id": 154021551,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543485964
    },
    {
        "content": "<p>and take care when looking at MedicationStatements. They contain what someone stated that the patient is on.</p>",
        "id": 154021552,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543485993
    },
    {
        "content": "<p>if the EHR knows that the patient has an active prescription, this is not a statement, but a request.</p>",
        "id": 154021553,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543486017
    },
    {
        "content": "<p>Unless some system creates statements from prescriptions.</p>",
        "id": 154021554,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543486066
    },
    {
        "content": "<p>and things like number of refills left, which can be important or not, will not be in a statement.</p>",
        "id": 154021555,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543486105
    },
    {
        "content": "<p>so, Statement is just one of the components</p>",
        "id": 154021558,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543486119
    },
    {
        "content": "<p>There is the special use of List -- <a href=\"http://build.fhir.org/list.html#query\" target=\"_blank\" title=\"http://build.fhir.org/list.html#query\">http://build.fhir.org/list.html#query</a></p>",
        "id": 154021696,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543504662
    },
    {
        "content": "<p>.. which just pushes the complexity to the server. </p>\n<p>In the Netherlands we just discussed a project where a server fetches all kinds of Medication* resources, and creates a Questionnaire to be updated by the patient \"are you still taking X?\" \"what else are you taking?\" - the resulting QuestionnaireResponse is translated into MedicationStatements. Yet another way of doing things. The Questionnaire is sent to the patient just prior to them being admitted for a scheduled procedure.</p>",
        "id": 154022061,
        "sender_full_name": "René Spronk",
        "timestamp": 1543571912
    },
    {
        "content": "<p>I'm working with Michael on this and understanding the various Medication related resources is only our first layer of getting to all active medications.  To answer Jose's question, our definition of active is our best understanding of what medications a patient is on today.  We are building a SMART on FHIR app that performs some level of analysis on medications that a patient is actively consuming so that providers can adjust the medication regimen to reduce medication risk.</p>\n<p>It seems like using MedicationStatement is a good starting place understanding that it may not be perfect and non US EHRs may not use it in the same manner.</p>\n<p>The next question we are working to solve is how to look at an individual medication resource, we'll use MedicationOrder in this example, and determine whether or not it is current.  <br>\ncurl <a href=\"https://fhir-open.sandboxcerner.com/dstu2/0b8a0111-e8e6-4c26-a91c-5069cbc6b1ca/MedicationOrder/14205368\" target=\"_blank\" title=\"https://fhir-open.sandboxcerner.com/dstu2/0b8a0111-e8e6-4c26-a91c-5069cbc6b1ca/MedicationOrder/14205368\">https://fhir-open.sandboxcerner.com/dstu2/0b8a0111-e8e6-4c26-a91c-5069cbc6b1ca/MedicationOrder/14205368</a> -H 'accept: application/json'</p>\n<p>This MedicationOrder has a status of active, a dateWritten of 2015-07-22, a timing code of daily, and a dispenseRequest.quantity of 30.  No information is presented regarding refills outside of a text field, which would be unreliable.</p>\n<p>If we combine dateWritten, timingCode, and quantity, the answer is no, this medication expired a long time ago.  One of our worries is that neither dosageInstruction or dispenseRequest are required fields which could give us inconsistent results if EHRs don't proactively provide this data.</p>\n<p>Has anyone come up with a good formula, or know of a public library we could include that helps solve this problem?</p>",
        "id": 154022094,
        "sender_full_name": "Mark Hudson",
        "timestamp": 1543585783
    },
    {
        "content": "<blockquote>\n<p>our definition of active is our best understanding of what medications a patient is on today.</p>\n</blockquote>\n<p>Which is fine, because it is your definition. Other places will have other definitions for \"active\" or rather consider \"relevant\" medication - also whatever that is.</p>",
        "id": 154022372,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543778847
    },
    {
        "content": "<p>here is some old stuff:<br>\n<a href=\"/user_uploads/10155/tjab1u6nSZ3BPwkje05MuhBp/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/tjab1u6nSZ3BPwkje05MuhBp/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/tjab1u6nSZ3BPwkje05MuhBp/pasted_image.png\"></a></div>",
        "id": 154022373,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543779133
    },
    {
        "content": "<p>I'd say the principle is:<br>\n1. Use List, capture the other resources<br>\n2. Call things what they are. If you have a known prescription and a known dispense, they are no more, no less than that. They may indicate \"active\" but if you have a statement countering that information, then someone has to make a decision. So, keep the data, don't make assumptions.<br>\n3. Don't assume you can define global criteria for what should be in any list. Someone in Europe some time ago made a definition of what should be a medication list, and they took that as the entire truth, and I think they are still regretting that (or at least they should, considering the impact)</p>",
        "id": 154022374,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543779350
    },
    {
        "content": "<p>Oops, I just wrote a few things, they seem to be lost in ether. Can someone see the picture i posted?</p>",
        "id": 154022375,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543779562
    },
    {
        "content": "<p>anyway, it is here:<br>\nftp://ftp.ihe.net/Pharmacy/yr6_2014-2015/Technical_Committee/Whitepapers/MedicationManagement/MedicationManagementRelatedConceptsandDefinitions_2014.10.02.docx</p>",
        "id": 154022376,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543779581
    },
    {
        "content": "<p>in case my other messages were lost: Use List, and use the resources for what they mean. a prescription means a prescription, a dispense another. a statement does not overlap any of those</p>",
        "id": 154022377,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543779878
    },
    {
        "content": "<p>and re-posting the picture <a href=\"/user_uploads/10155/KNYsH7N1F1maQKlIhyjqylUg/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/KNYsH7N1F1maQKlIhyjqylUg/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/KNYsH7N1F1maQKlIhyjqylUg/pasted_image.png\"></a></div>",
        "id": 154022378,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543779929
    },
    {
        "content": "<p>Even if a medication order has expired, that doesn't necessarily mean the patient has finished taking it.  They may not have started when it was first prescribed - or even when it was first dispensed.  They may also have taken a break, then resumed.  The best you can do is make categorical statements of \"very likely taking\", \"possibly taking\", \"unlikely to still be taking\" and \"no evidence of taking\".</p>",
        "id": 154024346,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544496171
    },
    {
        "content": "<p>yes, and if you do those statements, they are your local interpretation. When we discussed this in IHE a few years ago, there were two ideas:<br>\n1. We can make assertions based on the data and send those assertions as well, but it is nice to send the actual data in case your assertions are not following the same rules on both ends of the wire<br>\n2. We could (can we?) code some of those assertions or interpretations, e.g. \"give me the \"active\" list of meds , where \"active\" means xxxxxxxxx..</p>",
        "id": 154025863,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1544956483
    }
]