[
    {
        "content": "<p>When querying Questionnaire by canonical URI (<a href=\"https://www.hl7.org/fhir/search.html#versions\">https://www.hl7.org/fhir/search.html#versions</a>), is there any way to specify \"I want latest\" rather than explicitly specify latest version?</p>",
        "id": 202458764,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1593533654
    },
    {
        "content": "<p>If you don't specify a desired version - i.e. you just specify the id, not _history/[version], you get the latest</p>",
        "id": 202459540,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593534042
    },
    {
        "content": "<p>By version I mean business version, as per:</p>\n<blockquote>\n<p>For canonical references, servers SHOULD support searching by Canonical URLs, and SHOULD support automatically detecting a |[version] portion as part of the search parameter and interpreting that portion as a search on the business version of the target resource.<br>\nNot the <code>Resource.meta.versionId</code>.</p>\n</blockquote>",
        "id": 202465866,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1593536647
    },
    {
        "content": "<p>I believe it is the server's business rule to decide what is the \"latest\" version to return.</p>",
        "id": 202466611,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1593537033
    },
    {
        "content": "<p>Right, but how would I express that in a query, is there a way?<br>\nI guess, server can support it via sorting by version, like <code>Questionnaire?url=&lt;url&gt;&amp;_sort=-version&amp;_count=1</code>.</p>",
        "id": 202470665,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1593538942
    },
    {
        "content": "<p>I understand your question now. So the server has multiple Questionnaire resources with the same Questionnaire.version value but different Questionnaire.meta.versionId.<br>\nIs that correct?<br>\nBut in which situation the resource with the latest versionId does not have the latest business version?</p>",
        "id": 202474445,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1593540831
    },
    {
        "content": "<p>There's no standard way to define business versions, so there's no standard way to determine what the 'latest' is.  It's quite possible to update an 'older' business version more recently than the 'current' business version - so it really is going to have to be up to the server to decide what release to return if there are multiple business versions with the same canonical URL available on a server</p>",
        "id": 202475976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593541581
    },
    {
        "content": "<p>We do a similar thing for different resources (ValueSets, CodeSystems, ConceptMaps, StructureDefinitions). We resolve latest using x.y.z or yyyymmdd versions, provided that all resources with the canonical URL have the same versioning format, and there is a single latest.</p>",
        "id": 202508380,
        "sender_full_name": "Jim Steel",
        "timestamp": 1593560362
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> The need to return the latest canonical is a real use-case, but it would require enforcing some consistency around [Resource].version.  Do you think we could reasonably define a small number of syntaxes that would allow version order comparison and indicate that systems <em>should</em> use one of those - and that if they don't, they can't count on systems being able to determine latest?  (Should also standardize what to do if a server can't figure out latest)</p>",
        "id": 202577178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593614691
    },
    {
        "content": "<p>sure we could document that. Though servers may make other arrangements that mean it could work.</p>",
        "id": 202772474,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593757985
    },
    {
        "content": "<p>I do think that the semantics for referring to the current version of a canonical resource are clear in a canonical(X)</p>",
        "id": 202772491,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593758021
    },
    {
        "content": "<p>but I also think that we haven't defined precisely how a client would ask for that resource, and we definitely should</p>",
        "id": 202772542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593758045
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194996\">@Ivan Dubrov</span>, would you be willing to submit a change request?</p>",
        "id": 202804375,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593783393
    },
    {
        "content": "<p>I didn't know what exactly to propose, so wrote some generic ticket: <a href=\"https://jira.hl7.org/browse/FHIR-27920\">https://jira.hl7.org/browse/FHIR-27920</a>. I generalized it for all resources which are commonly referenced by canonical since we have similar issue with conformance resources as well.</p>",
        "id": 203011241,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1594052893
    }
]