[
    {
        "content": "<p>Let's say you have a FHIR Server with lots of data about a patient (i.e. different types of FHIR Resources) and then you want to create a UI that shows a \"patient timeline\". <br>\nWhat would be the preferred way for the UI to interact with the FHIR Server? Should one do one query per resource type? Or is there some other mechanism whereby someone can do one single but more complex query (FHIR Path?) and get a FHIR Bundle back with all the data needed for the timeline?</p>",
        "id": 261504458,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1636987000
    },
    {
        "content": "<p>It depends on what you want to show in your timeline.  the $everything operation will fetch every resource about that subject but that may not be what you want.  It may be better to fetch all Encounters or all Conditions or another individual Resource and build it from there.  It all depends on how you want to orient the timeline.</p>",
        "id": 261504826,
        "sender_full_name": "David Pyke",
        "timestamp": 1636987157
    },
    {
        "content": "<p>Yeah I would assume the caller has some preferences on what data it wants to fetch, like only certain types of Resources or only Observations where <code>code</code> comes from a pre-defined set of values.</p>",
        "id": 261505283,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1636987360
    },
    {
        "content": "<p>The you do a fetch for Condition or Encounter where patient/subject is X or all Observations where code is X and patient is Y and then do _includes as necessary</p>",
        "id": 261505839,
        "sender_full_name": "David Pyke",
        "timestamp": 1636987632
    },
    {
        "content": "<p>If the data is consistent, I would suggest a batch query to get all the results together.  You can also use chaining / including to do more complex queries, but it may be faster to do multiple 'simple' requests instead of trying to do a single 'complex' one.</p>\n<p>I'm working on an updated pass of the search page now, but it's a ways off yet.  The areas you'll want to look at are:</p>\n<ul>\n<li><a href=\"https://www.hl7.org/fhir/search.html#reference\">reference</a> and <a href=\"https://www.hl7.org/fhir/search.html#chaining\">Chained Parameters</a> have info about chaining (search criteria crossing resource boundaries, in the 'forward' direction - e.g., Encounter has a link to Patient, so search Encounter with properties from a Patient).</li>\n<li><a href=\"https://www.hl7.org/fhir/search.html#has\">Reverse Chaining</a> is the same, but 'backwards' across links (e.g., Encounter has a link to Patient, so search Patient with properties from an Encounter)</li>\n<li><a href=\"https://www.hl7.org/fhir/search.html#revinclude\">Including other resources in result</a> has information on returning additional resources via <code>_include</code> (forward links) and <code>_revinvlude</code> (backwards links).  Same concept as chaining, but instead of search criteria it adds the resources to the returned bundle.</li>\n</ul>\n<p>For information about batching queries, the best place to start is the <a href=\"https://www.hl7.org/fhir/http.html#transaction\">batch/transaction</a> section of the http page.  Essentially, it's a bundle that has several requests 'batched' together in a single request.</p>\n<p>Normal disclaimer, the more 'advanced' you get in your requests, the less likely they will be implemented on a server (on average).  You'll want to be able to fall back from complex requests (e.g., complicated reverse include / chaining) into something simpler if you go that route.</p>\n<p>Shameless plug - I try to cover this in my <a href=\"https://youtube.com/playlist?list=PLsR-zcO--dypskMPAd8r-EoiQOCdiYrux\">FHIR Search</a> series of videos.</p>\n<p>Hope this helps!</p>",
        "id": 261516184,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1636991439
    },
    {
        "content": "<p>It is possible to use $everything operation <code>Patient/123/$everything?_type=Condition,Observation</code></p>",
        "id": 261516968,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1636991760
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> , the info about batch queries was exactly the info I was looking for!</p>",
        "id": 261639271,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1637069068
    }
]