[
    {
        "content": "<p>moved <a href=\"https://chat.fhir.org/#narrow/stream/argonaut/topic/SMART.20data.20flow.20into.20EHR.3F\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/argonaut/topic/SMART.20data.20flow.20into.20EHR.3F\">this stream</a> to here:<br>\nSee this discussion for <a href=\"https://chat.fhir.org/#narrow/near/10011/stream/implementers/topic/SDC.20questionnaire.20vs.20Resource\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/near/10011/stream/implementers/topic/SDC.20questionnaire.20vs.20Resource\">QuestionnaireResponse v Resource</a>.  So in a nutshell I think if you want to share you might need to convert the QR to an Obs in the end.   Also  using Observation for indirect reporting is certainly allowed - this has been discussed in the past and there are several way to indicate if it is  indirect.  Provenance may indicate the Observation was created from a QuestionnaireResponse.   The code or method may indicate how the information was gathered or the performer may be a related person for example a spouse answering on behalf of a partner.  Finally from a data integrity standpoint one might create a category of \"home-monitoring\"  or \"self-reported\"  to try to distinguish the more reliable or less reliable measurements or observations.   That part has been discussed as well although I am not aware of how it has been implemented to date.</p>",
        "id": 153845027,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472081066
    },
    {
        "content": "<p>Very helpful, thank you Eric! I understand that Q/QR is useful for documenting the data collection form and tracking provenance; however, best practice for sharing the data would be to map into resources such as Observation/Encounter/Procedure/etc. That make sense when I think about the mechanical process of mapping physical data models. </p>\n<p>It leaves open a practical or policy question: in terms of real-world use, which FHIR- or SMART-compliant systems will allow resources (Observation/Encounter/Procedure/Etc.) to flow into their systems and when? My understanding is at this time, no implementers are working on a generic feature to allow data to flow in. Is that fairly stated? </p>\n<p>I'm cross posting to argonaut/SMART Data Flow into EHR?: <a href=\"https://chat.fhir.org/#narrow/near/34393/stream/argonaut/topic/SMART.20data.20flow.20into.20EHR.3F\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/near/34393/stream/argonaut/topic/SMART.20data.20flow.20into.20EHR.3F\">https://chat.fhir.org/#narrow/near/34393/stream/argonaut/topic/SMART.20data.20flow.20into.20EHR.3F</a></p>",
        "id": 153845838,
        "sender_full_name": "Fred Sieling",
        "timestamp": 1472571777
    }
]