[
    {
        "content": "<p>When building a Questionnaire template, is it necessary to bundle it with resourceComposition?  and why?<br>\nLikewise, is it necessary to bundle the QuestionnaireResponse with resourceComposition?<br>\nPlease advise, thanks.</p>",
        "id": 184668472,
        "sender_full_name": "Maria Hu",
        "timestamp": 1577986423
    },
    {
        "content": "<p>What do you mean by a \"Questionnaire template\"?</p>",
        "id": 184687605,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1578002026
    },
    {
        "content": "<p>Hi.  My understanding is no... the Questionnaire template can be sent as a singleton response.  The format would simply be:  <code>GET /fhir/Questionnaire/&lt;templateId&gt;</code>  What's not supported, however, is that the Questionnaires resource doesn't support a search on the <code>derivedFrom</code> field.  </p>\n<p>Composition is always included as part of the Bundle.  You can think of it as a the postal sticker with address and tracking number that the post office puts on manilla envelopes and parcels.  The nice thing about a large manilla envelope, is that you can put a lot of papers in it.  So, keeping in mind that Questionnaire templates and QuestionnaireResponse templates aren't necessarily the same thing, or you might have multiples and mix-and-match in more complex active questionnaires...  you can just bundle that all together as a Bundle.  Just got to include the Composition as a sort of cover letter.</p>",
        "id": 184688663,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1578003075
    },
    {
        "content": "<p>It would be unusual to use Composition with QuestionnaireResponses and extremely uncommon to use it with Questionnaire.  But it would be helpful to understand what you mean by QuestionnaireTemplate.  Are you talking about a profile that constraints the design of a set of Questionnaires or are you talking about a single Questionnaire instance (which can be thought of as a 'template' for the QuestionnaireResponses against that Questionnaire).</p>",
        "id": 184750736,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578072015
    },
    {
        "content": "<blockquote>\n<p>But it would be helpful to understand what you mean by QuestionnaireTemplate.</p>\n</blockquote>\n<p>I believe this is about my question in the \"Questionnaire\" stream to divide a single Questionnaire into a smaller connected Questionnaires to build a form which is currently not supported. Extensions may work but they make it harder to retrieve a \"form\" comprised of a set of QuestionnaireResponses than using Composition or List.</p>",
        "id": 185126662,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1578499062
    },
    {
        "content": "<p>Right now, you <em>can't</em> have a QuestionnaireResponse created against more than one Questionnaire (whether you use extensions or not).  If a QuestionnaireResponse points to a Questionnaire, then all of the linkIds for the questions in the response must correspond to linkIds in the referenced Questionnaire.  Anything else is non-conformant.  We're exploring how to handle the use-case.  The most likely outcome is that we'll have a notion of 'compiled' vs. 'uncompiled' questionnaires where you can design a questionnaire that references other questionnaires, but on completion you first assemble a 'complete' questionnaire that has all of the questions in-line.  We still haven't figured out how we're going to manage linkId uniqueness though.</p>",
        "id": 185128925,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578500329
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> would the idea of a Questionnaire that is composed of other smaller smaller questionnaires leverage the derivedFrom field with specific guidance on how to deal with linkIds and compilation of the multiple questionnaires into a single Questionnaire?</p>",
        "id": 196651774,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1588779008
    },
    {
        "content": "<p>No, it won't use derivedFrom.  There'll be a specific extension that will appear on a 'display' item that will be replaced with the items of the referenced Questionnaire</p>",
        "id": 196652604,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588779380
    }
]