[
    {
        "content": "<p>We have a use case for a \"document on demand\" operation so I have been looking at the $document operation. This operation will not meet our needs but we'd like to keep as close to it as possible.</p>\n<p>So a few questions ( based on  <a href=\"http://build.fhir.org/composition-operations.html\" target=\"_blank\" title=\"http://build.fhir.org/composition-operations.html\">http://build.fhir.org/composition-operations.html</a></p>\n<p>1) The operation is defined to be valid for URL: [base]/Composition/$document there are no parameters to refine the focus of the generation so how would this create anything that a document for \"all\" compositions</p>\n<p>2) The operation is described as idempotent but is it. Assuming the intent is to drive the document of a focal composition that any resource in the document bundle could change at any time (incl re-versioned) so whilst you probably will get the same result can this be guaranteed</p>\n<p>3) The documents states this is a search operation which means that the document bundle will be returned within a search bundle (e.g.  a bundle within a bundle). </p>\n<blockquote>\n<p>Note that since this is a search operation, the document bundle is wrapped inside the search bundle</p>\n</blockquote>\n<p>Why is this the pattern chosen when there can only ever be one document returned from the operation? The example on the page does not imply that pattern.</p>\n<p>4) Why is there no output parameter defined in the operation definition? Without an output parameter named 'return' would the correct behaviour not be to return a parameter resource ( as per <a href=\"http://hl7.org/fhir/STU3/operations.html#executing\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/operations.html#executing\">http://hl7.org/fhir/STU3/operations.html#executing</a>)</p>",
        "id": 153911535,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506778036
    },
    {
        "content": "<p>As to (1) - the operation also allows for URL: [base]/Composition/[id]/$document which mimics the IHE XDS On Demand option. There is a persist (0..1    boolean) operation parameter to mimic the XDS persistence option.<br>\nAd (2) idempotent - if one were to use a $document on a composition X that is already a document, the result would be document X<br>\nAd (3,4) AFAIK the operation just returns the generated document resource.</p>",
        "id": 153911539,
        "sender_full_name": "René Spronk",
        "timestamp": 1506842246
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> with regards to [1] then I'm aware of the other URL pattern. I'm puzzled about the one I mentioned though - what is it's purpose?</p>",
        "id": 153911567,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506885857
    },
    {
        "content": "<p>with regards to [2] then I'm still not convinced but perhaps it's because we see a composition as not necessarily being a document, or in the case of \"document on demand\" the entities existed before they became a document not as a result of the decomposition of a document.<br>\nwith regards to [3,4] then the spec appears confusing and perhaps inconsistent with other operations.</p>\n<p>Either way the operation does not work for us as we have a different use case - we'll create a different operation</p>",
        "id": 153911568,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506886042
    },
    {
        "content": "<p>I thought I posted this before - but I can't find it - so forgive me if duplicative.    We did a retrieve a document on demand operation using the DocumentReference operation <a href=\"http://www.fhir.org/guides/argonaut/r2/OperationDefinition-docref.html\" target=\"_blank\" title=\"http://www.fhir.org/guides/argonaut/r2/OperationDefinition-docref.html\">$docref</a> for Argonaut and plan to update for STU3 in US Core.  Is that what you mean by Document on Demand?</p>",
        "id": 153911569,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506897958
    },
    {
        "content": "<p>Agree that /Composition/$document seems failry useless, at best an edge use case. <br>\nI was thinking about (2 - Idempotence), and the current wording is questionable. If you were to use $document to turn the Composition and all its referenced resources into a document, would the $document operation check if the instance of Composition is already part of a Bundle of type document? If the $document operation does that (it really has no other way of knowing whether the Composition is a \"Definition\" or an \"Document-Instance\"), then the operation is idempotent.  <a href=\"http://build.fhir.org/composition-operations.html#2.41.13.1\" target=\"_blank\" title=\"http://build.fhir.org/composition-operations.html#2.41.13.1\">http://build.fhir.org/composition-operations.html#2.41.13.1</a> would have to be updated to describe this, as it currently is silent on the expected behavior of the operation in that case.<br>\nTo go back to your NHS use case: are you in effect creating a $message operation on Composition instances, to turn Compositions into messages, with some of the data needed in the message header as IN parameters ?  Makes sense to me..</p>",
        "id": 153911594,
        "sender_full_name": "René Spronk",
        "timestamp": 1506926608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> It's a related use-case. Yours is actually closer to what IHE calls the 'on demand option' in XDS - the metadata of the [future] document is known, whenever it's queried it's instantiated. <br>\nThe current discussion is about the latter part of the instantiation process, part of \"whenever it's queried it's instantiated\". How does the server accomplish that? That's the $document operation on a Composition resource.  The Composition  resource effectively holds \"the metadata of the [future] document\".</p>",
        "id": 153911595,
        "sender_full_name": "René Spronk",
        "timestamp": 1506927208
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I think our use case is different. For us it is more about requesting a document to be constructed following a request to do so. By \"document\" it's a loose term more looking for a BUNDLE with a COMPOSITION resource as the initial entry with associated entry resources depending on the content. The rules for the content of the document, the sections of the composition, the \"entries\" required etc are inherent properties of the operation. It probably will not be focused around a single ENCOUNTER and as such is different from any core operations defined.</p>",
        "id": 153911633,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506947514
    },
    {
        "content": "<p>There are three different concepts that IHE has defined. ( a ) On-Demand, this is a pattern published by the source where the pattern is usually something like \"Current Medical Summary\". The On-Demand usually creates something that is 'current'. There is an option that keeps any document that was created as a snapshot for records keeping.  (  b  ) Deferred-Creation, this is a specific document that could be created but has not yet been made. Usually a \"Discharge Summary\". That is it has a well defined timeframe. When this one is created it replaces the deferred-creation entry (DocumentReference) (((or should, not everyone keeps it).  ( c  ) Fetch (don't have a good name), this is where the requesting system defines the attributes they desire in a document, such as the timeframe the document should cover.</p>",
        "id": 153911678,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506949606
    },
    {
        "content": "<p>deleted</p>",
        "id": 153911736,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506952652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Where is the IHE worked detailed - it would be good to see if we could plan an intercept. We would be looking at either (a) or (c) from your list.</p>",
        "id": 153911844,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506964374
    },
    {
        "content": "<p>The IHE definitions are today in XDS terms, not FHIR.... So far no one has asked for on-demand or delayed-assembly, or fetch from a FHIR api, or for a FHIR document... both are logical, but IHE has not yet received the request for a new work item.</p>",
        "id": 153911850,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506966131
    },
    {
        "content": "<p>But I did want to clarify the meaning of the concepts, so that we can have similar use of the concept-name... and not have something like \"on-demand\" mean something totally different in IHE-XDS as it does in FHIR...</p>",
        "id": 153911851,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506966204
    },
    {
        "content": "<p>Here is Fetch (very immature system, few want to implement this method. There are uses of on-demand that act like I have described for Fetch)  <a href=\"http://wiki.ihe.net/index.php/Cross_Community_Fetch\" target=\"_blank\" title=\"http://wiki.ihe.net/index.php/Cross_Community_Fetch\">http://wiki.ihe.net/index.php/Cross_Community_Fetch</a></p>",
        "id": 153911852,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506966285
    },
    {
        "content": "<p>delayed assembly <a href=\"http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_Delayed_Doc_Assem.pdf\" target=\"_blank\" title=\"http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_Delayed_Doc_Assem.pdf\">http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_Delayed_Doc_Assem.pdf</a></p>",
        "id": 153911853,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506966377
    },
    {
        "content": "<p>On-Demand is part of Final-Text XDS  <a href=\"http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_TF_Vol1.pdf#nameddest=10_1_1_7_On_Demand_Document_Sou\" target=\"_blank\" title=\"http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_TF_Vol1.pdf#nameddest=10_1_1_7_On_Demand_Document_Sou\">http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_TF_Vol1.pdf#nameddest=10_1_1_7_On_Demand_Document_Sou</a></p>",
        "id": 153911854,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506966649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  how does use case (a) different from the argonaut $docref - I thought they were the same thing?</p>",
        "id": 153911861,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506968969
    },
    {
        "content": "<p>I don't know. I  am not on the Argonaut project. I am not sure even where it is documented</p>",
        "id": 153911863,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506969032
    },
    {
        "content": "<p>Never mind I reread Rene's post above - is the same (Thanks Rene') link is above.</p>",
        "id": 153911865,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506969308
    },
    {
        "content": "<p>back to <span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span>'s original questions:<br>\n1) - i'm pretty sure that's an error in the spec. If an operation allows execution at the type level, it must explain what that means, and this doesn't, and I can't imagine how it could. So let's assume it will be removed as an option</p>\n<p>2) from a defnition of \"idempotence\":  'Note that while idempotent operations produce the same result on the server (no side effects), the response itself may not be the same (e.g. a resource's state may change between requests)'. - so, yes, the operation is idempotent in that sense. however if persist=true then the operation is not strictly idempotent. I'm not sure whether that's a problem or not. </p>\n<p>3) the sentence \"Note that since this is a search operation, the document bundle is wrapped inside the search bundle\" is bizarre and confusing. it's just wrong. Not one of my prouder moments. A big clue that it's wrong is that the example doesn't conform to it, nor does the definition</p>\n<p>4) The definition is also incorrect not to define a return parameter. </p>\n<p>Richard - it would be good if you create a task to correct the definition here</p>",
        "id": 153911953,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1506995591
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13987\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13987\">GF#13987</a></p>",
        "id": 153912014,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507011616
    },
    {
        "content": "<p>I see <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> got there first :-)</p>",
        "id": 153912154,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1507062878
    },
    {
        "content": "<p>Had some discussion about adding a url param to $document to resolve this. Please review<br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13987\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13987\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13987</a></p>",
        "id": 153912650,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507218493
    },
    {
        "content": "<p>Also we discussed adding a graph parameter to pass a GraphDefinition, and during that discussion there was near unanimous agreement within SDWG that the default behavior for $document should be to pull in the full transitive closure of all resources referenced from Composition, and that one would use GraphDefinition if they wish to restrict this behavior. We are looking for feedback on this though before approving since I know some (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ) have other opinions..</p>\n<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemBrowse&amp;feedback=Successfully+saved+changes+to+%5B%2313856%5D&amp;tracker_id=677&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemBrowse&amp;feedback=Successfully+saved+changes+to+%5B%2313856%5D&amp;tracker_id=677&amp;start=0\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemBrowse&amp;feedback=Successfully+saved+changes+to+%5B%2313856%5D&amp;tracker_id=677&amp;start=0</a></p>",
        "id": 153912654,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507219527
    },
    {
        "content": "<p>I think the default behaviour should be to include all the resources that a document is required to contain, since the full transitive closure can be very long indeed</p>",
        "id": 153912680,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507233140
    },
    {
        "content": "<p>Transitive closure isn't likely what you want.  For example: List-MedicationPrescription-&gt;Medication-&gt;Product(as ingredient)-&gt;Organization(as manufacturer)-&gt;Organization(parent)-&gt;EndPoint</p>",
        "id": 153912718,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507236873
    },
    {
        "content": "<p>You certainly want the prescription.  You <em>might</em> want the medication and maybe the product.  You almost certainly don't want the manufacturer's parent's endpoint</p>",
        "id": 153912719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507236905
    },
    {
        "content": "<p>In some cases, transitive closure could get you half the patient's EHR.  As well, there'll be times when you want Provenance or other records that point <em>to</em> a record (e.g. procedures that point to an Encounter) and you <em>definitely</em> don't want to do transitive closure of reverse includes - that definitively will give you the entire Patient's EHR.  GraphDefinition is the logical way to define the boundaries.</p>",
        "id": 153912720,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507237017
    },
    {
        "content": "<p>I disagree. Transitive closure is what you want in general when you are crafting a document. Sometimes you want to exclude stuff if you find you are getting too much. My point is the exclusions are edge cases, and usually you want the entire document as authored.</p>",
        "id": 153912727,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507238626
    },
    {
        "content": "<p>I think it depends on how well indexed and extensive the source you are generating from is</p>",
        "id": 153912728,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507238688
    },
    {
        "content": "<p>I think you've brushed some of Lloyd's concerns under the table too easily there</p>",
        "id": 153912729,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507238704
    },
    {
        "content": "<p>The worry about getting too much does not actually play out in practice. It is the typical (and sometimes valid) programmer fear of infinite recursions/loops. In practice, especially with documents, it doesn't actually play out that way, and I would encourage you to find examples of existing documents that actually cause problems instead of worrying about the possibility that they might.</p>",
        "id": 153912730,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507238745
    },
    {
        "content": "<p>Because documents that are missing data are an immediate problem right now (not hypothetical).</p>",
        "id": 153912731,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507238767
    },
    {
        "content": "<p>'existing documents'..... not sure what you mean. how does existing documents factor into the discussion?</p>",
        "id": 153912732,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507238789
    },
    {
        "content": "<p>Real world documents. Maybe try out the transitive closure approach on every Composition on all FHIR servers today and see how many (if any) actually pull in half the patient record.</p>",
        "id": 153912733,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507238851
    },
    {
        "content": "<p>from our point of view, this test is inadequate.To do a proper test, you would need to<br>\n- find an EHR system that supported $document<br>\n- find a production instance that had genuine records <br>\n- choose a patient with a chronic disease</p>",
        "id": 153912734,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239025
    },
    {
        "content": "<p>I suggest using ClinFhir to look at the resource graph for documents. It does not only pull in \"all the resources that a document is required to contain\" (which is what SDWG wants to redefine by the way), it does what $document should actually do. And I have never seen it explode.</p>",
        "id": 153912735,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239028
    },
    {
        "content": "<p>the nearest we have to this now is the synthea data set, but while it's very wide, it's also quite shallow compared to real records</p>",
        "id": 153912736,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239058
    },
    {
        "content": "<p>do you understand why Lloyd and I are not comforted by arguments based on mock data?</p>",
        "id": 153912737,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239116
    },
    {
        "content": "<p>Yes, but do you understand why I am not comforted by arbitrarily cutting off documents based on the potential of getting too much?</p>",
        "id": 153912738,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239184
    },
    {
        "content": "<p>Without even mock data to back it up?</p>",
        "id": 153912739,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239213
    },
    {
        "content": "<p>Simple example, what happens today when Composition.author points to PractitionerRole? What happens when a Medications section points to a List of MedicationStatement resources?</p>",
        "id": 153912740,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239303
    },
    {
        "content": "<p>seems to me that you want to say more here for a start: <a href=\"http://build.fhir.org/documents.html#content\" target=\"_blank\" title=\"http://build.fhir.org/documents.html#content\">http://build.fhir.org/documents.html#content</a></p>",
        "id": 153912741,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239413
    },
    {
        "content": "<p>From that page: The Composition resource, and any resources directly or indirectly (e.g. recursively) referenced from it</p>",
        "id": 153912742,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239491
    },
    {
        "content": "<p>Seems to say what we want already.</p>",
        "id": 153912743,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239505
    },
    {
        "content": "<p>this is the bit I was interested in:</p>",
        "id": 153912744,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239556
    },
    {
        "content": "<p>Any resource referenced directly in the Composition SHALL be included in the bundle when the document is assembled. Specifically, this means the following resource references:</p>\n<p>Composition.subject<br>\nComposition.encounter<br>\nComposition.author<br>\nComposition.attester.party<br>\nComposition.custodian<br>\nComposition.event.detail<br>\nComposition.section.entry<br>\nOther resources that these referenced resources refer to may also be included in the bundle if the document construction system chooses to do so. Including these additional resources will make the document bigger, but will save applications from needing to retrieve the linked resources if they need them while processing the document. Thus, whether these linked resources should be included or not depends on the implementation environment.</p>",
        "id": 153912745,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239559
    },
    {
        "content": "<p>you are quoting the outer limits, I am quoting the inner limits</p>",
        "id": 153912746,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239596
    },
    {
        "content": "<p>I think your comments imply that the inner limits should say a little more...</p>",
        "id": 153912747,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239619
    },
    {
        "content": "<p>That last paragraph is what SDWG is considering clarifying (edited: we did not actually discuss that paragraph specifically, we discussed what documents need to contain at a minimum in general), because that's just not how documents work today. I refer to my comments above about PractitionerRole and List as examples.</p>",
        "id": 153912748,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239693
    },
    {
        "content": "<p>In my opinion, inner limits = outer limits by default. You need to limit by exclusion. Today it is the opposite, you need to explicitly add what you want via a graph (assuming we add that param) vs. respecting what someone actually authored (or a system generated).</p>",
        "id": 153912749,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239819
    },
    {
        "content": "<p>I thought we were talking about how $document works. what SDWG considering clarifying exactly?</p>",
        "id": 153912751,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239891
    },
    {
        "content": "<p>Both. $document is not including enough, and the minimum requirements of a document do not require enough.</p>",
        "id": 153912753,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239927
    },
    {
        "content": "<p>And this is very valuable feedback to bring back to SDWG by the way, thanks.</p>",
        "id": 153912754,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507239950
    },
    {
        "content": "<p>ok. so the minimum requirements are the bit I quoted. You quoted the maximum allowed</p>",
        "id": 153912755,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507239962
    },
    {
        "content": "<p>what changes to the minimum limits for a document (as opposed to the default for $document) are we considering?</p>",
        "id": 153912756,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507240005
    },
    {
        "content": "<p>The consensus from today's discussion is that all referenced resources (recursive) is the desired default behavior for $document. I agree we have more work to do on the minimum allowable, which we did not discuss today.</p>",
        "id": 153912757,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507240066
    },
    {
        "content": "<p>And by the way on the SDWG call I was actually suggesting that we just implement the graph parameter, and find a simple way to create a GraphDefinition that represents the transitive closure, and the backlash was overwhelming.</p>",
        "id": 153912760,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507240174
    },
    {
        "content": "<p>well, ok. servers will just have to return an error if they think the graph size is getting out of hand. I typically call it a day at around 500 resources</p>",
        "id": 153912763,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507240314
    },
    {
        "content": "<p>I think a limit like that is reasonable. Maybe make that limit a parameter, and if unspecified it is a server-defined value in the CapabilitiesStatement somewhere?</p>",
        "id": 153912766,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507240381
    },
    {
        "content": "<p>And if you have a really large document (I once wrote a publishing system to handle A380 maintenance manuals if you want to talk big), then an implementer would need to write their own code to retrieve/traverse the resources individually and assemble the Bundle they want.</p>",
        "id": 153912773,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507241000
    },
    {
        "content": "<p>or they can ask the server manager out of band and get special approvals. I don't think that there's a lot of call for clinical documents that are that big</p>",
        "id": 153912774,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507241062
    },
    {
        "content": "<p>Agreed</p>",
        "id": 153912775,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507241078
    },
    {
        "content": "<p>But then again, you should take a look at some of the CCDs that I have seen. 60+ page \"summary\" documents come to mind. Would be happy to see them go away.</p>",
        "id": 153912777,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507241149
    },
    {
        "content": "<p>Anyway, signing off for now. Will check into this thread later tonight or tomorrow.</p>",
        "id": 153912778,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507241189
    },
    {
        "content": "<p>I've heard from users about CCD documents that are that big ;-)</p>",
        "id": 153912780,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507241271
    },
    {
        "content": "<p>Reminds me of a discussion in RIMBAA 7 years ago: <a href=\"http://wiki.hl7.org/index.php?title=Safe_querying_of_a_RIM-based_data_model\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Safe_querying_of_a_RIM-based_data_model\">http://wiki.hl7.org/index.php?title=Safe_querying_of_a_RIM-based_data_model</a> : (ok, v3 stuff, so some reading between the lines is necessary) who gets to decide what should be included in a document, is it the document creator, or the client requesting that a document be created? And how does one create 'clinically safe' ObjectGraphs, if such a thing is possible at all?</p>",
        "id": 153912817,
        "sender_full_name": "René Spronk",
        "timestamp": 1507282436
    },
    {
        "content": "<p>IMHO including everything and the kitchensink (as default behavior) is not the way to go, one would simply be flooded by too much data. When a server executes $document FHIR should provide a reasonable minimalistic definition as to what should be included, but leave the details to the server and its context. If a client explicitly provides a parameter to $document to indicate a specific ObjectGraph, or sets kitchensink=true, then that's the clients decision, which may or may not be supported by the server.</p>",
        "id": 153912818,
        "sender_full_name": "René Spronk",
        "timestamp": 1507282719
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> Remember that we are not talking about automated documents here. We are talking about bundling the references in the Composition as constructed. Someone could certainly construct a Composition that represents the kitchen sink (i.e. many CCDs), but there are other documents like a History and Physical, and Op Note, etc. that will very likely have deeply nested references with a finite (and rather small) closure. For what \"should\" be in a CCD or other document when you construct the Composition, I will refer to the output of the Relevant and Pertinent project (talk to Bob Dieterle and Keith Boone about that). </p>\n<p>What I am arguing here for is that the server not cut off a document after an arbitrary number of reference levels. But to Graphame's point, I think it is perfectly acceptable for a server to cut off document processing when it consumes too many server resources. This could be defined as using too much RAM, taking too much time, or as Grahame suggested when it has Bundled up 500+ resources and shows no sign of stopping. </p>\n<p>In other words, stop an actual runaway train, don't stop all trains arbitrarily because any train \"could\" run away.</p>",
        "id": 153912841,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507297257
    },
    {
        "content": "<p>I think the point is that the server gets to define the pattern they are willing to fulfill. Thus the pattern should be clear. The pattern should not cause a server to get to 'too big'. This would be poor planning. However it will happen, simply because reality....</p>",
        "id": 153912842,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507299774
    },
    {
        "content": "<p>We have run into cases where the requesting system can tell that the result is going to be 'too big' for the client to process. This seems to be a topic here. How does the client express some limits that the client can predict.  Clearly the client must handle gracefully whatever comes back, but if it can indicate a 'too big' limit, then the document creation can be more graceful. These should be marked as being a subset by client request. That said, some documents simply can't or should not be arbitrarily shortened based on a client request. These documents would not be 'complete' or 'whole' or 'authenticatible'..... They are intended to be statements of a 'document' and thus must be taken whole or not-at-all... so graceful degradation is needed.  right?</p>",
        "id": 153912843,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507300065
    },
    {
        "content": "<p>When FHIR resources are created, they get interlinked with all sorts of other content.  And none of that linking gets done with any thought as to how it will impact on document generation.   I think the notion of just arbitrarily traversing all links - especially if we do reverse links - is a really bad idea.  GraphDefinition is a much better solution.  It allows you to approach the problem from a design perspective - you consciously decide what should be included vs. not based on what relationships are relevant.</p>",
        "id": 153912848,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507309692
    },
    {
        "content": "<p>Even if traversing all links isn't always a problem, it's definitely going to be a problem in some systems and for some patients.  And reverse links are going to be relevant in some situations and there's no way you can traverse all of those without including the whole EHR.</p>",
        "id": 153912849,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507309752
    },
    {
        "content": "<p>How would document generation with or without use of GraphDefinition work with resources spread across servers?</p>",
        "id": 153912855,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507312022
    },
    {
        "content": "<p>Whether you're guided by transitive closure or graph definition, nothing in $composition prevents you from traversing servers as you gather relevant information - and in many environments, it may be necessary to span servers even to include the \"mandatory\" resources (those directly referenced from Composition).</p>",
        "id": 153912876,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507315456
    },
    {
        "content": "<p>Right, but traversing other servers to obtain resources to put in a response is not a \"normal\" FHIR behavior. In many ways this is a fancy search operation, and standard search doesn't traverse servers.</p>",
        "id": 153912878,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507315686
    },
    {
        "content": "<p>Should traversal, where necessary, be a requirement for this operation? Or should there be an explicit statement that \"there is no expectation of traversal\"? Or should we just remind people \"some document resources may live on other servers\" and let them figure out the approach they want?</p>",
        "id": 153912880,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507315854
    },
    {
        "content": "<p>I don't think of it like a search operation. My implementation is completely separate too. There is an engine that aggregates resources by following links in the resources. My implementation will not follow links to another server - but that is principally a management choice; following links on another server is conceptually equivalent</p>",
        "id": 153912881,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507315875
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'm not proposing doing reverse links. I agree that is a bad idea. As for forward links I think it is absolutely necessary if you want to be able to move a document between servers and persist the entire content for legal retention periods, especially when the original server may disappear over the course of seven or more years. I think requiring someone to first author a document, then create a GraphDefinition showing what they want in it is redundant. It's like authoring the document twice. Better to author the document once when you create the Composition, then if you find $document generates more than you want, use GraphDefinition to reduce the scope.</p>",
        "id": 153913153,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1507559933
    },
    {
        "content": "<p>If you want to persist a document for legal retention, you store the binary.  If you split the Bundle up into its constituent resources, you will almost certainly lose data and will lose the ability to validate any signatures.  Because when you store a resource RESTfully, there's no expectation you must be able to store all extensions or even core elements, nor is there any expectation that you'll order the resources in a reassembled Bundle in the same order they originally were.</p>",
        "id": 153913164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507562785
    },
    {
        "content": "<p>In any case, that's orthogonal to whether you want the transitive closure of inclusion.  And it doesn't address the fact that sometimes in a document you'll <em>want</em> to include a few _reverseinclude resources - e.g. Provenance.</p>",
        "id": 153913165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507562829
    },
    {
        "content": "<p>If you want to be able to <em>generate</em> a document, then you need a document definition that defines what goes in the document - which would be both a Composition and a GraphDefinition that sets out what content should be included vs. not.  The GraphDefinition allows the server to include the relevant data (and only the relevant data).  If you're manually crafting a document, then there's no need for GraphDefinition.</p>",
        "id": 153913166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507562917
    },
    {
        "content": "<p>Note if you do decompose a document into Resources, then the resulting Resources could have a Provenance record pointing to the original document received. Thus you both save the original document and you make the content available as FHIR resources.    THIS is what IHE has defined in the mXDE profile <a href=\"http://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction\" target=\"_blank\" title=\"http://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction\">http://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction</a>     Initially documented as doing this for CDA documents, but would work just as equally for FHIR documents, or any document that one can derive FHIR Resources from... The 'value-add' is the Provenance linkage back to the source 'document'....</p>",
        "id": 153913326,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507647583
    }
]