[
    {
        "content": "<p>According to the <a href=\"http://build.fhir.org/questionnaireresponse.html\" target=\"_blank\" title=\"http://build.fhir.org/questionnaireresponse.html\">QuestionniareResponse definition</a>: </p>\n<blockquote>\n<p>QuestionnaireResponse provides a complete or partial list of answers to a set of questions filled when responding to a questionnaire. The questions may be included directly or by reference to a Questionnaire resource that defines the questions as well as the constraints on the allowed answers. In some cases, both formal rules for editing the questionnaire (via link to Questionnaire) <strong>as well as sufficient local information to allow rendering of the questionnaire may be provided</strong>. </p>\n</blockquote>\n<p>We interpret it that, when the Questionnaire is not linked,  the questions answered must have the \"text\" property set. But how about the title of the questionnaire to respond? Since it also provide the contextual information such as \"<strong>Knee</strong> Paint Score\", we want it submitted if the Questionnaire is not linked in the response. Which property of the questionnaire response can be used? or we need to create an extension for it?</p>",
        "id": 153903788,
        "sender_full_name": "Terren Wu",
        "timestamp": 1503872102
    },
    {
        "content": "<p>You'd need to create an extension.  Or simply require your QuestionnaireResponse instances to point to their Questionnaire (which would be more typical behavior).</p>",
        "id": 153903794,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503891512
    },
    {
        "content": "<p>Is there any practical samples on how people use questionnaire response without a questionnaire definition? It is stated in the <a href=\"http://build.fhir.org/questionnaireresponse.html#notes\" target=\"_blank\" title=\"http://build.fhir.org/questionnaireresponse.html#notes\">Notes</a> that</p>\n<blockquote>\n<p>Because of the lack of explicit support for Questionnaires in HL7 v3 , CDA  Documents frequently used named sections with Observations to model questionnaires. Such use cases should now utilize the QuestionnaireResponse resource instead.</p>\n</blockquote>\n<p>Based on the current model of the questionnaire response, people seems cannot provide enough contextual information for the response (like Questionnaire title, and potentially questionnaire question type/options, etc.). Does people use an <strong>internal</strong> reference of a <strong>contained Questionnaire</strong> to provide such information in practise?</p>",
        "id": 153903887,
        "sender_full_name": "Terren Wu",
        "timestamp": 1503950652
    },
    {
        "content": "<p>I'm not sure anyone has used it without Questionnaire, so it's possible it's deficient there.</p>",
        "id": 153903899,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503960194
    },
    {
        "content": "<p>What's a Use case where you'd have a QuestionnaireResponse without an associated Questionnaire? Doesn't seem to be enough information in the QR to be useful alone...</p>",
        "id": 153904140,
        "sender_full_name": "David Hay",
        "timestamp": 1504146238
    },
    {
        "content": "<p>You've got the questions and the answers.</p>",
        "id": 153904144,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504146987
    },
    {
        "content": "<p>You mean 'out of band' - ie you are recording the questions in some structure other than a Questionnaire, and using the linkId to refer to them?</p>",
        "id": 153904146,
        "sender_full_name": "David Hay",
        "timestamp": 1504147159
    },
    {
        "content": "<p>Originally you could capture the responses to a paper questionnaire using QuestionnaireResponse without a formal QuestionnaireResponse.  However, now that we've made linkId mandatory, that doesn't make a lot of sense.  I guess we need a change request to make the Questionnaire reference mandatory too and to drop language about stand-alone responses.</p>",
        "id": 153904149,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504147789
    },
    {
        "content": "<p>you meant without a Questionnaire right?  Why not have an 'only use with Questionnaire' Profile instead.   Seems like a reasonable use as mechanism for recording answers.</p>",
        "id": 153904210,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504193578
    },
    {
        "content": "<p>Yes I meant without Questionnaire.  The fact linkId is mandatory means that we can't really get away without having Questionnaire.  And we made it mandatory because no-one had a use-case for not having the Questionnaire</p>",
        "id": 153904222,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504199797
    }
]