[
    {
        "content": "<p>When defining profile of type QuestionnaireResponse (as a response to a specific questionnaire), it makes sense to me to set linkIds as fixed values, as they need to be constant across all instances. Should then the corresponding questionnaire profile have the same level of granularity and have fixed values for linkIds as well, simply for documentation purposes?  I wasn't able to find more info about what are the current conventions, thanks for help in advance!</p>",
        "id": 169900052,
        "sender_full_name": "Halina Labikova",
        "timestamp": 1562615994
    },
    {
        "content": "<p>Generally you don't create Questionnaire-specific profiles.  The content of a Questionnaire is governed by the referenced Questionnaire, not  a profile.  Profiling QuestionnaireResponse makes sense if you want to enforce non-question-specific rules.  E.g. Q.subject must have \"reference\" or all answer.valueCodings must have display.</p>",
        "id": 169904657,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562619742
    },
    {
        "content": "<p>I think we need to make this clearer in the questionnaire, questionnaire response, structure definition and profiling pages. We get it enough still.</p>",
        "id": 170503091,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1562719694
    },
    {
        "content": "<p>care to submit a change request?</p>",
        "id": 170503129,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562719783
    },
    {
        "content": "<p>I have created profiles for Questionnaires and QuestionnaireResponses for HAI - one each for a group (population summary) form and one each for single-person event form. The single person specifies that you have to have a US Core Patient and specifies a code etc. - I feel like this makes sense.  Obviously all the forms are defined using instances...</p>",
        "id": 170508396,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1562728199
    },
    {
        "content": "<p>It's not wrong to profile these resources.  It's just wrong to define a questionnaire by profiling QR</p>",
        "id": 170577566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562790993
    }
]