[
    {
        "content": "<p>Hey,<br>\nwe currently implementing a Questionnaire with QuestionnaireResponse. We want to retrieve all QuestionnaireResponses to a patient and display the human readable\" title-\" element from the referenced Questionnaire without loading the Questionnaire itself. If we perfom \"GET [base]/QuestionnaireResponse?subject=[PatientID]\" we obtain all QuestionnaireResponse the patient has filled, we can't identify the different types of questionnaire resources.<br>\nIs it possible to do this with the existing structure or do we need to submit a changerequest for adding a type/name Element to the QuestionnaireResponse Ressource?</p>",
        "id": 153913595,
        "sender_full_name": "Julius Libramm",
        "timestamp": 1507806897
    },
    {
        "content": "<p>You could look at populating QuestionnaireResponse.questionnaire.display with the title, then you wouldn't need to resolve the reference.  If you don't have control over the authoring of the QuestionnaireResponses, then yes, you'd need to submit a change request, but that's a slipery slope so I don't know how the proposal would fare.</p>",
        "id": 153913601,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507809467
    },
    {
        "content": "<p>+1 on using the Display value in the reference<br>\n(Try and always be client friendly and put the display values in)</p>",
        "id": 153913988,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1508117742
    },
    {
        "content": "<p>Thanks a lot. As a workaround we now use the first item (linkID = title and type = display - maybe i add the hidden-extension) I think Lloyd's solution would be a little bit better.<br>\nFrom a consumer point of view a QuestionnaireResponse.title element would be the easiest solution (even if i understand what stands against it).</p>",
        "id": 153914117,
        "sender_full_name": "Julius Libramm",
        "timestamp": 1508168715
    },
    {
        "content": "<p>You're certainly free to submit a change request - \"Propose a change\" link at the bottom of each page in the spec.  Worst thing that can happen is you spend 5 minutes writing it up and the work group eventually says \"no\" or defines a standard extension.</p>",
        "id": 153914228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508198497
    },
    {
        "content": "<p>Yes, i'll submit one. Currently I'm waiting for the confirmation from GForge for a new account.</p>",
        "id": 153914368,
        "sender_full_name": "Julius Libramm",
        "timestamp": 1508230020
    },
    {
        "content": "<p>I accelerated that process.  You should be good to go :)</p>",
        "id": 153914434,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508250851
    }
]