[
    {
        "content": "<p>I'm trying to figure out how canonical URL's work with versioning.  We will have a Questionnaire that has id of PHQ-9  however as the form progresses it will have different versions.  </p>\n<p>When creating a QuestionnaireResponse and fill out the questionnaire property would it be \"Questionnaire/PHQ-9:{VERSION}\"?</p>\n<p>Just trying to wrap my head around canonical URL's and how they are handled with different versions (multiple Questionnaire's will have the same canonical URL, just different version)</p>",
        "id": 248544340,
        "sender_full_name": "Justin Jones",
        "timestamp": 1628201703
    },
    {
        "content": "<p>As per <a href=\"http://build.fhir.org/references.html#canonical\">this section</a> on canonical references, the syntax would be \"<a href=\"http://somewhere.org/Questionnaire/PHQ-9|Someversion\">http://somewhere.org/Questionnaire/PHQ-9|Someversion</a>\".  Canonical URLs must always be full URIs, they can't be relative.  The separator between URI and version is \"|\"</p>",
        "id": 248546138,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628202999
    },
    {
        "content": "<p>So Questionnaire.url will be \"<a href=\"http://somewhere.org/Questionnaire/PHQ-9\">http://somewhere.org/Questionnaire/PHQ-9</a>\"?  And then when referencing it from the QuestionnaireResponse.questionnaire that's when we add the |Someversion?</p>",
        "id": 248546478,
        "sender_full_name": "Justin Jones",
        "timestamp": 1628203280
    },
    {
        "content": "<p>Correct.  If you want to reference a specific version (which is a good idea), you concatenate Questionnaire.url and Questionnaire.version with '|' as a separator.</p>",
        "id": 248547995,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628204463
    },
    {
        "content": "<p>Is there somewhere in the spec where we call out that canonical URLs can't be relative?  I think it make sense to me why they can't be relative, but I couldn't find a spec reference either for or against it.  We just point out to xs:anyURI, and that mentions relative URIs but I can't really tell what it is trying to convey there.</p>",
        "id": 252358879,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631042740
    },
    {
        "content": "<p>what is a relative URI, from what I read is everything after the \":\"</p>",
        "id": 252363299,
        "sender_full_name": "Eric Haas",
        "timestamp": 1631044727
    },
    {
        "content": "<p>I'm not sure it's made explicit anywhere.  However, the whole point of a canonical URL is that it remains consistent across servers.  Anything short of a full URL wouldn't be safe for that purpose.  Feel free to submit a change request if you feel it's necessary <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>.</p>",
        "id": 252366366,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631046036
    }
]