[
    {
        "content": "<p>Hello there. We are currently profiling our German eNursing Summary (see <a href=\"https://simplifier.net/germanenursingsummary\" target=\"_blank\" title=\"https://simplifier.net/germanenursingsummary\">https://simplifier.net/germanenursingsummary</a>). For this we want to include advance directives, which we profiled as \"Consent\". Within an example I simply want to express \"The patient made an advance directive. His wife keeps the advance directive at home\". Now there are two issues I need to tackle:</p>\n<p>a) If I understand correctly, the wife is the custodian. Unfortunately a custodian can only be an organization. I profiled it so that a RelatedPerson can also be a custodian, but then my resources are not conform to the fhir-spec. Did I get that right? What else can I do to ensure that I can say \"The wife has the advance directive\"?</p>\n<p>b) Resources need either a policy or a policyRule. In my example I am not sure that I have one. What can I do?</p>\n<p>Thanks in advance!</p>",
        "id": 180007791,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1573024463
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span></p>",
        "id": 180008712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573025748
    },
    {
        "content": "<p>Advance Directives of this sort were never successfully modelled in R4 Consent and the scope has been removed for R5.  The information you wish to maintain can be held in an Observation better than attempting to work with the Consent resource.  I'm sorry we took you in the wrong direction.</p>",
        "id": 180026598,
        "sender_full_name": "David Pyke",
        "timestamp": 1573043340
    },
    {
        "content": "<p>No Problem, it is early enough to change it. <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> thank you. I'll change it tomorrow.</p>",
        "id": 180057555,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1573062178
    }
]