[
    {
        "content": "<p>Hello Friends,<br>\n   I have a webapp UI which accepts input from the user for 2 or more observation resources and when \"Save\" button clicked updates the FHIR resource /observation. The requirement is that I need to track each save operation like a history say save1. i.e. each save operation involve storing /observation resource1 version1, /observation resource2  version1 . Lets say the user updated 3 times, we have save1, save2, save3 in the history. <br>\nNow the user choose save2, I should display save2 corresponding /observation resource values in UI. <br>\nMy question is what is the best place to store the save history information. </p>\n<p>I am thinking to store the history object in Patient resource as an extension. Is this approach correct ?. <br>\nIs any other resource will be better and how should I store it i.e. extension etc.. ?<br>\nCould you please give me some ideas?. <br>\nthanks <br>\nNath</p>",
        "id": 186025929,
        "sender_full_name": "Nath",
        "timestamp": 1579410567
    },
    {
        "content": "<p>Why wouldn't you just use the built in history capability and store each version?  If the version 'chooses' save 2, then create version 4 which is a mirror of what version 2 was.</p>",
        "id": 186027482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579414024
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . I assume when you said \"builtin history\", this is the history for each resource. Right?.  The issue here is that UI Panel contains not just one single resource. UI Panel contains 2 or more observation/encounter/procedure etc.. resources and at the end there is a button \"Save\". For example, UI has 2 resources R1 and R2. Now when \"Save\" button clicked, both R1 and R2 is saved. So, somewhere I should store \"Save1\"  which represents the version that was saved for each resource. So, this is storing version history for group of resources where resource can be anything encounter or procedure or observation.. Hope this clarifies.</p>",
        "id": 186043163,
        "sender_full_name": "Nath",
        "timestamp": 1579445648
    },
    {
        "content": "<p>Saving the history through an extension seems to be bad practice. Why you don't just use a Bundle to point to your UI Components?<br>\nThen you can  choose a Version of the Bundle and this version has version aware links to the actual resources.</p>",
        "id": 186046685,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1579452278
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> . Sorry I am new to FHIR and with limited knowlege I had, for some reason I thought bundle was not persisted in the storage.The reason being that I saw bundle usage more in search where returnBundle(..) so I always thought its a wrapper resource to return search results. If bundle is like any other resource persisted, then I can use the bundle and version. thanks all for your kind help.</p>",
        "id": 186050156,
        "sender_full_name": "Nath",
        "timestamp": 1579458585
    },
    {
        "content": "<p>Bundle or List are possibilities.  Bundles aren't persisted when submitting a transaction or messages, but they're certainly stored when you use them for Bundles or Collections.  Whether you choose to use Bundle or List depends on whether you want the versions to be contained or not</p>",
        "id": 186050254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579458727
    },
    {
        "content": "<p>Oh i made a mistake in my last post. I meant the Composition Resource</p>",
        "id": 186050255,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1579458731
    },
    {
        "content": "<p>You could use it to point to the relevant resources. Or as Lloyd mentioned a List resource. Both will provide better searchability as your resources are not „hidden“ behind a Bundle</p>",
        "id": 186050277,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1579458824
    },
    {
        "content": "<p>thank you so much <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for your kind help and idea. truly appreciate it.  I looked at Composition and List. </p>\n<p>I looked at List  and that seems to contain entry array <br>\n \"entry\" : [{ // C? Entries in the list<br>\n    \"flag\" : { CodeableConcept }, // Status/Workflow information about this item<br>\n    \"deleted\" : &lt;boolean&gt;, // C? If this item is actually marked as deleted<br>\n    \"date\" : \"&lt;dateTime&gt;\", // When item added to list<br>\n    \"item\" : { Reference(Any) } // R!  Actual entry<br>\n  }],<br>\nComposition seem to contain sections array. </p>\n<p>Is FHIR Composition more like OO composition (i.e. lifetime of contained depends on the container)?<br>\nSorry still not able to understand difference between List vs Composition vs Bundle . </p>\n<p>Can you please kindly elaborate this line \"Whether you choose to use Bundle or List depends on whether you want the versions to be contained or not\". <br>\n I would like the versions of the contained resources stored in either List or Composition. So, which resource contains versions? Is it List or Bundle or Composition</p>",
        "id": 186056098,
        "sender_full_name": "Nath",
        "timestamp": 1579468166
    },
    {
        "content": "<p>List is a flat collection with optional ordering.  Composition is a hierarchical ordering with tight control over rendering, typically used for creating documents.  Both of them organize by referencing their content, not packaging it directly.  Bundle is a physical organizer.  It has no meaning of its own, but it allows packaging of resources to ship them around as a group.  A FHIR document is actually a FHIR Bundle that starts with a Composition resource (that defines the hierarchy and the rendering) along with whatever other resources are relevant.</p>",
        "id": 186062299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579476532
    },
    {
        "content": "<p>thank you so much <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  for explaining and it helped me choose the type.</p>",
        "id": 186065459,
        "sender_full_name": "Nath",
        "timestamp": 1579481458
    },
    {
        "content": "<p>Why not use <a href=\"http://build.fhir.org/provenance.html\" target=\"_blank\" title=\"http://build.fhir.org/provenance.html\">Provenance</a> here?</p>",
        "id": 186079001,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1579505486
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> . Seems like Provenance resource is a better choice. Let me read up more.</p>",
        "id": 186114912,
        "sender_full_name": "Nath",
        "timestamp": 1579536997
    }
]