[
    {
        "content": "<p>I'm going to associate a QuestionnaireResponse to a Questionnaire in Java. I'm importing the QuestionnaireResponse model from <code>org.hl7.fhir.r4.model.QuestionnaireResponse</code>. The QuestionnaireResponse model has a function called <code>setQuestionnaire(String value)</code> which takes a string value. I have the related questionnaire's identifier but not its logical id (the id created by the FHIR server). is that possible/valid to associate the QuestionnaireResponse to the Questionnaire like the following?</p>\n<div class=\"codehilite\"><pre><span></span><code>QuestionnaireResponse qr = new QuestionnaireResponse();\nString some_identifier = &quot;1234&quot;;\nqr.setQuestionnaire(&quot;http://localhost:some_port/Questionnaire?identifier=&quot; + some_identifier));\n</code></pre></div>",
        "id": 272416338,
        "sender_full_name": "Mohsen Jafari",
        "timestamp": 1645198647
    },
    {
        "content": "<p>No.  The QuestionnaireResponse.questionnaire element is a canonical.  It MUST be a canonical reference to the Questionnaire - i.e. the Questionnaire.url or the Questionnaire.url + version (separated by '|').</p>",
        "id": 272417147,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645199019
    },
    {
        "content": "<p>You can't point to a Questionnaire by .identifier.</p>",
        "id": 272417168,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645199031
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/QuestionnaireResponse.2Equestionnaire.20element/near/272417147\">said</a>:</p>\n<blockquote>\n<p>No.  The QuestionnaireResponse.questionnaire element is a canonical.  It MUST be a canonical reference to the Questionnaire - i.e. the Questionnaire.url or the Questionnaire.url + version (separated by '|').</p>\n</blockquote>\n<p>As far as I understood, the Questionnaire.url is a URI, and a URI's structure should follow the format <code>scheme:[//authority]path[?query][#fragment]</code>. In this case, if I have already set the Questionnaire.url to, for example, <code>http://localhost:some_port/Questionnaire?identifier=1234\"</code> then can't I set the same string for the QuestionnaireResponse.questionnaire using the above-mentioned code? If not, so how can I associate my QuestionnaireResponse to its Questionnaire? And could you clarify/explain the canonical stuff? I have read a lot but still don't understand and confused completely.</p>",
        "id": 272419221,
        "sender_full_name": "Mohsen Jafari",
        "timestamp": 1645199984
    },
    {
        "content": "<p>The objective of the Questionnaire.url is to ensure that it can't ever collide with any other Questionnaire defined on any other system anywhere.  While \"<a href=\"http://localhost\">http://localhost</a>\" is certainly a legal URL, it'd be a very bad idea to use as the root of the url of a CanonicalResource because there's no control over that namespace and the chances of ending up with a collision are high.  Simply assign the Questionnaire a url in a space that you control.  It's nice if the URL resolves, but it isn't critical.</p>",
        "id": 272424498,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645202479
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/QuestionnaireResponse.2Equestionnaire.20element/near/272424498\">said</a>:</p>\n<blockquote>\n<p>The objective of the Questionnaire.url is to ensure that it can't ever collide with any other Questionnaire defined on any other system anywhere.</p>\n</blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , while I understand what you're trying to say, I think the way you've said it actually conveys the opposite meaning. Questionnaire.url is essentially a special-case business identifier for the resource. Questionnaires and several other \"knowledge\" or \"definitional\" resources will typically be copied to multiple servers (e.g., you and I both copy a questionnaire from the questionnaire publishing organization), but this \"canonical\" identifier will stay constant in all locations. Think of canonical as an identifier that just happens to be expressed in the format of a URL. There is no particular meaning in the URL, it's just a name. This is in contrast to the <a href=\"http://Questionnaire.id\">Questionnaire.id</a> which may vary from server to server (and when combined with the server's base service url, <em>must</em> vary from server to server). Identifying a Questionnaire by canonical lets my app, for example, perform the same search on multiple servers for QuestionnaireResponses to a given Questionnaire, and I don't need to be concerned with what the local id for that Questionnaire is (or even if it is present on every server).</p>",
        "id": 272430706,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1645205260
    },
    {
        "content": "<p>Dear <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>, therefore, am I allowed to set, for example, <code>http//localhost:some_port/Questionnaire?identifier=1234</code> to my <code>Questionnaire.url</code> and set the same <code>http//localhost:some_port/Questionnaire?identifier=1234</code> to my <code>QuestionnaireResponse.questionnaire</code> to associate the QuesionnaireResponse to the Questionnaire ?</p>",
        "id": 272506157,
        "sender_full_name": "Mohsen Jafari",
        "timestamp": 1645262738
    },
    {
        "content": "<p>The purpose of Questionnaire.url is to uniquely identify the questionnaire across all systems throughout the world.  A localhost-based URL won't do that.  While it's not non-compliant to use it, it's not a good idea.  It's better to have a url that doesn't resolve than one that might end up not being truly unique.</p>\n<p>To find a referenced Questionnaire you do a search on the server based on url (and possibly version).  If you don't find the Questionnaire on your local server, you search on whatever your 'preferred' registries are to see if you can find it there.  Only in the event that you can't find the Questionnaire locally or on any registry would you try to resolve the canonical URL - and there's no guarantee it'll resolve or that you'll have access.</p>",
        "id": 272538005,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645299605
    }
]