[
    {
        "content": "<p>Hi,</p>\n<p>Is there a known mismatch between the java xmlparser to <a href=\"http://hapifhir.io/apidocs-dstu3/org/hl7/fhir/dstu3/model/Questionnaire.html\" target=\"_blank\" title=\"http://hapifhir.io/apidocs-dstu3/org/hl7/fhir/dstu3/model/Questionnaire.html\">http://hapifhir.io/apidocs-dstu3/org/hl7/fhir/dstu3/model/Questionnaire.html</a> and the validator? The class docs show that Questionnaire is derived from MetadataResource but it seems to be derived directly from DomainResource in my experience in java. <br>\nThe issue is that there seems to be a 'dispute' between PublicationStatus &amp; QuestionnaireStatus when parsing, the java parser expects the status to be \"published\" but the post to HAPI via java (or posting with postman) expects it to be \"active\". Is it just the documentation that is wrong or is there a known issue?</p>\n<p>Cheers,<br>\nStephen</p>",
        "id": 153897923,
        "sender_full_name": "Stephen Lloyd",
        "timestamp": 1500898153
    },
    {
        "content": "<p>The formal parent is DomainResource.  MetadataResource is a pattern that's used in the publication process for alignment and re-use, but doesn't reflect a formal inheritance relationship.</p>",
        "id": 153897966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500923349
    },
    {
        "content": "<p>that doesn't actually answer the question though</p>",
        "id": 153898003,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500951318
    },
    {
        "content": "<p>\"active\" is correct.  If hapi is expecting something else - and you're using the STU3 version, something is broken.</p>",
        "id": 153898006,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500956931
    },
    {
        "content": "<p>I think I've found the problem (&amp; it's me, well I don't want to claim all the credit so \"us\" :) ), it appears there was a mismatch between the server &amp; the pom dependencies. I was using the maven version 2.3 for the java dependencies which seemed to still use QuestionnaireStatus. Thanks for the information.</p>",
        "id": 153898042,
        "sender_full_name": "Stephen Lloyd",
        "timestamp": 1500980068
    }
]