[
    {
        "content": "<p>I'm stucking at the questionnaire's specification and its items of item type multiple choice.  When i've got an item with several options for me it's not clear what the default value for the minimum and maximum number of chooseable options is. Is it meant to be as there's only one choosable option or am if free to answer as many options as possible by default? And next to this issue: When i want to give those special items a limitation of answerable options am i right to do this using the ElementDefinition's min/max elements?</p>",
        "id": 153921475,
        "sender_full_name": "Luca Hollenberg",
        "timestamp": 1511528906
    },
    {
        "content": "<p>ElementDefinition is for StructureDefinitions.<br>\nFor the Questionnaire you should use the <a href=\"http://hl7.org/fhir/extension-questionnaire-maxoccurs.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-questionnaire-maxoccurs.html\">http://hl7.org/fhir/extension-questionnaire-maxoccurs.html</a> extension to indicate the maximum number of multiple choice options selecting.<br>\nThere is also an exclusive option selection<br>\n<a href=\"http://hl7.org/fhir/extension-questionnaire-optionexclusive.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-questionnaire-optionexclusive.html\">http://hl7.org/fhir/extension-questionnaire-optionexclusive.html</a></p>",
        "id": 153921476,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1511529135
    },
    {
        "content": "<p>To permit multiple choice options, just select the repeats for the question that you want to permit multiple answers.</p>",
        "id": 153921477,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1511529195
    },
    {
        "content": "<p>What does \"select the repeats\" mean? You mean the <code>repeats</code> boolean? The documentation for that value is a bit vague. So if <code>repeats</code> is false that's the same as maxOccurs = 1?</p>",
        "id": 153921478,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1511530276
    },
    {
        "content": "<p>At the moment we have implemented multiple choice questions in the following way:</p>\n<p>1) \"Radio button\" multiple choice questions: the <code>option</code> array size &gt; 0 and <code>repeats = false</code><br>\n2) \"Checkbox\" multiple choice questions: the <code>option</code> array size &gt; 0 and <code>repeats = true</code></p>\n<p>Is this correct? We are basically interested in implementing maxOccurs = 1 and maxOccurs = Infinity, so is the information above enough and follows the standard? Or do we need the extension as well?</p>",
        "id": 153921479,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1511530616
    },
    {
        "content": "<p>If you just want maxOccurs = 1 and maxOccurs = infinity, the repeats boolean is all you need.  The extension is when you want to say things like \"choose at least two, but no more than 4\".</p>",
        "id": 153921484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511532608
    },
    {
        "content": "<p>Great! Having just looked at the description of <code>repeats</code> in the docs again, I still think it's not very easy to get what the boolean does. But I guess someone else has been asking this question here before me, since our implementation does seem to be correct :)</p>",
        "id": 153921486,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1511533371
    },
    {
        "content": "<p>If you have suggestions that would clarify the description, those are always welcome :)  Just click on the \"propose a change\" link at the bottom of any page in the spec.  There's a one-time (free) registration after which you can propose any changes you wish.</p>",
        "id": 153921494,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511533862
    },
    {
        "content": "<p>I'll do that!</p>",
        "id": 153921495,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1511533900
    },
    {
        "content": "<p>Yep, radio and checkbox we do the same way!</p>",
        "id": 153921588,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1511696057
    }
]