[
    {
        "content": "<p>I am new to FHIR resource, I need to create a simple survey form with questions and answers for preliminary screening using observation resource. But all observation resources of having code how to create a new set of code to handle questions with answers. kindly provide any sample.</p>",
        "id": 237612380,
        "sender_full_name": "Radhakrishnan",
        "timestamp": 1620283203
    },
    {
        "content": "<p>Hi &amp; welcome <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> In FHIR, a survey/questionnaire is captured using an instance of the <a href=\"http://hl7.org/fhir/R4/questionnaire.html\">Questionnaire resource</a>. The matching answers would then come in the form of <a href=\"http://hl7.org/fhir/R4/questionnaireresponse.html\">QuestionnaireResponse resources</a>. Once you have a QuestionnaireResponse, you can map it to appropriate other resources, such as Observation. I believe there are guidelines for this in the <a href=\"http://build.fhir.org/ig/HL7/sdc/index.html\">Structured Data Capture (SDC) Implementation guide</a>, see in particular the <a href=\"http://build.fhir.org/ig/HL7/sdc/extraction.html\">section on data extraction</a>.</p>",
        "id": 237614624,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1620284759
    },
    {
        "content": "<p>Thanks a lot, I am looking into the urls which you had mentioned,   Does this can be done programmatically or manually to map the questionnaire response  resource to the Observation resource</p>",
        "id": 237638121,
        "sender_full_name": "Radhakrishnan",
        "timestamp": 1620297872
    },
    {
        "content": "<p>The mapping QuestionnaireResponse --&gt; Observation can be done programatically, but the mapping itself  must of course be defined beforehand (cf. the various extraction methods discussed in the SDC implementation guide e.g. <a href=\"http://build.fhir.org/ig/HL7/sdc/extraction.html#observation-based-extraction\">the section on observation-based extraction</a>).However, I must confess that I am not an expert on the details of this &amp; to which extent \"canned logic\" exists. For existing tools/libraries to support this, see e.g. <a href=\"https://confluence.hl7.org/display/FHIRI/SDC+Implementations\">this list of SDC tooling</a>.</p>\n<p>BTW, it is of course also possible to create e.g. Observations resources directly from app input without going via Questionnaire/QuestionnaireResponse, but the latter give a clear specification of what is being asked &amp; a format for capturing the \"raw\" data. There are also a number of standard libraries for designing Questionnaire resources and/or generating a survey UI from a Questionnaire resource &amp; capturing the answers - see the the SDC tool page I linked above.</p>",
        "id": 237660080,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1620308752
    }
]