[
    {
        "content": "<p>I'm not sure if this is the right place for this.<br>\nSection 2.27.4 of the base specification seems to be worded incorrectly.  the third sentence says that \"Searching for extensions is the same... \" but the first two sentences were about searching for extensions.  Is the third sentence referring to a different type of extension?</p>",
        "id": 213973761,
        "sender_full_name": "Joan Harper",
        "timestamp": 1603224944
    },
    {
        "content": "<p>First, I think you refers to FHIR R4. <a href=\"http://hl7.org/fhir/domainresource.html#search\">http://hl7.org/fhir/domainresource.html#search</a> <br>\n\"All other search parameters are named aliases for existing content in the resource ... Searching for extensions is the same ...\" The first part states how a search parameter on regular resource is name. The second part states that a search parameter for extension follows the same pattern.</p>",
        "id": 213981457,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603229175
    },
    {
        "content": "<p>Yes.  That is what I am referring to, although when looking again, it is the 4th sentence that I am questioning.  The full text of that section is:</p>\n<p>To search for extensions, define a SearchParameter for the extension. All other search parameters are named aliases for existing content in the resource. In some cases, though not all, the search parameter name is the same as the element that it searches, but this is not required. Searching for extensions is the same - define a name that identifies the value extension by its URL, and then searches can filter based on the value of the extension.</p>\n<p>Sentence #1 says \"To search for extensions ...\"<br>\nSentence #4 says \"Searching for extensions is the same ...\"</p>\n<p>My question is - are there multiple types of extensions? or perhaps multiple types of searches? <br>\nI'm pretty new to FHIR, so I am working my way through the Foundation Module as a start.</p>",
        "id": 213983880,
        "sender_full_name": "Joan Harper",
        "timestamp": 1603230627
    },
    {
        "content": "<p>There's only one kind of extension. \"Searching for extensions is the same\" connects to the overall idea of search parameters - like other search parameters, a search parameter defined for an extension is an alias from a name (typically a short lowercase word) to a path in the resource, which for an extension is identified by its URL.</p>",
        "id": 213984862,
        "sender_full_name": "Paul Church",
        "timestamp": 1603231152
    },
    {
        "content": "<p>So is this just poorly worded?</p>\n<p>To set up searching, you would define a SearchParameter for the extension.  Then the extension could be searched by the SearchParameter or a named alias (which is a URL)?</p>\n<p>Am I on the right track?</p>",
        "id": 213985568,
        "sender_full_name": "Joan Harper",
        "timestamp": 1603231568
    },
    {
        "content": "<p>Yes, the wording is a bit odd but I don't think it's incorrect.</p>\n<p>Search is always done by a named alias, which is a word or multiple-dashed-words. A SearchParameter is the metadata resource that defines an alias and what it means. The URL is the identity of the extension, which is referred to in the SearchParameter - it's not what you'd put in the search query.</p>",
        "id": 213986445,
        "sender_full_name": "Paul Church",
        "timestamp": 1603232145
    },
    {
        "content": "<p>Thank you for the explanation</p>",
        "id": 213986723,
        "sender_full_name": "Joan Harper",
        "timestamp": 1603232336
    }
]