[
    {
        "content": "<p>I notice the base profile doesn't indicate how a consumer might query based on an answer to a particular question. Curious if this has received any discussion or if someone has implemented a solution.</p>",
        "id": 153852606,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1476208044
    },
    {
        "content": "<p>I don't recall it being discussed</p>",
        "id": 153852611,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476213058
    },
    {
        "content": "<p>None that I'm aware of either.</p>",
        "id": 153852628,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476222829
    },
    {
        "content": "<p>I always thought each question and answer should be a resource  you could mix and match to make questionnaires and search individual answers.   But then it probably gets too unwieldy. </p>",
        "id": 153852654,
        "sender_full_name": "Eric Haas",
        "timestamp": 1476230193
    },
    {
        "content": "<p>Sounds more like an observation then.</p>",
        "id": 153852658,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476235259
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191619\">@Peter Bernhardt</span>, did you mean that you want an individual answer back, or the set of QuestionnaireResponses that have included that answer to a specific question?</p>",
        "id": 153852659,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476235329
    },
    {
        "content": "<p>It's been discussed.  The general perspective is that Questionnaire is for raw capture, but not for retrieval/analysis.  General expectation is that if you want to analysis/filtering/query, you migrate the data into the appropriate resource type (Observation, MedicationStatement, FamilyHistory, whatever).  Querying by questions is actually quite tricky because you may care about the context of other questions to filter and it gets ugly pretty fast.  You can always define custom search criteria if you really need the functionality</p>",
        "id": 153852828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476416946
    }
]