[
    {
        "content": "<p>I'm working on a laboratory order questionnaire and questionnaireresponse. The questionnaire should present a list of several analytes, which the user should be able to choice, multiple choice must be possible. So the list is represented as item of type group, with a nested item of type choice, containing some analytes as answerOptions. The Questionnaireresponse has exactly the same structure, i.e. an item and a nested item with the corresponding linkID's and in between the nested item the answers the user had selected. But the Publisher gives me an error \"Items not of type group should not have items outside answers (use answer.item not .item)\". Any help is welcome, thx.   [questionnaireresponse.xml] (<a href=\"user_uploads/10155/AXp784LQCqnFuoA_WPCD3nR7/questionnaireresponse.xml\">https://chat.fhir.org/user_uploads/10155/AXp784LQCqnFuoA_WPCD3nR7/questionnaireresponse.xml</a>)</p>",
        "id": 219631789,
        "sender_full_name": "Marcel Hanselmann",
        "timestamp": 1607706144
    },
    {
        "content": "<p>Based on the error:  \"Items not of type group should not have items outside answers (use answer.item not .item\"  I suspectg you are linking and answer to a group item not an answer item. Verify that  the structure do indeed match,  that was a challenge for me when I created QRs..</p>",
        "id": 219657183,
        "sender_full_name": "Eric Haas",
        "timestamp": 1607718173
    },
    {
        "content": "<p>Thank you for the rapid answer. And the structure of Q and QR are congruent I think, look at the attached file. There must be an other issue.</p>",
        "id": 219700438,
        "sender_full_name": "Marcel Hanselmann",
        "timestamp": 1607766529
    },
    {
        "content": "<p>Can you provide the full instances?</p>",
        "id": 219712399,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607785350
    },
    {
        "content": "<p>There is indeed an other issue, I'm searching for a solution. Thank you for help!</p>",
        "id": 219803747,
        "sender_full_name": "Marcel Hanselmann",
        "timestamp": 1607926211
    },
    {
        "content": "<p>The files you posted were trimmed.  I'm asking if you can share the full questionnaire and full questionnaireResponse</p>",
        "id": 219807603,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607931083
    }
]