[
    {
        "content": "<p>I am building a questionnaire, in building the items(questions) is my thinking correct for how to use a valueset to serve as possible answers.  For example, if I want to offer yes/no/unknown as three possible responses, do I set the \"item/answer/value[x]\" to the element property \"Reference(Resource) and associate it to a valuset resource which contains that list or includes that list?  Or is there a more direct/better way?  I want to be able to dynamically populate the UI with the answer options without hardcoding it somewhere outside of the resource.  That is the idea, correct?</p>",
        "id": 277165161,
        "sender_full_name": "Marla Albitz",
        "timestamp": 1648655483
    },
    {
        "content": "<p>Set the field Questionnaire.item.answerValueSet to  the canonical of the ValueSet from which the answers should come.</p>",
        "id": 277166962,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1648656222
    },
    {
        "content": "<p>Thank you, yes, so I found an example of that on the Questionaire resource page. What confuses me about that is that link takes me to a page that appears to not be computer parsable, only human readable. Am I missing something?   \"item\": [<br>\n        {<br>\n          \"linkId\": \"1.1\",<br>\n          \"code\": [<br>\n            {<br>\n              \"system\": \"<a href=\"http://example.org/system/code/questions\">http://example.org/system/code/questions</a>\",<br>\n              \"code\": \"COMORB\"<br>\n            }<br>\n          ],<br>\n          \"prefix\": \"1\",<br>\n          \"type\": \"coding\",<br>\n          \"answerValueSet\": \"<a href=\"http://hl7.org/fhir/ValueSet/yesnodontknow\">http://hl7.org/fhir/ValueSet/yesnodontknow</a>\",</p>",
        "id": 277169170,
        "sender_full_name": "Marla Albitz",
        "timestamp": 1648657164
    },
    {
        "content": "<p>answerValueSet is of type 'canonical'.  That means you point to the URL (possibly with version) of the ValueSet of interest.  There is no requirement that the URL resolve at all (it's technically a uri), though we strongly prefer that it at least resolves to something human-readable.  Most ideally, it will resolve to an appropriate FHIR resource representation if you pass the appropriate 'Accept' header.  (That will happen for HL7 value sets.)  However, resolving the canonical is only done as a last resort.  The first thing you typically do is perform a local search and a check against your preferred registries for the resource.  You only try to resolve the URL if you can't find it elsewhere.  This approach is true for all canonicals - including QuestionnaireResponse.questionnaire, Resource.meta.profile, and lots of other places.</p>",
        "id": 277175107,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648659441
    },
    {
        "content": "<p>Thank you Lloyd, where is a FHIR-speak to English translator when you need one.   You have given me a lot to unpack</p>",
        "id": 277183046,
        "sender_full_name": "Marla Albitz",
        "timestamp": 1648662972
    },
    {
        "content": "<p>Sorry :)</p>\n<p>TLDR version: value set references don't have to resolve, though it's nice if they do.  (And to get them to resolve computably, you need to populate the Accept header)</p>",
        "id": 277198695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648670965
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 277454522,
        "sender_full_name": "Marla Albitz",
        "timestamp": 1648835170
    },
    {
        "content": "<p>How to validate answers against such external ValueSet? Is that possible at all?</p>",
        "id": 278038002,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1649257718
    },
    {
        "content": "<p>Retrieve the value set as you would typically retrieve any canonical resource (look for it locally, then in any preferred registries or terminology services (also check terminology services mentioned in the Questionnaire itself - if you trust them) and, as a last resort, try resolving the canonical URL (again, if your security policy allows).  Provided that you've successfully retrieved the value set, then expand it or get a terminology service to do that for you.  (Note that you might delegate the retrieval of the value set to a terminology service too.)</p>",
        "id": 278051683,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649263127
    }
]