[
    {
        "content": "<p>I'm using HAPI 1.4 and am unable to pass a Patient's or Contract's resource id that I set in the client to the server.  The resource id at the server side is always being shown as NULL.  Everything else I set in the resource (i.e., identifiers, contained resources, etc) at the client side is being passed through correctly.  My code snippet is below:</p>\n<div class=\"codehilite\"><pre>        Patient pat = new Patient();\n        pat.addName().addFamily(&quot;SMITH&quot;).addGiven(&quot;ANDREW&quot;);\n        pat.setId(new IdDt(&quot;hello&quot;));\n\n        // SSN\n        pat.addIdentifier().setSystem(uriPrefix + &quot;2.16.840.1.113883.4.1&quot;).setValue(&quot;123-45-6789&quot;);\n\n        pat.setGender(AdministrativeGenderEnum.MALE);\n</pre></div>\n\n\n<p>...</p>\n<p>Similar code for setting a Contract resource exhibits the same behavior.  Is this expected?</p>",
        "id": 153834082,
        "sender_full_name": "Anthony Sute ",
        "timestamp": 1466612748
    },
    {
        "content": "<p>Hi Anthony, I assume this <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>  might be able to clarify the HAPI 1.4 implementation.  As far as the resource logical id is concerned, the spec does imply that \"server that stores the resource\" is always responsible for creating the logical id. The API should probably give you some warning if your client is passing a data element (<a href=\"http://Patient.id\" target=\"_blank\" title=\"http://Patient.id\">Patient.id</a>) that is not supposed. It appears to be ignoring the id set by client.</p>",
        "id": 153834095,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1466621583
    },
    {
        "content": "<p>Setting the ID on a create is actually not allowed, per FHIR's rules. HAPI's client is trying to be helpful here by not sending the ID since it would be invalid.</p>\n<p>If you want to create something but supply the ID yourself, that's still an update according to FHIR's rules so you can do that with the HAPI client's <code>update()</code> method.</p>",
        "id": 153834160,
        "sender_full_name": "James Agnew",
        "timestamp": 1466625570
    },
    {
        "content": "<p>Thanks James for the clarification.</p>",
        "id": 153834206,
        "sender_full_name": "Anthony Sute ",
        "timestamp": 1466634987
    }
]