[
    {
        "content": "<p>The documentation for Coded Values, Systems, and Value Sets posted at <a href=\"https://www.hl7.org/fhir/terminologies.html#valuesets\" target=\"_blank\" title=\"https://www.hl7.org/fhir/terminologies.html#valuesets\">https://www.hl7.org/fhir/terminologies.html#valuesets</a> indicates that codes are pairs: a code and a system.  Shouldn't a code be a triplet: a code, a system, and a version?  One example of where this is functionally relevant would be validation.  A Code can exist in one version of a system and not an other.  How is this distinction made?  Is it something in the url for the system?  If this is the case what is the version attribute of Coding used for (<a href=\"https://www.hl7.org/fhir/datatypes.html#Coding\" target=\"_blank\" title=\"https://www.hl7.org/fhir/datatypes.html#Coding\">https://www.hl7.org/fhir/datatypes.html#Coding</a>)?  Can the documentation be extended to include an example of specifying a Coding from a specific version of a Coding System?  </p>",
        "id": 153893102,
        "sender_full_name": "John Gresh",
        "timestamp": 1497013607
    },
    {
        "content": "<p>The <em>meaning</em> can generally be extracted from just the pair as most systems don't significantly change the meaning of concepts between versions.  That said, version can be identified as part of the Coding data type if it's necessary - i.e. if the version significantly affects the interpretation of the code.</p>",
        "id": 153893113,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497015744
    },
    {
        "content": "<p>we could clarify that sentence to mention version as well. </p>",
        "id": 153893167,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497047037
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192018\">@John Gresh</span> Would you be willing to submit a change proposal?</p>",
        "id": 153893189,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497070918
    }
]