[
    {
        "content": "<p>We are currently developing a Questionnaire repository on a national level. The Questionnaires in this repository is meant for patients to use in various contexts, and to be filled in the context of the national Patient Portal that holds a Questionnaire render/filler.</p>\n<p>The Questionnaire repository will hold resources like Questionnaire, ValueSet, DocumentReference (attachments to the Questionnaires), Endpoint, etc. </p>\n<p>The requirements specify several attributes related to the context of the Questionnaire, that are specific to the requirements in the project. These attributes are:</p>\n<p>•   Questionnaire owner <br>\n•   Who can use the Questionnaire?<br>\n        Local<br>\n        Regional<br>\n        National<br>\n        Local, regional, national can all be specified by using organizational number<br>\n•   Questionnaire can be invoked by the patient, or must be sent/prescribed by a clinical person<br>\n•   Questionnaire MUST be filled by the patient/subject itself, or a representative can do this on behalf of the patient.<br>\n•   If the Questionnaire can be used in<br>\n        Anonymous mode<br>\n            Just viewing and print to paper<br>\n        Anonymous startup mode<br>\n            Possibility to log in and send to a predefined Endpoint if the patient wants to<br>\n        Anonymous mode<br>\n            Sending in to a predefined Endpoint without logging in<br>\n        Require that the patient must log in before viewing, filling and sending the Questionnaire.<br>\n•   If the patient should or should not receive a copy of the response<br>\n•   If the Questionnaire is licensed<br>\n        Different license models<br>\n        Payment per usage<br>\n        Restricted to an area, region, municipality, etc.<br>\n        Restricted to a specific organization that the patient has a relation to</p>\n<p>Currently we are looking at several options on how to solve this. These include (but do not exclude other alternatives): <br>\n•   meta.tags<br>\n•   Extensions<br>\n•   Use of the attribute useContext, and extend the values here to appropriately fit our purpose.</p>\n<p>Any suggestions would be appreciated.</p>",
        "id": 153954262,
        "sender_full_name": "Kim Hoel Halvorsen",
        "timestamp": 1524654392
    },
    {
        "content": "<p>Questionnaire owner = publisher.  <br>\nWho can use the questionnaire - seems like an extension, though this starts to overlap with the notion of permissions<br>\nQuestionnaire can be filled by patient or must be clinical person - extension, possible candidate for core extension<br>\nQuestionnaire mode - extension, possible candidate for core extension<br>\nPatient should receive copy - local extension<br>\nQuestionnaire is licensed - copyright or custom extension on it</p>",
        "id": 153954348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524691876
    },
    {
        "content": "<p>meta.tags are typically server-specific and not part of signatures.  useContext is for searching, but doesn't \"govern\" the questionnaire.</p>",
        "id": 153954349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524691907
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 153954439,
        "sender_full_name": "Kim Hoel Halvorsen",
        "timestamp": 1524724610
    },
    {
        "content": "<p>If you're interested in Questionnaire, you might want to follow the <a class=\"stream\" data-stream-id=\"102\" href=\"/#narrow/stream/102-questionnaire\">#questionnaire</a> stream</p>",
        "id": 153954561,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524763510
    },
    {
        "content": "<p>Yes, I am. Will do.</p>",
        "id": 153954745,
        "sender_full_name": "Kim Hoel Halvorsen",
        "timestamp": 1524812118
    }
]