[
    {
        "content": "<p>Hi, I am currently working on PGD project with using FHIR server Questionnaire and QuestionnaireResponse resources. Both resources have the identifier field which allows to store 0 - * identifiers for Questionnaire but only 0-1 for QuestionnaireResponse.  </p>",
        "id": 153887338,
        "sender_full_name": "Gang Chen",
        "timestamp": 1494011431
    },
    {
        "content": "<p>However, we cannot use identifier as URL param to query QuestionnaireResponse from FHIR server though we can do this from Questionnaire. </p>",
        "id": 153887339,
        "sender_full_name": "Gang Chen",
        "timestamp": 1494011621
    },
    {
        "content": "<p>I am precarious why ?</p>",
        "id": 153887341,
        "sender_full_name": "Gang Chen",
        "timestamp": 1494011672
    },
    {
        "content": "<p>An identifier search parameter for QuestionnaireResponse was added in STU3.  In DSTU2, you'll need to define a custom search parameter.  The difference in cardinalities is because we have no use-case for multiple identifiers on QuestionnaireResponse as yet.</p>",
        "id": 153887347,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494011821
    },
    {
        "content": "<p>Thanks Lloyd. Would you help how to define a single search for QuestionnaireResponse ? Below is my use case</p>",
        "id": 153887348,
        "sender_full_name": "Gang Chen",
        "timestamp": 1494012115
    },
    {
        "content": "<p>QuestionnaireResponse has Questionnaire reference, but I don't know it when performing the search on QUestionnaireResponse.</p>",
        "id": 153887349,
        "sender_full_name": "Gang Chen",
        "timestamp": 1494012213
    },
    {
        "content": "<p>All I know is the identifier# stored in that Questionnaire </p>",
        "id": 153887350,
        "sender_full_name": "Gang Chen",
        "timestamp": 1494012259
    },
    {
        "content": "<p>Is there a way I only submit a single query to get the QuestionaireResponse linked with <a href=\"http://Questionnaire.id\" target=\"_blank\" title=\"http://Questionnaire.id\">Questionnaire.id</a> with using the given identifier# ? </p>",
        "id": 153887352,
        "sender_full_name": "Gang Chen",
        "timestamp": 1494012437
    },
    {
        "content": "<p>QuestionnaireResponse?questionnaire.identifier=1234|http://somewhere.com/some-identifier-system (the URL would need to be properly escaped)</p>",
        "id": 153887363,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494013757
    },
    {
        "content": "<p>That uses the chaining mechanism</p>",
        "id": 153887364,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494013775
    },
    {
        "content": "<p>I have a question related to the same context, there are no search parameters defined/supported based on Item.LinkId and the item.answer components, from the use case perspective we have been receiving requests to retrieve the QR's based on a specific answer like 'Yes' or 'No' to a particular question. Is this something we can expect to come in future or is there a way to serve these requests?</p>",
        "id": 153889158,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1494436817
    },
    {
        "content": "<p>There are no plans to support this going forward because it's extremely difficult to do \"right\".  In a questionnaire, questions nest beneath other questions and beneath and beside other groups and questions that give them context.  Imagine a family history questionnaire that has a group with questions for \"name of relative\" and \"deceased date\".  Extracting a useful answer could require specifying linkIds and answers for numerous other questions to get what you're looking for.  QuestionnaireResponse is intended for data capture, not data analysis.  When it comes time to analyze data, the expectation is that information will be extracted from the QuestionnaireResponse and used to populate the appropriate other resources - Observation, FamilyMemberHistory, Patient, MedicationStatement, etc.  Those resources are designed to be queried and filtered in a standard way - because they organize and represent data elements in a standard way.</p>",
        "id": 153889179,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494479841
    },
    {
        "content": "<p>Agreed, if you really want to support what you've described, custom search parameters would be required. And the fhirpath expression could ensure its the correct questionnairedefinition, and answer (based on the various linkids)</p>",
        "id": 153889494,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1494530728
    }
]