[
    {
        "content": "<p>Below is a query relating to the R3 Diff information given in the FHIR R4 standard for the Questionnaire and Task.<br>\nSome differences are missing for these resources in the R3 Diff list given:-<br>\nFor Questionnaire.item.definition, the definition is different between the two versions<br>\nFor STU3 it reads<br>\nDefinition  A reference to an ElementDefinition that provides the details for the item. If a definition is provided, then the following element values can be inferred from the definition:<br>\n•   code (ElementDefinition.code)<br>\n•   type (ElementDefinition.type)<br>\n•   required (ElementDefinition.min)<br>\n•   repeats (ElementDefinition.max)<br>\n•   maxLength (ElementDefinition.maxLength)<br>\n•   options (ElementDefinition.binding)<br>\nAny information provided in these elements on a Questionnaire Item overrides the information from the definition.<br>\nFor R4, it reads<br>\nElement Id  Questionnaire.item.definition<br>\nDefinition  This element is a URI that refers to an ElementDefinition that provides information about this item, including information that might otherwise be included in the instance of the Questionnaire resource. A detailed description of the construction of the URI is shown in Comments, below. If this element is present then the following element values MAY be derived from the Element Definition if the corresponding elements of this Questionnaire resource instance have no value:<br>\n•   code (ElementDefinition.code)<br>\n•   type (ElementDefinition.type)<br>\n•   required (ElementDefinition.min)<br>\n•   repeats (ElementDefinition.max)<br>\n•   maxLength (ElementDefinition.maxLength)<br>\n•   answerValueSet (ElementDefinition.binding)<br>\n•   options (ElementDefinition.binding).<br>\nFor Task.code, in STU3, this element is unbound, but in R4, it is bound to the valueset <a href=\"http://hl7.org/fhir/ValueSet/task-code\">http://hl7.org/fhir/ValueSet/task-code</a><br>\nI would be really grateful, if a colleague could shed some light on these omissions from the diffs.</p>",
        "id": 274362933,
        "sender_full_name": "Katie Wheatley",
        "timestamp": 1646642957
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 274447320,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646682431
    },
    {
        "content": "<p>The diffs were generated and did not consider definitional differences</p>",
        "id": 274887253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1646942269
    }
]