[
    {
        "content": "<p>Our audit log contains the id of the user that performed the logged action (pretty standard I guess). Mapping it to AuditEvent in DSTU2  / STU3 we used AuditEvent.agent.userId. In R4 that's gone - the best match is AuditEvent.agent.who, but our users are not necessarily Practitioner or Patient - we actually map them to FHIR Person - and that's not an allowed target type for who - so not sure what to do</p>",
        "id": 168141474,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560523775
    },
    {
        "content": "<p>use AuditEvent.agent.who.identifier - just record the user id as the identifier.</p>",
        "id": 168141621,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560523851
    },
    {
        "content": "<p>I see - and add the id a an identifier to our Person resource I guess?</p>",
        "id": 168141807,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560523995
    },
    {
        "content": "<p>The is no need to add the id to the Person resource, but you might want to do that for other reasons. Cross-referencing business identifiers into the various agent Resources is always useful for Provisioning and Identity proofing.</p>",
        "id": 168142319,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560524365
    },
    {
        "content": "<p>There is no expectation that using a Reference.Identifier will result in a positive lookup; only that it is technically possible for that business identifier could be found as one of the Reference types.</p>",
        "id": 168142421,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560524417
    },
    {
        "content": "<p>(scratch that - adding the identifier to Person would not give us anything: the client would not know which resource to look for, and in any case won't look at Person because it is not one of the possible references there)</p>",
        "id": 168142918,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560524768
    },
    {
        "content": "<p>Oh - and the <code>user</code> search parameter is gone</p>",
        "id": 168145306,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560526342
    },
    {
        "content": "<p>yup, just ?agent now</p>",
        "id": 168146752,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560527268
    },
    {
        "content": "<p>These changes are all driven by the FHIR methodology move to Reference inclusive of Reference.identifier.</p>",
        "id": 168146846,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560527319
    },
    {
        "content": "<p>yes - but that's a reference search parameter and what we have is an id, so it will take some hacks to make it work</p>",
        "id": 168146899,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560527362
    },
    {
        "content": "<p>nope, very easy -- <a href=\"http://build.fhir.org/search.html#reference\" target=\"_blank\" title=\"http://build.fhir.org/search.html#reference\">http://build.fhir.org/search.html#reference</a></p>",
        "id": 168147049,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560527463
    },
    {
        "content": "<p>The specs might be easy, the implementation is not: all our reference search parameters expect actual references to existing resources, and this will break that pattern and so require special code</p>",
        "id": 168147252,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560527578
    },
    {
        "content": "<p>pattern might happen elsewhere too</p>",
        "id": 168173613,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560548186
    },
    {
        "content": "<p>yup, the main reason to use Reference.identifier is because the entity has not yet or may never be persisted as a formal FHIR Resource. If it has been, then Reference.reference is the better solution (aka the only one that should be used).</p>",
        "id": 168176820,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560551464
    },
    {
        "content": "<p>Main reason to populate Reference.identifier when there is an actual persisted formal FHIR Resource, is when you know the recipient of your data understands the business identifier and has no access rights to the FHIR Resource. This is possible, but unlikely, and especially unlikely that the sender knows that this is the case on the recipient.</p>",
        "id": 168176915,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560551587
    }
]