[
    {
        "content": "<p>R4B is going out the door with a number of technical corrections to the published R4 (4.0.1) version of the specification, but its bumping the version number to 4.3.0.</p>\n<p>When we went 4.0.0 to 4.0.1 it was clear to me that all servers are expected to go to 4.0.1 and the transition was mostly invisible to clients because the <code>fhirVersion</code> for both releases was \"4.0\" (the advantage of omitting that last release digit at <a href=\"https://hl7.org/fhir/R4/versioning.html#mt-version\">https://hl7.org/fhir/R4/versioning.html#mt-version</a>).</p>\n<p>Now that we have the technical corrections going out in a \"minor\" release (or whatever hl7 calls that second number), the expectations are less clear to me.</p>\n<p>For example, for some of the fhirpath constraint updates, would a server that enforces the (technically incorrect) 4.0.1 version of those constraints continue to be deemed conformant after 4.3.0 is published?<br>\nWould a 4.0.1 implementation that uses the fixed/corrected 4.3.0 version of those constraints (while claiming it support version 4.0.1) be conformant?<br>\nIs one more \"right\" than the other?</p>",
        "id": 267673341,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1641952298
    },
    {
        "content": "<p>Because there are some 'breaking' changes to certain resources and some internal architecture changes that impact servers, it's a more significant resources than just a 4.0.2.  We'd <em>like</em> everyone just just move to it like they did to 4.0.1, but no guarantees that will actually happen.</p>",
        "id": 267679992,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641959819
    },
    {
        "content": "<p>Yeah, I was surprised by the limited number of systems (and test tools) at connectathon for R4B given that its so close to publication.<br>\nWe have a project where the new medication stuff is needed. Our current thinking is to update whole-sale (moving all 4.0.1 users to 4.3.0) and serving it from the same endpoints we had the 4.0.1 impl on (minus the resource types that got removed).<br>\nHowever, since so many clients are using 4.0.1, I want to continue supporting requests that use a fhirVersion mime type attribute of 4.0 ...but still validate those against 4.3.0 instead of 4.0.1 so that we have consistency in the data.</p>",
        "id": 267717291,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1641990803
    },
    {
        "content": "<p>Its <em>mostly</em> backwards compatible, so this seems reasonable to me.  The only resource type where I think it could pose a major issue is Substance.  That was maturity level 2 in 4.0.1 but got reworked for 4.3.0.</p>",
        "id": 267717330,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1641990835
    },
    {
        "content": "<p>I found it interesting that Grahame took a different approach on his server and gave r4b its own separate endpoint.</p>",
        "id": 267717581,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1641990977
    },
    {
        "content": "<p>personally, I feel like we should maybe do more to encourage servers to at least backport the technical corrections to their R4 impls if they aren't planning to upgrade to R4B... although I think it would be easier if folks just moved to 4.3.0</p>",
        "id": 267717832,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1641991148
    },
    {
        "content": "<p>I have no choice but to put it on a separate end-point since some resources have changed. but it's useful for me to do so, since people can take an R4 client and point it at R4B and see that it works</p>",
        "id": 267760928,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1642009917
    },
    {
        "content": "<p>Back-porting R4B technical corrections to R4 is likely to cause a lot of pain though! This is where the \"promise\" of R4B is turning out not to quite fit reality; for most developers they'll need to treat it like a major release, in practice.</p>",
        "id": 267779807,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642018468
    },
    {
        "content": "<p>(I wonder if we shouldn't just call it R5 given what we know today ;-))</p>",
        "id": 267779825,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642018486
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179166-implementers/topic/R4B.20technical.20corrections/near/267779825\">said</a>:</p>\n<blockquote>\n<p>(I wonder if we shouldn't just call it R5 given what we know today ;-))</p>\n</blockquote>\n<p>I'm intrigued by that comment - any further details?</p>",
        "id": 267781763,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1642019469
    },
    {
        "content": "<p>Just from the perspective of deployed server and client infrastructure, library availability, etc. We're talking about changes that may not be formally \"breaking\" from an HL7  perspective but that will nevertheless cause developers to have to rewrite code.</p>",
        "id": 267786961,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642021942
    },
    {
        "content": "<p>Thanks. It will be interesting to see how many errors my IDE reports when I switch to the R4B version of the C# reference library!</p>",
        "id": 267787399,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1642022185
    },
    {
        "content": "<p>it might be one of those things that seems worse in principal than in reality.  the reason i want to support R4B in-place is to <em>avoid</em> all the pains of a major update (e.g. data migration and the like).  its <em>so close</em> to backwards compatible, that I'm hoping none of our existing users would even notice.</p>",
        "id": 267787411,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642022200
    },
    {
        "content": "<p>the big question for me is \"is anyone using Substance\" :-)</p>",
        "id": 267787428,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642022215
    },
    {
        "content": "<p>right now, one of the biggest issues to this \"in practice\" (at least in my mind) is that our CapabilityStatement won't even be parsable to R4 clients if we say we're supporting 4.3.0</p>",
        "id": 267787606,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642022298
    },
    {
        "content": "<p>so i'm worried they won't even try (even though it <em>would</em> work if they did)</p>",
        "id": 267787622,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642022313
    },
    {
        "content": "<p>this is what i hit with the touchstone tool for example</p>",
        "id": 267787631,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642022321
    },
    {
        "content": "<p>so what I'm playing with now is returning an R4 flavor of the CapabilityStatement that we can return for clients that pass a hint that they're using R4 (e.g. by passing the mime type parametert <code>fhirVersion=4.0.1</code>).  in this flavor, i omit any of the new resource types (and Substance) and we just advertise the capability that we have that is almost exactly equal to R4 behavior (aside from technical corrections)</p>",
        "id": 267787784,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642022408
    },
    {
        "content": "<p>or, if we find this issue prevents R4 clients from working with us, maybe we'll serve that one UNLESS they indicate <code>fhirVersion=4.3.0</code></p>",
        "id": 267787848,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642022446
    },
    {
        "content": "<p>It really depends on what the system does.  If it's \"generic\", there's enough changes under the covers, it matters.  If you're an EHR, then it probably doesn't matter at all.</p>",
        "id": 267788528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642022808
    },
    {
        "content": "<p>Substance was changed based on a misunderstanding, and has been reverted in the build version on R4B.</p>",
        "id": 267788708,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1642022890
    },
    {
        "content": "<blockquote>\n<p>Substance was changed based on a misunderstanding, and has been reverted in the build version on R4B.</p>\n</blockquote>\n<p>oh, thats very interesting...i definitely didn't know that.  is that recent?</p>",
        "id": 267789161,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642023151
    },
    {
        "content": "<p>Not really no. Shortly after the ballot ended I think</p>",
        "id": 267789238,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1642023211
    },
    {
        "content": "<p>ok, great.  i thought i was basing that analysis off our model diff, but i guess that incorrect mental model i had was actually from the ballot overview then.  great.</p>",
        "id": 267789333,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642023274
    },
    {
        "content": "<p>Other than that and the Medication Definition stuff that all got renamed I wonder what breaking changes there are at a \"it won't accept my resource\" level. I've seen some internal changes to base types and so on that would cause libraries to change.</p>",
        "id": 267789948,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1642023649
    },
    {
        "content": "<p>see my CapabilityStatement one above for my connectathon takeaway</p>",
        "id": 267790037,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642023713
    },
    {
        "content": "<p>I'm not sure how big the issue will be in practice (so far i only tested with touchstone), but my theory is that the required bindings for CapabilityStatement.fhirVersion and CapabilityStatement.rest.resource.type will result in other clients with similar issues</p>",
        "id": 267790219,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642023800
    },
    {
        "content": "<p>does anyone know if we ever considered reducing those to Extensible?</p>",
        "id": 267790255,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642023819
    },
    {
        "content": "<blockquote>\n<p>I wonder what breaking changes there are at a \"it won't accept my resource\" level</p>\n</blockquote>\n<p>Also, if interested, my notes from my first pass of looking for \"subtly breaking changes\" is at <a href=\"#narrow/stream/179166-implementers/topic/R4B.20questions.20.2F.20issues\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/R4B.20questions.20.2F.20issues</a></p>\n<p>For example, I called out the changes to these two valuesets there but hadn't yet pieced together this it might prevent R4 clients from parsing our CapabilityStatement.<br>\nI also referenced the two constraint updates that caused breakage in our system tests (but not sure the chances of breakage for \"real\" resources).</p>",
        "id": 267791329,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642024332
    },
    {
        "content": "<p>Outsider tongue in cheek comment: given that the US requires R4, I expect us to go from R4B all the way up to R4Z before we call something R5. But it's effectively still a major release for most implementers.</p>",
        "id": 267832735,
        "sender_full_name": "René Spronk",
        "timestamp": 1642059049
    },
    {
        "content": "<p>I recognize that your comment was tongue in cheek, but to be clear, the US certification program  is pegged to FHIR 4.0.1  and updates need to go through the standards version advancement process, as far as I understand. There is no particular reason that changing a minor versus a major number would impact that process (again as far as I understand)</p>\n<p><a href=\"https://www.law.cornell.edu/cfr/text/45/170.215\">https://www.law.cornell.edu/cfr/text/45/170.215</a></p>",
        "id": 267918127,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642102044
    }
]