[
    {
        "content": "<p>Is there work group oversees radiation oncology? I'm trying to figure out how to represent something like a Brachytherapy treatment. It's not a procedure (per definition on the wiki a procedure does not include radiation therapy since it is dosed), but ImagingStudy doesn't seem to fit, either. (Nor does MedicationAdminstration, really.) </p>",
        "id": 153814210,
        "sender_full_name": "Terry McDonnell",
        "timestamp": 1457375284
    },
    {
        "content": "<p>are you trying to represent a record of treatment, or a protocol, or a plan?</p>",
        "id": 153814222,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457378188
    },
    {
        "content": "<p>Record of treatment, though a protocol would be a great extension (in the generic sense of being better than just the individual treatments, not in the FHIR definition of extension)</p>",
        "id": 153814241,
        "sender_full_name": "Terry McDonnell",
        "timestamp": 1457380516
    },
    {
        "content": "<p>so my take on this is that right now we have Procedure, but this is actually statement-of-past-procedure,  not record-of-procedure, and you want the second. It's one working concern I have with Procedure - badly described scope. I think that chemotherapy and radiation records should be scope for the second, but there's a gray line between them and complex medication protocols and normal medication administration</p>",
        "id": 153814243,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457380681
    },
    {
        "content": "<p>What I get from the wiki (<a href=\"http://wiki.hl7.org/index.php?title=Procedure_FHIR_Resource_Proposal\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Procedure_FHIR_Resource_Proposal\">http://wiki.hl7.org/index.php?title=Procedure_FHIR_Resource_Proposal</a>):</p>\n<p>This includes surgical procedures, diagnostic procedures, endoscopic procedures, biopsies. It also includes group therapy, training, psycho-therapy, music therapy, etc. It does not include drug therapy, chemotherapy, radiation therapy, light therapy or other therapies where \"dosage\" is a primary aspect of the intervention.</p>",
        "id": 153814245,
        "sender_full_name": "Terry McDonnell",
        "timestamp": 1457382165
    },
    {
        "content": "<p>yes. I'm disagreeing with that. and I've asked the Patient Care committee to look at the scope of it, but they've been doing other things </p>",
        "id": 153814249,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457384646
    },
    {
        "content": "<p>Radiation is a \"known issue\".  We could use Procedure, we could generalize MedicationAdministration or we could create a new resource.  We haven't had enough people at the table who could speak to it well for us to decide how to approach it.  If you can capture the \"common\" data elements most systems would support in this space, that would be helpful.</p>",
        "id": 153814298,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1457391727
    },
    {
        "content": "<p>I'll do some homework and put together a proposal. (What we're working with now is often from an EDW and pretty inconsistent.)</p>",
        "id": 153814315,
        "sender_full_name": "Terry McDonnell",
        "timestamp": 1457402985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191433\">@Terry McDonnell</span> Did you make some way with a proposal on the Branchytherapy treatment? I am trying to figure out how to represent radiation therapy-statement-of-past  procedures ( I think) for oncological registries. Looking through the FHIR documentation, we (I work on this with a medical physicist) also got stuck between Procedure and MedicationAdministration as potential, but not really appropriate base resources.</p>",
        "id": 153862736,
        "sender_full_name": "Sebastiaan van Sandijk",
        "timestamp": 1481293512
    },
    {
        "content": "<p>Unfortunately not really. We ended up going a different direction with the motivating customer, and I haven't had time to circle back</p>",
        "id": 153862752,
        "sender_full_name": "Terry McDonnell",
        "timestamp": 1481300493
    },
    {
        "content": "<p>Ran into the same thing. I'll go with MedicationAdministration as out of the two, it has a <code>dose</code> element and wouldn't need an extension like <code>Procedure</code> would.</p>",
        "id": 153895303,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1498570755
    },
    {
        "content": "<p>For those planning to attend the Sept WGM, this is a topic scheduled for Q3 on Wed, Sept 13 (joint quarter with Patient Care, Pharmacy, and O&amp;O).</p>\n<p>For those who want to follow or comment on the related trackers:<br>\n<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13047\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13047\">GF#13047</a> (request to add DosageInstructions to Procedure)<br>\n<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12993\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12993\">GF#12993</a> (request for a new Administration resource)</p>\n<p>And blood products, tissue, and organs often get mentioned in the mix as well.<br>\n<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8458\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8458\">GF#8458</a> (request asking for a new BiologicallyDerivedProduct resource)</p>",
        "id": 153895306,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1498572079
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191363\">@Vadim Peretokin</span> One thing that troubles me about using MedicationAction for Brachytherapy records is that a person searching for them is likely to ignore medication resources as irrelevant and look instead at procedure resources. </p>",
        "id": 153895338,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1498614859
    },
    {
        "content": "<p>We'd have to include some information in the intro for Procedure that pointed readers to the correct place.</p>",
        "id": 153895343,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498616440
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> hey Richard! Searching in which context? I'll be profiling <code>MedicationActivity</code> and it'll have the <code>Radiation therapy</code> in the name of the profile, so I plan to link it up that way.</p>",
        "id": 153895371,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1498635053
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191363\">@Vadim Peretokin</span> G'day Vadim. I'm thinking about exchanging information so that it is easy for the receiver to process. </p>",
        "id": 153895575,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1498692479
    },
    {
        "content": "<p>Searching by someone who received a bunch of resource instances and is unfamiliar with the use of <code>MedicationAction</code> for radiation therapy. If they assume radiation therapy is a type of procedure, is it still easy for them to find the radiation therapy information in profiles of <code>MedicationAction</code>?<br>\nIf some source systems template <code>MedicationAction</code> for radiation therapy and others template <code>Procedure</code>, processing them will be messy.</p>",
        "id": 153895576,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1498692502
    },
    {
        "content": "<p>It would be <code>MedicationAdministration</code> - if we go that route.  We'd absolutely put a cross-reference on <code>Procedure</code> to direct people if we decide to go that way.</p>",
        "id": 153895585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498697814
    },
    {
        "content": "<p>Activity ~ Action ~ Administration.  Oops</p>",
        "id": 153895587,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1498698106
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> sounds good, thanks!</p>",
        "id": 153895624,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1498721591
    },
    {
        "content": "<p>Has there been any progress on the FHIR resource(s) most applicable to RT? Specifically the request resource, though any information on RT in FHIR would be useful.</p>",
        "id": 153928770,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1515960896
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?  If this hasn't progressed, is there a chance of devoting any time to it in New Orleans?</p>",
        "id": 153928782,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515961981
    },
    {
        "content": "<p>I am not aware of anybody working on this ,  <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?  We could discuss in one of our fhir quarters if there is specific information to present or a particular issue to discuss with regards to ServiceRequest.</p>",
        "id": 153928812,
        "sender_full_name": "Eric Haas",
        "timestamp": 1515997078
    },
    {
        "content": "<p>I think that brachytherapy could also fit in the overall discussion of \"health Products\" - since they are requested, delivered, administered....</p>",
        "id": 153928820,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516010707
    },
    {
        "content": "<p>Hi, we are also working in RT and started looking into FHIR. Not sure how much time I can assign. As potential RT data on FHIR I would see RT Intent/Prescription (at a higher level, not the detailed level covered by DICOM 2nd gen RT), treatment progress reporting (currently covered by custom HL7 2.x implementations), but also Procedure(Requests) for delivery of single treatment fractions with some RT details (detailed plan and tx record data also here covered by DICOM).</p>",
        "id": 153928869,
        "sender_full_name": "Martin von Siebenthal",
        "timestamp": 1516025370
    },
    {
        "content": "<p>The major trouble I'm having with it is that I can not extend ProcedureRequest with a Dosage field, as Dosage is not a valid extension value type. Is it better to use the Medication[X] resources for RT? I could fit everything in, including multiple bodysites, but it feels wrong.</p>",
        "id": 153928892,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1516034894
    },
    {
        "content": "<p>Have you looked at the <a href=\"http://AdverseEvent%20is%20an%20event%20resource%20from%20a%20FHIR%20workflow%20perspective%20but%20has%20not%20yet%20been%20mapped%20to%20it%20and%20I%20think%20i\" target=\"_blank\" title=\"http://AdverseEvent%20is%20an%20event%20resource%20from%20a%20FHIR%20workflow%20perspective%20but%20has%20not%20yet%20been%20mapped%20to%20it%20and%20I%20think%20i\">latest (R4) version</a>?  We have added some OrderDetails elements as codes/text element and comment on that?</p>",
        "id": 153928901,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516039313
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  I have no idea what you mean.</p>",
        "id": 153928902,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516039329
    },
    {
        "content": "<p>The radiation as an orderable thing?  I think we are talking more about the odering of the procedure.   I don't know whether is better to use Meds resources either.</p>",
        "id": 153928903,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516039419
    },
    {
        "content": "<p>This is where the ServiceRequest/MedRequest boundary is fuzzy.</p>",
        "id": 153928904,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516039550
    },
    {
        "content": "<p>Radiation is not orderable, but radiopharmaceuticals are</p>",
        "id": 153928909,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516044240
    },
    {
        "content": "<p>agree with boundary - to me they are similar: both require a service and the use/consumption of a product</p>",
        "id": 153928910,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516044289
    },
    {
        "content": "<p>I'm talking specifically about the procedure, Radiation therapy to chest wall 45 - 50.4 Gy in 25-28 fractions. By any modality like 3d conformal IMRT, EBRT or Electrons. Brachytherapy is another modality option for some sites, and that also has a dose. Modality can be fit in with an extension or the new order details codeable field, or right in the code field. But it's the dosage that I don't know where to fit.</p>",
        "id": 153928926,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1516050151
    },
    {
        "content": "<p>To me the issue are:</p>\n<ul>\n<li>Whether the Meds resource Scope should be expanded to include radiation if its indeed a better fit.</li>\n<li>Does ServiceRequest need a Dosage element - if so then Dosage needs be generalized to work with more than medications.</li>\n<li>Or is there a subset of Dosage elements that could be generalized for ServiceRequest we already have timing, patientInstructions, <br>\n  and additionalInstructions/site//route/method (all as orderdetails) as independent elements.</li>\n</ul>",
        "id": 153928930,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516051685
    },
    {
        "content": "<p>Ok, my first answer to that would be:</p>\n<blockquote>\n<ul>\n<li>Whether the Meds resource Scope should be expanded to include radiation if its indeed a better fit.</li>\n</ul>\n</blockquote>\n<p>Possibly, but this is something i would bring under \"healthProduct\" - it is one of those cases where it could be a new resource, or a specialization...</p>\n<blockquote>\n<ul>\n<li>Does ServiceRequest need a Dosage element - if so then Dosage needs be generalized to work with more than medications.</li>\n</ul>\n</blockquote>\n<p>No, ServiceRequest would contain a request for a product (xxxRequest, where xxx is medication, healthProduct, and xxxRequest contains the dosage.</p>\n<blockquote>\n<ul>\n<li>Or is there a subset of Dosage elements that could be generalized for ServiceRequest we already have timing, patientInstructions,  and additionalInstructions/site//route/method (all as orderdetails) as independent elements.</li>\n</ul>\n</blockquote>\n<p>(see above)</p>",
        "id": 153928931,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516051991
    },
    {
        "content": "<p>Jose, you're thinking about this from a modeling perspective.  We need to drive the requirements from an implementation perspective.  Where do existing systems typically mange orders for radio-therapy?  Are they in the same user interface and repository as they put their drug orders, in the same user interfaces as they put their orders for surgery, lab tests and physio therapy, or are they in a separate user interface/repository.  That'll be the primary guide for whether we should leverage one of the existing resources or create a new one.  The catalogue issue is a red herring.  Catalogues are all about definitions of things and that'll be at a completely different level than capturing the orders and the execution.</p>",
        "id": 153928936,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516055798
    },
    {
        "content": "<p>Looking a this from a resource management perspective - we have yet to been decide whether this use cases deserve a new resource or a new profile.  I am more inclined to start with profile on MedRequest or ServiceRequest.</p>",
        "id": 153928976,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516064513
    },
    {
        "content": "<p>Is that leaning based on the behavior of existing systems that support both radiation therapy and medication therapy or other forms of requests?  Whether it's a new resource or a profile on one of the existing resources is indeed the first question to answer - but I haven't yet heard much opinion from those who have such systems how they currently display and store data.  The opinions on what we should do seem to be coming primarily from modelers - and that's not who should drive the decision :)</p>",
        "id": 153928978,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516064907
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> i did not want to bring the Catalog for this case, so perhaps the \"healthProduct\" thing was misleading - it is not the same as catalog. I was looking at some recent work where we had to align radiopharmaceuticals products with medicines from a perspective on \"how to order the products\" perspective. We did not have the \"how to order the actual service\". But from the little I remember, i think the dosage should not be on the service component of the request, but on the product ordering request, which i think makes more sense. (I have touched this a long time ago, where we had to handle the ordering, and our roadmap was to look at the decay between preparation and administration, handling supply issues and radiation exposure..). Yep, i think i am modeling :)</p>",
        "id": 153929029,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516083241
    },
    {
        "content": "<p>in any case, in my opinion we should have a frame for the problem \"I need to order a service that implicitly/explicitly/optionally uses a product\" - radiopharmaceuticals, contrast agents, surgical products...</p>",
        "id": 153929033,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516083374
    },
    {
        "content": "<p>For radiotherapy, I don't think we're talking about radiopharmaceuticals - those would almost certainly be handled using the Medication-related resources (though we might need some extensions to properly capture the notion of \"strength\").  My understanding of what's being asked for with respect to radiotherapy is the ability to order and record directed radiation treatments.  With those there's no \"injection/injestion\", just a beam of a particular size, type, direction, intensity, duration, etc.  There is a \"dose\", but it's not of an active ingredient.</p>",
        "id": 153929040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516085074
    },
    {
        "content": "<p>I am waiting for input from the  implementers as well.</p>",
        "id": 153929042,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516088170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> That is accurate for what our use case is, requesting/recording all types of radiation treatment that appears in the oncology space. Brachytherapy, which is the little radioactive seed put in the tumor, is just one type of RT mentioned, and actually has really similar dosing data, with Grays, fractions, dose max, etc, to other RT types.</p>",
        "id": 153929080,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1516116872
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> perhaps I misused the word.  I am thinking of products that are injected / deposited / applied in a specific region, not a low-therapy radiotherapy beam inciding on the patient.</p>",
        "id": 153929096,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516123046
    },
    {
        "content": "<p>e.g. <a href=\"http://www.bebig.com/home/products/prostate_seed_brachytherapy/\" target=\"_blank\" title=\"http://www.bebig.com/home/products/prostate_seed_brachytherapy/\">http://www.bebig.com/home/products/prostate_seed_brachytherapy/</a></p>",
        "id": 153929097,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516123334
    },
    {
        "content": "<p>i usually don't say \"these are different things\" but it would seem that ordering a treatment with brachytherapy seeds will end up with a different set of resources than external beam therapy.</p>",
        "id": 153929099,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516123776
    },
    {
        "content": "<p>in both cases you have to define a region (area/volume) and perhaps the mGy / mSv??, maybe other similarities, but it should be considerably different. I look forward to see what information is captured and from then see what this means in terms of resources.</p>",
        "id": 153929101,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516123861
    },
    {
        "content": "<p>For the radiotherapy prescription/intent I would also say they need the same information: sites/targets, dose objectives to targets, dose constraints to organs at risk, how the dose is fractionated, and treatment modes/techniques as far as the physician or the protocol wants to detail the technical aspects. There the modes/techniques would say brachy or photons/protons/electrons. When it comes to exact technical details to fulfill the prescription the differences get bigger, such as dwell times for brachy or beam angles and monitor units for external beams. But those details that are worked out within the RT department, I would not expect that we map those to FHIR. This is well served by DICOM and I would expect DICOM references in requests or procedures for the technical plan details. Also prescription in the very detail is taken care of by DICOM RT 2nd gen. But for prescription and how far the treatment  has progressed there is certainly a need to have a more light-weight representation on FHIR for interoperability with outside the RT domain, with systems that can't get into DICOM.</p>",
        "id": 153929180,
        "sender_full_name": "Martin von Siebenthal",
        "timestamp": 1516173747
    },
    {
        "content": "<p>Also not aware of any work on this.  We are meeting with O&amp;O and Patient Care on Wednesday Q3 to talk about Blood Transfusions.  Not sure if it can be raised in that discussion.  The latest threads seem to indicate the use of MedicationAdministration.  Maybe we can start the discussion in Pharmacy and bring in other groups.  <span class=\"user-mention\" data-user-id=\"191363\">@Vadim Peretokin</span> <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> will you be in New Orleans? and can you join Pharmacy one quarter to start the discussion?</p>",
        "id": 153929234,
        "sender_full_name": "Melva Peters",
        "timestamp": 1516201254
    },
    {
        "content": "<p>This thread is more of a ServiceRequest/MedicationRequest discussion which we can add to the Wed Q!@ agenda provided we have a targeted agenda and goals.  I agree that  MedicationAdministration should be taken up in a Pharmacy quarter.</p>",
        "id": 153929284,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516210370
    },
    {
        "content": "<p>I'm not able to make it, sorry</p>",
        "id": 153929332,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1516217921
    },
    {
        "content": "<p>Regarding the question:</p>\n<blockquote>\n<p>Where do existing systems typically mange orders for radio-therapy? Are they in the same user interface and repository as they put their drug orders, in the same user interfaces as they put their orders for surgery, lab tests and physio therapy, or are they in a separate user interface/repository</p>\n</blockquote>\n<p>Our EHR persists all orders to the same database table(s).  We use a catalog type to identify the subset of orders that are pharmacy.  Photo/radiation therapy orders aren't grouped with pharmacy, nor are they nicely/easily identifiable from other service requests.</p>",
        "id": 153929340,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1516219844
    },
    {
        "content": "<p>I, also, will not be in New Orleans.</p>",
        "id": 153929367,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1516230119
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> Any feedback from other EHR providers?</p>",
        "id": 153929390,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516253156
    },
    {
        "content": "<p>I would like to renew this thread if anyone is interested.  I am approaching this much more from the clinical side than from a true implementer role, so please forgive any displays of ignorance.<br>\nI have been working with several organizations (IHE-RO, Amer. Soc. Ther. Radiation Oncology) who are all interested in more explicit representation of radiation therapy in electronic health records.  To this end, some recommended standards are being worked on.  There are many different aspects to this, and I was interested in Martin's very thorough response.   As he points out, there are some basic elements of RT that need to be communicated and don't seem to fit any paradigms that I have seen discussed.<br>\nCurrent ASTRO recommendations for the Prescription (most basic of all sets of information for EHR) include:<br>\nbody site (codeable), method of delivery (codeable but not with current int'l standards), dose per fraction (including units), number of fractions, and total dose (with units).<br>\nFrom my admittedly suboptimal review of the resources, these elements could be included in ProcedureRequest and List resources.  This does not seem ideal to me, but nothing else does either. I would appreciate any thoughts and insights.</p>",
        "id": 154008158,
        "sender_full_name": "Mark Phillips",
        "timestamp": 1539280397
    },
    {
        "content": "<p>In the medical oncology world there has been an effort to represent a chemotherapy regimen as a PlanDefinition, could this also be done for radiation?  It seems like there might be some significant overlap there.</p>",
        "id": 154008161,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1539280566
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196344\">@Mark Phillips</span> as this goes ahead, please keep the Imaging Integration workgroup/DICOM WG-20 informed/involved (cc <span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span> ).</p>",
        "id": 154008188,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1539282392
    },
    {
        "content": "<p>Elliot: Thanks for the head's up.  I will contact them--perhaps they have already worked some of this out.<br>\nKevin,<br>\nPlanDefinition, like ProcedureRequest, has some good aspects.  However, the issue of dose and how to specify it looks to be somewhat difficult.   Dose has been discussed earlier in this thread with little resolution.  For the 5 different prescription elements,  are you thinking of the dynamicValue element?  <br>\nIn looking at the PlanDefinition details, I went back to look at CarePlan resource, which I had originally thought of as encompassing the larger RT effort (not just one target).  It has a lot of flexibility which is good (action element plus detail element). <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  The description also indicates that radiation therapy is an acceptable use.</p>",
        "id": 154008201,
        "sender_full_name": "Mark Phillips",
        "timestamp": 1539283135
    },
    {
        "content": "<p>Mark, we haven't had a chance to discuss RT in II/WG-20 yet, but it is certainly something that crosses into our interest zone.</p>",
        "id": 154008255,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1539285427
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196344\">@Mark Phillips</span> The current proposal for a chemotherapy regimen is here... <a href=\"https://simplifier.net/nccnchemotherapyorde/ordertemplate\" target=\"_blank\" title=\"https://simplifier.net/nccnchemotherapyorde/ordertemplate\">https://simplifier.net/nccnchemotherapyorde/ordertemplate</a>  .  It looks like they have several <code>contained</code> objects that are profiled versions of <code>ActivityDefinition</code> that have dosages in them.  I will also point out that I don't know very much about how RT is dosed, so I'm also not sure how useful this will be to you.</p>",
        "id": 154008374,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1539292243
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196344\">@Mark Phillips</span> <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> I recall some enhancements on DICOM for RT are moving through the system - and there is significant work in the DICOM specification already. If you haven't yet, do reach out to the RT workgroup / co-chairs - more information is available here: <a href=\"https://www.dicomstandard.org/wgs/wg-07/\" target=\"_blank\" title=\"https://www.dicomstandard.org/wgs/wg-07/\">https://www.dicomstandard.org/wgs/wg-07/</a></p>",
        "id": 154008429,
        "sender_full_name": "Brad Genereaux",
        "timestamp": 1539299350
    },
    {
        "content": "<p>+1.  Add me to the list of people interested in how best to represent Radiation therapy.  I was indirectly involved in the nccn chemotherapy order template and we only scoped to medications.   Attribute-wise, this straddles somewhere between a procedure request and a medication request, with neither satisfying the representation of radiation dose.  I think we're in new territory here.  cc: <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span></p>",
        "id": 154013724,
        "sender_full_name": "May Terry",
        "timestamp": 1540922377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196282\">@May Terry</span> are you aware of anyone continuing the work on the OrderTemplate stuff at the NCCN?</p>",
        "id": 154014504,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1541076850
    },
    {
        "content": "<p>+1 with <span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span>  (hi Lee!...it's been a while...).  I suggest you reach out to NCCN.  <span class=\"user-mention\" data-user-id=\"193440\">@Mary Visceglia</span> was the last contact at NCCN on this effort.</p>",
        "id": 154014512,
        "sender_full_name": "May Terry",
        "timestamp": 1541079512
    },
    {
        "content": "<p>Also, I'm currently trying to model performed radiation therapy procedures as a FHIR profile.  I'd love to work with others in gaining consensus around this if possible.  LMK if anyone's interested and I'll setup a meeting for joint-modeling or at least sharing our approaches.    cc: <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span></p>",
        "id": 154014515,
        "sender_full_name": "May Terry",
        "timestamp": 1541079978
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196282\">@May Terry</span> FYI <span class=\"user-mention\" data-user-id=\"193440\">@Mary Visceglia</span> is no longer with the NCCN.</p>",
        "id": 154014518,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1541080280
    },
    {
        "content": "<p>yeh - <span class=\"user-mention\" data-user-id=\"193229\">@Kevin Olbrich</span> ...that was a while back. Joan McClure should still be there.  She's not on Zulip though so you'll have to email.</p>",
        "id": 154014519,
        "sender_full_name": "May Terry",
        "timestamp": 1541080329
    },
    {
        "content": "<p>Patient Care is still seeking feedback (from implementers, Pharmacy WG, IG editors) who have input on how radiation therapy should be handled.  </p>\n<ul>\n<li>New resource</li>\n<li>Procedure / ServiceRequest</li>\n<li>MedicationAdmin / MedRequest<br>\nCC:  <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span></li>\n</ul>",
        "id": 227873370,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1614306801
    },
    {
        "content": "<p>FYI <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span>, <span class=\"user-mention\" data-user-id=\"277357\">@Christopher Lindop</span> , <span class=\"user-mention\" data-user-id=\"253949\">@Brian Bialecki</span></p>",
        "id": 227880051,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1614312803
    },
    {
        "content": "<p>We should just throw it all in extensions in FinancialTransaction like Elekta did in HL7v2 DFTs <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 227889720,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1614322692
    },
    {
        "content": "<p>I could see this as MedicationRequest and MedicationAdministration with the dosageInstruction holding the plan.  It has the basic structure needed, although I think a mapping exercise would be needed for this before I would be certain.</p>",
        "id": 227928392,
        "sender_full_name": "Brian Bialecki",
        "timestamp": 1614346756
    },
    {
        "content": "<p>Radiation therapy only by radiopharmaceuticals or external as well?</p>",
        "id": 227942803,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614353024
    },
    {
        "content": "<p>The specific use-case we need to land is external.  Radiopharmaceuticals would certainly use MedicationAdministration</p>",
        "id": 227943145,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614353170
    }
]