[
    {
        "content": "<p>Is there any guidance on the difference between turning on and off ReadHistory and adding the VRead interaction? </p>\n<p>I am not completely sure about the meaning of these combinations:<br>\nReadHistory=True + VRead exists = Type/_history is supported and you can query any version<br>\nReadHistory=True + No VRead <br>\nReadHistory=False + VRead exists <br>\nReadHistory=False + No VRead = I am assuming this means the service has no Type/_history support</p>\n<p>Any idea what is the right expected behavior for the 4 combinations?</p>",
        "id": 153922460,
        "sender_full_name": "Gabriel",
        "timestamp": 1512086003
    },
    {
        "content": "<p>it doesn't really make sense to say readhistory=true when there's no vread</p>",
        "id": 153922462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512087037
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , a follow up to that would be, what happens when you have readhistory=false with the rest of the interactions related to versioning? </p>\n<p>If we have readHistory=false and vread present</p>\n<ul>\n<li>Can we do a GET on type/_history/{versionid} where {versionid} is the latest version id of the object. If this is not allowed either, then what happens with the location header after a create is done? Does the version id get trimmed from the url to the resource?</li>\n</ul>\n<p>How does setting readHistory=false affect history-instance and history-type? Is the whole endpoint disabled?</p>",
        "id": 153922469,
        "sender_full_name": "Gabriel",
        "timestamp": 1512090597
    },
    {
        "content": "<p>well, if you have vread not readHistory, you support vread of the current version, but not past versions. I don't know what it means to claim you support history and not hve readhistory = true</p>",
        "id": 153922470,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512090876
    }
]