[
    {
        "content": "<p>I m looking at ways to model \"recall reminders\" where there is an intent to recall a patient for a follow up periodically or on a date in the future - is CarePlan the best way to go?</p>",
        "id": 153853707,
        "sender_full_name": "Brett Esler",
        "timestamp": 1477040027
    },
    {
        "content": "<p>You could just schedule a Task</p>",
        "id": 153853868,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1477273229
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ,Task looks good for this.. i am operating in dstu2 land for this project, so think i'll use Basic resource + extensions to match stu3 Task resource... </p>",
        "id": 153854033,
        "sender_full_name": "Brett Esler",
        "timestamp": 1477354004
    },
    {
        "content": "<p>Follow-up on this one - is there a way to do perodic task e.g. every 3 months with Task?  I can see fulfillment.period and fulfillment.repetitions I think I more want a period that is a Quantity (of time) and ongoing until a date/number of reps/forever... </p>",
        "id": 153854037,
        "sender_full_name": "Brett Esler",
        "timestamp": 1477360124
    },
    {
        "content": "<p>At the moment, no.  The expectation is if you're planning multiple repetitions, then you have some sort of Request resource and the Task would simply say \"do the request\" or \"do one occurrence of the request\".  So for that, you might indeed need CarePlan or maybe something new</p>",
        "id": 153854041,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1477370651
    },
    {
        "content": "<p>I suggesetd to use a proposed appointment, as for the most part all the details are known for the appointment, just not the when (apart from in 3 month time) The task doesn't have the details of what is to be done...<br>\nThe STU3 appointment has the requested period added so that you can indicate the window when you'd like the appointment to be scheduled.<br>\nWe still haven't dealt with repeating appointments though.</p>",
        "id": 153854142,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1477395372
    }
]