[
    {
        "content": "<p>Hi, can you give me some recommendations on how to receive a document sent by an application to a Mirth server. For example, I need to be able to receive on my server a document bundle, validate it and then send it to another server on an institution (final destination). To do so, the sending client should post the document to my server using which operation?<br>\n I have read this page (<a href=\"http://www.hl7.org/fhir/operations.html\" target=\"_blank\" title=\"http://www.hl7.org/fhir/operations.html\">http://www.hl7.org/fhir/operations.html</a>), but I can't find an example for my situation. Thank you very much.</p>",
        "id": 153825814,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1462795685
    },
    {
        "content": "<p><strong>*disregard</strong>* <br>\nI asked Grahame in person, will post his answer for the sake of anyone else trying to do the same.</p>",
        "id": 153825834,
        "sender_full_name": "Matthew Spielman",
        "timestamp": 1462797250
    },
    {
        "content": "<p>Pat - there is no API that exposes these particular obligations. Your client could iterate the operations to do this, but if you want the server to do this, you'll have to create your own operation that has those obligations as part of it's description</p>",
        "id": 153825838,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462797357
    },
    {
        "content": "<p>I use a Bundle resource to move documents around. The Bundle contains a DocumentReference and a Binary resource and is POSTed to the endpoint url. </p>",
        "id": 153825839,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1462797360
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191921\">@Matthew Spielman</span>  When I've been moving Documents around I've included the referenced resources and made the references self referential (does that make sense - the references point internally to the main resource ). It's a bit a pain when the references are well known (e.g. national doctor id or national patient identifier).</p>",
        "id": 153825841,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1462797652
    },
    {
        "content": "<p>Thank you for your anwers. Grahame maybe I'll create my own operation (like $process-document),<br>\nor, Kevin you say you use a bundle of type message that references the documentReference in the messageheader.data? Can I use a bundle of type message and include a reference to my document bundle in the messageheader.data?</p>",
        "id": 153825885,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1462801440
    },
    {
        "content": "<p>yes, and put the document bundle inside the message bunle</p>",
        "id": 153825891,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462803201
    },
    {
        "content": "<p>Thank you very much, I'll do that :)</p>",
        "id": 153825921,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1462804510
    },
    {
        "content": "<p>Who should set the <a href=\"http://bundle.id\" target=\"_blank\" title=\"http://bundle.id\">bundle.id</a> on a document? It is mandatory, but if you post it to a server, it is not allowed to have a value.<br>\nTo make it more complex: In our situation we will have a system that assembles a document bundle and will post it to two different servers (like one in CC, since they can probably not retrieve it from each other). So we want the constructor (our system) to assign the id (probably a guid). But that should not be accepted on the server when we POST it to &lt;server&gt;/Bundle.</p>",
        "id": 153835604,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1467197496
    },
    {
        "content": "<p>I don't think you can post to /bundle</p>",
        "id": 153835659,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467208058
    },
    {
        "content": "<p>according to the spec(<a href=\"http://hl7-fhir.github.io/documents.html#bundle\" target=\"_blank\" title=\"http://hl7-fhir.github.io/documents.html#bundle\">http://hl7-fhir.github.io/documents.html#bundle</a>): This works like a normal end-point for managing a type of resource, but it works with whole document bundles - i.e. a read operation returns a bundle, an update gets a bundle and a search returns a bundle of bundles - I took that to mean you could store a document there...</p>",
        "id": 153835710,
        "sender_full_name": "David Hay",
        "timestamp": 1467222564
    },
    {
        "content": "<p>right, you can. but not POST, you'll have to PUT</p>",
        "id": 153835765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467236343
    },
    {
        "content": "<p>Interesting. Why the difference? What id do you use?</p>",
        "id": 153835818,
        "sender_full_name": "David Hay",
        "timestamp": 1467256833
    },
    {
        "content": "<p>because the id is fixed for a document, and the server can't reassign it </p>",
        "id": 153835822,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467257579
    },
    {
        "content": "<p>Gotcha. The id to use is the document id. makes sense - thanks...</p>",
        "id": 153835824,
        "sender_full_name": "David Hay",
        "timestamp": 1467257738
    },
    {
        "content": "<p>Thanks. Added a <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10267&amp;start=0\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10267&amp;start=0\">gForge tracker item</a> to clarify this in the spec.</p>",
        "id": 153836289,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1467626079
    }
]