[
    {
        "content": "<p>Hi everyone,<br>\nI'm trying to track patient-logged symptoms. I've read in the docs that an Observation type of resource is recommended for this, and I like to keep my Observations standardized according to a codeable concept. I'm thinking of using LOINC codes. There are LOINC codes representing many kinds of the symptoms I'd like to track, but they're often associated with some kind of diagnostic tool for a condition (which I don't mean to fill on behalf of the user), or come from several different survey sets that are alternatives to each other in some ways. Would it make sense to record information using a variety of survey instruments, and standardizing them (via LOINC codes) as if they could be exported, when they are just reported by the user?</p>",
        "id": 183877843,
        "sender_full_name": "Dina",
        "timestamp": 1576784312
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 183884044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576788753
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254911\">@Dina</span> I'm wondering if you could provide some examples of the patient-logged symptom data that you are wanting to represent using FHIR?  From your description my first thought is that SNOMED CT may be more appropriate for coding this data than LOINC (or you may want to use both), but looking at some data should help to determine if that actually is the case.</p>",
        "id": 183893184,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1576795744
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> I'm starting off with symptoms like anxiety, several different areas where there could be pain, nausea, fever, fatigue, some mood symptoms, brain fog, paranoia, as some examples. <br>\nI see that there was some kind of coordination effort between LOINC and SNOMED CT but I wasn't able to find SNOMED CT terms in the LOINC db, so I guess I would have to download SNOMED's files - is that right? Thank you.</p>",
        "id": 183946584,
        "sender_full_name": "Dina",
        "timestamp": 1576856740
    },
    {
        "content": "<p>yes</p>",
        "id": 183971051,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576874467
    },
    {
        "content": "<p>but maybe you should use a terminology server - it will be a lot easier to let someone else do the work for you</p>",
        "id": 183971068,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576874488
    },
    {
        "content": "<p>SNOMED CT clearly is what you need for coding symptoms as you've described.  And I was going to suggest the same as Grahame.  I would recommend using the terminology server, as I think you will find it to be the best approach, both as you are starting out and for the long term.</p>",
        "id": 184038725,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1576988705
    },
    {
        "content": "<p>Bringing over <a href=\"#narrow/stream/179255-questionnaire/topic/Observation-category.20for.20symptoms\">another question</a> to this stream:.<br>\nWhen capturing symptoms using an Observation, what should be the category code?</p>",
        "id": 247732231,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1627663100
    },
    {
        "content": "<p>I'd think the current valueset is missing one code - symptoms</p>",
        "id": 247732295,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1627663141
    }
]