[
    {
        "content": "<p>With regards to clinical procedures, I am looking to see how we can record consent (<a href=\"http://hl7.org/fhir/STU3/consent.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/consent.html\">http://hl7.org/fhir/STU3/consent.html</a>) but also we have occasions where patients actively dissent from procedures  - how should this be recorded with FHIR?</p>",
        "id": 187532586,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1580981523
    },
    {
        "content": "<p>The consent resource is capable of recording <code>opt-out</code> and <code>deny</code> decisions by the patient which I think would cover the case for <em>dissent</em>. If you can share more about your use-case we'd be able to discuss how those decisions can be modeled with more details.</p>",
        "id": 187559442,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1581004020
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span>  example dissent scenarios are:</p>\n<p>-- Dissent to having a flu immunization<br>\n-- Dissent to a surgical procedure</p>",
        "id": 187565480,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1581007722
    },
    {
        "content": "<p>For the Immunization refusal, that can be captured in an Immunization resource itself. In R4, .status can be \"not-done\" with the reason in .statusReason. In R3, the elements are a bit different (.notGiven and .explanation.reasonNotGiven) but it's basically the same. Consent still be used if you want to have a consistent method for recording lack of consent regardless of what the procedure is.</p>",
        "id": 187578009,
        "sender_full_name": "Craig Newman",
        "timestamp": 1581015957
    },
    {
        "content": "<p>I think there is a different between lack of consent and and refusal (dissent). Lack of consent is not actively tied to a specific event or action by the patient but a refusal is. For example, if a patient has signed a form  and refused a specific procedure, then that can certainly be captured in a consent resource using the opt-out or deny provisions. But \"lack of consent\" is a different state which may result in workflow decisions (e.g., direct patient to a consent form).</p>",
        "id": 187579297,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1581016788
    },
    {
        "content": "<p>The Treatment Consent use case was added in R4 with the addition of the Treatment scope.  Using STU3 for that kind of consent isn't in the design.  If you need that, it may be possible to add an extension that creates the equivalent by making the Consent as \"treatment\".</p>",
        "id": 187585874,
        "sender_full_name": "David Pyke",
        "timestamp": 1581021237
    },
    {
        "content": "<p>Thanks for your comments - plenty to think about. We'll be delivering STU3 and R4 versions so we will have to shape it accordingly.</p>",
        "id": 187589300,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1581023528
    }
]