[
    {
        "content": "<p>If someone has to store the resource creation date without implementing versioning then how to store?</p>\n<p>by reading lastUpdated gives the meaning that when a resource was last updated using the \"Update\"  FHIR operation but it actually refers to when the version of a resource lastly updated.</p>\n<p>using lastUpdated as creation date could be a workaround! but I am surprised why we don't have creation date in \"Meta\" datatype ?</p>\n<p>1. The lastUpdated might be changed to lastVersionUpdated</p>\n<p>2. \"Meta\" datatype might also have creation date</p>",
        "id": 154018800,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1542284593
    },
    {
        "content": "<p>Is creation date the creation date on this server or the creation of the original record?  Have you considered using Provenance?</p>",
        "id": 154018819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542286998
    },
    {
        "content": "<p>The creation date of a resource when a resource was created in a server.</p>",
        "id": 154018840,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1542289705
    },
    {
        "content": "<p>If you don't support _history, then you're looking at either Provenance or an extension</p>",
        "id": 154018858,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542293102
    },
    {
        "content": "<p>Has this been / would this be discussed in Infrastructure as a core optional element?</p>",
        "id": 154019539,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1542629885
    },
    {
        "content": "<p>This is why we have Provenance... I don't think we should duplicate the function of Provenance bluntly in all Resources.</p>",
        "id": 154019561,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542636294
    },
    {
        "content": "<p>So for just storing the creation date of a resource, creating another resource! isn't it too complex for a small operation?</p>\n<p>Provenance is very good to have granular record of activities about the resources. But I think a resource should have  basic metadata as every resource already have some fields so why can't we have creation date in Meta datatype?</p>",
        "id": 154019585,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1542641181
    },
    {
        "content": "<p>so it is okay to duplicate some elements of Provenance... This is a decision each Resource makes.  Some resources do need the creation time, and they have an element for that.  See the W5 report <a href=\"http://build.fhir.org/fivews.html#mappings\" target=\"_blank\" title=\"http://build.fhir.org/fivews.html#mappings\">http://build.fhir.org/fivews.html#mappings</a></p>",
        "id": 154019593,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542642430
    },
    {
        "content": "<p>Awesome! exactly what I need in some resources especially in Patient. the recorded element</p>\n<p>I think which resource needs the creation time is the requirement and decision of the consumer, so what I would say that recorded element may move to the Meta datatype</p>",
        "id": 154019609,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1542644608
    },
    {
        "content": "<p>Whether it gets added to core depends on whether we think it's something that most systems will support for all resources.  So far, the answer to that has been \"no\".  But it's probably reasonable to define an extension.</p>",
        "id": 154019646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542658964
    },
    {
        "content": "<p>I am also stuck between these 2 extremes, the cases where you just have minimal data, then it keeps going till you have all the data of a provenance or auditevent resource. My use cases has the user that created the original resource, and then the current update user.</p>",
        "id": 154022458,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543835711
    },
    {
        "content": "<p>Same boat here (nice and simple with meta vs. more complicated with provenance). The other use case that i think might justify having created in the meta is that search by \"lastUpdated\" and \"Created\" (and... comparing if the last update was in fact a create), are fairly common use case for us.</p>\n<p>Once i need to get into \"last updated by\", \"created by\", etc... then provenance starts becoming justified.</p>",
        "id": 154024108,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1544461247
    }
]