[
    {
        "content": "<p>As part of a birth defects reporting problem, we're looking to capture information about the patient's mother and father. For the most part, RelatedPerson works but there are a few things I'm not sure how to handle:<br>\n1) If we need to make observations about the parent (education level, alcohol/drug use, chemical exposures, etc) what is the best way to do that? Observation isn't allowed to point to a RelatedPerson. Should we create extensions for RelatedPerson or should the parents themselves also be Patient resources (even if they may not actually be a patient)?<br>\n2) If the parent is represented using RelatedPerson but they are deceased (we still want to capture information on them), does that violate the spirit of RelatedPerson as someone \"that is involved in the care for a patient\"?</p>",
        "id": 186823912,
        "sender_full_name": "Craig Newman",
        "timestamp": 1580242622
    },
    {
        "content": "<p>where does RelatedPerson enter the picture? Only when the parents do something ?</p>",
        "id": 186824623,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580243076
    },
    {
        "content": "<p>Observation - Observation.subject is the baby. Focus is the Parent (which answers my question above... duh... that would be RelatedPerson. You should make a task to clarify the definition of RelatedPerson for this use case</p>",
        "id": 186824737,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580243155
    },
    {
        "content": "<p>Just to make sure I have it clear, the Observation should have a subject on the baby even though the Observation is about the mother herself (her education level, alcohol use, etc) or is subject not populated at all, just focus?</p>",
        "id": 186827974,
        "sender_full_name": "Craig Newman",
        "timestamp": 1580244991
    },
    {
        "content": "<p>the observation is about the subject, but made on the mother. So </p>\n<p>subject = baby<br>\nfocus = mother</p>\n<p>populate both</p>",
        "id": 186828363,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580245251
    },
    {
        "content": "<p>And when you say \"You should make a task to clarify the definition of RelatedPerson for this use case\", does that mean a JIRA ticket to update the description of RelatedPerson to account for the fact that may still be important even if they aren't involved in patient care or decision making?</p>",
        "id": 186831882,
        "sender_full_name": "Craig Newman",
        "timestamp": 1580247494
    },
    {
        "content": "<p>yes</p>",
        "id": 186831983,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580247570
    },
    {
        "content": "<p>done - <a href=\"https://jira.hl7.org/browse/FHIR-25727\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-25727\">https://jira.hl7.org/browse/FHIR-25727</a></p>",
        "id": 186883366,
        "sender_full_name": "Craig Newman",
        "timestamp": 1580303266
    },
    {
        "content": "<p>Sorry, I am confused. The question is about an observation about father or mother.</p>\n<p>Patient = baby<br>\nObservation.subject = father<br>\n??</p>",
        "id": 187155056,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1580549145
    },
    {
        "content": "<p>it's subject and focus  not patient and subject - that's what OO have said.</p>",
        "id": 187155532,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580550135
    },
    {
        "content": "<p>patient = in which persons record this will be stored, relevant for the treatment of that specific person (in the older Hl7v3 standard this was called recordTarget)<br>\nsubject = clinical subject of the observation</p>",
        "id": 187240030,
        "sender_full_name": "René Spronk",
        "timestamp": 1580715358
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Ok, understood.</p>\n<p>So the subject is not the clinical object.<br>\nBut in this case focus is on mother we have to use a modifier-extension  that focus is not on the subject in order to distinguish it from 'normal' observations.</p>",
        "id": 187244639,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1580721205
    },
    {
        "content": "<p>no I don't understand that. Focus is a modifier element that says that</p>",
        "id": 187258473,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580734140
    },
    {
        "content": "<p>How would the Observation.subject = baby and Observation.focus = parent work for multiple pregancies (twin, triplets, etc)?<br>\nIn the case of say Mother's Education, you'd need to have one Mother's Education Observation for each baby in the pregnancy?</p>",
        "id": 230926399,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1616096724
    },
    {
        "content": "<p>Pretty much - because each baby would have its own patient record.</p>",
        "id": 230930641,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616098614
    },
    {
        "content": "<p>Right - thanks...</p>",
        "id": 230935271,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1616100589
    },
    {
        "content": "<p>vaguely related, is there any place to convey responsible proxies?<br>\nfor children, that's likely to include parents, foster parents, gov't employees/roles in the case of a ward of the state</p>",
        "id": 231468542,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616505685
    },
    {
        "content": "<p>THat's normally done via RelatedPerson</p>",
        "id": 231468615,
        "sender_full_name": "David Pyke",
        "timestamp": 1616505718
    },
    {
        "content": "<p>tx. are there valuesets like <a href=\"https://www.hl7.org/fhir/valueset-parent-relationship-codes.html\">https://www.hl7.org/fhir/valueset-parent-relationship-codes.html</a> that apply to legal cases like the proxies listed above?</p>",
        "id": 231473154,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616507445
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span>  - did you end up going with Observation.focus pointing to a RelatedPerson?  We are looking at <a href=\"http://jira.hl7.org/browse/FHIR-25727\">FHIR#25727</a> and are curious what you ended up doing.</p>",
        "id": 238534775,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1620849528
    },
    {
        "content": "<p>We're still tentatively going that way (work on that FHIR IG has hit a bit of a lull, so we haven't got much implementation feedback yet). Some of the profiles we were going to create have been consumed by a more general Public Health profile library but we had the same questions. <br>\n<span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span> - the PH profiles are still using Observation.focus for RelatedPerson observations (eg Father's education) right?</p>",
        "id": 238793619,
        "sender_full_name": "Craig Newman",
        "timestamp": 1621009930
    },
    {
        "content": "<p>Yes, that's correct - subject is baby and focus is parent.</p>",
        "id": 238824952,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1621024109
    },
    {
        "content": "<p>We are looking into this use case as well and have come to a few conclusions:</p>\n<p><strong>As stated already above</strong></p>\n<ul>\n<li>Observation.subject --&gt; the patient to who's record the Observation belongs</li>\n<li>Obseravtion.focus --&gt; the relative (e.g. mother/father)</li>\n</ul>\n<p><strong>Additionally</strong></p>\n<ul>\n<li>Observation.code --&gt; should not pre-coordinate the fact that this is someone else's Observation, ie use a concept for Body Height as opposed to Mother's Body Height. Reason for this is that otherwise there is a room for ambiguity with how to use focus (is it needed? if used, could it be the grandmother/fathers height) as well as scalability issues with precoordinating such concepts. </li>\n</ul>\n<p><strong>Additional discussions/thoughts</strong></p>\n<ul>\n<li>Why is there an explicit FamilyMemberHistory to use for certain family member information? Why not just use Condition with a focus element (or use the focus pattern on any more \"fundamental\" resource to which there could be another focus than the subject, feels like it scales better)? </li>\n<li>Even if we stick with FamilyMemberHistory, why not use the same naming conventions as in Observation to make this use case easier for implementers. Ie, use FamilyMemberHistory.focus as opposed to FamilyMemberHistory.???</li>\n<li>There also seems to be some overlap between FamilyMemberHistory and RelatedPerson, why not reference a related person in the FamilyMemberHistory instead of explicitly specifiying several elements that exist on RelatedPerson?</li>\n</ul>\n<p>This is a common use case in healthcare, and it is difficult for implementers to know how to support these use cases. Hence a pattern for how to do this type of thing would be nice.</p>",
        "id": 239099662,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1621262004
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 239136637,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621275561
    },
    {
        "content": "<p>From my reading of <span class=\"user-mention\" data-user-id=\"197234\">@Martin Grundberg</span>  comments,  he  is asking why all the other events resources don't use the subject/focus pattern to which I will not comment.  As far as for Observation, I agree with assessment, although I don't have a lot of 1st or 2nd hand experience with use that element in use cases.  ( it is, after all still DSTU)  I do agree that their is a choice of using code \"mom's height\" vs using focus = \"mom\" and code = height.  And a tracker to clarify this should be made.</p>",
        "id": 239180354,
        "sender_full_name": "Eric Haas",
        "timestamp": 1621298095
    },
    {
        "content": "<p>I think because capturing drug administrations or procedures for a mother/father/etc. is exceptionally rare.</p>",
        "id": 239182084,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621299426
    },
    {
        "content": "<p>For those interested, there's a subgroup in Patient Care where modelling of child/birthCare in various jurisdictions (Aus, UK, NL, others joining) is discussed: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=86973863\">https://confluence.hl7.org/pages/viewpage.action?pageId=86973863</a> Feel free to join.</p>",
        "id": 239241530,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1621339794
    }
]