[
    {
        "content": "<p>Hi all. We need to have recurring appointments in our system, e.g. an appointment that is every Monday from 2 PM to 3 PM. Based on the appointment documentation: \"The resource only describes a single meeting, a series of repeating visits would require multiple appointment resources to be created for each instance.\" we intend to create an appointment for each date that meets the recurrence in a time window (6 months). But we also need to mark the appointment as recurring (using an extension). What is the right thing to do for creating these recurring appointments?</p>",
        "id": 230919758,
        "sender_full_name": "Yagami L",
        "timestamp": 1616093878
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 230926323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616096685
    },
    {
        "content": "<p>What is the best way to handle recurring appointments? Any advice please?</p>",
        "id": 231026597,
        "sender_full_name": "Yagami L",
        "timestamp": 1616162409
    },
    {
        "content": "<p>As I re-read your question, I'm not actually clear on the question.  You've decided to use an extension to flag them as recurring.  (You could also just point to the ServiceRequest the appointments are based on.)  There's no 'special' mechanism to create them - the system either generates them itself or you create them one at a time over the REST interface or create them in bulk using 'batch'.</p>",
        "id": 231027131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616162632
    },
    {
        "content": "<p>Currently we create appointments in our ehr from outlook appointments, but we ignored the recurring ones. Our idea is to create these recurring appointments in a bundle transaction in a time window (6 months). If a recurring appointment changes in Outlook, we update and delete it if necessary on our side (in real time). But we also need to mark these appointments in some way so that our system treats them differently.<br>\nWe wanted to know if this approach is correct? Or any advice? Thanks</p>",
        "id": 231030837,
        "sender_full_name": "Yagami L",
        "timestamp": 1616164090
    },
    {
        "content": "<p>The overall appointment that says \"this needs to happen ever Tuesday at noon for the next 2 years\" wouldn't be an Appointment - it would be a ServiceRequest (or possibly a different request resource).  Individual appointments would then be 'basedOn' that ServiceRequest.  When the ServiceRequest is revised, future Appointments scheduled based on that ServiceRequest would be modified (or cancelled and re-created).  However, the fact that an Appointment points to a ServiceRequest isn't enough to tell you that it's part of a repeating set.  Your notion of using an extension to distinguish them seems reasonable.  I don't know enough about the space to say whether there's a better way.</p>",
        "id": 231032583,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616164718
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> <span class=\"user-mention\" data-user-id=\"191797\">@Irma Jongeneel</span></p>",
        "id": 231032613,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616164727
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 231034251,
        "sender_full_name": "Yagami L",
        "timestamp": 1616165293
    },
    {
        "content": "<p>That does indeed sound quite reasonable.<br>\nWe havent tackled recurring appts yet for many of the reasons above.<br>\nIf I was doing that mapping I would be including the id from Outlook appt in the apps so you could directly get to them to update. Including doing the variations/cancellations of specific instances.<br>\nAnd while I'm here take extra care on timezones with your start/ends,  recurrences may make that painful if you don't consider that the appt is in a state that has daylight savings time, and you're storing utc. That would make your recurring 9am go to 10am, (or worse if it was an international appt where you could get a 2 hour shift, like I get for hl7 meetings with us folks)</p>",
        "id": 231084610,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1616185393
    },
    {
        "content": "<p>A 3pm is eastern US appt is 5am (Australia) during winter for me, and 7am during summer, and 6am during the changeover intervals which changes over the years too.</p>",
        "id": 231084861,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1616185490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> - do you think there's enough known to propose defining a standard extension at this point or should we wait for more experience first?</p>",
        "id": 231093247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616189873
    },
    {
        "content": "<p>PA is now starting to consider defining recurring appointments, if you want to join in on the fun, come to our weekly calls, Wed 3p eastern, or just track things on the project page here<br>\n<a href=\"https://confluence.hl7.org/display/PA/Recurring+Appointments\">https://confluence.hl7.org/display/PA/Recurring+Appointments</a></p>",
        "id": 243705386,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624478805
    }
]