[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=7936\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=7936\">GF#7936</a> asks about the use and meanings of redirects, particularly in the context of patient merge. It's an old issue that has never got enough interest to get traction. As things stand, we may take this up in Release 5. does anyone have strong feelings about this?</p>",
        "id": 153936966,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518467389
    },
    {
        "content": "<p>Good day! This is my first time to integrate FHIR. May I ask if it allows and how to add multiple redirect URI on the cerner code console apps? because I can't add multiple redirect uri on the same app. Thanks!</p>",
        "id": 194888477,
        "sender_full_name": "Mark Urian",
        "timestamp": 1587531216
    },
    {
        "content": "<p>you are more likely to get an answer to this question on the cerner support forums</p>",
        "id": 194889260,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587532543
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"295545\">@Mark Urian</span> the Cerner support Google group is <a href=\"mailto:cerner-fhir-developers@googlegroups.com\" title=\"mailto:cerner-fhir-developers@googlegroups.com\">cerner-fhir-developers@googlegroups.com</a>. Last time I checked Cerner supported only a single redirect URL per client, if you need more you need multiple registrations</p>",
        "id": 194928642,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1587561595
    },
    {
        "content": "<p>To get back to Grahame's original question: For distributed implementations you'd probably need to do redirects, as one can't guarantee referential integrity over multiple FHIR servers. In my FHIR training courses, I use a $merge operation (on Patient instances, as an example operation) with an IN parameter : \"redirect\" of type Boolean to give the client control over whether or not a redirect should be created.</p>",
        "id": 195190581,
        "sender_full_name": "René Spronk",
        "timestamp": 1587736427
    },
    {
        "content": "<p>Just to chime in on the topic of redirects around patient merge, since Grahame's initial question in this topic back in 2018, PA has done a lot of work on defining merge behavior, including dealing with redirects.  It isn't in the build yet, but the content we have is on <a href=\"https://confluence.hl7.org/display/PA/Merge+Operation\" title=\"https://confluence.hl7.org/display/PA/Merge+Operation\">Confluence</a>.  Note that while the page is titled \"Merge Operation\", it has a lot more info about merge behavior than just the operation itself.</p>",
        "id": 195194511,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1587738107
    }
]