[
    {
        "content": "<p>I'm scratching my head about about a <a href=\"https://github.com/jamesagnew/hapi-fhir/issues/564\" target=\"_blank\" title=\"https://github.com/jamesagnew/hapi-fhir/issues/564\">bug</a> that was submitted to HAPI.</p>\n<p>Say I have a resource with a field that has cardinality <code>0..*</code>, such as <code>Patient.name</code>. If I define a profile that reduces the cardinality of this field to <code>0..1</code> is it valid to then serialize the field as a simple HumanName object instead of an array of HumanName object?</p>",
        "id": 153872426,
        "sender_full_name": "James Agnew",
        "timestamp": 1487346777
    },
    {
        "content": "<p>Hi James, I think that serialization should always adhere to the original structure of the base profile. Otherwise you would break to contract of the base profile.</p>",
        "id": 153872427,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1487347307
    },
    {
        "content": "<p>I would not expect to be able to parse that, since I'd still be expecting an array for <code>Patient.name</code> in JSON.</p>",
        "id": 153872429,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1487347399
    },
    {
        "content": "<p>Right</p>",
        "id": 153872430,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1487347408
    },
    {
        "content": "<p>I'm inclined to agree with this logic. I suspect HAPI isn't doing the right thing here.</p>",
        "id": 153872432,
        "sender_full_name": "James Agnew",
        "timestamp": 1487347888
    },
    {
        "content": "<p>Serialization is always based on the resource and data type cardinality, not the profiled cardinality.  (One schema to rule them all! :))</p>",
        "id": 153872438,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487350850
    },
    {
        "content": "<p>yes, it still has to be an array. in terms of the profile, the fact that it's an array rather than a singleton is still available</p>",
        "id": 153872453,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487356260
    },
    {
        "content": "<p>I had a similar question about changing the cardinality of a field from <code>0..*</code> to <code>1..1</code> within a profile. From what I understand, the value should still be an array with 1 element. Is that correct? Otherwise, the base (de)serializers will not work at all.</p>",
        "id": 153873063,
        "sender_full_name": "Anand Mohan Tumuluri",
        "timestamp": 1487795767
    },
    {
        "content": "<p>Even then, wont this break the profile validation? It needs to treat cardinality altered in a profile separately from the cardinality specified in the base.</p>",
        "id": 153873064,
        "sender_full_name": "Anand Mohan Tumuluri",
        "timestamp": 1487795938
    },
    {
        "content": "<p>It shouldn't break profile validation.  The validator should be aware of whether it's looking at the original resource/data type definition vs. a constraining profile</p>",
        "id": 153873065,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487796239
    }
]