[
    {
        "content": "<p>We are recommending our clients to  use the Reference.identifier filled with a business identifier in cases where they need a reference to a resource of which they do not know the id yet.</p>\n<p>However, in case of references that can have multiple types, we are not sure how to figure out what the type of the linked resource in the server. Would it be required to register each possible value of Reference.identifier.system, and map that to a resource type? What approaches have other people used to address this challenge?</p>",
        "id": 153893685,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1497424169
    },
    {
        "content": "<p>I had previously identified this issue and requested that type be added to the Reference data type but that was turned down so in resources where the resource type is variable, sometimes it is known to be of a single type, we have specified a companion element to convey the resource type.</p>",
        "id": 153893777,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1497454771
    },
    {
        "content": "<p>I expected Reference.identifier.type to hold the resource type.  using <a href=\"http://build.fhir.org/valueset-resource-types.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-resource-types.html\">http://build.fhir.org/valueset-resource-types.html</a></p>",
        "id": 153893781,
        "sender_full_name": "John Moehrke",
        "timestamp": 1497455287
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> But isn't Identifier.type intended to specify the type of the identifier itself, not the type of the  identified object?</p>",
        "id": 153893782,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1497455489
    },
    {
        "content": "<p>possibly. I didn't say I was authoritative... I just said that I expected it... Seems like the 'kind' of identifier is the 'kind' of object the identifier points at... so not sure one way or the other.  There is no useful code in the valueset provided, so I used logic to extend to the other valueset.</p>",
        "id": 153893783,
        "sender_full_name": "John Moehrke",
        "timestamp": 1497455693
    },
    {
        "content": "<p>Maybe FHIR should provide a standard extension to specify the type of a reference target?</p>",
        "id": 153893784,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1497456226
    },
    {
        "content": "<p>Reference.identifier.type is definitely the type of the identifier, not of the resource.<br>\nTo my understanding of the use case, the identifier is used as a kind of promise that there will be a resource with the very same identifier at some point in the future. I suppose this is beyond the 80% rule, so a standard extension as <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> says, may be useful.</p>",
        "id": 153893785,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1497456431
    },
    {
        "content": "<p>On the other hand, there still is the paradigm that references always should point back in time, which implies that one (theoretically) should never have the problem of not knowing the referenced resource's id.</p>",
        "id": 153893786,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1497456711
    },
    {
        "content": "<p>Isn't it thought to be either a reference to an existing resource or an identifier of some entity beyond the scope of the specific implementation?</p>",
        "id": 153893787,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1497456891
    },
    {
        "content": "<p>Agree that Reference.identifier.type should not be used to convey the resource type - though occasionally it may communicate that incidentally.  (If it's a medical record number, the resource is likely Patient; if it's a provider licence number, it's likely Practitioner)  My expectation is that how the identifier gets resolved to a resource relies on process rules outside the scope of the spec.  Some systems won't be able to resolve at all - and there's no expectation that systems must or should be able to.  Some systems will be able to take the combination of Identifier.type, system and value and possibly some look-up processes to figure out what they're dealing with.</p>",
        "id": 153893793,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497458360
    },
    {
        "content": "<p>All, Thanks for the replies. So I am looking for a standard FHIR extension now,  otherwise we will have to define our own.<br>\n<span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>, the \"companion element\" you mention, I assume is also an extension? What is the extension.url  that you are using? I am curious if it would be worth promoting to a standard extension</p>",
        "id": 153894317,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1497865284
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192814\">@Theo Stolker</span> Feel free to submit a tracker item</p>",
        "id": 153894365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497883762
    },
    {
        "content": "<p>Done, see <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13543&amp;start=7550\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13543&amp;start=7550\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13543&amp;start=7550</a></p>",
        "id": 153894517,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1497941448
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192814\">@Theo Stolker</span> We aren't using an extension, we have an element named 'resource' adjacent to the identifier element which contains the resource type - it was called resourceType but that caused a conflict with JSON parsers due</p>",
        "id": 153896142,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1499288727
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>, you cannot just add properties in a FHIR message, so your reply doesn't make sense. We will use an extension, since that is the only way to exchange additional information.</p>",
        "id": 153896480,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1499692638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192814\">@Theo Stolker</span> Where our committee has identifier situations where the 'referred' to resource would not be known we have added an element to the resource to provide that information. You could either suggest similar changes to resources or add an extension.</p>",
        "id": 153896493,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1499708372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> , I have studied <a href=\"http://build.fhir.org/references-definitions.html#Reference.identifier\" target=\"_blank\" title=\"http://build.fhir.org/references-definitions.html#Reference.identifier\">http://build.fhir.org/references-definitions.html#Reference.identifier</a> and <a href=\"http://build.fhir.org/datatypes.html#Identifier\" target=\"_blank\" title=\"http://build.fhir.org/datatypes.html#Identifier\">http://build.fhir.org/datatypes.html#Identifier</a> and I do not see te element you said has been added. Where can I find it?</p>",
        "id": 153896494,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1499709014
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192814\">@Theo Stolker</span> An element does not exist in either the identifier or specifically within the reference datatypes to disambiguate the resource which the identifier identifies. In some resources, such as Claim, where the payee may be one of a small set of resource type we added a resourceType element to record the type of the resource if the payee.identifier is used. (Note, in the current build we are planning to change the way that concept is represented to be a code but the pattern of use will remain - unless of course a type element for the resource is added to the reference datatype).</p>",
        "id": 153896618,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1499800309
    },
    {
        "content": "<p>FHIR Core-team -- Please help us understand Reference.identifier use. The current specification seems to say I can put 'any' business identifier into this, yet elsewhere say that it can only be a business identifier that would identify a FHIR Resource, yet I can't even identify what kind of Resource to go looking for. This needs clarification. Who is responsible for clarifying (MNM, FHIR-I, etc) ? When will this be discussed? How can I track this to conclusion. Security (AuditEvent, and Provenance) need resolution as both cases have times when an identifier is all that is known. Consent also has need when a rule is made about data identified by identifier... Please help</p>",
        "id": 153896746,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499875585
    },
    {
        "content": "<p>The reference points to a \"logical\" resource.  It may not be something that is actually exposed or retrievable in FHIR form, but it must refer to a business object that would, if expressed in FHIR, correspond to one of the resources allowed for the reference.  It's not clear why you'd need to know what specific resource type applies - resolution is done via business processes, not FHIR.  You've got a globally unique identifier.  That means that someone ought to recognize the identifier.system and understand where to find things identified by that system, go retrieve that thing, figure out what it is and behave accordingly.  Why would AuditEvent or Provenance care what type of resource the identifier corresponds to?</p>",
        "id": 153896753,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499877381
    },
    {
        "content": "<p>Audit and Provenance doesn't care. It just needs some place to put a business identifier. Given that it is often not a FHIR Reference, we need a place to save the value (e.g. HL7 v2 order number, CDA document unique ID, DICOM UID, etc). We get conflicting input that we do or do not need an additional identifier data element now that Reference includes an identifier data element. Do we? Or do we NOT? We need definitive answer that doesn't conflict across the whole of the FHIR model.</p>",
        "id": 153896755,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499877571
    },
    {
        "content": "<p>Other cases in this thread have explained why sometimes one does need t explain what type of FHIR Resource that the Resource.identifier is describing. I think that does need to be addressed too.</p>",
        "id": 153896756,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499877642
    },
    {
        "content": "<p>Well, the question is whether you're referencing something that's a logical resource or not.  If the answer is you might reference things that <em>can't</em> be expressed as a resource, then you can't use Reference.</p>",
        "id": 153896757,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499877833
    },
    {
        "content": "<p>okay, but... an HL7 v2 order, CDA document, DICOM UID  ... all could be business identifiers that could be found in FHIR resources</p>",
        "id": 153896764,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499883977
    },
    {
        "content": "<p>My interpretation is that all of those would be fine as Reference.identifier</p>",
        "id": 153896770,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499886301
    },
    {
        "content": "<p>If I have a Reference.identifier which is an OID, is there a way that I can tell whether that is the business identifier for an ImagingManifest or to an ImagingStudy, or some other resource?</p>",
        "id": 153896772,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1499889389
    },
    {
        "content": "<p>Nope.  Not unless something elsewhere in the instance gives you a hint.</p>",
        "id": 153896773,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499889907
    },
    {
        "content": "<p>In theory if you know the OID hierarchy you might know</p>",
        "id": 153896774,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499889934
    },
    {
        "content": "<p>That is why previously in this thread there was interest in qualifying the Reference.identifier with a Resource type identification. I think it should exist, rather than everyone needing to use an extension.</p>",
        "id": 153896775,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499890162
    },
    {
        "content": "<p>Just to get specific... Provenance.entity.what[x] structure should be simplified to just a Reference, or is good (needing guidance such as <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13570\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13570\">GF#13570</a> )? Note that Provenance has the additional URI element where source entity used isn't even a business identifier but just a URI. Similar for AuditEvent.entity (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13571\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13571\">GF#13571</a> ) ---- advice from FHIR core-team is welcome.</p>",
        "id": 153896776,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499891154
    },
    {
        "content": "<p>what's the interaction between the type of the resource referenced, and the identifier.type?</p>",
        "id": 153896779,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499891313
    },
    {
        "content": "<p>So the question I have is - why do you need to know what type of resource the identifier might resolve to?  How does that change what you're doing with the Provenance or AuditEvent?</p>",
        "id": 153896785,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499895505
    },
    {
        "content": "<p>See <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13543\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13543\">GF#13543</a> by <span class=\"user-mention\" data-user-id=\"192814\">@Theo Stolker</span>  - I am interested, but this issue is not mine.</p>",
        "id": 153896824,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499947128
    },
    {
        "content": "<p>We have wondered, given only an ID, how one would know which type of Resource it represents. In the context of Provenance.entity.what[x] can point at ANY Resource; so, to  validate against a StructureDefinition that might say that at least one entity must be an Observation; there would be no way to check this.</p>",
        "id": 153896825,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499947194
    },
    {
        "content": "<p>not everything can be checked</p>",
        "id": 153896848,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499957440
    },
    {
        "content": "<p>understood... but if I know what type of a Resource the identifier would be about, where can I say that? So, I know that it is a DICOM UID, and would be an ImagingStudy Resource... No way for me to say that?</p>",
        "id": 153896852,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499957602
    },
    {
        "content": "<p>But, my problem is... Can I use Reference.Identifier for business identifiers that are NOT ever a FHIR Resource type. So I have a CDA document unique ID; can I put that into Provenance.entity.whatReference.identifier; or does Provenance need to continue to have Provenance.entity.whatIdentifier for this use-case? Or where I have a URL to some evidence on a web-page, do I need Provenance.entity.whatURI to hold that, or can that too go into a Reference.identifier. My problem is some are saying that Provenance.entity.what[x] should be simplified to just a Reference as Reference.identifier can hold ANY business identifier regardless of if that business identifier will ever show up in a FHIR Resource.</p>",
        "id": 153896854,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499957887
    },
    {
        "content": "<p>If the data could be converted into FHIR by someone willing to do so, then I think Reference.identifier is ok to use.  (Feel free to submit a change request for us to make this clear in the spec.)  As for knowing the type of the resource, what's the use-case for saying it?</p>",
        "id": 153896872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499965660
    },
    {
        "content": "<p>We could certainly define a common extension for that, but I'm not sure it makes sense as part of core.</p>",
        "id": 153896873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499965680
    },
    {
        "content": "<p>Well, given that Binary exists.... then I guess there is no need for anything other than Reference.identifier.  I think this is going to get confusing, as the logic says that Provenance.entity.what[x] should be simplified into just a Reference.</p>",
        "id": 153896877,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499966991
    },
    {
        "content": "<p>There's also Basic</p>",
        "id": 153896889,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499978884
    }
]