[
    {
        "content": "<p>Hi all, I'm looking at some of our references to Practitioner, and wanted to get your thoughts on if reference.display can (or should) differ for the same literal reference based on context.</p>\n<p>For <a href=\"http://DocRef.author\">DocRef.author</a>, we currently send a literal reference + a display (for systems that don't need the literal reference):</p>\n<div class=\"codehilite\"><pre><span></span><code>  &quot;author&quot;: [\n    {\n      &quot;reference&quot;: &quot;Practitioner/exvj0qm8HL0mczaMbkp1UfC-IFikz4CuJFjuDhBZvLn03&quot;,\n      &quot;display&quot;: &quot;Provider, Sample RN&quot;\n    }\n  ],\n</code></pre></div>\n<p>However,  a Practitioner's display name may change over time - Provider, Sample RN today may become Provider, Sample NP tomorrow. We can document the Practitioner's name history in Practitioner itself, but we're not sure what we should do for these display references. Would it be better to:</p>\n<p>1) Use the Practitioner's name as of the time of the request? (i.e. display will be Provider, Sample NP for all notes, regardless of name at time of note writing; all literal references would point to the same Practitioner resource)</p>\n<p>2) Use the Practitioner's name as of when the DocRef was last edited? (i.e. display will be Provider, Sample NP for some notes and Provider, Sample NP for other notes, but both literal references would point to the same Practitioner resource)</p>\n<p>Thanks!</p>",
        "id": 229771182,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1615421818
    },
    {
        "content": "<p>I don't think there's a right or wrong answer here.  I think of Reference.display as being the same as the human-readable text part of a hyperlink.  Multiple pages might link to the same URL and have different display texts.  The page linked to might change over time in ways that make the hyperlink text of an old reference less-accurate/appropriate.  Keep in mind that if you're changing anything about a resource (including Reference.display values) for a resource, that should trigger a new meta.lastUpdated  and meta.version.</p>",
        "id": 229775724,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615424578
    },
    {
        "content": "<p>For the case of <a href=\"http://DocumentReference.author\">DocumentReference.author</a>, however, I think 2 seems to be a better solution.</p>",
        "id": 229861000,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1615474394
    },
    {
        "content": "<p>Got it, thanks for the feedback <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  and <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> ! We'll keep the lastUpdated part in mind.</p>",
        "id": 229951961,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1615508013
    }
]