[
    {
        "content": "<p>I have a use case where it would make sense to be able to select between a set of Reference types from a list of options in a QuestionnaireResponse, preferably by using Questionnaire.item.option.value[x]. Currently option.value[x] supports the types integer|date|time|string|coding.</p>\n<p>The use case is as follows:<br>\nA citizen wants to retrieve its health records or other medical information by selecting a specific hospital. Based on this information our system could retrieve the Endpoint information for which we are going to send the Questionnaire. The Reference type, which is effectively selected by the citizen, could either point to an organization, and then we could retrieve Endpoint information based on that, or directly to the Endpoint itself.</p>\n<p>I am of course additionally coding the question, Question.item.code, so the system knows how to handle this information.</p>",
        "id": 153971420,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529911717
    },
    {
        "content": "<p>I understand that the patient's QuestionnaireResponse would not contain the information, but the source (FHIR endpoint, web site URL, possibly also just the name?) where that information can be acquired?</p>\n<p>Also, in your case item.code expresses \"where can we retrieve information about X\" rather than \"X\".</p>\n<p>If you think of it that way, why not just use valueString. Since you can't be sure that the patient's answer will be a reference to a FHIR endpoint, it technically isn't a FHIR reference.</p>",
        "id": 153971435,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1529917395
    },
    {
        "content": "<p>Re-reading, a reference might make sense when you have all these organizations as distinct resources in your system.<br>\nYou then would display <a href=\"http://Organization.name\" target=\"_blank\" title=\"http://Organization.name\">Organization.name</a> to the patient when filling the QuestionnaireResponse and retrieve the data from the FHIR endpoint defined in Organization.endpoint.<br>\nIs that your idea?</p>",
        "id": 153971438,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1529918233
    },
    {
        "content": "<p>You can certainly submit a change request for that.  We had no-one with a use-case to have References as an unumerated set of options.  It's intended for use with things like Practitioners, Locations, Organizations, etc. which you dynamically query and pick from</p>",
        "id": 153971445,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529918925
    },
    {
        "content": "<p>I would like to, and I created a user in GForge a week or two ago, but I am still not able to log in, I have not retrieved a confirmation e-mail for it either.</p>",
        "id": 153971449,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529920408
    },
    {
        "content": "<blockquote>\n<p>Also, in your case item.code expresses \"where can we retrieve information about X\" rather than \"X\".</p>\n</blockquote>\n<p>My intention was to tell the system \"What is X\", could be I should do this some other way</p>",
        "id": 153971453,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529920781
    },
    {
        "content": "<p>I looked in gForge and can't see anyone named Myhra as either a pending user or a registered user.  Can you send me a PM with the userid you registered with and I can see where things are at.</p>",
        "id": 153971460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529921758
    },
    {
        "content": "<p>What sort of resources were you looking at enumerating as options?</p>",
        "id": 153971461,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529921774
    },
    {
        "content": "<p>Made a new registration right now, maybe something went wrong the last time.</p>",
        "id": 153971469,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529922135
    },
    {
        "content": "<blockquote>\n<p>What sort of resources were you looking at enumerating as options?</p>\n</blockquote>\n<p>In this use case I was thinking of enumerating either Endpoint or Organization as options</p>",
        "id": 153971471,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529922196
    },
    {
        "content": "<p>You're expecting end-users to choose EndPoints?  Organization actually makes sense.  From a legacy perspective, it's often just a choice of strings.  However, if you're interested in converting from a QuestionnaireResponse to other resources, I can see why you might want Reference</p>",
        "id": 153971477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529922455
    },
    {
        "content": "<p>I am expecting the user to select a Hospital so Organization probably in this context, then based on that resolve to the correct Endpoint. I could cheat a bit <span class=\"emoji emoji-1f62c\" title=\"grimacing\">:grimacing:</span> and hide an Endpoint behind a Reference.display that makes sense to the user, to make it easier in the  first iteration.</p>",
        "id": 153971485,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529922899
    },
    {
        "content": "<p>More likely select the endpoint resource with the appropriate connection type details referenced to the organization</p>",
        "id": 153971493,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1529924126
    },
    {
        "content": "<p>Yep, agree</p>",
        "id": 153971524,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529926561
    },
    {
        "content": "<p>GForge issue: <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17407\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17407\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17407</a></p>",
        "id": 153971537,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529933375
    }
]