[
    {
        "content": "<p>Hi, I have the following use case: I want to store a pdf next to a DiagnosticReport (DR) resource without having to embed the pdf into the DR to prevent loading not required data and to decrease loading time as those pdfs can be quite large. I know I can store the pdf inside DR.presentedForm as an Attachment but I don't want the files to be inline.<br>\nI can imagine three possible solutions:<br>\n1) post the files as a Binary and reference the Binary from the DR or the Attachment<br>\n2) Set the Attachment.uri to the Binary<br>\n3) Use an extension<br>\nIn my eyes, posting the files as a Binary and referencing them from the Attachment (not with Binary.uri) is the best way to achieve this. What do you think?</p>",
        "id": 153937360,
        "sender_full_name": "Andreas Keil",
        "timestamp": 1518617272
    },
    {
        "content": "<p>I would suggest to post the PDF to a non FHIR REST Endpoint (as i assume that the FHIR Endpoint would put the PDFs in a DB) and then link to it from DR.Attachment in a second step).</p>",
        "id": 153937368,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1518617691
    },
    {
        "content": "<p>AFAIK, Vonk treats Binary content differently and stores it in files rather than the database, or at least it's on their roadmap (<span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> ?)<br>\nNot sure how HAPI deals with it. As far as handling the references is concerned, I think it's best to align with how IHE MHD treats the Reference between DocumentReference and Binary...</p>",
        "id": 153937375,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1518619022
    },
    {
        "content": "<p>I'm not sure what the difference between (1) and (2) is, and I'm not sure how (3) could be better. Certainly the intent we had would be an attachment.uri pointing to a binary somewhere, potentially a Binary resource.</p>",
        "id": 153937454,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518634740
    },
    {
        "content": "<p>the only downside of attachment.uri is that it can't be used to send a DiagReport &amp; Binary in one transaction bundle. Maybe it would be nice to add attachment.reference(binary), this would allow the desired usage of transferring both resources at once.<br>\nAdding the PDF in the attachment at attachment.data would lead to the PDF only living inside of the DiagReport with the downside of  a huge resource, sometimes you only want the DiagReport without the PDF, sometimes you just want to get or reference the PDF without the DiagReport.<br>\nDo you think adding attachment.reference(Binary) would make sense to solve these problems?</p>",
        "id": 153937784,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1518706836
    },
    {
        "content": "<p>Attachment.uri can certainly point to a Binary, so you can transmit both in a bundle.</p>",
        "id": 153937801,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1518707603
    },
    {
        "content": "<p>at the point of transmission i don't know yet the ID and therefore also not the uri of the Binary resource. If this would be a reference (or additional reference item) i could add a temporary ID (urn:uuid:) and the server would return the transaction bundle after posting with the actual given resource IDs. This isn't possible, as Attachment doesn't contains a reference, only uri - which wouldnt be replaced (at least we understood and tested)</p>",
        "id": 153937824,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1518712249
    },
    {
        "content": "<p>attachment uri should be replaced. according to the spec.</p>",
        "id": 153937915,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518726597
    },
    {
        "content": "<p>for this specific scenario, in fact.</p>",
        "id": 153937916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518726609
    },
    {
        "content": "<p>if the server doesn't, make a bug report against it</p>",
        "id": 153937917,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518726641
    },
    {
        "content": "<p>thanks for the clarification <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> i wasn't aware of this part of the spec.</p>",
        "id": 153938182,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1518784398
    },
    {
        "content": "<p>The fact that you can't query a Document with Metadata (DocumentReference) <em>and</em> Content (Binary) in one step, because uri doesn't support _include still disturbs me...</p>",
        "id": 153938212,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1518789052
    },
    {
        "content": "<p>you can make a task...</p>",
        "id": 153938269,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518810986
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> : Yes, it is on the roadmap to provide full support for Binary. Storing that in the database or elsewhere is an implementation choice then. Storing files in db blobs is not really a problem anymore by the way for several databases.</p>",
        "id": 153938904,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1519122938
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> I'd definitely support a change to support fetching both DR and Binary in a single fetch. Could take a number of forms - I'm not sure what guiding principles are in place for referencing Binary resources, but it seems like the \"metadata\" resources should support references to Binary.</p>",
        "id": 153939012,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1519148198
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span>, <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> I can see adding support for _include, when the target is a Binary, but would you also follow the uri if it didn't point to a FHIR resource?</p>",
        "id": 153939111,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1519159027
    },
    {
        "content": "<p>typically we'd say, server discretion, but IGs could make further rules</p>",
        "id": 153939112,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519159082
    },
    {
        "content": "<p>My first thought is that you can't put the result in a Bundle, so unless it is a FHIR resource, I'm not sure how you'd return it.</p>",
        "id": 153939113,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1519159165
    },
    {
        "content": "<p>sure you can - wrap it in a binary.</p>",
        "id": 153939114,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519159766
    },
    {
        "content": "<p>Had not thought of supporting that. Wrapping in a Binary would be possible, if we can relate a stable id to the actual 'file'.</p>",
        "id": 153939135,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1519161511
    },
    {
        "content": "<p>Could allow it to be an on-the-fly UUID if it's in the same Bundle.</p>",
        "id": 153939184,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519169226
    },
    {
        "content": "<blockquote>\n<p>Could allow it to be an on-the-fly UUID if it's in the same Bundle.</p>\n</blockquote>\n<p>would be a similar behavior to posting a binary linked through attachment inside of a Bundle.</p>",
        "id": 153939326,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1519205379
    },
    {
        "content": "<p>I think that's an interesting approach, but if the community wants it, I think we need to move quickly before Bundle behavior becomes locked down.</p>",
        "id": 153939403,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1519233139
    },
    {
        "content": "<p>This wouldn't be a change to Bundle.  It would be an additional feature of _include - and is something that would be allowed as part of our inter-version compatibility rules for normative.  Adding the capability wouldn't break existing systems - they'd just see a search parameter they didn't support and behave accordingly.</p>",
        "id": 153939407,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519235217
    },
    {
        "content": "<p>Really? Does anyone expect to get a temporary guid bundle internal reference back on a query?</p>",
        "id": 153939409,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1519235388
    },
    {
        "content": "<p>They'd only get that if they invoked a query that used a search parameter that uses the new mechanism - which means they should expect it :)</p>",
        "id": 153939411,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519235453
    },
    {
        "content": "<p>OK, makes sense.</p>",
        "id": 153939412,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1519235547
    },
    {
        "content": "<p>I think a search result bundle is very different from a posted Bundle (of type batch or transaction). In the former case the server hosts the resources in the bundle. They happen to be bundled for convenient retrieval, but should also be individually retrievable. By their logical id. So when the client comes back to retrieve one of the Binaries individually, using the id from that resource in the bundle, it should get the same Binary. A UUID could be that id, but then the server has to be able to map that to the correct Binary. That is wat I meant by having a 'stable id'. I think this behaviour should not be dependent upon a specific usage of _include.</p>",
        "id": 153942583,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1520340466
    },
    {
        "content": "<p>I looked for trackers to address the <code>_include</code> issue that  \"The name of the search parameter which must be of type reference\".  Have n't found any (which doesn't mean they are not there) I have a use case for DocRef where it would be nice if the search parameter could be and Attachment datatype too,  I think canonical too.    Where are we with this?</p>",
        "id": 153953679,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524511330
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , if you want the file referenced by the attachment included in the result, use the data element, rather than the url. I recognize that this requires coordination of the DocRef creator and reader, while the _include approach doesn't, but it is supported, and you can use _summary or _elements to include the data or not as you'd prefer.</p>\n<p>I don't think including the content of arbitrary urls in a search result makes sense. What if the URL is to an ftp server?</p>\n<p>Further, I'm not sure that, even if you could specify it in the query, it would be solve your problem. How would you include the arbitrary file in the returned bundle? There is no guarantee that the target will be a BackboneElement, which is needed to include it in a Bundle.</p>",
        "id": 153953776,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1524525690
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  I understand that is an option, but what if  some clients want it and others do not.  By inlining the content you limit the clients options.</p>",
        "id": 153953791,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524536656
    },
    {
        "content": "<p>The expectation of the _include would be for FHIR endpoints.  I don't think would expect any old url to return anything.</p>",
        "id": 153953792,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524536726
    },
    {
        "content": "<p>Well, clients that don’t want it can use _summary or _elements to exclude it, but I agree, I don’t think putting it in the attachment data is a nice solution. </p>\n<p>However, I’m not thrilled with the _include approach. If we interpret _include to have meaning for urls to FHIR endpoints, then you are proposing to trade the “inefficiency” of two retrieves for the inefficiency of the base-64 encoded data in the body of a bundled Binary.  I’d rather do two retrieves.</p>",
        "id": 153953795,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1524538024
    },
    {
        "content": "<p>It would also clutter the implementation of _include in FHIR Servers. I'm not too enthousiastic.</p>",
        "id": 153953817,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1524555050
    },
    {
        "content": "<p>I am torn, but agree _include doesn't feel quite right.  When a client gets back the DocumentReference.Attachment.url, is there anyway to tell it's referencing a FHIR resource? <a href=\"http://hl7.org/fhir/datatypes.html#attachment\" target=\"_blank\" title=\"http://hl7.org/fhir/datatypes.html#attachment\">attachment data type</a></p>",
        "id": 153953879,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1524565389
    },
    {
        "content": "<p>the server  can know by knowing the target</p>",
        "id": 153954182,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524606427
    },
    {
        "content": "<p>I have heard interest from the MHD crowd for this... The fact that attachment.url is treated differently is continuing to present issues... I think we fixed the fixup thing, why can't we clarify the _include would work when the url points at a Resource type (including Binary)?</p>",
        "id": 153954689,
        "sender_full_name": "John Moehrke",
        "timestamp": 1524779030
    },
    {
        "content": "<p>Since Attachment provide option of reference or inline b64 how about alt approach of creating a custom search param to request option of url or inline (b64) content ( at servers discretion of course).</p>",
        "id": 153954691,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524782597
    },
    {
        "content": "<p>Eric, so you would have the server re-encode the data from one to the other? That is far more than I was looking at, and it would not work for MHD. I just want a way to include the content at attachment.url in the results Bundle. It seems simple enough... right?</p>",
        "id": 153954884,
        "sender_full_name": "John Moehrke",
        "timestamp": 1524919899
    }
]