[
    {
        "content": "<p>Hi,</p>\n<p>I'd like opinions on the best way to reference a patient where the patient details, specifically the patients unique id number, is  stored on an external non-FHIR system. The app used, will do a lookup to the external system, grab the patient id and then store that id as part of the patient refernece. The reference will then be used to do a REST search to GET the record back.  I've used this at present, but it would not be resolvable due to the target not being a FHIR endpoint,  but would work in a GET statement:</p>\n<p><a href=\"https://someserver.net/STU3/StructureDefintion/Patient/1234567890\" target=\"_blank\" title=\"https://someserver.net/STU3/StructureDefintion/Patient/1234567890\">https://someserver.net/STU3/StructureDefintion/Patient/1234567890</a></p>\n<p>There is no requirement to store a patients name, only the id and it's only for retrieval.<br>\nCheers</p>",
        "id": 153946151,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1521456141
    },
    {
        "content": "<p>reference.identifier</p>",
        "id": 153946160,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521457724
    },
    {
        "content": "<p>Thanks Graham. Was looking for type and got confused :-)</p>",
        "id": 153946169,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1521460934
    },
    {
        "content": "<p>Hi Grahame et al,</p>\n<p>Not getting far with being able to store and search for a patient reference. Managed to store the reference.identifer without any issue, but it appears FHIR is unable to search using reference.identifier so I'm unable to GET the record back using the patient number.  I've read the FHIR docs and tried various tests in postman but cannot get the record back using any method I've tried.  Tried using contained resource, but no luck with searching on that (is it possible?). I guess the question is, how can I store a patient number within the consent resource and then GET that record back using the patient number ?  There are no other FHIR resources available.<br>\nCheers</p>",
        "id": 153946556,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1521559147
    },
    {
        "content": "<p>I believe we approved a proposal to address this in R4, but I'm afraid you're out of luck without defining a custom search criteria in R3</p>",
        "id": 153946625,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521566431
    },
    {
        "content": "<p>yep I added it to R4 a week ago (:identifier). I would expect you to start seeing implementations in the run up to Cologne</p>",
        "id": 153946655,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521573514
    },
    {
        "content": "<p>Cheers guys. I'll go back to the drawing board and see what I can do.</p>",
        "id": 153946797,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1521624479
    }
]