[
    {
        "content": "<p>Hi all, we're looking into sending multiple identifiers for a single encounter (e.g. EHR issued visit ID + known external identifiers) as logical references and saw that  <a href=\"https://www.hl7.org/fhir/references.html#Reference\"><code>Reference.identifier</code></a> is limited to <code>0..1</code>. We're looking to send multiple identifiers as we're not sure which identifiers the receiving side needs + we won't have a literal reference to send in all scenarios. We have a way forward with extensions, but wanted to get the community's thoughts on the best way forward in R5 and beyond - would it be a reasonable request to ease the 0..1 constraint on identifier in a future release?</p>",
        "id": 224810149,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1612223098
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 224812352,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1612224315
    },
    {
        "content": "<p>Encounter.identifier has been changed to 0..* in the draft of R5.  In R4, you'll have to use an extension.  You can, in theory, use the standard extension \"<a href=\"http://hl7.org/fhir/5.0/StructureDefinition/extension-Encounter.identifier\">http://hl7.org/fhir/5.0/StructureDefinition/extension-Encounter.identifier</a>\" for this purpose, though until R5 is officially published, your slightly at risk (because the change isn't completely locked down yet - though the likelihood of it being reversed is low).</p>",
        "id": 224820724,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612232029
    },
    {
        "content": "<p>The question is mostly about the Reference data type, used with logical references, not the Encounter resource - logical reference to Encounter is just an example</p>",
        "id": 224825102,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1612237131
    },
    {
        "content": "<p>Ah, missed that it was Reference.identifier.  Yes, that's currently 0..1.  If you think it should be more than that, you could submit a change request.  However, given that it's normative, we're going to be really cautious about making such a change.</p>",
        "id": 224879273,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612276724
    },
    {
        "content": "<p>If you want to include multiple identifiers that identify the encounter, wouldn't that be in the encounter.identifier list? Your references (which are pointers to other resources) ALSO have multiple identifiers?</p>",
        "id": 224913113,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1612289981
    },
    {
        "content": "<p>The issue is that they don't know what the Encounter resource URL is - so they're just providing business identifiers in the hopes that's good enough to let someone find it.</p>",
        "id": 224922911,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612294013
    },
    {
        "content": "<p>Thanks all! I'll put in a ticket for it, but am also happy to discuss it more here. Vassil is right, this is about the reference datatype, and the specific case we're dealing with is for documentReference.context.encounter, where we're looking to reference an encounter resource.</p>\n<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span>  Re: encounter.identifier list - Lloyd's right on this one, we have a few cases where we don't have an encounter resource to point to (but still have some identifiers for the visit). The multiple identifiers are all synonyms for the same physical visit/we're trying to send all of them in hopes that the receiving end knows about at least one of them.</p>",
        "id": 224927525,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1612295948
    },
    {
        "content": "<p>For tracking purposes: <a href=\"https://jira.hl7.org/browse/FHIR-30878\">https://jira.hl7.org/browse/FHIR-30878</a></p>",
        "id": 224939225,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1612301270
    }
]