[
    {
        "content": "<p>Hi All... Busy with my first attempt at a fhir implementation. I am working with a client that spawns referrals from one practitioner to another practitioner. I had a look and a referral resource was included in v3 of the fhir specification and subsequently removed in v4. After some reading it appears that the ServiceRequest Resource might be the replacement for the referral request resource? However I did not see consultation as part of the list of examples. Hence me asking.</p>",
        "id": 204793297,
        "sender_full_name": "Ivan May",
        "timestamp": 1595509283
    },
    {
        "content": "<p>Yes, the ServiceRequest replaced Referral request. Presumably  you could use ServiceRequest.code=3457005 (or <a href=\"http://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=3457005\">one of its children</a>) to indicate that this is a referral.</p>\n<p>Note that the ServiceRequest resource only represents the authorization (order) for the referral. If you plan to manage the referral process, take a look at the workflow pages, starting at <a href=\"http://build.fhir.org/workflow-communications.html\">http://build.fhir.org/workflow-communications.html</a></p>",
        "id": 204796439,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1595510798
    },
    {
        "content": "<p>awesome thank you! If I need to attach a questionnaire response to that, do I bundle them?</p>",
        "id": 204806875,
        "sender_full_name": "Ivan May",
        "timestamp": 1595515569
    },
    {
        "content": "<p>Whether you use a transaction or batch or send the resources independently is up to you.</p>",
        "id": 204809213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595516596
    },
    {
        "content": "<p>so if I send them independently how do i show the relationship between the resources?</p>",
        "id": 204810749,
        "sender_full_name": "Ivan May",
        "timestamp": 1595517274
    },
    {
        "content": "<p>\"send\" is a poorly defined term. Do you plan to use FHIR Messaging, or the FHIR RESTful API as the basis of your communication pattern? Once the communication pattern is established, the Workflow link above shows the use of the Task resource. Task.basedOn or Task.Focus will reference the ServiceRequest. The QueastionaireResponse can be referenced from ServiceRequest.supportingInfo (if that response was essential for the decision to order the referral) or from Task.input (if that response is essential to accept/provide the service) - in some cases it can be referenced from both.</p>",
        "id": 204812070,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1595517806
    },
    {
        "content": "<p>good point, let me go read up on that for a bit</p>",
        "id": 204812981,
        "sender_full_name": "Ivan May",
        "timestamp": 1595518204
    },
    {
        "content": "<p>thanks for the help so far</p>",
        "id": 204813001,
        "sender_full_name": "Ivan May",
        "timestamp": 1595518213
    },
    {
        "content": "<p>References are URL pointers - think of them like hyperlinks.  So you create one page (resource) and then in your second page you include a link (Reference) to the location of the first page (resource).</p>",
        "id": 204813041,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595518236
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 204813329,
        "sender_full_name": "Ivan May",
        "timestamp": 1595518412
    },
    {
        "content": "<p>Hi! We are currently working on implementing ServiceRequest as a part of referral flow and have looked at the workflow page you linked to, <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> .I have four questions that I hope any of you may be able to help with: </p>\n<ol>\n<li>How is the Task resource referenced from the ServiceRequest or vice versa?</li>\n<li>We have a need to express documentation/health issue that the requestor writes down before sending the referral. Where would be a good place to put this? This information is currently not structured and we can't be sure about what it contains. </li>\n<li>We have a need to express documentation that the receiver writes down before sending an acceptance/answer of the referral. Where would be a good place to put this? This information is neither currently not structured and we can't be sure about what it contains. </li>\n<li>From the workflow it looks like status of task is changed frequently during the flow. How is this connected to the ServiceRequest status and when will this status change? Which of this statuses should one refer to as the \"referral status\"?</li>\n</ol>",
        "id": 215079085,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1604055198
    },
    {
        "content": "<p>Here is my take, I am curious what others think as well.</p>\n<ol>\n<li>Task.basedOn references the ServiceRequest</li>\n<li>This is likely to be part of the ServiceRequest - ServiceRequest.supportingInfo can be a reference to any other Resource. Alternatively, Task.input can have Task.input.valueString,  or Task.input.valueReference or anything in-between</li>\n<li>This is likely to be expressed in Task.output, either directly, or as a reference to other Resources.</li>\n<li>Task.status, Task.businessStatus, and Task.statusReason together allow you to track a complex workflow. An example of that can be seen in the <a href=\"http://hl7.org/fhir/us/bser/\">BSeR IG</a>. Until Task.status is in a final state, ServiceRequest.status stays <code>active</code>.</li>\n</ol>",
        "id": 215107463,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604070636
    },
    {
        "content": "<ol>\n<li>Actually, Task.focus would point to the ServiceRequest (if the Task is saying 'please fulfill this ServiceRequest')</li>\n<li>They can either be in ServiceRequest.supportingInfo or in Task.input.  The former if the information is tied to the authorization and independent of who you're asking to perform, the latter if you're adding them on as part of the dispatch process for a specific requested fulfiller</li>\n<li>Agree with Vassil, though there's also Task.statusReason</li>\n<li>The ServiceRequest is the status of the 'authorization'.  The Task.status is the status of a specific request for fulfillment.  One provider might refuse the Task, but that doesn't necessarily mean the authorization changes.  Even when a Task is complete, the authorization might still be active - because that one Task didn't do everything that was authorized.  E.g. a ServiceRequest might be for physiotherapy for a year.  A Task might only cover a month.</li>\n</ol>",
        "id": 215111257,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604072307
    },
    {
        "content": "<p>Hmm, the current documentation for <a href=\"http://build.fhir.org/task-definitions.html#Task.basedOn\">Task.basedOn states</a>:</p>\n<blockquote>\n<p>Description: Request fulfilled by this task<br>\nDefinition: BasedOn refers to a higher-level authorization that triggered the creation of the task. It references a \"request\" resource such as a ServiceRequest, MedicationRequest, ServiceRequest, CarePlan, etc. which is distinct from the \"request\" resource the task is seeking to fulfill. This latter resource is referenced by FocusOn. For example, based on a ServiceRequest (= BasedOn), a task is created to fulfill a procedureRequest ( = FocusOn ) to collect a specimen from a patient.</p>\n</blockquote>\n<p>The documentation of <a href=\"http://build.fhir.org/task-definitions.html#Task.focus\">Task.focus states</a>:</p>\n<blockquote>\n<p>Description: What <code>task</code> is acting on<br>\nDefinition: The request being actioned or the resource being manipulated by this task.</p>\n</blockquote>\n<p>Since referrals (AFAIK) are typically authorizations, with the above definitions, wouldn't it make more sense that Task.basedOn will point to the ServiceRequest representing the referral order?</p>\n<p>I also don't think that in general there there will be a secondary \"request\" for task.focusOn to reference (at least from the point of view of the request initiator). It makes more sense to use sub-tasks for parts of the original request, rather than expecting additional ServiceRequests. Example:<br>\nServiceRequest: lab order for CBC Panel<br>\nTask 1: basedOn ServiceRequest, no focus, please fulfill order for CBC Panel<br>\nTask 2: basedOn ServiceRequest, focus Specimen, partOf Task 1, collect specimen</p>\n<p>Created <a href=\"http://jira.hl7.org/browse/FHIR-29636\">FHIR#29636</a> to add more clarification to these.</p>",
        "id": 215216425,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604186098
    },
    {
        "content": "<p>The referral isn't authorizing the task that says \"please fulfill this request\"</p>",
        "id": 215229263,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604210004
    },
    {
        "content": "<p>I don't understand the distinction that is being made here. Can you elaborate?</p>",
        "id": 215330029,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604329543
    },
    {
        "content": "<p>Thanks a lot for your input! It helps us a lot in understanding the relation between these two resources. :)</p>",
        "id": 217246578,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1605778895
    },
    {
        "content": "<p>Hi! :)<br>\nAdding a new question to this thread. We have gotten further with the FHIR profiling of ServiceRequest and Task for the referral scope. However we noticed that there is no subject element in task, though there are a few other elements such as for &amp; focus which can reference any resources.  In the referral workflow example, would you say that there is a need to  include the patient in the task resource if it always references a ServiceRequest which references the patient?<br>\nIf there is such a need, in which element does it best fit?</p>",
        "id": 223515470,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1611239563
    },
    {
        "content": "<p>subject is Task.for</p>",
        "id": 223516585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611240055
    },
    {
        "content": "<p>We didn't use the word subject because we were concerned there's be confusion between it and Task.focus</p>",
        "id": 223516647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611240083
    },
    {
        "content": "<p>I see! Thank you for the quick response.</p>",
        "id": 223518423,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1611240871
    },
    {
        "content": "<p>Do you have some input on how to model an referral assessment which includes the type of assessment and also some structured notes? By structured notes I mean that we have a need to devide the notes into items with multiple headlines and written texts. Is there a specific FHIR resource that could be used for this, e.g. Composition?</p>",
        "id": 223526707,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1611244004
    },
    {
        "content": "<p>If you just need to pass the discrete data (e.g. recent labs, past procedures, current care plan, whatever), that can just go as ServiceRequest.supportingInformation.  However, if you really need control over order of presentation with section headings, etc. then you're looking at Composition.  Be aware that if you pass stuff as a FHIR document, you're not going to easily have dynamic behavior of the ServiceRequest in terms of status (active, suspended, cancelled, etc.).</p>",
        "id": 223544273,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611250902
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 261624603,
        "sender_full_name": "Kunjan Patel",
        "timestamp": 1637060531
    }
]