[
    {
        "content": "<p>I have a case where a measurement value comes not only with a reference range (high/low) but also an additional single reference value/mean somewhere inside this interval (this could also be seen as a central value + non-symmetric deviations above and below). Is there a standard way of capturing this in an Observation? - I did not see any standard extension for this.</p>\n<p>(BTW I think there was a discussion about a similar topic a while back, but I couldn't find it again)</p>",
        "id": 233622499,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1617872693
    },
    {
        "content": "<p>Sounds like an extension on reference Range to me</p>",
        "id": 233661827,
        "sender_full_name": "Eric Haas",
        "timestamp": 1617892156
    },
    {
        "content": "<p>Or even an extension on the Range data type in general.  Two extensions actually - one for 'mean' and one for 'contains'.</p>",
        "id": 233674230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617895617
    },
    {
        "content": "<p>The thing is that <code>Observation.referenceRange</code> is a <code>BackboneElement</code> that directly includes <code>high</code> and <code>low</code> fields and does not use the <code>Range</code> type at all.  Hence, like <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>, I was thinking along the lines of a direction of an extension (say \"centralValue\") on <code>Observation.referenceRange</code>,  similar to the <code>high</code> and <code>low</code> elements. In fact, I am wondering whether there might be cases where measurements come with <em>only</em> a single reference value and no interval at all, meaning that one would only want to give the extension and neither <code>high</code> nor <code>low</code> (but possibly still the <code>type</code>, <code>age</code>, and <code>appliesTo</code> fields). However, that is currently precluded by the constraints on the <code>referenceRange</code> element (<code>low.exists() or high.exists() or text.exists()</code>).</p>",
        "id": 233770288,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1617946165
    },
    {
        "content": "<p>In my line of work (chronic care) I have seen reference values from literature that are being displayed as comparison points, such as \"the average value within males above 65 is 6.8 mg/dL\". This would not have an interval. Would this rather be a topic for an extension, or can the means of the referenceRange be bent to fit? The <code>type</code> is only \"preferred\", so adding something like \"literature\" or \"mean\" as a type would be possible (albeit undesirable?), and the low/high could be set to an identical value. The <code>text</code> could then further explain what is meant.</p>",
        "id": 233804051,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1617967054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192169\">@Tilo Christ</span> That actually sounds like the kind of reference value I also have (except I also have an interval).</p>",
        "id": 233807825,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1617969185
    },
    {
        "content": "<p>I think nothing would stop you from attaching several different reference ranges to the same observation, it is 0...*.</p>",
        "id": 233823131,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1617975945
    },
    {
        "content": "<p>Yes, indeed. I my case, the single reference value actually belongs together with the interval (\"interval with a central value\"), but I guess there could be cases where they are alternatives or apply in different situations.</p>",
        "id": 234158079,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1618234384
    }
]