[
    {
        "content": "<p>Given a resource (parent) with a contained Bundle. Is there a way to make a reference to an item in the contained Bundle from the container (parent)?</p>",
        "id": 214177236,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1603368620
    },
    {
        "content": "<p>only if the resources in the contained Bundle have RESTful fullURLs... which is essentially that they are available on the network, and not just in the contained bundle.</p>",
        "id": 214219200,
        "sender_full_name": "John Moehrke",
        "timestamp": 1603387301
    },
    {
        "content": "<p>Note that 'contained' is not a mechanism for transporting a whole bunch of information at once - it's for sending resources that don't have any independent existence or identity from the containing resource.  Normally, if you want to have a bunch of contained resources, you'd contain them individually, not as part of a Bundle.  If they're in a Bundle would be very unusual to need to reference the content of the Bundle.</p>",
        "id": 214233348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603393431
    },
    {
        "content": "<p>Unless \"contained\" here means \"Bundle as an entry in another Bundle\". It didn't even occur to me that a Bundle would be considered as an actual \"contained resource\".</p>",
        "id": 214236230,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1603394679
    },
    {
        "content": "<p>There's actually an example in HRex where this makes sense - a Task.output can refer to a 'contained' search set Bundle - because the Bundle isn't something that would have any independent existence</p>",
        "id": 214246894,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603400101
    },
    {
        "content": "<p>Search set Bundles (usually) don't have independent existence anyway. Why does it have to be contained?</p>",
        "id": 214247577,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1603400432
    },
    {
        "content": "<p>Yea, I think this is a confused idea to use bundles like this.</p>",
        "id": 214262831,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1603412756
    }
]