[
    {
        "content": "<p>Are the reference suggested types just suggestions, or is it ok to diverge from them? For example, Observation has a related field which is a reference \"Reference(Observation | QuestionnaireResponse | Sequence)\" - Can I use this to relate an Observation to anything other than those three Resources listed, or would that be a misuse of that field and frowned upon/cause problems down the line?</p>\n<p>And side question, I want a Condition to 'relate' to some other resource, but Condition does not have a relates to field. Is the only possible way to group/relate things at that point to use an extension? Or is there a standard for relating/grouping resources?</p>",
        "id": 153903755,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1503677558
    },
    {
        "content": "<p>The reference has to be to Observation, QuestionnaireResponse or Sequence. You cannot use this to relate an observation to any other resource type. I believe you would need an extension to address the requirement described in your second question.</p>",
        "id": 153903761,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1503680873
    },
    {
        "content": "<p>If you have a use-case for something else, you can submit a change request and a future version of the spec might accomodate your needs.  However Igor is correct.  In the current release of the specification you'd need to use an extension.</p>",
        "id": 153903763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503681196
    },
    {
        "content": "<p>It actually looks like there is a Resource for what I was talking about called Linkage. Right now we are using extensions, I just noticed that there were places we we're using extensions where they had a place to live in Fhir and this is one of the ones I was unsure about. Thanks guys.</p>",
        "id": 153903766,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1503686870
    },
    {
        "content": "<p>Linkage allows you to say \"these multiple resource instances are all talking about the same 'thing'\" - it can be used for representations from different servers, for representations captured by different clinicians or by different interpretations of something over time.</p>",
        "id": 153903771,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503717189
    },
    {
        "content": "<p>There are these standard extensions many of them reference other resources - maybe on of them is  are what you are looking for...</p>\n<ul>\n<li><a href=\"http://build.fhir.org/observation-profiles.html#extensions\" target=\"_blank\" title=\"http://build.fhir.org/observation-profiles.html#extensions\">http://build.fhir.org/observation-profiles.html#extensions</a></li>\n</ul>",
        "id": 153903864,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503935554
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Thanks for pointing those out. The best one that would work in my case would be event-partOf. Just want to make sure though, is the vocab of <code>event</code> important. I want to use that extension to relate observations/conditions/basics/procedures/medication-statements to each other. Is it ok to use it that way even though those are not necessarily an event?</p>",
        "id": 153903873,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1503939323
    },
    {
        "content": "<p>An example use case we are currently doing is creating a Condition lets say for cancer with a cancer code. Then creating a new observation for things like Histology, grade, and ajcc statuses. So each of those observations we want to relate to both the Patient (which we do through Subject reference) as well as the condition, which we currently have a custom inhouse extension for this (which I want to replace with the proper FHIR way)</p>",
        "id": 153903876,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1503939625
    },
    {
        "content": "<p>Those are all defined as events:  </p>\n<ul>\n<li><a href=\"http://build.fhir.org/workflow.html#respatterns\" target=\"_blank\" title=\"http://build.fhir.org/workflow.html#respatterns\">http://build.fhir.org/workflow.html#respatterns</a></li>\n</ul>",
        "id": 153903877,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503939661
    },
    {
        "content": "<p>Ah good. Also there are cases like Observation having a field called <code>related</code> but not everything else we need that in has it. Is it better to use the <code>related</code> field where it is present (like in observation) and then use the extension in things like medicationstatement that doesn't have it. Or stay consistent and just use the extension for everything to make it simpler?</p>",
        "id": 153903878,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1503939847
    },
    {
        "content": "<p>best to use the element that fits the context for :</p>\n<ul>\n<li>the extension definition or</li>\n<li>the  <code>related.type</code> element  which were introduced way before these extensions.  </li>\n</ul>\n<p>The FHIR team and Orders and Observations  work group wanted to take a hard look at the types and think only a couple are commonly used - see <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10118\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10118\">GF#10118</a>- but seeking implementer input since any changes here would be a big deal to  at this stage and not sure of the cost to benefits.</p>",
        "id": 153903892,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503958343
    }
]