[
    {
        "content": "<blockquote>\n<p>We are close to having a complete structure of a Bundle and ServiceRequest which we will be sending to a FHIR API as a means to send clinical referrals. One of the final challenges we still need to solve is ensuring that the receiver can route the referral to the correct department within the Organisation. Ideally this would be based on a HeathcareService speciality which would be selected by the referral requester. This speciality could be one of many available within the HealthcareService and would be provided by a seperate API endpoint available from the client.</p>\n<p>In the deprecated ReferralRequest there is a speciality CodeableConcept that we could have used in conjunction with the recipient which would have been the Organisation. However, specialty is no longer an attribute in the ServiceRequest resource. One possible solution is to declare a HealthcareService as the performer of the ServiceRequest with a single speciality listed in the resource itself. This doesn’t quite feel right but we can’t see an alternative. We’re hoping someone can assist or provide guidance.</p>\n</blockquote>",
        "id": 166864374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559170097
    },
    {
        "content": "<p>from <a href=\"http://community.fhir.org/t/referralrequest-speciality/1360\" target=\"_blank\" title=\"http://community.fhir.org/t/referralrequest-speciality/1360\">http://community.fhir.org/t/referralrequest-speciality/1360</a></p>",
        "id": 166864382,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559170104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ?</p>",
        "id": 166864400,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559170144
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/servicerequest-definitions.html#ServiceRequest.performerType\" target=\"_blank\" title=\"http://hl7.org/fhir/servicerequest-definitions.html#ServiceRequest.performerType\">ServiceRequest.performerType</a></p>",
        "id": 166924670,
        "sender_full_name": "Eric Haas",
        "timestamp": 1559234860
    },
    {
        "content": "<p>I certainly don't think that having a separate service for each specialty is a bad idea, if in fact your department can receive referrals targeted to various specialties then your department has multiple services. </p>\n<p>performerType certainly also seems like a viable approach, you just have some extra complexity though as it relates to your HealthcareService directory, as you now have to pick TWO things instead of one (the Healthcare service + the service's specialty).</p>",
        "id": 166927546,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1559236933
    }
]