[
    {
        "content": "<p>So, a HAPI FHIR user recently submitted a ticket that highlighted a change that I actually hadn't noticed in R4: <a href=\"https://github.com/jamesagnew/hapi-fhir/issues/1583\" target=\"_blank\" title=\"https://github.com/jamesagnew/hapi-fhir/issues/1583\">https://github.com/jamesagnew/hapi-fhir/issues/1583</a></p>\n<p>Essentially, QuestionnaireResponse.questionnaire has now changed from being a <code>reference</code> to being a <code>canonical</code>. Due to HAPI FHIR's current interpretation of canonical, this means that anyone who has a QuestionnaireResponse containing a relative link to a local Questionnaire can no longer search for QR's using a query such as <code>QuestionnaireResponse?questionnaire=Questionnaire/123</code>.</p>\n<p>So I'm wondering several things here:</p>\n<ul>\n<li>Is the intent for canonicals that they should allow local references in addition to full URIs? My read of the spec is that they should not.</li>\n<li>Does it make sense for a <code>reference</code> search parameter to point to a <code>canonical</code> type at all? I would have expected a parameter of type <code>uri</code>. The FHIR search page does discuss using reference SPs that point to canonical here ( <a href=\"http://hl7.org/fhir/search.html#versions\" target=\"_blank\" title=\"http://hl7.org/fhir/search.html#versions\">http://hl7.org/fhir/search.html#versions</a> ) but it doesn't explain how this is different from an SP of type URI.. If anything it seems like it duplicates it, and puts the onus on the server to understand whether a reference SP is expected to point to a canonical or a real reference</li>\n<li>If references are allows to point to canonical types, is it reasonable for a server to interpret a local reference for what it is and try to a search such as the one above?</li>\n</ul>",
        "id": 181050534,
        "sender_full_name": "James Agnew",
        "timestamp": 1574107343
    },
    {
        "content": "<ul>\n<li>they should not</li>\n<li>I'm not sure. I thought we discussed this somewhere..?</li>\n<li>reasonable, yes</li>\n</ul>",
        "id": 181050889,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574107608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> Can you submit a change request for us to clarify this in the spec?  (And figure out what to clarify to :&gt;)</p>",
        "id": 181060355,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574113837
    },
    {
        "content": "<p>A similar issue is present in Measure/MeasureReport, which has a similar usage pattern as Questionnaire/QuestionnaireResponse.    Honestly, I think it's the first time I ran across a 'canonical' data type during an implementation; or at least the first time it mattered to the project I'm working on.  And I'm here wondering why it's not a typical Reference.   </p>\n<p>So... chiming in to request that the spec clarification be broad enough to address usage patterns in some of the other resources, not just Questionnaire/QuestionnaireResponse.</p>",
        "id": 181329714,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1574359019
    },
    {
        "content": "<p>Canonicals are used when there are expected to be identical copies of the resource on numerous servers (possibly including a local one), so you don't want to point to a reference on some remote server far away.  You want to specify a canonical identifier that can be searched on the local system and near-by registries and only resolved by hitting the canonical URL as a last resort.  This is typically used for 'definitional' and infrastructure resources.</p>",
        "id": 181580812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574367969
    },
    {
        "content": "<p>they are \"fixed\" resources instances vs \"dynamic\"  resource instances...</p>",
        "id": 181582441,
        "sender_full_name": "Eric Haas",
        "timestamp": 1574369175
    },
    {
        "content": "<p>Sort of.  Definitional resources can be changed - but they're generally only distributed into the wild when solid - at least for a given release version.</p>",
        "id": 181583061,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574369626
    },
    {
        "content": "<p>In case of Measure/MeasureReport, does that mean that it should not be possible to $evaluate-measure a Measure which has no Measure.url, because MeasureReport.measure is required?</p>",
        "id": 183953186,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1576861307
    },
    {
        "content": "<p>That is my understanding but let me confirm with <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 183986924,
        "sender_full_name": "Eric Haas",
        "timestamp": 1576888216
    },
    {
        "content": "<p>Yes, that's correct, and the <a href=\"http://hl7.org/fhir/us/cqfmeasures/StructureDefinition-measure-cqfm.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/cqfmeasures/StructureDefinition-measure-cqfm.html\">cqfm-measure</a> profile in the Quality Measure IG requires <code>url</code> for this reason.</p>",
        "id": 183989230,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1576891614
    }
]