[
    {
        "content": "<p>Hello,</p>\n<p>This is related to a question I asked a few days back in \"Inferno\" stream. From my understanding of displaying Provenance information for a record that is coming from an external organization (say like a lab result) and we don't touch the result at all, other than save the record and provenance information associated with it, how do I display a reference to the external organization or practitioner. According to the US Core profile for Provenance, the reference must be displayed as a logical reference Organization/id and not a contained resource. In my opinion if we want to preserve the integrity of the data, US core should allow for contained references. I cannot extract the organization and practitioner information from the provenance information for a record and save it in the \"master\" organization or practitioner table because I was told this data is tied to provenance and does not have any significance on its own. <br>\nJust wondering if anyone has thoughts on this.</p>\n<p>Thanks.</p>",
        "id": 233361098,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1617731464
    },
    {
        "content": "<p>Sounds like you need to replace relative reference with absolute references.</p>",
        "id": 233363979,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1617732727
    },
    {
        "content": "<p>To clarify US Core strongly discourages using containment and is in general alignment with The FHIR specification on this</p>",
        "id": 233364115,
        "sender_full_name": "Eric Haas",
        "timestamp": 1617732796
    },
    {
        "content": "<p>Making the resource 'contained' would be saying that it didn't have any independent identity or existence - which would be patently false in this scenario</p>",
        "id": 233370356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617735302
    },
    {
        "content": "<p>Thanks everyone.  It looks like the consensus is not to have contained resource. I am probably unable to explain this properly, but the reason I am leaning towards \"contained\" is from what my interoperability/HIE resource is telling me that when provenance data comes from an external system with an NPI, Name etc.. that information may or may not be correct. In sense, it is possible that an NPI could point to an incorrect organization because there is a bug in the external system. But our system is supposed to display the provenance data as is;  Hence I cannot take that incorrect NPI-name combination and store it in a master table to use as a reference. I don't know how likely this occurs, but that's what I was told.</p>",
        "id": 233418245,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1617760293
    },
    {
        "content": "<p>In that circumstance, can't you just retain an absolute reference to the remote source?</p>",
        "id": 233421740,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617762951
    },
    {
        "content": "<p>I'm assuming that the data load is a file or some other stream/feed that is a non-public and/or non-fhir source.<br>\nIf you don't trust the external system enough to link the NPI they provided with the data you know about the NPI why do you trust the data itself. The lab result itself could be wrong due to a bug in the external system.<br>\nAnyway, if you don't trust the provenance data AND there isn't a public FHIR server you can provide an absolute link to, then I think the only thing you can do is put what you were told in a contained resource. - my opinion.</p>",
        "id": 233481705,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1617800181
    }
]