[
    {
        "content": "<p>If systems A and B both have the capability to generate Resource.text, and A sends a resource to B where the resource contains 'generated text', then B could safely regenerate that text to use its own layout. (opinions?)<br>\nUse case is the regeneration of text in FHIR documents, then one discovers (in general) the crappy XHTML used in most examples. FHIR documents will have to look at least as good as CDA documents.</p>",
        "id": 161615242,
        "sender_full_name": "René Spronk",
        "timestamp": 1553490704
    },
    {
        "content": "<p>Is generated text in a document attested content?</p>",
        "id": 161615590,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1553491291
    },
    {
        "content": "<p>That's a related interesting question. <br>\nIn my use case, the document-author grabs resources from a server, regenerates the text, and assembles a document. As such this issue doesn't really come into play.</p>",
        "id": 161616125,
        "sender_full_name": "René Spronk",
        "timestamp": 1553492224
    },
    {
        "content": "<p>I'd say that B can safely generate the resource, to produce an equivalent, but different, resource.</p>",
        "id": 161616679,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1553493064
    },
    {
        "content": "<p>The reader of the resource would need to know that both systems have compatible ideas of what counts as core elements. <br>\n<a href=\"http://build.fhir.org/valueset-narrative-status.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-narrative-status.html\">http://build.fhir.org/valueset-narrative-status.html</a> : \"The contents of the narrative are entirely generated from the core elements in the content.\"</p>",
        "id": 161617011,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1553493565
    },
    {
        "content": "<p>It sound like it should work in theory, but would be hard to trust.</p>",
        "id": 161617072,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1553493621
    },
    {
        "content": "<p>my take on this is:</p>\n<ul>\n<li>\n<p>in general, a recipient can always regenerate the text. Whether that's safe is dependent on the context. It's much more likely to be safe if the source is 'generated'. But safety is always dependent on the gap between the system's behaviour and the user's expectations of the system's behaviour</p>\n</li>\n<li>\n<p>in a document, the specific text is attested, and regenerated text is not what was attested</p>\n</li>\n</ul>",
        "id": 161620722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553499308
    },
    {
        "content": "<p>If you do <em>anything</em> to the instance on receipt - regenerate narrative, drop extensions, default elements, whatever - then you've performed a transformation and should ideally capture a provenance record reflecting that.  When you receive a document, you should store it as a Binary and perform no transformations at all.  I.e. retain all elements, don't add any, don't regenerate anything.  Because that's the only way to ensure that you retain the original attested content.  If you perform a transformation, then there's a risk that the attestation has been invalidated.</p>",
        "id": 161644495,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553521788
    },
    {
        "content": "<p>Back to my original use case: the author of a yet-to-be-instantiated document pulls some resources from a server and assembles a document, regenerating the text (because the layout of the existing XHTML snippets is not usable for document display purposes) for those resource that have \"generated\" text.  Attestation isn't an issue in this context. <br>\nOne can never be sure how \"safe\" any generated text will be, one can only assume that those that generate text will faithfully render the key structured data for a human reader. <br>\nOne of the key drawbacks of text being XHTML instead of cda-style markup is that we've lost almost all flexibility when it comes to how one wishes to render the narrative, so regeneration of text now becomes a necessity. What I mean by that: any author of any resource can just use any style of XHTML they please, which may or may not be suitable for use in a particular use-case (e.g. documents) or display type.</p>",
        "id": 161731346,
        "sender_full_name": "René Spronk",
        "timestamp": 1553575493
    }
]