[
    {
        "content": "<p>In PHD and PoCD we have to map a device data type which is a BITs field (each bit means something). Since there is no dataType in FHIR that covers this type of measurement we have created a value Set  that converts these bit settings to codes. These codes can then be placed in CodeableConcepts.</p>\n<p>However, we need to (or would like to) register this data set with FHIR. THe system would be something like <a href=\"http://hl7.org/fhir/IEEE.ASN1\" target=\"_blank\" title=\"http://hl7.org/fhir/IEEE.ASN1\">http://hl7.org/fhir/IEEE.ASN1</a>.<br>\nThe actual codes for this value set can be generated from data received in the exchange protocol.</p>\n<p>We also have a few other value sets that need to be registered.</p>\n<p>How would one do this?</p>\n<p>Thanks</p>",
        "id": 153896340,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1499434667
    },
    {
        "content": "<p>Submit a change request :)  (\"Propose a change\" link at the bottom of each page in the spec.)</p>",
        "id": 153896354,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499440052
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Should I submit an issue for each vocabulary set I wish to request? How about the value set itself? How does one handle that? In two cases they are currently a limited set of codes, in the last case (the ASN1 bits) there is an algorithm one can use to generate the codes, but there needs to be a 'dictionary' so readers can interpret the codes somewhere.</p>",
        "id": 153896357,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1499440239
    },
    {
        "content": "<p>I'd do one proposal per code system.  I wouldn't bother requesting the value sets - you can define those as part of your resource or IG definition.  The tricky question is how maintenance will be managed if the source is external.</p>",
        "id": 153896359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499440344
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  The source is currently external but how about adding them to the FHIR community?</p>",
        "id": 153896378,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1499449031
    },
    {
        "content": "<p>In the FHIR  spec we do have a registry of several external code systems published  ( and I think you are talking about code systems developed and maintained external to FHIR ).  I don't know the details for adding new external code systems but would expect if a tracker is raised it would go to Vocab.</p>",
        "id": 153896405,
        "sender_full_name": "Eric Haas",
        "timestamp": 1499470724
    },
    {
        "content": "<p>Another consideration is the IP rules for the  codesystem.</p>",
        "id": 153896406,
        "sender_full_name": "Eric Haas",
        "timestamp": 1499470755
    }
]