[
    {
        "content": "<p>Hello – <br>\nI am relatively new here and to FHIR (as well as coding and SQL). I am tasked with developing the functionality within an existing MS SQL server relational database to allow for the exchange of healthcare data with EHRs. I work with a team of developers, who are contracted to make updates to the database, including modifications to the source code, queries, etc. My role here is to manage the project and my expertise is with the data, including where it theoretically needs to map to in an EHR. I have attended the HL7 FHIR Bootcamp and FHIR for Healthcare Analysts courses. I have a good understanding on how to create resources, the CRUD operations, understand Postman examples, etc and know that I will need to map my database elements to FHIR resources and integrate a FHIR server. While I feel comfortable writing a JSON example of the resources, this is using one patient’s example data and this doesn't seem like it would be 'enough' for the developer to take &amp; implement functionality for the whole database (or is it?). <br>\nDo you have any guidance on what discrete information developers typically request to produce this functionality (the data mapping from element to FHIR &amp; FHIR Paths? Specific search request queries?)? <br>\nAre there any tutorials that help understand this process from a developer’s perspective that might help in my communication of what’s needed?<br>\nI apologize if this question is broad, please bare with this newbie!</p>",
        "id": 259156118,
        "sender_full_name": "Lindsay Woodcock",
        "timestamp": 1635279950
    },
    {
        "content": "<p>There's a whole stream (<a class=\"stream\" data-stream-id=\"179289\" href=\"/#narrow/stream/179289-storage-for-FHIR\">#storage for FHIR</a>) devoted to various trade-offs to storage approaches for FHIR resources.  Suggest you do some exploring there.  Short answer: there isn't one answer.  It depends what you need to do with the data.  How will it be retrieved?  How will it be manipulated?  How will it be indexed?</p>",
        "id": 259156975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635280381
    },
    {
        "content": "<p>Thank you, Lloyd! This alone is very helpful - especially knowing what questions I need to explore. Have a great day!</p>",
        "id": 259234012,
        "sender_full_name": "Lindsay Woodcock",
        "timestamp": 1635339496
    }
]