[
    {
        "content": "<p>Hi All,  We have a requirement where we want to record Next-of-kin for a patient and at the same time we want to record relationship of the patient with Next-of-kin (Partner / Sibling/ Parent etc). Effectively there are 2 relationships with the same person. RelatedPerson supports only 1 relationship at a time. Does this mean we will need to have 2 separate records  , each with different relationship with the patient ?  or is there an alternative way to represent multiple relationships with the same person ? Thanks ! </p>",
        "id": 153821624,
        "sender_full_name": "Pravina Munghate",
        "timestamp": 1460582566
    },
    {
        "content": "<p>Not quite following.  Next of kin would normally be captured in Patient.contact.  And there you can capture the relationship of the NOK to the patient.  What additional relationship are you wanting to capture?</p>",
        "id": 153821628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460582864
    },
    {
        "content": "<p>Ah, just looked at the topic title.  RelatedPerson is *not* for capturing next of kin relationships.</p>",
        "id": 153821629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460582908
    },
    {
        "content": "<p>Its purpose is to capture the records of people who might be actors or targets of healthcare activities.  E.g. participants in a care plan, reporters of allergies, targets of information distribution or training, etc.</p>",
        "id": 153821630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460582959
    },
    {
        "content": "<p>It's certainly possible that someone might show up in both places - as a Patient.contact (NoK) and as a RelatedPerson (someone who will act or be acted upon based on their personal relationship with the patient as opposed to based on their professional capacity).</p>",
        "id": 153821631,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460583027
    },
    {
        "content": "<p>Not sure I'm 100% sure on the context here, but the relationship is 1 way.<br>\nUse case: Patient = Sally.daughter and RelatedPerson=Steven.Daddy (relationship=father)<br>\nWith this example you can decribe 't describe the relationship of sally to steven (daughter)</p>",
        "id": 153821873,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1460694856
    },
    {
        "content": "<p>When these roles reverse and in our example Steven.Daddy becomes the Patient, and Sally becomes the RelatedPerson, then the relationship here would be daughter.<br>\nAnd just to complete the picture, you could create 2 Person resources that link the Patient and related person for the same individual together.</p>",
        "id": 153821874,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1460695651
    },
    {
        "content": "<p>Hi All, in our care management application, we need to specify that a person is an attorney (Power of Attorney) for the patient. I believe that this should be specified in  <code>CareTeam.participant.role</code> <a href=\"http://hl7.org/fhir/2016Sep/valueset-participant-role.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/valueset-participant-role.html\">binding</a>, also possible but IMO less likely places are <code>Patient.contact.relashionship</code><a href=\"http://hl7-fhir.github.io/v2/0131/index.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/v2/0131/index.html\">binding</a> and <code>RelatedPerson.relashionship</code> <a href=\"http://hl7.org/fhir/2016Sep/valueset-relatedperson-relationshiptype.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/valueset-relatedperson-relationshiptype.html\">binding</a>, but none of them has this value in bound value sets (though they are extensible/example so it's possible to add the necessary value). Please advise what approach will be correct in this situation?</p>",
        "id": 153845426,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1472481430
    },
    {
        "content": "<p>Hi Alexandra, RoleCode code system (<a href=\"http://hl7-fhir.github.io/v3/RoleCode/cs.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/v3/RoleCode/cs.html\">http://hl7-fhir.github.io/v3/RoleCode/cs.html</a>) has codes POWATT, DPOWATT, HPOWATT and SPOWATT for various types of Power of Attorney. A subset of this code system is used for RelatedPerson.relationship (<a href=\"http://hl7-fhir.github.io/valueset-relatedperson-relationshiptype.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/valueset-relatedperson-relationshiptype.html\">http://hl7-fhir.github.io/valueset-relatedperson-relationshiptype.html</a>), but for some reason, this subset includes only codes under _PersonalRelationshipRoleType and doesn't include codes under _AffiliationRoleType. Anyway, as you've mentioned, this is extensible and I believe you are free to add the necessary codes from RoleCode for your project (we did so in Ontario). I've added a tracker item to add these codes to <a href=\"http://hl7-fhir.github.io/valueset-relatedperson-relationshiptype.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/valueset-relatedperson-relationshiptype.html\">http://hl7-fhir.github.io/valueset-relatedperson-relationshiptype.html</a>.</p>",
        "id": 153845444,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1472495428
    },
    {
        "content": "<p>I think the RelatedPerson is the appropriate resource for this, and the suggestion to open the binding to those values makes sense (I'll look forward to reviewing the ballot item/tracker for it)</p>",
        "id": 153845574,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1472526083
    },
    {
        "content": "<p>The problem here is that RelatedPerson.relationship is 0..1, so we cannot indicate both personal relationship and role (caregiver, primary caregiver, emergency contact, power of attorney). In our application, we record family community capturing Relationship and then indicating that this person is:</p>\n<ul>\n<li><code>Caregiver</code> with possible option 'Primary'</li>\n<li><code>Emergency Contact</code> with possible option 'Primary'</li>\n<li>\n<p><code>Power of Attorney</code><br>\nI thought to capture them to RelatedPerson and then:</p>\n</li>\n<li>\n<p>Caregiver - will be <code>CareTeam.participant.role</code> = Caregiver (person) SCTID: 133932002</p>\n</li>\n<li>Caregiver Primary - will be <code>CareTeam.participant.role</code> = Primary carer (person) SCTID: 407543004</li>\n<li>Emergency Contact - data about this person will be duplicated in <code>Patient.contact</code> with <code>relationship</code> = c    (Emergency Contact) </li>\n<li>Emergency Contact Primary - possibly Extension (similar to <a href=\"https://www.hl7.org/fhir/extension-practitioner-primaryind.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/extension-practitioner-primaryind.html\">Indicator of primary specialty</a>) on <code>Patient.contact</code> where relationship has type 'c' (Emergency Contact)</li>\n<li>Power of Attorney - possibly <code>CareTeam.participant.role</code> =  POWATT    ('power of attorney' from the code system <a href=\"http://hl7.org/fhir/v3/RoleCode\" target=\"_blank\" title=\"http://hl7.org/fhir/v3/RoleCode\">http://hl7.org/fhir/v3/RoleCode</a>)<br>\nThe other option is to create several <code>RelatedPerson</code> resources for one family member to capture that this person is e.g. a sister, a primary caregiver, an emergency contact and an attorney for the patient at once. So, I'm struggling which approach is better here. Probably personal relashionship is less important than POA, Emergency Contact or Primary Caregiver, and it is more likely to quiery a POA for a given patient than for their sister...</li>\n</ul>",
        "id": 153845674,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1472557319
    },
    {
        "content": "<p>It turned out that we capture if the family member being added has 'Power of Attorney', but that is different than being an actual attorney. And in other place of application we capture actual attorneys of a patient. So now I need to figure out how to represent both POA and actual attorneys...<br>\nAnd for actual attorneys we need to capture:</p>\n<ul>\n<li>name, </li>\n<li>firm (name of the business the attorney works for (such as a sole proprietorship, partnership or corporation)), </li>\n<li>address, </li>\n<li>telecom, </li>\n<li>and indicate that the attorney is associated with the creation/management of specified type(s) of document (<code>Living Will</code>, <code>Advance Directive</code>, <code>DNR</code>, <code>POST / POLST</code>), for the patient.</li>\n</ul>",
        "id": 153845840,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1472573376
    },
    {
        "content": "<p>Agree that capturing the role of different participants is best done using CareTeam.  RelatedPerson is used in contexts where you want to capture \"who did what\".  CareTeam is where you capture the different roles people have in the delivery of care to the Patient.  Attorney and \"power of attorney\" are definitely different role codes.  If you're missing one for Attorney, you can make one up for now, but I'd certainly encourage you to submit a change request to get that concept added if it doesn't exist.</p>",
        "id": 153845842,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1472573899
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191329\">@Aleksandra Pavlyshina</span>  Look at Contract. I think some of this is intended to be specified in a Contract (or contract like) object that points at the attorney and also points at the patient. Rather than the patient pointing at everything else.</p>",
        "id": 153845846,
        "sender_full_name": "John Moehrke",
        "timestamp": 1472576426
    },
    {
        "content": "<p>Can you please log a tracker issue for this, nd Pa will clarify and get back to you on it.<br>\nThe request seems quite reasonable to want to specify a list of relationship types for a single person.</p>",
        "id": 153845855,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1472589540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> In our application, we also need to upload documents like Living Will, Advance Directive, DNR, POST / POLST from patient if any. I thought to use <code>DocumentReference</code> for those, but do you recommend to use <code>Contract</code> instead? Will it be correct in that case to represent an attorney as a <code>RelatedPerson</code> resource with a firm added as an extension.reference to <code>Organization</code>, and <code>RelatedPerson.relationship</code> = 'Attorney', and point to that attorney from <code>Contract</code>?</p>",
        "id": 153845961,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1472660034
    },
    {
        "content": "<p>Experience will ultimately bring the answer. Yes an imported document would be best managed with a DocumentReference. That DocumentReference can be pointed to from either Contract or Consent; as the evidence of what the patient saw and acted upon.   The Consent resource is intended to support these specific types of use-cases, but so far has only been modeled for Privacy Consent. Thus the committee needs comments in the current ballot to help them understand your perceived needs for these other types of Consent.  We were using Contract, but it became cumbersome; technically, administratively, and emotionally.  It still exists as a more general-purpose Contract. We also need comments on this.  As to recording the attorney for a Privacy Consent, this was not seen in use today so it was not included in the model. It is not clear why that is needed in a coded form, it clearly would be indicated in the human readable document.</p>",
        "id": 153845962,
        "sender_full_name": "John Moehrke",
        "timestamp": 1472660748
    },
    {
        "content": "<p>Added [#12141] <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12141\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12141\">Summary: Add a code for 'Attorney' to relationship and participant.role value sets</a></p>",
        "id": 153850266,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1474481281
    }
]