[
    {
        "content": "<p>We work with clinical practice guidelines and must return additional metadata about actions to be performed. RelatedArtifact appears to be the data type designed to hold this stuff, but seemed to have some consistent short comings and I'm wondering if any other implementers have run into a similar need for extensions here or if this is not the appropriate place for this data. Opening a new topic to see if I should submit tracker items.</p>\n<p>We are using this to return the following extra details about any particular action and the issues we ran into:</p>\n<ul>\n<li>Footnotes that act as additional simple instructions or links to extra information.<ul>\n<li>These are just string phrases that fit in the display attribute but what we lacked was an appropriate field for a small label. For example \"cc.  FDG PET/CT can be performed at the same time as diagnostic CT. \"  Where should the 'cc' go?</li>\n</ul>\n</li>\n<li>Literary references and citations. <ul>\n<li>Related artifact is well suited for these, but two things stood out. Again, we didn't have an appropriate field for the label. RelatedArtifact.citation holds the full citation, RA.display can hold the short form citation or the label. </li>\n<li>the citation field is a string. Certain citation styles require italics. Unfortunately my source material uses AMA which does, and this necessitates the markdown extension to properly hold the citation. Don't most citation styles need italics or bold?</li>\n</ul>\n</li>\n<li>Data about cost, strength of clinical evidence or other outcome data<ul>\n<li>These I was unsure if this is the appropriate data type. They could arguably be Observations about an ActivityDefinition, but that seemed over the top and I would rather transmit the data inline with the action details. What was missing here was either a quantity field (for cost, length of stay, progression free survival, guideline appropriateness, etc) and a CodeableConcept field for strength of evidence. They somewhat need code-value pairings and now I wonder if these should in fact be Observations. Any suggestions?</li>\n</ul>\n</li>\n</ul>",
        "id": 153938411,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1518974973
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 153938414,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518988579
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span> , for the footnotes, a label element in relatedArtifact would be reasonable I think, especially given that it would also cover the citation label use case. For the citation formatting, we could make citation a Markdown. Can you submit trackers for those changes?</p>",
        "id": 153938640,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1519067426
    },
    {
        "content": "<p>For the recommendation strength, Clinical Reasoning defines two related extensions, qualityOfEvidence and strengthOfRecommendation. They both use a CodeableConcept to provide a qualitative assessment.</p>",
        "id": 153938641,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1519067491
    },
    {
        "content": "<p>For the other aspects, are they static within the guideline, or would be they be returned as part of evaluating a guideline for a specific patient?</p>",
        "id": 153938642,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1519067549
    },
    {
        "content": "<p>I will submit the trackers, thanks Brynn. And those extensions look like what I wanted, I have extended RelatedArtifact with almost identical names. I didn't find those extensions as they weren't listed on the extensions list on the main page. They're CQIF extensions? I will likely use these. Thanks.</p>\n<p>The other factors are static within the guideline, specific to the action. Just like strengthOfRecommendation/qOE but a quantity type. But they might fall in the 20% of use cases that require extensions.</p>",
        "id": 153938644,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1519068581
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15574\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15574\">#15574</a></p>",
        "id": 153938659,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1519069310
    }
]