[
    {
        "content": "<p>Hi All, I need to create a FHIR resource for storing Relatives Clinical History information and I don't want to use FamilyMemberHistory, instead I want to use Observation resource with Observation.category as ''social-history''.  Is this correct approach? Also, please suggest the relevant SNOMED code for Observation.code element. Thank You</p>",
        "id": 204662187,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595423117
    },
    {
        "content": "<p>Is it proper coded data which fits nicely into an Observation?</p>",
        "id": 204672363,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1595427916
    },
    {
        "content": "<p>You might want to consider Questionnaire and QuestionnaireResponse</p>",
        "id": 204672560,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1595427989
    },
    {
        "content": "<p>Free text info. is available.. that's why I am restricting to use FamilyMemberHistory but it can be used as a Observation</p>",
        "id": 204672636,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595428020
    },
    {
        "content": "<p>Using Observation.category=social-history, I wanted to pass the info as a observation.valueString</p>",
        "id": 204672905,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595428122
    },
    {
        "content": "<p>But, looking for Snomed code for Observation.code element which is suitable in this context</p>",
        "id": 204673056,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595428197
    },
    {
        "content": "<p>The issue would be around the 'subject' of the Observation.  If the data is part of a patient's record, it would have to have the patient as subject.  You'd have to declare the 'focus' to be the RelatedPerson.   Even then, you'd have a challenge of having captured information differently from the way most systems expect to see it.  Have you considered just using FamilyMemberHistory.text?</p>",
        "id": 204674018,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595428582
    },
    {
        "content": "<p>(In general you don't want to create a RelatedPerson (which is someone who can act on a patient's behalf) for every relative you might want to include in the family history.)</p>",
        "id": 204674112,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595428622
    },
    {
        "content": "<p>In this case, Patient is the subject and as per Observation.category=social-history code explanation, family history can be captured under this. And my main issue in using FamilyMemberHistory is - I don't have any data apart from relation and problem history.</p>",
        "id": 204674873,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595428936
    },
    {
        "content": "<p>What is required in <a href=\"https://www.hl7.org/fhir/familymemberhistory.html\">https://www.hl7.org/fhir/familymemberhistory.html</a> that you don't have? What you state is what is all that is required plus  FamilyMemberHistory.status which is just A code specifying the status of the RECORD of the family history of a specific family member. Its a very bare bones resource as it is, probably because that is all you usually find in an EHR wrt Family History. Doing things differently will not promote interoperability.</p>",
        "id": 204677709,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1595430174
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span> Thank you for your response. But the main problem in using FamilyMemberHistory is - problem description is free text and not associated with any CodeableConcept. And also, the data which is available with me is part of Patient's Observation : Vital-Signs/Activity along with Relatives problem history. And after much research, I saw the provision in FHIR R4 itself, to store family history data using Observation resource. by describing Observation.category=social-history. I am not trying to do anything differently, rather trying to use the feature which is supported by FHIR itself.</p>",
        "id": 204678862,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595430684
    },
    {
        "content": "<p>Social History Observations define the patient's occupational, personal (e.g., lifestyle), social, familial, and environmental history and health risk factors that may impact the patient's health.</p>",
        "id": 204679449,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595430920
    },
    {
        "content": "<p>@FamilyMemberHistory.Condition.Code you can put coded concepts. You can use use <a href=\"https://www.hl7.org/fhir/valueset-condition-code.html\">https://www.hl7.org/fhir/valueset-condition-code.html</a> (example set) though the last time it was expanded was 01 Nov 2019. It is described as \"All of SNOMED\" or you could use the Problem value set: (Inclusion Criteria:Limited to terms descending from the Clinical Findings (404684003) or Situation with Explicit Context (243796009) hierarchies.) <a href=\"https://vsac.nlm.nih.gov/valueset/2.16.840.1.113883.3.88.12.3221.7.4/expansion/Latest\">https://vsac.nlm.nih.gov/valueset/2.16.840.1.113883.3.88.12.3221.7.4/expansion/Latest</a> (though it also has SOME expired codes)</p>",
        "id": 204681119,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1595431585
    },
    {
        "content": "<p>Category doesn't change the meaning of the Observation.  If you have an Observation with subject of Patient and no distinct focus and the Observation code + value says \"has breast cancer\", then that means that the patient has breast cancer.  The category being \"social history\" in no way modifies the Observation to be \"some relative has breast cancer\".</p>",
        "id": 204689721,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595435513
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I understand your point and already considered this case.. that's why in this case Observation.code will point to 365471004 | Finding of details of relatives (finding) (so as to point the Observation to the Patient's relative information) and Observation.valueString will be Problem findings of relative (in form of free text). In this way data integrity won't be lost. That is my understanding from the FHIR description.</p>",
        "id": 204752332,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595467570
    },
    {
        "content": "<p>If the Observation.code indicates it's about relatives, then Observation is fine.  In fact, it's common for observational statements about family history to exist in parallel with FamilyMemberHistory entries that provide the detailed support.</p>",
        "id": 204753981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595469879
    },
    {
        "content": "<p>Correct.. exactly same thing I am targeting to achieve. As I have minimal set of data, that's why I am trying to use this way and once I will have more detailed info. then I will use FamilyMemberHistory resource. Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for the confirmation.</p>",
        "id": 204754096,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595470067
    },
    {
        "content": "<p>Personally, I think the differentiation between Family History in Observation resources and Family member History in their own resources is unhelpful. Clinically when considering if a patient has any Family History then it forces the system to look in two places and risks that users will not recognise this and only look in one place and miss data. To avoid this we are only using Family member history, even when the family member is not specified.</p>",
        "id": 204777842,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595497652
    },
    {
        "content": "<p>I agree with your point but currently (due to minimal data availability in form of free text) we are using family history through Observation and later on (once enough data is there), we will start using FamilyMemberHistory.</p>",
        "id": 204784494,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595503430
    },
    {
        "content": "<p>Is this information going to be exchanged among systems or organizations? I think Richard's point is very valid that when accessing/processing information from outside one's own system, most existing systems will be looking for FamilyMemberHistroy, and if it is not there, the Observation will not be considered. </p>\n<p>On the other hand, if you a designing a system, and have full control over who is using the resources, then you can do whatever you think is most efficient...</p>",
        "id": 204793550,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1595509396
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  for sharing your thoughts.. As, we are planning for data exchange with other systems as well so I will definitely consider this while implementation. Thank You!</p>",
        "id": 204799241,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595512279
    },
    {
        "content": "<p>It would be very challenging to capture the information present in FamilyMemberHistory using Observation.  You couldn't even do it using components.</p>",
        "id": 204805572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595515037
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  My approach is:<br>\nObservation.category = social-history<br>\nObservation.code will point to 365471004 | Finding of details of relatives (finding) (so as to point the Observation to the Patient's relative information)<br>\nObservation.valueString will be Problem findings of relative (in form of free text). </p>\n<p>Because of unavailability of Problem/Diagnosis CodeableConcept and minimal data availability, I am trying to use Observation. And currently, there will be no FamilyHistoryResource available in the system, so if anyone is looking for Family/Relatives history then that will be directly pointed to enlisted Observations under 365471004 | Finding of details of relatives (finding)<br>\nThis way Data Integrity will be maintained for Problem findings of relative .</p>",
        "id": 204874531,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595558960
    },
    {
        "content": "<p>I am just exploring the other options available in FHIR R4 with minimal data restrictions apart from FamilyMemberHistory. And as Observation is the only resource where findings can be in any form either CodeableConcept or ValueString.</p>",
        "id": 204875191,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595560081
    },
    {
        "content": "<p>That seems reasonable.  Though if you're in the U.S., it would be best to use a LOINC code for the Observation as that's the preferred terminology for observation types.</p>",
        "id": 204878882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595565376
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Yes, I agree.. I am aware about this (of using Loinc Codes for Observations). I have observed that, LOINC Codes are mostly used in case of Vital Signs, Lab Orders etc.. where numerical values are involved as a result. And as - social-history, personal characteristics (other examples of Observations) have nothing to do with LOINC codes so we can use Snomed here. I might be wrong... seeking your advice on same. Thank You</p>",
        "id": 204879261,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1595565953
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 204879733,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595566674
    }
]