[
    {
        "content": "<p>Hello,<br>\nRelatedPerson resource just support only Patient as 1..1 description . How can i represent 1 RelatedPerson with multiple Patients<br>\nthanks</p>",
        "id": 265521691,
        "sender_full_name": "Tommy Vu",
        "timestamp": 1639977001
    },
    {
        "content": "<p>You would have a distinct RelatedPerson representing the person's relationship to each Patient. If you want to avoid duplicating the details you could consider populating them into a Person resource, but a bit of duplication is probably okay here.</p>\n<p><a href=\"https://build.fhir.org/relatedperson.html#scope\">https://build.fhir.org/relatedperson.html#scope</a>  has some relevant content</p>",
        "id": 265522183,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1639977607
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  <br>\nCan you give me a simple example such as RealtedPerson relatedMother have two patients patientSon and patientDaughter  ?</p>",
        "id": 265529694,
        "sender_full_name": "Tommy Vu",
        "timestamp": 1639986278
    },
    {
        "content": "<p>You'd have RelatedMother1 and RelatedMother2 with the same content except for their respective relationships with PatientSon and PatientDaughter.</p>",
        "id": 265530259,
        "sender_full_name": "René Spronk",
        "timestamp": 1639986830
    },
    {
        "content": "<p>RelatedMother1 and RelatedMother2 are played by the same Person resource, so some data will be on Person and won't have to be duplicated.</p>",
        "id": 265530333,
        "sender_full_name": "René Spronk",
        "timestamp": 1639986885
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span></p>",
        "id": 265530400,
        "sender_full_name": "Tommy Vu",
        "timestamp": 1639986959
    },
    {
        "content": "<p>The general philosophy is that RelatedPerson is \"owned\" by a particular Patient record.  There's an extension that allows you to assert that a RelatedPerson for one Patient corresponds to a different Patient record (if an organizations capabilities and privacy policies allow).  Person allows maintaining shared demographics across Patient, RelatedPerson and even Practitioner resources.</p>",
        "id": 265576798,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640013759
    },
    {
        "content": "<p>In a harmonious family, they all know about each other... the model is designed such that Privacy can be implemented. Some relationships must not be known by peers.</p>",
        "id": 265578352,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640014459
    }
]