[
    {
        "content": "<p>Why have many of the codes in STU3 changed to CodeableConcepts in R4 - especially around Required valueSets (for example Condition.clinicalStatus, Condition.verificationStatus etc.) - as this does introduce a set of &lt;coding&gt; tags at the very least?</p>",
        "id": 169042086,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1561563265
    },
    {
        "content": "<p>The change came about because of feedback from the implementation community, though the change is not without controversy</p>",
        "id": 169044261,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561564756
    },
    {
        "content": "<p>I plan to make a GForge comments on those two. Unless you beat me to the punch</p>",
        "id": 169085921,
        "sender_full_name": "Eric Haas",
        "timestamp": 1561587696
    },
    {
        "content": "<p>to stay in line with the rest of the spec and be code.  One place where the pattern should trump semantic purity.</p>",
        "id": 169086014,
        "sender_full_name": "Eric Haas",
        "timestamp": 1561587780
    },
    {
        "content": "<p>I will also be discussing this with the community. but the change wasn't made without reasons</p>",
        "id": 169126377,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561635820
    },
    {
        "content": "<p>It really comes down to \"how common is it for implementers to share (and need to share) alternate codings for these elements?\"  In most places (gender, all other statuses), we've said that few systems support that and that if you need it, extensions are fine.  It's not totally clear why these elements are exceptions.  But agree that there was a <em>lot</em> of discussion before things landed where they did.  It was primarily driven by a desire by certain large US governmental organizations that wanted to be able to send SNOMED CT.</p>",
        "id": 169171318,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561666529
    },
    {
        "content": "<p>OK - I see - so you MUST send the required code, and you're allowing the sending of alternate codes (and systems) as well by using CodeableConcept. Something like<br>\n  &lt;clinicalStatus&gt; <br>\n&lt;!--mandatory Required code--&gt;<br>\n    &lt;coding&gt; <br>\n      &lt;system value=\"http://terminology.hl7.org/CodeSystem/condition-clinical\"/&gt; <br>\n      &lt;code value=\"remission\"/&gt; <br>\n    &lt;/coding&gt; <br>\n&lt;!--Some \"preferred\" code--&gt;<br>\n    &lt;coding&gt;<br>\n      &lt;system value=\"http://snomed.info/sct\"/&gt;<br>\n      &lt;code value=\"277022003\"/&gt;<br>\n      &lt;display value=\"Remission phase\"/&gt;<br>\n      &lt;userSelected value=\"true\"/&gt;<br>\n    &lt;/coding&gt;<br>\n  &lt;/clinicalStatus&gt;</p>",
        "id": 169384289,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1561977445
    },
    {
        "content": "<p>Right.  And more specifically, we're saying we believe that most applications support receiving and storing the additional coded representations.  (If that wasn't the case, we would have defined the element as 'code' and implementers could have used extensions to convey additional coded representations.)</p>",
        "id": 169399321,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561990829
    },
    {
        "content": "<p>yes</p>",
        "id": 169609681,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562196462
    },
    {
        "content": "<blockquote>\n<p>we're saying we believe that most applications support receiving and storing the additional coded representations. </p>\n</blockquote>\n<p>I have seen systems that reject the whole resource because there were additional codings in a codeableConcept.</p>",
        "id": 169709598,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1562334231
    },
    {
        "content": "<p>Systems are allowed to create business rules like that, but whoever created such business rules should be given a stern talking-to.  Filtering data and ignoring data is cheap/free for the receiver.  However, on the sender side, creating, testing and maintaining custom interfaces for a particular recipient that strips out the things they don't want to ignore is very costly.</p>",
        "id": 169711954,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562336175
    },
    {
        "content": "<blockquote>\n<p>we believe that most applications support receiving and storing the additional coded representations.</p>\n</blockquote>\n<p>I believe this statement is just a fhir standards formalism.   In the real world, I think its really costly and unnecessary overhead to have to <br>\nimplement and support the statuses as <code>Codeableconcept</code> instead of using <code>code</code>.    Even though I assume the many data sources do map their local statuses to FHIR statuses in the backend,  If  this was critical for allergies and condition , why not for the rest of the clinical resources which currently use code?</p>",
        "id": 169745822,
        "sender_full_name": "Eric Haas",
        "timestamp": 1562376879
    },
    {
        "content": "<p>In making the statement, I was actually phrasing what the responsible work group is asserting - not necessarily what I personally believe.  I  agree that this couple of exceptions is problematic.</p>",
        "id": 169747302,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562379591
    }
]