[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191936\">@Michael Donnelly</span> (and anyone else): when we discussed \"Remove ElementDefinition.defaultValue[x]\" at the working group meeting, did any discussion relate to it's use in logical models? I'm going through removing it now, and.... it's a problem for all my v3 logical models which really do have default values that I really can't remove</p>",
        "id": 153940358,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519508093
    },
    {
        "content": "<p>This didn't come up specifically</p>",
        "id": 153940359,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1519508171
    },
    {
        "content": "<p>We reviewed the list of default values in the spec, which didn't include values from logical models</p>",
        "id": 153940360,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1519508209
    },
    {
        "content": "<p>so I have to define an extension for default value at least, since all versions of FHIR before 3.2 include default values, and I have to handle this in the IG publisher (and possibly the validator), and I have to do round trip version conversion for ElementDefinition and get it 100% fine. </p>\n<p>but also, I definitely need default values for logical models too. Of course, I can use the extension there too.</p>\n<p>But I'm wondering: maybe we should leave ElementDefinition.defaultValue[x] in, and only remove the use of default values from data types and resources?</p>",
        "id": 153940361,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519508320
    },
    {
        "content": "<p>that's been done, btw, I have a clean build that removes all default values</p>",
        "id": 153940362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519508580
    },
    {
        "content": "<p>If we put in an invariant that prohibits them everywhere except logical models, that can be ok.</p>",
        "id": 153940365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519509479
    },
    {
        "content": "<p>I've committed with updated doco but without that invariant, so people can have a look at this. (will add the invariant when I get a chance)</p>",
        "id": 153940369,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519509642
    },
    {
        "content": "<p>did we talk about default values on extensions?</p>",
        "id": 153940384,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519556353
    },
    {
        "content": "<p>Given that systems may strip out extensions, I don't think we can presume a default value.</p>",
        "id": 153940416,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519590280
    },
    {
        "content": "<blockquote>\n<p>\" I'm going through removing it now, and.... it's a problem for all my v3 logical models which really do have default values that I really can't remove\"</p>\n</blockquote>\n<p>I remember <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> bringing this up, but also remember you persuading him this was not a problem.  But that last bit might be my misrecollection ;-)  Sounds like logical models deserve a core (modifier) extension for  this?</p>",
        "id": 153940605,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1519655771
    },
    {
        "content": "<p>I don't remember that. But for now I've left it in as core and only allowed to be used in logical models</p>",
        "id": 153940650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519668576
    },
    {
        "content": "<p>In V2/V3 Logical Models at the very least you will have to deal with default values, for better or for worse.<br>\nIn profiles on those same Logical Models, e.g. on HL7 V2 ADT^A01 etc., you will again encounter those defaultValues present in the base Logical Model.</p>\n<p>So this brings me to something I never figured out entirely: what is a profile/template on a Logical Model? Is that another Logical Model (in which case we could uphold that defaultValue is only relevant for Logical Models), or is that in itself an actual \"profile\"?</p>\n<p>You could say: defaultValue shall not be used for FHIR uses of StructureDefinition. I have a hard time understanding how you would do V2/V3 in StructureDefinition if defaultValue goes away.</p>",
        "id": 153943199,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1520583941
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> Although technically possible, profiles on logical models are not clearly defined. Forge does not support profiles on logical models. Forge also won't let you apply slicing or extensions to a logical model.</p>",
        "id": 153943219,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1520598232
    },
    {
        "content": "<p>So StructureDefinition has been gaining capabilities necessary to express base V2/V3, but we don't know yet how to constrain those models, i.e. profile/template. <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> and I promised each other to give that some thought before September. <br>\nAs it stands today all you can do with a logical model, is use it as a source or target to translate from/to. That probably has merit, but it is not what I wanted. What I would like is to see if V2 ConformanceProfiles and V3 Template ITS could be superseded by StructureDefinition.</p>",
        "id": 153943738,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1520828923
    },
    {
        "content": "<p>it should be possible, so far as I know</p>",
        "id": 153943925,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520883176
    }
]