[
    {
        "content": "<p>How do you remove a security tag (Resource.meta.security) from a resource? At least in the HAPI server I'm playing with, I can add security tags with a PUT on the resource, but when I try to remove the security tags from the resource with a subsequent PUT, they are still there when I do a GET.</p>",
        "id": 162071483,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1553883775
    },
    {
        "content": "<p>security tags are no different than any other element. normal REST verbs apply.</p>",
        "id": 162071715,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553883948
    },
    {
        "content": "<p>not so simple - they're a special case. in my system, security tags auto-migrate across versions. you have to $meta-delete them</p>",
        "id": 162075847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553886791
    },
    {
        "content": "<p>why is this? This kind of merging-only behavior has never been discussed in the Security WG, and doesn't appear on a security page.</p>",
        "id": 162076984,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553887784
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , yup, just found $meta-delete</p>",
        "id": 162077113,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1553887875
    },
    {
        "content": "<p>it was in the spec from very early - long before security got involved. but the use case is simple:<br>\n- I (the patient) label a resource with a security code \"confidential\"<br>\n- an application updates it. it doesn't care about my confidentiality, so it doesn't set the label<br>\n- I don't want to to be unlabeled because of that </p>\n<p>so tags and labels are special - the only way to remove them is through $meta-delete. Because we anticipate that they are a special case</p>",
        "id": 162077367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553888098
    },
    {
        "content": "<p>That use-case today would be better handled with a Consent resource that addresses that instance of the resource specifically. This is the use-case that drove the element Consent.provision.data. We had no knowledge of this historic text.</p>",
        "id": 162077629,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553888296
    },
    {
        "content": "<p>I do not think that it should be handled by consent at all. The consent resource is no some magic wand; unless you propose to remove all security labels and replace them with consent</p>",
        "id": 162077956,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553888581
    },
    {
        "content": "<p>Setting a flag isn't a consent.  If I set a flag saying \"do not share with the patient\" - how could that be a consent?</p>",
        "id": 162077973,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553888592
    },
    {
        "content": "<p>I created <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20631\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20631\">GF#20631</a> to carry this discussion further and into Security WG</p>",
        "id": 162078979,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553889504
    }
]