[
    {
        "content": "<p>I noticed that the field <code>created</code> has been removed from <code>DocumentReference</code> in R4 and I couldn't spot a replacement (i.e. a field for indicating when the referred-to document, rather than the reference, was created). Did I somehow miss it or is there a different way of providing this information in R4 (curious to hear about the reasoning behind such changes, too)?</p>",
        "id": 180212064,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1573203044
    },
    {
        "content": "<p>It is in the Attachment.creation element.</p>",
        "id": 180233053,
        "sender_full_name": "John Moehrke",
        "timestamp": 1573222730
    },
    {
        "content": "<p>Ah, I though that would be smt. different. I thought <code>Attachment.creation</code> was meant to hold the time the <em>eletronic artifact</em> (e.g.  scan file) was created, which may be different from the time the <em>contained information</em> (in the sense of \"brainwork\", not bits and bytes) was created. </p>\n<p>That is, suppose I have a letter written by a doctor (and printed on paper) on Tuesday. On Wednesday, the document is scanned and stored as a PDF file. Finally, on Thursday, a DocumentReference resource having this PDF file as an attachment is created. Then my assumption was that I should set <code>DocumentReference.date</code> = Thursday and <code>DocumentReference.content.attachment.creation</code> = Wednesday (or maybe Thursday, since it was only wrapped in an Attachment element on Thursday??) . But where does Tuesday go (would have put in in <code>created</code> in R3)?</p>",
        "id": 180423389,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1573479064
    },
    {
        "content": "<p>It seems like the definition in Attachment.created could be clarified a bit <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>, would you be willing to submit a change request?</p>",
        "id": 180426152,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573481470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Sure, will do (will update here we I get it done).<br>\n\\</p>",
        "id": 180428311,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1573483147
    },
    {
        "content": "<p>Added <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25205&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25205&amp;start=0\">GF #25205</a> - apart from asking for clarification, it also makes the case for being able to capture the \"contained information creation time\" with DocumentReference in case that is currently not possible.</p>",
        "id": 180491291,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1573546001
    },
    {
        "content": "<p>Very good case, Indeed.<br>\nSorry, I am new to Fhir so my comment could be very \"N/A\"<br>\nIn your example case (Tu,We,Th), I should forget \"We\" : no need to save this date (no sense for me).<br>\nThe very important date is \"Tu\" : it is the Medical Date … and \"Th\" is the Record Date.<br>\nI think Fhir is open enough for you to choose where to put the date … just document it on your IG.</p>\n<p>For another example, I use also the DocRef resource.<br>\nAnd in a particular usecase, I put the MedicalDate in \"DocumentReference.date \" and RecordDate in \"DocumentReference.content.attachment.creation\" … <br>\n… that is the way it make sense.</p>",
        "id": 180499467,
        "sender_full_name": "Pierre Billot",
        "timestamp": 1573552847
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"213800\">@Pierre Billot</span>! I agree that the Wed is probably not so interesting, but the thing is that the spec does make specific statements about what is allowed, statements which make it unclear where the \"medical date\" should go.  E.g. for <code>DocumentReference.date</code>, it states that it is \"When the document reference was created\" (what in STU3 was handled by <code>DocumentReference.indexed</code>) which I would read as ruling out using this field to store the medical date. Like you, I would like to include the medical date, so hopefully, this will be clarified will the resolution of the GF issue.</p>",
        "id": 180608176,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1573638803
    }
]