[
    {
        "content": "<p>The CDS WG is considering changing the name of the RequestGroup resource to RequestOrchestration, and is seeking feedback on this change. <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24619\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24619\">GF#24619</a></p>",
        "id": 177262784,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1570121041
    },
    {
        "content": "<p>I think this much better</p>",
        "id": 177280538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570132293
    },
    {
        "content": "<p>Isn't RequestGroup the resource we must use for simple composite orders, e.g. \"take these 2 medications\" - since MedRequest onylhas one product..</p>",
        "id": 177297385,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570144474
    },
    {
        "content": "<p>If so, we would need a thing  called RequestOrchestration to issue a simple 2-line prescription. Sounds grand &amp; scary.</p>",
        "id": 177297432,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570144536
    },
    {
        "content": "<p>Orchestrations aren't necessarily that complex</p>",
        "id": 177299773,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570147324
    },
    {
        "content": "<p>Sure. it's the name that is scary and gives the feeling that something smaller may be missing - if we need to do orchestration, if \"group\" seems way more common..</p>",
        "id": 177300125,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570147815
    },
    {
        "content": "<p>Grahame wasn't a fan of Group.  I can live with either</p>",
        "id": 177305656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570156054
    },
    {
        "content": "<p>I think Orchestration sounds harmonious :) And after many rounds of discussion and lots of thought about it, I think it really is the best name I've heard so far of what the resource is really representing.</p>",
        "id": 177306433,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1570157482
    },
    {
        "content": "<p>I agree it sounds grand. As an implementer, when I want something simple like making a basic prescription with 2 drugs, I would not think of looking at a resource called Orchestration.</p>",
        "id": 177353182,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570204942
    },
    {
        "content": "<p>How do make sure that people that don't need orchestration, just grouping, find the right resource?</p>",
        "id": 177353486,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570205101
    },
    {
        "content": "<p>Note that I presume that presume that prescription of 2 items will be handled with RequestGroup. It could be handled with something else (CarePlan? that would be strange).</p>",
        "id": 177353659,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570205169
    },
    {
        "content": "<p>It'd probably be good to have pointers in the notes for most Request resources to the grouping resource (whatever we call it)</p>",
        "id": 177354231,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570205582
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> are you trying to represent one prescription that is for two drugs?  Or two different prescriptions, each for one drug?  It seems that RequestGroup/Orchestration would be for the 2nd but not for the 1st.</p>",
        "id": 177354431,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570205732
    },
    {
        "content": "<p>Prescription:<br>\n- Drug 1, 2x day, for 7 days<br>\n- Drug 2, 3x day, for 7 days or keep taking until you run out<br>\n- Drug 3 in case you have pain from taking drug 2</p>",
        "id": 177354770,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570205966
    },
    {
        "content": "<p>and you consider those as one prescription?  Most systems in North America would consider those three separate prescriptions.</p>",
        "id": 177354851,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570206004
    },
    {
        "content": "<p>one doctor makes this, and they are legally / clinically responsible for the combination.</p>",
        "id": 177355512,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570206404
    },
    {
        "content": "<p>Sure, but we consider this three different prescriptions and not one.  If it was represented as three different prescriptions, then you could use RequestGroup/Orchestration to hold all three of these together if needed.</p>",
        "id": 177355664,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570206486
    },
    {
        "content": "<p>so yes, this is one prescription, which is a request for one or more drugs.</p>",
        "id": 177355689,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570206508
    },
    {
        "content": "<p>in v2 this is ORC-4. Just a grouper ID.</p>",
        "id": 177355734,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570206540
    },
    {
        "content": "<p>ok, i can tell a physician that he makes one prescription and this gets \"technically\" split in 3 prescriptions, but from their perspective, and until the treatment is over, this is one prescription.</p>",
        "id": 177355883,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570206613
    },
    {
        "content": "<p>you are redefining the term 'prescription' :)  As I said above, in North america (US/Canada), that would not be considered one prescription but three separate prescriptions.</p>",
        "id": 177355948,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570206663
    },
    {
        "content": "<p>what happens if the patient has an adverse reaction to drug 1?  How do you abort one part of your \"prescription\"?</p>",
        "id": 177356020,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570206718
    },
    {
        "content": "<p>(that last thing is exactly why I think it is a good idea to have this as one prescription. someone has to look at it from a whole perspective, not cancel the drug that is making me dizzy...)</p>",
        "id": 177356281,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570206880
    },
    {
        "content": "<p>anyway, do a quick google image search for a few translations of \"prescription\":<br>\nreceita medica, receta medica, prescription medicale, voorschrift - they easily show many drugs in one paper</p>",
        "id": 177356456,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207007
    },
    {
        "content": "<p>a prescription can contain a set of drugs. Is this under debate?</p>",
        "id": 177356478,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207033
    },
    {
        "content": "<p>okay, i'm not sure that I fully understand your use case as there seems to be some problems with it.  Leaving that aside, it doesn't seem to me like RequestGroup/Orchestration is what you're looking for.  Here is the scope of the resource: \"The RequestGroup resource is used to represent a group of optional activities that may be performed for a specific patient or context.\"  That doesn't seem to fit your use case.</p>",
        "id": 177356479,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570207033
    },
    {
        "content": "<blockquote>\n<p>a prescription can contain a set of drugs. Is this under debate?</p>\n</blockquote>\n<p>Yes.  Because that is not how we've modeled a Prescription in FHIR.</p>",
        "id": 177356510,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570207060
    },
    {
        "content": "<p>We haven't modeled a prescription in FHIR.  We have modeled a medication Request, which is for one drug only.</p>",
        "id": 177356586,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207097
    },
    {
        "content": "<p>The key thing is that with RequestGroup you <em>cannot</em> cancel just one of the pieces.  You have to cancel/suspend/resume the whole thing.</p>",
        "id": 177356593,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570207099
    },
    {
        "content": "<p>You'd have to model that as different MedicationRequest resources, since they talk about different drugs, so what I hear you saying <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , is that having a \"grouper\" to keep them related is important, and that's the function of the RequestOrchestration resource.</p>",
        "id": 177356597,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1570207102
    },
    {
        "content": "<p>If you just want to say \"these were created as a group\", you should just use the requisitionId</p>",
        "id": 177356613,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570207120
    },
    {
        "content": "<p>now, seems we have unearthed one of 2 things: </p>\n<ol>\n<li>we did not yet say what to do for grouping which IMO is more than common and actually required in many places. - which is ok, implementers can handle it</li>\n<li>we don't think that medication prescriptions can have more than one drug  - which is not something I can defend as such</li>\n</ol>",
        "id": 177356790,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207261
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> where is requisitionId?</p>",
        "id": 177356808,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207278
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> where is requisitionId?</p>\n</blockquote>\n<p>It is the groupIdentifier</p>",
        "id": 177356884,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570207328
    },
    {
        "content": "<p>MedicationRequest.medication is 1..1</p>",
        "id": 177356925,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1570207368
    },
    {
        "content": "<p>ok groupIdentifier should work. I will see if there is anything that could break that but it would not be in the 80%, i hope.</p>",
        "id": 177356962,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207403
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> yes, and I agree. My reaction was to say that if we rename something relatable as \"grouping\" to something more comprehensive, we may want to give some guidance so that people are not scared</p>",
        "id": 177357092,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207463
    },
    {
        "content": "<p>I was afraid that we would assert prescriptions as only for one drug (which would be us redefining the concept of prescription in several jurisdictions). groupingID at least keeps things relinkable.</p>",
        "id": 177357467,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207723
    },
    {
        "content": "<p>background: several years ago, we had a challenge - when a prescription had 5 entries, and only 3 of those were dispensable, someone would have to decide whether those 3 should be dispensed at all...</p>",
        "id": 177357639,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570207832
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , agreed, that's definitely good feedback.</p>",
        "id": 177357694,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1570207862
    },
    {
        "content": "<blockquote>\n<p>I was afraid that we would assert prescriptions as only for one drug (which would be us redefining the concept of prescription in several jurisdictions). groupingID at least keeps things relinkable.</p>\n</blockquote>\n<p>To be clear, our MedicationRequest - which is intended to model a real-life prescription - is for one drug only.  When I hear people talk about a FHIR Prescription, I tend to substitute MedicationRequest for Prescription.</p>",
        "id": 177357744,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570207895
    },
    {
        "content": "<blockquote>\n<p>To be clear, our MedicationRequest - which is intended to model a real-life prescription - is for one drug only.  When I hear people talk about a FHIR Prescription, I tend to substitute MedicationRequest for Prescription.</p>\n</blockquote>\n<p>I'd agree that our medicationRequest is intended to <strong>support</strong> a real-life prescription. I disagree and would be concerned if we try to say it models one - that would affirm that we managed to make a good resource but we did not look at what Prescription means in many places in Europe.</p>",
        "id": 177359163,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570208713
    },
    {
        "content": "<ol>\n<li>point is made on Orchestration, </li>\n<li>glad we uncovered this, do we need to move this prescription issue to another stream? I am really worried if we introduce unnecessary definition constraints which clash with the legal reality</li>\n</ol>",
        "id": 177359355,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570208848
    },
    {
        "content": "<p>Interesting debate! In many parts of the world, 'real life' paper prescriptions - whether generated electronically, or by hand - contain one or many items (i.e. medications). Furthermore, in some countries those items can be filled (dispensed) by different pharmacies. In legal terms, in NZ anyway, a Prescription is an order and those of us with extensive IT experience outside of healthcare are fully aware that an order for the sale or purchase of goods can contain many items....BUT - in terms of modelling prescriptions for the purposes of health information exchange and persistence of prescription data, my firm view (based on my 8 years working on the NZ e-Prescription Service) is that the FHIR Resource Model  - of a one-to-one relationship between request and medication - is the best approach. In NZ, this is how our CDA-based system is implemented (one CDA per item) and fitting our use case - in addition to the North American ones articulated by Jean - is, I believe, evidence of its robustness. Grouping items by a common order identifier shouldn't be a challenge for endpoint systems - in our national system, the items relating to a common physical prescription always move together across the wire.</p>",
        "id": 177371557,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1570217416
    },
    {
        "content": "<p>Technically we can do either. For example IIRC I think the IHE approach is several items in one document. I find this better as it does not introduce any divergence to the concepts used in clinical practice, and therefore at least we do not add any risk there. Legally, a Prescription can contain several items. So we do not really have to define what a prescription is.</p>",
        "id": 177374544,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570219516
    },
    {
        "content": "<p>I think this discussion shows why the current name is a problem - because people naturally think that Request group is a group of requests. Which it actually isn't (it is, but only in a very specific context, and that other context is not in the name). </p>\n<p>Also, we firmly need a good documented story in the spec about the 1 item / multiple items per prescription. <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> can you make a task asking for the base spec to document the committee's thinking on this matter?</p>",
        "id": 177377332,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570221835
    },
    {
        "content": "<p>sure. Is this a medication-specific question or a broader one?<br>\nin other words, which committee(s)?</p>",
        "id": 177377534,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570221978
    },
    {
        "content": "<p>we start with medication and see where that takes us?</p>",
        "id": 177377558,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570222006
    },
    {
        "content": "<p>added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24905\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24905\">GF#24905</a><br>\n(had to do some research in the meanwhile. amazing to see so many examples and photos but not one model)</p>",
        "id": 177381278,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570225003
    },
    {
        "content": "<blockquote>\n<p>added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24905\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24905\">GF#24905</a><br>\n(had to do some research in the meanwhile. amazing to see so many examples and photos but not one model)</p>\n</blockquote>\n<p>We actually do point implementers on handling this:</p>\n<p>The MedicationRequest resource allows requesting only a single medication. If a workflow requires requesting multiple items simultaneously, this is done using multiple instances of this resource. These instances can be linked in different ways, depending on the needs of the workflow. For guidance, refer to the Request pattern</p>",
        "id": 177382831,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570226434
    },
    {
        "content": "<p>I'm not sure that we would have much to say other than what the Request Pattern link says. (Section 12.3.10 for those following at home)</p>",
        "id": 177382943,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570226533
    },
    {
        "content": "<p>oh you are right - I should have checked. So actually, my issue is the conflict of the descriptions of request group on the request page and the request group page</p>",
        "id": 177383045,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570226637
    },
    {
        "content": "<blockquote>\n<p>I'm not sure that we would have much to say other than what the Request Pattern link says. (Section 12.3.10 for those following at home)</p>\n</blockquote>\n<p>that is good, since we don't need to define that a prescription contains only one medication.  I think the options in the Request pattern will cover it. S<br>\nSorry, I had assumed requestGroup was the \"preferred\" way.  But if that one is only used for more \"orchestrated\" requests, then it would work even with the name change.</p>",
        "id": 177383266,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1570226840
    }
]