[
    {
        "content": "<p>I’m trying to figure out how to represent a patients ‘request for repeat prescription’. </p>\n<p>This occurs when a patient is already taking the medication on a long term basis, but is about to run out, and communicates with their doctor to get another script without having to see them. The doctor can accept the request, creating a prescription or decline it requesting a consultation. </p>\n<p>The request comes from a patient portal, where the list is composed of MedicationStatement resources. </p>\n<p>Given that this is a request, it would seem that a resource from the <a href=\"http://hl7.org/fhir/workflow.html#list\">request pattern</a> should be used – which in this case could either be a MedicationRequest (requester = patient, intent = ‘proposal’) or a Task.</p>\n<p>I’m leaning towards MedicationRequest (It would need to be updated by the doctor to be used as the actual prescription – or a new one generated). </p>\n<p>Task doesn’t seem to offer a lot of additional value (there is no significant workflow), and would still require some other resource (like a MR) to represent what is actually being requested.</p>\n<p>Does that seem reasonable?</p>",
        "id": 245274871,
        "sender_full_name": "David Hay",
        "timestamp": 1625723768
    },
    {
        "content": "<p>If you have the options to accept or decline, then Task is better suited - it has these status codes available out of the box. The patient request in this cases is a request for action regarding an existing prescription, which is the MedicationRequest - again, Task is a better fit here, in my opinion.</p>",
        "id": 245301176,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1625744338
    },
    {
        "content": "<p>Normally you'd use a Task that points to the original MedicationRequest saying \"please renew this\".  The response might be \"ok, done\" or \"please come in\" or \"I think we're going to change your dose\", etc.</p>",
        "id": 245318209,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625753388
    },
    {
        "content": "<p>You could have the patient create a MedicationRequest with intent of 'proposal', but then you'd still need machinery (Task, operation, message, etc.) to say \"please action this\".</p>",
        "id": 245318340,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625753448
    },
    {
        "content": "<p>Thanks. And if the original 'medication' resource is a MedicationStatement  (not a MedicationResource) - ie a summary of the original request ?</p>",
        "id": 245347523,
        "sender_full_name": "David Hay",
        "timestamp": 1625766682
    },
    {
        "content": "<p>Just thinking about this a bit more - if the GP is generating a script (with MedicationRequest resources) which is sent to a pharmacy, is an associated Task still needed?</p>",
        "id": 245349767,
        "sender_full_name": "David Hay",
        "timestamp": 1625767701
    },
    {
        "content": "<p>You could still have a Task, though the semantics of the Task.code would be a bit more funky.  \"Please provide a refill for whatever the current prescription is for the medication summarized by this record\".  Not impossible, but slightly odd...</p>",
        "id": 245355869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625770539
    },
    {
        "content": "<p>Could the semantics be expressed using different structure? E.g.</p>\n<ol>\n<li>Current medication is only accessible via MedicationUsage - use Task.input to reference the medication</li>\n<li>Current medication is accessible as an existing MedicatonRequest - use Task.focus to reference the medication</li>\n</ol>\n<p>In both cases the code can be the same (please authorize refill).</p>\n<p>To David's second question - the actual prescription process will have a different Task resource. The Task related to the patient request is not the same as the actual prescription.</p>",
        "id": 245358200,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1625771639
    },
    {
        "content": "<p>So in option 1, you could have a single task referencing all MedicationStatement resources - which would be good! In this scenario at least, the PMS has the 'original' data for the medication that it used to create the MedStatement, so that would work nicely. Need to figure out the code of course...<br>\nOption 2 is doable - but focus is 1..1 - needing a Task per medication. You could argue that each drug is a separate 'thing' with its own workflow of course...</p>\n<p>wrt the second question - I guess it's more about prescribing generally. If the provider wishes to generate a prescription with, say, 5 medications on it - does that mean the resulting structure (whatever paradigm it may be) needs 5 Tasks as well? ie the MedicationRequest (a 'request' resource) is not enough on it's own? Is this Grahames example of finding a paper  prescription on the street - by itself it isn't enough to be the actual order to dispense? And - if so - then one Task per MedRequest?</p>",
        "id": 245379836,
        "sender_full_name": "David Hay",
        "timestamp": 1625783244
    },
    {
        "content": "<p>The cardinality of MedicationRequest.medication is 1..1, so one medication resource resource per prescription item (drug) would be required if you go down that route.  However, if you are going down that path (rather than just Task) - it might be better to discuss this with the NZePS team, because whatever solution that you design would need to fit into the NZePS eco-system, .e.g. a requirement not to create additional messaging to pharmacies.</p>",
        "id": 245382084,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1625785065
    },
    {
        "content": "<p>Absolutely. Has any design work already been done?</p>",
        "id": 245385515,
        "sender_full_name": "David Hay",
        "timestamp": 1625787901
    },
    {
        "content": "<p>BTW - I don't believe it could ever be 'just Task' - the task has to be referencing something via focus - which I guess in this case would be the MedicationRequest...</p>",
        "id": 245386021,
        "sender_full_name": "David Hay",
        "timestamp": 1625788431
    },
    {
        "content": "<p>One other thing: If we model the prescription as a Document (after all it is a signed, legal thing - in primary care anyway), then there could be other possibilities - eg the Composition uses the section to point to a List that references the MedicationRequest resources. Then the Task references the List.  But I'm kinda hoping that someone else has worked on this...</p>",
        "id": 245386161,
        "sender_full_name": "David Hay",
        "timestamp": 1625788558
    },
    {
        "content": "<p>If the Task points to the List, how would you know which request to renew?</p>",
        "id": 245389447,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625792202
    },
    {
        "content": "<p>As a side point, just because clinicians are used to thinking about everything as being a 'document' doesn't mean that the FHIR document paradigm is appropriate.  If you desperately want a signature on a MedicationRequest (or anything else) you can do that with an extension - and considerably less overhead.</p>",
        "id": 245389488,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625792271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>  don't forget that the NZ Medicines Regulations changed last year, so we now have both paperless and signature-exempt prescriptions.</p>",
        "id": 245390681,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1625793716
    },
    {
        "content": "<p>If the prescription is a clinical issued document, I don't think we could use a Task</p>",
        "id": 245489066,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625860184
    },
    {
        "content": "<p>I see task as \"this is authorized already, please do one more\"</p>",
        "id": 245489168,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625860229
    },
    {
        "content": "<p>For a physician saying \"this needs a new authorization, please do more\" I'd definitely look at medrequest</p>",
        "id": 245489237,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625860269
    },
    {
        "content": "<p>The cardinality of medication in a request is a challenge but I think the current recommendation is to use a requestgroup</p>",
        "id": 245489567,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625860437
    },
    {
        "content": "<p>The prescription is always the MedicationRequest - whether you wrap it in a document or not.</p>",
        "id": 245491675,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625861477
    },
    {
        "content": "<p>If the prescription is for \"1x Drug A + 2x drug B + Drug C PRN\",  this can be called 1 prescription with 3 lines, not 3 prescriptions.</p>",
        "id": 245535057,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625901516
    },
    {
        "content": "<p>We need to group those. Sometimes we need to say \"items 2 and 3 are going to be replaced by item 4) and then the prescription has 2 lines.</p>",
        "id": 245535075,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625901559
    },
    {
        "content": "<p>Two possibilities.  If the order is inseparable - i.e. you can't cancel or suspend one part without cancelling or suspending the same thing (and the combination is considered a single order for the purpose for renewals), then you must use RequestGroup.  If the piece of paper just happens to have 3 orders on it, they'll all have the same groupIdentifier so that you know they were ordered at the same time.  Each item can be cancelled or suspended or renewed independently.  The same groupIdentifier may drive different outcomes in terms of reimbursement or other processes, but otherwise doesn't matter much.  In all cases, if you're asking for a renewal you're pointing to MedicationRequest or RequestGroup - never a document or Composition.</p>",
        "id": 245559920,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625934843
    },
    {
        "content": "<p>Right. That is what I assumed and what I recall - use RequestGroup.</p>",
        "id": 245570652,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625950698
    },
    {
        "content": "<p>In IHE we used prescriptions as documents (on the CDA side that was the only way to go, I guess, and for V2 we needed to consider more than a point-to-point communication). When we do REST our lives should be oh so much easier</p>",
        "id": 245570807,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625950827
    },
    {
        "content": "<p>on the topic of prescription Vs prescription lines: I'm not confident about saying in an ihe profile: <br>\n\"the standard way to exchange a prescription... depends. A prescription can be a RequestGroup or a MedRequest\"</p>",
        "id": 245571331,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625950978
    },
    {
        "content": "<p>Receivers should be able to expect consistent behaviour, right?</p>",
        "id": 245571535,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625951061
    },
    {
        "content": "<p>Unless you're talking complex chemotherapy regimens, prescriptions are going to be MedicationRequest.  Complex multi-drug orders that must be treated as a single therapy are pretty much unheard of in community settings.</p>",
        "id": 245571838,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625951193
    },
    {
        "content": "<p>Simple treatments like hypertension contain 3 drugs. Many prescriptions include the medication and the stomach protector.</p>",
        "id": 245589960,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625982593
    },
    {
        "content": "<p>Sure, but are they treated as an inseparable order or are they captured by the community as two separate Rxs?  I'm pretty sure it's the latter.</p>",
        "id": 245590221,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625983094
    },
    {
        "content": "<p>there is some context to this: I am thinking \"Prescription\" the analogous to the paper that the physician gives when we leave the consultation. In some languages this paper is called the equivalent to \"recipe\". (which is where i come from - the prescription is the paper, not a single line)</p>",
        "id": 245605972,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1626008445
    },
    {
        "content": "<p>And I think these lines being inseparable depends on at least one factor: the indication. If two drugs are taken for the same indication, I'd definitely presume they are inseparable. E.g. antibiotic + PPI for a patient that has ulcers.</p>",
        "id": 245606037,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1626008533
    },
    {
        "content": "<p>Probably worth investigating whether systems can suspend or cancel one and not the other.  (Should or would cancel is different.  If it's <em>possible</em> then you've just dealing with MedicationRequest with no RequestGroup involved.</p>",
        "id": 245609767,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626013852
    }
]