[
    {
        "content": "<p>I have a <code>ProcedureRequest</code> that is to occur <code>once,  every week on monday or tuesday for two months</code> <br>\nI've deduced it as following:</p>\n<p><code>Timing.repeat.frequency = 1</code><br>\n<code>Timing.repeat.period = 1</code><br>\n<code>Timing.repeat.periodUnit = wk</code><br>\n<code>Timing.repeat.dayOfWeek = mon|tue</code> <br>\n<code>Timing.repeat.bounds.range (those two months)</code></p>\n<p>The docs say </p>\n<blockquote>\n<p>If no days are specified, the action is assumed to happen every day as otherwise specified. The elements frequency and period cannot be used as well as dayOfWeek.</p>\n</blockquote>\n<p>I see that either I use frequency/periodUnit or dayOfWeek but not both. This is good for the above use case. </p>\n<p>What if there is a procedure to be done <code>once every 6 hrs only on every monday for two months</code> (totally arbitrary for now). How would the resource change?</p>",
        "id": 153926504,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1513800960
    },
    {
        "content": "<p>Actually, your first use-case can't be expressed because if you drop frequency and period and just list mon|tue, that would say \"do this every Monday <em>and</em> Tuesday for two months\".  Allowing frequency with dayOfWeek would change the meaning of dayOfWeek from an \"and\" to an \"or\", which is why we prohibit that - changing the interpretation of elements is generally a bad thing.  Essentially what you're looking for is an intersection between two timings - one saying \"once a week\" and one acting as a filter that says \"only on these days\".  At the moment, we've said that's overly complex for core and would need to be handled by extension.  If you disagree, you're welcome to submit a change request.</p>",
        "id": 153926508,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513802455
    },
    {
        "content": "<p>Could you elaborate on how would I handle it in the current version if at all it is possible?<br>\nI'm not sure if your implying I use two Timing resources? One as an extension in the ProcedureRequest?</p>",
        "id": 153926531,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1513805175
    },
    {
        "content": "<p>You'd need to use extensions on the Timing data type</p>",
        "id": 153926542,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513808577
    }
]