[
    {
        "content": "<p>When posting certain types of resources, there can be a legal need to 'attest' to the accuracy/completeness of the content.  I've heard conflicting recommendations about whether this is best handled using an extension, Provenance (can be sent as a header in the original post) or via a separately posted Composition pointing to the original resource/set of resources.  (The last option surprised me.)  I think we need more guidance for the community on how this SHOULD be done (and why).  So starting the discussion here.<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 211382416,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601153848
    },
    {
        "content": "<p>the first question is what 'attestation' means, partly a legal question. The second question is how one cam be clear exactly what is being attested to</p>",
        "id": 211398105,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601181367
    },
    {
        "content": "<p>My presumption is that if you were using Provenance, you'd be attesting to the narrative text</p>",
        "id": 211400302,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601185786
    },
    {
        "content": "<p>I am missing the background on the use-case. I think we must always start with a presumption that a legal medical record would have access controls preventing any random user from Creating or Updating any data. Thus any data is an attestation of the creator. If we can't agree to this, then everything falls. Having a Provenance can add more specific indications of the source of the data. I don't think Provenance is any more strong 'attestation', it is just more specific.</p>",
        "id": 211507278,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601306596
    },
    {
        "content": "<p>It sounds like there have been discussions of this use-case that I am simply not aware of.</p>",
        "id": 211507456,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601306658
    },
    {
        "content": "<p>There was discussion at the joint PE/FHIR-I session that involved a suggestion that Composition was necessary to support the attestation piece required by US legislation around patient-request for data correction.  I found that proposal surprising and unnecessary.  I tend to agree that <em>any</em> FHIR request is intrinsically attested if you've got appropriate user authentication.</p>",
        "id": 211507995,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601306904
    },
    {
        "content": "<p>The use-case of patient directed corrections is a bit different than general purpose attestation. The use-case is one where the legal medical record holds information that the patient disputes. So it is really more a dispute resolution workflow that results in a change to the legal medical record. I might be convinced that the patient dispute should be documented in a Composition that explains the current state of the information, the dispute, the correction requested, and supporting materials.   <br>\nWhen the data are corrected, the correction Provenance could point .entity at that composition as evidence to the correction (or even as a Provenance of a rejection of the dispute).</p>",
        "id": 211509134,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601307438
    },
    {
        "content": "<p>Can you explain why that overhead would be necessary?  Why is it not sufficient to have a Task that says \"here's what's wrong and needs to change\"?  Why is the overhead of Composition needed?</p>",
        "id": 211509417,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601307581
    },
    {
        "content": "<p>no, I can't. a task might be all that is needed.</p>",
        "id": 211515762,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601310622
    },
    {
        "content": "<p>I want to point out that I don't believe I ever heard the word 'necessary' in this context.</p>",
        "id": 211544504,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601324141
    },
    {
        "content": "<p>Ok, then what makes it \"more desirable\" or \"more appropriate\"?</p>",
        "id": 211545899,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601324868
    }
]