[
    {
        "content": "<p>Hello, how would I represent the temporal relationship of a blood glucose measurement with food - whether it was taken during fasting, after eating, etc?</p>",
        "id": 153963836,
        "sender_full_name": "Dimitar",
        "timestamp": 1526896295
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 153963843,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526909442
    },
    {
        "content": "<p>Observation.components or use effectiveTiming with an offset to a life event.  We are looking at this in open mHealth as well and I am towards using components observations there.</p>",
        "id": 153963984,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526948853
    },
    {
        "content": "<p>So the main Observation.code would be \"blood glucose\", but you could have a component that captured whether the patient was fasting or not (or for how long)</p>",
        "id": 153964008,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526958185
    },
    {
        "content": "<p>We discussed this last week at the WGM (mainly in Thursday Q1 and some additional in Q4).  We still do need to clarify the best/recommended way to do this.  Whether 'component' is the answer, I'm not quite so sure.  I think of this as a 'pre-condition'.  I mentioned that in the <a href=\"http://confluence.hl7.org/display/OO/OO+WGM+-+201805+-+Minutes\" target=\"_blank\" title=\"http://confluence.hl7.org/display/OO/OO+WGM+-+201805+-+Minutes\">Q1 discussion</a> and 'pre-condition' was brought up again in the Q4 joint session with CIMI, as that is consistent with the usage in SNOMED CT.  In Q1 a motion was initially made to add a 'supportingContext' element to Observation for dealing with this (with the group at the time preferring that name over 'pre-condition'), but the motion was withdrawn and instead it was decided to further discuss in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17228\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17228\">GF#17228</a> on the OO on FHIR calls.  So there still is some work to do on it.</p>",
        "id": 153964018,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1526962636
    },
    {
        "content": "<p>These things are all covered by the codes too.   So you can have translations as well.</p>",
        "id": 153964024,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526968895
    },
    {
        "content": "<p>Yes, I agree it may often be covered in the codes, and that is perfectly appropriate - but it's not necessarily \"all\" or \"always\" going to be able to be covered there.  One example that we discussed last week was the need to record the O2 flow rate or FIO2 that is being administered during various respiratory measurements (not necessarily blood gases, which also include a specimen).  Re-reading the Notes on Observation.component again it doesn't seem like this is a good fit with that (although possibly I could be persuaded or we could update the documentation to encompass it).  Again, it's basically the notion of an observation \"pre-condition\" and the question of where/how that should be represented.</p>",
        "id": 153964109,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1527007126
    },
    {
        "content": "<p>Component or related depending... I think FiO2 are independent and can be used separately so I would recommend related.  I think we have written about all we can on the subject.  We can wring our hands and gnash our teeth all we want but at some point I think it is up the implementation community to find the path of least resistance and create their own idioms and best practices and hopefully document in the profile/IGs.</p>",
        "id": 153964116,
        "sender_full_name": "Eric Haas",
        "timestamp": 1527008177
    },
    {
        "content": "<p>Thank you for the recommendations, for now, I will go with storing the temporal relationship as a component.</p>",
        "id": 153964313,
        "sender_full_name": "Dimitar",
        "timestamp": 1527067564
    },
    {
        "content": "<p>This could be precoordinated into the code element as well if you mean the relationship as a concept like 'fasting' or 'post-prandial' or 'preprandial'. However if you also need 'time since last meal' as a quantity, then it will have to go into a component.</p>\n<p>Would it be acceptable to slice category here and specify a slice for 'relativity to food' and bind it to a valueset of fasting/postprandial/preprandial? Or is that too drastically changing the meaning of category?</p>",
        "id": 153965067,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1527465641
    }
]