[
    {
        "content": "<p>Hello Team,</p>\n<p>I am representing a healthcare technology company (MphRx) that aggregates data from different sources within a health system and provides a unified clinical view of that data. We store our data adhering to FHIR standards and expose APIs to make this data easily accessible.  </p>\n<p>We have recently won a major contract to capture and aggregate claims data (HCFA1500 and UB04) . I have attached the sample forms for the same. We have made initial attempts to map the fields but are finding it difficult to do the following<br>\n1) map all the fields to their corresponding FHIR field<br>\n2) ensure that there is a linkage between resources if claims data from one form is being captured in multiple resources (ex: claims, coverage,practitioner etc.)<br>\n3) ascertain if the mapping done by us is accurate as per FHIR standards or not</p>\n<p>It would be of great help if the FHIR team can guide me to some online resources/documents where claims data has been mapped to the corresponding FHIR resource/field.  Any suggestion from your side to overcome this obstacle  would be really useful for us. I look forward to hearing from you all. Thank you. <a href=\"/user_uploads/10155/NLPgVlZ5nOjlPGqx1hW4uRwv/HCFA-1500.pdf\" target=\"_blank\" title=\"HCFA-1500.pdf\">UB-04-Schema.pdf</a> </p>",
        "id": 153875672,
        "sender_full_name": "Rohan Sahu",
        "timestamp": 1489031652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> or <span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> can probably provide the most guidance here.  (Note that some elements may require the use of extensions)</p>",
        "id": 153875676,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489032878
    },
    {
        "content": "<p>Thank You, Lloyd</p>",
        "id": 153875679,
        "sender_full_name": "Rohan Sahu",
        "timestamp": 1489033619
    },
    {
        "content": "<p>Hi Rohan: The Claim has been mapped to the CMS1500 <a href=\"http://and%20several%20other%20standards\" target=\"_blank\" title=\"http://and%20several%20other%20standards\">HCFA 1500</a> but they aren't currently showing. I'll see how to get those exposed. Financial Management has its conference calls at 1 EST on Fridays, that's a good place to call in and ask questions.</p>",
        "id": 153875693,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489038285
    },
    {
        "content": "<p>hello everyone,  i'm  confusing bit with the new clinfhir UI, so please can anybody help me to understand. what i understood is we can create  profile using logical modeler, there i can choose a resource like patient and we can add or remove the elements. here what i'm thinking is   adding the elements is nothing but like adding the extension. so then why there is a extension editor? if i use that and create the extension an d save it. after that how can add that to my profile?</p>\n<p>thank you in advance.</p>",
        "id": 153875703,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1489041203
    },
    {
        "content": "<p>Hi Paul,<br>\nThank you for the prompt response.  It is assuring to know that HCFA 1500 has been mapped already.  I shall wait for your response on making them publicly available. Alternatively,  I can send you a mail to take this forward. My email-id is <a href=\"mailto:rsahu@mphrx.com\" title=\"mailto:rsahu@mphrx.com\">rsahu@mphrx.com</a></p>\n<p>I shall also reach out to my product team and see if one of us can join the Friday conference calls.  Thanks again. </p>",
        "id": 153875704,
        "sender_full_name": "Rohan Sahu",
        "timestamp": 1489041313
    },
    {
        "content": "<p>I think you want to create that message on a new thread - and I'm not sure that's what Clinfhir does but I haven't looked at it in a while.</p>",
        "id": 153875705,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489041361
    },
    {
        "content": "<p>Hi All, Can anyone help me when, where and how can we attend the meeting/conference happening for FHIR mapping for financial management, especially for HCFA 1500 and UB 04 claim forms.</p>",
        "id": 153876853,
        "sender_full_name": "Tarun Doomra",
        "timestamp": 1489559303
    },
    {
        "content": "<p>There isn't a specific meeting for doing mappings.  The Financial Management conference calls are Friday at 1 Eastern.  1 770-657-9270<br>\nParticipant Passcode: 686300</p>",
        "id": 153876879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489562747
    },
    {
        "content": "<p>Financial Management calls use <a href=\"http://FreeConferenceCall.com\" target=\"_blank\" title=\"http://FreeConferenceCall.com\">FreeConferenceCall.com</a> meeting fm4 then use their phone numbers or your  computer for audio not the HL7 call center numbers above.</p>\n<p>I have uploaded a draft CMS 1500 mapping spreadsheet to <a href=\"http://wiki.hl7.org/index.php?title=Financial_Management_FHIR_Resource_Development\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Financial_Management_FHIR_Resource_Development\">http://wiki.hl7.org/index.php?title=Financial_Management_FHIR_Resource_Development</a> and there will be an example of a CMS 1500 claim in the build once the QA patches are applied. The conference call are Friday at 1 Eastern, but I won't be on the call this Friday due to travel. I could email you the example if you wish.</p>",
        "id": 153876895,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489569374
    },
    {
        "content": "<p>I would appreciate some UB04 examples which we can then map to FHIR examples.</p>",
        "id": 153876900,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489569597
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> You might want to change the information at the HL7 conference call list</p>",
        "id": 153876946,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489589068
    },
    {
        "content": "<p>The HL7 conference line and call in number is automatically supplied, you can't edit that out - check out your work groups such as FMG - conference line and call ID still there despite GotoMeeting being the tool which has been used for audio for over two years.</p>",
        "id": 153876964,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489593029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  Thank you for sharing the mapping for CMS 1500. This is very helpful.  We shall reach out to you again if we have any doubts on this one. </p>\n<p>Also, I would request <span class=\"user-mention\" data-user-id=\"193535\">@Tarun Doomra</span>  to provide you the UB04 examples so that we can discuss those mappings once you are back. We have already taken an attempt at mapping them. Thanks again and safe travels. </p>",
        "id": 153877025,
        "sender_full_name": "Rohan Sahu",
        "timestamp": 1489604895
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193527\">@Rohan Sahu</span>: I have posted the draft UB04 mappings to: <a href=\"http://wiki.hl7.org/index.php?title=Financial_Management_FHIR_Resource_Development\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Financial_Management_FHIR_Resource_Development\">http://wiki.hl7.org/index.php?title=Financial_Management_FHIR_Resource_Development</a></p>",
        "id": 153877398,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489656064
    },
    {
        "content": "<p>Thank you, Paul! We have some questions about capturing all the UB04 fields in the same resource (Claims). <span class=\"user-mention\" data-user-id=\"193535\">@Tarun Doomra</span>  is collating the questions and will reach out to you shortly. </p>",
        "id": 153877491,
        "sender_full_name": "Rohan Sahu",
        "timestamp": 1489678198
    },
    {
        "content": "<p>I believe there will also be a need to develop the mappings between HIPAA 837 professional/institutional/dental to FHIR claims. I am wondering if anyone has been doing that. </p>",
        "id": 153877494,
        "sender_full_name": "redixint",
        "timestamp": 1489679224
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  Thank you for sharing the mapping for CMS 1500 &amp; UB 04. It is indeed very helpful and invaluable input for us. Although we have some doubts regarding the mappings and about capturing all the fields in same resource (Claims). I will collate the list of queries we have and share with you. We can discuss these over a call )if possible) or as per your availability.  Few queries till this point are : 1) Usage of STU3 elements in mapped CMS 1500, UB 04 items? We were using DSTU2 before. 2) Capturing all the fields in the same resource (claims),  e.g. You have mapped NPI in CMS 1500 with Claim.referral.requestor.agent-&gt;Practitioner.identifier. Here i have doubt regarding Claim.referral.requestor.agent? </p>",
        "id": 153877671,
        "sender_full_name": "Tarun Doomra",
        "timestamp": 1489745117
    },
    {
        "content": "<p>I am looking forward to join the call for financial management today. I hope by 1 EST means 1 PM EST? :) </p>",
        "id": 153877672,
        "sender_full_name": "Tarun Doomra",
        "timestamp": 1489745319
    },
    {
        "content": "<p>@Tarun Doomra:  1 Eastern and I'll try to be there to address any questions or corrections.</p>",
        "id": 153877690,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489750649
    },
    {
        "content": "<p>Regarding DSTU2 - the resources are draft and incomplete, use STU3, the final should be published next week, consult the Current Build until then. Note that STU are STU - for trial use and it is entirely possible that breaking changes will be made between now and Release 4 in about the summer of 2018.<br>\nI'm not sure what you mean by 'capturing all the fields in the same resource (claims). Wherever you see Claim.element-&gt;Name the 'Name' is a resource of type Name (Resources begin with a capital letter).  In your example above Practitioner is the name of the resource which holders the name of the referring provider, it is referenced in the resource ReferralRequest which is itself referenced in the Claim resource. <br>\nWe can of course also discuss whether I mapped the right elements.</p>",
        "id": 153877695,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489750925
    },
    {
        "content": "<p><a href=\"https://www.freeconferencecall.com/join/fm4\" target=\"_blank\" title=\"https://www.freeconferencecall.com/join/fm4\">https://www.freeconferencecall.com/join/fm4</a></p>",
        "id": 153877849,
        "sender_full_name": "Tarun Doomra",
        "timestamp": 1489770217
    }
]