[
    {
        "content": "<p>What is the correct way to represent a patients or persons legal guardian? I found Patient#contact where I would go for Relationship Next-For-Kin but that does not seem to fully fit it and I found <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Person#Person.Guardian\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Person#Person.Guardian\">http://wiki.hl7.org/index.php?title=FHIR_Person#Person.Guardian</a> which seems to be an ongoing discussion!? thanks</p>",
        "id": 157009802,
        "sender_full_name": "Marco Descher",
        "timestamp": 1548663411
    },
    {
        "content": "<p>Person is only used to maintain shared demographics for a single human being across multiple Patient, Practitioner and/or RelatedPerson records.  The data it has is redundant with the data available elsewhere.  Your choices are Patient.contact or RelatedPerson.  The former is when you just want the contact information.  The latter is when they're going to be an actor in the system - someone who witnesses, receives information, provides information, etc.</p>",
        "id": 157031552,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548688070
    },
    {
        "content": "<p>Thank you very much for this detailed explanation!</p>",
        "id": 157087415,
        "sender_full_name": "Marco Descher",
        "timestamp": 1548748218
    },
    {
        "content": "<p>Considering the use of a RelatedPerson, I guess the link to a patients guardian would have to be of type \"seealso\" is that right? It may well be, that a patients guardian is also an active patient with the EMR resource, but only seen as a RelatedPerson in the scope of the current patient. My use case is on editing a patient, I might have to search the list of existing \"Persons\" with the FHIR resource, in order to add this new relationship to the current Patient. If I will not do it this way, there might exist two contacts in the end representing the same person (i.e. as patient, and as another patients guardian)</p>",
        "id": 158440507,
        "sender_full_name": "Marco Descher",
        "timestamp": 1550065315
    },
    {
        "content": "<p>Linkage between a RelatedPerson and the equivalent patient - for the subset of systems that actually do that - would be either with an extension or using the Person resource.</p>",
        "id": 158453654,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550074506
    }
]