[
    {
        "content": "<p>I though I knew the answer to this but now I'm not so sure: how to represent a piece of (medical) software in a resource. Specifically, I want to transmit details about a medical app which produced a set of resources. I thought it was done with Device, but looking at the (R4) documentation I didn't find any mention of this use case (the one place the word \"software\" appears is in describing software running <em>on</em> the device). Is that the right resource and, if so, are there examples out there where this is done?</p>",
        "id": 239580863,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621513333
    },
    {
        "content": "<p>Device is absolutely the right place.  (Feel free to submit a change request to have this made clearer.)  What sort of details are you struggling with?</p>",
        "id": 239588671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621516455
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 239590353,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621517100
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>! Now that I known I'm in the right place, I think most elements of the data will be OK (will probably put in a change request for the documentation, though).  One thing I don't quite see is what would be sensible values for <code>specialization.systemType</code> and <code>version.type</code> for indicating FHIR compatibility and semantic versioning, respectively (though for the version I suppose one can leave out the type).</p>",
        "id": 239591150,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621517410
    },
    {
        "content": "<p>Right now, there aren't codes provided at all.  Feel free to provide feedback on the resource</p>",
        "id": 239595223,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621518970
    },
    {
        "content": "<p>Opened <a href=\"https://jira.hl7.org/browse/FHIR-32681\">FHIR-32681</a> suggestion some updates to the documentation.</p>",
        "id": 239744083,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621601250
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> - wondering if part of what you want to convey is the software install date. I've kind of convinced myself that Device.manufactureDate might be appropriate (equating an instance of software (like an EHR) with an instance of a device). If you're looking at the same concept, I'd be interested in what you are thinking.</p>",
        "id": 239751572,
        "sender_full_name": "Craig Newman",
        "timestamp": 1621604386
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> I was actually looking at storing information about an app <em>in general</em> rather than a specific installation of it. I must admit I didn't think much about this distinction yet, but now that you mention it, it looks like I should actually be using DeviceDefinition for that! <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is that the correct way to represent generic app vs. specific installation on a given system? It seems that one cannot reference a DeviceDefinition instead of a Device from e.g. Observation. So how can one report that a measurement was made with a specific type of device/software without specifying a specific instance/installation?</p>",
        "id": 239762699,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621608479
    },
    {
        "content": "<p>The split of Device into two resources is new.  If definition isn't available, don't worry about it and just use Device.</p>",
        "id": 239768557,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621610770
    },
    {
        "content": "<p>My opinion - Device and related resources seem to have been in flux for years. For example, all the docs still reference DeviceComponent which is no longer even in the spec. Ultimately though, you probably want to reference the device/software elsewhere, and Device is your best bet for that as it has many resources which can reference it.  We've been mostly just trying to hack what we need into Device and make do with it.</p>\n<p>edit/correction: the R4 specs still reference DeviceComponent. It appears the latest build specs have been cleaned up.</p>",
        "id": 239771157,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1621611805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"193261\">@craig mcclendon</span> Thanks  lot for your input, I will stick to Device, then - I can work with pragmatism <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 240163820,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621936020
    }
]