[
    {
        "content": "<p>I'm trying to find a way to represent a tumor. It is not just an ID, but a persistent entity, tracked over time, with gross and microscopic properties (size, borders, etc.).  What FHIR resource should I use?</p>",
        "id": 153889205,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494492577
    },
    {
        "content": "<p>What are your thoughts on <a href=\"http://hl7.org/fhir/bodysite.html\" target=\"_blank\" title=\"http://hl7.org/fhir/bodysite.html\"><code>BodySite</code></a> ?</p>",
        "id": 153889206,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494492608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> That might be the closest thing, but I'm a bit uncomfortable with the idea that a tumor is a body site. My naive interpretation of body site is a place in the body, like \"left elbow\". A tumor is more than a place. </p>",
        "id": 153889207,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494492732
    },
    {
        "content": "<p>In my thinking, a tumor might be <em>located at</em> a bodysite.</p>",
        "id": 153889208,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494493000
    },
    {
        "content": "<p>I think that's true <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span>. Perhaps a <code>Condition</code> with a <code>condition.bodySite</code> is the closest you'd get today.</p>",
        "id": 153889215,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494493137
    },
    {
        "content": "<p>Should we add another field located at to bodysite resource in future version of fhir?</p>",
        "id": 153889216,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1494493183
    },
    {
        "content": "<p>I'm not sure I follow, <span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span>. The link Mark's talking about is between a tumor (represented by ???) and its location (represented by BodySite).</p>",
        "id": 153889220,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494493282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span> I'm not sure I understand your suggestion. The bodysite itself is a location on or in the body. Do you mean to capture \"what is found at this bodysite?\"</p>",
        "id": 153889221,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494493286
    },
    {
        "content": "<p>Yes <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , and in some cases the same tumor can grow into different tissues over time, and effectively change its bodysite. </p>",
        "id": 153889223,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494493361
    },
    {
        "content": "<p>Indeed — though <code>Condition.bodySite</code> can point to multiple sites (it's <code>0..*</code>), so that's model-able.</p>",
        "id": 153889224,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494493390
    },
    {
        "content": "<p>That 0..* makes me feel more comfortable with using Condition.</p>",
        "id": 153889226,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494493423
    },
    {
        "content": "<p>Yes, though at this point (and we're getting into philosophy, which you and I never seem to shy away from) we could ask whether the Condition really represents the tumor, or an overall cancer process.</p>",
        "id": 153889227,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494493553
    },
    {
        "content": "<p>@MarkKramer yes I mean to capture what is found at body site</p>",
        "id": 153889228,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1494493565
    },
    {
        "content": "<p>Condition is really 'a state of the patient'. </p>",
        "id": 153889229,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494493592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> yeah, this is where I'm going.</p>",
        "id": 153889231,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494493627
    },
    {
        "content": "<p>And a tumor is an entity in and of itself</p>",
        "id": 153889232,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494493628
    },
    {
        "content": "<p>I think the correct answer is that we haven't really got the right resources for tracking the progression of a disease, and create a task for PC asking for such a facility</p>",
        "id": 153889233,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494493671
    },
    {
        "content": "<p>I'm currently in the same situation as Mark, regarding the representation of a tumor with all it's details. We also had a few words about that during yesterday's lunch meeting of the oncology group.<br>\nA tumor would consist of the diagnostic information at least, typically including ICD-10 of the main tumor, ICD-O morphology and location, metastatis, UICC/AJCC/TNM and a bunch of other classifications and pathology information.<br>\nUsually, in a specialized oncology documentation system, all these are bundled along with other information like tumor board decisions, therapies, follow ups, recurrence diagnosis and therapy and so on.</p>\n<p>I'm not sure whether a special resource is needed here or if a Composition can/should be profiled to fulfill the requirements to put everything belonging to a certain tumor disease into one \"bag\".<br>\nOne might then describe the main tumor diagnosis as a Condition, eventually using Condition.category to be distinctive against other Conditions that may be part of the tumor disease.</p>",
        "id": 153889246,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494497167
    },
    {
        "content": "<p>The other way around, the tumor Condition would indeed, like Grahame says, need a reference to something like \"Disease\", possibly using Condition.context.<br>\nCondition.context would need the cardinality increased to 0..*, since a condition might be part of an Encounter and of a Disease.</p>",
        "id": 153889248,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494497326
    },
    {
        "content": "<p>The whole question might also be applicable to other kinds of diseases, e.g. Multiple Sclerosis or in nephrology (dialysis patients)</p>",
        "id": 153889249,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494497479
    },
    {
        "content": "<p>When using Composition, that would have to be updated over time (years), while a distinct \"Disease\" resource might be more stable in terms of the data contained. But a \"Disease\" would needed to be referenced from virtually any other resource. So this would need enabling references everywhere (maybe the expanded Linkage resource, or a new Relationship (or similar name?) resource, that was discussed in PC yesterday</p>",
        "id": 153889254,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494498021
    },
    {
        "content": "<p>I had also considered composition as a wrapper. But that's an 'authoring/publishing' wrapper, not a sematic wrapper that carries actual meaning</p>",
        "id": 153889263,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494498478
    },
    {
        "content": "<p>That's true. Still, there's much inthe description of Composition that would also fit for a Disease. Especially, for a long term disease it also applies that you have multiple stable documents generated from it over time, like tumor board protocols or several types of letters.<br>\nSo at least there will be many similarities</p>",
        "id": 153889367,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494513604
    },
    {
        "content": "<p>One of the major use-cases for BodySite was the notion of turmor.  Another was patches of skin used in decision support.  Lesions or moles is another.  If it's something easy like \"left elbow\", there's no need for a resource instance to track that or group observations associated with it.  BodySite is what allows you to capture measurements of a particular tumor over time, identify procedures that targeted a specific tumor, etc.</p>",
        "id": 153889379,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494514434
    },
    {
        "content": "<p>Those two use-cases are why BodySite is a resource instance (with an id that can be referenced from other resources) rather than just a data type</p>",
        "id": 153889381,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494514542
    },
    {
        "content": "<p>We have been representing the cancer diagnosis as a condition, with things like the TNM score, etc. associated to the condition as Observations related to the condition through the extension event.reasonReference.<br>\nHowever I understand the distinction of trying to represent the tumor proper as a seperate entity with bodySite. It may be splitting hairs but as far as I understand it there are some observations about the tumor itself (size, necrosis, receptor status, etc.) while others (metastases, TNM, etc.) are in my opinion associated with the condition/diagnosis, but may have been derived from observations of the tumor mass</p>",
        "id": 153889394,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1494515400
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> A body site is certainly a relevant part of a tumor's description, but that describes only half of what ICD-O expresses. So this is rather a part of a bigger tumor entity than the head of a collection of the details I mentioned above</p>",
        "id": 153889421,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494517421
    },
    {
        "content": "<p>I also don't see how it would be better to reference to a BodySite's id than to a Condition's id?</p>",
        "id": 153889423,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494518055
    },
    {
        "content": "<p>Apart from that, there are tumors that have more than one location (e.g. with metastasis. bilateral tumors).<br>\nBasically, tumors are certain types of cells. And secondly, they manifestate at some location(s) of the body</p>",
        "id": 153889424,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494518320
    },
    {
        "content": "<p>That's why oncology systems, at least all that I'm aware of, use the diagnosis (often aka ICD-10) as the one central information</p>",
        "id": 153889425,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494518458
    },
    {
        "content": "<p>That would be a Condition, so at least to some extent similar to what <span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> described</p>",
        "id": 153889426,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494518761
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Let's get back to the issue.  The use case I'm supporting involves measuring response to treatment, using a criteria called RECIST (response evaluation criteria in solid tumors). RECIST follows individual tumors (up to 2 per organ, up to 5 total). Measurements are taken to reveal how these tumors change over time. <em>Observations must be linked to specific tumors</em>. Another challenge is that tumors can  split, two tumors can merge, and a tumor can spread to new parts of the body.  If we can support the unique identification of tumors, so observations of size, receptor status, and other properties can be tracked over a period of months and years, then I'm good.  </p>",
        "id": 153889427,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494519714
    },
    {
        "content": "<p>Well, Procedures can't be done on Conditions, but they can be done on a BodySite.  As well, in general, a patient with multiple lesions or tumors that are all tied to the same underlying type of cancer would typically be captured as one Condition, but multiple body sites (tumors/lesions) would be tracked for repeated observations, procedures and possibly substance administrations.  BodySite is intended to represent any identifiable part of the body that can be the focus of a procedure, observation, drug administration, etc.</p>",
        "id": 153889428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494519755
    },
    {
        "content": "<p>Point of clarification, though procedures can't be done on a Condition, they can be done as a result of the condition (reasonReference).</p>",
        "id": 153889430,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1494519868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span>  as far as I can understand your use case however,  it would make sense to tie these Observation to a single bodySite resource. However, as I was alluding to before, not all Observations can be tied to an individual tumor but may refer to the cancer diagnosis as a whole. I think distinctions may need to be made for Observations that are lesion (individual tumor) specific vs those referring to the diagnosis as a whole. Thoughts?</p>",
        "id": 153889434,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1494520205
    },
    {
        "content": "<p>So the issue we have been having trouble with is that Observations allow for a reference to the subject (Patient) but don't allow for a reference to the target object of the observation. (This lesion has a diameter of 3 cm).. If Observation.bodySite were a reference to a BodySite, then you could allow for  observations to pertain to a particular lesion within the same contextual disorder. As in, patient has breast neoplasm, two lesions, each lesion having distinct histology or genomic profiles. Though this doesn't quite cover metastatic disease, which we have also been capturing as a second Condition with a code denoting that that the lesion is secondary, however without a reference to the primary yet. </p>",
        "id": 153889435,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494520260
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span>  Regarding the use of a BodySite resource with an Observation, the documentation on Observation.bodySite says: \"Only used if not implicit in code found in Observation.code. In many systems, this may be represented as a related observation instead of an inline component. <strong>If the use case requires BodySite to be handled as a separate resource (e.g. to identify and track separately) then use the standard extension body-site-instance</strong>.\"</p>",
        "id": 153889436,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494520545
    },
    {
        "content": "<p>I find that rather lame.  How do you reliably find the tumors you are tracking via RECIST?</p>",
        "id": 153889437,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494520597
    },
    {
        "content": "<p>So, we have arrived at solution, but a rather inelegant one, in my opinion: (1) Use BodySite to uniquely represent a tumor entity located at a body site, and use the body-site-instance extension to link observations to that BodySite. </p>",
        "id": 153889438,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494520832
    },
    {
        "content": "<p>I don't think that's the final word here</p>",
        "id": 153889439,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494521118
    },
    {
        "content": "<p>I thought that the Observation extension <a href=\"http://hl7.org/fhir/StructureDefinition/observation-focal-subject\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/observation-focal-subject\">http://hl7.org/fhir/StructureDefinition/observation-focal-subject</a> should be part of the solution but I see from it's definition that it's not quite what we want</p>",
        "id": 153889440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494521211
    },
    {
        "content": "<p>I thought genetics had also dealt with 'which tumour an observation is on'</p>",
        "id": 153889441,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494521257
    },
    {
        "content": "<p>Yes that extension seems to cover what I meant. Though I see some crossover between Condition.extension:targetBodySite and this  standard extension 'body-site-instance' in the case of Condition's body site reference for a specific lesion.</p>",
        "id": 153889443,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494522256
    },
    {
        "content": "<p>Or was targetBodySite meant for cases like an autoimmune disorder literally targeting a particular anatomic site?</p>",
        "id": 153889445,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494522391
    },
    {
        "content": "<p>I think that using a body site as the focal subject of an observation is more specific than observation body site</p>",
        "id": 153889448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494522821
    },
    {
        "content": "<p>targetBodySite is horribly defined - or more specifically, not defined at all.  I can't think of a use-case for both extensions being necessary.  I've submitted a change request to either clarify the distinction or remove this extension.  <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13393\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13393\">GF#13393</a></p>",
        "id": 153889450,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494522992
    },
    {
        "content": "<p>I agree, that was my understanding of focal-subject, but I moved on from it because it was a codeableConcept and is a modifier extension. </p>",
        "id": 153889451,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494522997
    },
    {
        "content": "<p>Yes,  the data type of observation-focal-subject is CodeableConcept.  That doesn't get us there.  It has to refer to a specifically identified tumor.</p>",
        "id": 153889453,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494523067
    },
    {
        "content": "<p>I think it has the right semantics in the definition but the wrong data type. Want to make a change request?</p>",
        "id": 153889454,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494523090
    },
    {
        "content": "<p>To what? Reference(Any)?  And then define Tumor as a profile on BodySite?</p>",
        "id": 153889455,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494523146
    },
    {
        "content": "<p>Mark, looking at the resource, it seems we should probably have a \"kind\" element or something like that added to BodySite so you can not only query for all BodySite instances for a patient, but can also filter to only see tumors, lesions, fetuses, skin patches, etc.</p>",
        "id": 153889456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494523148
    },
    {
        "content": "<p>I believe that is what <span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span> was suggesting at the top of the thread.</p>",
        "id": 153889457,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494523242
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13394\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13394\">GF#13394</a></p>",
        "id": 153889459,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494523286
    },
    {
        "content": "<p>focal-subject's definition is right yes. I could see this as Reference(BodySite) and Reference(Condition). ie: This patient's diabetes is well controlled. </p>\n<p>The other item I contended with when representing tumors is Recurrence and Remission, which is somewhat covered with Condition.onset and Condition.abatement, but there are clinical decisions made relative to which recurrence of the disorder this is, first or second etc, and onset and abatement are both 0..1. Anyone have suggestions on covering the history of tumor remission?</p>",
        "id": 153889460,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494523946
    },
    {
        "content": "<p>The \"kind\" element sounds reasonable, though I still think that the term \"body site\" is not appropriate for what is actually to be expressed.<br>\nAlso, would that mean to drop Grahame's idea ?</p>",
        "id": 153889461,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494524011
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span> The remission history imho would be easily represented in a \"Disease\" resource, referencing a Condition with clinicalStatus=recurrence .<br>\nI would leave it to business logic ordering them by date to actually get 1st/2nd/... recurrence</p>",
        "id": 153889468,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494524583
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> What would be a more appropriate name for something that includes tumors, lesions, moles, fetuses, skin patches, etc.?  We argued about it for quite a while when defining the resource, but aren't opposed to more intuitive names.  I'm not thrilled with expanding focalSubject because I can hypothesize situations where both focalSubject and target-body-site could be relevant.</p>",
        "id": 153889469,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494524594
    },
    {
        "content": "<p>I propose AnatomicalStructure or BodyStructure.  A structure such as a tumor might have a BodySite, could be related to other body structures, etc. It is in addition to, not a replacement for, body site.</p>",
        "id": 153889473,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494524710
    },
    {
        "content": "<p>BodyStructure sounds at least better to me. Site is really strongly associated with location</p>",
        "id": 153889475,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494524941
    },
    {
        "content": "<p>AnatomicalStructure or BodyStructure would kind of align with SNOMED too.</p>",
        "id": 153889476,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494525055
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> The issue we thought about with that is will this Disease be represented as a novel Condition resource on recurrence? I know when I would look at medical histories, I wouldn't see multiple instances of breast cancer but just a single one. I'm not sure how FHIR would expect a single disorder's historical occurrences to be represented.</p>",
        "id": 153889477,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494525300
    },
    {
        "content": "<p>\"BodyStructure\" would be the clearer of the two, I think (aligns with SNOMED and avoids the question of anatomical vs pathological)</p>",
        "id": 153889479,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494525328
    },
    {
        "content": "<p>SNOMED's BodyStructure is quite broad though (anything from a rash to a knee to a tumor). If we pursued this, we might just have BodyStructure and use it for both cases (so a \"Tumor\" BodyStructure might be <code>locatedWithin</code> (or something) a \"left knee\" BodyStructure).</p>",
        "id": 153889480,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494525716
    },
    {
        "content": "<p>Anyone who wishes can submit a change request to rename BodySite to BodyStructure.  I'd be in favor of the change, but I don't want to dominate the change-request creation process :)</p>",
        "id": 153889483,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494526584
    },
    {
        "content": "<p>There's nothing that would stop BodyStructure from being used to represent \"left knee\" other than the fact that it's already identifiable just with a code.  BodySite is really for those things that can't be uniquely identified just with a code.</p>",
        "id": 153889484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494526650
    },
    {
        "content": "<p>The proposed changes would be two, though: a rename, and the addition of a <code>BodyStructure.locatedAt --&gt; Reference(BodyStructure)</code>, or something like that</p>",
        "id": 153889486,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494527266
    },
    {
        "content": "<p>Add locatedAt to what?</p>",
        "id": 153889487,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494527362
    },
    {
        "content": "<p>(Clarified in an edit)</p>",
        "id": 153889490,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494527542
    },
    {
        "content": "<p>Mark appeared to propose an additional resource, not a rename </p>",
        "id": 153889491,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494529010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> after this discussion, what're your thoughts?</p>",
        "id": 153889492,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494529152
    },
    {
        "content": "<p>So with this proposal, a confirmed case of lets say invasive ductal breast carcinoma would body Condition with code: IDC of Breast, and Condition.bodySite as a reference to BodyStructure with code: lesion of breast, qualifier: [inner outer quadrant, left breast]. </p>\n<p>I guess what I mean is which of these two related resources should bear the specifics of the lesion. This patient has Condition: Neoplasm of Breast with BodyStructure: Invasive Ductal Carcinoma, qualifier left breast. Or vice versa. Or is that left up to the implementer and the ontology bindings they want to use?</p>",
        "id": 153889495,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494530775
    },
    {
        "content": "<p>In principle you could have multiple BodyStructures tied to one condition.  Certainly guidance could be provided about \"good practice\" in terms of how terminologies should be used, but I'm not sure we can enforce that globally</p>",
        "id": 153889496,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494531219
    },
    {
        "content": "<p>From the above discussion I would rather expect the need for multiple conditions (like new tumor/1st/2nd/... recurrence) bound to one BodyStructure. So that would be resolved through the body-site-instance extension</p>",
        "id": 153889509,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494534036
    },
    {
        "content": "<p>(Which would have to be renamed to body-structure-instance, obviously)</p>",
        "id": 153889510,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494534115
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13396\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13396\">GF#13396</a> for renaming BodySite to BodyStructure</p>",
        "id": 153889514,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494535771
    },
    {
        "content": "<p>Looking into <a href=\"http://build.fhir.org/extension-body-site-instance.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-body-site-instance.html\">http://build.fhir.org/extension-body-site-instance.html</a><br>\n\"Body Site Instance: Record details about the anatomical location of a specimen or body part [...]\"<br>\nThis is clearly location related. So, the semantics need to be redefined, since, as we concluded above, a tumor is _not_ a location.</p>",
        "id": 153889517,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494536980
    },
    {
        "content": "<p>Maybe this is leading too far, but I'd like to point to the domain analysis we did in Germany years ago for the CDA oncology implementation guide. It's in German, but should be fairly understandable:<br>\n<a href=\"http://wiki.hl7.de/index.php?title=IG:%C3%9Cbermittlung_onkologischer_Daten#Dom.C3.A4nen-Analyse_Modell\" target=\"_blank\" title=\"http://wiki.hl7.de/index.php?title=IG:%C3%9Cbermittlung_onkologischer_Daten#Dom.C3.A4nen-Analyse_Modell\">http://wiki.hl7.de/index.php?title=IG:%C3%9Cbermittlung_onkologischer_Daten#Dom.C3.A4nen-Analyse_Modell</a></p>",
        "id": 153889518,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494537360
    },
    {
        "content": "<p>Leaving aside adminstrative data for the moment, we basically have (including my ad-hoc mapping to FHIR resources):<br>\n- disease (\"Erkrankung\") =&gt; Body[Structure|Site] (?)<br>\n- procedure (\"Prozedur\") =&gt; Procedure<br>\n - result (\"Ergebnis\") =&gt; Observation<br>\n- phenomenon (\"Phänomen\") =&gt; Condition<br>\nand of course a lot of detailing when it comes to medication (represented by the medication resources) etc.</p>",
        "id": 153889519,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494537692
    },
    {
        "content": "<p>So, if all the relations in that model can be represented in FHIR (and that is to be analyzed), I'd be happy to agree with BodyStructure representing a tumor as such.</p>",
        "id": 153889521,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494538140
    },
    {
        "content": "<p>(Location, btw, is part of the phenomenon in that model, just as in Condition.bodySite)</p>",
        "id": 153889522,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494538472
    },
    {
        "content": "<p>I think that tumours and the newly renamed BodyStructure resource are rather like an un-excised specimen.</p>\n<p>The proposed designs treat each tumour as a distinct location of a condition: body-site (location) is enhanced to become body structure.<br>\nAnother approach would be to consider a tumour as an object (like a specimen) which has a location and is part of a condition.<br>\nIs this useful?</p>",
        "id": 153889597,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1494555829
    },
    {
        "content": "<p>Grahame - focal subject's scope shrunk a lot because originally it overlapped with other elements such as BodySite that were added.</p>",
        "id": 153889608,
        "sender_full_name": "Eric Haas",
        "timestamp": 1494565385
    },
    {
        "content": "<p>well, I remember that it definitely could refer to the focal subject by identity not just concept - I don't think that overlaps</p>",
        "id": 153889610,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494565863
    },
    {
        "content": "<p>Mark nothing lame about how body site is currently defined and used.  Most of time the body site is part of a pre coordinated observation code and otherwise a .bodysite code works just fine.  Accessing the bodysite resource via an extension is there for a use case like this and its the first time use case based trackers have come up for it - not counting the many attempts to get rid of the resource all together.</p>",
        "id": 153889613,
        "sender_full_name": "Eric Haas",
        "timestamp": 1494566385
    },
    {
        "content": "<p>Well nobody has raised an issue on focal subject that its too narrowly defined so either its never being used because its too narrowly scoped or it s just right.</p>",
        "id": 153889615,
        "sender_full_name": "Eric Haas",
        "timestamp": 1494566857
    },
    {
        "content": "<p>Specimen is about a portion of the body that has been removed.  And so there's a bunch of information about the removal that's relevant.  BodySite/BodyStructure is about a portion of the body that's in place.  Specimen will have a bunch of information about additives, transport and other things that aren't relevant for the BodySite/Structure</p>",
        "id": 153889634,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494576465
    },
    {
        "content": "<p>I had to transmit lung tumors in a project last year from a viewer to a reporting system, using FHIR. Since this was previous to this thread, I opted to use Observation as my base-Resource. I represented the properties of the tumor in components (diameters, shape, etc.) and added an extension for the long-term tracking identifier. My main challenge were not my doubts about whether I was using the proper Resource type, but the many missing codes in SNOMED, LOINC, RadLex, etc. to express the many properties of the tumor in a non-proprietary manner.<br>\nI am looking forward to the outcome of this thread and might reshape my output based on it. But I think for true interoperability between systems which handle tumor data, one would have to request a plethora of codes from LOINC, etc.</p>",
        "id": 153889635,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1494576721
    },
    {
        "content": "<p>I originally used the OpenEHR archetype to create it, but we shrunk it way down after that removing most of the properties.  So if there is a need to add back take a look at that or an early version FHIR Probably pre -DSTU2</p>",
        "id": 153889672,
        "sender_full_name": "Eric Haas",
        "timestamp": 1494584794
    },
    {
        "content": "<p>One of the reasons I overlooked the focal-subject extension is because it was a modifier extension, and being new to FHIR, the documentation made it seem like that's a rather bad idea for developers hoping to work with multiple vendors. </p>",
        "id": 153889778,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494601751
    },
    {
        "content": "<p>That's a good reason to be cautious of it.  But the meaning doesn't really match either.  Focal subject lets you communicate the heart rate of a fetus or the blood type of a donor and have that Observation on the patient's record.  In both cases, the observations aren't \"about\" the patient - they're about someone/something else.  But a tumor type measurement or dimension measurement are still properly \"about\" the patient, so that's not a modifier - and thus helps indicate that the extension isn't the correct thing to use.</p>",
        "id": 153889798,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494618324
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192169\">@Tilo Christ</span>  Hi Tilo. There is a lot of working going on at the moment, mainly driven by an NLM grant to the University of Nebraska Medical Center to create terms to map to the CAP protocols. There is standardisation work going on internationally (ICCR) which involves many colleges of pathology and UNMC. For the cutting edge, I direct you to the SNOMED CT international confluence pages: <a href=\"https://confluence.ihtsdotools.org/display/iPaLM/Cancer+Synoptic+Subgroup\" target=\"_blank\" title=\"https://confluence.ihtsdotools.org/display/iPaLM/Cancer+Synoptic+Subgroup\">https://confluence.ihtsdotools.org/display/iPaLM/Cancer+Synoptic+Subgroup</a> . You will need to create an account there if you don't already have one. Essentially the team at UNMC are encoding the CAP cancer worksheets (synoptic reports) with fully modeled SNOMED CT concepts and then submitting them to both SNOMED international and LOINC. So the codes will be LOINC and there will be Observable expressions in a reference set map which will be published jointly by SNOMED International and Regenstreif.</p>",
        "id": 153889816,
        "sender_full_name": "Michael Osborne",
        "timestamp": 1494657697
    },
    {
        "content": "<p>Let me try to sum up my point of view:  (1) We need to rename and broaden the definition of BodySite to BodyStructure.  (2) In Observation, add Observation.BodyStructure  (Reference(BodyStructure). I personally don't think Observation.BodyStructure should be an extension.  If we keep Observation.BodySite (CodeableConcept) then we need an invariant that says you can't use both BodySite and BodyStructure. (3) We  do not need to change the Observation's focal subject - I agree with Lloyd, the subject is the patient, not the tumor.</p>",
        "id": 153889828,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494699781
    },
    {
        "content": "<p>I agree completely with Mark's (1) and (3).<br>\nRegarding (2): there will be a lot of other resources that need to point to BodyStructure, e.g. when describing surgery or medication and I doubt these will be in the 80% scope, so an extension may be fine.<br>\nAlso, as a second thought on the proposed invariant, how would one describe that an observation is about a brain metastasis that's part of a breast cancer? So better leave that open and, if needed, constrain it within a profile.</p>",
        "id": 153889829,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1494700975
    },
    {
        "content": "<p>@MarkKramer  Regarding  (2) Are you proposing there should be an exclusion of Body structure if Body site is used?</p>",
        "id": 153889840,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1494833143
    },
    {
        "content": "<p>Joke for HL7 v3 old timers: ask Barry Smith - this is very reminiscent of the kind of issue he always raised when pointing out supposed semantic flaws in the RIM. Does the 'observation' (of the tumor)  exist, or does the Tumor exist (because I observe it)? No wonder this thread (again) attracts a lot of posts..<br>\nThere is no perfect answer, HL7 modeling tradition has it that a Timor doesn't exist as such in the modeling space (as an entity), only the observation thereof. </p>",
        "id": 153890016,
        "sender_full_name": "René Spronk",
        "timestamp": 1494924397
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> please excuse my naivete in this matter, but I don't quite agree with the statement that the tumor only exists because we observe it. The tumor is a physical specimen that is a part of the body (till removed), that has specific observations that can be associated to it (e.g. size, receptor status, mutations, etc.). The only differentiating factor between a tumor and other body structures (e.g. the heart) is that it is not obligate that all patients will have a tumor structure to be identified. <br>\nThe condition of \"cancer\" on the other hand exists only because of the symptoms presented as a result of the development of a tumor mass, and only exists when we \"observe\" it. But is this not true of all conditions?</p>",
        "id": 153890084,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1494941366
    },
    {
        "content": "<p>We had some back and forth on that exact idea. Observation vs existence. If I remember my HL7 Standards class, the idea was that we don't ever 'know' in medicine, even with a gold standard test you aren't always certain. You might have a large tumor and symptoms of lung neoplasm. This tumor could be 3cm across, and some enlargement of the local lymphatics. Then you open the patient up and it turns out to be a giant ball of fungus, an aspergilloma. Yes we 'observed' a tumor, but that was simply what we saw on imaging, not what was true. </p>",
        "id": 153890097,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1494947024
    },
    {
        "content": "<p>Do extra toes (e.g. I have an infection of a 6th toe) exist? or are they also bundles of observations?</p>",
        "id": 153890138,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1494983190
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> I have no desire to hold the same philosophical discussion all over again, I'm just having a deja-vu moment. I do hope you find a workable solution, whatever it is. We found one in v3, so I'm sure you'll find one in FHIR.</p>",
        "id": 153890210,
        "sender_full_name": "René Spronk",
        "timestamp": 1495033016
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> The decision of core vs. extension is driven by whether most systems that support Observations will support the concept of an independently managable BodyStructure.  Obviously it's \"core\" for oncology (and for a few other areas), but there's been lots of pushback about it being core for Observation as a whole.</p>",
        "id": 153890221,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495034996
    },
    {
        "content": "<p>So our use case is kind of requiring a good representation of a tumor sooner than BodyStructure is available and I might profile BodySite to do so.  I'm just juggling code, qualifier and possibly an extension to represent morphology (either histological or gross in the case that no definitive pathology is defined). So my question is to those of you who are in agreement with this BodyStructure. Should code remain specific to the site, or should code represent 'what' it is. </p>\n<p>code: apex of left lung<br>\nextension: associatedMorphology: Large cell carcinoma (morphologic abnormality)</p>\n<p>or</p>\n<p>code: Large cell carcinoma (morphologic abnormality)<br>\nqualifier: apex of left lung</p>\n<p>or </p>\n<p>code:  Large cell carcinoma of lung (disorder) [to me it seems a bit discordant to use a disorder code in a BodyStructure]<br>\nqualifier: apex of left lung</p>\n<p>Does anyone intending on using BodyStructure to represent a tumor lean a particular way?</p>",
        "id": 153890992,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1495568183
    },
    {
        "content": "<p>I'm currently thinking of BodyStructure as a generic point of reference, where all other information about the tumor should point to. So, as discussed somewhere above, I would rather fill it with either some generic code for the tumor (like \"breast cancer\", \"lung cancer\" and so on) or an ICD-10 code (though that would rather be a condition).<br>\nAt least, morphology and location are just observations related to the tumor, but subject to change over time.</p>",
        "id": 153891063,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495608457
    },
    {
        "content": "<p>The definition of BodySite.code already indicates what should go there.  The \"kind\" of thing will need to be a distinct element.</p>",
        "id": 153891117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495632192
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  So, as long as BodyStructure and especially BodyStructure.kind ist not available, better use an extension for kind within BodySite?</p>",
        "id": 153891124,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495633690
    },
    {
        "content": "<p>Ah good points, thank you for the replies. Definitely histology should be an observation. I'm going to keep the cancer type in the condition, have condition reference multiple body sites (including in the case of mets), with the body site code and qualifiers only representing the location. The active field will be used to represent whether that tumor still exists (or has been excised or resolved through treatment).</p>\n<p>I'm wondering if a tumor being secondary should be denoted somewhere. M category shows that it has metastasized, and it might reference two unconnected BodySites, but in this situation I can't tell which was primary and which was secondary, particularly where it metastasized to the other breast or other lung (maybe something with timestamps but thats not obvious). Should mets be a second Condition? </p>\n<p>Were you guys thinking 'kind' would be 'required' bound to a simple value set like [anatomicalStructure, morphologicalAbnormality], or an extensible CodeableConcept that an implementer could bind to a concept like 'metastasis from malignant tumor of lung'?</p>",
        "id": 153891135,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1495636199
    },
    {
        "content": "<p>Since BodyStructure (or the current BodySite) has such a flexible definition, I would see BodyStructure.kind as a CodeableConcept with just an example binding.<br>\nGranularity may vary, \"metastasis from malignant tumor of lung\" being on the more distinctive end.</p>",
        "id": 153891138,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495636590
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> Yes, use an extension for now.  <span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span>, I'm not sure if it should be mandatory on the resource overall.  We're very cautious about mandatories.  But it would certainly make sense to require it in an oncology profile.</p>",
        "id": 153891139,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495636666
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13394&amp;start=0\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13394&amp;start=0\">here</a> is the current proposal on the BodyStrucure ( nee BodySite).kind element.   Is being voted on tomorrow.   (If you are interested in changes to the resources can track them <a href=\"https://chat.fhir.org/#narrow/stream/committers/topic/tracker-item\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/committers/topic/tracker-item\">here</a> or login to GForge or join the Listserve for the appropriate workgroup- in this case OO.)</p>",
        "id": 153891144,
        "sender_full_name": "Eric Haas",
        "timestamp": 1495637318
    },
    {
        "content": "<p>What's the full title of that group Eric? I'm having trouble finding it. </p>\n<p>Would this 'kind' field be better titled as 'type' (aligns with Sequence resource)? or maybe 'category' (aligns with a few other resources)? </p>",
        "id": 153891190,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1495652160
    },
    {
        "content": "<p><a href=\"http://www.hl7.org/Special/committees/orders/index.cfm\" target=\"_blank\" title=\"http://www.hl7.org/Special/committees/orders/index.cfm\">Orders and Observations Work Group</a>  and btw anybody welcome to lob comments on the tracker as follow-ups.  :-)</p>",
        "id": 153891192,
        "sender_full_name": "Eric Haas",
        "timestamp": 1495652386
    },
    {
        "content": "<p>I am proposing the element name <code>category</code>.   'kind' and 'type ' and  'code' are all intertwined in meaning so I tend to stay away from them.</p>",
        "id": 153891193,
        "sender_full_name": "Eric Haas",
        "timestamp": 1495652569
    },
    {
        "content": "<p>This feels different from the other places we've used \"category\" which is as a filter for user interface/software functionality - separating labs from imaging from vitals seems quite distinct from separating skin patches from tumors from fetuses.  To be honest, my real leaning would be rename BodySite.code to BodyStructure.location and then use BodyStructure.code to identify the \"kind\" of structure.  Seeing as the resource hasn't been heavily used that sort of radical change is probably reasonable at this time.</p>",
        "id": 153891217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495659413
    },
    {
        "content": "<p>For R3, we'd need to have an extension for the \"kind\" though and would need to put the location information in BodySite.code.</p>",
        "id": 153891218,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495659446
    },
    {
        "content": "<p>OK -that sounds like a reasonable approach.  So renaming code to location opens up using kind too.  I'll make the updates and pull from the block to vote on separately</p>",
        "id": 153891221,
        "sender_full_name": "Eric Haas",
        "timestamp": 1495659735
    },
    {
        "content": "<p>so looking at this again.  I thought the  intent with kind was to broadly categories the context for identifying the site.   so tumor, skin patch, bodysite which is how I dispositioned it. What does <code>kind</code> mean? </p>\n<ul>\n<li>a granular code for a specific morphology like a mast  cell tumor</li>\n<li>a code to say its a tumor being tracked.  ( ie a categorization)</li>\n</ul>\n<p>If the latter - then I agree with Mark that the resource is lacking some more stuff like a human readable label ( \" mast cell tumor -1\" ) and a another element to say what it is we are tracking ( a mast cell tumor).</p>",
        "id": 153891233,
        "sender_full_name": "Eric Haas",
        "timestamp": 1495661614
    },
    {
        "content": "<p>Code might be preferable to represent what it is, like morphology or just like benign neoplasm, lesion NOS, malignant neoplasm, fetus. <br>\nIt would be a bit odd to have code: uterus, kind: fetus. Most places in FHIR that I work with, code has represented the 'what'. Though this might make the 'qualifier' field a bit ambiguous. </p>\n<p>Another point though is that the 'what' is subject to change with tumors, which was pointed out above. A nevus can become a melanoma, an in situ tumor invasive.</p>",
        "id": 153891287,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1495721984
    },
    {
        "content": "<p>I've reworked the disposition for BodyStructure.kind  <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13394&amp;start=0\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13394&amp;start=0\">here</a>.  Feedback sought before bringing up at the OO workgroup call</p>",
        "id": 153894089,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497568358
    },
    {
        "content": "<p>Be careful that the descriptions make it sufficiently obvious that the design supports the common case of specifying a location without saying that there is some abnormality there.</p>",
        "id": 153894094,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1497587633
    },
    {
        "content": "<p>And probably make sure that qualifier is explicit that it qualifies location, not code. But that looks good.</p>",
        "id": 153894248,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1497634267
    },
    {
        "content": "<p>Appreciate the earlier comments.  I preapplied the tracker for <a href=\"http://build.fhir.org/bodystructure.html\" target=\"_blank\" title=\"http://build.fhir.org/bodystructure.html\">BodyStructure.kind</a> to give and idea what the proposed disposition would look like.  Note the new element is .code and the old .code is now .location with a bunch of cascading edits to the other elements to align it all up.   Not approved yet.   Feedback welcome.</p>",
        "id": 153894553,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497975273
    },
    {
        "content": "<p>see how is applied to the <a href=\"http://build.fhir.org/bodystructure-example-skin-patch.html\" target=\"_blank\" title=\"http://build.fhir.org/bodystructure-example-skin-patch.html\">example</a> and <a href=\"http://build.fhir.org/bodystructure-example-tumor.html\" target=\"_blank\" title=\"http://build.fhir.org/bodystructure-example-tumor.html\">here</a> ( any better examples would be welcome too)</p>",
        "id": 153894555,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497975421
    },
    {
        "content": "<p>Maybe \"morphology\" is a better name than \"code\", it is more informative. Also \"code\" suggests that this is THE central concept, but when specifying a location without mentioning an abnormality code/morphology is unimportant.</p>\n<p>And \"qualifier\" should be \"locationQualifier\".</p>\n<p>Is there a need for \"morphologyQualifier\"? I have no idea.</p>",
        "id": 153894628,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1498002440
    },
    {
        "content": "<p>We're not necesarily talking about abnormalities.  Skin patches, fetuses, etc. wouldn't be abnormalities.  As well, we generally try to keep our terms simple when we can.</p>",
        "id": 153894629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498002725
    },
    {
        "content": "<p>I think that \"morphology' just means \"shape\", not \"abnormal shape\", and the offered definition for \"code\" is \"morphology\".</p>",
        "id": 153894630,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1498003270
    },
    {
        "content": "<p>Morphology is subject to change, nevus to melanoma,  well differentiate to poorly differentiated adenocarcinoma, fetus to whatever they turn into? Though it would be convenient to have that morphology in the tumor instance,  we were leaning towards having a tumor histology observation reference a tumor through the body-structure extension. Though I'm torn as our implementation would be a bit simpler if the histology was encoded in BodyStructure.code. I'm looking forward to seeing how the Cancer DTR group looks toward modelling BRCA. </p>",
        "id": 153894647,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1498015150
    }
]