[
    {
        "content": "<p>Yesterday in the Workflow call we discussed the 2 roles of a \"prescription\": \"Request to Dispense\" vs \"Request to administer\".<br>\nThe Dutch Healthcare Information Model separates the medication order into \"clinical\"  and \"dispense\" requests. Some time ago there was a discussion on that in Pharmacy - the outcome was that the same resource would be used, not two resources. <br>\nHowever, it seems interesting to explain how the MedRequest can get profiled to say \"this is a request to dispense\" vs \"this is a request to administer\" vs \"this is a request to do whatever is necessary\".</p>\n<p><span class=\"user-mention\" data-user-id=\"191437\">@Arianne van de Wetering</span> hopefully you remember that old discussion and can explain more details if needed<br>\n<span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> I think the information you asked is here: <a href=\"https://zibs.nl/wiki/HCIM_Release_2020(EN)#group:_Medication.2C_count:_7\">https://zibs.nl/wiki/HCIM_Release_2020(EN)#group:_Medication.2C_count:_7</a></p>",
        "id": 222412439,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610446724
    },
    {
        "content": "<p>The Dutch Healthcare information models indeed separate these concepts. Perhaps the FHIR profile on MediationRequest for these models gives a better understanding. We have a so-called <a href=\"https://simplifier.net/packages/nictiz.fhir.nl.stu3.zib2017/2.0.4/files/267913\">MedicationAgreement</a> and a <a href=\"https://simplifier.net/packages/nictiz.fhir.nl.stu3.zib2017/2.0.4/files/268071\">DispenseRequest</a> both mapped to a MedicationRequest resource. The resources are distinguished by a mandatory, fixed SNOMED code in the category element</p>",
        "id": 222413199,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1610447317
    },
    {
        "content": "<p>The prescription isn't a \"request\" to do anything - it's an <em>authorization</em> - typically to both administer and dispense, though in some cases it can authorize administration without authorizing dispensing.  If you want to actually say \"please dispense against this authorization\" or \"please administer against this authorization\" - that's Task.</p>",
        "id": 222462388,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610471122
    },
    {
        "content": "<p>The legal definition of a Prescription may vary from country to country. In NZ, it's defined by the Medicines Act as an <em>order</em> which is semantically different from <em>authorisation</em> which is a form of permission. From memory FHIR landed on MedicationRequest (initially it was MedicationOrder) so that it could cover use cases in addition to legal prescriptions.</p>",
        "id": 222511123,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1610494209
    },
    {
        "content": "<p>This isn't about the legal definition of prescription, it's about the meaning of the resource.  The MedicationRequest resource represents the authorization.  It doesn't, by itself, request action.</p>",
        "id": 222532993,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610512964
    },
    {
        "content": "<p>(Though you're right that if the intent is not 'order', it doesn't even imply that there's authorization)</p>",
        "id": 222533015,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610512997
    },
    {
        "content": "<p>Looking at the definition of  (MedicationRequest)[http://hl7.org/fhir/medicationrequest.html] in the R4 specification - the concept of authorization is introduced in the (optional) dispenseRequest element (described as \"Medication supply authorization\"). The MedicationRequest resource itself is said to be \"An order or request for both supply of the medication\". and to \"cover all type of orders for medications for a patient.\".  </p>\n<p>The term \"prescription\" is used 19 times on that page, including in an element name and virtually all  the search parameter descriptions. Maybe the page needs some editing - thus far, it hasn't changed significantly in R5. However, the primary (but not only) use of this resource is likely to be for Prescriptions and these are commonly defined as orders - that has to be factored into the meaning of this resource, it's not irrelevant. Fortunately, the definition uses the word \"order\" rather than \"authorization\"!</p>",
        "id": 222546877,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1610525298
    },
    {
        "content": "<p>The general premise of how requests behave is consistent across <em>all</em> 'request' resources.  Whether MedicationRequest, ServiceRequest, DeviceRequest or something else, posting a Request - by itself - shouldn't trigger any action.  You either need a tag, an operation, a message or Tag to say \"please fulfill this\".  (And in some cases, you might only seek partial fulfillment.)</p>",
        "id": 222680869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610601160
    },
    {
        "content": "<p>In that sense, it <em>is</em> a prescription, but it works like a paper prescription.  It doesn't <em>do</em> anything until someone takes it to the pharmacy and asks for it to be filled.</p>",
        "id": 222680879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610601198
    },
    {
        "content": "<p>In many countries with electronic prescribing services and regulations that remove the requirement for paper scripts, electronic prescriptions can be transmitted directly (or via a push-pull to/from a broker) from a GP to a pharmacy chosen by a patient.  I'm not sure if any countries use the FHIR MedicationRequest resource as part of this solution, in NZ we're still using bespoke messaging for metadata and CDA to hold the Prescription itself. I'd  be really interested to see an IG for a FHIR-based national  e-prescription service.</p>",
        "id": 222684029,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1610606183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"212913\">@Danielle Bancroft</span> <span class=\"user-mention\" data-user-id=\"192230\">@Danielle</span></p>",
        "id": 222684124,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1610606358
    },
    {
        "content": "<p>PrescribeIT in Canada does this although I think there is a broker (may be the wrong word) in the middle.  It is FHIR based.</p>",
        "id": 222728055,
        "sender_full_name": "Melva Peters",
        "timestamp": 1610636426
    },
    {
        "content": "<p>Look at the Post Acute Orders IG, one use case they have is for prescriptions. As with all Request-based resources, any workflows that need more than one step to complete, will most likely require a Task resource to track the state of the workflow.<br>\n<a href=\"http://build.fhir.org/ig/HL7/dme-orders/\">PAO IG</a></p>",
        "id": 222737602,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1610639956
    },
    {
        "content": "<p>PrescribeIT uses messaging - so the messages handles the \"please fulfill\" bit.</p>",
        "id": 222770534,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610652823
    }
]