[
    {
        "content": "<p>We have a use case that we would appreciate guidance on and RequestGroup.action.condition seems the most appropriate.</p>\n<p>As a CDS service, we return a set of requests resources contained in a RequestGroup. Consumer organizations have the option to exclude certain procedures or regimens that may not be available at their facility. The source material defining these recommendations requires that we present the recommendation as a whole. We want to indicate that this procedure is excluded or not available at their facility and thus can not be selected as an order. The CDS response should show the recommendation, but flag it as unavailable. This condition field seems like a good option here, though any suggestion would be appreciated.</p>\n<p>Is there guidance on how this could be accomplished in FHIR?<br>\nThanks</p>",
        "id": 153917218,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1509569172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 153917229,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1509571486
    },
    {
        "content": "<p>When you are preparing the RequestGroup to be sent back, that's when you know whether the action is applicable based on the location of the requester, right? So are you saying you would just set the condition expression to <code>false</code>? I think that would work, but it would assume that the consuming system understood a request group with enough fidelity to depict that <code>false</code> as \"Show this, but gray it out\". That seems like a lot of assumptions to put around the meaning of the condition.</p>",
        "id": 153918591,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510256765
    },
    {
        "content": "<p>And I assume the response is coming back through CDS Hooks?</p>",
        "id": 153918594,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510256989
    },
    {
        "content": "<p>Yes, that's exactly correct. It's likely that we will profile request group and extend or slice that condition field to make this clear in the data as well as explain it in the IG. And yes, somewhat through CDS-Hooks. Though we are working closely with the consuming system so the security protocol is going to differ slightly. The payload will look similar, but we needed to communicate selection behavior outside of whats possible in suggestion cards, so we're using a RequestGroup in a GuidanceResponse. As well, this GR will serve as a record of the decision support interaction.</p>\n<p>Thanks Bryn.</p>",
        "id": 153918677,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1510269494
    },
    {
        "content": "<p>So, one issue here is that the GuidanceResponse resource has been voted to be deprecated, though we haven't yet applied the change because tracking the lifecycle of a decision support response keeps coming up as a use case. Can I ask you to submit a tracker item that details how you are using GuidanceResponse? I'm also very interested in whether it meets the needs as you are currently using it, or if you would recommend changes to it based on your usage.</p>",
        "id": 153918750,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510283371
    },
    {
        "content": "<p>Yes I've been hoping to speak to GuidanceResponse's continued relevance. I will submit a tracker item today that explains our use case and the issues we have run into with it.</p>",
        "id": 153918896,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1510331564
    },
    {
        "content": "<p>Submitted a tracker, I tried to spell out all the uses it covers.<br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14179\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14179\">tracker item 14179</a></p>",
        "id": 153919834,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1510775565
    }
]