[
    {
        "content": "<p>Is it valid to use both of these fields for similar but different uses within the same resource? I don't see a constraint preventing both of their existences concurrently.</p>\n<p>The use case is I would like to refer to the disease this Request is meant to address, and refer to the overall category of medication (endocrine therapy vs chemotherapy for breast cancer). Would .category be a better place for this than reasonCode despite the 'preferred' binding?</p>\n<p>Thanks</p>",
        "id": 153903848,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1503929981
    },
    {
        "content": "<p>which .category do you mean? if medicationRequest.category, then it seems a bit closer to what you describe.<br>\nmedicationRequest.category is the category of the request, while you seem to want the category of the medication, right?</p>",
        "id": 153903849,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1503930405
    },
    {
        "content": "<p>however, reason could also be used, if you wnt to express \"i give this medication because this patient needs endocrine therapy\"</p>",
        "id": 153903851,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1503930479
    },
    {
        "content": "<p>it seems a very thin boundary. to me it seems that this would be determine by whether you mean to express that notion as a justification (reason) or as a group/class of treatment (category).</p>",
        "id": 153903852,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1503930749
    },
    {
        "content": "<p>Category fits better, but the preferred VS and description (where this medication is to be consumed) made me hesitant. The reasonCode fits too, but does not fit quite as well, this medication is given because the patient's tumor needs endocrine therapy, or because the patient's tumor needs chemotherapy. My preference for reasonCode is because a RequestGroup also has reason code, and some of these medications (endocrine as well as chemo) are given as regimens that I intend to group.</p>",
        "id": 153903853,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1503932838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?</p>",
        "id": 153903858,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503933815
    },
    {
        "content": "<p>The reason codes in the MedicationRequest are intended to capture why the medication is being prescribed/ordered by the prescriber or the \"indication for use\".  It isn't necessarily a diagnosis, it could be for a symptom.  It is possible that the requester could include one or more reasons via codes - where it is a condition, diagnosis or problem.  For example, medication is being prescribed for \"Blood Pressure Elevation\" (Snomed CT 24184005).  The requester can also include one or more references to a specific condition or observation as the reason for requesting the medication.  For example, I'm prescribing this medication because of the vital signs for Blood Pressure Measurement.  Pharmacy WG hasn't considered limiting this to a code or a reference as it was felt that it could be either or both.  I do not believe that category is the right place to capture this information.</p>",
        "id": 153903863,
        "sender_full_name": "Melva Peters",
        "timestamp": 1503935441
    },
    {
        "content": "<p>I see \"category\" as any information that is used for categorizing the request. For example inpatient, ambulatory, daycare.. these are things that can condition the workflow.</p>",
        "id": 153903865,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1503935588
    },
    {
        "content": "<p>The case described by Travis  reminded me of one implementation where we had an element which determined the type of treatment. If it were \"chemotherapy\" it would be handled not by software app #1, but by software app #2. That is why i would point for that.</p>",
        "id": 153903866,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1503935774
    },
    {
        "content": "<p>if you would want to express a group of reasons, reasonCode would be good. If it for a classification of a medication, i don't think there is anything. I would point to category in the unique case where that \"reason\" is actually an expected treatment of the order - type of order and where/how it is being processed. Does this make sense?</p>",
        "id": 153903867,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1503935966
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> </p>\n<p>So what is the best field to capture that this regimen or med-request is 'endocrine therapy' or 'chemotherapy'.</p>",
        "id": 153903871,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1503936955
    },
    {
        "content": "<p>I don't believe that there is an attribute in the MedicationRequest that is appropriate for that.   I suggest that you add a Gforge tracker item that describes your use case for consideration.</p>",
        "id": 153903872,
        "sender_full_name": "Melva Peters",
        "timestamp": 1503937166
    }
]