[
    {
        "content": "<p>How would Request Status Codes be used when a request is passed to an intermediary system which then brokers the request? The codes appear to be for a request (say a ServiceRequest or ReferralRequest (STU3)) to be sent from the requester to the performer. For example there's no code to say that the request is \"submitted\" and then \"accepted\".  How would Request Status be used in this instance or is this somewhere else I've missed?</p>",
        "id": 153928982,
        "sender_full_name": "Paul Watt",
        "timestamp": 1516066146
    },
    {
        "content": "<p>That sounds like a task for <a href=\"http://build.fhir.org/task.html\" target=\"_blank\" title=\"http://build.fhir.org/task.html\">Task</a></p>",
        "id": 153928997,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516069353
    },
    {
        "content": "<p>The Task would reference a ServiceRequest (in \\\\Task\\basedOn\\)? This would mean that 2 resources would be required and then updated together as the request is performed.<br>\nTaskStatus definitely has a better set of codes for this use case.<br>\nThis is a more complex than having the codes available in the ServiceRequest.</p>",
        "id": 153928999,
        "sender_full_name": "Paul Watt",
        "timestamp": 1516070263
    },
    {
        "content": "<p>The set of statuses are separated because they represent different things.   See the discussion of workflow patterns here: <a href=\"http://build.fhir.org/workflow-communications.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow-communications.html\">http://build.fhir.org/workflow-communications.html</a></p>",
        "id": 153929004,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516075303
    },
    {
        "content": "<p>The request just represents the status of the authorization.  Task represents the status of the negotiation for fulfillment.  You might have numerous tasks tied to the fulfillment of the same authorization.  For example, the first few candidates might say \"no\" - each resulting in an end state of \"rejected\" while the third one says \"yes\" and eventually gets to completed.  The Request resource (the authorization) remains active throughout until the creator of the authorization confirms they're comfortable with the completion.  (Other scenarios include requests for partial fulfillment - first month, first repetition, etc.)</p>",
        "id": 153929012,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516078399
    },
    {
        "content": "<p>If you're in an environment where Task and Request are totally intertwined and inseparable, you could look at using \"contains\".  And in a messaging environment, you'd convey both.  In a pure REST environment, you share the task and point to the previously posted Request.</p>",
        "id": 153929013,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516078511
    },
    {
        "content": "<p>Take a look at the workflow.html page for some of the different exchange patterns and what you can and can't do with each of them.  (And feedback if you think we've missed something or are making things harder than necessary is welcome too.)</p>",
        "id": 153929014,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516078564
    },
    {
        "content": "<p>Thanks Eric and Lloyd. I'll review the workflow page and see if that fits.</p>",
        "id": 153929164,
        "sender_full_name": "Paul Watt",
        "timestamp": 1516154938
    }
]