[
    {
        "content": "<p>hi. I have a need to advise an implementer how to implement a patient request for information. Structurally, it looks like a consent - all the same kinds of decisions. But we've previously said that it's not a consent... so what is it? A task with a consent? Something else?</p>",
        "id": 153973615,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530752008
    },
    {
        "content": "<p>The patient is asking for information to be delivered to themselves or to someone else?  If so, CommunicationRequest might be a good fit.  (I'm wondering whether the Request pattern shouldn't have a 0..1 or even 0..* reference to Consent)</p>",
        "id": 153973627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530752864
    },
    {
        "content": "<p>I have assumed that it was both a Consent and a CommunicationRequest. The Consent contains the authorization for the release, the CommunicationRequest contains the details about what the release must do. This also clearly can be shown as to 'have happened', the CommunicationRequest has been satisfied.</p>",
        "id": 153973714,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530799525
    },
    {
        "content": "<p>I'd say the fundamental action is the CommunicationRequest - \"please share\".  If needed, a consent can accompany that.</p>",
        "id": 153973723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530800076
    },
    {
        "content": "<p>so, is the consent the payload of the communication request?</p>",
        "id": 153973860,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530817886
    },
    {
        "content": "<p>Lloyd has pointed out that the CommunicationRequest might not need a Consent; as it might have been authorized by other means. Including patient-right-of-access.    BUT, where it does need a Consent to authorize the communication; then yes it would seem the CommunicationRequest might be appropriate to point at the Consent that authorizes the transfer. It is also possible they are not linked except by the very nature they refer to the same terms.</p>",
        "id": 153973870,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530818154
    },
    {
        "content": "<p>hmmm. so would CommunicationRequest.about, or CommunicationRequest.reasonReference ?</p>",
        "id": 153973871,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530818193
    },
    {
        "content": "<p>well, in this case, it's about 'what is requested to be transferred'. You spin that around to 'transfer of records requested, this subset consented to'</p>",
        "id": 153973873,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530818257
    },
    {
        "content": "<p>seem CommunicationRequest doesn't have a place for the Consent that authorizes the communication...  should it? should this be a core extension?</p>",
        "id": 153973875,
        "sender_full_name": "John Moehrke",
        "timestamp": 1530818314
    },
    {
        "content": "<p>It may make sense for it to be a core element for some things (e.g. Procedure) and an extension for other things.  We've avoided it so far because Consent had been constrained to not include \"permission to do things\".  Maybe submit a change request for the relevant PatientCare resources and the Request pattern?</p>",
        "id": 153973882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530819442
    },
    {
        "content": "<p>wider issue depends on the outcomes of analysis of requirements for other consent scopes</p>",
        "id": 153973883,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530819504
    }
]