[
    {
        "content": "<p>Patient Care work group is soliciting implementer feedback on whether your system supports tracking \"availability\" of care team members (availability = frequency when the care team member is available to provide care).  We're considering <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20650\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20650\">GF#20650</a>, which could result in either a standard extension or else a new CareTeam.participant.availability (Timing) element.  Feedback is welcome!</p>",
        "id": 163157805,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1555040682
    },
    {
        "content": "<p>Does your system collect information about how often the care team member provides care for the patient? E.g. the home health nurse sees the patient once a week. The patient is seen by the physical therapist three times a week. The patient is seen at the dialysis clinic on Tuesday, Thursday and Saturdays for dialysis treatment.</p>",
        "id": 163194778,
        "sender_full_name": "Emma Jones",
        "timestamp": 1555079142
    },
    {
        "content": "<p>I am very interested in this - will start implementing it this summer. I do think \"availability\" makes sense as a new element, type Timing . I think Timing will also cover \"available on request\".</p>",
        "id": 163254622,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555142656
    },
    {
        "content": "<p>don't we need the availability of the entire team as well?</p>",
        "id": 163254657,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555142704
    },
    {
        "content": "<p>I don't think you should mix scheduling information up with Care Team member information.  It needs to be decoupled.  I wouldn't want to  record this \"frequency\" info in the actual Care Team resource.  If I see my psychologist once a week on Tuesdays and it turns out that next week I have moved my appointment to Wednesday then the info could become inaccurate very easily.  Even if I note that I see my dentist every 6 months, and I don't fit in my appointment at the right time, and 8 months laps between appointments....it would all get very confusing with a high overhead to keep up to date.  Wouldn't this be better in a reference out to scheduled appointments maybe?</p>",
        "id": 163320496,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1555253727
    },
    {
        "content": "<p>Schedule should be CarePlan, not CareTeam</p>",
        "id": 163320908,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555254364
    },
    {
        "content": "<p>Yes, schedule of \"requested/planned\" actions is in careplan.<br>\nWhere do we put the availability schedule for the team?</p>",
        "id": 163331021,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555270925
    },
    {
        "content": "<p>You'd presumably use Slots as part of the scheduling infrastructure.  Availability wouldn't be CareTeam-specific (though it could be role-specific and the membership in the care-team could be tied to a specific role)</p>",
        "id": 163331064,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555271017
    },
    {
        "content": "<p>Doesn't this exclude the possibility to do \"The A-Team of surgery with Drs JHS, HMM, TP, BA is available on Sundays\"?<br>\nWe should be able to capture the availability of a team or the team's members.</p>",
        "id": 163331520,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555271648
    },
    {
        "content": "<p>It could be that we should add Team as one of the actors in Schedule</p>",
        "id": 163331615,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555271802
    },
    {
        "content": "<p>I'm so curious on this. Is it availability for the team, a member or a role? (or a service - which is already catered for in the HealthcareService resource)</p>",
        "id": 163332506,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1555272934
    },
    {
        "content": "<p>We should add this to the joint PA/PC session in Montreal.</p>",
        "id": 163332516,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1555272959
    },
    {
        "content": "<p>I think availability could be on any of those. And preferably done in a single way for them all: a) Either in schedule (and remove availabletime from healthcareservice, or b) in each of the resources. Just a gut feeling that a) is better for implementation.</p>",
        "id": 163334043,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555274944
    },
    {
        "content": "<p>Speaking as Patient Care co-chair, I agree with Brian that this is a good topic to discuss at the joint PA/PC session in Montreal.  The examples provided in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20650\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20650\">GF#20650</a> included:</p>\n<blockquote>\n<p>A cardiologist is nominated as a care team member/participant from May 2019 to November 2019, but will only be available for providing care on Monday, Tuesday, and Friday each week<br>\nA community nurse is required to provde home nursing care to a patient from April 2019 to March 2020, and will do home visits once every week. The day of the week is to be arranged with the patient</p>\n</blockquote>\n<p>The first example (cardiologist) seems agnostic to the patient (that is the practitioner's general schedule).  The second example (when the home visits are planned) feels like it might be crossing over into the care plan activity timing.<br>\nSpeaking as a Cerner implementer, I confirmed that the \"availability\" that we support is at the practitioner level (not specific to a given patient's care team)</p>",
        "id": 163416915,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1555362880
    }
]