[
    {
        "content": "<p>Hi! I'm pretty new to FHIR and I'm looking to get some feedback on an example bundle structure I'm working on. The goal is to capture a claim for a vaccination where the patient is uninsured. I've included some comments inline near fields where I describe my assumptions about what the fields can mean or be used for.</p>\n<p>Would love to know if my structure and assumptions are correct. Feedback is greatly appreciated.</p>\n<p>I attached the bundle as a file due to length. Please let me know if there's a different/preferred way of posting.</p>\n<p><a href=\"/user_uploads/10155/Zlon7rSB8y_d3H5mmQXPrBHs/bundle_with_claim.json\">bundle_with_claim.json</a></p>",
        "id": 275643519,
        "sender_full_name": "Sara",
        "timestamp": 1647519751
    },
    {
        "content": "<p>A Claim resource is, by definition, a request for payment via insurance.  If you're seeking payment by the patient themselves or some other guarantor, then you're looking at an Invoice, not a Claim.  </p>\n<p>Other comments:</p>\n<ul>\n<li>doing a POST of the patient means that you're creating a new Patient instance every time.  You typically wouldn't want to do that.  Same with Practitioner.  In general, you only want to create things that aren't already on the server.  If you don't know what already exists and don't have an ability to check to see before you create the data, then you'll need a custom operation where the receiver will have to take on that role.  (With a transaction, the receiver doesn't get that as an option - they create everything you tell them to create or they fail.)</li>\n<li>Claim.provider is indeed who's submitting the insurance claim</li>\n<li>Claim.careteam - maybe, though you would typically have a performer on the Immunization</li>\n<li>There will be a standard system for tax id too</li>\n<li>What's your purpose in capturing the appointment?</li>\n</ul>",
        "id": 275671872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647531265
    }
]