[
    {
        "content": "<p>How would we express 'patient should not take any more of this medication'?</p>",
        "id": 269320732,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643143280
    },
    {
        "content": "<p>MedicationRequest with doNotPerform = true</p>",
        "id": 269325146,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643145192
    },
    {
        "content": "<p>Right, thanks, that is what I understand from the spec. If the medication was already being taken because of an ongoing prescription (which may or not be existing, or available in digital form), does anything change?</p>",
        "id": 269325615,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643145373
    },
    {
        "content": "<p>depends on what you want to say.  if you are telling someone that the medication needs to be stopped, then that is a Task (potentially to the clinician to submit the MedRequest and to the pharmacist to no longer dispense and to the patient/caregiver to stop administering the medication).  if the clinician is recording the stop, then it is a MedicationRequest with doNotPerform=true</p>",
        "id": 269329902,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643147368
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179166-implementers/topic/request.20to.20no.20longer.20take.20a.20medication/near/269329902\">said</a>:</p>\n<blockquote>\n<p>depends on what you want to say.  if you are telling someone that the medication needs to be stopped, then that is a Task (potentially to the clinician to submit the MedRequest and to the pharmacist to no longer dispense and to the patient/caregiver to stop administering the medication).  if the clinician is recording the stop, then it is a MedicationRequest with doNotPerform=true</p>\n</blockquote>\n<p>This is unclear to me. - see if I'm reading this right.<br>\nI think the request doesn't track the progress or acceptance of requests, that is what Task is for. <br>\nAnd the trigger for a change can be a Task (if one is ongoing or created) but normally the trigger for something to change course is a Request<br>\nSo, the Task is what says \"this is now supposed to be stopped, please act accordingly\". I agree that this could trigger the physician to officially issue the request to stop. <br>\nThe formal request for \"please stop\" \"this is no longer to be taken\" is the MedRequest</p>",
        "id": 269430015,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643211235
    },
    {
        "content": "<p>if a patient already has the medication and a system (say a clinical decision support system) needed to tell everyone involved in care that the medication should be stopped, it would need to send out a Task to everyone involved to tell them to \"this medication is supposed to be stopped and never taken again!, please act accordingly\".<br>\nThe clinician's \"act accordingly\" would be to update the previous MedRequest to have a status of 'stopped' and to send a new MedRequest with doNotPerform = true.</p>",
        "id": 269431787,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643211911
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  and <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  -- we should maybe tease out two quite <em>distinct</em> scenarios here. If it turns out that Derek is having an adverse reaction to the meds, then the do not perform flag is appropriate, and would/should (we hope) apply to any workflows associated with this med order (including dispense and administer, and informing/preventing any future orders for this med). <br>\nHowever, in scenario 2, if the existing prescription needs to be altered, then it may be more appropriate to update the <strong><em>existing</em></strong> med request status to \"stopped\" and to create a <strong><em>new</em></strong> active med request at the updated dose level. <br>\nDoes this make sense?</p>",
        "id": 269439167,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1643214362
    },
    {
        "content": "<p>Yes, that is correct.  The use case that Jose and I are teasing out is what to do when you want to have a patient stop taking medications, i.e. full stop.  If you just wanted to alter the existing order, then the Task would be different than what I included above.</p>",
        "id": 269439395,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643214460
    },
    {
        "content": "<p>Thanks, Jean. <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  -- I think your use case example arose from our CCG discussion earlier this week, did it not? As I understand it -- the \"stop medication\" requirement <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> was describing for <em>this</em> use case (ANC SMART guideline) is more like scenario-2... it was motivated by a need to increase a pregnant mum's daily iron if she is found to be suffering from anaemia.</p>",
        "id": 269440547,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1643214857
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179166-implementers/topic/request.20to.20no.20longer.20take.20a.20medication/near/269431787\">said</a>:</p>\n<blockquote>\n<p>if a patient already has the medication and a system (say a clinical decision support system) needed to tell everyone involved in care that the medication should be stopped, it would need to send out a Task to everyone involved to tell them to \"this medication is supposed to be stopped and never taken again!, please act accordingly\".</p>\n</blockquote>\n<p>There's 2 things: </p>\n<ol>\n<li>the medication may have been ordered by someone else, and may not be \"in the system\"</li>\n</ol>",
        "id": 269441112,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643215052
    },
    {
        "content": "<ol start=\"2\">\n<li>The DSS is a decision system or a workflow engine? The one that sends the Tasks is the workflow engine that knows who is involved. <br>\nIf the DSS is a machine that proposes decisions, it would be the entry point to all that. It would not make a task, not even an order. It would make a proposal.</li>\n</ol>",
        "id": 269441456,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643215157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> Yes, I know this is an open topic in other discussions so I am asking more generically. Changes to treatments are done with MedRequests (especially in distributed systems where not all is in FHIR and workflow management doesn't exist). In terms of workflow management I agree with Task.</p>",
        "id": 269441840,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643215303
    },
    {
        "content": "<p>And reading the description above I think I'm in agreement that if someone needs to say \"please change <strong>this</strong>  MedRequest\" - this is a Task. I guess a DSS could do that. However, a) the DSS may not be aware of what MedRequest it is, and b) the DSS doesn't really tell anyone what to do. It suggests. And to make it compatible with expectable scenarios, I would expect the DSS to issue MedRequests as proposals</p>",
        "id": 269442869,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643215693
    },
    {
        "content": "<p>So it would be a <em>proposal to update</em> the status of an existing MedRequest (referenced by its .id, I guess) to a status of stopped? Do we have a way to define 'proposal to update a medRequest' in an activityDefinition? <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 269446611,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1643217075
    },
    {
        "content": "<p>...or am I misunderstanding... is it a Task... and the job of the task is to propose an update to the MedRequest... sorry if I've lost the plot, here. <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 269446908,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1643217217
    },
    {
        "content": "<p>Task is used to solicit updates in situations where the requester doesn't have permission to do them themselves (or where they want someone else to take responsibility for performing the action)</p>",
        "id": 269447745,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643217544
    },
    {
        "content": "<p>But Task may be triggered by a Request. <br>\nI'm imagining concurrent requests here - one says \"do amoxiclav\" and the other one \"please stop any penicillin-derived drugs\"</p>",
        "id": 269455376,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643220350
    },
    {
        "content": "<p>As a Request resource itself, Task can be issued with intent of 'proposal', which is what we would be doing in this case, the decision support system would send a task proposing that a specific medication would be stopped. Of course, it could only do this if it knew that the medication existed already, that's the case we're considering, so the focus of the task would be the specific prescription resource to be stopped.</p>",
        "id": 269474759,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1643228179
    }
]