[
    {
        "content": "<p>Hi everyone. Small question about RequestGroup.</p>\n<p>I know the purpose of these groups is to bundle a series of interrelated and optional requests, and so the code field was omitted, which I'm guessing is because the interpreting system should be able to understand the 'what' from the set of actions.</p>\n<p>We have a use case that is going to make the above difficult. Specifically, complex medication regimens, like chemotherapy regimens. Chemotherapy regimens are fairly well documented in some terminologies like NCI Terms, and an actual implementation of the regimen tends to see variation in timing and dosing that would make equating one regimen to another difficult - ie a patient misses a week, or a dose has to be reduced from toxicity.</p>\n<p>For a CDS system hoping to know 'what' regimen a patient is on, it either has to be ready for the large number of possible variations, or read a code to know that this regimen, despite the small changes, is still AC-followed by Taxane followed by Trastuzumab. (that is, after the regimen has been instantiated from it's PlanDefinition)</p>\n<p>So my question is, should RequestGroup(and PlanDef) have a code field at the top level? Should we use the action[0].code for this purpose? Or would this be better as an Extension on RequestGroup?</p>\n<p>Thanks!</p>",
        "id": 153897953,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1500917487
    },
    {
        "content": "<p>I think a code element at the root makes sense, would it be singular or plural?</p>",
        "id": 153897971,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1500926632
    },
    {
        "content": "<p>We have useContext and topic, but those are more related to searches and only defined for PlanDefinition.</p>",
        "id": 153897972,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1500926664
    },
    {
        "content": "<p>At minimum, a standard extension is reasonable.  I'm ambivilent as to whether it should be core or not.</p>",
        "id": 153897973,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500927315
    },
    {
        "content": "<p>I vote for core. I was actually about to file a tracker for this in fact.</p>",
        "id": 153897975,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1500927574
    },
    {
        "content": "<p>File away...</p>",
        "id": 153897976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500927598
    },
    {
        "content": "<p>Re: Cardinality of code: Many regimens come sequentially - \"FEC followed by CAF with Trastuzumab\", so I would kind of prefer it to be plural to allow for a sort of postcoordination. But if it were single it just takes submitting to terminologies, which can be rather slow. Arguably it represents a deficiency in the terminology though and the regimen should be submitted. Either will work for the use case I've described here, plural would be easier though.</p>",
        "id": 153897991,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1500934212
    },
    {
        "content": "<p>Each of the parts will have their own code.  Having a code on the Group as a whole should be a code that applies to the group as a whole.</p>",
        "id": 153897996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500938237
    },
    {
        "content": "<p>Yes I know, I was picturing a SNOMED style postcoordination RG.code: [\"AC Regimen\", \"Followed By\", \"Trastuzumab\", \"and\", \"Pertuzumab\"]. </p>\n<p>Can you link the tracker here <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> if you file it?</p>",
        "id": 153898070,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1500988975
    },
    {
        "content": "<p>It's here:</p>",
        "id": 153898087,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1500996954
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13687\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13687\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13687</a></p>",
        "id": 153898088,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1500996955
    },
    {
        "content": "<p>Feel free to add additional info in the follow ups section.</p>",
        "id": 153898089,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1500996986
    }
]