[
    {
        "content": "<p>Hello, via the REST call for the metadata a user can obtain a list of available resource profiles that exist on a FHIR server. How can I access the StructureDefinition of an specific resource profiles?<br>\nGreetings</p>",
        "id": 154638540,
        "sender_full_name": "Georg Fette",
        "timestamp": 1546947089
    },
    {
        "content": "<p>You can always use the search API, e.g. searching for the profile's canonical URI, like this:<br>\n<a href=\"http://fhir.hl7.de:8080/baseDstu3/StructureDefinition?url=http://fhir.de/StructureDefinition/medikationsplanplus/patient\" target=\"_blank\" title=\"http://fhir.hl7.de:8080/baseDstu3/StructureDefinition?url=http://fhir.de/StructureDefinition/medikationsplanplus/patient\">http://fhir.hl7.de:8080/baseDstu3/StructureDefinition?url=http://fhir.de/StructureDefinition/medikationsplanplus/patient</a></p>",
        "id": 154638875,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1546947556
    },
    {
        "content": "<p>Is it always true, that for every resource profile there exists a corresponding StructureDefinition on the same server ?</p>",
        "id": 154639032,
        "sender_full_name": "Georg Fette",
        "timestamp": 1546947806
    },
    {
        "content": "<p>A resource profile is always defined in a StructureDefinition resource, so: yes for \"a corresponding StructureDefinition exists\".<br>\nIt must also be known to the server, if the server claims to be capable of supporting that profile, so: also yes for \"on the same server\".</p>\n<p>I think a server implementer might decide not to <em>expose</em> StructureDefinition reources via the API, in which case the client would not be able to retrieve it. At least I'm not aware of the FHIR spec enforcing that.</p>\n<p>But usually you would get your FHIR conformance resources by looking at the implementation guide you are implementing. These also contain StructureDefinitions and terminology resources, no matter whether they are published using IG Publisher, Simplifier or any other means (like Zip files).<br>\nAlso the npm package format is on it's way for the distribution of FHIR conformance resources.</p>",
        "id": 154639514,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1546948462
    },
    {
        "content": "<p>\"Known to the server\" is not the same as \"searchable/retrievable using the StructureDefinition endpoint on that server\".  The CapabilityStatement will list the profiles the server claims to support.  You can start by trying to query them from that server.  If not, you can look to see if you already have a local copy or if a copy exists in your favorite registry.  And if that doesn't work, you can fall back to resolving the canonical URL.</p>",
        "id": 154655202,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546964223
    },
    {
        "content": "<p>I suspect that in real world cases, it will most commonly be the last thing Lloyd says - the canonical URL.</p>",
        "id": 155122111,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1547502370
    }
]