[
    {
        "content": "<p>Hey all,<br>\nI'am currently working on the ResearchStudy ressource on behalf of the German MIRACUM consortium. We plan to use this representation as an exchange format between our central and the local study repositories. In order to cover all information that is defined in our core dataset it is necessary to customize the ResearchStudy resource. Right now I'm becoming comfortable with Forge and startet to experiment a little. This is by far not the first time I'm working with FHIR but it has been a while since the last time and some things changed. So my question is: The right way to customize a resource is to define (if necessary) structure definitions for extension that will later be used to customize the resource itself? And is it also possible to use customely defined ValueSets (let's say with Art-Decor) for the ResearchStudy.status element?</p>\n<p>Regards from Dresden<br>\nChristian</p>",
        "id": 165881064,
        "sender_full_name": "Christian Kamann",
        "timestamp": 1558080775
    },
    {
        "content": "<blockquote>\n<p>And is it also possible to use customely defined ValueSets (let's say with Art-Decor) for the ResearchStudy.status element?</p>\n</blockquote>\n<p>No, because the binding is of type <a href=\"http://hl7.org/fhir/terminologies.html#required\" target=\"_blank\" title=\"http://hl7.org/fhir/terminologies.html#required\">required</a> - you can at most exclude codes from the default valueset, but you can't add new ones. Are you certain you can't use the codes provided?</p>",
        "id": 165883221,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1558083084
    },
    {
        "content": "<p>Unfortunately, there is a certain lack of finer granularity because, for example, you can not specify whether the study is currently recruiting, the recruitment has been successful / unsuccessful, etc. So it would be better to add some codes to the original ValueSet.</p>",
        "id": 165883578,
        "sender_full_name": "Christian Kamann",
        "timestamp": 1558083482
    },
    {
        "content": "<p>The other way would be to add another element which indicates the current recruitment status. If that would be compliant to the intended use.</p>",
        "id": 165883777,
        "sender_full_name": "Christian Kamann",
        "timestamp": 1558083681
    },
    {
        "content": "<p>That would be valid in FHIR, yes (just add as an extension). This seems like a pretty basic requirement though, and I don't see an obvious place for it either - I'd recommend reaching out to the <a href=\"http://www.hl7.org/Special/committees/rcrim/index.cfm\" target=\"_blank\" title=\"http://www.hl7.org/Special/committees/rcrim/index.cfm\">Biomedical Research and Regulation Work Group</a> to ask about this usecase, or propose it using the 'Propose a change' link down at the bottom of the page.</p>",
        "id": 165884822,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1558084812
    },
    {
        "content": "<p>Thanks for the advice. Much appreciated!</p>",
        "id": 165884957,
        "sender_full_name": "Christian Kamann",
        "timestamp": 1558085006
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"222225\">@Christian Kamann</span> , please bring this up in the german/MI-Initiative Stream as well, to discuss with others working in the same realm. Also, the same issue has come up during the profiling work at the University of Cologne, so <span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> might want to chime in...</p>",
        "id": 165963899,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1558165773
    },
    {
        "content": "<p>For this project, we already created a „status-detail“-Extension:<br>\n<a href=\"https://simplifier.net/studysubjectmanagement/researchstudy-status-detail-2\" target=\"_blank\" title=\"https://simplifier.net/studysubjectmanagement/researchstudy-status-detail-2\">https://simplifier.net/studysubjectmanagement/researchstudy-status-detail-2</a><br>\n...maybe that’s useful?</p>",
        "id": 165964006,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1558165951
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> , thanks for the advice. The use of a FHIR resource as an exchange format for studies seems to be a MIRAUM-only approach as far as I know and within the consortium the people involved with this work are already aware of the ongoing process because we share all our progress and ideas within Confluence. But with respect to the sharing-and-reuse paradigm it might be good to aim for collaborative development. The \"status-detail\"-Extension is indeed helpful. Thanks a lot!</p>",
        "id": 166061130,
        "sender_full_name": "Christian Kamann",
        "timestamp": 1558334825
    },
    {
        "content": "<p>Hi Christian,<br>\n<span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  reached out in a PM which I only got to read now:  </p>\n<blockquote>\n<p>Unfortunately, there is a certain lack of finer granularity because, for example, you can not specify whether the study is currently recruiting, the recruitment has been successful / unsuccessful, etc. So it would be better to add some codes to the original ValueSet.</p>\n</blockquote>\n<p>Yes that also applies to other important criteria, such as legal bases and practitioner roles</p>\n<blockquote>\n<p>The use of a FHIR resource as an exchange format for studies seems to be a MIRACUM-only approach as far as I know </p>\n</blockquote>\n<p>There have been different uses in BioPharma for ResearchStudy I’ve seen before. Unfortunately, they don’t share that work.  We use FHIR for exchanging Key Information on  Trials as well and Practioner roles between EDC, CTMS and local EMR. MI-I is not directly involved in the extension work and it's not part of the MI-I Core but some MI-I sites using <a href=\"http://clinicalsite.org\" target=\"_blank\" title=\"http://clinicalsite.org\">clinicalsite.org</a> will use the extensions.  </p>\n<p>If you look back in a couple of weeks under <a href=\"https://simplifier.net/ClinicalSite.org/~resources?fhirVersion=STU3&amp;sortBy=RankScore_desc\" target=\"_blank\" title=\"https://simplifier.net/ClinicalSite.org/~resources?fhirVersion=STU3&amp;sortBy=RankScore_desc\">https://simplifier.net/ClinicalSite.org/~resources?fhirVersion=STU3&amp;sortBy=RankScore_desc</a> - more stuff, presently not public, will be publicly available there. For modelling &amp; interoperability purposes we'd like to refer to terminologies - where possible (c.f. <a href=\"#narrow/stream/179290-research/topic/Domain.20Terminology.20for.20Trial.20Management\" title=\"#narrow/stream/179290-research/topic/Domain.20Terminology.20for.20Trial.20Management\">https://chat.fhir.org/#narrow/stream/179290-research/topic/Domain.20Terminology.20for.20Trial.20Management</a>). There is still quite some discussion going on. </p>\n<p>Feel free to get back with specific questions any time. We have bi-monthly call you can join in on.</p>\n<p>Gustav</p>",
        "id": 166110429,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1558378943
    }
]