[
    {
        "content": "<p>I'm trying to understand how a PlanDefinition is applied to a clinical research protocol. For example, generally a clinical research protocol would include objectives (or endpoint goals), its design (e.g. parallel experiment with Arm A and B), schedule of activities (Screening do vitals, labs, ECG, medical history; Visit 1 do vitals, labs, etc.), and so forth. </p>\n<p>Taking that simple example into consideration would this equate to: <br>\n1) <strong>one </strong>PlanDefinition <br>\n2) <strong>multiple </strong>PlanDefinition's </p>\n<p>If one PlanDefinition, would FHIR slicing be applied for each specific aspect of the clinical research protocol? I know this is hierarchical in design.<br>\nIf multiple PlanDefinition's, would the protocol be split into specific parts? Such as a PlanDefinition for Arm A and another PlanDefinition for Arm B, etc. </p>\n<p>I appreciate any real world application experience regarding this. Thank you in advance.</p>",
        "id": 177276549,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1570129874
    },
    {
        "content": "<p>I don't think there's a single answer.  You could do it with one, you could split it up.  And regardless of how you chose to divide, you could create a profile that constrained PlanDefinition to drive more consistency across a set of research protocols.  The decision of whether to split or not really comes down to whether there's either re-use or independent maintenance that justifies having separate artifact.  If you don't expect re-use and the protocol is maintained as a whole, it's probably best to leave it as a single PlanDefinition.  I know the BR&amp;R work group is looking at this now.  <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span></p>",
        "id": 177281300,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570132702
    },
    {
        "content": "<p>Thanks Lloyd. Using consistency in mind, there could be a master protocol (i.e. master PlanDefinition) which could then be sub-divided into specific protocol's (i.e. single use PlanDefinition's). For example, if an organization has a master protocol for a specific Therapeutic Area it can have its wide applied commonalities as part of  that PlanDefinition (master). In continuation, that organization has a new clinical trial under that TA and it can refer to the master, but also include additional specific criteria in another PlanDefinition (trial A). As such, the approach of PlanDefinition (master) + PlanDefinition(trial A) = the overall set of definitions for that new clinical trial.</p>",
        "id": 177283128,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1570133548
    },
    {
        "content": "<p>Certainly.  You could also have distinct derived PlanDefinitions representing protocol refinements/variations for each study site.</p>",
        "id": 177296765,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570143825
    },
    {
        "content": "<p>Wonderful. Thank you for your input.</p>",
        "id": 177332320,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1570190906
    }
]