[
    {
        "content": "<p>how to manually set resource id of a record in fhir</p>",
        "id": 153856274,
        "sender_full_name": "harsh kumar",
        "timestamp": 1478753473
    },
    {
        "content": "<p>how to manually set resource id of a record in fhir</p>",
        "id": 153856276,
        "sender_full_name": "harsh kumar",
        "timestamp": 1478754776
    },
    {
        "content": "<p>Pls help.URGENT</p>",
        "id": 153856277,
        "sender_full_name": "harsh kumar",
        "timestamp": 1478754784
    },
    {
        "content": "<p>From a server perspective or froma Clients? Typically the server assigns the id which may be an incrementing value or a GUID or other value.</p>",
        "id": 153856286,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1478764467
    },
    {
        "content": "<p>If you want to control the id on a create, then you need to use PUT rather than POST.  (It's up to servers whether they'll let you assign the id of something that doesn't already exist.)</p>",
        "id": 153856382,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478808604
    },
    {
        "content": "<p>The Carin &amp; Da Vinci uses the Organization resource in their profile. We use one base FHIR resource for both the profile so having same resource ID. When the API is called with read by ID, how to decide which Organization resource to be returned?</p>\n<p>Thanks for your help.<br>\n<span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span> <span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span></p>",
        "id": 238172776,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1620664630
    },
    {
        "content": "<p>I'd say you should have only one resource (matching both profiles)</p>",
        "id": 238174395,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1620665267
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179166-implementers/topic/Resource.20ID/near/238174395\">said</a>:</p>\n<blockquote>\n<p>I'd say you should have only one resource (matching both profiles)</p>\n</blockquote>\n<p>Agree. But CARIN &amp; Da Vinci has different extensions in Organization resource.</p>",
        "id": 238192254,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1620672246
    },
    {
        "content": "<p>Doesn't matter. A resource can have both sets of extensions and be valid for both profiles.</p>",
        "id": 238192512,
        "sender_full_name": "Paul Church",
        "timestamp": 1620672361
    },
    {
        "content": "<p>So for the read interaction, GET base/Resource/id, which profile of the resource is returned? </p>\n<p>Some additional context: <br>\nAt present we don't use a FHIR Server to store the resource the data, we are making real time queries to our data sources.<br>\nWe have initially built the search type interaction and use includes/rev includes. But we are now looking into separate read interactions for each resource.</p>\n<p>We do not have different paths to the base URL for different IGs.<br>\nWe have two IGs that support a Pharmacy as an Organization: </p>\n<ol>\n<li>C4BB Pharmacy EOB references Organization.</li>\n<li>DaVinci Plannet Pharmacy represented as  an Organization.<br>\nWe may have consumers who are allowed access to one of these or both of these capabilities.</li>\n</ol>\n<p>We are also pulled data from different sources for historical claims than for for present/future network search. It is unlikely we would combine into a single representation.</p>\n<p>So we are wondering if using the same .id for both profiles is the desired status or if we should be giving distinct IDs per profile.</p>",
        "id": 238200862,
        "sender_full_name": "Kate Dech",
        "timestamp": 1620676065
    },
    {
        "content": "<p>I don't think you should be associating the same RESTful ID with two different instances of data.  If your C4BB Organization has different data from your DaVinci PlanNet Organization and they aren't stored as the same organization in your system, then they shouldn't have the same RESTful ID.</p>",
        "id": 238203460,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1620677168
    },
    {
        "content": "<p>If you have one organization and you're trying to meet two sets of requirements, then your one instance should simply meet the constraints of both profiles.  When someone does a GET they're not allowed to say \"give me this resource, but oh by the way, please make it comply with profile X\" - the expectation is that your data simply complies with all profiles you support.</p>",
        "id": 238209131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620679593
    },
    {
        "content": "<p>If the two profiles conflict, then you need to complain to the iG authors and get them to stop over-constraining the resources (e.g. inappropriately tightening cardinalities).</p>",
        "id": 238209187,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620679626
    },
    {
        "content": "<p>It would be nice if we had some kind of enforcement mechanism or at least well known best practices in the IG publication process to prevent that from happening. It is a reasonable follow-up question to say, if the normal practice works as long as profiles don't conflict, what stops the profiles from conflicting?</p>",
        "id": 238209691,
        "sender_full_name": "Paul Church",
        "timestamp": 1620679812
    },
    {
        "content": "<p>We have the <a href=\"http://build.fhir.org/ig/FHIR/ig-guidance\">http://build.fhir.org/ig/FHIR/ig-guidance</a> IG which is supposed to be a repository of such guidance - and at some point might even get balloted as an informative specification, but there hasn't been a lot of energy put into it in the last year or so...</p>",
        "id": 238210307,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620680066
    },
    {
        "content": "<p>As long as profiles do not explicitly prohibit elements it is pretty hard to have incompatibilities I believe? And that is discouraged - exactly for that reason</p>",
        "id": 238212555,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1620681000
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 238212611,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1620681011
    },
    {
        "content": "<p>(Even required / extensible binding to different value sets would be ok as long as the element is a CodeableConcept - you just use multiple codings)</p>",
        "id": 238212704,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1620681057
    },
    {
        "content": "<p>It's fine to prohibit an element that's a genuine error for the use-case.  For example, some patient profiles might say that Patient.deceased[x] is prohibited.  If you've got a patient who's deceased, that patient instance simply won't be valid against the profile.</p>",
        "id": 238213267,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620681231
    },
    {
        "content": "<p>How we will manage when consumer has access to one of the API  only (One FHIR Profile - da Vinci)? In that case shall the server returns the data  (Organization resource)for both the profiles (Da Vinci &amp; CARIN?</p>",
        "id": 238788379,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1621007822
    },
    {
        "content": "<p>Yes. There should be only one resource - matching both profiles</p>",
        "id": 238788577,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1621007903
    },
    {
        "content": "<p>The expectation is that your default interface returns all the data you have and that you filter the data a given recipient isn't allowed to have based on their authentication to the system.  The data is expected to be valid against the profiles the system supports, though \"what the receiver is allowed to access\" trumps that.</p>",
        "id": 238790222,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621008570
    }
]