[
    {
        "content": "<p>There was discussion at WGM regarding if Resource.identifier can be used for any identifier, or only identifiers known (magjic?) to be FHIR Resource identifiers. Where did this discussion conclude formally? If I can put any identifier in there, then I can simplify cases where today I have independent elements for FHIR Resources vs everything else, else I need to change some back...</p>",
        "id": 153869069,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485348544
    },
    {
        "content": "<p>There is no requirement that a Reference.identifier point to something that's exposed as a FHIR instance, but it must point to a business concept that *could* be exposed as a FHIR instance, and that instance would need to be of a FHIR resource type allowed by the reference.  So, for example, you could have a Reference(Observation|Procedure|MedicationAdministration) and send a Reference.identifier that was the identifier of a lab report that's only available on a piece of paper - because if we *were* ever to represent that lab result in FHIR, it would be an Observation.  But it wouldn't be ok to have the Reference.identifier be a patient's medical record number because, if instantiated in FHIR, the referenced concept would be a Patient - and that's not in the allowed list of resource types.  (I'm trying to think of an example of something that would have an identifier that simply couldn't be expressed as a FHIR resource, but that's proving rather difficult.  However, if you can come up with something, that wouldn't be allowed either :))</p>",
        "id": 153869186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485394660
    },
    {
        "content": "<p>so some examples from Provenance --- Where the source data used to create a Provenance.target resource... where that source data (Provenance.entity) is a CDA document, DICOM object, HL7 v2 message, etc... Or where Provenance.agent is a userID, or ProcessID, or applicationId (client ID), or Service URL.</p>",
        "id": 153869189,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485395237
    },
    {
        "content": "<p>Similar happen with AuditEvent</p>",
        "id": 153869190,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485395254
    },
    {
        "content": "<p>AuditEvent still has independent elements for FHIR vs non-FHIR; where as Provenance only has Reference... so one or the other needs to be improved... so we need to know which way to go.</p>",
        "id": 153869191,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485395302
    },
    {
        "content": "<p>John, I promised to turn this into a tracker item, since it's certainly not clear from the documentation what Resource.identifier is meant to point to, and I am not entirely sure there's full agreement on Lloyds statement (though I would agree with it).  I'll include a link to this discussion.</p>",
        "id": 153869494,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1485788011
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12725\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12725\">GF#12725</a></p>",
        "id": 153869495,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1485788430
    },
    {
        "content": "<p>I didn't think it pointed to anything.<br>\nMy understanding they were other identifiers that are relevant in the context of the unit, such as on patient the Social Security Number. (that doesn't point to anything)</p>",
        "id": 153869830,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1486076610
    },
    {
        "content": "<p>I think it would be wrong to use Reference.identifier to refer to something that is not a resource of the appropriate type. I thought I made clear in the documentation when I wrote it up</p>",
        "id": 153870160,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486354722
    },
    {
        "content": "<p>a CDA document is not an implicit binary resource.</p>",
        "id": 153870161,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486354742
    },
    {
        "content": "<p>I agreed with the rest of what Lloyd wrote</p>",
        "id": 153870162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486354752
    }
]