[
    {
        "content": "<p>Hello </p>\n<p>For app developers, if you connect someone to multiple sources of data how is that data resolved in the UI? How do we ensure that the information shown to a user has been reconciled internally, in a way to enable a common understanding of the data between patient and provider. Do we combine records (e.g. if we have multiple Patient records we combine the info, or we just pick one?)</p>\n<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> any thoughts?</p>",
        "id": 225316928,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612540762
    },
    {
        "content": "<p>We mostly try to deduplicate the data, and we indicate the source and the conflicts in some cases - but it is all custom logic depending on the kind of data</p>",
        "id": 225318184,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1612541187
    },
    {
        "content": "<p>I've been thinking about client-side de-duplication at lot recently.  Give the Cures rules, I am expecting that we'll see health systems (and payers) that will be exposing multiple FHIR endpoints for a single organization.  This was something called out in the ONC Cures rule as something they specifically wanted to enable:</p>\n<blockquote>\n<p>Token introspection will allow implementers of § 170.315(g)(10)-certified Health IT Modules to use API authorization servers and authorization tokens with various resource servers. This functionality has the potential to reduce complexity for implementers of § 170.315(g)(10)-certified Health IT Modules authorizing access to several resource servers and reduces the overall effort and subsequent use of § 170.315(g)(10)-certified Health IT Modules consistent with the goals of section 4002 of the Cures Act to enable the use of APIs without “special effort.” Although we do not specify a standard for token introspection, we encourage industry to coalesce around using a common standard, like OAuth 2.0 Token Introspection (RFC 7662).</p>\n<ul>\n<li><a href=\"https://www.federalregister.gov/d/2020-07419/p-1256\">https://www.federalregister.gov/d/2020-07419/p-1256</a></li>\n</ul>\n</blockquote>\n<p>This means that for single-organization, multi-endpoint access, clients will likely need to be performing some level of de-duplication, as it seems unlikely that individual FHIR servers will be able to perform on-the-fly de-duplication of their API content based on what other API servers in the same enterprise are returning.</p>",
        "id": 225319185,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1612541613
    },
    {
        "content": "<p>Once we can get point to point communications figured out, I do not see the need to deduplicate if we only consider data from trusted sources. The point of care source can determine the relevant patient record. So if you are connecting to healthsystem x, you use the patient record from healthsystem x.</p>",
        "id": 225323979,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612543686
    },
    {
        "content": "<p>secondary sources (like a file artifact converted to clinical data) will cause duplication.</p>",
        "id": 225324271,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612543809
    },
    {
        "content": "<p>Data gets duplicated into source systems.  For example, the same lab report may well be stored in the systems of numerous hospitals.  Patient systems and others will almost never be able to directly query the lab.  It has nothing to do with 'trust', it has to do with the fact that information propagates, and that information is shared from wherever it propagates to.</p>",
        "id": 225327293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612544976
    },
    {
        "content": "<p>Not sure what you mean by \"point to point\" communications.  Most of what we're trying to enable with FHIR interfaces is \"pull\" communications, where the system who wants data queries for it from whatever systems they have access to.</p>",
        "id": 225327435,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612545027
    }
]