[
    {
        "content": "<p>I have a use case where a change request is submitted about some FHIR data. An example would be to propose the addition of a new contraindication for a medicine (with a named proposer, supporting evidence etc). The idea being that these changes are manually governed. The proposed changes are reviewed (by a human) and the changes may be approved or rejected. What resource (or operation etc) could represent a request to change data?</p>",
        "id": 153966822,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1528158056
    },
    {
        "content": "<p>so a long time ago, I wrote this:</p>",
        "id": 153966829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528160866
    },
    {
        "content": "<p><a href=\"http://wiki.hl7.org/index.php?title=FHIR_Colloborative_Review_Implementation_Guide\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Colloborative_Review_Implementation_Guide\">http://wiki.hl7.org/index.php?title=FHIR_Colloborative_Review_Implementation_Guide</a></p>",
        "id": 153966830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528160925
    },
    {
        "content": "<p>but now I read it, I see it's a slightly different</p>",
        "id": 153966831,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528160933
    },
    {
        "content": "<p>so there's a the ability to have a patch resource that describes changes to a resource.</p>",
        "id": 153966832,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528160954
    },
    {
        "content": "<p>and the standard tools can generate the patch for a user</p>",
        "id": 153966833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528160968
    },
    {
        "content": "<p>The resource to request state changes is Task.  It would presumably make sense to use it for updates too, though there's no mechanism to easily convey what changes are desired.</p>",
        "id": 153966851,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528164357
    },
    {
        "content": "<p>Thanks Grahame, that does look a lot like our use case actually. I think in that case the Questionnaire would say \"What do you want to change\", \"how do you want to change it\" and \"why is it necessary\" etc. We would need more than just a list of deltas, because we need things like rationale for change, and some sort of status (review steps completed) etc. The process itself wants to be trackable, which points to having a resource rather than just something throwaway like a patch structure. Questionnaire is long lived, being a resource, but has the disadvantage of being very open, and not structured around change/review processes as such. OTOH patch is very specific to changes but it not process oriented.</p>\n<p>Perhaps we need Questionnaire, or patch, but with another resource to track the process. So I am now wondering about Task or perhaps ProcessRequest.</p>\n<p>[as I sent this I noticed I had not seen your reply Lloyd, seems to be along similar lines]</p>",
        "id": 153967017,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1528194297
    }
]