[
    {
        "content": "<p>The planning team for the FHIR Value-Based Care Summit in April are trying to assess interest level for a Resource Subscription track at the event. Would the community be interested in seeing any scenarios around resource subscription run at this event?</p>",
        "id": 153876205,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1489420096
    },
    {
        "content": "<p>Hi Bryn, as lead for the Care Plan track at this mini-connectathon, we have a very keen interest in prototyping and testing resource subscription related to care plan additions/modifications.  The wiki home page for this Value-Based Care mini-connectathon is here: <a href=\"http://wiki.hl7.org/index.php?title=Value-Based_Care_FHIR_Mini-Connectathon_201704\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Value-Based_Care_FHIR_Mini-Connectathon_201704\">http://wiki.hl7.org/index.php?title=Value-Based_Care_FHIR_Mini-Connectathon_201704</a></p>",
        "id": 153876215,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1489420774
    },
    {
        "content": "<p>That would be great, do you have/know of any one with technical resources and capacity to either lead the track or head up those aspects as part of a scenario on one of the other tracks?</p>",
        "id": 153876218,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1489421083
    },
    {
        "content": "<p>I would like to engage HSPC and their sandbox w/ related services to to support subscriptions scenarios. I will see you at the HSPC meeting in 2 weeks. Given that HSPC sandbox is based on HAPI server, my understanding is that HAPI currently supports only socket-based subscription, correct?</p>",
        "id": 153876219,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1489421567
    },
    {
        "content": "<p>That's my understanding as well, but I know of work to add other functionality along these lines, perhaps we could get that plugged in by that time. <span class=\"user-mention\" data-user-id=\"192233\">@Travis Cummings</span> thoughts?</p>",
        "id": 153876226,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1489424644
    },
    {
        "content": "<p>I feel that a rest-hook channel would be most helpful.  I am interested in notifications to mobile apps.  With rest-hook (for demo-only purposes), I've thought about creating a notifications server instance that could receive the notification POSTs.  Apps could then poll for pending notifications.  Maybe a good topic for the upcoming SMART on FHIR dev meeting in NOLA?</p>",
        "id": 153876228,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1489425246
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span> , the HSPC sandbox does have some limited subscription support from FHIR-16 where we used the \"email\" channel for your team.  The HSPC sandbox does also have some limited support for rest-hook, but we were hoping to gain a solution provided by Hapi.  Can you elaborate on your scenario?  <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> , any update on rest-hook being supported in Hapi?</p>",
        "id": 153876232,
        "sender_full_name": "Travis Cummings",
        "timestamp": 1489426194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span> for the NOLA meeting, would you hope for subscription as a formal presentation, or a side discussion?  </p>",
        "id": 153876233,
        "sender_full_name": "Travis Cummings",
        "timestamp": 1489426345
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192233\">@Travis Cummings</span> for NOLA meeting, a side discussion should be sufficient, although I may raise this subscription capability as part of wider HSPC platform discussinos earlier in the week.  I'll elaborate shortly on scenario ideas, and open to suggestions.</p>",
        "id": 153876235,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1489427385
    },
    {
        "content": "<p>Will this be based on the (what will have been released final) STU3 (v3.0.0) version of FHIR, or the 1.9 January connectathon build?<br>\nAt least Grahame's and my server will be on 3.0.0, some of the others not sure.<br>\nThe wiki page is not specific about it (and does reference the Jan connectathon page too)</p>",
        "id": 153878056,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1489882367
    }
]