[
    {
        "content": "<p>Is there a common way for historic records as Resources to be indicated as merged? For example Observation1 and Observation2 have been determined to be duplicates and thus one stays active, the other Dup, with links for record keeping? I don't see a Observation.status to use. I guess Provenance could link and record facts.</p>",
        "id": 166188746,
        "sender_full_name": "John Moehrke",
        "timestamp": 1558456506
    },
    {
        "content": "<p>I don't yet grasp Provenance well, but wouldn't this be a job for Provenance.entity.role ? Would entity.what not link to 2 resources in that case?</p>",
        "id": 166205496,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558467551
    },
    {
        "content": "<p>An interesting case would be a resource (eg observation) that is altered after merging a previous version of itself with another resource.</p>",
        "id": 166205663,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558467678
    },
    {
        "content": "<p>Not pushing for that case - I think 'normal' merging is a valid use case, I just wanted to explore the boundaries</p>",
        "id": 166205758,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558467736
    },
    {
        "content": "<p>Provenance could certainly do it.. but I think relying on Provenance might be too clunky. For example if I am querying a service that has combined results from many organizations, it will likely have many instances of an AllergyIntollerance that the patient reported. Being able to combine duplicates and return only ONE would be desirable, with Provenance around to enable workflows where someone questions if the merge was proper. I use AllergyIntollerance, but the use-case appears with ANY data that is combined from multiple sources (reconcilliation workflow. Automated and/or manual).   Note that IHE does use Provenance this way in three different profiles -- QEDm, mXDE, and RECON.. So I am looking for MORE than what Provenance can do... Even just being able to mark the status element as 'duplicate', would make it disapear from a query on 'active'.</p>",
        "id": 166272021,
        "sender_full_name": "John Moehrke",
        "timestamp": 1558534907
    },
    {
        "content": "<p>Linkage resource?</p>",
        "id": 168923736,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1561456263
    },
    {
        "content": "<p>I would agree with Brain that Linkage resource would be a better suited resource for maintaining a list of related resources. If the FHIR server supports resource versioning, then the Linkage instance could provide some limited historical recording on merge activities, but I would argue that the Provenance resource would provide better context over time as there would exist multiple Provenance instances created for merge activities with each referencing the same Linkage instance.</p>",
        "id": 168993157,
        "sender_full_name": "John Hrovat",
        "timestamp": 1561513710
    }
]