[
    {
        "content": "<p>Hi,</p>\n<p>We are trying to map the KDQOL (Kidney Disease Quality of Life) survey to FHIR. This survey should be periodically taken by the patient (once in a year).<br>\n  QuestionnaireResponse seems to be an appropriate resource for this survey.<br>\n  But the survey could be denied or there could be an exclusion provided by the patient from taking the survey for the below reason.<br>\n1) Patients under age 18<br>\n2) Those who cannot complete a KDQOL-36 due to cognitive impairment, dementia, active psychosis<br>\n3) Non-English speakers/readers (for whom there is no native language translation or interpreter)<br>\n4) Patients under the facility’s care for less than 3 months<br>\n5) Patients who refuse to complete the KDQOL-36<br>\nIf the patient chooses to get excluded or denies taking the survey, one of the above reason should be chosen.</p>\n<p>We wanted input from the FHIR experts on the apprpriate resource that can be used to map the KDQOL survey and which field will be suitable to hold the refusal/exclusion status and the reason.</p>\n<p>Thanks,<br>\nManju</p>",
        "id": 153889925,
        "sender_full_name": "Manju Sampath",
        "timestamp": 1494867500
    },
    {
        "content": "<p>isn't that just a question in the questionnaire?</p>",
        "id": 153890157,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495000601
    },
    {
        "content": "<p>No, it is not a part of the KDQOL survey questions. If the patient is not willing to answer the survey, the reason for refusal/exclusion alone will be obtained from the patient.<br>\nSample KDQOL survey: <a href=\"https://www.rand.org/content/dam/rand/www/external/health/surveys_tools/kdqol/KDQOLukq.doc\" target=\"_blank\" title=\"https://www.rand.org/content/dam/rand/www/external/health/surveys_tools/kdqol/KDQOLukq.doc\">https://www.rand.org/content/dam/rand/www/external/health/surveys_tools/kdqol/KDQOLukq.doc</a></p>",
        "id": 153890224,
        "sender_full_name": "Manju Sampath",
        "timestamp": 1495035610
    },
    {
        "content": "<p>Communication?</p>",
        "id": 153890229,
        "sender_full_name": "Eric Haas",
        "timestamp": 1495038634
    },
    {
        "content": "<p>So you've got a standing \"request\" and you'll either have a fulfilling questionnaire resposne or a record indicating why there isn't a questionnaire response.  For some event resources (Immunization, Procedure), we have the ability to indicate that something wasn't done and why.  For a questionnaire, you could use Observation, though we don't have a \"core\" way of explaining why the observation wasn't done.  You might submit a change request for that.  Another possibility is to use Task.  That's more of a workflow mechanism where you can indicate the state of progress of a request, including that a decision was made to not act and why</p>",
        "id": 153890234,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495039375
    },
    {
        "content": "<p>I think it should be an additional question in the questionnaire</p>",
        "id": 153890309,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495050814
    },
    {
        "content": "<p>This to me does seem like a valid questionnaire response standard extension. As it could permit the QR to be saved and skip parts of validation</p>",
        "id": 153890325,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1495056435
    }
]