[
    {
        "content": "<p>If I want to model an organization, within a region of a province/state, that is manged by an larger organization within a province/state,  should I use district/state/country of  the address component, or are there cases where it is more appropriate/necessary to model that structure with resources for each entity and if so, what would those resources be?</p>",
        "id": 208755761,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1598998452
    },
    {
        "content": "<p>OrganizationAffiliation or Organization.partOf are the usual ways to link a smaller organization to the organization that's responsible for it.  HealthCareService allows indicating a region.  Organization itself doesn't have an element to define it's regional area of influence, though you could use an extension for that (or perhaps propose that a standard one be defined).</p>",
        "id": 208771911,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599012192
    },
    {
        "content": "<p>What is the process for making proposals and where do I go to start that process?</p>",
        "id": 208839025,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1599059431
    },
    {
        "content": "<p>At the bottom of every page in the spec is a \"propose a change\" link.  That will take you to HL7's Jira site.  You'll need to register (which is free - we use it to verify you're not a spammer).  After that you can propose changes to your heart's content :)</p>",
        "id": 208840193,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599059819
    },
    {
        "content": "<p>...but you can create and use your own extension without having to go through HL7</p>",
        "id": 208840305,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1599059869
    },
    {
        "content": "<p>and also it's good to just float your ideas here for what you are intending to propose, so you can get quick feedback</p>",
        "id": 208842944,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1599060763
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Can we pass (Health) Plan Code in HealthcareService.identifier for Plan Specific Search for HealthcareService endpoint? Da Vinci Plan-Net reference server had a search parameter for HealthcareService.eligibility.code but I don't see it anymore. TIA.</p>",
        "id": 215509914,
        "sender_full_name": "Dave Shekhar",
        "timestamp": 1604437501
    },
    {
        "content": "<p>HealthService.identifier is going to be specific to a single type of service at a single organization offered by a single organization.  It's not the same as a generic plan code that might be shared across multiple services offered at different sites or by different organizations.  Is there a reason why you wouldn't map that to HealthcareService.type?</p>",
        "id": 215511863,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604438634
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Healthcareservice.type is being taken from <a href=\"https://www.hl7.org/fhir/valueset-service-type.html\">https://www.hl7.org/fhir/valueset-service-type.html</a>. We need to pass Plan ID for Plan specific HealthcareService search.</p>",
        "id": 215512983,
        "sender_full_name": "Dave Shekhar",
        "timestamp": 1604439289
    },
    {
        "content": "<p>HealthcareService.type has an example binding.  You're free to send whatever codes you wish.  (You can also send multiple codings, representing translations of the service in different code systems).</p>",
        "id": 215513662,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604439764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   Thanks Lloyd. So does this search URL looks OK? I am passing Payer specific PlanID and Plan type of Pharmacy: <a href=\"http://localhost:8080/fhir/HealthcareService?service-type=htpps://my.codesystemurl.com|myPlanID&amp;service-type==http://hl7.org/fhir/ValueSet/service-type|Pharmacy\">http://localhost:8080/fhir/HealthcareService?service-type=htpps://my.codesystemurl.com|myPlanID&amp;service-type==http://hl7.org/fhir/ValueSet/service-type|Pharmacy</a></p>",
        "id": 215515178,
        "sender_full_name": "Dave Shekhar",
        "timestamp": 1604440863
    },
    {
        "content": "<p>I'm going to take a step back for a second.  When you have a payer specific plan id, are you wanting to say \"does this service accept medicaid?\" or \"Does this service accept payer ABC coverage XYZ?\" or are you wanting to say \"does this service do medication reconciliation?\"</p>",
        "id": 215522020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604444556
    },
    {
        "content": "<p>I am implying the second option - \"Does this service accept payer ABC coverage XYZ?\" Give me ALL HealthcareService (type = Pharmacy) covered by Payer ABC with Medical Plan Id = myPlanID (Pharmacy Directory stream). The requestor has already done InsurancePlan search based on Zip Code and selected a plan from list of Medical Plans sent as response to InsurancePlan call.</p>",
        "id": 215523222,
        "sender_full_name": "Dave Shekhar",
        "timestamp": 1604445447
    },
    {
        "content": "<p>Ah.  Ok.  Right now, there's no standard way to do that.  It would need to be an extension.  It <em>might</em> be a candidate for a standard extension.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> thoughts?</p>",
        "id": 215542009,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604466320
    },
    {
        "content": "<p>There is also the insuranceplan resource that would hold the plans for an Organization. No linkage to a specific service though. <a href=\"http://hl7.org/fhir/insuranceplan.html\">http://hl7.org/fhir/insuranceplan.html</a></p>",
        "id": 215550803,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1604477285
    },
    {
        "content": "<p>Lloyd:  Da Vinci Plan-Net has defined a Profile for HealthcareService. But there also that use case is not in the IG so far. I was thinking to use HealthcareService.eligibility.code to pass Payer ABC's Medical Plan Id. But neither FHIR nor Da Vinci Plan-Net IG doesn't support that search params (I think it was being supported at both places till few weeks back). So the sample request endpoint I provided you above based on your suggestion - seems to be appropriate at this time (if not going for use of extension). IF it doesn't seem to be grossly FHIR non-complaint, will like to go ahead with that for \"Plan specific use case\". Putting it here again, let me know: <a href=\"http://localhost:8080/fhir/HealthcareService?service-type=htpps://my.codesystemurl.com|myPlanID&amp;service-type==http://hl7.org/fhir/ValueSet/service-type|64\">http://localhost:8080/fhir/HealthcareService?service-type=htpps://my.codesystemurl.com|myPlanID&amp;service-type==http://hl7.org/fhir/ValueSet/service-type|64</a></p>",
        "id": 215589936,
        "sender_full_name": "Dave Shekhar",
        "timestamp": 1604501123
    },
    {
        "content": "<p>In looking at HealthcareService.eligibility, it seems focused on \"who is eligible to receive the service\" rather than \"whose insurance do we accept\".   My leaning is that for the latter, you need a distinct element, probably an extension (and associated search parameter).</p>",
        "id": 215607696,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604508082
    },
    {
        "content": "<p>Hi All,<br>\nHow can we implement the bundle concept with the fhir resources.</p>",
        "id": 241118492,
        "sender_full_name": "Steffy Thankam Wilson",
        "timestamp": 1622622013
    },
    {
        "content": "<p>Can you expand on where you're running into trouble?  Have you looked at the examples in the spec?  Implement using what platform?</p>",
        "id": 241150101,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622641281
    }
]