[
    {
        "content": "<p>What resource should be used to store some credit cards and insurance card? <br>\nAccount should be used for it or I need to create one for each card?</p>",
        "id": 188055409,
        "sender_full_name": "Jorge Yero",
        "timestamp": 1581543330
    },
    {
        "content": "<p>There is a resource InsurancePlan. I don't know about credit card. Saving credit card number is not a good idea.</p>",
        "id": 188056370,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1581544051
    },
    {
        "content": "<p>Credit cards would typically be captured using Account</p>",
        "id": 188062346,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581548873
    },
    {
        "content": "<p>That answers where to store credit cards. You may want to talk to the banking industry's security experts about _how_ to store credit cards, unless there's someone working on overall FHIR security...</p>",
        "id": 188066578,
        "sender_full_name": "Joe Kesselman",
        "timestamp": 1581552542
    },
    {
        "content": "<p>Hello Guys</p>",
        "id": 188080009,
        "sender_full_name": "sandeep nani",
        "timestamp": 1581572557
    },
    {
        "content": "<p>Can i get FHIR and DICOM Resources list</p>",
        "id": 188080019,
        "sender_full_name": "sandeep nani",
        "timestamp": 1581572574
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"263756\">@sandeep nani</span> Per the guidance in the FHIR rules for asking questions i asked you to look at, what effort have you already undertaken to answer this question yourself?  (The list of FHIR resources is clearly linked at the top of the FHIR specification.)  Also, DICOM is a completely different standard than FHIR and is managed by a different organization.  If you're interested in FHIR resources that are DICOM-relevant, the answer would be Media, ImagingStudy and Diagnostic report.  If you want information specifically about DICOM, you'll need to ask somewhere other than <a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a>.</p>",
        "id": 188080432,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581573186
    },
    {
        "content": "<p>Ok</p>",
        "id": 188080574,
        "sender_full_name": "sandeep nani",
        "timestamp": 1581573380
    },
    {
        "content": "<blockquote>\n<p>Credit cards would typically be captured using Account</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Account is used to store only one credit card or Can i store all credit cards in a account, if I store all in the same Account how could I know which card was used when reference to the account?</p>",
        "id": 188108656,
        "sender_full_name": "Jorge Yero",
        "timestamp": 1581602688
    },
    {
        "content": "<p>You would need one card per account.  Each card would have its own information and different charges might be posted to different cards - different accounts is the only way to manage this</p>",
        "id": 188113534,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581605995
    }
]