[
    {
        "content": "<p>For a particular FHIR server, is there an expectation that the id of a particular resource will remain the same over time?  Or might the administrator of the server reload their data and (intentionally or not) assign the resource a new id?</p>",
        "id": 201889922,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1593025444
    },
    {
        "content": "<p>The expectation is that the id will remain the same.  Furthermore, the id <em>must</em> always resolve to the same instance.  If the id changes, then any links to the resource from external systems will break.  If the id changes to another id that used to exist, then external references will resolve to the same thing.  It's the same principle as \"should web pages keep the same name\" - if you rename your web pages you'll at best create broken links and at worst, have external links that now take you to the wrong page.</p>",
        "id": 201895015,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593028239
    },
    {
        "content": "<p>by definition, the Id and type are immutable. you cannot 'change' them - you create a new resource when you do.  It's a definitional question</p>",
        "id": 201898672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593030066
    },
    {
        "content": "<p>Okay, I can see the importance of that, but then I am not sure why the ability to PUT a resource with a particular id is optional.  I don't see how a FHIR server that doesn't allow you to set the id, but just generates them on its own, would be able to preserve the meaning of ids if you have upgrade to a new version and reload your data.</p>",
        "id": 201919382,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1593043933
    },
    {
        "content": "<p>indeed, it wouldn't. But some FHIR servers wouldn't let you do that anyway.</p>",
        "id": 201919928,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593044537
    },
    {
        "content": "<p>lots of them, in fact</p>",
        "id": 201919931,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593044544
    },
    {
        "content": "<p>Allowing assignment of id by a client means that you trust clients to do that appropriately - and generally means the ids would need to be GUIDs.</p>",
        "id": 201923222,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593048059
    },
    {
        "content": "<p>Given that many repositories are legacy databases, that's not necessarily always reasonable.</p>",
        "id": 201923236,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593048083
    },
    {
        "content": "<p>Hi Team,</p>\n<p>In one of the scenario, I need ti generate ID of a resource dynamically which I was able to achieve. But I need to have a static prefix in the ID field (so id of a  resource might look patient1), is it possible? if yes, could you please let me know how.</p>",
        "id": 203352454,
        "sender_full_name": "Venkat",
        "timestamp": 1594273333
    },
    {
        "content": "<p>You're in charge of what resource ids you assign based on your internal persistence model.  FHIR cares about the format - it has to match the constraints of the 'id' type in terms of characters and length, but what algorithm you use to assign it for data stored on your system is up to you.  You have no ability to control what ids look like on other systems though.</p>",
        "id": 203389099,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594303400
    }
]