[
    {
        "content": "<p>Hi, based on HL7GForge items [#16947], I realised that ResourceItem has been dropped from FHIR data model in 2018-May. I already started a new topic in  <a href=\"http://community.fhir.org\" target=\"_blank\" title=\"http://community.fhir.org\">http://community.fhir.org</a> about the opportunity to reintroduce the specific resource.<br>\nWe started last year developing a clinical collaboration platform based on FHIR and we cover several IHE transactions including pharmacy-logistics use cases and we based the development on the “ResourceItem” that was available in FHIR 3.5. Now we are moving the platform to support FHIR R4 and this resource is no more available. <br>\nWe agree on the fact that for closed loop medication management is much better to use the real resource specific (medication/device) and not an abstract one and we definitely already do like that.<br>\nIndeed, despite of our CPOE module regularly adopts catalogs, medication and device resources, the aim of the logistic one is to track all the items inside the hospital till the effective administration to the patient and needs a more generic approach. The abstraction provided by the resource “ItemInstance” itself is great for this use case because it can easily manage not only devices, medications, specimens, etc, but also the container such as Rolls, Boxes and Packages that are used to delivery these items among locations (pharmacy, wards [Fridges],[Cabinets],[shelves] and [carts]).</p>",
        "id": 157277802,
        "sender_full_name": "vania manzelli",
        "timestamp": 1548947064
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span></p>",
        "id": 157277999,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548947232
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191665\">@vania manzelli</span> good point and good timing.<br>\nWe are now having discussions on \"Healthcare Product\" which should the same purpose, and it is great that you are looking at this from a broader operations perspective. So let me ping <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>, <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> who have taken part of the discussion. We also looked at Catalogs and Lorraine and I believe <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> and myself are having the same approach as you indicate - while specific resources are good for staying within a workflow, when it comes to distribution and catalogs, that specificity brings issues.</p>",
        "id": 157334971,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549005296
    },
    {
        "content": "<p>btw, IHE Pharmacy is preparing a white paper for Supply and the approach is to \"supply an item, and we don't really care about defining when an item is called a medication or a device, or if it is a consumable or printer paper\". The Supply profiles are looking at GS1 transactions because the GS1 model is established and is very simple - you can have an item which is inside a box which is another item, which is inside a carton which is another item...</p>",
        "id": 157335070,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549005442
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , good to know, I see that you are in the IHE Pharmacy's technical committe, may I expect that the white paper will suggest the usage of a generic \"ResourceItem\"? is there any draft version of the document? may me and my team contribute somehow?</p>",
        "id": 157356471,
        "sender_full_name": "vania manzelli",
        "timestamp": 1549031655
    },
    {
        "content": "<p>Hi Vania. In the white paper we will only describe the requirements and flows - but we will mention clearly that \"supply\" can be for medication, devices or other products.</p>",
        "id": 157483304,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549227436
    },
    {
        "content": "<p>the IHE white paper is only the analysis, then the IHE Profiles will specify a solution.</p>",
        "id": 157483308,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549227457
    },
    {
        "content": "<p>There, we will start with GS1, which has a generic \"tradeItem\" resource. We look forward to have the health product discussion handled in FHIR when we want to support intra-institutional supply (all aspects related to supply inside hospital, not only delivery, but also inventory, etc.)</p>",
        "id": 157483358,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549227537
    },
    {
        "content": "<p>that is a requirement that we can bring up - when supplying stuff, it is important NOT to force the implementers to choose between a device or medication.</p>",
        "id": 157483430,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549227642
    },
    {
        "content": "<p>See the IHE Uniform Barcode Processing profile that <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> has written. It shows GS1 use with FHIR <a href=\"https://wiki.ihe.net/index.php/Uniform_Barcode_Processing\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/Uniform_Barcode_Processing\">https://wiki.ihe.net/index.php/Uniform_Barcode_Processing</a></p>",
        "id": 157521961,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549286340
    }
]