[
    {
        "content": "<p>Hello, </p>\n<p>Would we say that versioning is non-standard behavior, even within immutable resources? There are some resources within the financial model in FHIR R4 that are considered immutable. An example is the ExplantionOfBenefit Resource, which is immutable once the status becomes \"Active\" but it references several other resources that do not have this restriction. This has led some to believe that either contained resources or versioned resource references must be used instead of standard resource references. I wanted to see if the community had any thoughts on this topic. </p>\n<p>Thanks!</p>",
        "id": 185831533,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1579192089
    },
    {
        "content": "<p>The decision to use contained or non-contained resources should not be made upon a criteria such as the data being immutable. In general it's up to senders and receivers to agree upon that which is considered to be immutable (or not). An implementation guide could document such an agreement. A security tag (as part of a resources meta) may help to enforce/assist such an agreement. We (as a global FHIR community) should be hesittant to the extreme to make statements about the immutability of resources, unless we're very very very certain that some things are indeed immutable across all jurisdictions and scenarios.</p>",
        "id": 185833407,
        "sender_full_name": "René Spronk",
        "timestamp": 1579193047
    },
    {
        "content": "<p>Contained is driven by whether the data can exist and be maintained independently and has independent identity.</p>",
        "id": 185835375,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579194125
    },
    {
        "content": "<p>Thanks, I am in agreement with these comments. I was looking for a way to communicate that just because the ExplanationOfBenefit resource is immutable that does not imply any special restrictions on resource references.</p>",
        "id": 185841476,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1579197663
    },
    {
        "content": "<p>Maybe a business requirement for immutability would be best met with an immutable bundle of the resource and its references.</p>",
        "id": 186079343,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1579505944
    }
]