[
    {
        "content": "<p>I am trying to determine which resource is best for communicating Providers for the PACE program. In PACE, a provider can be a person or an organization. My two option at the moment are to use the Practitioner resource for either type ( a person provider or an organization provider), or use a reference element where it can either be a Practitioner resource or an Organization resource. Is one a better practice, over the other? or is there a better approach?</p>",
        "id": 178978343,
        "sender_full_name": "Al Buchala",
        "timestamp": 1571939515
    },
    {
        "content": "<p>why not either of them? Not clear to me why you would need to allow only one type of resource. I would also include PractionerRole as that shows a relationship between a Practitioner and an Organization, so it covers two answers in one.</p>",
        "id": 178978503,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571939615
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , I realized I wasn't clear, my apologies. In PACE, the Provider is one single resource which holds information about either a  person or organization. For example, when requesting a list of Providers, it would contain a mix of people and organizations.</p>",
        "id": 178986046,
        "sender_full_name": "Al Buchala",
        "timestamp": 1571943946
    },
    {
        "content": "<p>You can use PractitionerRole to point to either or both</p>",
        "id": 178986869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571944526
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . I just looked into the PractitioinerRole resource, and I think it will work.</p>",
        "id": 178987925,
        "sender_full_name": "Al Buchala",
        "timestamp": 1571945156
    },
    {
        "content": "<p>in a FHIR context one could have a query that returns a bundle of resources where the bundle can contain many Practitioner, PractitionerRole, and/or Organizations. Each type of resource is self describing in a FHIR context.</p>",
        "id": 178991576,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571947459
    },
    {
        "content": "<p>It sounds like the pace system stored orgs and pracs in the same table?<br>\nSome systems I've worked with do this too, and does make it messy.<br>\nReally should be 2 types as you've noted. And practitioner role doesn't cover the org only answer.</p>",
        "id": 178998329,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571951650
    },
    {
        "content": "<p>PractitionerRole lets you point to an Organization without specifying a Practitioner or a specialty.  There's a slight semantic difference between saying \"Someone from this Organization is responsible\" vs. \"This organization is responsible\", but that doesn't matter in many cases <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 179011457,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571963122
    }
]