[
    {
        "content": "<p>Could someone verify if I've understood this correctly:<br>\nWhen you restrict cardinality in a profile to max: \"0\", which interpretation is correct:</p>\n<p>\"My system will not accept the resource with this attribute\"<br>\nor  is it<br>\n\"My system will not ever return the resource with this attribute\"<br>\nor<br>\n\"My system will accept the resource with this attribute, but we will not use or persist the attribute, though the rest of the resource can be persisted\"</p>\n<p>Or am I completely off?</p>\n<p>Thank you</p>",
        "id": 153963258,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1526566038
    },
    {
        "content": "<p>Restricting the cardinality is  something you do in a profile. Now, there are various ways for systems to describe their relationships with and conformance to profiles. For  example:</p>\n<ul>\n<li>\n<p>List it in <code>CapabilityStatement.rest.resource.profile</code>:  this indicates restrictions on data the server takes (as input) and returns (as output). All resources of this type must meet the profile. (Now, on incoming data, the server _could_ decide to turn invalid data (containing the prohibited element) into valid data (e.g. by stripping the prohibited element), but it would need to be really sure that was safe. I'm not sure I'd recommend it.)</p>\n</li>\n<li>\n<p>List it in <code>CapabilityStatement.rest.resource.supportedProfile</code>: this indicates that the profile is <em>supported</em> by the server, meaning that the server expects to expose or consume some data according to the profile -- but it needn't apply to <em>all</em> resources of the indicated type.</p>\n</li>\n</ul>",
        "id": 153963269,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1526566430
    },
    {
        "content": "<p>It is intended to represent the former for sure.  It can be used to indicate the second, though that can also be indicated by just marking the element as mustSupport=false.  The third is handled by mustSupport=false.</p>",
        "id": 153963283,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526567590
    },
    {
        "content": "<p>As a rule, only constrain max cardinality if it's an error for the data to exist and it's not something you can just ignore and throw away.</p>",
        "id": 153963284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526567616
    },
    {
        "content": "<p>Ok great, thanks guys.</p>",
        "id": 153963296,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1526570998
    }
]