[
    {
        "content": "<p>Given a REST endpoint for <code>Observation</code> where numerous profiles exist, what are the expected ways for the various interactions to specify the desired profile for the interaction?</p>\n<p>I know the CapabilityStatement provides the 0..* <code>supportedProfiles</code> data element to document the supported profiles. I know the <code>Meta.profile</code> can be used in returned content to assert conformance to a specific profile. I know that the <code>_profile</code> search parameter can be used to search for resources that are tagged as to conforming to a specifc profile.</p>\n<p>Given a FHIR server that is a facade for a datastore (legacy EHR, legacy database, etc.) where data is NOT stored as FHIR objects, and where data for \"vital signs\" data is stored in different tables than \"bmi\" data. What are the recommended or best practices for handling these different profiles? </p>\n<p>I understand that we should use <code>Meta.profile</code> in the response and that for search that we can use <code>_profile</code> search parameter in the request. </p>\n<p>How should the read/update/patch/create interactions specify the desired/intended profile (e.g. observation-vitalsigns vs observation-bmi) for data validation purposes and for the endpoint to make the correct decisions about which tables to use?</p>",
        "id": 173367883,
        "sender_full_name": "Joe Paquette",
        "timestamp": 1565957321
    },
    {
        "content": "<p>generally, you should do this sort of thing by code, rather than by profile</p>",
        "id": 173372300,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565961628
    },
    {
        "content": "<p>profiles tend to be rather exclusive and not re-usable. So we recommend that you use them as little as possible</p>",
        "id": 173372332,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565961667
    },
    {
        "content": "<p>We know we need to handle this in code, but US Core has 2 DiagnosticReport profiles and 3 Observation profiles for which we must be conformant. We're trying to understand how a requester can communicate their intent for the data they are providing/requesting, for example, is for \"Pediatric Weight for Height\" vs \"Smoking Status\" observations? In this particular example, we can probably discern which is which by looking at the provided <code>code</code> data elements, but we cannot be sure the provided codes are valid or uniquely identify which profile to use for validation purposes. And. we're not sure this approach can be used universally for all resources based on various IGs/Profiles against which we must be conformant.</p>",
        "id": 173374044,
        "sender_full_name": "Joe Paquette",
        "timestamp": 1565962831
    },
    {
        "content": "<p>well, you get to circular logic this way. if the client claims that it's conforming to a profile, you can check that. If it doesn't... then you don't validate it. So what did you achieve?</p>",
        "id": 173374307,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565963064
    },
    {
        "content": "<p>if you have an actually functional server, then it knows what it needs for the different observations - by code - and can enforce appropriately</p>",
        "id": 173374331,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565963102
    },
    {
        "content": "<p>I understand that for Observation, we can discern by <code>code</code>.  For DiagnosticReport, we can discern by <code>category</code>. </p>\n<p>For the general case, we were wondering if there was a \"best practices\" way for requesters to indicate intent about the data they are providing when profiles are required for conformance. </p>\n<p>It appears the answer is that there is not a \"best practices\" way.  Instead, we will need to look at all supported profiles for a specific resource to figure out how to distinguish among them.</p>",
        "id": 173377117,
        "sender_full_name": "Joe Paquette",
        "timestamp": 1565965271
    },
    {
        "content": "<p>well, there are two definite best practices I can state:<br>\n- \"intent\" should never be derived only from the profile<br>\n- hanging processing off a profile makes for easy implementation in the short term but fragile implementation in the long term, and you're trading between those</p>",
        "id": 173402622,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565985208
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"211704\">@Joe Paquette</span> I'm not sure why you're thinking of determining this by <code>code</code> for Observation and <code>category</code> for DiagnosticReport?  Both elements are present and function essentially the same in both resources - <code>code</code> provides the specific observation or report, and I would think you would want to use <code>code</code> for both.</p>",
        "id": 173409413,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565991415
    }
]