[
    {
        "content": "<p>Hello</p>\n<p>I have a client, consuming my FHIR web services. He retrieves (search functionality) multiple linked resources. Say Encounter and Observations.<br>\nThen I provide him a bundle containing both Encounters and Observations.</p>\n<p>My client complains because he needs to join  Observations to the Encounter on his client side himself. He would like to get labs nested into Encounters.</p>\n<p>1) is there any way to nest resources together (put the resources in place of \"reference\")<br>\n2) Have you any thought about the FHIR API design, and is there any reason not to provide resources as nested ?</p>\n<p>Thanks by advance</p>",
        "id": 153896866,
        "sender_full_name": "natus",
        "timestamp": 1499962287
    },
    {
        "content": "<p>The reason we don't provide them as nested is because there'll be situations where Observations are retrieved on their own and Encounters are retrieved on their own.  Allowing nesting dramatically increases the complexity of the specification.  It also causes issues when there isn't a strict hierarchy - e.g. Encounters that are tied to multiple patients, Observations that aren't tied to an Encounter at all, etc.  We talked seriously about this in the early days of FHIR, but it quickly became clear that while it provided a minor benefit in certain simple cases, it added significant complexity or simply fell down in a lot of other cases.  So I'm afraid the answer to your client has to be \"that's just how FIHR works\".</p>",
        "id": 153896871,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499965545
    },
    {
        "content": "<p>Thank you very much for this clear answer.</p>\n<p>What about using custom resources for this purpose ?  For example, an encounter resource, with extensions of type \"resource\" such array of observation, array of patient.... I mean, is there really no workaround, and the answer to my client : \"just optimize your client side, even if you have to fetch and process 10 years of medical records\"</p>\n<p>Side question would be \"is FHIR designed to share such amount of data\". It looks like it was more designed to fetch 1 patient medical record, but not thousand or millions</p>",
        "id": 153896876,
        "sender_full_name": "natus",
        "timestamp": 1499966834
    },
    {
        "content": "<p>Custom resources for content that's already supported by FHIR isn't really adhering to the spirit of the standard - and it's also not going to give you interoperability.  There are ways to send a query that will return patients with all of their observations.  Certainly JSON and XML aren't extremely suitable when you're looking at millions of rows.  You might want to look at some of the recent discussions around Parquet and similar high-density syntaxes for data exchange.  (None of those would involve nesting resources though.)</p>",
        "id": 153896888,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499978844
    }
]