[
    {
        "content": "<p>The SDC-DE implmentation guide was last published as STU in April, 2017.  It will expire next April.  While there has been interest in (and significant progress in) updating the main SDC implementation guide, focused on Questionnaire, there has not (yet) been any interest expressed in updating the corresponding \"data element\" implementation guide which focuses on how to use FHIR to support the sharing of data element definitions between registries.  To the best of our knowledge, there have not been any implementations of the original implementation guide.</p>\n<p>Given the timeframe needed to update and enhance the existing implementation guide and take it to ballot (which would need to happen for the May ballot cycle), the FHIR-I work group is soliciting interest in updating and advancing the SDC-DE implementation guide.  After the Baltimore WGM, the FHIR-I work group will make a final determination on the future of the IG - either to inform the TSC of our intention to retire and withdraw that implementation guide or to initiate a PSS for a revised version.</p>\n<p>Please let me know if you would be interested in keeping the IG around.</p>",
        "id": 153996866,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536877351
    },
    {
        "content": "<p>Yes, I am interested in updating the the SDC - Data Element implementation guide.  I am actively working on associating Common Data Elements (CDEs) to questionnaires to provide robust definitions and to assist the mapping efforts of end-users who are transitioning from CDE-based forms to FHIR Questionnaires.  An updated IG is even more important since the DataElement Resource upon which it is based has been retired.  There needs to be clear guidance on how to associate CDEs to Questionnaires without using the DataElement resource.</p>",
        "id": 153996984,
        "sender_full_name": "Robinette Renner",
        "timestamp": 1536930139
    },
    {
        "content": "<p>Are you willing to assist in doing the work?  Will your organization be willing to implement and participate in connectathons related to the IG?</p>",
        "id": 153997017,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536936227
    },
    {
        "content": "<p>I am willing to assist with the work, implementation, and connectathons.  However, I cannot speak to my organization's commitment at this time.  I should know more next week.</p>",
        "id": 153997076,
        "sender_full_name": "Robinette Renner",
        "timestamp": 1536947547
    }
]