[
    {
        "content": "<p>Hi,</p>\n<p>I am getting results (ORU) from LIS.<br>\nAm converting them to DiagnosticReports resource and posting to FHIR server. <br>\nAlso am posting the Patient / DiagnosticReport / Practitioner as Collection Bundle.</p>\n<p>Suppose there are 2 DiagnosticReports that came back from LIS, so my bundle has the following entries:<br>\n    Patient<br>\n    DiagnosticReport<br>\n    DiagnosticReport<br>\n    Practitioner</p>\n<p>And now if there is a Corrected Result that came back from LIS, I will post another set of DiagnosticReports and Bundle to the FHIR server.</p>\n<p>Now my use case is to retrieve all the latest DiagnosticReport of that Patient.<br>\nHow do I get the latest set of DiagnosticReports?</p>\n<p>My planned approach: Search the Diagnostic Report based on subject (PatientId) and order by timestamp desc.<br>\nNavigate to the bundle associated with this DiagnosticReport search result and retrieve all other DiagnosticReports present in that bundle.<br>\nI am unable to navigate to the bundle from the DiagnosticReport that came back in the search, how do I do this?</p>\n<p>If there is different approach as well for the use case I am referring to, please pass the suggestion.<br>\nLooks like a very standard Use case for me, so multiple folks must have achieved this I believe.</p>\n<p>Thanks<br>\nSantosh Jami</p>",
        "id": 153904349,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1504390102
    },
    {
        "content": "<p>Well, if the corrected DiagnosticReport has the same \"id\" as the original, it can be sent as an update.  Meaning that after you've posted all 3, when you query, you'll only see two - DiagnosticReport1 and updated DiagnosticReport2.  That's the \"proper\" way to submit and minimizes any confusion.  If you don't have a way of tracking whether a DiagnosticReport might have previously been delivered, you can also do a conditional update and a conditional create.</p>",
        "id": 153904350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504395589
    },
    {
        "content": "<p>We are looking at the <a href=\"http://build.fhir.org/observation-operations.html#lastn\" target=\"_blank\" title=\"http://build.fhir.org/observation-operations.html#lastn\">LastN operation</a> to get the lastN for Observation at the upcoming connectathon and one of our oustanding questions is whether should do this for DR as well.</p>",
        "id": 153904351,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504399689
    },
    {
        "content": "<p>what is LIS here?</p>",
        "id": 153904374,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1504506788
    },
    {
        "content": "<p>laboratory information system</p>",
        "id": 153904375,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504506859
    },
    {
        "content": "<p>tnq <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 153904386,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1504516657
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for your suggestions. Responding late after the long weekend.<br>\nI started using the logical id and posting updates. This works as expected.</p>",
        "id": 153904518,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1504644372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  - having such LastNOperation for DR would be very beneficial for the use case I am working on.</p>",
        "id": 153904519,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1504644445
    }
]