[
    {
        "content": "<p>Hi there,</p>\n<p>I am trying to parse a JSON object using the .net core FHIR library. I am able to parse correctly made FHIR objects, but I have one file that is unable to be parsed. This is fine, however it is quite large and I am not sure where the problem actually is. Whenever I try to parse it, the <code>FhirJsonParser</code> object that I am using only throws out this message: <code>Input string was not in a correct format.</code>, and the stack trace is not particularly informative either (only complaining about being unable to parse a number, however, no location in the JSON specifies this). How can I get the line number/location that is an issue? </p>\n<p>Thanks</p>",
        "id": 154672296,
        "sender_full_name": "Leonardo Webb",
        "timestamp": 1546977617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> ?</p>",
        "id": 154679450,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546983605
    },
    {
        "content": "<p>Just to add on since I have done some searching...</p>\n<p>Effectively I am trying to capture the same output that the HAPI-FHIR CLI tool does, which is that it returns a list of validation errors, running this <code>./hapi-fhir-cli validate -v dstu3 -n fhir.json</code>, for example, gives me a list of all of the invalid attributes in the JSON. I found an older GitHub issue that seems to be similar to what I am trying to do, but I'm not sure if it is still relevant: <a href=\"https://github.com/ewoutkramer/fhir-net-api/issues/151\" target=\"_blank\" title=\"https://github.com/ewoutkramer/fhir-net-api/issues/151\">https://github.com/ewoutkramer/fhir-net-api/issues/151</a> (that is, do I still need to convert my JSON to XML and then validate against that?). Reading through the code I don't see analogues to the Java classes (ex, <code>SingleValidationMessage</code>), although I may be poking in the wrong places...</p>",
        "id": 154680172,
        "sender_full_name": "Leonardo Webb",
        "timestamp": 1546984264
    },
    {
        "content": "<blockquote>\n<p>Hi there,</p>\n<p>I am trying to parse a JSON object using the .net core FHIR library. I am able to parse correctly made FHIR objects, but I have one file that is unable to be parsed.</p>\n</blockquote>\n<p>Hi Leonardo, the Format exception should contain a location, and the parsing errors are actually pretty extensive and precise, so I have no idea what's going on.  Could you send me the file containing the error?</p>\n<p>As for the validation you are showing in hapi, this is done by the validator, not the parser.  The validator is part of the API, you can find an example of how to use it here: <a href=\"https://github.com/ewoutkramer/Furore.Fhir.ValidationDemo\" target=\"_blank\" title=\"https://github.com/ewoutkramer/Furore.Fhir.ValidationDemo\">https://github.com/ewoutkramer/Furore.Fhir.ValidationDemo</a></p>",
        "id": 156708881,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1548265468
    }
]