[
    {
        "content": "<p>All, I have a need for a couple of extensions:</p>\n<ul>\n<li>a general one for notes/comments in (typically clinical) resources (that don't already have such, obviously!); and</li>\n<li>one for <code>StructureDefinitions</code> to indicate that they have been deprecated.<br>\nThere exist a few \"standard\" extensions which meet my needs: <code>questionnaireresponse-note</code> and <code>structuredefinition-annotation</code> for the first and <code>codesystem-deprecated</code> for the the second.  However, all are tied to resources that are not the same as my actual requirements.  Is it okay to use them anyway?  Should I just create my own?  Should I be prompting someone to make more generic extensions available as standard?</li>\n</ul>",
        "id": 153863514,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481759407
    },
    {
        "content": "<p>I should point out that the use of a Boolean to indicate that a (version of a) <code>StructureDefinition</code> is deprecated is a simplistic, short-term solution to the more general problem of supersession of <code>StructureDefinitions</code>, either by other new <code>StructureDefinitions</code> or new versions of the same <code>StructureDefinition</code>.</p>",
        "id": 153863515,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481759606
    },
    {
        "content": "<p>have you looked at StructureDefinition.status, at the extension <a href=\"http://hl7.org/fhir/StructureDefinition/structuredefinition-template-status\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/structuredefinition-template-status\">http://hl7.org/fhir/StructureDefinition/structuredefinition-template-status</a>? but deprecated applies to more than just CodeSystem - can generalise that </p>",
        "id": 153863522,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481761942
    },
    {
        "content": "<p>comments is a bit different -where do you want to add comments, and why?</p>",
        "id": 153863523,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481761960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191366\">@Stephen Royce</span> You can't use an extension anywhere but the paths it's defined to be allowed.  However, you can submit a change request for the scope of an extension to be broadened.</p>",
        "id": 153863628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481817543
    },
    {
        "content": "<p>I have looked at the <a href=\"http://hl7.org/fhir/StructureDefinition/structuredefinition-template-status\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/structuredefinition-template-status\">http://hl7.org/fhir/StructureDefinition/structuredefinition-template-status</a> extension and we are using it in fact.  However, I'm really cheating with wanting to use the deprecated extension; what I actually want to do is add a boolean to <code>StructureDefinitions</code> to indicate that they've been superseded so that I can write an XPath like <code>fn:collection('...')/fhir:StructureDefinition[fhir:id/@value = '...' and not(&lt;superseded&gt;)]</code> to make it easy to always get the most current iteration of any given <code>StructureDefinition</code>.  So the status of the<code>StructureDefinition</code> would not actually be deprecated, it would merely indicate that it not the most recent version.</p>",
        "id": 153863661,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481854092
    },
    {
        "content": "<p>As far as comments go, our current models have an element for notes or comments that is often lacking in the equivalent FHIR resource, e.g. within <code>Observation.component</code> to allow a comment to be made about an individual component of an <code>Observation</code> that does not apply to the whole.</p>",
        "id": 153863662,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481854297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> By \"the paths it's defined to be allowed,\" do you mean the Context of Use written in the documentation of the extension?</p>",
        "id": 153863663,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1481854466
    },
    {
        "content": "<p>yes</p>",
        "id": 153863669,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481859055
    },
    {
        "content": "<p>Re comments on  a component vs the whole obs is by design.  Components are inseparable and looked at together so you would not expect a comment to apply to one part but to the whole.  Consider using related or diagnostic report if they are separable individual observations.   Otherwise you can make your own extensions.</p>",
        "id": 153864167,
        "sender_full_name": "Eric Haas",
        "timestamp": 1482208611
    }
]