[
    {
        "content": "<p>I'm trying to ask a question of HAPI FHIR like,</p>\n<p>\"Give me Specimens for Patients having a given Diagnosis code\"</p>\n<p>I notice that it's possible to nest reverse-chains.  For instance, I could use Patient?_has:Observation:patient:_has:AuditEvent:entity:user=MyUserId to get Patients with Observations where the Observation has be audited by a specific user as per the FHIR spec (<a href=\"https://www.hl7.org/fhir/search.html#has\">https://www.hl7.org/fhir/search.html#has</a>).</p>\n<p>It's also possible within HAPI to nest a forward-chain within a reverse-chain, e.g. Patient?_has:Observation:subject:device.identifier=urn:system|DEVICEID if you wanted Patients with Observations by a specific Device (<a href=\"https://github.com/hapifhir/hapi-fhir/issues/1752\">https://github.com/hapifhir/hapi-fhir/issues/1752</a>).</p>\n<p>What I would expect the syntax to look like is something like Specimen?subject:_has:Condition:subject:code=system|CODE, but in practice I get the same error as if I request some nonsense thing from the forward chain, which is the less-than-illuminating:</p>\n<p>{<br>\n  \"resourceType\": \"OperationOutcome\",<br>\n  \"issue\": [ {<br>\n    \"severity\": \"error\",<br>\n    \"code\": \"processing\",<br>\n    \"diagnostics\": \"Index 0 out of bounds for length 0\"<br>\n  } ]<br>\n}</p>\n<p>I can't be the first person who's wished to nest a reverse-chain into a forward-chain, and it doesn't seem to me that there should be any architectural or performance reason why this would not be supported while either forward- or reverse-chaining is supported within reverse-chaining.  Is there a canonical way to do this that I'm missing?</p>",
        "id": 243868349,
        "sender_full_name": "Ben Li-Sauerwine",
        "timestamp": 1624586790
    },
    {
        "content": "<p>I figured it out.  For any who follow, the syntax would be, e.g.:</p>\n<p>Specimen?subject:Patient._has:Condition:subject:code=system|CODE</p>",
        "id": 243870003,
        "sender_full_name": "Ben Li-Sauerwine",
        "timestamp": 1624589082
    }
]