[
    {
        "content": "<p>Hi ,<br>\nScenario here is that a midwife makes a routine enquiry to assess if the pregnant patient is at the risk of domestic abuse.<br>\nI am trying to use RiskAssessment to cover this requirement( specialized form of Observation).<br>\n<a href=\"https://www.hl7.org/fhir/riskassessment.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/riskassessment.html\">https://www.hl7.org/fhir/riskassessment.html</a></p>\n<p>Am I going in the right direction? Also, I noticed that ReferralRequest isn't a part of the current RiskAssessment design so if the midwife wants to refer to a domestic violence advocate based on the assessment , what would be the best way to represent this action ? </p>\n<p>Many thanks ! <br>\n-- <br>\nRegards,<br>\n-Pravina<br>\nPatients Know Best</p>",
        "id": 153841683,
        "sender_full_name": "Pravina Munghate",
        "timestamp": 1469819804
    },
    {
        "content": "<p>RiskAssessment is where you want to capture specific probability/likelihood of one or more risks.  What you're doing sounds more like an Observation to me.  In any event the ReferralRequest would point to the RiskAssessment or Observation (as the reason for the referral and/or as supporting information).  The RiskAssessment or Observation wouldn't generally point to what follows.</p>",
        "id": 153841685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469824153
    },
    {
        "content": "<p>IMO, RiskAssessment could  be used as it is a special observation. But, this <code>RiskAssessment.context</code> may need to point to an <code>Encounter</code> and the <code>ReferralRequest.context</code>also point to that Encounter. Sounds too complex. </p>",
        "id": 153841695,
        "sender_full_name": "Jeffrey Chen",
        "timestamp": 1469824957
    },
    {
        "content": "<p>How will the decision tree work after the assessment is completed?  RiskAssessment has a <code>probabilityDecimal</code> and <code>probabilityRange</code>, as well as a <code>basis</code> array.  Figuring out how they will be used in a follow-up decision tree is what's necessary to determine if RiskAssessment object is the correct resource to use.</p>\n<p>Suppose there's an assessment criterion of 'bruising on wrists'.  If you don't have any statistical info on the rates of domestic abuse that result in bruising on wrists, then RiskAssessment is probably too complex.  Your best bet is probably to record it as an Observation, and implement an if/then decision tree to do a follow up if the bruising Observation is present.  </p>\n<p>On the other hand, say you know that 10% of domestic abuse cases result in bruising on wrists (I'm making that number up for the purpose of explanation).  If that's the case, if the bruising Observation is recorded, a RiskAssessment would be a great resource to use, and simply specify your probabilityDecimal as 0.1.  Then you can do threshold checks in your decision tree.</p>\n<p>Example:  A social work app is designed to add outreach counseling sessions to patients with a risk of domestic abuse that's greater than 12%.  JaneDoe isn't flagged.  But maybe a follow up screening detects a black-eye, and her RiskAssessment is now at 40%.  Alternatively, funding comes in for a new social worker; so admins can then set the threshold down to 8% and follow-up on a wider range of patients who may be at risk.</p>\n<p>So, there's sort of this question whether the data is being collected for patient-centric workflow or population-health workflow; and whether you have a risk model to supply the assessment with percentage probabilities.</p>",
        "id": 153842005,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1470091256
    },
    {
        "content": "<p><code>RiskAssessment</code> is a collection of <code>Observation</code>which are captured at one time based on a single set of source inputs. So, if the social worker try to do risk of domestic abuse assessment, 'bruising on wrists' is only one of the observation items which assists to generate the final `prediction.probability'. And that 'probality' should based on the local assement guideline/protocol. FHIR does not used to calculate or exam the risk possibliity.</p>",
        "id": 153842014,
        "sender_full_name": "Jeffrey Chen",
        "timestamp": 1470096118
    },
    {
        "content": "<p>Could perhaps also be a Questionnaire/Response set??</p>",
        "id": 153842017,
        "sender_full_name": "Chad Albert",
        "timestamp": 1470099540
    }
]