[
    {
        "content": "<p>There is a JIRA (<a href=\"https://jira.hl7.org/browse/FHIR-26830\">https://jira.hl7.org/browse/FHIR-26830</a>) suggesting to create an extension to document risk of certain entities using HL7 v2 table 0489 vocabulary.</p>\n<p>There is another JIRA (<a href=\"https://jira.hl7.org/browse/FHIR-32064\">https://jira.hl7.org/browse/FHIR-32064</a>) to enhance the ClinicalUseIssue resource to better support warnings, which would include those to be addressed above, although the focus for this resource (for now, and desired by the authors) is on medication, device, or procedure.</p>\n<p>In a discussion between OO, BR&amp;R, and Devices workgroups there were two options identified on how to address the respective JIRAs with a consistent approach:</p>\n<p>Option 1<br>\nUse ClinicalUseIssue generally (beyond the resources currently targeted by ClinicalUseIssue), and create core profile for focused on the warning aspect for use Specimen (and Patient, Group if needed), while other resources reference the full ClinicalUseIssue profile by extension or attribute as currently intended.</p>\n<p>Option 2<br>\nCreate extension for warning only for Specimen (and Patient, Group if needed), and share vocabulary with the warning aspect in ClinicalUseIssue that the other resources can use.</p>\n<p>The leaning in the discussions so far is towards option two.  We would like to get more input.</p>",
        "id": 240473721,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1622124829
    },
    {
        "content": "<p>As it stands ClinicalUseIssue is focussed on potential patient use problems and recommendations. It is intended to be “definitional”, about all instances of the drug, procedure or what have you.</p>\n<p>It is aimed at standard facts that may be on \"published\" sources, e.g. patient leaflets, drug Summary of Product Characteristics/labellings etc.</p>\n<p>So it is a slight mismatch for something that is about a particular instance of a risk to a more general person, presumably a practitioner. The switch from patient (as the intended \"user\" of some product or procedure) to anyone, and from definition to instance, is a bit of step change. I suppose the specimen warning could be about the entire class of specimens though, not just one, but I assume it could apply to a particular instance too.</p>\n<p>We could use it for all risks, but I think we risk diluting it somewhat.</p>\n<p>Instead what about the Flag resource?</p>",
        "id": 240615300,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1622213629
    },
    {
        "content": "<p>Re FHIR 32064 the warnings that ClinicalUseIssue uses are currently meant to cover the warnings that you tend to get on patient information, to finish off the scope of the indications and contraindications that are on leaflets etc by adding text such as \"May cause drowsiness”.</p>\n<p>We had not really considered explosions and other similar hazards, even though it is possible some products could be generally hazardous in that way (but perhaps rarely ones that are administered by patients themselves). But this would still be just text (in ClinicalUseIssue.description) rather than some controlled vocabulary, that we have seen so far. </p>\n<p>We don’t really have a use case for coded warnings. I can see that it looks inconsistent with the other types, but that is because the known requirements are like that - it is not an omission. However if there are common cases of coded warnings for patients that systems support, we can certainly look at that.</p>",
        "id": 240615821,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1622213878
    }
]