[
    {
        "content": "<p>I am trying to figure out how to represent patient level component scores (ie factors) that go into creating an overall risk score in RiskAssessment, specifically we have a number of modules where the output of the model is either a numeric score or percentage liklihood, which I believe should be expressed in Prediction section but there is also a more granular breakdown of the components that contribute to the score, for example, a demographic factor and a diagnostic factor or for some models, even more granular factors around things like an income factor or access to transportation factor. where would these types of information be stored? I could see using basis but if I used basis would basis would I then create each driver as it's own RiskAssessment so I can reference them in the parent RiskAssessment? I suppose we could also build each driver as a distinct RiskAssessment and then link them all via the PartOf so all the children would reference the parent. Another thought would be Prediction.Rationale and then embedding the information there, but given that is a string, it seems to be less parse-able if we were trying to share that information or use it in an application. Anyone else tried to solve a similar problem? I see a request for trying to extend the RiskAssessment to support this more directly but that request appears to have been closed: <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9932&amp;view=one-page\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9932&amp;view=one-page\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9932&amp;view=one-page</a></p>",
        "id": 153913528,
        "sender_full_name": "Joanna Gaskill",
        "timestamp": 1507762706
    },
    {
        "content": "<p>The rejection may have been based on a misunderstanding of the use-case, so it's quite reasonable to try again with a better explaination that this isn't definitional (how the risk is calculated) but rather components (individual sub-scores contributing to the overall score).  RiskAssessment hasn't seen heavy use yet and isn't super mature, so we're certainly open to feedback about how to make it better.</p>",
        "id": 153913542,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507763473
    },
    {
        "content": "<p>Just be sure to include a pointer to the old change request in your new one.</p>",
        "id": 153913543,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507763490
    },
    {
        "content": "<p>As the submitter of the initial <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9932\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9932\">GF#9932</a>, I would certainly support revisiting this topic again :)</p>",
        "id": 153913618,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1507814360
    },
    {
        "content": "<p>We experience the same issue.</p>\n<p><span class=\"user-mention\" data-user-id=\"193786\">@Joanna Gaskill</span>, we use the following interpretations, which we believe to closely match the intended ones:</p>\n<ul>\n<li>\"basis\" represents the information used, but which may or may not be contributing to the risk;</li>\n<li>\"rationale\" represents the top contributing factors.</li>\n</ul>\n<p>It strikes me that \"rationale\" is a string, given the \"reference/object-orientedness\" of FHIR... <br>\nI would definitely argue to make \"rationale\" a list of references, whether the objects referenced are strings or complex data structures. However, referencing the drivers directly doesn't solve the issue, as you'd want to say more about how the driver influences the risk, e.g. using numerical \"weights\"...<br>\nGiven the upcoming of AI-based risk scores and automated but detailed and complex risk factor analysis, I would also strongly recommend revisiting this topic.<br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> you mentioned \"change request\". Where could I find it?</p>\n<p>In the meanwhile, is it possible for me \"redefine\" rationale as a list of references? If yes, how?</p>",
        "id": 185472849,
        "sender_full_name": "Laurent Meesseman",
        "timestamp": 1578903558
    },
    {
        "content": "<p>I'm not sure if one was submitted - if it was, it wasn't listed here.  <span class=\"user-mention\" data-user-id=\"193786\">@Joanna Gaskill</span> <span class=\"user-mention\" data-user-id=\"200522\">@Laurent Meesseman</span>, feel free to submit one on <a href=\"http://jira.hl7.org\" target=\"_blank\" title=\"http://jira.hl7.org\">http://jira.hl7.org</a></p>",
        "id": 185511747,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578934387
    }
]