[
    {
        "content": "<p>I’ve a project where a rest interface takes a bundle and then messages it to a number of recipients.</p>\n<p>I’m thinking messageheader would be suitable for this but recipient is 0..1 but I think I could add in a list as an extension? I would leave the recipient filed blank and just populate sender.<br>\nDoes that sound ok?</p>",
        "id": 153998914,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1537513104
    },
    {
        "content": "<p>definitely message header.</p>",
        "id": 153998916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537513313
    },
    {
        "content": "<p>all versions have destination 0..*</p>",
        "id": 153998918,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537513414
    },
    {
        "content": "<p>Maybe routing slip was the wrong term, at this stage it would be a distribution list and the middleware FHIR server then works out the destination (interaction style and physical addresses).</p>",
        "id": 153998931,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1537517804
    },
    {
        "content": "<p>well then you only need one destination</p>",
        "id": 153998952,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537526387
    },
    {
        "content": "<p>So it would be a List of recipients as an extension to a MessageHeader (on the rest side before it gets converted to one recipient and one destination as a message)</p>",
        "id": 153998984,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1537538063
    },
    {
        "content": "<p>You would list all of the intended destinations and pass the single message to your routing engine.  It might then either split the message and change to a single header per destination or might just fan out the message and send it to each intended destination.  Do you have a situation where you have one destination system but multiple recipients within that system?</p>",
        "id": 153998987,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537538542
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/7zbWGQtNd2vAeb1pSN5I45SJ/Simple-Doc-API.jpeg\" target=\"_blank\" title=\"Simple-Doc-API.jpeg\">Simple-Doc-API.jpeg</a> <br>\nThis is a 'fag packet' diagram, the interface on the left is where the distribution list would be received, steps 1+2 perform Endpoint queries and build the physical routing. Here the message would be fanned out.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/7zbWGQtNd2vAeb1pSN5I45SJ/Simple-Doc-API.jpeg\" target=\"_blank\" title=\"Simple-Doc-API.jpeg\"><img src=\"/user_uploads/10155/7zbWGQtNd2vAeb1pSN5I45SJ/Simple-Doc-API.jpeg\"></a></div><p>I think I could use virtual devices for the destinations, so the <strong>MessageHeader.destination.target.identifier</strong> would refer to the Organization or Practitioner. At the fan out step, the MesssageHeader is converted to actual devices and actual recipient.</p>",
        "id": 153999318,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1537692180
    },
    {
        "content": "<p>Technically we would have one destination system with multiple recipients. Majority of the endpoints need a transform, so ideally I would want to perform this once per route/endpoint and then fan the message out again. I'd probably handle this within the messaging system outside of FHIR for now.</p>",
        "id": 153999319,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1537692592
    }
]