[
    {
        "content": "<p>Would greatly appreciate if someone can provide an exact difference between RXNorm (weekly) licensed version and non-license version?</p>",
        "id": 200269953,
        "sender_full_name": "Mohammad Wahid",
        "timestamp": 1591726889
    },
    {
        "content": "<p>Can someone provide an exact difference between RXNorm (weekly) licensed and non-licensed version?</p>",
        "id": 200270408,
        "sender_full_name": "Mohammad Wahid",
        "timestamp": 1591727132
    },
    {
        "content": "<p>Can someone provide the exact difference between RXnorm licensed and non-licensed files?</p>",
        "id": 200271011,
        "sender_full_name": "Mohammad Wahid",
        "timestamp": 1591727408
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 200271227,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591727516
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306676\">@Mohammad Wahid</span> Can you clarify what you mean in regard to the \"licensed\" and \"non-licensed\" versions?  I don't recall having seen anything like that.  The access and use of RxNorm does require a license (so I don't think a \"non-licensed\" version would even be possible) - plus the license and access to the content through NLM/UMLS (<a href=\"https://www.nlm.nih.gov/research/umls/rxnorm/docs/rxnormfiles.html\">here</a>) is available for no cost.</p>",
        "id": 200276610,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1591730114
    },
    {
        "content": "<p>Thank you! What I meant was \"Don't have a UMLS license/account\" One requires registration  and a license account, whereas other link is a direct download. Also, the difference in RXTerm and RXNorm, RXTerm is a subset of RXnorm? (only with TTY code: SCD/SBC?</p>",
        "id": 200278444,
        "sender_full_name": "Mohammad Wahid",
        "timestamp": 1591731084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306676\">@Mohammad Wahid</span> You've probably seen it, but I think <a href=\"https://lhncbc.nlm.nih.gov/project/rxterms\">this</a> page gives a pretty good overview of RxTerms, and I think explains the differences between it and RxNorm fairly well.  I haven't actually used RxTerms much myself, but I think it looks like it should be pretty useful for user interface and data entry situations.  RxNorm would still normally be what is used for data representation and exchange (as in FHIR) and data analysis.  That's my take on it.</p>",
        "id": 200409400,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1591792452
    }
]