[
    {
        "content": "<p>As a a payer, we're storing our medication details in NDC as part of the claims processing.  From what I have read, USCDI is mandating that the  medication \"Applicable standard\" should follow \" RXNorm, January 6, 2020 full release update. If so, then this means that will have to translate the NDCs to RXNorm?</p>",
        "id": 199057825,
        "sender_full_name": "Mohammad Wahid",
        "timestamp": 1590688708
    },
    {
        "content": "<p>Yes</p>",
        "id": 199058085,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1590688817
    },
    {
        "content": "<p>Or... \"maybe\"?  The regulatory texts (including ONC Cures, MU3, and the CMS Cures rule) have always been very unclear with regard to terminology requirements.  It is silent on areas like historical data, patient-entered data, data from other trading partners, research data that doesn't have standard codes yet, etc.  As with a lot of regulatory text, you kinda just have to interpret it for yourself, or ask the regulatory bodies for clarification.  Mapping NDC to RxNorm may be reasonable, but in general, mapping data you don't own can be risky.  Getting the correct terms from the source of truth is an option that ensures you accurately communicate the data, but that can involve re-implementing your existing data connections.</p>\n<p>Overall the ONC Rule and USCDI requirements were pretty well put together and did a good job striking a balance between being specific where appropriate, but open-ended where necessary.  Though the open-ended areas make HIT developers nervous because sometimes we have to pick one of the many possible interpretations (e.g. what to do about 15-year old historical data received from a system that has gone out of business that was used by a health system that was acquired and merged a few times...), and live in fear that maybe we picked wrong.  Though we try very hard to do the reasonable thing and meet the spirit of the regs.</p>",
        "id": 199091574,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1590703158
    },
    {
        "content": "<p>The ONC regulation says that you have to conform to FHIR R4 US Core - that allows only RxNorm, doesn't it? (The CMS regulation does not mandate that, so you have wiggle room there I guess)</p>",
        "id": 199097189,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1590707252
    },
    {
        "content": "<p>Note that if your source of truth is an NDC code you can (and should) send that too.</p>",
        "id": 199101742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590711869
    },
    {
        "content": "<p>My interpretation is that you SHALL send the mapped RxNorm code and certainly SHOULD also send the original NDC code as an additional coding. You can get mapping of NDC to RxNorm via an RxNorm API. If you know the NDC is currently active, you use <a href=\"https://rxnav.nlm.nih.gov/RxNormAPIs.html#uLink=RxNorm_REST_getNDCProperties\">ndcproperties</a>, or if you are unsure or know the NDC is no longer active, you use <a href=\"https://rxnav.nlm.nih.gov/RxNormAPIs.html#uLink=RxNorm_REST_getNDCStatus\">ndcstatus</a> and one of the returned properties will be the RxNorm mapped to that NDC.</p>",
        "id": 199186275,
        "sender_full_name": "Robert McClure",
        "timestamp": 1590773750
    },
    {
        "content": "<p>I guess I know the lab area better than meds, but are there scenarios where meds just don't have RxNorm codes?  E.g. meds in clinical trials?</p>",
        "id": 199188623,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1590774826
    },
    {
        "content": "<p>And patient-reported, where the specific drug or ingredient isn't specified?</p>",
        "id": 199188711,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1590774862
    },
    {
        "content": "<p>It is possible that meds will not have an rxnorm, yes, specifically custom medications, compounds made in pharmacy, et. al.</p>",
        "id": 199372717,
        "sender_full_name": "Nathan Hall",
        "timestamp": 1591020135
    },
    {
        "content": "<p>So should this be a US Core JIRA?  We can't <em>require</em> RxNorm for MedicationStatement.  It should probably be must-support 0..1, not must-support 1..1 as it is now.  <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 199392964,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1591030110
    },
    {
        "content": "<p>Isn't the binding extensible?</p>",
        "id": 199393269,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591030274
    },
    {
        "content": "<p>How does extensible make a difference?</p>",
        "id": 199395161,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591031165
    },
    {
        "content": "<blockquote>\n<p>E.g. meds in clinical trials?</p>\n</blockquote>",
        "id": 199395366,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591031280
    },
    {
        "content": "<p>Per <a href=\"http://hl7.org/fhir/terminologies.html#strength\">binding strength</a><br>\n    To be conformant, the concept in this element SHALL be from the specified value set if any of the codes within the value set can apply to the concept being communicated. If the value set does not cover the concept (based on human review), alternate codings (or, data type allowing, text) may be included instead.</p>",
        "id": 199395638,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591031405
    },
    {
        "content": "<p>And I guess for patient-entered, or whatever other reason, you could use the Data Absent Reason extension.</p>",
        "id": 199548103,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1591129375
    }
]