[
    {
        "content": "<p>see <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/sampledData.20and.20vitals/near/162949654\" title=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/sampledData.20and.20vitals/near/162949654\">this comment</a> (based on a related tracker)  seeking input on whether is an issue TODAY</p>",
        "id": 162950005,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554843925
    },
    {
        "content": "<p>Well, if the profiles go normative, it will be a breaking change to change it <em>ever</em>, so it's a question whose answer requires a forward looking view.</p>",
        "id": 162950671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554844364
    },
    {
        "content": "<p>I would allow it. We started collecting data from wearables in our apps and returning / handling those as individual observations is not going to cut it (you run into the billions data points....)</p>",
        "id": 162990291,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1554890575
    },
    {
        "content": "<p>There may be two reasons for using SampledData for blood pressure and other vital signs:<br>\n- (Invasive) blood pressure can be viewed as waveform data with samples every few milliseconds. Looking at the <a href=\"http://build.fhir.org/datatypes-examples.html#SampledData\" target=\"_blank\" title=\"http://build.fhir.org/datatypes-examples.html#SampledData\">example</a> this seems to be what SampledData was intended for. Not sure if this falls into the Vital Signs category, as it is not a \"Blood pressure panel\" with systolic and diastolic values.<br>\n- Collecting measurements at short time interval (e. g. every second) will create huge number of observations. There are complaints that FHIR is creating too much overhead for these kind of applications. If SampledData is the answer, then we need it for representing vital signs.</p>",
        "id": 163001080,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1554900775
    },
    {
        "content": "<p>The Consumer Wearables I've seen are sending data as a individual data points.   Are there any sending as a sampled data?   I think the in hospital devices or regulated wearable may send as a sampled data.   It is not clear to me how an end user ( I am thinking of a patient looking at her data) would use it alongside individual measurements.    Would need to perform some statistics on it to be able  to view alongside a point measurement. </p>\n<p>Options:</p>\n<ul>\n<li>send it all let the receiving app figure out how to deal with it.</li>\n<li>make sampled_data out of scope for the vitals profile use case ( only interested in single point data )  if you want to send a record of a data stream then perform some statistics on it and send that.   In other words let the sending server figure out how to deal with it.</li>\n</ul>",
        "id": 163022848,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554915415
    },
    {
        "content": "<p>The vitals profiles aren't just for wearables - it's for absolutely everything.  What I'm hearing is that systems are going to need to be able to send and consume sampled data, so the international profiles need to allow for that.  It's possible that the US Core profiles could constrain it out if they believe it falls outside of their scope, but it can't be out-of-scope for the UV profiles.</p>",
        "id": 163026996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554918087
    },
    {
        "content": "<p>I am not convinced it will be helpful to making the firehose of data bigger.  Do I as a consumer of this data want to mash together a 16 hr trace of bp with a single wellness visit bp.  It has to be managed somewhere and I am just asking the where and how, otherwise it becomes useless.</p>",
        "id": 163035189,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554923092
    },
    {
        "content": "<p>It's a question of how it's useful to capture data.  If you're measuring blood pressure intraarterially multiple times a second, you don't want those as separate Observations.  So they're <em>going</em> to be captured as SampledData.  On the other hand, when you query for a patient's historical blood pressures, you may not actually want those sorts of high-frequency results.  Are there different LOINC codes for the high frequency measurements?  Could we explicitly allow them too?</p>",
        "id": 163037681,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554924565
    },
    {
        "content": "<p>Seems like a good discussion to have with the folks that deal with high-volume real-time data like those on the IHE PCD committee and the IEEE 11073 folks.    In an inpatient setting vital signs are captured at a relatively high frequency (with high fidelity) to help make real-time, patient-critical decisions and for things like alarming.    Maybe a FHIR repository doesn't want or need to store this high-frequency data but there are definitely systems that can generate it.   (As far as viewing current, real-time/high-frequency data -- there are ways to address that -- when you look over a longer period of time you can do some 'rounding' or sampling to show trends and then when you zoom in, show the detail, minute-level data, for example.)</p>",
        "id": 163042214,
        "sender_full_name": "John Silva",
        "timestamp": 1554927891
    },
    {
        "content": "<p>Yes, wearables send individual data points, and currently we are storing and rendering them as separate Observation - but it results in way too many of them, we should store and render them as sampled data to be manageable</p>",
        "id": 163081824,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1554972658
    }
]