[
    {
        "content": "<p>This does not look like a popular topic as a search on SampledData led to nothing. I am trying to map IEEE waveform data to an Observation and most of it is straight forward EXCEPT for the SimpleQuantity concept used in the SampledData. The 'origin' element is described as a SimpleQuantity with the description \"Zero Value and units\" with cardinality 1..1. But it is not clear to me what a SimpleQuantity is. The documentation says a fixed Quantity. How do I interpret this? If I have a zero value of 1.0 and a code system describing the unit, how is this represented? How does one interpret \"SimpleQuantity\"? Any one of the Quantity options?</p>\n<p>Thanks for any clarification. (The example for an ECG contains no units, just a zero value.)</p>",
        "id": 153842965,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1470652275
    },
    {
        "content": "<p><a href=\"http://hl7-fhir.github.io/datatypes.html#2.20.0.6.1\" target=\"_blank\" title=\"http://hl7-fhir.github.io/datatypes.html#2.20.0.6.1\">http://hl7-fhir.github.io/datatypes.html#2.20.0.6.1</a>. I see the reference to SimpleQuantity is a broken link. </p>",
        "id": 153842974,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470656550
    },
    {
        "content": "<p>I'll fix taht</p>",
        "id": 153842975,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470656723
    },
    {
        "content": "<p>Thanks. That might be all I need.</p>",
        "id": 153842990,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1470665758
    },
    {
        "content": "<p>Grahame,</p>\n<p>Looks like I need a little bit more of a clarification on the SampledData 'origin' element. It is described as follows: <br>\n    The base quantity that a measured value of zero represents. In addition, this provides the units of the entire measurement series.<br>\nIt is not clear to me what 'measured' means. If I look at the scaleFactor element it is described as<br>\n    A correction factor that is applied to the sampled data points before they are added to the origin.<br>\nIts the added to the origin that confuses me. Now what I would expect is that the origin.value element would be some constant to which the re-scaled data elements are added. Thus the actual MEASURED quantity is<br>\n    original measured value[i] = valueSampleData.data[i] * valueSampledData.scaleFactor + valueSampledData.origin.value<br>\nThus the origin is not the measured value 0 but the data value 0.<br>\nIs that correct? In other words is my above equation the correct one to get the original values? Thus uploading I would do<br>\n    valueSampleData.data[i] = (original measured value[i]  - valueSampledData.origin.value) / valueSampledData.scaleFactor</p>\n<p>Thanks for any clarification.</p>",
        "id": 153865899,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1483711238
    },
    {
        "content": "<p>MEASURED quantity is<br>\noriginal measured value[i] = valueSampleData.data[i] * valueSampledData.scaleFactor + valueSampledData.origin.value</p>",
        "id": 153865930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483735197
    },
    {
        "content": "<p>yes. I agree that the wording is a little misleading; I tried to be too brief. can you make a task to clarify?</p>",
        "id": 153865931,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483735221
    }
]