[
    {
        "content": "<p>We work with a Saturation Profile to communicate the saturation of a patient when we calculate a triage in an external system.<br>\nWe have created a derived profile from the standard FHIR saturation profile.</p>\n<p>In the external system, in addition to the saturation value, the user can add information whether the patient has received supplemental oxygen or not. If the patient has received oxygen, the user can also add the flow rate for the added oxygen.</p>\n<p>We therefore have a need to communicate this information, but have not found a good solution on how to include it in the Saturation profile.<br>\nAnyone who have implemented this or have any ideas on how to best solve it?</p>",
        "id": 203276677,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1594219812
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> does the Devices WG have profiles on this?</p>",
        "id": 203280232,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594221414
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"261302\">@Ludvig Eek Hofmann</span>  extensive nomenclature for this is in the ISO/IEEE 11073 terminology standard - with a major update in process that includes an extended set of ventilator-related terminology;  the <a href=\"https://confluence.hl7.org/display/DOF\">Devices on FHIR Point-of-Care Devices Profile</a> provides profiling for how this information should be expressed in FHIR resources, providing mappings from ISO/IEEE 11073 semantics (and information model) to FHIR resources (esp. Device and Observation).  Given the 1,000's of medical device terms ... there is no specific \"Saturation profile\" for example, that I know of, but I defer to my betters ...  <br>\n<span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span> is the lead for that IG and <span class=\"user-mention\" data-user-id=\"192966\">@Stefan Karl</span>  is a primary contributor:  Any more specific guidance for Ludvig?</p>",
        "id": 203293899,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1594227699
    }
]