[
    {
        "content": "<p>Hi, is there a resource to schedule an administration? The MedicationAdministration looks like it's intended for just current and historic administrations. Sorry if this has been answered already, I've had a look around and haven’t been able to find anything on this so far.</p>",
        "id": 240020769,
        "sender_full_name": "Dan Miller",
        "timestamp": 1621844848
    },
    {
        "content": "<p>MedicationRequest with .intent=instance-order</p>",
        "id": 240030702,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621850790
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , that raises another question.<br>\nWhen a prescription is PRN and a clinician is about to administer a dose we are looking to validate the safety of the administration. When processing this should we be using the MedicationAdministration resource or the MedicationRequest? The MedicationRequest seems to be for scheduled events where as the MedicationAdministration holds information about the specific administration i.e. specific amount being administered, the route of administration and by whom this seems more appropriate.</p>",
        "id": 240056537,
        "sender_full_name": "Dan Miller",
        "timestamp": 1621865529
    },
    {
        "content": "<p>are you asking wheter the same applies for non-scheduled (PRN / emergency) administrations?</p>",
        "id": 240056675,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621865608
    },
    {
        "content": "<p>MedicationAdministration is for a medication that's already been administered or is in the process of being administered (e.g. IV bag has been hung and is running).  Typically you'd want to do safety checks on the instance order - as that would allow you to catch problems before the drug has started to enter the patient.</p>",
        "id": 240056950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621865756
    },
    {
        "content": "<p>MedicationRequest can be used at different levels of granularity.  An 'instance-order' MedicationRequest would be something like \"Jan. 3, 1:30pm, administer 10 mg drug X to Patient A\"</p>",
        "id": 240057114,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621865816
    },
    {
        "content": "<p>in my view you can still do both:</p>\n<ol>\n<li>capture a ad-hoc request (\"i just scheduled myself to do this now\") for each administration.</li>\n<li>Just do a MedAdministration - first with a status in-progress, check if that is going OK, and use that to detect any issues.</li>\n</ol>",
        "id": 240057289,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621865902
    },
    {
        "content": "<p>My guess is that 2. seems simpler but will mess up your data (i.e. that use case uses one less \"temporary\" resource) but now your decision support needs to support MedicationAdministration AND MedicationRequest. Also makes data analytics harder</p>",
        "id": 240057588,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621866043
    },
    {
        "content": "<p>so, IMO you'd have to have good reasons to go for 2.</p>",
        "id": 240057699,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621866086
    },
    {
        "content": "<p>in-progress technically means that it's started.  Systems will generally assume that the patient was exposed to at least <em>some</em> medication if there's an in-progress instance.</p>",
        "id": 240058512,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621866438
    },
    {
        "content": "<p>So, an example could be, a patient been prescribed Paracetamol PRN and we are now about to administer the medication. </p>\n<p>An example check could be “has the patient reached their limit for the day via the intended route”. This would need to have specific details about the route being applied as the prescription may not have specified at a detailed enough level. </p>\n<p>Given this would it be appropriate for the application to create a MedicationRequest with intent = instance-order with specific details of the administration proposed. Then to process checks against them and pass back an indicator before the application then creates the MedicationAdministration?</p>",
        "id": 240059057,
        "sender_full_name": "Dan Miller",
        "timestamp": 1621866646
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"279019\">Dan Miller</span> <a href=\"#narrow/stream/179166-implementers/topic/Scheduled.20Administration/near/240059057\">said</a>:</p>\n<blockquote>\n<p>would it be appropriate for the application to create a MedicationRequest with intent = instance-order with specific details of the administration proposed. Then to process checks against them and pass back an indicator before the application then creates the MedicationAdministration?</p>\n</blockquote>\n<p>I would prefer that, yes</p>",
        "id": 240060083,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621867127
    },
    {
        "content": "<p>Many thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span></p>",
        "id": 240062277,
        "sender_full_name": "Dan Miller",
        "timestamp": 1621868173
    }
]