[
    {
        "content": "<p>The schema seems to have different representations of the data-types than the profiles do... For example, Composition.status in the schema shows as type \"CompositionStatus\", where in the FHIR website (<a href=\"http://www.hl7.org/fhir/composition.html\" target=\"_blank\" title=\"http://www.hl7.org/fhir/composition.html\">http://www.hl7.org/fhir/composition.html</a>), Composition.status shows as \"code\". Does anyone know why this is?</p>",
        "id": 153814671,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457575661
    },
    {
        "content": "<p>In FHIR, a bare \"code\" datatype is typically bound to a fixed valueset (e.g. <code>Patient.gender</code>). In the schema, it sounds like the valueset is effectively collapsed into element-specific data types. The net result is the same (a field that must be populated with values from a fixed list). </p>",
        "id": 153814672,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457575999
    },
    {
        "content": "<p>That makes some sense... However, it makes it very difficult to trace the schema to the profile definitions. For example, if I am exporting a StructureDefinition using the schema, I cannot find the correct \"Type\" code to use for the ElementDefinitions</p>",
        "id": 153814673,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457576098
    },
    {
        "content": "<p>\"if I am exporting a StructureDefinition using the schema\" - uh? </p>",
        "id": 153814675,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457576220
    },
    {
        "content": "<p>building the schema involves a lossy transform </p>",
        "id": 153814676,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457576239
    },
    {
        "content": "<p>Yah... that sounds a little confusing. But, basically, I am building a StructureDefinition. I have the schema loaded already and know where in the schemas my StructureDefinition and ElementDefinitions relate to. If I want to determine what \"type\" should be output for the ElementDefinition based on the element within the schema, I cannot</p>",
        "id": 153814677,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457576334
    },
    {
        "content": "<p>I don't understand what you are doing - building a structure definition from a schema? why?</p>",
        "id": 153814678,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457576380
    },
    {
        "content": "<p>In Trifolia, we allow users to define constraints (ElementDefinitions) based on the structure of the FHIR schema</p>",
        "id": 153814679,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457576619
    },
    {
        "content": "<p>In other words, we make a visual representation of the schema in a web browser, and let the users select an element and constrain in (or create an ElementDefinition)</p>",
        "id": 153814680,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457576648
    },
    {
        "content": "<p>but, unless I add logic in here to have it use base profiles for FHIR, I cannot determine what the valid \"type\" is for a given ElementDefinition</p>",
        "id": 153814681,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457576687
    },
    {
        "content": "<p>rather, I cannot determine that JUST using the schema</p>",
        "id": 153814682,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457576707
    },
    {
        "content": "<p>well I wouldn't have even started from a schema - I would've used the structure definition. but I can tell you that if the schema contains an enumeration, the correct type is 'code', though you won't be able to tell what the value set is </p>",
        "id": 153814683,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457576979
    },
    {
        "content": "<p>Trifolia is a schema-based template/profile designer. It's been using schemas for 5+ years. So, it would be an effort to re-design it to base it on the XML representations of a profile, instead of using the schema</p>",
        "id": 153814684,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577082
    },
    {
        "content": "<p>Regardless, though, my point is that if I'm having a problem tracing this, someone else will, and I think we need to update the schemas to be more accurate to the FHIR website</p>",
        "id": 153814685,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577115
    },
    {
        "content": "<p>Not sure if that means updating the schema to have Composition.status be an extension of a complex type called \"code\"... would have to play around with that concept</p>",
        "id": 153814686,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577169
    },
    {
        "content": "<p>But, at the least, I think the schema should have annotations to address this</p>",
        "id": 153814687,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577179
    },
    {
        "content": "<p>so that you can trace the schema to the standard</p>",
        "id": 153814688,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577187
    },
    {
        "content": "<p>well, we can do that by making the simple rule: any element with an enumerated type is a code. But there's way more important stuff that doesn't go in the schema; it's a stupid brain dead thing</p>",
        "id": 153814689,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457577282
    },
    {
        "content": "<p>make an annotation ;)</p>",
        "id": 153814690,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577345
    },
    {
        "content": "<p>adding another \"rule\" to have to read seems more implementer-complex then just annotating the schema</p>",
        "id": 153814691,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577380
    },
    {
        "content": "<p>Any idea where I can download all of the profiles for the base standard?</p>",
        "id": 153814692,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577628
    },
    {
        "content": "<p>in XML format?</p>",
        "id": 153814693,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457577630
    },
    {
        "content": "<p>nm. found them in the standard's download</p>",
        "id": 153814694,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1457578100
    }
]