[
    {
        "content": "<p>Question to participants - I want to do some Schematron work in .Net, in particular using some new features that were introduced in v1.6 (let, abstract, code-lists). The .Net implementation at NuGet does not support these, and the MS XPath libraries do not support xslt2 anyway. FHIR sch use some of the v1.6 features, but my current .Net code fails to process the Schematron published with the FHIR spec. Can anyone give me some guidance on where I might find some .Net code that implements Schematron v1.6? </p>",
        "id": 153823502,
        "sender_full_name": "David Fallas",
        "timestamp": 1461790604
    },
    {
        "content": "<p>Is this to process the invariants?<br>\nIf so, moving forward we should be able to use the fhirpath expressions for these.</p>",
        "id": 153823503,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461791718
    },
    {
        "content": "<p>In part, my intent is to use Schematron as a 'unit test' to provide insurance that any of our code changes, FHIR and/or v2 client and/or server, do not break existing creation of resource instances, business rules or functionality. Our code base is .Net and we need a Schematron-based library for developers. For example we want to be able to use Schematron to check instance codes against specific value-sets which requires a v1.6 implementation.</p>",
        "id": 153823507,
        "sender_full_name": "David Fallas",
        "timestamp": 1461793779
    },
    {
        "content": "<p>I am afraid I don't know much about fhirpath expressions (yet). So much to keep up to date with - so little time!</p>",
        "id": 153823508,
        "sender_full_name": "David Fallas",
        "timestamp": 1461793830
    },
    {
        "content": "<p>That's for sure.</p>",
        "id": 153823509,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461793920
    },
    {
        "content": "<p>A schematron is part of the way there. Profiles are the next step and then valueset bindings/reference existence checks...<br>\nIf you are just looking for insurance, probably best approach is to use the core FHIR Validator package (yes its java) and jsut run over your content.<br>\nBut that's no good if you want it as part of your server.</p>",
        "id": 153823510,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461794053
    },
    {
        "content": "<p>I suspect the java validator would be too much of a 'force-fit' for our developers to use routinely. And yes, ideally it would be very beneficial to be able to embed a native .Net library in various places.</p>",
        "id": 153823514,
        "sender_full_name": "David Fallas",
        "timestamp": 1461794296
    },
    {
        "content": "<p>Our server will be doing this using the fhirpath and additional internal logic (profile checking)</p>",
        "id": 153823515,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461794587
    },
    {
        "content": "<p>And yes, the javavaidator could be a force-fit.<br>\nBut you could wire it up in a unit tester in your build environment (so they dont have to remember to do it)</p>",
        "id": 153823516,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461794634
    },
    {
        "content": "<p>Thanks for the suggestions here Brian - I'll look into fhirpath. Note though, that I am including v2 (i.e v2xml) messages in addition to FHIR resources as candidates for validation by the same Schematron library - we know we are going to have to handle both in tandem for a number of years to come! I'll keep on searching for a way to get .Net to do this.</p>",
        "id": 153823517,
        "sender_full_name": "David Fallas",
        "timestamp": 1461794910
    },
    {
        "content": "<p>Thanks. The fhirpath expressions in the current DSTU2 lib are not 100%, but I will talk with Grahame as to how we might get the updated ones in there.</p>",
        "id": 153823518,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461794993
    },
    {
        "content": "<p>HI David, yes, too bad Microsoft just stopped updating their xpath library (in favor of LINQ to XML). We have had some sketchy xpath 2 support for the invariants in the spec by using the extension interface of the xpath engine, but obviously, we could not support new language constructs. So, for now, I am focusing on supporting the FluentPath language in .NET - since the new FHIR spec will have the invariants translated to this new constraint language.  So as for the xpath - I've given up on it. </p>",
        "id": 153823523,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461810425
    },
    {
        "content": "<p>Hi Ewout, thanks for confirming that - I pretty much found out the same during the last few days. It is a shame that xslt2 was dropped from the MS roadmap - nevermind. I will try to school myself with some of the FluentPath spec.</p>",
        "id": 153823525,
        "sender_full_name": "David Fallas",
        "timestamp": 1461810641
    },
    {
        "content": "<p>the latest expressions for the montreal freeze are available from <a href=\"http://fhir3.healthintersections.com.au/index.html\" target=\"_blank\" title=\"http://fhir3.healthintersections.com.au/index.html\">http://fhir3.healthintersections.com.au/index.html</a></p>",
        "id": 153823554,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461824582
    },
    {
        "content": "<p>you can use fluent path against v2 as well, though that would require additional work </p>",
        "id": 153823556,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461824599
    },
    {
        "content": "<p>there should be a C# version of the validator. In fact, I could easily produce that, given some specific work hapenning in the C# reference implementation </p>",
        "id": 153823558,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461824646
    },
    {
        "content": "<p>I'm wanting to get this done when time permits.</p>",
        "id": 153823560,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461824734
    },
    {
        "content": "<p>Happy to receive guidance Grahame ;)</p>",
        "id": 153823562,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461824752
    },
    {
        "content": "<p>well, if someone was to port the classes in org.hl7.fhir.instance.metamodel to C# - they're approximately what you need for many uses anyway </p>",
        "id": 153823568,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461825310
    },
    {
        "content": "<p>then translating the validator would be largely a java -&gt; C# automatible thing</p>",
        "id": 153823569,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461825341
    },
    {
        "content": "<p>Ewout and I were talking about this yesterday</p>",
        "id": 153823570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461825352
    },
    {
        "content": "<p>Hi Grahame - maybe you could point me to the code-base. I'm not that good with Java, but have written an Atlassian plugin or two so might be able to stumble my way through some of it. </p>",
        "id": 153823606,
        "sender_full_name": "David Fallas",
        "timestamp": 1461874945
    },
    {
        "content": "<p>On second thoughts, might be the best way for me to get to know the validator and fluentpath?</p>",
        "id": 153823607,
        "sender_full_name": "David Fallas",
        "timestamp": 1461874966
    },
    {
        "content": "<p>David, are you looking into using .NET or another plaform?</p>",
        "id": 153823611,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461877494
    },
    {
        "content": "<p>Ewout, in my area we are mostly .Net so that's our developer's comfort zone.</p>",
        "id": 153823612,
        "sender_full_name": "David Fallas",
        "timestamp": 1461878140
    },
    {
        "content": "<p>Ideally, I'm aiming for a .Net library that we would make available on our in-house NuGet server. </p>",
        "id": 153823613,
        "sender_full_name": "David Fallas",
        "timestamp": 1461878543
    },
    {
        "content": "<p>Current version of the spec:<br>\n<code>http://hl7.org/fhir/2016May/fluentpath.html</code><br>\nand the dotnet code for this is here:<br>\n<code>https://github.com/ewoutkramer/fhir-net-fluentpath</code></p>",
        "id": 153823697,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461903429
    },
    {
        "content": "<p>I was working on the old version of this code that was in the dotnet fhir client to make it work on the model, but haven't been able to get back onto doing this since the split</p>",
        "id": 153823698,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461903498
    }
]