[
    {
        "content": "<p>Danish use-case: when scheduling for a specific kind of procedure (e.g. Cataract surgery) [as identified in appointment.serviceType] it is well known to the scheduling system as to what that entails in terms of resources, e.g. an operating room for 20 minutes, one eye surgeon for 15 minutes, 2 nurses for 30 minutes, etc. <br>\nThe Danish use case requires that one has the ability (when creating the appointment request) to modify the definition, e.g. \"this will be complicated, so let's schedule for longer than normal with an additional surgeon\". <br>\nQuestion is how one defines a serviceType using FHIR resources. <br>\nStructureDefinition propably - or does anybody see other options?</p>",
        "id": 153858111,
        "sender_full_name": "René Spronk",
        "timestamp": 1479808682
    },
    {
        "content": "<p>The HealthcareService resource?<br>\n(that you could discover from the services directory)</p>",
        "id": 153858202,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1479882369
    },
    {
        "content": "<p>ok, so the fact that I'd need a particular kind of surgeon and 2 nurses would be coded as part of the HealthcareService.characteristics. <br>\n(in the above use case) the client would (1) query for the 'cataract surgery' HealthcareService from some service directory, (2) clone that resource to create a new HealthCareService (to state that it needs more human resources, or a longer duration), (3) reference that cloned HealthCareService resource (probably as a contained resource, it has little value beyond the scope of this appointment request) in the appointment request.   </p>",
        "id": 153858210,
        "sender_full_name": "René Spronk",
        "timestamp": 1479890412
    },
    {
        "content": "<p>That doesn't feel right, not sure why right now.<br>\nIts sounding more like the new template  style resources (which I still need to get into more closely)<br>\nThis is really depending on where the complexities of the internal mesh with the external.<br>\nIs the duration the time that we are advising the client, or planning for each portion?<br>\n(I think the latter is what you're talking about)</p>",
        "id": 153858216,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1479892147
    },
    {
        "content": "<p>As I understand the Danish use-case, (a) the client queries for the \"default definition\" in terms of duration and resources (small r) associated with a clinical procedure [surgical procedures in their case], (b) they are allowed to modify that set of resources, (c) schedule an appointment with that modified set. <br>\na, b, and c are definitional/templaty in nature. </p>",
        "id": 153858289,
        "sender_full_name": "René Spronk",
        "timestamp": 1479906252
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192120\">@Allan Bro Hansen</span> or <span class=\"user-mention\" data-user-id=\"191765\">@Niels Christain Bach</span>  - any comments on the discussion thus far ?</p>",
        "id": 153858309,
        "sender_full_name": "René Spronk",
        "timestamp": 1479911603
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  - I have been sick for some days, and still am. Will surely like to give our input next week</p>",
        "id": 153858470,
        "sender_full_name": "Allan Bro Hansen",
        "timestamp": 1480071022
    },
    {
        "content": "<p>(Apologize for the late reply)<br>\nWe use a kind of template, let's call it AppointmentTemplate just to have a new name for it :-).<br>\nThe AppointmentTemplate holds a lot of default information for the Appointment.<br>\nE.g. <br>\n- the estimated participation time of certain kind of participants (E.g.: first 30 min: a Nurse, After 15 minutes, for 45 minutes: a Doctor) - like the requirement described by <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> <br>\n- patient arrivaltime offset in respect to appointment.starttime<br>\n- the actual service carried out (Appointment.description)<br>\n- default patient guidance<br>\nBefore booking an appointment the user must always choose a appointmentTemplate - the appointment keeps the reference to appointmentTemplate but does also keep it's own list of the AppoinemtTemplate-values (which may have been changed form the default). </p>\n<p>In FHIR we have modelled this AppointmentTemplate as a DomainRessource (we only include a limited sets of elements) and the Appointment has an extension holding a reference to the AppointmentTemplate. To perform a booking our FHIR-clients must state the AppointmentTemplate along with other mandatory elements of the Appointment.</p>",
        "id": 153860714,
        "sender_full_name": "Allan Bro Hansen",
        "timestamp": 1480953022
    }
]