[
    {
        "content": "<p>During the recent FHIR DevDays I spoke with those involved in the scheduling track, and they identified the use case to schedule an appointment with \"a OB GYN consultant\" at the location \"a OB GYN meeting room\". In an appointment request this makes sense (we also support this in v2). So how would one express this in FHIR? </p>\n<p>The Practitioner resource is always about a particular instance. Use of the Group resource seems to be a possible solution, to express the 'group of all OB-GYN consultants' (either explicitly or implicitly defined as being part of that group) </p>",
        "id": 153857969,
        "sender_full_name": "René Spronk",
        "timestamp": 1479728376
    },
    {
        "content": "<p>I think you are trying to specify the role or skill not the individual so I think neither Practitioner nor Group would be appropriate.</p>",
        "id": 153857972,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479730053
    },
    {
        "content": "<p>Well, group allows one to specify the characteristics of members in a group using a code/value pair. \"specialty = OB GYN consultant\" would work in this case. The nice thing is that this would also work for Groups of locations, or Groups of Devices. I want to schedule for a CT exam on \"a CT\".  <br>\nWhat's the alternative?</p>",
        "id": 153857989,
        "sender_full_name": "René Spronk",
        "timestamp": 1479740485
    },
    {
        "content": "<p>Why not use List?<br>\nSeems to be more appriopriate to me.</p>",
        "id": 153857991,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1479742028
    },
    {
        "content": "<p>Group also does not allow locations due to it's constraints in type and allowed member references</p>",
        "id": 153857992,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1479742206
    },
    {
        "content": "<p>With List one has to exhaustively list/reference all those contained in the list, which may or may not be desirable. Group allows one to define the \"properties\" of the group without having to explicitly identify them. As for group not supporting Locations - well, that can be changed.</p>",
        "id": 153858096,
        "sender_full_name": "René Spronk",
        "timestamp": 1479794768
    },
    {
        "content": "<p>I see. Group.characteristic is definitely more sophisticated than List.code.<br>\nHaving a second look, a scope of Group is \"To define a set of *possible* people, animals, devices, etc. that are of interest for some intended future healthcare-related activities\".  That pretty much contains scheduling.<br>\nSo that would mean to change Group for allowing Location and perhaps also PractionerRole to be referenced as well as an expansion of the GroupType value set.</p>",
        "id": 153858103,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1479803821
    },
    {
        "content": "<p>This is a question of what is being scheduled, what other things are being consiered, and what complexity is being exposed by the scheduling system.<br>\nThe system might be exposing slots to a patient where they get to choose the procedure (and the complexities of the room, practitioner and device are all hidden)<br>\nOr it might be exposing all of those and need to select appropriately.<br>\nScheduling is complex...<br>\nThe other resource you could consider is the HealthcareService resource.</p>",
        "id": 153858584,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1480242899
    },
    {
        "content": "<p>(sorry for the late reply)</p>",
        "id": 153858585,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1480242918
    }
]