[
    {
        "content": "<p>A new round of work is beginning on the SDC implementation guide. The SDC IG community has generally been dominated by the research community looking to gather data to use in secondary data analysis.</p>",
        "id": 153935646,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517961394
    },
    {
        "content": "<p>But forms and questionnaires permeate healthcare:  intake forms, psychological assessments, surgical checklists, eligibility checks, public health reporting forms, case report forms – the type and variety are nearly limitless.  Forms provide for efficient, tightly controlled data capture.  They can also be used for information display.  In FHIR, they act as a shareable, configurable user-interface for data.</p>\n<p>The challenge with forms is getting information into them and out of them.  Without standardized logic embedded in the form or customization of the EHR application, there’s no way to automatically fill out the form with information that’s already been captured.  The result is that end-users must re-key the same information multiple times, causing issues with efficiency and data quality.  Also, once data has been captured by a form, there’s often a need to expose it so that it can be queried as discrete observations, medications, allergies, etc.</p>\n<p>SDC phase 2 will establish expectations for rendering of questionnaires and will also define how forms can be populated from existing EHR data and also allow extraction of EHR data into a more queriable and exchangeable form.</p>",
        "id": 153935647,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517961425
    },
    {
        "content": "<p>I believe that all health record systems vendors should be interested in the SDC work - it's not purely a research interest. If you're interested in beng involved, please reach out to <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> so he can include you in discussions about telecom times, and other participation forum options. thanks</p>",
        "id": 153935648,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517961516
    },
    {
        "content": "<p>Currently, we are using custom logic to handle automatically filling data into forms. We've experimented with QuestionnaireResponses and using the linkId as a mapping resource to specific fhir resources. Has the SDC community solved this problem yet?</p>",
        "id": 153935838,
        "sender_full_name": "Jeremy Ward",
        "timestamp": 1518036668
    },
    {
        "content": "<p>have you looked at Questionnaire.item.definition?</p>",
        "id": 153935839,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518036706
    },
    {
        "content": "<p>linkId is intended to tie the QuestionnairResponse response to the Questionnaire, not to link questions to data sources/targets.  item.definition is one mechanism, though we're also looking at more computable mechanisms such as StructureMap or embedded FHIRPath mappings.</p>",
        "id": 153935849,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518037382
    },
    {
        "content": "<p>Do you have any examples of a useful Questionnaire.item.definition ?</p>",
        "id": 153935860,
        "sender_full_name": "Jeremy Ward",
        "timestamp": 1518038022
    },
    {
        "content": "<p>References to LOINC codes are one option</p>",
        "id": 153935883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518043046
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/us/sdc/questionnaire-sdc-profile-example-ussg-fht.xml.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/sdc/questionnaire-sdc-profile-example-ussg-fht.xml.html\">http://hl7.org/fhir/us/sdc/questionnaire-sdc-profile-example-ussg-fht.xml.html</a></p>",
        "id": 153935884,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518043111
    },
    {
        "content": "<p>That example doesn't have item.definition values in it (but does have LOINC)</p>",
        "id": 153935921,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1518054407
    },
    {
        "content": "<p>Umm, I see &lt;definition elements all over the place in it...</p>",
        "id": 153936100,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518059711
    },
    {
        "content": "<p>Those don't look like valid definition properties, the look like the old DataElement format, not the new ElementDefinition format (<a href=\"http://hl7.org/fhir/stu3/questionnaire.html#2.38.5.4\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3/questionnaire.html#2.38.5.4\">http://hl7.org/fhir/stu3/questionnaire.html#2.38.5.4</a>).<br>\ne.g. <a href=\"http://hl7.org/fhir/StructureDefinition/Observation#Observation.value[x]\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/Observation#Observation.value[x]\">http://hl7.org/fhir/StructureDefinition/Observation#Observation.value[x]</a><br>\n(on re-reading that section it does talk about the implicitly defined LOINC codes part that I missed)</p>",
        "id": 153936667,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1518217821
    },
    {
        "content": "<p>The SDC calls have now been scheduled.  They will run at 5pm Eastern on Thursdays.  Call information can be found <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Structured_Data_Capture\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Structured_Data_Capture\">here</a>.   Discussion will happen on the new <a class=\"stream\" data-stream-id=\"102\" href=\"/#narrow/stream/questionnaire\">#questionnaire</a> stream.  Subscribe to it if you're interested in following the project's progress.</p>",
        "id": 153938032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518742751
    },
    {
        "content": "<p>Reminder that the SDC calls will start tomorrow.</p>",
        "id": 153939554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519265488
    }
]