[
    {
        "content": "<p>Reading and implementing the data extraction docs (<a href=\"http://build.fhir.org/ig/HL7/sdc/extraction.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/sdc/extraction.html\">http://build.fhir.org/ig/HL7/sdc/extraction.html</a>), I'm curious why the questionnaire-itemContext extension (<a href=\"http://build.fhir.org/ig/HL7/sdc/extension-sdc-questionnaire-itemContext.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/sdc/extension-sdc-questionnaire-itemContext.html\">http://build.fhir.org/ig/HL7/sdc/extension-sdc-questionnaire-itemContext.html</a>) type is valueExpression, as opposed to something like a code from to <a href=\"http://hl7.org/fhir/ValueSet/resource-types\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/resource-types\">http://hl7.org/fhir/ValueSet/resource-types</a> . Is the intention that the context can be, for example, a full Fhirpath expression to an element of a resource? The descriptions of the extension suggest otherwise -  \"identify the resource that will serve as the context for any extraction\" and \"identifies the resource (or set of resources for a repeating item)\" - but being able to use the complete expressiveness of Fhirpath seems very useful.</p>",
        "id": 177547644,
        "sender_full_name": "Gabriela Brown",
        "timestamp": 1570473819
    },
    {
        "content": "<p>It's not enough to just know a resource type.  The context will identify the resource type, but it  will also identify the existing resource to be updated.  If there isn't a resource found, then you know it's an update.</p>",
        "id": 177558890,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570481123
    },
    {
        "content": "<p>Curious what the workflow around Questionnaire/QuestionnaireResponses is supposed to be here. The itemContext extension is on the Questionnaire, not the QuestionnaireResponse, so it needs to be shared by all referencing QuestionnaireResponses. This implies that the extension expression should be general to a resource type, not specific to a resource instance. Then how do we know to resolve a context resource for an update? Is it from the QuestionnaireResponse.subject? Or we have to check for Questionnaire.items nested under itemContext that have an id element in the definition? Can an update only happen if extract is preceded by populate and sets the right reference information? The docs mention: </p>\n<p>\"If the context resource existed and was used in the population of the resource and data has changed, the resource will typically be updated. (Note that this means the system must capture the resource ids as hidden items in the Questionnaire so they're available for update.)\"</p>\n<p>But I'm not certain how to interpret it.</p>",
        "id": 183799086,
        "sender_full_name": "Gabriela Brown",
        "timestamp": 1576709874
    },
    {
        "content": "<p>The itemContext would be a query or expression that, based on launchContext or other information filled in for a given QuestionnaireResponse allows identifying the context for a set of questions.  You would evaluate the itemContext in the context of that particular QuestionnaireResponse (and in the context of the specific item that's being populated).  On an extract, you're not going to be able to update typically unless you've got an id (whether from an extract or by other means).</p>",
        "id": 183800242,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576710960
    }
]