[
    {
        "content": "<p>We are currently looking at building patient based questionnaires (eg. Oxford Hip Score - patient reported pain).<br>\nThis specific questionnaire is not represented in LOINC as is other questionnaires, such as the PHQ-9 (<a href=\"https://s.details.loinc.org/LOINC/44261-6.html?sections=Comprehensive\" target=\"_blank\" title=\"https://s.details.loinc.org/LOINC/44261-6.html?sections=Comprehensive\">https://s.details.loinc.org/LOINC/44261-6.html?sections=Comprehensive</a>) - completely LOINC coded for both questions and answers.</p>\n<p>For the purpose of displaying information outside of the context of a questionnaire to other clinical users (eg. Observation of \"Patient has reported moderate hip pain\"), it is known that when using an existing captured concept - the observation concept must hold semantic value outside of the context of the original source (ie. the patient questionnaire).</p>\n<p>Currently the best option for patient questionnaire coding:<br>\nQUESTION:<br>\n- LOINC question code, must match word for word<br>\n  - IF no appropriate LOINC code, use SMCT Post-coordinated expression to represent question<br>\nANSWER:<br>\n- SNOMED CT post-coodinated expression to represent semantic value of observation (ie. body site, severity...)</p>\n<p>I would be interested in peoples opinions and views on this.</p>",
        "id": 153896783,
        "sender_full_name": "Michael Hosking",
        "timestamp": 1499891530
    },
    {
        "content": "<p>Seems like a reasonable strategy to me.  Only other comment is that it's possible that some questions (or answers) might not be expressible with LOINC or post-coordinated SNOMED, so you may occasionally need to supplement with other code systems, including locally-defined codes.</p>",
        "id": 153896787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499895704
    },
    {
        "content": "<p>Thanks Lloyd, <br>\nAgreed - we may not be able to achieve semantic matching and alternatives codes (local or otherwise) may need to be used/created (but avoided where possible)</p>",
        "id": 153896790,
        "sender_full_name": "Michael Hosking",
        "timestamp": 1499896928
    },
    {
        "content": "<p>See <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Code.20only.20Observation.20valid.3F\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Code.20only.20Observation.20valid.3F\">https://chat.fhir.org/#narrow/stream/implementers/topic/Code.20only.20Observation.20valid.3F</a> (starting with my June 22 comment), which was a recent discussion about using SNOMED in Observation.code to represent a question -- such as vomiting -- and then using a SNOMED qualifier in Observation.value to represent the answer -- such as present or absent.  As part of this discussion, I mentioned <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13318\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13318\">GF#13318</a>, which I had logged to ask for additional Observation examples that include SNOMED in the Observation.code.  While the tracker isn't resolved yet, I think there is general agreement to include such examples and guidance.</p>",
        "id": 153896879,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1499968079
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191360\">@Michelle M Miller</span>,<br>\nI'm looking into this now with our team to understand how this might work. Appreciate the suggestions :)</p>",
        "id": 153904526,
        "sender_full_name": "Michael Hosking",
        "timestamp": 1504650123
    }
]