[
    {
        "content": "<p>Any ideas on how to model a second opinion that was requested by a patient? If the patient is allowed to upload or sends it to the clinic, how does it make it to patient's health record? <br>\nI see an entry here, but doesnt seem to be used anywhere. <a href=\"https://hl7-fhir.github.io/v2/0282/index.html\" target=\"_blank\" title=\"https://hl7-fhir.github.io/v2/0282/index.html\">https://hl7-fhir.github.io/v2/0282/index.html</a></p>",
        "id": 153820097,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1459989766
    },
    {
        "content": "<p>What are you wanting to capture?  Just a second observation/assessment?  An alternative care plan?  A linkage between either of those to the original indicating that it's a requested second opinion for the first?</p>",
        "id": 153820098,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459990106
    },
    {
        "content": "<p>I think it is more of a second assessment / clinical notes. Let me illustrate with an example. Suppose patient who is diagnosed with cancer will seek out specialists (either to learn about other treatment options, available clinical trials etc..)  who may not be part of the same health system. The assessment by that expert can be shared with the patient (via an email or via a PHR system - to which both the Patient and Doctor may have access to). How does this assessment make it to the patient's health record? </p>",
        "id": 153820119,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1460005779
    },
    {
        "content": "<p>And what constitute's the \"patient's health record\"?  The original provider's system?  (Some might say that simply making it to the PHR constitutes being part of the patient's health record.)</p>",
        "id": 153820286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460041020
    },
    {
        "content": "<p>Right. I see your point that it will be the original provider's system in this case even though the patient independently obtained the second opinion. Now when the patient sees the original provider and shares the second opinion - if it is general notes (using whatever format), what would be the resource in FHIR where this artifact will aptly fit? <br>\nThanks!</p>",
        "id": 153820434,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1460069638
    },
    {
        "content": "<p>Could be a few things.  CarePlan, ClinicalImpression, Observation, DiagnosticReport.  Could even be a FHIR Document containing a bunch of different things.  It really depends what those notes are about.  The PatientCare work group is also discussing the possibility of a ClinicalNote resource, which might also fit the bill, though that's still on the drawing board and hasn't been approved yet.</p>",
        "id": 153820439,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460083328
    },
    {
        "content": "<p>Provenance of that second opinion is an important record. Like any data that comes into a system from outside, recording where it came from is important to trustability.</p>",
        "id": 153821201,
        "sender_full_name": "John Moehrke",
        "timestamp": 1460465294
    }
]