[
    {
        "content": "<p>I've run into a security issue I'm interested in opinions on</p>",
        "id": 153914243,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508206661
    },
    {
        "content": "<p>say that you have a server that allows a client to PUT to a new location</p>",
        "id": 153914245,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508206726
    },
    {
        "content": "<p>(some servers allow this - it's a valid option for some use cases)</p>",
        "id": 153914246,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508206743
    },
    {
        "content": "<p>now, a server is serving a client with a user session - e.g. from Smart on FHIR - that is restricted to only resources linked with one patient</p>",
        "id": 153914247,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508206793
    },
    {
        "content": "<p>and this client PUTs a new resource to a location that is already in use for another patient</p>",
        "id": 153914248,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508206811
    },
    {
        "content": "<p>If its already in use, its not a new resource?</p>",
        "id": 153914249,
        "sender_full_name": "Jim Steel",
        "timestamp": 1508206841
    },
    {
        "content": "<p>no, but as far as the  client is concerned it is, because if they do a GET on that location, they'll geta 404 not found</p>",
        "id": 153914250,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508207025
    },
    {
        "content": "<p>Why do they get a 404 and not a 401?</p>",
        "id": 153914251,
        "sender_full_name": "Jim Steel",
        "timestamp": 1508207084
    },
    {
        "content": "<p>or 403...</p>",
        "id": 153914252,
        "sender_full_name": "Jim Steel",
        "timestamp": 1508207149
    },
    {
        "content": "<p>see <a href=\"http://hl7.org/fhir/security.html#AccessDenied\" target=\"_blank\" title=\"http://hl7.org/fhir/security.html#AccessDenied\">http://hl7.org/fhir/security.html#AccessDenied</a></p>",
        "id": 153914253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508207433
    },
    {
        "content": "<p>and the question really relates to this section - you can't return a 404 if the operation is PUT POST DELETE</p>",
        "id": 153914254,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508207474
    },
    {
        "content": "<p>so I'm interested in <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> opinions</p>",
        "id": 153914255,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508207490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> there's an impact to SD from this as well - what should a server do if a client requests for a document to be generated, and the user doesn't have the rights to all the resources they're asking for? fail gracefully, or blow up?</p>",
        "id": 153914289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508210103
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - This is an interesting scenario. I understand the concept but do you have a concrete example of a URI that the client decides with their PUT that would already exist (but not visible to them for security purposes)</p>",
        "id": 153914296,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508210603
    },
    {
        "content": "<p>well, I'm testing with this now. PUT [base]/Observation/1 where Observation/1 already exists, and is assocaited with Patient/example, but the client session is restricted to Patient/1</p>",
        "id": 153914299,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508210902
    },
    {
        "content": "<p>I cannot think of a status that doesn't allow the client to use PUT to determine the existence of a resource</p>",
        "id": 153914302,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211267
    },
    {
        "content": "<p>If we return anything other than a 2xx response the client can simply retry the PUT with a different id and if it succeeds, they know a resource exists at the other id</p>",
        "id": 153914304,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211460
    },
    {
        "content": "<p>no indeed. that's kind of my point. I couldn't think of one either. Wanted to check I hadn't overlooked anything. Especially since security made such a big deal about this</p>",
        "id": 153914305,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508211468
    },
    {
        "content": "<p>I think we need to add a note to that section about the 404 supression only working for get not the other operations</p>",
        "id": 153914306,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508211490
    },
    {
        "content": "<p>However, I think PUT with some URI id that can collide easily is a bad idea</p>",
        "id": 153914307,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211510
    },
    {
        "content": "<p>405 doesn't work?</p>",
        "id": 153914308,
        "sender_full_name": "Jim Steel",
        "timestamp": 1508211558
    },
    {
        "content": "<p>i guess its no better than 403 in terms of concealing the id space</p>",
        "id": 153914309,
        "sender_full_name": "Jim Steel",
        "timestamp": 1508211592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> - No. The server on a 405 must respond with the allow methods on that URI and if the user is not authorized, they will get no methods. This now leaks that the resource exists</p>",
        "id": 153914310,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211623
    },
    {
        "content": "<p>I chose simple ids for ease of testing and description. In production, you'd expect to use UUIDs and this would be very unlikely.. unless we think about malicious use, say, on a patient portal</p>",
        "id": 153914311,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508211647
    },
    {
        "content": "<p>Really, anything than a 2xx reveals the existence of the resource (if the error can be resolved by simply replaying the tx with a different id)</p>",
        "id": 153914312,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211663
    },
    {
        "content": "<p>there's no way to stop leakage if write is allowed. What do you do about this?</p>",
        "id": 153914313,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508211668
    },
    {
        "content": "<p>I can't see any around it. at the end of the day, the client must be able to attempt to create, and be told whether or not it was successful</p>",
        "id": 153914314,
        "sender_full_name": "Jim Steel",
        "timestamp": 1508211682
    },
    {
        "content": "<p>Don't allow PUT?</p>",
        "id": 153914315,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211688
    },
    {
        "content": "<p>though leaking that a resource you can't see exists doesn't really mean anything</p>",
        "id": 153914316,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508211697
    },
    {
        "content": "<p>This problem doesn't exist for POST</p>",
        "id": 153914317,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211701
    },
    {
        "content": "<p>no, but do you allow updating a resource? then you allow a PUT</p>",
        "id": 153914318,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508211715
    },
    {
        "content": "<p>Yeah, you're not leaking the resources themselves, only their ids (and then only by guesswork, not in the form of a list</p>",
        "id": 153914319,
        "sender_full_name": "Jim Steel",
        "timestamp": 1508211726
    },
    {
        "content": "<p>True, leaking a resource URI is less bad than the full resource. Leaking resource URIs is really bad when the URI itself tells you information (eg, /patients/123/hiv-results/456 &lt;--not FHIR but you get the example)</p>",
        "id": 153914320,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211810
    },
    {
        "content": "<p>In REST, POST can be used to update a resource; you don't have to use PUT</p>",
        "id": 153914321,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211854
    },
    {
        "content": "<p>yes. but in practice, sensitive resources will not have semantic ids (unlike conformance resources which might)</p>",
        "id": 153914322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508211872
    },
    {
        "content": "<p>Agreed</p>",
        "id": 153914323,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508211886
    },
    {
        "content": "<p>it doesn't matter if you use POST or PUT to a known resource.</p>",
        "id": 153914324,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508211891
    },
    {
        "content": "<p>I was thinking of POSTing to the collection (eg, /thing) rather than the resource (/thing/123)</p>",
        "id": 153914325,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508212040
    },
    {
        "content": "<p>But I guess if you don't have access to view the entire collection (/thing) now we're back to the initial problem</p>",
        "id": 153914326,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508212075
    },
    {
        "content": "<p>yep</p>",
        "id": 153914327,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508212084
    },
    {
        "content": "<p>it's a little easier if you say that you can't PUT or POST to a resource that doesn't exist; then you can always say 'not found' if there's no access.</p>",
        "id": 153914328,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508212154
    },
    {
        "content": "<p>In my implementation I chose to return 401 Unauthorized. And a TODO: \"Check whether this leaks too much information on existing resources to the user.\", so I would have come to the same question as you Grahame :-)<br>\nAnd how about 409 Conflict?</p>",
        "id": 153914424,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1508248464
    },
    {
        "content": "<p>Presuming that the id in itself does not leak information.</p>",
        "id": 153914425,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1508248524
    },
    {
        "content": "<p>Well, if you're hitting up the local HIV clinic for [base]/Patient/[known patient id]/Condition/[search the possible identifier space], that may be leaking more information than is safe.  Granted, it's dependent on knowing the patient id, so if that risk is managed, so is the leaking.  In general, compartments allow for the possibility of greater leaking, so they should be used cautiously.</p>",
        "id": 153914430,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508249271
    },
    {
        "content": "<p>I think we should add a note in the security section, and a cross reference in the section about allowing PUT to a new location</p>",
        "id": 153914520,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508277040
    },
    {
        "content": "<p>just catching up... and you all seem to have come to the understanding. The guidance on authorization failure codes is intended to provide security considerations, it is not demanding any specific policy. If your risk assessment allows exposing 'some' information, because the benefit of that error code; then you are free to make that policy decision. We are just trying to warn the reader, especially clients that sometimes they might not get as specific of an error code because of security policy reasons.     The space you all have zeroed in on is a user/system that is Authorized to PUT, but is somehow not trusted to see a collision. This is a very small exposure to a client that you know, and have a high trust for. As was also said, there are usecases for trusting a POST, while not trusting for anything else; thus trusting POST would be less risk than PUT.</p>",
        "id": 153914753,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508351695
    },
    {
        "content": "<p>Im happy for someone to recommend improvements of the text based on this thread. I however am not clear what that might be, without also taking up many paragraphs to explain the specific case.</p>",
        "id": 153914754,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508351768
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14072\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14072\">GF#14072</a></p>",
        "id": 153915239,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508703297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Getting back to this a bit late. Let's use the use case of someone with HIV as a Condition and someone without permission tries to access the document. In CDA we would probably represent this by including a Problem Observation where everything is nulled out (@nullFlavor = MSK or something similar), but the rest of the document would show as usual. Not sure how we would represent this in FHIR though. Generate the document and include the reference to the resource but not copy it into the bundle? That way someone with proper permissions could theoretically retrieve it later, but how do we flag that it was omitted for privacy/permission reasons?</p>",
        "id": 153918046,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1510076477
    },
    {
        "content": "<p>Provided that the user has some rights, that is enough rights to know that they got a redacted object... (See  <a href=\"http://build.fhir.org/security.html#AccessDenied\" target=\"_blank\" title=\"http://build.fhir.org/security.html#AccessDenied\">http://build.fhir.org/security.html#AccessDenied</a> )  Then the object can be tagged as REDACT or some other appropriate tag <a href=\"http://build.fhir.org/v3/ActCode/cs.html#v3-ActCode-REDACT\" target=\"_blank\" title=\"http://build.fhir.org/v3/ActCode/cs.html#v3-ActCode-REDACT\">http://build.fhir.org/v3/ActCode/cs.html#v3-ActCode-REDACT</a></p>",
        "id": 153918052,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510078752
    },
    {
        "content": "<p>sure or you could use the masked data absent reason.</p>",
        "id": 153918118,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510101123
    },
    {
        "content": "<p>But in most cases, the ruling is that you can't tell people about the information they don't know because knowing it is there is enough to infer what is being kept from view anyway</p>",
        "id": 153918119,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510101170
    },
    {
        "content": "<p>Grahame, there are plenty of policies that would agree with you, but there are other policies that allow for letting the user know that they have not received everything. A well known example is the one that precedes a 'break-glass' opportunity. Where the user gets only \"N\" Normal data, with an indication that break-glass would reveal more information. They make the determination that within-policy they are correct in declaring a break-glass emergency, they indicate they are breaking-glass, they get \"R\" Restricted data too.. Also, their broken-glass is recorded in an audit log, the Privacy and Safety office review that, and either praise the clinician for saving a life or punish them for violating policy.</p>",
        "id": 153918191,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510152265
    },
    {
        "content": "<p>In our system, we usually tell them anytime they may have additional information, even if they wouldn't always. EG: we know they don't have access to all facilities, even if the patient doesn't have data at those facilities. When they break the glass, they may not actually get more info</p>",
        "id": 153918203,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1510154194
    }
]