[
    {
        "content": "<p>I'd like to reach out to the community and ask for examples or guidance around using encryption with FHIR implementations - are production systems using SMART on FHIR? <br>\nAnyone using end-to-end encryption? And how?<br>\nI would look for comparative analysis of possible options, advantages disadvantages, or examples of success (or failure).<br>\nIdeally any risk-oriented analysis, with risks and mitigations</p>",
        "id": 199246001,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1590828022
    },
    {
        "content": "<p>Or even simple statements of \"this is how we are doing this in out system / country\"</p>",
        "id": 199246008,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1590828067
    },
    {
        "content": "<p>There is a Security and privacy stream. Perhaps you find ideas/answers there.</p>",
        "id": 199252049,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1590837780
    },
    {
        "content": "<p>This implementers stream is a broader channel, and I want to seek information or awareness from a broader group about such comparisons, preferences, guidelines etc. from implementers, not only from security-minded people (I've discussed some details there).<br>\nAny pointers are welcome</p>",
        "id": 199252420,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1590838333
    },
    {
        "content": "<blockquote>\n<p>are production systems using SMART on FHIR</p>\n</blockquote>\n<p>Yes. EHR that have public-facing FHIR end points in the US uses SMART on FHIR for authorization (eventually all providers and health plans in the US would use it, it is mandated by regulation)</p>",
        "id": 199256370,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1590844461
    },
    {
        "content": "<p>Is there any documented rationale for that choice, e.g. comparison between using SMART and another alternative?</p>",
        "id": 199258817,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1590848371
    },
    {
        "content": "<p>Curious about what is happening in Germany and north Europe in terms of transport security -</p>",
        "id": 199258884,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1590848449
    },
    {
        "content": "<p>AFAIk the Dutch MedMij projects is based on SMART-like usage of OAuth2 and scopes.</p>",
        "id": 199262111,
        "sender_full_name": "René Spronk",
        "timestamp": 1590852753
    }
]