[
    {
        "content": "<p>Hi All</p>\n<p>Just to add a little bit of background. I have a requirement to load multiple organizations data onto a single FHIR instance. Loading the organizations and their unique identifiers is relatively simple based on the provided documentation. The only caveat is that not all organizations can access all other organizations' data. I have an external authentication and authorization service that I use to manage access to the fhir integration.</p>\n<p>So the process that we will follow is that a client will get a client id and secret that will be exchanged for a short lived access token (oauth2). The access token will be of type JWT with scope claims including allowed organizations, etc. When a resource is then requested, the claims will filter out results the user is not allowed to see. </p>\n<p>From what I understand the security labels in the FHIR specification is to be used to filter out data that is not allowed to be seen by the requesting user. </p>\n<p>That all being said. The way I wanted to implement this, was to add an \"organization\" claim to the jwt token, which is the primary organization the user belongs to. When that user then submits a resource, that organization claim is then stored under the security label on the resource. So when another resource then requests access to the resource, that user will need to have the relevant organization as part of his scope claim to access the details.</p>\n<p>I also have a question around the Provenance and audit requirements. Is this a hard requirement that this information is stored in the FHIR server?</p>\n<p>Would this be a correct approach to solve the authorization problem? I hope this is enough information. I used the information provided here: <a href=\"https://smilecdr.com/docs/security/smart_on_fhir_introduction.html\">https://smilecdr.com/docs/security/smart_on_fhir_introduction.html</a> and here: <a href=\"https://www.hl7.org/fhir/security.html\">https://www.hl7.org/fhir/security.html</a></p>",
        "id": 206556100,
        "sender_full_name": "Ivan May",
        "timestamp": 1597138385
    },
    {
        "content": "<p>Suggest you ask this on the <a class=\"stream\" data-stream-id=\"179247\" href=\"/#narrow/stream/179247-Security-and-Privacy\">#Security and Privacy</a> channel</p>",
        "id": 206561561,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597143120
    },
    {
        "content": "<p>ah sorry and thanks!</p>",
        "id": 206567987,
        "sender_full_name": "Ivan May",
        "timestamp": 1597148753
    }
]