[
    {
        "content": "<p>A new <a href=\"https://confluence.hl7.org/display/AP/2021+Projects\">Argonaut project for 2021</a> is to provide guidance for supporting FHIR “write” use cases to an EHR. We have agreed to include the following Patient Generated Data categories as in scope use cases:</p>\n<ul>\n<li>Vitals (e.g. : Weight, Blood Pressure)</li>\n<li>Activity (e.g. Steps)</li>\n<li>At home diagnostics (Blood Glucose, Covid 19 Test)</li>\n<li>Sleep</li>\n<li>Medications</li>\n<li>PROS/Assessments</li>\n</ul>\n<p>We would like feedback from the FHIR Implementer community for additional categories that we may have omitted.</p>\n<p>Note that the Patient Empowerment Work Group is currently working on a <a href=\"http://build.fhir.org/ig/HL7/fhir-patient-correction/index.html\">Patient Corrections IG</a> and things like Demographic Updates are <em>out of scope</em>.</p>",
        "id": 235229904,
        "sender_full_name": "Eric Haas",
        "timestamp": 1618858306
    },
    {
        "content": "<p>for more information on this project see the <a href=\"https://confluence.hl7.org/display/AP/Argo+Write+Homepage\">Argo Write Homepage</a></p>",
        "id": 235230156,
        "sender_full_name": "Eric Haas",
        "timestamp": 1618858412
    },
    {
        "content": "<p>Patient Empowerment is also working on a paper. I am sure they will very much prefer to put their attention on an IG.</p>",
        "id": 235231883,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618859071
    },
    {
        "content": "<p>Immunizations (not all immunizations are given in a medical setting, I received some in a business setting prior to a business trip to India)</p>",
        "id": 235232048,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618859133
    },
    {
        "content": "<p>Allergies and Intolerance</p>",
        "id": 235232061,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618859140
    },
    {
        "content": "<p>what is \"PROS\"?</p>",
        "id": 235232193,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618859184
    },
    {
        "content": "<p>patient reported outcomes</p>",
        "id": 235232947,
        "sender_full_name": "Eric Haas",
        "timestamp": 1618859477
    },
    {
        "content": "<p>how about Problems and Goals?</p>",
        "id": 235243241,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618863972
    },
    {
        "content": "<p>how about uploaded documents (DocumentReference and/or Composition) -- as received from other health activities that are not otherwise connected</p>",
        "id": 235243349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618864039
    },
    {
        "content": "<p>QuestionnaireResponse seems appropriate, though I think that's already supported?</p>",
        "id": 235278802,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618885968
    },
    {
        "content": "<p>Pain would come to mind as a specific category, oftentimes administered as a VAS with a result from 0..10, but the concept of a VAS is still hard to cleanly express as a FHIR Questionnaire. Symptom/pain location is another one I am seeing in paper questionnaires (circling on a stylised body image where you have the pain or the itch, or the wound). And photograph upload, e.g. of rashes, wounds, inflammations, etc.</p>",
        "id": 235388197,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1618941916
    },
    {
        "content": "<p>photographs would mean DocumentReference, which could be useful to share a bunch of things - though it might overwhelm providers some.</p>",
        "id": 235424864,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618957013
    },
    {
        "content": "<p>The photograph piece is becoming more and more requested in \"early discharge\" and \"hospital at home\" scenarios. You discharge patients a few days earlier and let them document the progress of their healing through a camera. This has accelerated quite a bit due to the pandemic along with many other patient-facing virtual care use-cases. So the goal is not to let patients randomly send in pictures, but rather to agree with them that every day they would take a picture, take their temperature, and document symptoms and pain. This will then be looked at by nursing staff.</p>",
        "id": 235540371,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1619022340
    }
]