[
    {
        "content": "<p>Quick question for you. How does one record multiple value observations? Specifically, I'm looking at an observation in a cancer protocol that asks about body site for tumor invasion to adjacent tissues. Specifically, the protocol asks for the pathologist to \"Select all that apply\". Is this where one should slice valueCodeableConcept, tag each slice with a code for the bodysite that it represents, and then bind the componentvalue field to a \"present, not present\" ValueSet? Or would this \"select all\" question be recorded in FHIR as multiple observations all with the same code and a different valueset*? </p>\n<p>*meant to say bodysite</p>",
        "id": 153912887,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1507319414
    },
    {
        "content": "<p>the correct answer is multiple observations</p>",
        "id": 153912889,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507319938
    },
    {
        "content": "<p>or components... Which is how I seen or rather heard this type of multiple-choice-question-with-multiple-answers observation has been implemented.</p>",
        "id": 153912915,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507332680
    },
    {
        "content": "<p>Whether component makes sense depends on whether the answers would make sense if captured as separate Observations.  If they would, then separate observations should be used.  If all of the answers need to be looked at only as a collective, components is the appropriate choice.</p>",
        "id": 153912925,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507342755
    },
    {
        "content": "<p>Multiple observations would be more appropriate here then. Thank you.</p>",
        "id": 153912930,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1507356853
    },
    {
        "content": "<p>There was an invariant in DSTU2 that prevented us from using component, but we got that invariant removed (per <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9375\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9375\">GF#9375</a>).  As such, we may use component in STU3 (e.g. Alcohol Type with components of Wine, Beer, and Liquor) for the following reasons:</p>\n<ul>\n<li>Our internal system treats multi-select values/answers as a single observation because they share the same attributes (such as id, performer, effective date, status, comment....).  </li>\n<li>Treating these as independent observations introduces unintended consequences if an app tries to update/modify a \"shared\" attribute (e.g. effective date, performer, status, comment...) of a single observation -- as it will effectively update all observations (e.g. an app can't modify wine without also modifying beer and liquor).</li>\n<li>The Observation.comment could have any scope (ranging from a comment about one value or all values together).  Exposing each value as an observation would then risk taking the comment out of context (e.g. comment about wine showing up on the observation for beer).</li>\n</ul>",
        "id": 153913111,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1507555779
    },
    {
        "content": "<p>This is one of those cases where not all servers will be consistent.  The only question I'd have in Michelle's case is whether it's better to use Observation.component or to continue to use related observations, but to have them contained.  I think in both cases, you're not necessarily going to get information back consistently if you search presuming separate Observations.  Is there any guidance we could give to implementers here?</p>",
        "id": 153913116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507557218
    },
    {
        "content": "<p>It would suggest to me to use component...</p>",
        "id": 153913176,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507576484
    },
    {
        "content": "<p>Well these observations could be interpreted independently if necessary. I would rather they exist together as it could get messy when a single data entry question is producing any number of observations. However I could picture a situation where a researcher wants to look at all lung tumors that invade the visceral pleura specifically.</p>\n<p>My use case actually only depends on the interpretation as a whole of this observation or set of observations (invasion seen or not seen), but this situation has come up a number of times as I'll often use the CAP protocols to suggest how I should profile certain observations and the 'select all that apply' question is very common. Guidance would definitely be appreciated.</p>",
        "id": 153913302,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1507644272
    },
    {
        "content": "<p>I just logged <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14031\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14031\">GF#14031</a> asking for the Observation Grouping section (<a href=\"http://build.fhir.org/observation.html#10.1.4.1\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#10.1.4.1\">http://build.fhir.org/observation.html#10.1.4.1</a>) to address multi-valued observations (included a link to this thread as well as shared my earlier considerations for using component)</p>",
        "id": 153913625,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1507815785
    }
]