[
    {
        "content": "<p>Is it possible for a complex extension to reference itself?  For example an extension with two elements of 'name' and 'value' where 'value' could be a CodeableConcept or could be the whole extension?  (I realise this is a poor example but wondered whether it was possible.)</p>",
        "id": 153815166,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457699804
    },
    {
        "content": "<p>Extensions can contain extensions. Nothing says the extension can't contain itself, and in fact you could create the StructureDefinition for an Extension that does that. So yes, it is possible.</p>",
        "id": 153815167,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1457699996
    },
    {
        "content": "<p>How do you do that?  Do you constraint one of the value[x] elements to be of type Reference, referencing the extensions URI?</p>",
        "id": 153815168,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457700104
    },
    {
        "content": "<p>No, but I haven't done this... you could either have an element in your StructureDefinition with the path <code>Extension.extension.url</code> that is mapped to your extension URI... or you could use a \"primitive extension\" -- so the path would be <code>Extension.valueCodeableConcept.extension</code> I think... I haven't played too much with primitive extensions though, because I hate that they even exist.</p>",
        "id": 153815169,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1457700338
    },
    {
        "content": "<p>By the way, if you have comments about how complex extensions work, you may want to add your thoughts to the \"<a href=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Representing.20Extensions\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Representing.20Extensions\">Representing Extensions</a>\" topic</p>",
        "id": 153815170,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1457700484
    },
    {
        "content": "<p>OK, thanks - I will have a read through this thread later and see if I can contribute.</p>",
        "id": 153815171,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457701025
    },
    {
        "content": "<p>Johnny, I think you want to use the extension as the actual value, not as an extension on the value?  Extensions on extensions are always done as extensions on the Extension.value.  You could use Extension.valueExtension, though <a href=\"http://hl7.org/fhir/datatypes.html#open\" target=\"_blank\" title=\"http://hl7.org/fhir/datatypes.html#open\">http://hl7.org/fhir/datatypes.html#open</a> suggests this is not (yet) allowed. Extension.extension is used to represent nested complex extensions, so that's probably not what you're looking for.</p>",
        "id": 153815371,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1457947816
    },
    {
        "content": "<p>Ewout - thanks.  I think need to re-run though my example, Extension.extension may do the job.</p>",
        "id": 153815394,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457958153
    }
]