[
    {
        "content": "<p>We appear to have come across a discrepancy in behaviour in some library code that is not resolved by the STU3 FHIR documentation. Specifically, the Narrative element in a Composition resource has Narrative.div which is declared to be XHTML This is intended for display and is carried as XHTML irrespective of whether the Composition is serialised as JSON or as XML. But the examples show the XML serialisation carrying an XHTML namespace binding, but the JSON not doing so.</p>\n<p>We've see examples of both depending on which library has been used for serialisation, and which version (DSTU2 or STU3) it originally came from.</p>\n<p>I'm inclined to favour that the XHTML namespace declaration be included, since it is part of the formal definition of what you get out of Narrative.div when it is no longer (necessarily) able to benefit from the definition FHIR gives it. </p>\n<p>Is there a specification of what this behaviour should be and, if not, can there be ? (Composition is maturity level 2 so presumably there is room for improvement).</p>",
        "id": 153922948,
        "sender_full_name": "Damian Murphy",
        "timestamp": 1512479977
    },
    {
        "content": "<p>it should have a namespace declaration in json. where have you found examples that don't?</p>",
        "id": 153923033,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512500367
    },
    {
        "content": "<p>Here: <a href=\"http://hl7.org/implement/standards/fhir/narrative.html#xhtml\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/narrative.html#xhtml\">http://hl7.org/implement/standards/fhir/narrative.html#xhtml</a> though it just says \"text\" without being specific. One of my team reported its being produced without a namespace declaration, and I'll find out what he was using.</p>",
        "id": 153923067,
        "sender_full_name": "Damian Murphy",
        "timestamp": 1512511403
    },
    {
        "content": "<p>ah yes, so it does. It's making another point, but misses the namespace. I'll fix that</p>",
        "id": 153923251,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512592146
    }
]