[
    {
        "content": "<p>Is it ok to put the price into HealthcareService?</p>",
        "id": 153910750,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1506445794
    },
    {
        "content": "<p>In principle, we're going to need price information on activity definitions and a few other things too.  I'm torn between putting the price directly on the resource or having pricing information maintained separately with pointers to the resources that have costs.  The reason being that pricing can have contexts of time, who's paying and a few other things.  And it is often established and maintained by separate systems from the systems that define what services are available.</p>",
        "id": 153910796,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506457962
    },
    {
        "content": "<p>thx. Another question where to put CPT code for service - type, identifier?</p>",
        "id": 153910907,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1506502327
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  could you provide some examples of price information. In our case price also depends on location (city, state) and who is paying (insurance, Medicare or patient).</p>",
        "id": 153910908,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1506502807
    },
    {
        "content": "<p>My thought is having a BillableItem resource which would include the billing code (could be CPT), the cost, the effective period, the criteria, etc.  Plus either a code or a reference to the \"clinical\" definition of what the activity would be.</p>",
        "id": 153911008,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506523914
    },
    {
        "content": "<p>Would that fit under PA (and link to HealthcareService as Nicola needs) or better under FM?</p>",
        "id": 153911949,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1506995139
    },
    {
        "content": "<p>Doesn't really matter who takes the lead so long as the two of you coordinate</p>",
        "id": 153912012,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507010970
    }
]