[
    {
        "content": "<p>Do any servers support this, and how would the capability statement declare it?<br>\n<a href=\"http://test.fhir.org/r4\" target=\"_blank\" title=\"http://test.fhir.org/r4\">test.fhir.org/r4</a> appears to ignore _contained, unless I am using it wrongly (there seems no example usage in the spec)<br>\n<a href=\"http://test.fhir.org/r4/Provenance?_contained=true&amp;patient.name=rik\" target=\"_blank\" title=\"http://test.fhir.org/r4/Provenance?_contained=true&amp;patient.name=rik\">http://test.fhir.org/r4/Provenance?_contained=true&amp;patient.name=rik</a><br>\nfinds the same resource, whether or not I use _contained=true (and the self link strips it).</p>",
        "id": 190062021,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1583755794
    },
    {
        "content": "<p>So, maybe no servers implement searching into contained resources</p>",
        "id": 190382217,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1584015218
    },
    {
        "content": "<p>mine does</p>",
        "id": 190383459,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584016233
    },
    {
        "content": "<p>ah thanks, good to know. When I tested it as above links it did not seem to look at the _contained parameter, and the self link didn't echo it back, implying it is not supported. Is the URL above correctly formatted?</p>",
        "id": 190384599,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1584017017
    },
    {
        "content": "<p><a href=\"http://test.fhir.org/r4/\">http://test.fhir.org/r4/</a> didn't work when I tried it and isn't available for testing currently. Do any other servers support \"_contained\"? <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> <span class=\"user-mention\" data-user-id=\"195775\">@Michael Hansen</span> <span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span></p>",
        "id": 215700479,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604576608
    },
    {
        "content": "<p>No for Google, and no for Microsoft based on their docs. Not sure if HAPI supports it but it's not listed in their search docs so I'm guessing no.</p>",
        "id": 215731947,
        "sender_full_name": "Paul Church",
        "timestamp": 1604591983
    },
    {
        "content": "<p>Thanks Paul. It's strange that no one supports what seems a fairly important feature and one for which there is no workaround possible.</p>",
        "id": 215737028,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604593721
    },
    {
        "content": "<p>Searching inside contained resources is technically tricky. I have never heard of anyone needing this feature.</p>",
        "id": 215738117,
        "sender_full_name": "Paul Church",
        "timestamp": 1604594076
    },
    {
        "content": "<p>Well let me be the first ;-) <br>\nIf you need contained resources - and people do seem to - it doesn't seem unreasonable to be able to search them.</p>",
        "id": 215738413,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604594193
    },
    {
        "content": "<p>It seems that this basically breaks contained resources.</p>",
        "id": 215738699,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604594329
    },
    {
        "content": "<p>I do see some use of contained resources, but not searching on them. Because the contained resource is generally a stub or incomplete, it lacks a lot of the things one would normally search for. What's an example of a search that you need to do?</p>",
        "id": 215743787,
        "sender_full_name": "Paul Church",
        "timestamp": 1604596419
    },
    {
        "content": "<p>Contained is not only for stubs as such, it is also used when there is no desire to make a whole endpoint for a resource type, </p>\n<ul>\n<li>there is no independent life cycle - but you still want to use that resource. </li>\n</ul>\n<p>Hence you may have a full Medication resource contained in a MedicationRequest. Or a Substance in a Medication. And you would want to be able to search on the codes at least. But basically the search params of that resource type. There are examples of both of those in the build, so it's not completely esoteric.</p>",
        "id": 215745176,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604597026
    },
    {
        "content": "<p>But the general purpose fhir servers have an endpoint for every resource type. So our best practices are to split them out into normal resources.</p>",
        "id": 215745657,
        "sender_full_name": "Paul Church",
        "timestamp": 1604597216
    },
    {
        "content": "<p>The bullet item in this your message  <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  -- is this written somewhere in the FHIR spec, or supported by what you see there? The examples in <a href=\"http://build.fhir.org/search.html#containedType\">http://build.fhir.org/search.html#containedType</a> are (I'm assuming!) intended to represent a case where the medication has no identifying information other than a code.</p>",
        "id": 215745732,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1604597261
    },
    {
        "content": "<p>Idle speculation, I wonder if we can replace a lot of use cases for stub contained resources with identifier references.</p>",
        "id": 215745905,
        "sender_full_name": "Paul Church",
        "timestamp": 1604597320
    },
    {
        "content": "<p>\"No desire to make a whole endpoint\" is hard for me to interpret in terms of technical requirements/constraints/rationale, and introduces questions</p>",
        "id": 215745921,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1604597326
    },
    {
        "content": "<p>If you don't need to let people read or write them independently, then no endpoint is needed - less to bother with.</p>",
        "id": 215746427,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604597514
    },
    {
        "content": "<p>The Google implementation has one API endpoint called GetResource, it handles every DSTU2, STU3, and R4 resource type. The idea of separate API endpoints is not how we think about the world.</p>",
        "id": 215746799,
        "sender_full_name": "Paul Church",
        "timestamp": 1604597639
    },
    {
        "content": "<p>@Paul But where would the identifier reference point to? We want the resource to be embedded and not need its own endpoint, and still to exist in FHIR. An identifier reference is mainly for things that cannot be referenced by a FHIR url.</p>",
        "id": 215746891,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604597664
    },
    {
        "content": "<p>What I mean is if you only ever use Substance contained in Medication, then you need /myserver/Medication, but you don't need /myserver/Substance \"endpoint\".</p>",
        "id": 215747080,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604597749
    },
    {
        "content": "<p>It wouldn't point anywhere, in the case where the identifier is the only thing the server knows about the entity. I agree that if you know more about the resource, then this idea does not apply.</p>",
        "id": 215747204,
        "sender_full_name": "Paul Church",
        "timestamp": 1604597787
    },
    {
        "content": "<p>yes if you only have an identifier, then you don't need contained at all. But that is a different issue.</p>",
        "id": 215747330,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604597840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  it wasn't meant to emphasised as a bullet but zulip intervened :-) It's not a quote. </p>\n<p>But it's just a truism about contained resources. They don't have a lifecycle of their own. </p>\n<p>And there are examples of this e.g. <a href=\"http://hl7.org/fhir/medicationadministration0302.xml.html\">http://hl7.org/fhir/medicationadministration0302.xml.html</a></p>\n<p>If you only use that resource type as contained (which I would imagine is common, if you use it as contained at all), then you don't need the machinery of a restful endpoint for that resource type. </p>\n<p>You don't need people to write one resource then reference it from the other, or use a transaction. They just only ever use it as if it is an inline datatype.</p>\n<p>I'm not suggesting some sort of parallel API endpoint. Only that an implementation may want to not support that resource as an endpoint, but still use it contained. I want to use Task within a resource, to indicate a change request for it. I won't ever use that Task un-contained, so it doesn't need a /Task endpoint.</p>",
        "id": 215749840,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604598879
    },
    {
        "content": "<p>Normally you'd use chaining for that.  You wouldn't need _contained</p>",
        "id": 215760521,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604603731
    },
    {
        "content": "<blockquote>\n<p>I want to use Task within a resource, to indicate a change request for it.</p>\n</blockquote>\n<p>Oh my...  Is this really a good idea?</p>\n<p>In general, I think the guidance that contained resources should not be used to \"package\" things together is very important. In this case that one side doesn't want to expose an endpoint for Task, maybe they can receive a notification of a Task existing on the requester side and act on it?</p>\n<p>In the case of prescriptions, I would rather MedicationRequest have a reference to Substance (where the compound medication is described) in addition to code or a Medication resource. Having contained resources almost mandated for certain uses seems odd.</p>",
        "id": 215761909,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604604417
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/Server.20supporting.20_contained.20searches/near/215761909\">said</a>:</p>\n<blockquote>\n<p>In the case of prescriptions, I would rather MedicationRequest have a reference to Substance (where the compound medication is described) in addition to code or a Medication resource. Having contained resources almost mandated for certain uses seems odd.</p>\n</blockquote>\n<p>No, Medication is where the compound medication is described.  And the MedRequest/Dispense/Admin/Statement does have a reference to a Medication resource (CodeableReference).  I'm just pointing out that implementers are containing the Medication resource rather than creating them separately.</p>",
        "id": 215762163,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604604520
    },
    {
        "content": "<p>Containing Medication is fine.  Containing 'Task' is more problematic.  It'd be pretty unusual for Task to not have an independent identity.  \"I don't want to maintain an endpoint\" isn't a justification for using 'contained'.</p>",
        "id": 215762791,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604604809
    },
    {
        "content": "<blockquote>\n<p>No, Medication is where the compound medication is described. And the MedRequest/Dispense/Admin/Statement does have a reference to a Medication resource (CodeableReference). I'm just pointing out that implementers are containing the Medication resource rather than creating them separately.</p>\n</blockquote>\n<p>I was trying to point out that the requirement to have a Medication resource to describe compound medications is used as the reasoning behind containing Medication within MedRequest (I assume because there is no single record of the compund medication to be exposed as Medication resource?). If we had a substance backbone element within MedRequest that contained references to or codes of Ingredients to describe the compound medication, there would be no need to contain a Medication resource.</p>\n<p>With the addition of the new MedicinalProduct-related resources, think we need to revise the way medications are handled, and hopefully simplify some of the things that seem to get way too complicated.</p>",
        "id": 215765059,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604605810
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> yes sometimes a backbone would be good, but sometimes you want the same structure as a resource.  If something wants to act like a backbone sometimes and wants to act like a resource at others, that is what contained can do.</p>",
        "id": 215767639,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604607060
    },
    {
        "content": "<p>But if you can't search on it the use is limited</p>",
        "id": 215769099,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604607858
    },
    {
        "content": "<p>Excepting any other uses (or misuses), if Medication is going to be contained I can imagine that people will want to be able to search on it.</p>",
        "id": 215776598,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604611683
    },
    {
        "content": "<p>I think Lloyd's point was that contained or not, you can use chaining - did I misunderstand?</p>",
        "id": 215777342,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604612115
    },
    {
        "content": "<p>Just as an aside - this sounds like it would be a lot of work to implement in a performant way.</p>\n<p>If the contained resource is an element attached to its parent, the fields will not have been indexed for searching (and even things like full text index don't help for searches on date ranges, etc.).</p>\n<p>On the other hand, you cannot assume that contained fragments can be inserted into any normal tables directly.  At the very least, you'll need to modify any references/ids/etc. to restrict them to that particular bundle and make sure all the references link back up.</p>",
        "id": 215777687,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1604612306
    },
    {
        "content": "<p>I do not expect that a chained search can navigate into a contained resource. Is that something that other implementations support?</p>",
        "id": 215777884,
        "sender_full_name": "Paul Church",
        "timestamp": 1604612436
    },
    {
        "content": "<p>I probably misunderstood...</p>",
        "id": 215778514,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604612852
    },
    {
        "content": "<p>A chained search can <em>absolutely</em> navigate into a contained resource</p>",
        "id": 215783686,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604616096
    },
    {
        "content": "<p>That's how they're typically accessed when searching.  And that's certainly something supported by HAPI and Grahame's server</p>",
        "id": 215783762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604616132
    },
    {
        "content": "<p>The notion of using _contained was very late to the game and isn't widely supported</p>",
        "id": 215783790,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604616158
    },
    {
        "content": "<p>does _contained only affect the output? I thought it affected the search itself?</p>",
        "id": 215784360,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604616588
    },
    {
        "content": "<p>_contained changes what's being searched.</p>",
        "id": 215785822,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604617617
    },
    {
        "content": "<p>right, yes. But I now see that you can search into a contained Y in an X, using e.g. X?Y.code <br>\nThat doesn't need _contained.</p>",
        "id": 215786860,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604618359
    },
    {
        "content": "<p>As long as you know what is contained in what, that is enough.</p>",
        "id": 215786942,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604618413
    },
    {
        "content": "<p>When you're doing chaining, you don't care if it's contained or not.  MedicationRequest?medication.code=foo works whether the medication is contained or not.</p>",
        "id": 215790018,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604621065
    },
    {
        "content": "<p>How is that implemented? Do the contained resources have their own database rows that can be joined?</p>",
        "id": 215790349,
        "sender_full_name": "Paul Church",
        "timestamp": 1604621288
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span></p>",
        "id": 215790988,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604621787
    },
    {
        "content": "<p>I think that's the usual approach (it's what the SMART server did, back in the day)</p>",
        "id": 215800863,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1604630915
    },
    {
        "content": "<p>HAPI certainly does not support this, for all of the same reasons listed above: tricky to implement in a performant way, and at least personally most use cases I've seen where someone has wanted to do it have ultimately been because the person was trying to misuse contained resources (and therefore a workaround existed to just use a non-contained resource, or an identifier reference, or an alternative to the reference (e.g. reasonCode instead of reasonReference).</p>\n<p>OTOH I've seen a handful of people work around this limitation by creating a custom search parameter with a path that explicitly dives into the contained resource. Oddly enough one such instance was for compound medications like Vassil described above.</p>",
        "id": 215801663,
        "sender_full_name": "James Agnew",
        "timestamp": 1604631953
    },
    {
        "content": "<p>Does HAPI support chaining into a contained resource though?</p>",
        "id": 215803569,
        "sender_full_name": "Paul Church",
        "timestamp": 1604634421
    },
    {
        "content": "<p>Also, does _content search inside contained resources? Does _text search the narrative of contained resources, if they have one?</p>",
        "id": 215806065,
        "sender_full_name": "Paul Church",
        "timestamp": 1604637874
    },
    {
        "content": "<p>Now it's midnight and you've got me writing a design doc for how this could be implemented.</p>",
        "id": 215806631,
        "sender_full_name": "Paul Church",
        "timestamp": 1604638697
    },
    {
        "content": "<p>Presumably this would also work with reverse chaining? e.g. to search into a contained Provenance (which refers to the containing resource, not the other way around).</p>",
        "id": 215843024,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604668171
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> HAPI doesn't support _contained (which I'm fine with) or HAPI doesn't support chaining into contained resources (which is a pretty serious limitation because contained practitioners inside PractitionerRole, contained Medication inside various resources and lots of other scenarios like that will be pretty common.  There are lots of valid reasons for contained resources and you certainly don't want to drop to identifier references which are definitely non-searchable.</p>",
        "id": 215911053,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604701165
    },
    {
        "content": "<p>The chaining use case is currently only achievable using custom search parameters with a FHIRPath that dives right into the contained resource for the indexed content.</p>",
        "id": 216032688,
        "sender_full_name": "James Agnew",
        "timestamp": 1604880379
    },
    {
        "content": "<p>It seems like there's a real disconnect between Lloyd/Rik saying this is important and all of the implementers on this thread saying they're not doing it. Is there implementation experience on the EHR side?</p>",
        "id": 216104585,
        "sender_full_name": "Paul Church",
        "timestamp": 1604937770
    },
    {
        "content": "<p>Most EHR do not have chained search at all</p>",
        "id": 216107935,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1604939028
    },
    {
        "content": "<p>Most EHRs are arcane monoliths from the 80'ies or 90'ies which was based and build on different grounds of such search capabilties</p>",
        "id": 216114938,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1604942121
    },
    {
        "content": "<p>FHIR isn't only for facades onto big iron EHRs. When used that way, FHIRs capabilities are always likely to be a superset. Why bother with chaining at all?</p>\n<p>But in general FHIR should  provide a consistent feature set. Contained resources without search are not much use. And they were invented for good reasons.</p>",
        "id": 216128639,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604948299
    },
    {
        "content": "<p>Yes, I agree with that but the useful ideas with good reasons need to be tested through implementation experience! The search spec has made it all the way to normative and yet we're having this conversation about whether anyone actually supports _contained or chaining into contained resources.</p>",
        "id": 216131161,
        "sender_full_name": "Paul Church",
        "timestamp": 1604949556
    },
    {
        "content": "<p>Completely agree with Paul on this.</p>\n<p>I still don't understand the use cases for needing this (with 'this' meaning searches reaching into contained resources).</p>\n<p>The only place I've personally seen it used for was the compound medications one, and if I'm honest, that just felt like it was working around a weakness in the resource models (i.e. clearly it was important to the implementer to be able to track ratios of products in an IV solution as an atomic unit-- so why don't we provide a way to do this that doesn't require contained resources?)</p>\n<p>Are the other use cases similar?</p>",
        "id": 216132695,
        "sender_full_name": "James Agnew",
        "timestamp": 1604950236
    },
    {
        "content": "<p>I've seen 'contained' resource in lots of cases.  Contained 'Provenance' where the Provenance isn't maintained independently.  Contained Questionnaire within QuestionnaireResponse when doing adaptive questionnaires.  Contained Practitioners when the source data captures the provider as part of the record rather than as a stand-alone registry entry.</p>",
        "id": 216133078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604950429
    },
    {
        "content": "<p>Contained is going to be pretty common - and being able to chain into contained resources is also going to matter</p>",
        "id": 216133183,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604950470
    },
    {
        "content": "<blockquote>\n<p>I've seen 'contained' resource in lots of cases.</p>\n</blockquote>\n<p>Seen in specifications, or seen in actual use?</p>",
        "id": 216135755,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604951800
    },
    {
        "content": "<p>Actual use</p>",
        "id": 216136497,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604952178
    },
    {
        "content": "<p>I'm involved in a number of implementations that are using contained resources.  One healthcare FHIR server uses contained resources for many of the reasons that Lloyd suggested.  Medications are contained because they need to provide the information in that resource but they aren't maintaining them independently.  Practitioners are contained because they have practitioner information but they aren't serving those up as independent resources.</p>",
        "id": 216137939,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604953072
    },
    {
        "content": "<p>Lots of legacy repositories will have to use contained because of how their data is organized.  Even those with a strictly FHIR-based repository will still have to use contained where the resource doesn't have independent identity (e.g. the adaptive forms approach defined in Argonaut and SDC)</p>",
        "id": 216138533,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604953403
    },
    {
        "content": "<p>We use contained Provenance - and cannot find a way to search. It needs reverse chaining. <br>\n(I was wrong about Task, we use that but it is not contained...).</p>",
        "id": 216140203,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604954387
    },
    {
        "content": "<p>If you have a contained provenance, it would be unusual to search on it.  To do that you would need _contained</p>",
        "id": 216140830,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604954785
    },
    {
        "content": "<p>Well I guess that depends if you want to search on Provenance itself or to find containing resources that have some embedded Provenance aspect. The use case of Provenance  here is to hold the actual updated date of the (legacy) data, and not the timestamp of the resource. Then search on it.</p>",
        "id": 216142003,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604955508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> but have you seen _contained search or chaining into contained in lots of cases? It sounds to me like out of the production implementations represented here, nobody supports them, nobody has stated plans to support them, and nobody is quite sure if they're technically feasible at all.</p>",
        "id": 216143914,
        "sender_full_name": "Paul Church",
        "timestamp": 1604956598
    },
    {
        "content": "<p>I have never seen _contained.  That's pretty esoteric.  DaVinci and SDC both require searching by the URL of the contained Questionnaire to retrieve completed questionnaires for instruments like promise.  Searching by dispenses by medication or lot number would also generally require hitting contained resources.  (There's zero chance of them being stand-alone resources, particularly in community pharmacy and even in inpatient, it'd be unusual.)</p>",
        "id": 216144942,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604957277
    },
    {
        "content": "<p>If anyone wants to try implementing chaining into contained resources I would like to highlight the case where Patient/1 refers to a contained PractitionerRole #pr, and that PractitionerRole refers to a contained Organization #o (which is contained in the Patient, since contained resources aren't nested) with a name of X.</p>\n<p>There are two interesting cases that should both return Patient/1:</p>\n<ol>\n<li>PractitionerRole?organization.name=X&amp;_contained=true</li>\n<li>Patient?general-practitioner.organization.name=X</li>\n</ol>",
        "id": 216375940,
        "sender_full_name": "Paul Church",
        "timestamp": 1605116335
    },
    {
        "content": "<p>catching up with this... I absolutely support chaining into contained resources. Contained resources are a row in my database just like any other resources, with a key to the container resource (so I can decide whether I want to see them or not). I think I don't implement _contained fully but chained search into contained resources is important</p>",
        "id": 216448989,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605175859
    }
]