[
    {
        "content": "<p>Before a patient appointment (or after), rather often you want the patient to fill in a questionnaire as input to the Appointment. It could be around life style, smoking habits, exercise etc.</p>\n<p><strong>Assumption</strong><br>\nServiceRequest should be used for the ordering of the questionnaire to be filled in. Correct assumption?</p>\n<p><strong>Question</strong><br>\nWhat is a suitable way to reference the Questionnaire from the ServiceRequest so that the consumer knows what questionnaire to fill in? I have looked that the ServiceRequest resource. </p>\n<ul>\n<li>instantiatesCanonical Σ   0..*    canonical(ActivityDefinition | PlanDefinition)  Instantiates FHIR protocol or definition</li>\n</ul>\n<p>Not sure how this would work, but would the filling in of the Questionnaire be linked to an ActivityDefinition in some way? </p>\n<ul>\n<li>supportingInfo        0..*    Reference(Any)  Additional clinical information</li>\n</ul>\n<p>This would allow it, but is it correct according to the intended use of supportingInfo?</p>\n<p>How should we use ServiceRequest (assuming it is correct) for this use case?</p>\n<p>Thanks!</p>",
        "id": 183055159,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1575981517
    },
    {
        "content": "<p>The Request (as a request) isn't an instantiation of a Questionnaire, as such instantiatesCanonical would be wrong.<br>\nIf code (the service being requested) were to contain a code for the concept of 'questionnaire', the supportingInfo could be a ref to the Q. Not sure that was the intent of supportingInfo in this case..</p>",
        "id": 183056050,
        "sender_full_name": "René Spronk",
        "timestamp": 1575982251
    },
    {
        "content": "<p>Just by looking at the attribute descriptions, the following look relevant:</p>\n<ul>\n<li>\n<p>code* Σ   0..1    CodeableConcept <em>What is being requested/ordered</em> Procedure Codes (SNOMED CT) (Example)</p>\n</li>\n<li>\n<p>orderDetail*  ΣI  0..*    CodeableConcept <em>Additional order information</em> Service Request Order Details Codes (Example)</p>\n</li>\n</ul>\n<p>But these are both CodeableConcepts, and we would like a reference.</p>",
        "id": 183056752,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1575982881
    },
    {
        "content": "<p>Completing a Questionnaire could be done with ServiceRequest or with Task.  For ServiceRequest, the Questionnaire would be referenced by an extension.  For Task, it would be one of the inputs.  The SDC IG expects to standardize this in its next release, but the work hasn't been done yet.</p>",
        "id": 183057789,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575983758
    }
]