[
    {
        "content": "<p>I was looking at ServiceRequest to model requests that may contain quite some details. e.g. a nursing requests in the context of bladder care (instillation, flushing, tubing etc.) that may contain specific instructions concerning what products to use, certain amounts of products to use etc. <br>\nAnother example might be nursing for wound care: part can of course be expressed using e.g. SNOMED-CT codes but for certain type of burn injuries, a GP might want to go through a list of possible extra instructions based on established (insurancy) practices in our jurisdiction. Basically it often comes down to an extra list of key/value pairs. The .supportingInfo allows to reference any other type of resource so it seems serviceRequest comes with a lot of flexibility<br>\nWhat would be the correct strategy to follow here?<br>\nI considered a few approaches: <br>\n-doing everything with  .orderDetail  has its limits, definitely when something needs to be expressed in a value<br>\n-referencing QuestionnaireResponse can solve this but is that functionally correct? <br>\n-referencing a CarePlan could solve certain things. e.g.  when the nurse has to adminster a product, it can be defined in activity.detail in the CarePlan - but does the existence of a CarePlan not imply a more general plan of action - what if the GP only once gives a patient a prescription for certain care activities?<br>\n-not overthinking it by using  .patientInstruction string to add all this extra information - of course that means the information is not really structured<br>\n-I can imagine how to solve it with extensions but of course I leave that as a last resort<br>\nAny thoughts on this are very much appreciated!</p>",
        "id": 208683941,
        "sender_full_name": "Robin Bosman",
        "timestamp": 1598965685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 208706311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598974970
    },
    {
        "content": "<p>Orders and Observation owns ServiceRequest, so I would want their input as well here....but speaking as an implementer, I asked a similar question on <a href=\"http://jira.hl7.org/browse/FHIR-14002\">J#14002</a>, which led to the introduction of orderDetail.  That said, I would have preferred it to be key/value pairs to convey the full context of each pair (or Q&amp;A).  </p>\n<blockquote>\n<ul>\n<li>Isolation (e.g. Airborne Precautions, Contact Precautions, Droplet Precautions, Standard Precautions)</li>\n<li>Transportation Mode (e.g. Wheelchair, Patient Bed, Crib, Walk, Stretcher, etc.)</li>\n<li>Anesthesia Type (e.g. Epidural, General Mask, Topical, General Intubation, Regional Block)</li>\n<li>NPO Exceptions (e.g. NPO except for ice chips, NPO except for meds, NPO except for sips of water, No exceptions)</li>\n<li>Urinary Catheter Type (e.g. External Catheter, Indwelling Catheter)</li>\n<li>Ventilator Mode (e.g. ACMV, CMV, CPAP, HFJV, PCV, SIMV)</li>\n</ul>\n</blockquote>\n<p>If you log a JIRA to request a change, I would be interested in watching / helping advocate for that change.<br>\nCC:  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 208745378,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1598992902
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"218656\">@Robin Bosman</span> we have integrated both the International classification of nursing practice (ICNP) and Clinical Care Classification System (CCC) nursing intervention codes into SNOMED CT. There are many interventions in SNOMED CT such as the one your found. Unfortunately, interventions and the granular level you are requesting, are not available for encoding in either the observation or the response. We would need to request those atomic level concepts.</p>",
        "id": 208876214,
        "sender_full_name": "Susan Matney",
        "timestamp": 1599075310
    }
]