[
    {
        "content": "<p>Hello, FHIR community.</p>\n<p>We are working on a billing platform for labs in the US. While routing procedure to right payer and building Claim it is important to know referring provider (i.e.  Practitioner with NPI) and ordering organization (Laboratory Client). This information supposed to be taken from ServiceRequest (Order), but in ServiceRequest we have only one requester. How are you storing information about both - Referral &amp; Client?  PractitionerRole? Extension?</p>",
        "id": 234394896,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1618345625
    },
    {
        "content": "<p>This is the scenario for independent diagnostic lab order.  Lab Requisition includes a client organization that sent requisition and referring physician who has ordered the tests for the patient. Which fields should be used for the ordering client organization and referring physician in FHIR Service Request?</p>",
        "id": 234404921,
        "sender_full_name": "Vitali Khvatkov",
        "timestamp": 1618349234
    },
    {
        "content": "<p>Is the \"client organization\" the place where the physician practices? Or is it a lab setting? If the question is how to convey both the physician and their organization, PractitionerRole seems to be good fit, as it provides the Practitioner context within an Organization.</p>",
        "id": 234436056,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1618371087
    },
    {
        "content": "<p>Client organization would be a clinic or doctor's office where a referring physician is practicing. This clinic or doctor's office holds contact with the lab for testing and places requisitions.  So on the order, we need to capture both the ordering organization and specific referring physician.  HL7 DFT field : PV1.39 (Servicing Facility) and PV1.8 -Referring Doctor</p>",
        "id": 234518873,
        "sender_full_name": "Vitali Khvatkov",
        "timestamp": 1618413630
    },
    {
        "content": "<p>If you have a ServiceRequest that is based on another ServiceRequest - e.g. Practitioner orders lab, Lab orders something based on Practitioner order, you'd need both ServiceRequests to see the full story - the second ServiceRequest would point to the first via 'basedOn'.</p>",
        "id": 234887704,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618592196
    },
    {
        "content": "<p>If you just want the doctor and the clinic they're working for, you can do that via PractitionerRole.</p>",
        "id": 234887779,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618592238
    }
]