[
    {
        "content": "<p>Hello!</p>\n<p>We are looking for a FHIR resource that would map to a request to perform a service, more specifically, an activity of daily living. Examples of these services would be bathing, meals, toileting, dressing, transfers, oral care, documentation on current behaviors or moods, etc. These services can exist for a patient outside of a care plan. As part of a service request, we would be looking to return the following information:<br>\n-   Description of service<br>\n-   Reference to an image for the service<br>\n-   Special instructions (e.g., transfers services may specify how many people are required to assist, or if equipment is required, such as a wheelchair)<br>\n-   Scheduled date &amp; time<br>\n-   Estimated time to complete the service<br>\n-   A series of questions and a selection of possible responses for each.</p>\n<p>We are thinking of using the Task FHIR resource as the container for the task and we looked at ProcedureRequest to capture the details for the service request. Our hesitation with using the ProcedureRequest resource is that, from the definition, it sounds more like a medical procedure rather than an activity of daily living.  We also do not have a standardized set of codes for the library of services that are being used (they are customizable from client to client) and we could use the ‘plan’ code for the intent, but again, the service can exists on the patients chart outside of a care plan. For the series of questions and possible responses, we would use the Questionnaire FHIR resource as an input??? within the Task resource.</p>\n<p>Documentation would also need to captured, including the following:<br>\n-   Response selected for the series of questions associated to the task.<br>\n-   User who completed the task.<br>\n-   Users position at the time of the task.<br>\n-   Date and time the task was completed.</p>\n<p>We would again the Task FHIR resource as the container and the closest FHIR resource we found to capture the documentation on the service is the Procedure FHIR resource. Our hesitations using the Procedure FHIR resource for this are the same as the above. To capture the documentation responses, we would use the QuestionnaireResponse FHIR resource.</p>\n<p>Any help would be appreciated!</p>",
        "id": 153896106,
        "sender_full_name": "Bhavina Lad",
        "timestamp": 1499279400
    },
    {
        "content": "<p>ProcedureRequest is pretty broad.  It includes training, requests for observations to be taken, etc.  Questionnaire is an appropriate resource to use for the questions.  Whether it's linked to the Task as an input or linked to the ProcedureRequest as something off a component ProcedureRequest depends on how closely the Questionnaire is tied to the \"order\" vs. the \"fulfillment request\".</p>",
        "id": 153896109,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499279826
    }
]