[
    {
        "content": "<p>ServiceRequest.status is indicating the status of the service request, not the status of the action/service being requested. Nevertheless, we also need to indicate the status of the action/service being requested. This is in fact the thing my business is interested in.  How can we model the status of the action/service being requested together with the ServiceRequest, without making things overly complex. Do you have any suggestions <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 271969760,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1644929974
    },
    {
        "content": "<p>That's the status on the Task resource, and the status on the FHIR Resource that records the event of 'doing the thing that is requested'. The latter status going to 'completed' is the best source of truth, the status of the Task is derived from that, and in turn the Task status impacts the status of the request.</p>",
        "id": 271971401,
        "sender_full_name": "René Spronk",
        "timestamp": 1644930773
    },
    {
        "content": "<p>You'd have a Task that says \"please fulfill\" and its status would (ideally) progress from Requested-&gt;Accepted-&gt;In-progress-&gt;Completed.  When all relevant tasks were completed and the requester was satisfied, the ServiceRequest itself would transition from 'active' to 'complete'.</p>",
        "id": 271990095,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644938848
    },
    {
        "content": "<p>I think we should have some guidance on how to \"add\" a task without forcing a complex workflow management infrastructure</p>",
        "id": 271997354,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1644941697
    },
    {
        "content": "<p>Is there such a thing?</p>",
        "id": 271997379,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1644941706
    }
]