[
    {
        "content": "<p>The definition of ServiceRequest.quantity is \"An amount of service being requested which can be a quantity ( for example $1,500 home modification), a ratio ( for example, 20 half day visits per month), or a range (2.0 to 1.8 Gy per fraction).\" but I'm having trouble understanding what an \"amount of service\" is. Is this the amount of service done per instance of the service (a 20 min physiotherapy session) or the total number of services requested (5 physiotherapy sessions total) or something else completely? Does it vary depending on the intent (original-order versus instance-order) or the data type chosen for occurrence[x] (a single date/time versus a complex timing). None of the ServiceRequest example I looked at included quantity. Any insight would be appreciated.</p>",
        "id": 160201980,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551969051
    },
    {
        "content": "<p>Agree that clarification (and examples) would be useful.  Can you submit a change request.</p>",
        "id": 160205035,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551970884
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 160205053,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551970894
    },
    {
        "content": "<p>Happy to submit a change request. The examples I gave (a 20 min session or 5 sessions) seem to fit better OccurrenceTiming (.repeat.duration and .repeat.count respectively. So I'm still not sure what the .quantity clarification would be. </p>\n<p>In v2, there is a quantity field (TQ1-1) which is \"This field specifies the numeric quantity of the service that should be provided at each service interval.  For example, if two blood cultures are to be obtained every 4 hours, the quantity would be '2', or if three units of blood are to be typed and cross-matched, the quantity would be '3'.  The default value for this field is '1'.\". </p>\n<p>I'm not sure I understand the first v2 example but the second one seems clearer. Is this the intent of  ServiceRequest.quantity?</p>",
        "id": 160205894,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551971439
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20510\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20510\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20510</a> created</p>",
        "id": 160206351,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551971748
    }
]