[
    {
        "content": "<p>Im just wondering if my implementation makes any sense:</p>\n<p>We would use a ServiceRequest to represent an order in a hospital. The created ServiceRequest will then provide access to that patient in our service for the given practitioner if the occurrence field is filled in. It's my first actual implementation of a FHIR service and I was wondering if that makes sense.</p>\n<p>Secondly, we would like to also provide authorization in cases where there is not an explicit order in the hospital. In the case where a physician would like to access a file within our system, we would also use a ServiceRequest to express that. Using the identifiers, the integrator could distinguish between actual appointments and just requests to view the file.</p>\n<p>Let me know if anything is weird/ doesn't make sense. All feedback is appreciated</p>",
        "id": 272375548,
        "sender_full_name": "Michael Lippens",
        "timestamp": 1645174440
    },
    {
        "content": "<p>? occurence is related to the request, so why would that be relevant in deciding to allow the sender of a request 'access to a patient'</p>",
        "id": 272378561,
        "sender_full_name": "René Spronk",
        "timestamp": 1645176361
    },
    {
        "content": "<p>As for the second aspect: if a request is missing, one could simply create [reverse engineer] it (a kind of filler order), allowing one to use the same mechanism as scenario 1 for authorization</p>",
        "id": 272378690,
        "sender_full_name": "René Spronk",
        "timestamp": 1645176433
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> , it is because our integrator wants to control authorization. And the existence of a ServiceRequest that is valid and given that we are currently within the occurrence's range could be a way for us to decide whether or not access is allowed within our own system.</p>",
        "id": 272381691,
        "sender_full_name": "Michael Lippens",
        "timestamp": 1645178486
    },
    {
        "content": "<p>The idea to use ServiceRequest is to provide a worklist feature, so that we know what patient is relevant to a physician at what time. That it also manages access is actually a side-effect more or less.</p>",
        "id": 272382072,
        "sender_full_name": "Michael Lippens",
        "timestamp": 1645178700
    },
    {
        "content": "<p>I'd say that only (a ServiceRequest is accepted by a receiving/executing party) could act as the basis for authorization. Have you looked  at Task ? That's the direct equivalent of a worklist item..<br>\nIf you only look at ServiceRequest, I could send a bogus request to you, allowing me to view the patient data. That's a potential security issue (depending on the amount of data I'd be allowed to see - presumably this is limited to the results of whatever it is the request asks for).</p>",
        "id": 272383194,
        "sender_full_name": "René Spronk",
        "timestamp": 1645179331
    }
]