[
    {
        "content": "<p>We are looking at using Questionnaire/QuestionnaireResponse in a digital self triage scenario. The patient themselves will answer a set of question which determines the priority by the severity of their condition or likelihood of recovery with and without treatment.</p>\n<p>If the priority determines it we are going to look into how we can extract the data entered into the QuestionnaireResponse to a ServiceRequest and possible a set of Observations.</p>\n<p>Currently it looks like we will probably use the following attributes: status, intent, category, priority, code, subject, encounter, requester, performer, reasoncode og supportingInfo.</p>\n<p>Questions:</p>\n<ol>\n<li>Should we use the ServiceRequest if the patient is the initiator/requestor?</li>\n<li>Is the ServiceRequest resource a good match in a Patient -&gt; Practitioner triage scenario or is there some other resource that would be better?</li>\n</ol>\n<p>Cc: <span class=\"user-mention\" data-user-id=\"228499\">@Ole Kristian Losvik</span></p>",
        "id": 218566462,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1606920640
    },
    {
        "content": "<p>Creating a ServiceRequest with intent of 'proposed' would be quite reasonable.  (Typically you'd need an actual person to sign off before you could have a ServiceRequest with intent of 'order'.)  Technically the 'initiator' isn't the patient, but rather the software (Device) that evaluates the patient's responses and decides what services are necessary.  Patient as requester would be when the Patient themselves dictates what services they want.</p>",
        "id": 218590989,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606930297
    },
    {
        "content": "<p>You might look at the FHIR Structured Data Capture IG which provides guidance on generating resources from a QuestionnaireResponse.</p>",
        "id": 218591083,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606930330
    },
    {
        "content": "<p>Thanks, Lloyd!</p>\n<p>We are already dipping our feet into the Extraction chapter from the SDC :)</p>",
        "id": 218593733,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1606931421
    }
]