[
    {
        "content": "<p>Hi all, <br>\nWe need to create a valueset which includes CPT codes, display, Service type ID, SUb service type ID, Key components, History level, Exam level, Decision level, Age low, Age high, Time low and Time high. Can anyone suggest me how to create the valueset?<br>\nThank you.</p>",
        "id": 154015897,
        "sender_full_name": "Mounika",
        "timestamp": 1541510736
    },
    {
        "content": "<p>CPT is a code system.  What other code systems are you planning to draw from for the other observation types you've identified?  (Also, this particular combination of elements seems a little odd - what FHIR element are you planning to bind the value set to?)</p>",
        "id": 154015913,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541513191
    },
    {
        "content": "<p>That sounds like lots of value sets for lots of uses, not one value set.</p>",
        "id": 154016271,
        "sender_full_name": "Robert McClure",
        "timestamp": 1541613275
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Those are actually Evaluation &amp; Management codes  which were taken from CPT code system. We are trying to bind these to Encounter.serviceType</p>",
        "id": 154016575,
        "sender_full_name": "Mounika",
        "timestamp": 1541654314
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> This need several valuesets. One for each of the required item.</p>",
        "id": 154016686,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1541688775
    },
    {
        "content": "<p>We have sub components (sub service) which includes code (id) and display.<br>\nWe have other components (service) which have includes code (id) and display.<br>\nwe need to tell sub component parent value which were stored in component (service).<br>\nwe have another valueset which includes E-M codes then again we need to link these two. We may have multiple parents. <br>\nHow to link these?<br>\nCan anyone help me.</p>",
        "id": 154017105,
        "sender_full_name": "Mounika",
        "timestamp": 1541763945
    },
    {
        "content": "<p>What I think I'm hearing is: You have a record that defines what a particular service involves.  That record defines a code for the overall service and then (potentially) a number of sub-services that can occur within that overall service.  Is that accurate?  If so, you might look at PlanDefinition.</p>",
        "id": 154017110,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541765113
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Can you give me any example for that.</p>",
        "id": 154018386,
        "sender_full_name": "Mounika",
        "timestamp": 1542196453
    },
    {
        "content": "<p>There are examples of PlanDefinition in the spec, including some where you have actions with child actions, which is what would be relevant here</p>",
        "id": 154018393,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542197786
    }
]