[
    {
        "content": "<p>I'm looking at the ServiceRequest example at <a href=\"http://hl7.org/implement/standards/fhir/servicerequest-example2.xml.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/servicerequest-example2.xml.html\">http://hl7.org/implement/standards/fhir/servicerequest-example2.xml.html</a> and either I'm not understanding  how to implement ServiceRequest.occurrenceTiming or there is an error in the example .</p>\n<p>Within the text element it says: occurrence : Duration 15 days, Do 1-1 per 1 days<br>\nAnd a comment in the resource gives an example of: Chest therapy 1-4 times per day as needed to clear mucus<br>\nBut the resource itself says:<br>\n  &lt;occurrenceTiming&gt; <br>\n    &lt;repeat&gt; <br>\n      &lt;duration value=\"15\"/&gt; <br>\n      &lt;durationMax value=\"25\"/&gt; <br>\n      &lt;durationUnit value=\"min\"/&gt; <br>\n      &lt;frequency value=\"1\"/&gt; <br>\n      &lt;frequencyMax value=\"4\"/&gt; <br>\n      &lt;period value=\"1\"/&gt; <br>\n      &lt;periodUnit value=\"d\"/&gt; <br>\n    &lt;/repeat&gt; <br>\n  &lt;/occurrenceTiming&gt; </p>\n<p>I'm assuming frequencyMax came from the comment (1-4 times per day) but do the duration elements indicate that each therapy session (which can happen 1-4 times per day) should last from 15-25 minutes (which is nowhere else in the resource \"text\")? Should the \"15 days\" be represented as occurrenceTiming.repreat.boundsDuration?</p>",
        "id": 160207005,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551972202
    },
    {
        "content": "<p>The text doesn't actually reflect the duration at all, which is legitimate.  The text doesn't <em>have</em> to reflect all of the discrete data, only what's considered \"essential\" information.  If the 15-25 is for automated billing but the human would just \"know\" (and be somewhat annoyed to be told), then not including it in the text is fine.</p>",
        "id": 160208694,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551973429
    },
    {
        "content": "<p>I'm less worried about the text matching the discrete elements, I am more concerned with my own understanding that the \"duration\" elements are related to the duration of a given instance of a service while bounds or count should be used to indicate the \"for 15 days\" part of the instructions. bounds seems like the easier way to go in this case but it seems like count and countMax could be populated with values of 15 and 60 respectively. Are these the correct interpretations of duration, count and bounds?</p>",
        "id": 160209612,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551974073
    },
    {
        "content": "<p>Duration is definitely about an individual instance.  Bounds covers the outer bounds of all repetitions.</p>",
        "id": 160210690,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551974760
    },
    {
        "content": "<p>Does anyone know why ServiceRequest.occurrence has a choice of data types? While more complex, the Timing data type would seem to offer a way to indicate just a single date/time (as opposed to occurrenceDateTime) or a period (as opposed to occurrencePeriod). Is it just a way to keep things simply when the ServiceRequest is only for a single instance of a service?<br>\n        ○ A specific date/time - occurrenceDateTime<br>\n            § This implies that the ServiceRequest is only for a single instance of the service<br>\n            § Why is this needed when occurrenceTiming.event is available?<br>\n        ○ A specific period of date/times - occurrencePeriod<br>\n            § Does this implies that the ServiceRequest is only for a single instance of the service given there is no \"count\" element in the Period data type?<br>\n            § Why is this needed when occurrenceTiming.repeat.boundsPeriod is available?<br>\n        ○ A complex timing definition - occurrenceTiming</p>\n<p>Are my assumptions about occurrenceDateTime and occurrencePeriod only being used for a single instance ServiceRequest right?</p>",
        "id": 160213859,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551976545
    },
    {
        "content": "<p>There are lots of use-cases where timing is overkill and there's a need/desire to constrain to the type that's actually needed.</p>",
        "id": 160214539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551976914
    }
]