[
    {
        "content": "<p>Hi All - excited to join this community.</p>",
        "id": 225989366,
        "sender_full_name": "Matt Berg",
        "timestamp": 1613050266
    },
    {
        "content": "<p>We do work that is focused a lot on scheduling the service delivery of practitioners.   We've been using FHIR tasking to enable vaccination campaigns, indoor residual spraying (IRS) for malaria control, etc.   In this context, borrowing form the CarePlan idea we came up with something called a Plan (considering renaming this to ServicePlan) that allows you to define activities and associated tasks for a practitioner to complete.  These tasks can be applied to patients or locations in our data model.</p>",
        "id": 225989804,
        "sender_full_name": "Matt Berg",
        "timestamp": 1613050429
    },
    {
        "content": "<p>I will share our data model around this.  My main question though is the idea of scheduling the work of practitioners something currently handled in FHIR?  The focus here is more on the orchestration of service delivery by providers and not so much from a patient centric / CarePlan approach.   I hope this makes sense.  Any insights on this would be very helpful.  Thank you.</p>",
        "id": 225990069,
        "sender_full_name": "Matt Berg",
        "timestamp": 1613050543
    },
    {
        "content": "<p>A List of Tasks ? Why would this need to be a new resource ?</p>",
        "id": 225991009,
        "sender_full_name": "René Spronk",
        "timestamp": 1613050952
    },
    {
        "content": "<p>We use the plan to create the activities that provide the rules for how tasks are created.  These tasks can be picked up to multiple practitioners.  We evaluate new questionairereponses against the activity in the plans to generate new tasks.  Eg. If a patient is registered assign a blood test, etc.</p>",
        "id": 225996616,
        "sender_full_name": "Matt Berg",
        "timestamp": 1613053155
    },
    {
        "content": "<p>Other common examples are - assign a task to visit every household (location) in a specific area and create a task to do a specific service (Eg. provide a service to a household member in that location).  We support tasks directly to locations too.  Eg. mosquito point collection where no patients are involved.</p>",
        "id": 225996845,
        "sender_full_name": "Matt Berg",
        "timestamp": 1613053239
    },
    {
        "content": "<p>I don't know that there's a whole lot of work done in this space, but that doesn't mean FHIR couldn't be used for it.  CarePlan and Task seem to be appropriate choices.</p>",
        "id": 226008296,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613057657
    },
    {
        "content": "<p>The question we have about CarePlans is the target is a patient and not the provider.</p>",
        "id": 226017438,
        "sender_full_name": "Matt Berg",
        "timestamp": 1613060653
    }
]