[
    {
        "content": "<p>We are looking at the HealthcareService resource to meet the following use cases:</p>\n<ul>\n<li>What services does organization x provide?</li>\n<li>What organizations provide service x?</li>\n</ul>\n<p>Those use cases would be needed e.g. for a patient to book an appointment or refer themselves or when a healthcare professional wants to refer a patient to some external orgnization that provides a needed service. In general I would say we need a \"service catalog\". </p>\n<p>When looking at the HealthcareService resource we see that it has:<br>\n.. providedBy   Σ   <strong>0..1</strong>    Reference(Organization) Organization that provides this service</p>\n<p>This is explained by the resource definition being:<br>\n\"The HealthcareService resource is used to describe a single healthcare service or category of services <strong>that are provided by an organization</strong> at a location.\" The HealthcareService resource is defined by its provision by an organization. </p>\n<p>This modelling limits the ability the ability to search where a service is provided regardless of organization. Of course, we could compare different HealthcareService resources from different organizations using some combination of e.g. <br>\n... category    Σ   0..*    CodeableConcept Broad category of service being performed or delivered<br>\nService category (Example)<br>\n... type    Σ   0..*    CodeableConcept Type of service that may be delivered or performed<br>\nService type (Example)</p>\n<p>Looking at our use cases again...</p>\n<ul>\n<li>\n<p>What services does Organization x provide?<br>\nThis seems straight forward using HealthcareService.providedBy</p>\n</li>\n<li>\n<p>What organizations provide service x?<br>\nThis does not seem as straight forward using this modelling of HealthcareService? </p>\n</li>\n</ul>\n<p>I guess one option would be to do something similar to what FHIR provides with Practitioner, Organization and PractitionerRole. Ie, there are two distinct resources, and a separate resource handling their relationship. That would mean for our use cases, and use cases around managing a service catalog, there could be HealthcareService (for service catalog), Organization and ServiceOrganiztionProvision (new resource for maintaining an organizations provision of a service) or something similar.</p>",
        "id": 275345099,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1647334729
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 275373066,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647351218
    },
    {
        "content": "<p>What definitional details about a service (offered independently by many organizations) are you looking to express <em>beyond</em> a standardized concept code (for type/category)?</p>",
        "id": 275373318,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647351360
    },
    {
        "content": "<p>IHE has a FHIR Implementation Guide that includes these use-cases <a href=\"https://profiles.ihe.net/ITI/mCSD/index.html\">https://profiles.ihe.net/ITI/mCSD/index.html</a></p>",
        "id": 275373729,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647351561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193299\">@Luke Duncan</span></p>",
        "id": 275373749,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647351569
    },
    {
        "content": "<p>This is one reason why databases with a hierarchical data model lost ground to ones with a relational model. <span aria-label=\"stuck out tongue wink\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span></p>",
        "id": 275457636,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1647394025
    },
    {
        "content": "<p>In the 80s</p>",
        "id": 275457642,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1647394039
    },
    {
        "content": "<p>The service catalog data is more likely to just be a coding and leveraging that across search to find which HealthcareServices using that coding of interest at which organizations.<br>\nThe HealthcareService resource has all the details specific to the Organization (and location) including expected availability hours and contact details for that org. None of that data is going to be shared across organizations, and even less likely to be managed in that way.</p>",
        "id": 275477785,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1647418247
    },
    {
        "content": "<p>You might look at ActivityDefinition for the definition of a service independent of who's offering it.</p>",
        "id": 275513490,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647439067
    }
]