[
    {
        "content": "<p>How would you send data to other tenants or servers? If you transfer a patient (physically) from one hospital to another and want to share the relevant data of the patient with the receiving hospital. How can you do that if the two hospitals are two tenants on the same (HAPI) server? And how would you do that when the hospitals are on different (HAPI) servers?</p>",
        "id": 216017254,
        "sender_full_name": "Michael Albert",
        "timestamp": 1604857592
    },
    {
        "content": "<p>Typically you don't want to 'push' data to the recipient by explicitly creating records on their server.  Instead, you either allow them to query your data, or send them a subscription notification about the existence of your record.  That allows them to choose to create a new record, update an existing record or do nothing - based on what data they already have and what they consider appropriate.</p>",
        "id": 216023293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604866486
    },
    {
        "content": "<p>I got your point. But I still don't know how to (technically) make the data available to others. Do I have to create another user that is allowed to read the data? How would I send a subscription notification? Does the other hospital then subscribe to the patient record and gets informed when information has changed? How are they allowed to read the data? Can I cancel outgoing subscriptions? Could you point out some documentation where I can read about these processes?</p>",
        "id": 216024819,
        "sender_full_name": "Michael Albert",
        "timestamp": 1604868819
    },
    {
        "content": "<p>There's a decision tree that Da Vinci put together (slated for migration to the core spec as part of R5) that might be of benefit - <a href=\"https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html\">https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html</a>.  In general, I don't think being a tenant on the same server should necessarily create any difference in behavior.</p>",
        "id": 216028493,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604874343
    }
]