[
    {
        "content": "<p>Is anyone using Oauth/SMART in a scenario where multiple clients and resource servers want to share the same centralized authorization server (pre-reg'd with client and user information) to request access tokens…but they want those access tokens to be specific to user permissions instead of tied to broadly-based client permissions?</p>\n<p>I'm thinking through a scenario where we don't want to make the client connect to 10 auth servers for 10 different resource servers. And we don't want to make the resource servers connect to a bunch of different auth servers to perform token validation. And in this scenario, we don't want access scope to be client-oriented like the EHR-to-EHR argonaut profile accommodates. </p>\n<p>I've read through the Oauth2 Authorization Grant Types and don't feel like this scenario sits squarely in either authentication code grant type or client credential grant type. </p>\n<p>Has anyone implemented something similar to the scenario described above?</p>",
        "id": 191047659,
        "sender_full_name": "Sheridan Cook",
        "timestamp": 1584568598
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span></p>",
        "id": 191047805,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584568672
    },
    {
        "content": "<p>If the user's access token is a JSON Web Token (JWT), it's possible to include custom claims in the JWT payload.  The custom claims can express granular user permission details.</p>\n<p>Not really my area of expertise, but we've implemented something like this.</p>",
        "id": 192892781,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1585981295
    },
    {
        "content": "<p>We are doing this - and embedding custom claims in the JWT. In our setup you also need to request specifics in the JWT. The JWT ends up containing rights ( eg. Patient.read) and context (eg. EpisodeOfCare/123) which are then accepted across the servers hosting different types of resources</p>",
        "id": 192928409,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1586036716
    },
    {
        "content": "<p>IHE has an OAuth implementation guide that has some JWT custom claims to support things like PuposeOfUse, name of user, organization of user, etc.</p>",
        "id": 193211732,
        "sender_full_name": "John Moehrke",
        "timestamp": 1586275918
    },
    {
        "content": "<p>very timely information <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> where can I find that guidance?</p>",
        "id": 193212355,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586276165
    },
    {
        "content": "<p><a href=\"https://wiki.ihe.net/index.php/Internet_User_Authorization\" title=\"https://wiki.ihe.net/index.php/Internet_User_Authorization\">https://wiki.ihe.net/index.php/Internet_User_Authorization</a></p>",
        "id": 193212537,
        "sender_full_name": "John Moehrke",
        "timestamp": 1586276235
    },
    {
        "content": "<p>thanks. shared.</p>",
        "id": 193213551,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586276733
    }
]