[
    {
        "content": "<p>Hi all,<br>\nhow can I represent one or more side effects on FHIR? Which resourse should I use (Condition or Observation)? For example: Nausea, Vomiting, Difficulty swallowing, Dry mouth etc.</p>",
        "id": 153894547,
        "sender_full_name": "Domenico",
        "timestamp": 1497965354
    },
    {
        "content": "<p>I think Condition is the right resource, you can find \"nausea\" and \"vomiting\" in its valueset of codes (<a href=\"https://www.hl7.org/fhir/valueset-condition-code.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-condition-code.html\">https://www.hl7.org/fhir/valueset-condition-code.html</a>). Observation is used to make measurement.</p>",
        "id": 153894549,
        "sender_full_name": "jose duran",
        "timestamp": 1497966775
    },
    {
        "content": "<p>The specification of Condition says:<br>\n\"This resource is not typically used to record information about subjective and objective information that might lead to the recording of a Condition resource. Such signs and symptoms are typically captured using the Observation resource; although in some cases a persistent symptom, e.g. fever, headache may be captured as a condition before a definitive diagnosis can be discerned by a clinician. \"<br>\nSo, while this is far from being clearly distinctive, it points to Observation (in a 51:49 way, at least from my point of view).<br>\nOn the other hand, Condition has all the elements you would typically want in the context of side effects, like onset[x], abatement[x] or severity. So this looks like a \"natural fit\" for representing things like CTCAE. </p>",
        "id": 153894557,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1497976774
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153894562,
        "sender_full_name": "John Moehrke",
        "timestamp": 1497977752
    },
    {
        "content": "<p>It depends what you're trying to do.  Observation lets you capture things like an elevated temperature, the presence of a rash, etc.  But if you want to assert an ongoing situation, Condition is what allows you to assert a diagnosis, severity, etc. and manage the evolution of the condition over time.  So a single episode of nausea might be an Observation.  Noting that the patient experiences ongoing nausea due to one of their other meds would be a Condition.</p>",
        "id": 153894566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497979003
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> so how is death recorded? A permament Condition or an Observation? </p>",
        "id": 153894574,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1497980526
    },
    {
        "content": "<p>I'm being somewhat facetious …. edit: based on CDA implementation guide, this would be Condition.</p>",
        "id": 153894575,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1497980568
    },
    {
        "content": "<p>Time of death, cause of death would be Observations.  Plus you'd update the patient demographics with deceasedBoolean/deceasedDate.  Generally once a patient is dead, you don't capture Conditions anymore . . .</p>",
        "id": 153894577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497982131
    },
    {
        "content": "<p>My rule of thumb is if you're dealing with something diagnosis-like, it's most likely a Condition unless there's a particular need to have it as an Observation.</p>",
        "id": 153894578,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497982173
    },
    {
        "content": "<p>Just to complicate this...</p>",
        "id": 153894594,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497993197
    },
    {
        "content": "<p>If it's severe enough to be considered an intollerance...<br>\n<a href=\"http://hl7.org/fhir/stu3/allergyintolerance.html\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3/allergyintolerance.html\">http://hl7.org/fhir/stu3/allergyintolerance.html</a></p>",
        "id": 153894595,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497993211
    },
    {
        "content": "<p>It would be on allergyIntolerance as a reaction, I would assume?</p>",
        "id": 153894596,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497993225
    },
    {
        "content": "<p>yes, you could also record it in AllergyIntolerance.reaction as supporting evidence for the risk. But that's a different kind of use </p>",
        "id": 153894602,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497993686
    },
    {
        "content": "<p>So, what is the way to capture side effects for medications in FHIR? <br>\nE.g. in our care management applications, we are capturing  patient's medications along with the <code>\"Does the patient have any unfavorable side-effects to this medication?\"</code> Yes/No and follow-up <code>\"Describe any side effects\"</code> questions. We are seeking for a proper way to store this in FHIR, so we could exchange this information with different companies in the future.</p>",
        "id": 153894725,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1498050245
    },
    {
        "content": "<p>If phrased that way, that would be Observation.</p>",
        "id": 153894783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498063874
    }
]