[
    {
        "content": "<p>Hi all, what are the extensions provided for the data type 'Signature'?  Moreover, how can I capture both initial and normal signatures? Thank you</p>",
        "id": 153919445,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1510661521
    },
    {
        "content": "<p>As yet, there are no extensions defined for the Signature data type.  However, signature has a \"type\" element that should be able to distinguish for you.  What are \"initial\" and \"normal\" signatures?</p>",
        "id": 153919459,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510671403
    },
    {
        "content": "<p>I would recommend multiple Provenance records for each of those changes to the resource being signed. Thus each Provenance explains why the change was made, and thus each holds the 'current' signature.</p>",
        "id": 153919482,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510672503
    },
    {
        "content": "<p>an example is where a client requests a Create of a resource. It could come with a Provenance.signature. The server, which needs to fixup some of the elements like id, would validate the client signature; create the instance of the resource with the fixup, create a new Provenance with a new signature. Best case that new signature counter-signs the original signature to indicate that the original signature was validated initially.</p>",
        "id": 153919485,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510672683
    },
    {
        "content": "<p>is this what you are working on?   I am not sure what else 'both initial and normal signature' mean.</p>",
        "id": 153919486,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510672749
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Initial signature contains only two letters first letter from the first name and second letter of the signature would be the first letter from the last name. For instance,  my full name is  \"Sruthi Valivety\", the initial signature would be SV. Whereas the normal signature is  used to sign official documents.</p>",
        "id": 153919612,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1510723767
    },
    {
        "content": "<p>The signature data type is used for digital signatures - not for physical signatures.</p>",
        "id": 153919647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510737693
    },
    {
        "content": "<p>no can be used for physical signatures</p>",
        "id": 153919649,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510737959
    },
    {
        "content": "<p>Then the definition needs to be loosened...</p>",
        "id": 153919653,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510738082
    },
    {
        "content": "<p>We have included in the Signature datatype that the signature can be of any type that can be described by a mime-type (contentType element). Thus in the case of a physical signature, this could be digitally signed, and the JPG/PDF of that be placed into the  Signature.blob.   In all cases it is up the region to determine what is a legitimate signature.</p>",
        "id": 153919737,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510757722
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  The definition of Signature is inclusive of these kind of signatures:  \"A Signature holds an electronic representation of a signature and its supporting context in a FHIR accessible form. \"</p>",
        "id": 153919738,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510757761
    },
    {
        "content": "<p>The short description for the signature datatype says \"A digital Signature - XML DigSig, JWS, Graphical image of signature, etc.\"</p>",
        "id": 153919789,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510766448
    },
    {
        "content": "<p>The words \"digital Signature\" confused me.</p>",
        "id": 153919790,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510766484
    },
    {
        "content": "<p>Particularly when the first two examples were clearly true \"digital signatures\"</p>",
        "id": 153919791,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510766502
    },
    {
        "content": "<p>Perhaps a \"A digital or other signature representation - ...\"?</p>",
        "id": 153919792,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510766528
    },
    {
        "content": "<p>so its not meant to support some sort of 'authenticity statement'?</p>",
        "id": 153919793,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1510766555
    },
    {
        "content": "<p>formally it holds an Electronic-Signature or a Digital-Signature</p>",
        "id": 153919807,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510769771
    },
    {
        "content": "<p>I don't see that reversing the order of the examples is all that helpful. We would prefer a Digital-Signature, but we have use-cases where electronic-signature is needed... and can be supported just as well in the model.</p>",
        "id": 153919808,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510769947
    },
    {
        "content": "<p>I entered a CP to remove the word \"Digital\"   <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14193\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14193\">GF#14193</a>: Signature datatype definition needs to be inclusive of electronic signature</p>",
        "id": 153919812,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510770267
    },
    {
        "content": "<p>Back to the original question.<br>\n<code>Signature.type</code> is described as \"Indication of the reason the entity signed the object(s).\"<br>\nWhether a signature is  a full signature or just initials seems to be a different concept (maybe \"signature form\") and would need an extension in STU3.</p>",
        "id": 153919894,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1510811553
    },
    {
        "content": "<p>Agree</p>",
        "id": 153919905,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510819345
    }
]