[
    {
        "content": "<p>Hi<br>\nI don't know is it the right place to ask this question.<br>\nIs it possible to have multiple Digital Signature on a prescription?</p>",
        "id": 264970702,
        "sender_full_name": "Hamed Rezaei",
        "timestamp": 1639550112
    },
    {
        "content": "<p>Hi Hamed.  Right stream (<a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> ), wrong topic (R4B questions / issues). Maybe try starting a new one?</p>",
        "id": 265000725,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1639570532
    },
    {
        "content": "<p>I used admin powers to change the topic</p>",
        "id": 265069186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639599340
    },
    {
        "content": "<p>Signatures can appear in Bundle, Provenance and Extension.  At the moment, Bundle limits signature to 0..1.  The other two methods allow 0..*.  In principle, you could shove an extension in Bundle.signature that conveyed additional signatures.</p>\n<p>One of the questions you'll need to answer is \"what is a prescription?\".  In most of FHIR, it just refers to the MedicationRequest resource (or DeviceRequest if you're talking about glasses).  However, in some environments it refers to a document that encompasses the MedicationRequest and a bunch of other stuff.  The document approach comes with a price and makes interoperability and RESTful manipulation of the prescription harder, but it fits better with some system designs.</p>",
        "id": 265069703,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639599563
    },
    {
        "content": "<p>The signature would not need to be limited to Bundle.signature. Provenance.signature can sign anything, anytime, for any reason, by anyone. There can be multiple signatures in each Provenance (e.g. prescriber signature, and overseer counter signature). There can be multiple Provenance instances (e.g. same  use-case, just done a different times).</p>",
        "id": 265071770,
        "sender_full_name": "John Moehrke",
        "timestamp": 1639600608
    }
]