[
    {
        "content": "<p>When using the IG Publisher i can checkout the current state of another IG and use the #dev version tag. This is nice if you want to build an IG with dependencies to a current build of another IG.</p>\n<p>use-case: the other IG will soon release a new version and my dependent IG should be testable before the release of the needed dependency IG.</p>",
        "id": 234168515,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1618237720
    },
    {
        "content": "<p>Otherwise people have to start their IGs with dependencies which didn't change for a long time period.</p>",
        "id": 234168804,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1618237820
    },
    {
        "content": "<p>Note that the IG Publisher also allows for using the <code>#current</code> version tag, which will just pull the most recent CI build (if the dependency is registered to use the HL7 FHIR CI auto builder).  This is nice since it does not require you (the user) to manually pull down and build the dependency yourself.</p>",
        "id": 234173373,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1618239374
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> could simplifier support #current as well?<br>\nI would see #current as an adhoc package of the current project state available through the fhir package server, the second function would be also querying the CI auto builder output.</p>",
        "id": 234196323,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1618247708
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> There's many aspects to that:</p>\n<ul>\n<li>\n<p>On treating a <a href=\"http://Simplifier.net\">Simplifier.net</a> project as a <code>#urrent</code> package: The basis for that is there, you can for example already use the resolve URL <a href=\"https://simplifier.net/resolve?scope=NictizSTU3-Zib2017@current&amp;canonical=http://fhir.nl/fhir/StructureDefinition/nl-core-patient\">https://simplifier.net/resolve?scope=NictizSTU3-Zib2017@current&amp;canonical=http://fhir.nl/fhir/StructureDefinition/nl-core-patient</a> to go the page for that canonical in the project. It's not a big step to extend that to being able to depend with your <a href=\"http://Simplifier.net\">Simplifier.net</a> project on another live <a href=\"http://Simplifier.net\">Simplifier.net</a> project.<br>\nNote that this scope uses the project URL key instead of the package name, because there is no 1-to-1 linking between a project and package. You can release to multiple package lines from a project and release to the same package line from multiple projects.</p>\n</li>\n<li>\n<p>The next question is of course how we do this cross-platform: Depend on a <code>current</code> <a href=\"http://Simplifier.net\">Simplifier.net</a> project from within an IG Publisher CI build or the other way around. It's a very different thing from the current package server (because the packages aren't fixed). So should every package/IG development system expose their own build-package API which can be used to resolve these special packages?</p>\n</li>\n</ul>",
        "id": 234295857,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1618306780
    }
]