[
    {
        "content": "<p>Hello. If i publish a StructureDefinition to my project in Simplifier, and then change it in Forge, and do a save or publish in Forge, it creates a new StructureDefinition in Simplifier, thus i get a new copy for each time. Is this correct behaviour ?</p>",
        "id": 153908970,
        "sender_full_name": "Gerhard Andreassen",
        "timestamp": 1505812858
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192483\">@Gerhard Andreassen</span>, that is certainly not correct behavior... In FHIR, StructureDefinitions (as well as all other conformance resources) are identified by their canonical url, i.e. the value of the StructureDefinition.url property. If you upload a profile to your Simplifier project, and then re-upload a new version to the same project without chancing the canonical url, then Simplifier should update the existing initial profile to the new version (while keeping history of all older version).<br>\nCan you please verify if you changed the canonical url before uploading?</p>",
        "id": 153909248,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505907795
    },
    {
        "content": "<p>Hi. I don't change the Canonical URL. I make small changes to the structure or even metadata. After first publish, the Location changes from local to <a href=\"https://stu3.simplifier.net/\" target=\"_blank\" title=\"https://stu3.simplifier.net/\">https://stu3.simplifier.net/</a>... After each change to the profile with subsequent save to simplifier, a new Resource ID is given in Forge. I can see it change during save. Also, a new copy of the profile is created @simplifier, named \"&lt;resource_name&gt;-&lt;n&gt;\", e.g Specimen-1, Specimen-2 etc.</p>",
        "id": 153909256,
        "sender_full_name": "Gerhard Andreassen",
        "timestamp": 1505908334
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192483\">@Gerhard Andreassen</span>, correct, the server assigns the logical Resource id during creation. Forge will show the assigned id after saving to a FHIR server or Simplifier.<br>\nHowever this should not lead to duplicates.<br>\nCan you send me a link to your Simplifier project page, so I can take a look?</p>",
        "id": 153909266,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505909058
    },
    {
        "content": "<p>Hi. <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  here is the link to the project: <a href=\"https://simplifier.net/FHIRHelseNordintegra/~resources?fhirVersion=STU3\" target=\"_blank\" title=\"https://simplifier.net/FHIRHelseNordintegra/~resources?fhirVersion=STU3\">https://simplifier.net/FHIRHelseNordintegra/~resources?fhirVersion=STU3</a><br>\nThe Specimen resource/profile is the latest example of this \"phenomena\".</p>",
        "id": 153909267,
        "sender_full_name": "Gerhard Andreassen",
        "timestamp": 1505909216
    },
    {
        "content": "<p>HI <span class=\"user-mention\" data-user-id=\"192483\">@Gerhard Andreassen</span>, indeed, I can see the duplicate Specimen profiles and they all seem to share the same canonical url...?<br>\nI do note that the canonical url does not follow the standard fhir url scheme: http[s]://{domain}/fhir/StructureDefinition/{name}<br>\nHowever this should not affect Simplifier operations.<br>\nCan't immediately explain this behavior, I'll investigate and get back to you when we know more.</p>",
        "id": 153909268,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505909632
    },
    {
        "content": "<p>I notice that the duplicates of the Specimen profile all have different logical resource id values. What may have happened is that after publishing the Specimen profile to Simplifier, you did not save the updated profile (with the server-assigned logical resource id) back to disk. Then you re-opened and re-published the local copy (without resource id), and this caused Simplifier to create a new project item with a new server-assigned logical resource id.<br>\nTo prevent this from happening, after publishing a resource to Simplifier, make sure that you also save a local copy of the resource with the server-assigned logical resource id.<br>\nWe'll discuss the current behavior with our team to see if we can improve the user experience.</p>",
        "id": 153909269,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505910160
    },
    {
        "content": "<p>Hi, we noticed the same issue in our FinnisPHR simplifier project (<a href=\"https://simplifier.net/FinnishPHR/\" target=\"_blank\" title=\"https://simplifier.net/FinnishPHR/\">https://simplifier.net/FinnishPHR/</a>). If we upload new version of the profile in Simplifier's main page (Upload - Upload file) it creates new profile resource in Simplifier. The resource.url is same in both but url simplifier uses differs. For example first version is finnishphr-bloodpressure-stu3 profile has resource.url \"<a href=\"http://phr.kanta.fi/StructureDefinition/fiphr-bloodpressure-stu3\" target=\"_blank\" title=\"http://phr.kanta.fi/StructureDefinition/fiphr-bloodpressure-stu3\">http://phr.kanta.fi/StructureDefinition/fiphr-bloodpressure-stu3</a>\", simplifier creates for that own \"registry url\" \"<a href=\"https://simplifier.net/FinnishPHR/fiphr-bloodpressure-stu3\" target=\"_blank\" title=\"https://simplifier.net/FinnishPHR/fiphr-bloodpressure-stu3\">https://simplifier.net/FinnishPHR/fiphr-bloodpressure-stu3</a>\". When we update the profile using Upload -Upload file,  the resource url is/remain same \"<a href=\"http://phr.kanta.fi/StructureDefinition/fiphr-bloodpressure-stu3\" target=\"_blank\" title=\"http://phr.kanta.fi/StructureDefinition/fiphr-bloodpressure-stu3\">http://phr.kanta.fi/StructureDefinition/fiphr-bloodpressure-stu3</a>\" but the \"registry url\" is updated to <a href=\"https://simplifier.net/FinnishPHR/fiphr-bloodpressure-stu3-2\" target=\"_blank\" title=\"https://simplifier.net/FinnishPHR/fiphr-bloodpressure-stu3-2\">https://simplifier.net/FinnishPHR/fiphr-bloodpressure-stu3-2</a>.</p>\n<p>If we use update found in the resource's own page the versioning works fine (Update - Upload: Update by uploading a file).</p>",
        "id": 153909270,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1505910233
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192558\">@Mika Tuomainen</span>, in your situation the behavior can be explained. If you upload a new version from a resource's own page, Simplifier knows your updating that instance. However if you upload from e.g. the main page, then you must ensure that the new resource version has the exact same logical resource id as the existing version, otherwise there is no way for Simplifier to know that they represent different versions of the same resource.</p>",
        "id": 153909271,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505910525
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> , I first explained the same issue ;-) I'm not sure but I remember that we also had  the same <a href=\"http://resource.id\" target=\"_blank\" title=\"http://resource.id\">resource.id</a> (logical id) in our profiles which we updated from the main page Upload.</p>\n<p>But we noticed that we can evolve the problem using resource's own page.</p>",
        "id": 153909274,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1505911049
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192558\">@Mika Tuomainen</span>, thank you for the user feedback! We'll take another close look at this behavior to see if we can improve the user experience.</p>",
        "id": 153909277,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505911507
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> wer are probably dealing with the same issue, but we are using the github hook of simplifier. <a href=\"https://simplifier.net/BasisprofilDE/ebm\" target=\"_blank\" title=\"https://simplifier.net/BasisprofilDE/ebm\">https://simplifier.net/BasisprofilDE/ebm</a></p>",
        "id": 153909280,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1505912810
    },
    {
        "content": "<p>same for <a href=\"https://simplifier.net/BasisprofilDE/ops\" target=\"_blank\" title=\"https://simplifier.net/BasisprofilDE/ops\">https://simplifier.net/BasisprofilDE/ops</a></p>",
        "id": 153909281,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1505912845
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>, thank you for the feedback! Definitely helpful to get a response from several users. Our team will evaluate the publishing behavior and try to improve the process of dealing with / preventing duplicates.</p>",
        "id": 153909283,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505913103
    },
    {
        "content": "<p>We discussed this issue also in San Diego at the WGM. This were our thougths on the problem:</p>\n<ul>\n<li>Simplifier should only allow one instance of the same profile within one workspace (if canonical url and version are the same) and automatically match and overwrite the old instance of the profile</li>\n<li>As simplifier takes all profile in all workspaces (at least the ones marked as published?) into account when validating a resource it is not determined which profile from wich workspace will be used. It would be nice to be able to select to validate: inside the workspace, also using core profiles,extensions and value sets, and/or mark all workspaces which should be considered.</li>\n<li>related feature request: It would be nice to have a \"validate all\" button, which validates all resources of a workspace, or even a automatic validate when uploading new resources with email alerts if an update breaks any conformance (continous integration like)<br>\nIs it fine to leave these requests here or should i send them also to <a href=\"mailto:simplifier@furore.com\" title=\"mailto:simplifier@furore.com\">simplifier@furore.com</a> ?</li>\n</ul>",
        "id": 153909291,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1505913511
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>, great suggestions, thank you!</p>\n<p>I like the proposed \"validate all\" command.</p>\n<p>Validate on upload is tricky, as users may upload in random order, e.g. first a profile with an extension element, then the referenced extension definition. Maybe we could handle this gracefully using a queue.</p>\n<p>We've always intended for Simplifier to provide compartmentalization of project spaces and we're continuously improving this.</p>\n<p>BTW we're always monitoring Zulip, so feel free to discuss Simplifier issues and features here. This way, other users can join the discussion. But of course, you can also use the feedback button in the header bar of the website.</p>",
        "id": 153909307,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505914891
    }
]