[
    {
        "content": "<p>I am making a <code>Flags</code> table so need some <code>Flag.code</code> values...</p>",
        "id": 153830185,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464338268
    },
    {
        "content": "<p>is this legitimate as a simplest case: <br>\n<code>code: {                      \n     text: 'Under care of APS', \n     coding: [{code: 'APS'}]    \n   {</code></p>",
        "id": 153830186,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464338301
    },
    {
        "content": "<p>on reflection I guess I'm probably best, at this stage, simply storing the code - then doing a tranformation during any FHIR serve process...</p>",
        "id": 153830188,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464339583
    },
    {
        "content": "<p>i'm still working through the best way to use FHIR as the basis of an information model </p>",
        "id": 153830189,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464339635
    },
    {
        "content": "<p>i guess <code>information model</code> != <code>interchange format</code></p>",
        "id": 153830190,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464339675
    },
    {
        "content": "<p>You can send just text alone.  No need to include a code.  If you have a code, you really should have a system.  Technically, the text element should come after coding, though JSON generally doesn't care</p>",
        "id": 153830215,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464362350
    },
    {
        "content": "<p>+1 <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  The \"should\" there is a SHALL. <span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span>  PLEASE never make up codes. Codes are from CODE SYSTEMS that actually exist, follow rules, are published and maintained, and are available to others.</p>",
        "id": 153830218,
        "sender_full_name": "Robert McClure",
        "timestamp": 1464362931
    },
    {
        "content": "<p>We can't make it a SHALL because there are legacy environments that have codes and have no idea what system or namespace they come from.</p>\n<p>Making up codes is fine - so long as you make up the code system they live in too.  (And don't make up codes if there's a standard way to say what you need in a publicly available reliable code system)</p>",
        "id": 153830227,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464364790
    },
    {
        "content": "<p>If anyone can find me a code for \"under care of APS\" and \"has received spinal morphine, not to receive parenteral opioids\" I shall buy them a drink. </p>",
        "id": 153830310,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464388929
    },
    {
        "content": "<p>I understand the issues <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>, but local codes are every where. Mechanisms to manage that reality are critical. I am just making baby steps in my health service and need some runs on board so the case for migrating 50 legacy approaches towards Fhir based integration gets some serious consideration </p>",
        "id": 153830311,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464389280
    },
    {
        "content": "<p>An ontology engine is definitely on my radar but have to demonstrate ability to meet some clinical needs first </p>",
        "id": 153830312,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464389368
    },
    {
        "content": "<p>APS = Australian psychological society?</p>",
        "id": 153830314,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464389468
    },
    {
        "content": "<p>\"acute pain service\"</p>",
        "id": 153830315,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464389868
    },
    {
        "content": "<p>310072004: Acute pain service on the encounter, but I can't see where on the encounter clinical unit goes...</p>",
        "id": 153830318,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464390102
    },
    {
        "content": "<p>the <code>flag</code> is \"under care of APS\"</p>",
        "id": 153830323,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464390331
    },
    {
        "content": "<p>this applies between encounters and is a warning to the intern and a message to the ward nurses</p>",
        "id": 153830324,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464390373
    },
    {
        "content": "<p>\"any pain issues contact us please\"</p>",
        "id": 153830325,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464390388
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span> You can certainly say (I'd hope) in FHIR all the information you have noted using SNOMED, a medication code system, and the medication and encounter resources. Not making up a code for all the complexity you have in your quoted phrases is the whole point of doing interoperable modeling. There is a distinct pay-off for enduring the difficulty of consistent representation using codes and an agreed upon model. I'm sure you know this.  That said, you have misrepresented my intent of saying if you use a code, you need to say what code system it came from. I see another discussion on this (see SSN) in the forum threads. Yes there are thousands of local codes - make them live in a local code system and keep track of it. And <em>RANT</em> I'm tired of hearing that no one does that so we won't start now. We need to grow up and start doing the right thing, not simply the easy thing.If you are participating in the development of FHIR - now is when those changes should occur.<em>End RANT</em> The improvement process can only start with us, right?</p>",
        "id": 153830749,
        "sender_full_name": "Robert McClure",
        "timestamp": 1464727122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> heh - trust me I am well aware of the complexities :-) we will never elliminate local coding - yes I need to build a proper ontology service into the system - but currently I need to get a working system - there will also always be many decision points within a system (that maybe enumerated value sets in a UI drop down or allowed values in a variable somewhere, options in a switch statement) that dont really need encoding - any decions point in any kind of algorithmic decision support engine may have a score of binary decision points - these will be extraordinarily precise and context specific - the point being that not all things that are \"encodable\" must go into the ontology server and the boundary of what should and shouldn't will always be grey. That said I'm right with you! just gimme some time to catch up :-)</p>",
        "id": 153830758,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464732180
    }
]