[
    {
        "content": "<p>Sorry to bring up an old issue (SimpleQuantity was introduced in  DSTU2 QA Preview).</p>\n<p>I am reviewing data types and i try to understand the rationale behind the introduction of SimpleQuantity.<br>\nSo currently SimpleQuantity is described as \"The comparator is not used on a SimpleQuantity\" so the only semantic difference is the forced absence of Quantity.comparator. In that context i read in quantity.comparator in isModifier \"If there is no comparator, then there is no modification of the value\"</p>\n<p>So as i understand a Quantity may refrain from having a comparator and in that case the semantics are clear... \"..no modification of value\".<br>\nWhy simpleQuanity was introduced then?<br>\nIn general optional properties do not introduce new data types (e.g. there is no defined variation of Quantity data type for those missing a Quantity.code)</p>\n<p>thanks in advance.</p>",
        "id": 154020787,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1543221842
    },
    {
        "content": "<p>it's a convenient short cut for making the rule 'no comparator in this context'</p>",
        "id": 154020793,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543225553
    },
    {
        "content": "<p>Thank you Grahame , i understand the actual use , i only find weird that the option to omit comparator is already described in the quantity.comparator property. For example the introduction of Counts is easily justified since the is no explanation in Quantity  what are the semantics of a Quantity without unit.</p>",
        "id": 154020798,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1543226835
    },
    {
        "content": "<p>Another thing i noticed: <br>\n(writing here instead of a new stream)</p>\n<p>\"Defined Variations on Quantity<br>\nThere are several additional data types that are specializations of Quantity that only introduce new restrictions on the existing elements defined as part of the Quantity data type. \"</p>\n<p>Why money is part of this?  IMHO is should now be a distinct Complex data type since it has it's own properties .value, .currency and not a restriction on Quantity.value and Quantity.code as it was initially.</p>",
        "id": 154020799,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1543227731
    },
    {
        "content": "<p>how is money part of that? I'm not seeing any offending wording</p>",
        "id": 154020802,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543229051
    },
    {
        "content": "<p>sorry my mistake there is MoneyQuantity (which refers to the old Money) and Also \"just\" money as new complex data type \"2.24.0.7 Money\"</p>",
        "id": 154020809,
        "sender_full_name": "Vassilis Kilintzis",
        "timestamp": 1543231227
    },
    {
        "content": "<p>yes</p>",
        "id": 154020819,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543233832
    }
]