[
    {
        "content": "<p>Fun mental exercise. If Slack or Zulip or Teams are used in a medical setting and we were to represent in FHIR, would it be Communication? Does FHIR actually encapsulate the structures inherent to chat like that?</p>\n<p>Channels = Recipient (so a Group orList of providers/patients per channel?)<br>\nThreads = PartOf with Communication as parent?</p>",
        "id": 243700004,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1624476180
    },
    {
        "content": "<p>I think that depends on the extent the policy/system sees the native communication mechanism as persistent enough. Meaning, one could expect that Slack/Zulip/Teams are persistent, and thus one only needs to record a Communication with reference to the thread.   Where it is deemed not persistent, or not persistent-enough, or other reason... I could see how the whole text might be desired to be copied.   With Medical-Records, retention lifespan is critical. Sometimes it is just 5 years, sometimes it is 75 years -- <a href=\"https://library.ahima.org/PB/RetentionDestruction#.YNOLHxGSmUk\">https://library.ahima.org/PB/RetentionDestruction#.YNOLHxGSmUk</a></p>",
        "id": 243700663,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624476509
    },
    {
        "content": "<p>It's an interesting question as DirectTrust now has a draft standard for XMPP chat.  We'd need a way to reference that.</p>",
        "id": 243702824,
        "sender_full_name": "David Pyke",
        "timestamp": 1624477619
    },
    {
        "content": "<p>I had originally proposed XMPP as my proposal at the original Direct Project solution meetings... interesting...</p>",
        "id": 243703127,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624477754
    },
    {
        "content": "<p>Yet again, DirectTrust is on the cutting edge of technology</p>",
        "id": 243703195,
        "sender_full_name": "David Pyke",
        "timestamp": 1624477789
    },
    {
        "content": "<p>Communication seems most reasonable.  Quite a few systems use it for \"e-mail over FHIR\".  From that perspective, Slack/Zulip/Teams are just slightly varied forms of 'email'.</p>",
        "id": 243941179,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624639584
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> the question is not if a Communication is recorded... it is if the Communication must replicate everything actually communicated or if we trust RESTful APIs to these actual communication platforms so as to record in our Communication simply a reference (REST - read)?</p>",
        "id": 243943115,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624640570
    },
    {
        "content": "<p>Communication was designed to be a record of what was shared, but it's being used in many quarters as a means of sharing.  It seems to work for both.</p>",
        "id": 243970992,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624655305
    }
]