[
    {
        "content": "<p>Is it legal (or does it even make sense) to constrain sub elements of the \"setup\" slice when slicing in profiles?</p>",
        "id": 153814818,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457630383
    },
    {
        "content": "<p>By \"setup\" slice I mean the \"slicing entry\" as per <a href=\"https://www.hl7.org/fhir/profiling.html#discriminator\" target=\"_blank\" title=\"https://www.hl7.org/fhir/profiling.html#discriminator\">https://www.hl7.org/fhir/profiling.html#discriminator</a>.</p>",
        "id": 153814826,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457630723
    },
    {
        "content": "<p>I think it doesn't make sense. (But my understanding of slicing is... limited.)</p>",
        "id": 153814828,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457630772
    },
    {
        "content": "<p>OK cool - I guess I was thinking you may want to apply certain restrictions to all of the slices (and any elements added outside the slices (if Open or OpenAtEnd)).</p>",
        "id": 153814831,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457630826
    },
    {
        "content": "<p>However it would make it complicated to apply (and calculate) the restrictions if this were the case.  So I hope the answer is no!</p>",
        "id": 153814833,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457630920
    },
    {
        "content": "<p>You can definitely constrain sub-elements of the setup slice.  For example, you can say \"the only kinds of telecoms allowed are phone numbers\" and then slice to say that there must be one home number and can be up to two work numbers.</p>",
        "id": 153814989,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1457651522
    },
    {
        "content": "<p>(Now whether Forge allows that or not, I have no idea :))</p>",
        "id": 153814990,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1457651540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> OK, Forge doesn't allow you to do that.  Once you've sliced an element, you can only modify elements of the slices, and not the setup slice.</p>",
        "id": 153814998,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457652029
    },
    {
        "content": "<p>Raise the issue on the \"conformance\" stream so they can add it to their to-do list</p>",
        "id": 153815000,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1457652087
    },
    {
        "content": "<p>This does make for some pretty tricky validation logic though!</p>",
        "id": 153815006,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457652581
    },
    {
        "content": "<p>(raised)</p>",
        "id": 153815007,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457652605
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thank you for pointing this out.<br>\nIn Forge, the element treeview represents slice constraints as child nodes of the sliced element. The original child elements of a sliced element are hidden in the treeview. The UI clearly expresses the relationship between the sliced element and the associated slices, however it also prevents the user from constraining the original child elements.<br>\nIf the spec indeed allows this, then Forge should support it too. However I'm afraid that displaying both the original child elements as well slices will clutter the UI and is likely to confuse the user. Alternatively, displaying slices as following siblings (like they are defined in StructureDefinition) would require quite invasive and time-consuming changes in the application, and frankly that is not a feasible option at the moment. Some kind of toggle button that controls the visibility of the original child nodes might work, but I'm not fully convinced. I'll add an issue to our tracker and ponder on the UI.</p>",
        "id": 153815157,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1457695795
    },
    {
        "content": "<p>When slicing an element, the discriminators determine (select) which slice definition applies to each instance of the element.  The definition is based on the fixed[x] value of each discriminator element OR (I think) a binding for the element.  See <a href=\"http://hl7-fhir.github.io/profiling.html#discriminator\" target=\"_blank\" title=\"http://hl7-fhir.github.io/profiling.html#discriminator\">http://hl7-fhir.github.io/profiling.html#discriminator</a> paragraph 3.</p>\n<p>This means that all other parts of the element definition are validation criteria for the slice.  In other words, a failure of a constraint on that element would NOT simply disqualify the instance as a member of the slice but would rather make the entire resource instance invalid.</p>\n<p>Is this correct?</p>",
        "id": 153818120,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1458930399
    },
    {
        "content": "<p>I ask this for 2 reasons:<br>\n1. Clarify whether binding is a valid way to discriminate (I've heard both yes and no at various times).<br>\n2. Clarify that constraint and all the other parts of elementdefinition really are not useful in slice discrimination.</p>\n<p>We're running into all kinds of situations where a more sophisticated slicing discriminator would be valuable...</p>",
        "id": 153818123,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1458930617
    },
    {
        "content": "<p>Especially min/max for range segmentation</p>",
        "id": 153818127,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1458930875
    },
    {
        "content": "<p>Slicing doesn't require declaration of a computable discriminator - you can provide a description instead.  And if you do that, anything goes.  But validation becomes much more expensive.  As well, the discriminator can be @profile, which allows you to do all sorts of things</p>",
        "id": 153818130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458932471
    },
    {
        "content": "<p>Is that clear in the section I referenced?  Shouldn't there be some line between \"standard computable\" and \"wild west\"?</p>",
        "id": 153818131,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1458932532
    },
    {
        "content": "<p>The deliniation is \"descriminator\" vs. \"description\"</p>",
        "id": 153818135,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458933126
    },
    {
        "content": "<p>We don't talk too much about slicing without discriminators because that's not something we necessarily want to encourage, but we probably should beef up the description of when and why you might have slicing that doesn't list discriminators</p>",
        "id": 153818136,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458933273
    },
    {
        "content": "<p>So if it's \"discriminator\" then it MUST be fixed[x] or bound (assuming not @type/@profile).</p>",
        "id": 153818138,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1458933371
    },
    {
        "content": "<p>If you have a discriminatory, you can slice by element fixed value, type (for a polymorphic element) and/or by profile.  You can only enforce bindings within profile.</p>",
        "id": 153818140,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458934573
    },
    {
        "content": "<p>Chris: Lloyd has made this difficult, I think. Yes, you can slice by fixed value, or required binding. And yes, errors outside the discriminator are validation errors, not slice mismatches</p>",
        "id": 153818165,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458943197
    },
    {
        "content": "<p>How can you slice by required binding without using profile or description?</p>",
        "id": 153818174,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458947989
    },
    {
        "content": "<p>Sounds like there's some...ambiguity.</p>",
        "id": 153818864,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267004
    },
    {
        "content": "<p>I'm assuming limiting the parts of elementdefinition used for slice selection is to simplify implementation, yes?  @profile pretty much adds all that complexity back in though...  I'm going to propose that all parts of the element definition for a discriminator element within a named slice be part of the selection, not validation.  In other words, failure of any aspect of the discriminator element of a named slice simply means \"this is not the slice you're looking for\".  This enables much more rich slicing.  Thoughts?</p>",
        "id": 153818865,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267202
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>",
        "id": 153818866,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267247
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> </p>",
        "id": 153818867,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267258
    },
    {
        "content": "<p>Separate topic - now that name isn't for recursive things, does name need to be unique within the whole structure definition, or just within siblings?</p>\n<p>Consider when a complex extension is used in multiple places in a SD.  If my complex extension has 3 sub-elements: type, code, and reference (these are all named slices of extension in this case), these names will appear in the SD in multiple places IF the SD further constrains them in some way.</p>\n<p>I think uniqueness is already broken...</p>",
        "id": 153818870,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191351\">@Chris Grenz</span> I remember that my collaegue Martijn Harthoorn has struggled with this last year. IIRC, having to validate the full element in order to determine the associated slice introduces all kinds of ambiguity and nasty recursive matching challenges. So in order for slicing to be implementable, he strongly suggests to limit the discriminator to a primitive value that is easy to match. This ensures that you can find the associated slice _before_ trying to validate the element.</p>",
        "id": 153818871,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459267725
    },
    {
        "content": "<p>That's fine IF we don't bother with @profile as a valid disciminator...</p>",
        "id": 153818872,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267779
    },
    {
        "content": "<p>Adding that in brings the devil's details with it!</p>",
        "id": 153818873,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267795
    },
    {
        "content": "<p>you can match on profile url, that's a primitive value</p>",
        "id": 153818874,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459267805
    },
    {
        "content": "<p>Only if you *only* consider meta.profile values which requires pre-coordination and tagging of all resources.</p>",
        "id": 153818875,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267863
    },
    {
        "content": "<p>What about maxValue[x] and minValue[x] - that should be OK, no?</p>",
        "id": 153818876,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267903
    },
    {
        "content": "<p>Ah so you are referring to resources that implicitly conform to a certain profile?</p>",
        "id": 153818877,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459267904
    },
    {
        "content": "<p>Right...we're currently implementing profile evaluation at a server level.  Basically, search by (previously not evaluated) profile.</p>",
        "id": 153818878,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267943
    },
    {
        "content": "<p>Without this, new profiles are of limited value...</p>",
        "id": 153818880,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459267980
    },
    {
        "content": "<p>So matching a slice would require to find a matching profile on the fly? That seems very costly... how do you determine which candidate profiles you are going to try and match? All profiles that exist on the server?</p>",
        "id": 153818881,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459268010
    },
    {
        "content": "<p>I don't think Martijn is going to like this ;p</p>",
        "id": 153818882,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459268025
    },
    {
        "content": "<p>No...just the profile(s) used to discriminate.</p>",
        "id": 153818883,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459268057
    },
    {
        "content": "<p>We're using ElasticSearch which makes much of the profile validation relatively fast/cheap (fixed, range, binding).  Most of the constraints appear on the base HL7 defined profile, so those are always validated and don't need to be re-evaluated.  This leaves only new constraints to consider on a per-resource basis (and we try to limit/discourage these).</p>",
        "id": 153818884,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459268168
    },
    {
        "content": "<p>So, when I am onboarding my Cardiology dept and they define a new profile for cardiology-lab-observation with a limited binding on Observation.code, this can effectively be served by a search for code:in=cardiology-lab-vs</p>",
        "id": 153818885,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459268237
    },
    {
        "content": "<p>and _profile=Enterprise-Lab-Profile (to cover anything else fancy about labs).</p>",
        "id": 153818886,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459268267
    },
    {
        "content": "<p>Hmm, interesting. Don't you think this behavior is specific to your implementation? As in general, matching resources to profiles is a costly operation. So I am not sure if the FHIR standard should define this automagical profile matching as mandatory functionality...</p>",
        "id": 153818887,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459269236
    },
    {
        "content": "<p>No, I think this could be an option.  The \"depth\" of profile validation may be something to call out in conformance though.</p>",
        "id": 153818888,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459269288
    },
    {
        "content": "<p>Many implementation (esp facades) won't be able to do this efficiently enough to be practical.</p>",
        "id": 153818889,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459269330
    },
    {
        "content": "<p>Agreed, it would be useful to express support for this advanced behavior via a Conformance resource.</p>",
        "id": 153818890,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459269393
    },
    {
        "content": "<p>I'm interested in Martijn's work - where he found issues</p>",
        "id": 153818891,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459269396
    },
    {
        "content": "<p>I'm looking forward to discussing your proposal with Martijn Harthoorn ;p</p>",
        "id": 153818892,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459269427
    },
    {
        "content": "<p>We're pretty early in the process - mostly converting profiles into search criteria today.</p>",
        "id": 153818893,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459269430
    },
    {
        "content": "<p>I think Martijn tried to implement a very generic solution that could deal with any kind of profile / nested slicing construction etc - and gave up trying, as the possibilities seemed dizzying...</p>",
        "id": 153818894,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459269565
    },
    {
        "content": "<p>The benefit with profile is we already need to have code that tests whether a given instance is valid against a profile.  It's expensive code to run (and is a pain to write), but it has to exist.  And given that profile can do whatever's needed, it's hard to justify adding in another means of doing the same thing.  As well, if implementers are concerned about performance, they can mandate the declaration of particular profile ids in the instances and thus avoid the performance issues.  There'd be no similarly easy out if we opened up discriminator further.</p>",
        "id": 153818908,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459274798
    },
    {
        "content": "<p>firstly, name uniqueness, you might be right. I'll have to look at that to see whether I have any problems with uniqueness and navigation</p>",
        "id": 153818921,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459279708
    },
    {
        "content": "<p>slicing, agree that slicing by profile is much more complex. It only really works if the profile itself is simple. otherwise, you might as well not define a discriminator</p>",
        "id": 153818922,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459279750
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> I've been mentally reviewing the options for slice selection and keep coming back to the necessity to evaluate every constraint (scalar or xpath/fluentpath) during validation <em>regardless</em> of whether it's used for selection or validation.  Is slice selection somehow more complex?</p>",
        "id": 153819381,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459437071
    },
    {
        "content": "<p>If the discriminator is declared, you just need to look at the discriminator to figure out what slice it is.  Then you test the constraints for that particular slice.  But you can ignore the constraints for all of the other slices.</p>",
        "id": 153819394,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459437643
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191351\">@Chris Grenz</span> I informed my colleague Martijn about this discussion topic. He's very busy atm, but hopefully he can find some time to chip in. From what I understand, the challenge is that in order to validate a slice in a resource instance, you need to match it to a slice definition in the profile  - but in this case, matching requires validation. This introduces a recursive dependency. Martijn can probably explain the issue in greater detail.</p>",
        "id": 153819395,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459437650
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'm considering challenging how it's currently working and trying to discern the complexities of what I'm proposing.</p>",
        "id": 153819396,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459437692
    },
    {
        "content": "<p>uh oh...</p>",
        "id": 153819397,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459437711
    },
    {
        "content": "<p>I'm just running into may use cases where fixed discriminator slices aren't adequate.  And there's no way to use extensions to get around this...</p>",
        "id": 153819398,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459437760
    },
    {
        "content": "<p>Big ones are range slicing and ordinal position slicing</p>",
        "id": 153819399,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459437828
    },
    {
        "content": "<p>And (even more!) slicing by binding/valueset</p>",
        "id": 153819400,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459437866
    },
    {
        "content": "<p>Interesting. Ordinal position slicing would seem so basic that you'd expect it would be covered by the standard. Maybe FHIR should define some rules for this specific case.</p>",
        "id": 153819401,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459438017
    },
    {
        "content": "<p>Right? :)</p>",
        "id": 153819402,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459438036
    },
    {
        "content": "<p>The other use cases don't seem too exotic either.</p>",
        "id": 153819403,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459438051
    },
    {
        "content": "<p>In those places where a fixed discriminator can't work, you can slice by profile, which then requires testing the instance against each profile or looking for the profile.  The former is expensive, the latter requires agreement of the submitter.  But it should meet your needs in either case, with the possible exception or slicing by position which you've already proposed.</p>",
        "id": 153819404,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459438054
    },
    {
        "content": "<p>Hmm...so create a type profile and use @profile to put all parts of elementdefinition into play...</p>",
        "id": 153819405,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459438224
    },
    {
        "content": "<p>ug...ok</p>",
        "id": 153819406,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459438230
    },
    {
        "content": "<p>makes so much of the semantics external to the SD itself....but makes some things re-useable</p>",
        "id": 153819407,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459438280
    },
    {
        "content": "<p>and implementer penetration is going to be, umm.... low? =)</p>",
        "id": 153819408,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459438324
    },
    {
        "content": "<p>Range slicing is also an interesting case. Maybe the discriminator could accept a FHIRPath expression? In it's most simple form this is an element path, but it would also allow for complex multi-field expressions. Just thinking out loud here.</p>",
        "id": 153819413,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459438579
    },
    {
        "content": "<p>Assuming that all the popular FHIR API libraries will (eventually) provide FHIR path support, this seems feasible.</p>",
        "id": 153819414,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1459438671
    },
    {
        "content": "<p>I would like to keep a line between scalar evaluation and expression evaluation - the former being possible during stream parsing and the latter not so much.</p>",
        "id": 153819415,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459438848
    },
    {
        "content": "<p>Smart parsing of profiles though could retain that line...</p>",
        "id": 153819416,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459438867
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> So a discriminator of @type doesn't require looking at type.profile, just type.code where @profile looks at both?</p>",
        "id": 153819417,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1459438928
    },
    {
        "content": "<p>@profile incidentally ends up looking at both.  And yes, penetration will be \"low\" - but that's ok.  We'd like most uses of slicing to be straight-forward.  The more complex edge-case stuff ought to be less common.</p>",
        "id": 153819430,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459445394
    },
    {
        "content": "<p>Assume a create a profile of CodeableConcept where I slice coding into LOINC and SNOMED by system.  I then use that type in an Encounter profile to add these slicings to Encounter.type:</p>\n<div class=\"codehilite\"><pre>&lt;element&gt;\n    &lt;path value=&quot;Encounter.type&quot; /&gt;\n    &lt;type&gt;\n        &lt;code value=&quot;CodeableConcept&quot; /&gt;\n        &lt;profile value=&quot;http://.../my-codeableconcept&quot; /&gt;\n    &lt;/type&gt;\n</pre></div>\n\n\n<p>I then (in my Encounter profile) slice type into \"Practice Type\" and \"Institution Type\".  Do each of these slices now including coding slicings (for LOINC and SNOMED)?</p>",
        "id": 153822876,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1461354669
    },
    {
        "content": "<p>yes</p>",
        "id": 153822877,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461354712
    },
    {
        "content": "<p>And would a snapshot be expected to include them?</p>",
        "id": 153822879,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1461354730
    },
    {
        "content": "<p>Is there a way to slice a BackboneElement (e.g. Patient.contact) by @profile?  For instance, slice Patient.contact by relationship in a valueset.  Since backbone element don't have their own SDs, there's no way to create a profile for just contact, correct?</p>",
        "id": 153824391,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462313159
    },
    {
        "content": "<p>yes you have to enter the profile at the root of the resource, but you don't need yo say anything about the elements other than Patient.contact</p>",
        "id": 153824392,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462313219
    },
    {
        "content": "<p>So the contact tag will be evaluated for conformance against a whole Patient profile? That's...confusing....</p>",
        "id": 153824395,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462313750
    },
    {
        "content": "<p>But not unusable....</p>",
        "id": 153824396,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462313769
    },
    {
        "content": "<p>I'm trying to slice something by type, but cannot seem to get it to work on observation.  Anyone here have any words of wisdom.  The error I'm getting is: Attempt to a slice an element that does not repeat: Observation.value[x]/null from <a href=\"http://hl7.org/fhir/StructureDefinition/CodeableConcept\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/CodeableConcept\">http://hl7.org/fhir/StructureDefinition/CodeableConcept</a> but my use of value[x] only includes Quantity | string.</p>",
        "id": 153828117,
        "sender_full_name": "Keith Boone",
        "timestamp": 1463473316
    },
    {
        "content": "<p>Keith - what tool are you using?</p>",
        "id": 153828135,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1463491498
    },
    {
        "content": "<p>Using the spreadsheet.</p>",
        "id": 153828140,
        "sender_full_name": "Keith Boone",
        "timestamp": 1463492836
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span>  \"Attempt to a slice an element that does not repeat\" is not possible. Slicing is done on element that may occur more than once.  You define the type as valueQuantity.</p>",
        "id": 153828395,
        "sender_full_name": "Eric Haas",
        "timestamp": 1463543839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> That's not true actually.  You can also slice when an element has a choice of types.</p>",
        "id": 153828436,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463578060
    },
    {
        "content": "<p>Ah yes ... my mistake.</p>",
        "id": 153828440,
        "sender_full_name": "Eric Haas",
        "timestamp": 1463578998
    },
    {
        "content": "<p>This is a \"2 ways to do something\" situation.  Why would we not just use the type named element for this?  It's very ambiguous.</p>",
        "id": 153828441,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1463580520
    },
    {
        "content": "<p>might not have a single type?</p>",
        "id": 153828468,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463594813
    },
    {
        "content": "<p>Yes, I suppose you could create slices for multiple types...huh.</p>",
        "id": 153828469,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1463594886
    },
    {
        "content": "<p>Hi all, what if I have to slice the element  'identifier'  and do not know the total number of slices? Thank you</p>",
        "id": 153921640,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1511787770
    },
    {
        "content": "<p>Just define the slices you care about.  Others can define additional slices and it's fine if there is space that remains unsliced.</p>",
        "id": 153921650,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511793205
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I did not understand. Can you elaborate?</p>",
        "id": 153921759,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1511848927
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span>  just slice the identifier element as many times af you can / want to specifiy this element. Leave the slicing.orderd on  'open' or  'openAtEnd' so it is possible to add additional identifiers you don't specify in your profile.</p>",
        "id": 153921801,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1511865752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span>  Ok thank you</p>",
        "id": 153921802,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1511865921
    },
    {
        "content": "<p>HI <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am trying to understand how to do slices in the spreadsheet. To understand this, I am using practitioner profile example, having multiple identifiers for practitioner (provider number, license number) and trying to show then as slices. I want to slice it on Practitioner.identifier.type (whose fixed code values are 'PN','LN'). Please let me know <a href=\"/user_uploads/10155/TBYgufChiRhyZkJcL3WpEQxQ/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/TBYgufChiRhyZkJcL3WpEQxQ/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/TBYgufChiRhyZkJcL3WpEQxQ/Capture.PNG\"></a></div>",
        "id": 178400878,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1571331868
    },
    {
        "content": "<p>You need to declare a discriminator on the first repetition column (discriminator column) which should be type.@pattern.  Your patterns need to be in the pattern column, not the value column.  And you need to put a name in the profile name for your two subsequent identifier repetitions to name your slices</p>",
        "id": 178402159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571332880
    },
    {
        "content": "<p>Perfect! Works now :) Thanks Lloyd. However, I don't understand the role of 'Profile Name' column here, since we have mentioned in Discriminator column how to distinguish the slices (pattern column has the appropriate code to differentiate between slices)..</p>",
        "id": 178403159,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1571333698
    },
    {
        "content": "<p>Also, what will be the 'Discriminator' if I want to slice it for example on practitioner.identifier.use (which has 'code' type)? just trying to understand different discriminator types..</p>",
        "id": 178404613,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1571334612
    },
    {
        "content": "<p>Every slice needs to have a name.  That name is used to establish a unique id for the slicing element and descendant elements.  It can also be referenced in child profiles if re-slicing the element.</p>",
        "id": 178405020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571334887
    },
    {
        "content": "<p>If you're slicing on code, you generally slice by value, not pattern, so just strip off the \".@pattern\" from the end.  (Slicing by value is the default.)</p>",
        "id": 178405058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571334917
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  makes perfect sense!</p>",
        "id": 178405790,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1571335428
    },
    {
        "content": "<p>Slicing often doesn't, so that's awesome :)</p>",
        "id": 178427948,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571351534
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am trying to have a contained resource (consent) in immunization profile, can you let me know how to do that in spreadsheet?</p>",
        "id": 179073564,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1572026163
    },
    {
        "content": "<p>Look at the example in the <a href=\"https://github.com/fhir/sample-ig\" target=\"_blank\" title=\"https://github.com/fhir/sample-ig\">https://github.com/fhir/sample-ig</a>.  Also, the first page of the spread points to a wiki page that provides some documentation</p>",
        "id": 179074062,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572026502
    },
    {
        "content": "<p>umm, I am still unsure how to do document another resource as 'Contained' in the profile. If consent is contained in immunization profile, what will be the element name, for example immunization.consent. (I couldn't find an example in IG documentation and also in IG sample..) Also what should be the value in 'Type' column, since it's another resource will it be something like this Contained(Consent)?? am I missing something?</p>",
        "id": 179080000,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1572030705
    },
    {
        "content": "<p>In the referencing element, populate the 'aggregation' property with 'contained.</p>",
        "id": 179085021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572034436
    },
    {
        "content": "<p>Type would be Reference(Consent)</p>",
        "id": 179085079,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572034452
    },
    {
        "content": "<p>How do I reflect contained aggregation property? I have attached the snapshot as well. My apologies if it's too basic, but I am hearing this aggregation property for the first time.. <a href=\"/user_uploads/10155/QSqi3FHkq0b-YD1BLPXyr9-C/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/QSqi3FHkq0b-YD1BLPXyr9-C/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/QSqi3FHkq0b-YD1BLPXyr9-C/Capture.PNG\"></a></div>",
        "id": 179087408,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1572036204
    },
    {
        "content": "<p>Ah.  Aggregations in spreadsheet is actually pretty advanced.  Instructions for everything are here: <a href=\"https://wiki.hl7.org/w/index.php?title=FHIR_Spreadsheet_Authoring#Element_Definition_Columns\" target=\"_blank\" title=\"https://wiki.hl7.org/w/index.php?title=FHIR_Spreadsheet_Authoring#Element_Definition_Columns\">https://wiki.hl7.org/w/index.php?title=FHIR_Spreadsheet_Authoring#Element_Definition_Columns</a></p>",
        "id": 179093396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572041440
    },
    {
        "content": "<p>so in this case, it would be <code>Reference(Consent) &lt;contained&gt;</code></p>",
        "id": 179093405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572041457
    },
    {
        "content": "<p>Okay Thanks! and Element will be like 'Consent.Identifier' and not Immunization.Consent.identifier, right?</p>",
        "id": 179095522,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1572043630
    },
    {
        "content": "<p>Right</p>",
        "id": 179095579,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572043695
    },
    {
        "content": "<p>There's still something wrong, it breaks my profile <a href=\"/user_uploads/10155/j9B2zzYBqutoz2VnL-ugbfXG/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/j9B2zzYBqutoz2VnL-ugbfXG/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/j9B2zzYBqutoz2VnL-ugbfXG/Capture.PNG\"></a></div>",
        "id": 179095620,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1572043787
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/cFEV2WO4acYh6x8VvhJmdlz6/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a>  Am I missing something? Problem is publisher doesn't tell me the error message, it doesn't even fail (it just breaks the profile),,</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/cFEV2WO4acYh6x8VvhJmdlz6/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/cFEV2WO4acYh6x8VvhJmdlz6/Capture.PNG\"></a></div>",
        "id": 179095709,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1572043875
    },
    {
        "content": "<p>do you have a working example spreadsheet for the contained resource in a profile?</p>",
        "id": 179096076,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1572044284
    },
    {
        "content": "<p>Why are you defining things that aren't references as a reference?  I'm surprised that your publisher is publishing at all...</p>",
        "id": 179106755,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572060443
    },
    {
        "content": "<p>You're going to have one profile for Immunization and a different profile for Consent</p>",
        "id": 179106759,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572060463
    },
    {
        "content": "<p>The element in your Immunization profile will be of type <code>Reference(Consent) {http://.....yourconsentprofile} &lt;contained&gt;</code>, pointing to your Consent profile</p>",
        "id": 179106805,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572060513
    },
    {
        "content": "<p>One profile can only ever contain elements from a single resource.</p>",
        "id": 179106808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572060528
    },
    {
        "content": "<p>the reason I was thinking the resource (Consent) will be contained and will be in the same profile (Immunization) is because immunization profile doesn't have any element which will be referencing to Consent and there is no enough information about consent.. That makes sense there will be 2 profiles, however It's still confusing for me which element in immunization profile will be referencing to Consent profile ('Element' column)?</p>",
        "id": 179251841,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1572282092
    },
    {
        "content": "<p>Every resource needs its own profile.  You can't have a contained resource unless the containing resource points to the contained resource or vice versa.  And if you want to enforce a profile on the contained resource, the container needs to point to contained</p>",
        "id": 179252572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572282548
    },
    {
        "content": "<p>Hello, I have question about slicing. I would like to have two slices in meta.profile. In the first slice  I have fixed value for profile, and for the second slice I would like to be \"open\". I mean no fixed values or no bindings etc. Is this possible to do?</p>",
        "id": 179603466,
        "sender_full_name": "Aleksi Aho",
        "timestamp": 1572590092
    },
    {
        "content": "<p>What you actually want <span class=\"user-mention\" data-user-id=\"222926\">@Aleksi Aho</span> is to have \"open\" slicing (which is the default) and declare a single slice with a fixed value.  You can then declare a 'default' slice that applies to everything else, or you can have no additional slices, in which case the rules for all other profile repetitions are just the rules you've set for the element as a whole</p>",
        "id": 179623287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572613114
    },
    {
        "content": "<p>Okay. How should I use discriminator, or what should be  discriminator? I keep getting message that my element match more than one slice when I'm trying to save resource against the profile.</p>",
        "id": 179850264,
        "sender_full_name": "Aleksi Aho",
        "timestamp": 1572885826
    },
    {
        "content": "<p>$this, I believe</p>",
        "id": 179850654,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572886033
    },
    {
        "content": "<p>HI <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am doing slicing on Provenance.agent to indicate who are the author, custodian, etc.. For some reason it's not liking my slices and profile not showing up. Can you please have a look and let me know if you see any error. Pattern column has these values:<br>\n{\"coding\":[{\"system\":\"<a href=\"http://terminology.hl7.org/CodeSystem/provenance-participant-type\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/provenance-participant-type\">http://terminology.hl7.org/CodeSystem/provenance-participant-type</a>\", \"code\":\"author\"}]} <br>\n{\"coding\":[{\"system\": \"<a href=\"http://terminology.hl7.org/CodeSystem/provenance-participant-type\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/provenance-participant-type\">http://terminology.hl7.org/CodeSystem/provenance-participant-type</a>\", \"code\": \"informant\"}]}<br>\n<a href=\"/user_uploads/10155/NEMQaSX_JpfwCeU5VNUH-cxc/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/NEMQaSX_JpfwCeU5VNUH-cxc/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/NEMQaSX_JpfwCeU5VNUH-cxc/Capture.PNG\"></a></div>",
        "id": 180551747,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573586861
    },
    {
        "content": "<p>Nothing looks obviously wrong.  What error messages are you getting?</p>",
        "id": 180553639,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573587918
    },
    {
        "content": "<p>it doesn't state any explicit error, it just doesn't show anything.<br>\n<a href=\"/user_uploads/10155/lHmBSp0ZppCLzntR8i4w5rMW/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a> <br>\nIt's so weird when i remove the slice, it displays fine...</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/lHmBSp0ZppCLzntR8i4w5rMW/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/lHmBSp0ZppCLzntR8i4w5rMW/Capture.PNG\"></a></div>",
        "id": 180555309,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573589003
    },
    {
        "content": "<p>Are you checking the validation.html?  Anything in the console log during the build process?</p>",
        "id": 180561563,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573592609
    },
    {
        "content": "<p>Yes, checked I don't see anything, except I see one message related to this profile (which I am  unsure of.. java code not generated for this profile) It appears even if I dont' have slicing in the profile, so I am not sure if it's related..<br>\n<a href=\"/user_uploads/10155/FFKnBCH_2iDfeKz4bw1QtutZ/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a><br>\n It's weird coz I have added slices the same way in other profiles and they render fine. Will you be able to look at the  spreadsheet?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/FFKnBCH_2iDfeKz4bw1QtutZ/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/FFKnBCH_2iDfeKz4bw1QtutZ/Capture.PNG\"></a></div>",
        "id": 180565561,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573595137
    },
    {
        "content": "<p>And qa.html is clean?</p>",
        "id": 180570056,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573598424
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  is there any version update I have to do on my end, I am getting version error while publishing:<br>\n<a href=\"/user_uploads/10155/7yrFBxClVjRNRW41-V21xMBJ/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/7yrFBxClVjRNRW41-V21xMBJ/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/7yrFBxClVjRNRW41-V21xMBJ/Capture.PNG\"></a></div>",
        "id": 180682491,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573685732
    },
    {
        "content": "<p>Also I have deleted the slicing profile to make sure that's not causing any problem..</p>",
        "id": 180682715,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573685907
    },
    {
        "content": "<p>That sounds like you're not using the latest &amp; greatest IG publisher.  You need one from the last 1.5 weeks - and in practice you want the one that was published today.</p>",
        "id": 180682763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573685961
    },
    {
        "content": "<p>Thanks that resolves it!</p>",
        "id": 180684368,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573687367
    },
    {
        "content": "<p>For the slicing issue I mentioned before, I see this error in StructureDefinition-prov-profile-validation.html file:<br>\n{% raw %}&lt;table class=\"grid\"&gt;<br>\n&lt;tr&gt;&lt;td&gt;&lt;b&gt;Level&lt;/b&gt;&lt;/td&gt;&lt;td&gt;&lt;b&gt;Type&lt;/b&gt;&lt;/td&gt;&lt;td&gt;&lt;b&gt;Location&lt;/b&gt;&lt;/td&gt;&lt;td&gt;&lt;b&gt;Message&lt;/b&gt;&lt;/td&gt;&lt;/tr&gt;<br>\n&lt;tr&gt;&lt;td&gt;error&lt;/td&gt;&lt;td&gt;invariant&lt;/td&gt;&lt;td&gt;StructureDefinition/prov-profile: StructureDefinition.differential&lt;/td&gt;&lt;td&gt;sdf-8a: In any differential, all the elements must start with the StructureDefinition's specified type for non-logical models, or with the same type name for logical models [((%resource.kind = 'logical') or element.first().path.startsWith(%resource.type)) and (element.tail().empty() or element.tail().all(path.startsWith(%resource.differential.element.first().path.replaceMatches('\\\\..*', '') &amp; '.')))]&lt;/td&gt;&lt;td&gt;&lt;/td&gt;&lt;/tr&gt;<br>\n&lt;tr&gt;&lt;td&gt;warning&lt;/td&gt;&lt;td&gt;invariant&lt;/td&gt;&lt;td&gt;StructureDefinition/prov-profile: StructureDefinition&lt;/td&gt;&lt;td&gt;sdf-0: Name should be usable as an identifier for the module by machine processing applications such as code generation [name.matches('<a href=\"http://[A-Za-z0-9_]\" target=\"_blank\" title=\"http://[A-Za-z0-9_]\">A-Z</a>{0,254}')]&lt;/td&gt;&lt;td&gt;&lt;/td&gt;&lt;/tr&gt;<br>\n&lt;/table&gt;<br>\n{% endraw %}</p>",
        "id": 180779124,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573768310
    },
    {
        "content": "<p>hmm so confused, it seems to give an error now in IG Publisher:<br>\n<a href=\"/user_uploads/10155/oTZPVSp5_PCEjKhbg2TJUJh5/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/oTZPVSp5_PCEjKhbg2TJUJh5/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/oTZPVSp5_PCEjKhbg2TJUJh5/Capture.PNG\"></a></div>",
        "id": 180786767,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573773503
    },
    {
        "content": "<p>any idea what's this related to <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 180786825,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573773582
    },
    {
        "content": "<p>As an example, if you're creating a profile on Observation, every element in your profile must start with \"Observation.\" (unless it's the root element, in which case it can be just \"Observation\".)</p>",
        "id": 180786940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573773673
    },
    {
        "content": "<p>uhhh found the root cause - spelling error Provence. Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> :)</p>",
        "id": 180787287,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1573774014
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  we need to have different addresses in our patient profile (for example - home, work, temp, old, etc - which is basically denoted by address.use element). Will this has to be achieved through slicing or is it possible to not slice address and just repeat the address multiple times (I am just trying to understand the slicing concept)..</p>",
        "id": 183313259,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1576192577
    },
    {
        "content": "<p>In the instance, you just repeat the address multiple times declaring the desired type for each repetition.  If you're trying to define what's <em>allowed</em> and you have different requirements for each type (e.g. must be one work, old addresses must specify end date, etc.) then slicing allows you to define different expectations for addresses with different types.  If you don't have different rules, just leave address as 0..* and allow all the types and let implementers send what they have.</p>",
        "id": 183313647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576192969
    },
    {
        "content": "<p>Thanks for the clarification!</p>",
        "id": 183315010,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1576194421
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  can a slice be marked as 'must-support'?</p>",
        "id": 183806747,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1576717368
    },
    {
        "content": "<p>Yes.<br>\nWe do it in <a href=\"https://github.com/AuDigitalHealth/ci-fhir-stu3/blob/master/output/SharedMedicinesList/StructureDefinition-composition-sml-prac-1.xml\" target=\"_blank\" title=\"https://github.com/AuDigitalHealth/ci-fhir-stu3/blob/master/output/SharedMedicinesList/StructureDefinition-composition-sml-prac-1.xml\">https://github.com/AuDigitalHealth/ci-fhir-stu3/blob/master/output/SharedMedicinesList/StructureDefinition-composition-sml-prac-1.xml</a> from <a href=\"https://github.com/AuDigitalHealth/ci-fhir-stu3/tree/master/output/SharedMedicinesList\" target=\"_blank\" title=\"https://github.com/AuDigitalHealth/ci-fhir-stu3/tree/master/output/SharedMedicinesList\">https://github.com/AuDigitalHealth/ci-fhir-stu3/tree/master/output/SharedMedicinesList</a></p>",
        "id": 183807573,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1576718521
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 183875785,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1576782959
    },
    {
        "content": "<p>Hi,<br>\nI am new to FHIR and having difficulty in understanding slicing.<br>\nWhat is difference between Slicing and applying constraints.<br>\nBasically its same thing.<br>\nIs my understanding correct?<br>\nThanks</p>",
        "id": 185102355,
        "sender_full_name": "Liam",
        "timestamp": 1578484455
    },
    {
        "content": "<p>slicing is important where in a Resource there is an element which is a list of various kinds of data. slicing allows you in one profile (StructureDefinition) to indicate that you are requiring a variety of things. Such as, in this Resource blah element you must specify atleast ONE of these, and up-to-TWO of these, and none of these. where these are all variations of list elements.   among other functionality...<br>\nslicing is powerful, but hard to grasp initially.</p>",
        "id": 185125090,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578498347
    },
    {
        "content": "<p>Slicing is a type of constraint, but it's a constraint where different rules apply to different repetitions - typically based on some difference between the repetitions.  So, for example, if you slice <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a> by use, you could have one set of constraints on names with a use of 'official' and a different set of constraints on names with a use of 'usual'.  It might be possible to express all of your slicing rules using the 'constraint' mechanism, but some of them would get incredibly complex and very hard to read/understand.  Once you know what slicing is, reading slicing in a resource table is pretty straight-forward.</p>",
        "id": 185128577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578500127
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  we have 3 different source systems with specific business requirements and constraints on current (home), mailing and old address. We are trying to have these 3 slices, but wondering how to slice it and on which address element (either its Address.use or Address.type?)  slicing needs to be done.<br>\nCurrent address  Address.use &gt;home<br>\nOld address  Address.use &gt;old<br>\nMailing address  use may not be appropriate here, since use can be home, work, temp, etc</p>",
        "id": 185142812,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1578508746
    },
    {
        "content": "<p>Sounds like you may need to slice by both.  Are home and old both expected to be physical addresses?</p>",
        "id": 185145904,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578510577
    },
    {
        "content": "<p>Is it possible to slice by use and type? Home is expected to be physical address whereas old may be  physical or not..</p>",
        "id": 185146205,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1578510735
    },
    {
        "content": "<p>Yes, you can have multiple discriminators when you slice.</p>",
        "id": 185149282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578512621
    },
    {
        "content": "<p>If old can be mailing, does that take precedence over mailing?</p>",
        "id": 185149330,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578512642
    },
    {
        "content": "<p>If old can be mailing, does that take precedence over mailing? Nope (For 'old' slice there is a possibility that  source systems might not indicate if address is postal or physical, they just sit in Address history).</p>\n<p>When you say multiple discriminators, will it be something like sub-slicing or Re-slicing?</p>",
        "id": 185156639,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1578517540
    },
    {
        "content": "<p>No.  re-slicing is when a derived profile slices something that was already sliced.  Multiple discriminators just means that when you declare slicing on the root element, you list multiple discriminators rather than just one.</p>",
        "id": 185167551,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578524776
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <br>\nOne more thing by seeing actual FHIR Resource (Data not the structure definition) is there any option to know whether slicing has been done or not ?</p>",
        "id": 185182717,
        "sender_full_name": "Liam",
        "timestamp": 1578544157
    },
    {
        "content": "<p>In a resource instance, there's no such thing a slicing.  Slicing is about the rules, not the content.  I might have rules that say \"There must be one home phone number and no more than 5 addresses\", and use slicing to define those rules.  But in the instance, I'll just have a Patient with a certain number of telecom instances - and that Patient will either comply with the rules or not.</p>",
        "id": 185183067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578544840
    },
    {
        "content": "<p>Hi,<br>\nSuppose the extension of Observation is sliced to add two more elements(One with URL and ValueReference and other with URL and ValueString).<br>\nThe mapping is one to many.<br>\nMy question is even after extension is sliced can we add more elements in the extension other than tha above two?</p>\n<p>Thanks</p>",
        "id": 185293778,
        "sender_full_name": "PS",
        "timestamp": 1578648342
    },
    {
        "content": "<p>You're not really adding more elements.  The 'extension' element is already there.  In your profile, you're using slicing to set expectations around the cardinality or other constraints of extension repetitions that happen to have particular URLs.  So long as the slicing was 'open', subsequent profiles are free to define additional slices.  (And in general, slicing should generally be 'open')</p>",
        "id": 185321799,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578671441
    },
    {
        "content": "<p>In the profile, Yes we can add if it is 'open' . But while adding in the data it shouldn't be allowed right ?</p>",
        "id": 185464760,
        "sender_full_name": "PS",
        "timestamp": 1578890820
    },
    {
        "content": "<p>I'm not understanding the question</p>",
        "id": 185465311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578891899
    },
    {
        "content": "<blockquote>\n<p>Hi,<br>\nSuppose the extension of Observation is sliced to add two more elements(One with URL and ValueReference and other with URL and ValueString).<br>\nThe mapping is one to many.<br>\nMy question is even after extension is sliced can we add more elements in the extension other than the above two?</p>\n<p>Thanks</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nI asked this question with reference to the actual FHIR JSON(not the profile).<br>\nIt might sound silly but wanted to clarify.</p>",
        "id": 185465430,
        "sender_full_name": "PS",
        "timestamp": 1578892193
    },
    {
        "content": "<p>If slicing of an element is 'open', then any derived profile is free to add additional slices.</p>",
        "id": 185471400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578901940
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> If I am slicing address on 2 address elements i.e. use and type, does that mean for all the address slices there is a need to specify value for both - Address.use and Address.type? for example - 'Work' slice Address.use is work however I don't want to specify any specific value for Address.type (since it can be postal or physical or both), is that okay to leave it blank?</p>",
        "id": 185540994,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1578951828
    },
    {
        "content": "<p>Common practice is to specify either a value or a value set for both.  I'm not sure what happens if you leave one of the discriminators unconstrained.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - is that allowed?</p>",
        "id": 185543672,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578953592
    },
    {
        "content": "<p>it's ok to say nothing about one of the discriminators as long as the other values provide distinctness</p>",
        "id": 185544297,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1578954004
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 185545126,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1578954592
    },
    {
        "content": "<p>Hey Lloyd, in the address slice we are trying to bind address.type to physical and both. It's not rendering properly:<br>\nBindings tab:<br>\n<a href=\"/user_uploads/10155/k4aCYqoVQWYzja81g_hzz4tX/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\">Capture.PNG</a><br>\nphysical-both is the tab name in spreadsheet, where I am specifying the value-sets<br>\n<a href=\"/user_uploads/10155/rqHTaHGv9IXS5ezm_Vp_L5of/Capture1.PNG\" target=\"_blank\" title=\"Capture1.PNG\">Capture1.PNG</a> <br>\nAm I missing something?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/k4aCYqoVQWYzja81g_hzz4tX/Capture.PNG\" target=\"_blank\" title=\"Capture.PNG\"><img src=\"/user_uploads/10155/k4aCYqoVQWYzja81g_hzz4tX/Capture.PNG\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/rqHTaHGv9IXS5ezm_Vp_L5of/Capture1.PNG\" target=\"_blank\" title=\"Capture1.PNG\"><img src=\"/user_uploads/10155/rqHTaHGv9IXS5ezm_Vp_L5of/Capture1.PNG\"></a></div>",
        "id": 185632828,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1579031302
    },
    {
        "content": "<p>Code lists in the spreadsheet are probably not well supported right now and are eventually likely to be deprecated.  You really should be authoring a proper ValueSet instance and CodeSystem instance.</p>",
        "id": 185642333,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579037288
    },
    {
        "content": "<p>I was dealing with one of the Observation Structure Definition in which I came across below thing :<br>\n \"id\" : \"Observation.extension\",<br>\n        \"path\" : \"Observation.extension\",<br>\n        \"slicing\" : {<br>\n          \"discriminator\" : [<br>\n            {<br>\n              \"type\" : \"value\",<br>\n              \"path\" : \"url\"<br>\n            }<br>\n          ]</p>\n<p>Can someone help me out on what does here \"type\" and \"url\" means.</p>\n<p>Thanks</p>",
        "id": 185785254,
        "sender_full_name": "PS",
        "timestamp": 1579149489
    },
    {
        "content": "<p>It means that extension is being sliced by the value of the URL element.  I.e. you know what the rules for the extension are because each extension has a fixed URL value.</p>",
        "id": 185785427,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579149759
    },
    {
        "content": "<p>Hi,</p>\n<p>I do slicing by type.coding.system(Value). Is this different to slicing by type.coding.code(Value) and then slice again  type.coding by system(Value)?</p>",
        "id": 198060361,
        "sender_full_name": "Katarina",
        "timestamp": 1589892778
    },
    {
        "content": "<p>Normally if slicing by code, you'll have to use both system and value as a discriminator.  However, it's easier (and slightly better) to slice with a discriminator with type 'pattern' and a path of type.coding or even a path of type.</p>",
        "id": 198082754,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589901921
    },
    {
        "content": "<p>For an example take Organization.type(STU3), which has example binding to HL7 valueset and i want to use my custom value set instead, so I has sliced Organization.type based on the value of coding.system and bind my custom value set to one of the slice. In this case, Is the constraints (Custom value set) defined for a slice overrule the constraints defined on sliced element(HL7 value Set)?or has higher precedence?</p>",
        "id": 205808280,
        "sender_full_name": "Kailash",
        "timestamp": 1596468596
    },
    {
        "content": "<p>If it's an example binding, it's simplest to just declare your own binding and override the example one.  (You can do that for either example or preferred bindings.)  For required or extensible bindings, you can also override, but the newly bound value set must comply with the base binding)</p>",
        "id": 205837289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596483077
    },
    {
        "content": "<p>Thanks, but question is about precedence, what if there is conflict between constraints on sliced element and slice ? <br>\ntake same example, i want to use two diff value sets, one on Organization.type(sliced element) and another on Organization.type:slicename(slice). Does this mean that the value set bind with Organization.type will be applicable to none slice repetitions(if open at end) and binding to slice will be applicable to slice repetition only? and in this case slice constraints(binding) will ignore sliced element constraints(binding).</p>",
        "id": 205866998,
        "sender_full_name": "Kailash",
        "timestamp": 1596507579
    },
    {
        "content": "<p>You can't slice Organization.type - you can only slice Organization.type.coding.  The binding on type says \"one of these codings must/should/may adhere to this value set\" (depending on the strength of the binding.  Bindings on your slices just make assertions about additional codings.</p>",
        "id": 205869443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596510513
    },
    {
        "content": "<p>If you define mandatory slices and also have a required or extensible binding on the overall CodeableConcept, the instance must have Codings that match <em>all</em> of the requirements.</p>",
        "id": 205869460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596510553
    },
    {
        "content": "<p>means, every repeat(whether it is part of slice or not) should confirmed base element(element which is sliced) constraints.</p>",
        "id": 205878179,
        "sender_full_name": "Kailash",
        "timestamp": 1596524154
    },
    {
        "content": "<p>I don't understand that sentence.  The binding on a CodeableConcept says that <em>one</em> Coding needs to meet the binding.  And defining slices generally also means that <em>one</em> Coding needs to meet the slice binding.</p>",
        "id": 205923076,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596555545
    },
    {
        "content": "<p>I am trying to slice an element based on its value.  I am unable to find any examples how to do slicing in Java.  Does anyone did slicing using java FHIR API?  Thanks in advance.</p>",
        "id": 213909805,
        "sender_full_name": "sandhya kodimala",
        "timestamp": 1603196255
    },
    {
        "content": "<p>If this is a question about the HAPI FHIR server, you may get a quicker answer on the <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a> channel...</p>",
        "id": 213929216,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1603204941
    },
    {
        "content": "<p>I'm struggling with some slicing issues in a profile but before I create too much noise here I'd like confirm one aspect first.  I'm also reading through few threads here before asking for more help but a yes/no answer to the following will probably resolve some issues. I'm also assuming it's okay to add my question to this thread. I'll move this to a new thread if that helps.</p>\n<p>Let's say I'm slicing Observation.component, can I have two slicings on it in the same profile?</p>\n<p>The first slicing's discriminator is code.coding.system AND code.coding.code.  Two slices. First max 1 and the other max *.  The valueCodableConcept is bound in these slices to a ValueSet</p>\n<p>The second slicing's discriminator is also code.coding.system AND code.coding.code with max 2 but it adds a third type discriminator  for  value[x] being CodableConcept in one slice and Quantity in another. In this slicing, the code.coding.system AND code.coding.code have the same fixed values in the two slices but the difference is the types in the two slices.</p>\n<p>This is still WIP but if you'd rather see what I'm trying to do, you can take a look at these GitHub links although parts of it are still incomplete and/or commented out:</p>\n<p><a href=\"https://github.com/phenopackets/core-ig/blob/b4b5fdd1bacb660205442f17d76d6f03bb5b2958/ig-root/input/resources/StructureDefinition-observation-phenotypic-abnormality.xml\">https://github.com/phenopackets/core-ig/blob/b4b5fdd1bacb660205442f17d76d6f03bb5b2958/ig-root/input/resources/StructureDefinition-observation-phenotypic-abnormality.xml</a></p>\n<p>and the WIP PR is here (feel free to comment on the PR or code lines):</p>\n<p><a href=\"https://github.com/phenopackets/core-ig/pull/9\">https://github.com/phenopackets/core-ig/pull/9</a></p>\n<p>Thanks!</p>",
        "id": 216380498,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605118795
    },
    {
        "content": "<p>A single element in FHIR can only have one set of discriminators defined and all slices must be distinct based on that one set of discriminators</p>",
        "id": 216380782,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605118936
    },
    {
        "content": "<p>I'm assuming this is per profile. Correct? In other words, a child profile can override the slicing in that case?  If that's how it works, is all slicing info from the base profile erased?</p>",
        "id": 216381015,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605119061
    },
    {
        "content": "<p>Per path within a profile.  If you have a repeating element that is itself sliced, you could have different discriminators on a sub-element within each parent slice.  E.g. if you sliced Observation.component, you could have different discriminator sets on Observation.component.code.coding within each component slice.</p>",
        "id": 216381210,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605119165
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thanks for the tips! I'm still digesting all this and will probably have few follow up questions later.</p>",
        "id": 216381290,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605119226
    },
    {
        "content": "<p>That's what the chat is here for :)</p>",
        "id": 216381329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605119261
    },
    {
        "content": "<p>Does this also mean that each slice needs to address all the paths in the set of discriminator paths?  If not, what happens with the other discriminator paths if a slice doesn't need them to be unique?</p>",
        "id": 216381718,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605119494
    },
    {
        "content": "<p>One more question and then I'll do my homework before asking again :)</p>\n<p>If a path in a discriminator needs to be used both by value or by type in the different slices, does this mean that there should be two entries for that path in the slicing discriminators, once by value and once by type, or is that sort of discrimination not possible?</p>",
        "id": 216382675,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605119960
    },
    {
        "content": "<p>It's fine if not all of the discriminators have a value.  What matters is that all slices are unique based on the discriminators</p>",
        "id": 216383311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605120275
    },
    {
        "content": "<p>I'm getting a slicing error (attempting to slice an element that does not repeat) on the following code snippet .  What am I missing?  I've used the same slicing for similar elements in other profiles and it works.<br>\n        &lt;element id=\"Observation:HeartRate.device\"&gt;<br>\n            &lt;path value=\"Observation.device\"/&gt;<br>\n            &lt;slicing id=\"1\"&gt;<br>\n                &lt;discriminator&gt;<br>\n                                   &lt;type value=\"profile\"/&gt;<br>\n                                   &lt;path value=\"device.reference.resolve\"/&gt;<br>\n                               &lt;/discriminator&gt;<br>\n                               &lt;ordered value=\"false\"/&gt;<br>\n                               &lt;rules value=\"open\"/&gt;<br>\n                        &lt;/slicing&gt;<br>\n            &lt;min value=\"0\"/&gt;<br>\n            &lt;max value=\"*\"/&gt;<br>\n            &lt;mustSupport value=\"true\"/&gt;<br>\n        &lt;/element&gt;<br>\n        &lt;element id=\"Observation:HeartRate.device:genDevice\"&gt;<br>\n            &lt;path value=\"Observation.device\"/&gt;<br>\n            &lt;sliceName value=\"Device\"/&gt;<br>\n            &lt;type&gt;<br>\n                &lt;code value=\"Reference\"/&gt;<br>\n                &lt;targetProfile value=\"http://hl7.org/fhir/StructureDefinition/Device\"/&gt;<br>\n            &lt;/type&gt;<br>\n            &lt;mustSupport value=\"true\"/&gt;<br>\n        &lt;/element&gt;<br>\n        &lt;element id=\"Observation:HeartRate.device:BPDevice\"&gt;<br>\n            &lt;path value=\"Observation.device\"/&gt;<br>\n            &lt;sliceName value=\"BPDevice\"/&gt;<br>\n            &lt;type&gt;<br>\n                &lt;code value=\"Reference\"/&gt;<br>\n                &lt;targetProfile value=\"http://hl7.org/fhir/us/vitals/StructureDefinition/BPDevice\"/&gt;<br>\n            &lt;/type&gt;<br>\n            &lt;mustSupport value=\"true\"/&gt;<br>\n        &lt;/element&gt;</p>",
        "id": 217295713,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1605803818
    },
    {
        "content": "<p>Observation.device does not repeat and is not polymorphic (doesn't have multiple data types).  Because of that, slicing is not supported.  (We've talked about introducing it, but that adds a lot of complexity to the validator, which is already extremely complex, so it's not something we'll undertake lightly or soon.</p>",
        "id": 217296030,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605803948
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thank you.</p>",
        "id": 217296870,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1605804306
    },
    {
        "content": "<p>Hi! I have done a slice on Provenance.reason and I need some advise:<br>\nThe case is as follows: <br>\nWe want to use two different ValueSets in Provenance.reason (Provenance.reason is a CodableConcept). </p>\n<p>One ValueSet contains \"reasons for nullification\" and should be used if the Provenance.activity is some variant of \"nullification\" of the resource the Provenance is targeting . The other ValueSet contains \"reasons for change\" should be used if the Provenance.activity is a revision of the targeting resource.<br>\nOne of the ValueSets contain codes from more than one CodeSystem.<br>\nTo be able to provide different ValueSets for for different scenarios I need to do a slice, right? (Or is there some other pattern?)<br>\nNow to may main concern:<br>\nWhat should I do with the \"discriminator\" for the slice? Do you think that we should provide a discriminator for a scenario like the one described above? <br>\nIf we should provide a discriminator, what should it be? One idea is to use  the coding.system attribute, but what should I enter here in that case? The ValueSet URI? Then, aren't we misusing the \"coding.system\"? Any other suggestions?<br>\nThanks!</p>",
        "id": 222057222,
        "sender_full_name": "Emmeli Gross",
        "timestamp": 1610101993
    },
    {
        "content": "<p>Slices allow for multiple simultaneous sets of constraints - for different repetitions.  If you want to define different rules for an element for a different circumstance, you either need to define distinct profiles (one profile per condition) or define an invariant that makes the assertion of the value set binding contingent on the value of another element.</p>",
        "id": 222077724,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610115990
    }
]