[
    {
        "content": "<p>I need to say \"must use the core 5 race code and you can also have as many additional race codes as you want as translations all from the same code system.    So I am assuming I need to slice the us-core-race extension by 2 differene valuesets that are all derived from the same code system.   for this I'll need to use the value set reference extension on coding as  a discriminator.     Does that sound correct?   </p>",
        "id": 153840178,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469078270
    },
    {
        "content": "<p>no</p>",
        "id": 153840179,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469078297
    },
    {
        "content": "<p>good cause that sounded like a lot of work</p>",
        "id": 153840180,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469078321
    },
    {
        "content": "<p>how do I slice it?</p>",
        "id": 153840181,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469078355
    },
    {
        "content": "<p>well, the question is what you want to achieve here</p>",
        "id": 153840184,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469078475
    },
    {
        "content": "<p>are you saying that you can't have translations from other code systems? </p>",
        "id": 153840185,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469078489
    },
    {
        "content": "<p>got 900+ race code all from the same code system ,  5 of which need to report,  the other 895 you may use  </p>",
        "id": 153840186,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469078545
    },
    {
        "content": "<p>so first slice required  for reporting one of the 5 codes,  second slice is optionally for one ot the others</p>",
        "id": 153840187,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469078592
    },
    {
        "content": "<p>I have a pair of valuesets   for each slice</p>",
        "id": 153840189,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469078661
    },
    {
        "content": "<p>I think that's a yes</p>",
        "id": 153840190,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469078678
    },
    {
        "content": "<p>yes to my original question?</p>",
        "id": 153840191,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469078698
    },
    {
        "content": "<p>yes \"you can't have translations from other code systems\"</p>",
        "id": 153840192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469078717
    },
    {
        "content": "<p>but I don't think that should be a yes </p>",
        "id": 153840193,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469078752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"eric@montagesystems.com.au\">@Eric Browne</span> : Why not have 2 codeable concepts within the race extension<br>\none to report the 5 race codes with the right value set , a second one where they can record as many as they want....using the 0..* coding from the 895+ race codes </p>",
        "id": 153840194,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1469078790
    },
    {
        "content": "<p>meant <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> </p>",
        "id": 153840195,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1469078802
    },
    {
        "content": "<p>Is slicing really required for this ? </p>",
        "id": 153840196,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1469078859
    },
    {
        "content": "<p>I'm not sure what rules you're being driven by, but if it was me, this would be a required binding to the 5 codes, and a text note saying that you have translations from the same code system for greater granularity. </p>",
        "id": 153840197,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469078966
    },
    {
        "content": "<p>I'm not clear what you are saying  - these codes are all from the same code system?    the system is heirarchical the other codes all roll up into one of the 5.      the translations would be more granular.  </p>",
        "id": 153840198,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469078989
    },
    {
        "content": "<p>or if the answer to my question is yes, just fix the code system as well</p>",
        "id": 153840199,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469078992
    },
    {
        "content": "<p>What is the discrimonator?</p>",
        "id": 153840200,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469079009
    },
    {
        "content": "<p>What is the discriminator?</p>",
        "id": 153840201,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469079031
    },
    {
        "content": "<p>don't slce it. just a single CodeableConcept</p>",
        "id": 153840202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469079092
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  If you use a single codeableconcept - will you bind the element to the value set containing 5 codes or the value set containing the 895+ codes (excluding the 5 aggregate codes) or a valueset with all codes included ? </p>",
        "id": 153840205,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1469079264
    },
    {
        "content": "<p>Dragon may have something.   Does the freeze apply to us race extensions?  (i'll post on comitters)</p>",
        "id": 153840206,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469079273
    },
    {
        "content": "<p>For reporting purposes - the 5 aggregate codes are used , for other purposes having more granularity is desirable, so systems may capture only the detailed one and roll it up or may capture only the aggregate or both (multiple)<br>\n based on their workflows and UI preferences </p>",
        "id": 153840207,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1469079390
    },
    {
        "content": "<p>You have a fixed binding to the 5 codes.  As a CodeableConcept, implementers are always free to send as many translations as they like - from any code system, including the one the 5 codes are from.  So you don't need to do anything more than that.  For greater clarity though, you can add a descriptive note reminding them that they're free to include translations drawing from the same code system that provide greater granularity.</p>",
        "id": 153840216,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469080571
    },
    {
        "content": "<p>@<strong>ericHass</strong> - See I can’t edit in a proper @-mention <br>\nWhile I assume Lloyd is correct (always!) I'm also confused as to why this would not be solved by using two codeableConcepts in the Race Extension wherein one is bound to a value set with only the 5 blessed codes and the other is bound to a value set with all the codes (you might want to make that value set less the blessed 5). You can use terminology service to detemine which granular code rolled up to the blessed 5. This approach is actually doirectly consistent with how C-CDA is doing it and is the way most consistent with the US race coding expectation as defined in the ONC ISA. It is important to note that in the USA you can have multiple race codes but must report one blessed 5 so the approach I've noted makes that easy.</p>\n<p>That said, if you want to pack everything into one CodeableConcept then I don't see an advantage to this and you have a MAJOR disadvantage in that you can not properly capture multiple different race codes because use of the translation demands that the translation be another concept meant to represent the main concept provided so you would not be able to use that to communicate multiple different races.</p>",
        "id": 153846139,
        "sender_full_name": "Robert McClure",
        "timestamp": 1472762338
    },
    {
        "content": "<p>could you have translations on those 2 CodeableConcepts? what would they be? </p>",
        "id": 153846150,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472765209
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> Yes could have sliced it by valueset.  But, instead we chose to have all this crazinesslive in the extension as a complex extension.   So you have a single extension element in patient that defines it all -  two codings, two valuesets.  no translations.  kind of a deconstructed codeable concept.   Will map 1 to 1 to ccda.</p>",
        "id": 153846153,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472765392
    }
]