[
    {
        "content": "<p>Hopefully a quick question. For an element where multiple codes are allowed (for example Condition.bodySite), and we allow multiple codes from the same system (SNOMED in our case) as well as codes from other (undefined) codeSystems, would the following discriminator pattern make sense?<br>\nbodySite [0..*]<br>\nSlicing: Discriminator: <strong>system</strong>, Ordering:<strong> false</strong>, Rules:<strong>Open</strong><br>\nSlice (SNOMED) [0..*] <br>\n  system=Fixed Value: <a href=\"http://snomed.info/sct\" target=\"_blank\" title=\"http://snomed.info/sct\">http://snomed.info/sct</a><br>\n  code<br>\n  display</p>\n<p>So we can have multiple SNOMED codes that conform to the SNOMED slice, as well as allowing multiple other codes. Would this pattern allow 2 LOINC codes, or would that fall foul of the Discriminator rule in this example?</p>",
        "id": 154017592,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1542022690
    },
    {
        "content": "<p>Multiple LOINC codes would be fine there.  Though unless you had some other constraints on the SNOMED slice there (MustSupport or minOccurs=1 or something), you're not actually setting any constraints beyond what are present in the base resource.</p>\n<p>Something else you can do is slice by value for \"coding\" and declare a value set binding on the coding.  That would allow you to assert multiple SNOMED value sets.  So long as the value sets don't have overlapping codes, you could require a code from each and say something more useful than \"any SNOMED CT code\".</p>",
        "id": 154017601,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542025372
    },
    {
        "content": "<p>We do have an extra extension on SNOMED slices around SNOMED description ID, so we need to draw out the SNOMED slice to display the extension. Also, we do normally bind off to a SNOMED refset - in this case  (&lt;&lt;442083009 |anatomical or acquired body structure|). I appreciate your point about having the discriminator on code (or system &amp; code) to allow for multiple SNOMED slices.</p>",
        "id": 154017605,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1542025826
    },
    {
        "content": "<p>Discriminator on code would mean you'd need to enumerate slices for each code fixed value.  That's fine if you're looking for a magic code to make decisions based on, but not so good if you want to allow a code and any specializations of it.  For that, specifying a value set is better and that needs to be done at the Coding level.</p>",
        "id": 154017607,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542026108
    }
]