[
    {
        "content": "<p>Our requirement is this:<br>\nA patient can have many Contacts, each Contact can have one or several Relationship. In Sweden we have a national valueSet of relationship types which are all Snomed CT codes. </p>\n<p><strong>Question</strong><br>\nHow do we slice relationship.coding so that:<br>\n- One slice is always a snomed code from the national value set<br>\n-The rest of the codes can be from any code system, including Snomed ct (could be a more specific Snomed code than from the national valueSet, or it could even be the same Snomed code that is contained in the national value set)</p>\n<p>We have only done slicing with the discriminator System before, what is the discriminator for this use case?</p>",
        "id": 162608890,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1554458509
    },
    {
        "content": "<p>Isn't that just a Required binding to the national value set ?</p>",
        "id": 162610490,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1554460101
    },
    {
        "content": "<p>Maybe, but how do we then say e.g. that you need 1..1 coding from that value set (that slice)? And that you also can provide any number of additional codes from other code systems?</p>",
        "id": 162612968,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1554462685
    },
    {
        "content": "<p>I think you slice the Coding like normal for the 1..1 coding from your VS (in your case, since you're using a required VS, probably <code>value</code> discriminator on <code>system</code> and <code>code</code> -- and when you define the slice, set card to 1..1 and bind to required VS) -- and then ensure that the slicing rule is <code>open</code> to allow any additional Codings outside of the VS.</p>",
        "id": 162616935,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554466559
    },
    {
        "content": "<p>Thanks, I'll try that out and see what happens!</p>",
        "id": 162622804,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1554470949
    },
    {
        "content": "<p>When you have a required or extensible binding on a CodeableConcept, that implicitly creates a slice saying that one of the codings needs to adhere to that binding.  You only need to mess around with slicing if you need to specify multiple bindings.</p>",
        "id": 162630263,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554476142
    },
    {
        "content": "<p>Ha.  You're right.  I was so focused on the slicing question that I forgot to step back and think about it at the higher level.  If you had <code>0.* Coding</code> <em>outside of the context of a <code>CodeableConcept</code></em> -- then you'd need to slice -- but within a <code>CodeableConcept</code> the required VS is essentially saying \"at least one <code>Coding</code> from here.\"</p>",
        "id": 162635068,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554479491
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> said it, but I didn't process it for some reason (and it sounds like <span class=\"user-mention\" data-user-id=\"197234\">@Martin Grundberg</span> didn't either).  Sorry for leading you astray with a more complicated solution, Martin!</p>",
        "id": 162635181,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554479569
    },
    {
        "content": "<p>Now... if you really want to slice the <code>0..* CodeableConcept</code>, then that's a different issue (and more like what I initially suggested).</p>",
        "id": 162635283,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554479662
    },
    {
        "content": "<p>Easier than I thought then! Thx <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span></p>",
        "id": 162795345,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1554708462
    }
]