[
    {
        "content": "<p>Hi everyone,<br>\nI'm discovering the scheduling concept on FHIR and have a question about the Slot resource.<br>\nIf I understand well, Slots should be created in advance so they can be searched.<br>\nAm I right? <br>\nUsually, when are they created? Some months in advance?<br>\nWhat is the duration used to create them?</p>\n<p>Thanks</p>",
        "id": 275504588,
        "sender_full_name": "Jean-Marie Alexandre",
        "timestamp": 1647434520
    },
    {
        "content": "<p>There isn't really one way to do scheduling.  In fact, when we surveyed folks last year, everyone was doing it differently <a href=\"https://confluence.hl7.org/display/PA/Appointment+Scheduling+-+Industry+Divergence\">Appointment Scheduling - Industry Divergence</a>.</p>\n<p>I personally consider scheduling an unsolved problem in FHIR in terms of having a <em>standard</em> way to do it.  I have a lot of thoughts about that in the industry divergence document above.</p>",
        "id": 275507455,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1647436034
    },
    {
        "content": "<p>There's divergence - but if there's a business rule that states that appointments can be made during e.g. 'the next 12 months' you'll have to somehow facilitate that. Whether you accomplish this by creating a full set of static open slots for the next 12 months, or whether you support this 'dynamically' (i.e. responding with open slots that don't even exist yet, vaporware slots, that are only really instantiated if their status goes to anything other than open) is entirely up to a server. The advantage of 'dynamic' slots is that if someone were to go for an appointment which has a non-standard duration, you could simply instantiate a slot for the requested duration. There are probably other ways of doing this as well.</p>",
        "id": 275509470,
        "sender_full_name": "René Spronk",
        "timestamp": 1647437113
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 275513884,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647439210
    },
    {
        "content": "<p>If you have business requirements to support scheduling <em>via FHIR</em>, then you'd be building a custom solution that you'll need to have your trading partners design to.</p>",
        "id": 275519527,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1647441476
    },
    {
        "content": "<p>Also, once you get into looking at Slots, you've gotten past the hard part of  scheduling already.  The hard part is figuring out which set of slots to look at in the first place (i.e. the \"Resource Identification\" section in the document I linked above).</p>",
        "id": 275519991,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1647441642
    },
    {
        "content": "<p>Thanks a lot for your quick feedbacks.<br>\nBeing kind of free in our implementation will help us move more quickly, and I guess when we'll start interacting with other solutions we'll discover the gap to cross.</p>",
        "id": 275532462,
        "sender_full_name": "Jean-Marie Alexandre",
        "timestamp": 1647446320
    },
    {
        "content": "<p>This divergence is also implicated by the different areas in healthcare normally do scheduling differently, and have different needs of appointments.<br>\nAnd thus the industry is showing those differences...</p>",
        "id": 275618188,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1647504718
    }
]