[
    {
        "content": "<p>First post to this forum...<br>\nHow would I call the FHIR Slot resource to get a list of available appointment times for a given date, slot type and outpatient clinic?  <br>\nThe resource shows slot-type as a search parameter but not as a attribute of the resource.   The search parameters for the resource do not include ServiceType, ServiceCategory, AppointmentType or speciality.</p>\n<p>Thanks<br>\nBrian</p>",
        "id": 153908049,
        "sender_full_name": "Brian Ackland",
        "timestamp": 1505367098
    },
    {
        "content": "<p>The slot-type search parameter is a token pointing to Slot.serviceType. So  you use that to search ServiceParameter.</p>",
        "id": 153908062,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1505370355
    },
    {
        "content": "<p>Sort of, yes.</p>",
        "id": 153908065,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505370906
    },
    {
        "content": "<p>I have posted a tracker to add standard search parameters for specialty and appt-type</p>",
        "id": 153908069,
        "sender_full_name": "Eric Haas",
        "timestamp": 1505372642
    },
    {
        "content": "<p>FYI: You could prepare the search parameter and test it both in HAPI (<a href=\"https://smilecdr.com/blog/20170208_custom_search_parameters\" target=\"_blank\" title=\"https://smilecdr.com/blog/20170208_custom_search_parameters\">https://smilecdr.com/blog/20170208_custom_search_parameters</a>) and Vonk (<a href=\"http://docs.simplifier.net/vonk/features/customsearchparameters.html\" target=\"_blank\" title=\"http://docs.simplifier.net/vonk/features/customsearchparameters.html\">http://docs.simplifier.net/vonk/features/customsearchparameters.html</a>) if you like.</p>",
        "id": 153908128,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1505405155
    },
    {
        "content": "<p>Thanks Yunwei,  I see now the slot-type search parameter will allow a search for a specific serviceType.  It seems odd that serviceType is referred to by slot-type as a search parameter.  I notice it is referred to as service-type in the Appointment Resource and  type in the Schedule resource.  Would it be better to have a consistent search parameter naming across the resources?  Perhaps I am missing something.  </p>\n<p>Thanks Eric.  I think the addition of these parameters would be a good idea.</p>",
        "id": 153908561,
        "sender_full_name": "Brian Ackland",
        "timestamp": 1505427953
    },
    {
        "content": "<p>In the Slot search response how can we return if the slot is reserved for New Patient Vs Existing Patient? My first thought was appointment type but already using it for Visit Types e.g. Teleconference, Telephone Consult or In person etc. For service type, we have the actual service that can be performed during the appointment. Would adding an extention of something like a patient type a good idea?</p>\n<p>A hypothetical example would be: A Slot that is availble for telehealth visit only for New patients who would like to have an X consult.</p>",
        "id": 239587778,
        "sender_full_name": "Umer Dhillon",
        "timestamp": 1621516110
    },
    {
        "content": "<p>I'd expect it to be in Appointment.appointmentType.  My leaning would be that the 'mode' of the visit would be in category.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 239589543,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621516798
    },
    {
        "content": "<p>Note that in some recent analysis for COVID vaccine scheduling, we found that basically every EHR did scheduling (and specifically, slot discovery) completely different.    If your question here was asked in the hopes that the answer you get will let you connect to EHR scheduling systems, you may be disappointed.  See this <a href=\"https://confluence.hl7.org/display/AP/Scheduling+Building+Blocks\">Vendor Capabilities</a> page for a summary of what each vendor supports for slot discovery.</p>",
        "id": 239610542,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1621524264
    },
    {
        "content": "<p>^ Thumbs up for \"that's an excellent summary\" (even if it's a bit of a painful place for us to be right now).</p>",
        "id": 239646280,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621538942
    },
    {
        "content": "<p>Thanks, I will check the capabilities page out and yes, aim is to connect with an EHR scheduling systems :).</p>",
        "id": 239667608,
        "sender_full_name": "Umer Dhillon",
        "timestamp": 1621549092
    }
]