[
    {
        "content": "<p>For a slot that is \"busy\" what is the best way to find the appointment that is using that slot.? Why does the slot not have a reference to appointment?</p>",
        "id": 153831310,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1464885471
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> Generally, things that are created later have the reference back to things that are created earlier. Thus the Appointment, has a reference to the Slot(s) it occupies. <br>\nNow, why there isn't a search parameter on Appointment to find the appointments assoicated with a particular slot is a good question. Looks like a change request to me.</p>",
        "id": 153831316,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1464890463
    },
    {
        "content": "<p>OK I see the logic there but it doesn't make life easy. I guess we'll just add an extension as in our use case the slot will only ever be associated with one appointment. Having to implement another route into finding appointments, especially a non standard one is probably harder in our case.</p>",
        "id": 153831325,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1464896257
    },
    {
        "content": "<p>Maybe log a change request to include the slot reference as a standard search parameter?</p>",
        "id": 153831743,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1465177382
    },
    {
        "content": "<p>Also, a slot may be busy for other reasons than having an appointment in it. And in the case of group sessions, the appointment might have multiple appointments associated (until the group max count is reached)</p>",
        "id": 153831744,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1465177429
    },
    {
        "content": "<p>Is there a guideline for how to show appointment requests through the appointment  resource?  Generally, these are appointments requests that have been triggered by a future order being placed.   It looks like these non-booked appointment requests could fall into the Appointment resource with a status of 'proposed', but if i also had a requested date range, would the 'start' and 'end' be appropriate places to give this information?  I worry because for an appointment in any other status, the start and end represent the appointment's start and end, not a range that could cross days.</p>",
        "id": 153835758,
        "sender_full_name": "Brian Heiting",
        "timestamp": 1467234624
    },
    {
        "content": "<p>The dynamic range request space used in clinical ro negotiation hasn't been explored/covered by the existing resource yet (haven't had people with experience come forward to assist and provide feedback - yet)<br>\nSo as a result this would be extension space.<br>\nWe would really like additional input to change this though (however is a little late for STU3 at this point)</p>",
        "id": 153835768,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1467236943
    }
]