[
    {
        "content": "<p>Slot's scope and usage says “A slot can have more than one appointment allocated to it. A scheduling system may permit multiple allocations up to a specific number of places. An example of this type of usage could be where the slot is being used for a group service that permits 5 participants at the same time”</p>\n<p>However, Schedule's context says “A slot is one unit on a schedule. A slot represents the smallest unit of time or quantity that a service or resource may be booked. Depending on the nature of the service or resource, there may be more than one defined slot at a given instant of time. For example, if a service is an open group therapy session with twelve available seats, then there are twelve slots for the given block of time”</p>\n<p>This begs the following questions:</p>\n<ul>\n<li>Can a group session be handled either way (i.e. either as one slot with multiple appointments OR multiple slots at the same time on the same schedule)?</li>\n<li>If a slot is truly the smallest unit of time, then that implies the base resource doesn’t support multiple appointments within the same slot where each appointment has a different offset?</li>\n</ul>\n<p>I also see a comment on Appointment.slot that implies appointment “start/end values MUST be the same as from the slot” whereas it seems like healthcare providers (i.e. appointment participants) might each arrive at different times during the course of the patient appointment.  Has there been any discussion of supporting offsets for each participant? </p>",
        "id": 153850946,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1475010214
    },
    {
        "content": "<p>That last comment I think should be relaxed, as there are many use cases where the slot/appointment times don't match.<br>\nBut the rest of it is very dependant on the system behind the interface.<br>\nJust because you've grabbed the booking, doesn't mean it will become unavilable. System dependant.<br>\nAnother use-case not described in this part is where slots might be used to describe a shift for a worker where they perform home visits, and much of the time is taken in travel, and therefore doesn't match.</p>",
        "id": 153850963,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1475028183
    }
]