[
    {
        "content": "<p>When doing a SMART launch from an EHR context, is it common for the MRN to be provided in the access token response? </p>\n<p>I was thinking it would always be just the FHIR patient ID and then to get MRN and other patient info by GETting the Patient Resource, but had a discussion where others said they're seeing different things in the wild.</p>",
        "id": 220054874,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1608072756
    },
    {
        "content": "<p>We generally do not recommend that apps use \"custom smart context\" for things like MRN that will be gathered on a read of patient (or of encounter for FIN)</p>",
        "id": 220055956,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1608073346
    },
    {
        "content": "<p>ie: prefer the standard way and use a custom way for things that are harder</p>",
        "id": 220055981,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1608073360
    },
    {
        "content": "<p>we have apps that don't follow that though :)</p>",
        "id": 220056012,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1608073380
    },
    {
        "content": "<p>if you use the custom way it essentially means you're required to do custom coding for every vendor</p>",
        "id": 220056069,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1608073413
    },
    {
        "content": "<p>Not only that, but for eg, the oid needed to align that MRN to a specific org isn't in our custom context - you can only get that through the FHIR read</p>",
        "id": 220056175,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1608073466
    },
    {
        "content": "<p>so there are tradeoffs...</p>",
        "id": 220056216,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1608073497
    },
    {
        "content": "<p>It is certainly not the intention behind the standard that patient identifiers would be provided in ad hoc ways :-)</p>",
        "id": 220058314,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1608074783
    },
    {
        "content": "<p>For sure, totally agree.</p>\n<p>My guess: for apps living in a hybrid world still doing HL7v2, but hoping to use of SMART for launching given its relative advantages over SAML, it may be they may want a single SSO transaction, avoiding the true FHIR pieces.</p>\n<p>From Jenni's answer, it sounds like at least Cerner allows some configuration around custom context extensions. I suppose other EHRs do as well, which might be where the person I was taking to got their info.</p>",
        "id": 220070700,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1608085832
    }
]