[
    {
        "content": "<p>Web based EPR, I need a reccomendation. We are implementing a Smart-on-Fhir portal and are looking at different possibilities of hosting a SmartApp. There are several restrictions e.g. when the EPR changes patient or the EPR initiates an auto logout all SmartApp's must be closed down. As we see it we har 3 options:</p>\n<p>1. iFrame. We regard this as giving the best UI experience. Security and dynamic height of the iFrame if the SmartApp changes it's height dynamicly?<br>\n2. Open in new pane, do we have control in JavaScript of that page (closing it from the EPR)? E.g. change patient or user closes the EPR pane with the mouse?<br>\n3. Open in a new webbrowser instance.<br>\nThoughts and how have other web based EPR vendors done this? Would be simpler in a Windows application where the smartapp could be hosted in child windows of the EPR running its ovn browser instance.</p>",
        "id": 165801871,
        "sender_full_name": "Espen Løke",
        "timestamp": 1558007228
    },
    {
        "content": "<p>We've seen integrations with web-based EHRs using (1) and (2 -- assuming by \"pane\" you mean a new tab/window). Opening a new browser instance (as opposed to a new window) is usually outside of a web app's control. In general, my experience has been that it's no harder to integrate SMART apps with a web-based EHR vs a windows desktop-based EHR (and if anything, a bit easier).</p>",
        "id": 165812834,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1558015632
    },
    {
        "content": "<p>Thanks.</p>\n<p>As part of  the launch prosess SmartApp's authorize using the OAuth authorization code flow. Somehow the app needs to get the id_token of the user logged on to the EHR. In our case the EHR stores context information, like the current patient,  in an internal table. The smart app gets this info during launch as part of the access token. However, how do we do this with the id_token?  I see that FHIR client side  libraries like fhir-client.js check if the  id_token is provided. We need this id_token in our SmartApp.</p>",
        "id": 166073510,
        "sender_full_name": "Espen Løke",
        "timestamp": 1558348140
    },
    {
        "content": "<p>The id_token, when available, is returned as a property in the access tokens response JSON payload. Any OAuth client you use (e.g., <a href=\"http://docs.smarthealthit.org/clients/javascript/\" target=\"_blank\" title=\"http://docs.smarthealthit.org/clients/javascript/\">http://docs.smarthealthit.org/clients/javascript/</a>) should provide access to these properties.</p>",
        "id": 166081546,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1558356302
    },
    {
        "content": "<p>In regard to obtaining coverage for 1 patient what is the url query for this when using STU3.</p>",
        "id": 167584644,
        "sender_full_name": "Jeremie Osaghae-Nosa",
        "timestamp": 1559919889
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>GET /Coverage?patient=123\n</pre></div>",
        "id": 167610031,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559938391
    },
    {
        "content": "<p>In STU3 , it would actually have to be <code>GET [base]/Coverage?beneficiary=123</code> - the 'patient' criteria wasn't defined</p>",
        "id": 167621641,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559949478
    },
    {
        "content": "<p>Has anyone been able to get coverage data from the online sandbox from SMART App Launcher. I'm not sure if they are lacking in patient data for STU3</p>",
        "id": 167967814,
        "sender_full_name": "Jeremie Osaghae-Nosa",
        "timestamp": 1560359741
    },
    {
        "content": "<p>\"Coverage\" is not part of the common clinical data set, and we don't have example date in our sandbox server. You can always add some yourself via POST  to the open endpoint if you just want to try things out -- it should then be available from the launcher  at least until a reset.</p>",
        "id": 167997464,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560381073
    },
    {
        "content": "<p>Thank you, will do</p>",
        "id": 168045925,
        "sender_full_name": "Jeremie Osaghae-Nosa",
        "timestamp": 1560433470
    }
]