[
    {
        "content": "<p>Dear All, </p>\n<p>Trying to embed a SMART on FHIR app into a webview activity in EPIC. It's gonna be a provider facing app that only have access to one patient record only.  In this  page <a href=\"http://docs.smarthealthit.org/authorization/scopes-and-launch-context/\" target=\"_blank\" title=\"http://docs.smarthealthit.org/authorization/scopes-and-launch-context/\">http://docs.smarthealthit.org/authorization/scopes-and-launch-context/</a> under \"Apps that launch from the EHR\" it says that i should launch using a query param launch=abc123 and keep using that same parameter value on all API calls and transactions. Points that are still not clear:</p>\n<p>1. Should I exchange that for a token and use it in Bearer method auth?<br>\n2. Where do I get that unique launch token, how do I link that launch token to only allow access to one patient record. Can that be established from EPIC's Interconnect server that is the FHIR endpoint? </p>\n<p>Would greatly appreciate some help on this as this is the only remaining problem that I am facing. </p>\n<p>Thanks</p>",
        "id": 153941904,
        "sender_full_name": "Abdulhakim Tlimat",
        "timestamp": 1520045835
    },
    {
        "content": "<p>Epic acts as a SMART on FHIR server, and can be configured to launch your app within an embedded browser when a specific menu item or button is clicked. <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> or <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> should be able to point you in the right direction for working with an Epic site to set this up.</p>",
        "id": 153941929,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1520082225
    },
    {
        "content": "<p>Thank you very much <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> . I think I am completely clear now on #1. Still not sure about #2 in previous post on how to create that unique launch token that the OAuth 2.0 server should also be aware of. Would really appreciate any help from <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> or <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> .</p>",
        "id": 153941955,
        "sender_full_name": "Abdulhakim Tlimat",
        "timestamp": 1520103849
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"193840\">@Abdulhakim Tlimat</span> !  Looks like I'm late to the conversation, catching up from this week. </p>\n<p>1) There's some Epic configuration required that causes the launch token to be generated when the app is launched from the EHR. Documentation for this configuration is available to customer analysts in our documentation portal. Who can I point to that documentation to aid this implementation?<br>\n2) The access_token resulting from the OAuth handshake grants the app access to particular data that's limited by two things: (a) the permissions of the user authorizing the app (in this case the provider) and (b) the FHIR resources that the app registered during the client creation process. <br>\n3) Mind if I ask in which healthsystem you're implementing this? That will allow me to loop in the Epic support team for that customer to assist.</p>\n<p>The Epic SMART implementation does not limit a provider-facing access_token to only the current patient from whose chart the app was launched (you get a user/ scope, not a patient/ scope). Rather, your app/acess_token can query data across patients based upon the user's access rights.</p>\n<p>I feel like I used too many words to explain that. Does the above make sense? </p>\n<p>Isaac</p>",
        "id": 153943532,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1520622838
    }
]