[
    {
        "content": "<p>We support some resources on DSTU2, others on STU3, and will soon have some on R4.  Because our development capacity is limited, it is not likely that we will always be able to support all resources on all versions (at least not in the near future).  So we are in the position where we have apps that need to query multiple different FHIR versions to get all the data they need.  In order to support this when doing a SMART launch, we need to communicate the different iss endpoints and FHIR IDs for different versions.  One option we discussed was doing some Epic-specific context parameters in the oauth2/token response like so:</p>\n<div class=\"codehilite\"><pre><span></span>{\n    &quot;patient&quot;: &quot;id2&quot;,\n    &quot;epic.stu3.patient&quot;: &quot;id3&quot;,\n    &quot;epic.stu3.iss &quot;: &quot;https://server/api/FHIR/STU3&quot;,\n    &quot;epic.r4.patient&quot;: &quot;id4&quot;,\n    &quot;epic.r4.iss &quot;: &quot;https://server/api/FHIR/R4&quot;,\n    &quot;token_type&quot;: &quot;bearer&quot;,\n    &quot;scope&quot;: &quot;whatever&quot;,\n    &quot;client_id&quot;: &quot;whatever&quot;,\n    &quot;expires_in&quot;: 3600,\n    &quot;access_token&quot;: &quot;asdf&quot;,\n    ...\n}\n</pre></div>\n\n\n<p>This is kinda a 'meh' approach, but AFAIK the HTTP Header option for asking for a specific FHIR version from a single endpoint still isn't a thing.  Plus we've sort of painted ourselves into a corner for now by putting the version in a URL path component (which I don't mind admitting because I think everyone else basically has too).</p>\n<p>Do folks have thoughts on this idea, or alternatives for solving this problem?</p>",
        "id": 153993032,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1536079010
    },
    {
        "content": "<p>Note that in our case, the access token would work against any of the listed FHIR endpoints.</p>",
        "id": 153993034,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1536079166
    },
    {
        "content": "<p>Ignoring the iss/SMART issue... this could be difficult for consumers to handle. Libraries vary on how easy it is to consume (and validate) different versions of FHIR within the same executable/classpath</p>",
        "id": 153993036,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536079461
    },
    {
        "content": "<p>But back to iss... :)</p>",
        "id": 153993037,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536079569
    },
    {
        "content": "<p>Even if you were able to do the version handling pre-version header in the server by adding a different entry... the challenge would be how to communicate which version the resource is in.</p>",
        "id": 153993038,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536079606
    },
    {
        "content": "<p>IE: since you don't have the header option, If you added <a href=\"http://my.fhir.allversions.com/\" target=\"_blank\" title=\"http://my.fhir.allversions.com/\">my.fhir.allversions.com/</a>..., which sees \"Observation\" (as an example) and knows that's available only on STU 3...<br>\nThere's no way to tell the caller that what they're getting is STU 3 instead of DSTU 2</p>",
        "id": 153993040,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536079665
    },
    {
        "content": "<p>So that their parser doesn't blow up</p>",
        "id": 153993041,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536079721
    },
    {
        "content": "<p>(this abstraction/adding a layer that handles routing is a way around ISS if it wasn't for the \"how to tell them what version you were able to handle\" issue)</p>",
        "id": 153993043,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536079864
    },
    {
        "content": "<p>For your point about consumers - juggling versions in libraries is going to be a problem so long as you don't support all the resources the app needs on the version the app wants.  If an app needs to use two different versions, they have to solve that problem anyway.</p>\n<p>Back to iss...</p>\n<p>Right now, the version you are getting is encoded in the iss URL, which isn't \"spec-official\", but is maybe \"good enough\".  We could go ahead and call out the version associated with all resources returned from an iss URL in the JSON.  Long term maybe that is a response header (which doesn't solve files or messaging, as we all know...).  My opinion on putting a version in the token response is basically the same as my initial proposal, which is to say:  \"meh - but given where we are not sure I see better short-term options\".</p>\n<div class=\"codehilite\"><pre><span></span>{\n    &quot;patient&quot;: &quot;id2&quot;,\n    &quot;epic.stu3.patient&quot;: &quot;id3&quot;,\n    &quot;epic.stu3.iss &quot;: &quot;https://server/api/FHIR/STU3&quot;,\n    &quot;epic.stu3.version &quot;: &quot;STU3&quot;,\n    &quot;epic.r4.patient&quot;: &quot;id4&quot;,\n    &quot;epic.r4.version &quot;: &quot;R4&quot;,\n    &quot;epic.r4.iss &quot;: &quot;https://server/api/FHIR/R4&quot;,\n    &quot;token_type&quot;: &quot;bearer&quot;,\n    &quot;scope&quot;: &quot;whatever&quot;,\n    &quot;client_id&quot;: &quot;whatever&quot;,\n    &quot;expires_in&quot;: 3600,\n    &quot;access_token&quot;: &quot;asdf&quot;,\n    ...\n}\n</pre></div>",
        "id": 153993050,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1536082150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> I saw the channel <a class=\"stream\" data-stream-id=\"179275\" href=\"/#narrow/stream/179275-versioned-API\">#versioned API</a> exists. There isn't really a consensus in there, but you may find some interesting background info.</p>",
        "id": 153993180,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1536094460
    },
    {
        "content": "<blockquote>\n<p>the HTTP Header option for asking for a specific FHIR version from a single endpoint still isn't a thing</p>\n</blockquote>",
        "id": 153993227,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536098290
    },
    {
        "content": "<p>it is documented in the current ballot version of R4 and can be retrofitted to previous versions (that's the point, really).</p>",
        "id": 153993229,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536098317
    },
    {
        "content": "<p>I do not think that this removes the need for the discussion though</p>",
        "id": 153993230,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536098335
    },
    {
        "content": "<p>I also want to point out that:</p>\n<p>1. The HTTP header will not cover CDS hooks. CDS Hooks makes a custom JSON bundle rather than using the FHIR bundle. In the Collection of CDS Hooks resources (trying to not call it bundle) that goes in either the prefetch or the context, each resource may be a different FHIR version. Our solution should support that. </p>\n<p>2. The HTTP header will not cover the FHIR Bundle resource. It can only capture the FHIR version of the bundle itself. Each resource inside the bundle will likely be a different FHIR version, given where EHRs are at with implementing FHIR. How do we capture the versions of each of these resources? </p>\n<p>3. I think the <strong>right thing</strong> to do is for each resource to have its own version - resources becoming self identifying. The argument I have heard against this is that, then we will have to parse the resource before we know how to parse the resource. However, the same concern applies to <strong>resource type</strong>, but resource type is the first thing in the JSON for the resource, and it works! We can <em>additionally</em> consider performance optimizations like the HTTP header option being talked about. But having the <code>resrouceVersion</code>, in addition to <code>resourceType</code>, in the resource itself will avoid problems where some flow which was not anticipated stores off a resource without storing off the version which currently is not part of the resource. </p>\n<p>4. Even if for no other reason, having the <code>resourceVersion</code> in the resource itself <strong>enhances debugability</strong>. Say the EMR responds with the HTTP header saying resource is 1.0.2, but the resource actually is 3.0.1, and the EMR mixed up the version in the header - the self-identifying <code>resourceVersion</code> will allow the consumer to quickly spot why their app crashed, because it is less likely to be mixed up than an out of bounds mechanism like the header.</p>",
        "id": 153996644,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1536847977
    },
    {
        "content": "<p>One pattern we've been thinking about comes up when a single authorization server is minting tokens that can be used at multiple FHIR endpoints -- which I think applies here <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>. We've introduced the concept of a <code>./well-known/smart-configuration.json</code> file in the ballot revisions for SMART. (This file lists a server's capabilities, OAuth endpoints, etc.)</p>\n<p>I wonder if this file might be used to include a \"list of other endpoints where your access token can be used\", as in:</p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;authorization_endpoint&quot;: &quot;https://ehr.example.com/auth/authorize&quot;,\n  &quot;token_endpoint&quot;: &quot;https://ehr.example.com/auth/token&quot;,\n  &quot;token_endpoint_auth_methods_supported&quot;: [&quot;client_secret_basic&quot;],\n  &quot;registration_endpoint&quot;: &quot;https://ehr.example.com/auth/register&quot;,\n  &quot;scopes_supported&quot;: [&quot;openid&quot;, &quot;profile&quot;, &quot;launch&quot;, &quot;launch/patient&quot;, &quot;patient/*.*&quot;, &quot;user/*.*&quot;, &quot;offline_access&quot;],\n  &quot;response_types_supported&quot;: [&quot;code&quot;, &quot;code id_token&quot;, &quot;id_token&quot;, &quot;refresh_token&quot;],\n  &quot;management_endpoint&quot;: &quot;https://ehr.example.com/user/manage&quot;\n  &quot;introspection_endpoint&quot;: &quot;https://ehr.example.com/user/introspect&quot;\n  &quot;revocation_endpoint&quot;: &quot;https://ehr.example.com/user/revoke&quot;,\n  &quot;capabilities&quot;: [&quot;launch-ehr&quot;, &quot;client-public&quot;, &quot;sso-openid-connect&quot;],\n  &quot;endpoints&quot;: [{\n      // FHIR endpoint content here\n      &quot;address&quot;: &quot;https://ehr.example.com/r3&quot;,\n      &quot;payloadMimeType&quot;: &quot;application/fhir+json; fhirVersion=3.6&quot;\n  },{\n      // FHIR endpoint content here\n      &quot;address&quot;: &quot;https://ehr.example.com/r4&quot;\n      &quot;payloadMimeType&quot;: &quot;application/fhir+json; fhirVersion=4.0&quot;\n  }]\n}\n</pre></div>",
        "id": 153996674,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536851301
    },
    {
        "content": "<p>I've been thinking about this in the context of providing access to an Imaging server, but it could be used to provide access to any collection of FHIR servers just the same way.</p>",
        "id": 153996675,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536851338
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I'm not sure in the example above how to express \"this is a FHIR r4 server\"; I sketched this out badly with a mimeType parameter, but that also winds up saying \"json\" which I didn't want to specify.)</p>",
        "id": 153996682,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536851641
    },
    {
        "content": "<p>At the moment, FHIR Bundles containing hetrogeneous resources is non-conformant.  And I'm not aware of any of the reference implementations that could handle that situation.</p>",
        "id": 153996696,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536852561
    },
    {
        "content": "<p>The expectation has always been that servers will convert their data to the version requested, will suppress data they can't convert or will fail</p>",
        "id": 153996699,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536852642
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I think that is the problem that needs to be solved.</p>\n<p>If the EHR only has support for MedicationRequest in DSTU2 and ProcedureRequest in STU3, it might be a long time before the former is updated. What if you need a bundle of them both currently? The current answer is <strong>this is not possible</strong>, and we need to change that. The expectation does not satisfy the current needs and needs review.</p>",
        "id": 153996701,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1536852750
    },
    {
        "content": "<p>That could be pretty challenging for parsers/libraries</p>",
        "id": 153996709,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536853489
    },
    {
        "content": "<p>when we did our transition from may2015 to DSTU2, we just had separate servers. Apps only moved over to the other once everything they needed was available on that version.</p>",
        "id": 153996710,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536853526
    },
    {
        "content": "<p>when you say in the same bundle, are you talking about $everything style operations? Batch/Transaction?</p>",
        "id": 153996711,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536853558
    },
    {
        "content": "<p>that was also pre-versioning. If I wanted to try to do something like what you're describing today, I would set up a server that understood the new headers. However, like lloyd mentioned, if there was no way for my server to do the conversion on the fly for some resource, it would likely fail</p>",
        "id": 153996712,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536853666
    },
    {
        "content": "<p>FHIR is designed to be coherent within a version, but not across versions.  How will you handle a ServiceRequest reference in an R4 instance that you're exposing as an R3 ProcedureRequest.  It's a huge ugly can of worms.</p>",
        "id": 153996713,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536853759
    },
    {
        "content": "<p>For a lot of resources, the conversions are relatively straight-forward and we provide computable mappings.  Implementations can (and should) implement those.  Where the changes have been more radical, clients can choose betwen making separate queries (e.g. one against R4, one against STU3) or forego certain functionality.  Crossing the streams doesn't work with any of our infrastructure - validator, reference implementations, testing services, public test servers, etc.  It's something we could explore as we start to approach R5, but I can't fathom how we could land such a thorny issue, document and test it in time for R4.  We've only got 1.5 months until the substantive freeze for R4 and the last connectathon before that publication happens in 2 weeks.</p>",
        "id": 153996716,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536854060
    },
    {
        "content": "<p>You are only punting the problem from the FHIR consumer (App/CDS Service etc) to the FHIR producer / EHR who is already struggling to keep up with FHIR versions, and make implementations of resources available. </p>\n<p>We, at least internally at Epic, don't see an immediate future where we will have all resources we support across all versions. So it is an urgent need that we create  mechanism for FHIR to go across versions in resource consumption. </p>\n<p>Note also that people are already doing this - just through custom ways. We are just asking to standardize this.</p>\n<p>I understand it is challenging - but aren't we all here already to solve challenging problems?</p>",
        "id": 153996733,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1536857346
    },
    {
        "content": "<p>Not to solve challenging problems <em>per se</em> -- we are trying to address real world needs with technical solutions that are a good blend of ... Suitable, Universal, Implementable, etc.</p>",
        "id": 153996750,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536857821
    },
    {
        "content": "<p>If we're going to punt an issue anywhere, it will almost always be to the servers - as they're generally the most sophisticated systems in the exchange and best able to deal with increased complexity.  (Expecting multi-version support and integration of multiple reference implementations in an iPhone or android client isn't really on the table.)  The challenge is understood, but there's also a question of timeframes.  We can't make any substantive changes to Bundle for R4 without throwing out the notion of R4 containing normative content.  That's not something we'd contemplate for this issue.  So <em>if</em> it's going to be solved (which will depend on us figuring out a workable technical mechanism), there's no way for it to exist in the official spect until R5.</p>",
        "id": 153996751,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536857824
    },
    {
        "content": "<p>EHRs also have a finite set of resources (not the FHIR term). EHRs can either use that to create different version copies of what is conceptually the same thing, <strong>or to implement new FHIR resources</strong>. Especially, if say an STU3 instance of a resource \"meets the need,\" the EHR could say, \"it's more useful for me to spend the time making a new resource in R4, than to port that existing resource into DSTU2 and to R4.\" Essentially, <code>if we solve the versioning problem, then there is more interoperability and more resources to consume,</code> whereas if we fixate on FHIR version consistency, the pace of adoption of FHIR will be severely constrained. </p>\n<p>Also, your point of EHR having sophisticated systems is not an accurate representation of all considerations. DSS services, and other FHIR consumers generally use publicly available libraries etc for FHIR. Right now, the existing libraries are married to specific versions. However, if for example the .NET FHIR library on nuget instead of being three libraries FHIR.NET-DSTU2, FHIR.NET-STU3 and FHIR.NET-R4, were <strong>one single library FHIR.NET which contained the resource models for DSTU2, STU3 and R4</strong> (or even better, every numeric version of FHIR), then the job of the consumer - in my perspective - is rather simple. In fact, these FHIR version transmutation solutions you mentioned <strong>can even be baked into</strong> such consumer libraries. </p>\n<p>However, unlike that, the EHRs have a real problem with supporting all versions - there is a data-model behind the FHIR data-model that is not FHIR, but proprietary - engineered over many years. And while transmuting a resource from DSTU2 to STU3 may be okay for the consumer's use, there are greater expectations on the EHR with regard to <strong>data fidelity</strong> - <em>if there are optional elements in the newer version that the lower version did not support, but the data is available to the EHR, then the EHR should fill that in</em>. So on the EHR side, this is <strong>not a simple transmutation</strong> of resources between versions. </p>\n<p>As for load on a mobile device, the ASP.NET HL7 library + a simple app published on it come to a mere 5.2MB of hosting space. So I can't imagine it being a lot of code / overhead we are talking about even on mobile. And if they don't use a multi-version library, they are maintaining status quo - not retrogressing, whereas if they use a multi-version library, they can go above and beyond what they can consume today. Plus, if the app is really clinically valuable, it will likely evolve to have a server backend.</p>\n<p>Therefore, I really think supporting versioning within the resource and resources of different versions on the same FHIR server is the better long term strategy.</p>\n<p>Also, a lot of other standards do the same thing - support versioning within their payloads. They must have seen some value in it?</p>",
        "id": 153996846,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1536870341
    },
    {
        "content": "<p>Also, on the ability to adopt new FHIR versions as they come out, if resources across multiple versions can co-exist and be exchanged, then when one resource is available in R4, the R4 version of that resource can be used, even though other resources are all STU3. Whereas currently, a consumer has to wait until the producer has upgraded all their required resources to R4, before they can consume R4 from the producer. So there is a huge lag, less feedback and delayed adoption, leading to slower maturity.</p>",
        "id": 153996854,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1536873584
    },
    {
        "content": "<p>Hey Guys - <a href=\"#narrow/stream/4-implementers/topic/Multiple.20HAPI.20FHIR.20versions\" title=\"#narrow/stream/4-implementers/topic/Multiple.20HAPI.20FHIR.20versions\">interesting question from an implementer</a> pointing out that running multiple versions of HAPI on a mobile client started to get too big.</p>",
        "id": 154000636,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1538084981
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> I think you are missing the more important takeaway that someone is already trying to do this :P <br>\nAnd asking for help on how to do this.</p>",
        "id": 154000896,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1538097366
    },
    {
        "content": "<p>I think the question there was about library support for consuming multiple versions of FHIR -- not for a way to represent/handle individual payloads with mixtures of multiple versions.</p>",
        "id": 154000912,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1538109181
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Yes, the specific question there is about library support for multiple versions of FHIR. However, I infer from it that they may be trying to consume multiple FHIR versions within the same App. 'Why?' becomes the natural follow-up question in my mind..</p>\n<p>I had seen this spec <a href=\"http://build.fhir.org/versioning.html\" target=\"_blank\" title=\"http://build.fhir.org/versioning.html\">http://build.fhir.org/versioning.html</a> on supporting versioning, and <span class=\"user-mention\" data-user-id=\"193229\">@Kevin Olbrich</span> also pointed me to this since he was involved in the development. I see that as a great step forward. I had asked for a resourceVersion property above, but <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> convinced me that if we make the profile meta required, then that will essentially cover the need without breaking backwards compatibility. So then the only thing missing from the proposal really is the ability to mix resources of different versions in bundles, CDS-Hooks etc; although, if a bundle profile is made, which specifies different profiles crossing versions on the included resources, maybe this is possible? </p>\n<p>So what I am asking really may not be very far off. And <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> had expressed willingness to consider CDS-Hooks incorporating a cross-version solution if FHIR comes up with one that can be reasonably analogously included in CDS-Hooks as well.</p>",
        "id": 154003830,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1538414780
    },
    {
        "content": "<p>we have no framework for crossing resource versions inside a bundle. I can't imagine how we'd introduce that. I presume you are interested in what goes in the prefetch? if so, we make no rule that the different properties of the pre-fetch object are all the same version</p>",
        "id": 154004174,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538433033
    },
    {
        "content": "<p>nor should you make the meta.profile required - certainly not in the general case.</p>",
        "id": 154004175,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538433078
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, you are not offering a solution :(</p>\n<p>Let's say, as you envision, some time in the future, FHIR becomes stable. Let's say it's FHIR version R10. Then, let's say cultural identity becomes a major concern for Patient resource, like gender identity is today, and so we need to make a change to the Patient resource in R11. </p>\n<p>Is the FHIR stance going to be that, until (1) EMRs have implemented R11 for ALL resources they previously supported in R10 (this is actually some work, even though possible rote-work), and (2) FHIR Application that previously used R10 has completely upgraded itself to use everything in R11, the new capabilities for the Patient resource may not be used? </p>\n<p>If that is not how we envision it, then we have to also accept the possibility that this patient resource may be bundled with other resources in a FHIR bundle. So we need to be able to bundle the R11 Patient resource with other R10 resources in this hypothetical, but very faithful to present day problems, use-case.</p>",
        "id": 154004324,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1538454846
    },
    {
        "content": "<p>this is why I recommend not stating the version of the resources at all. because if you don't, then the EMR reading the bundle can read it as either Rx or Rx+1 and accept unknown elements</p>",
        "id": 154004338,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538473706
    },
    {
        "content": "<p>but I repeat: we have no framework for mixing versions in a bundle. It's not that I'm not interested in the problem, it's just that I can't imagine how we could expect applications to support that</p>",
        "id": 154004339,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538473755
    },
    {
        "content": "<p>Cerner is in the same camp of not having capacity to constantly uplift all resources across the board to the latest version of FHIR. If we introduce a new resource, we also don't want to necessarily have to back-patch it to an old version of FHIR just because that's what the majority of consumers are using. We share the situation of using separate endpoints for separate versions of FHIR, but have no interest in mixing multiple versions in a single request/reply.</p>\n<p>We've discussed a future move towards a single base URL (not necessarily a single deployment) that can route based on the fhirVersion in the media type. A client library would:<br>\n1. call $versions to discover what's supported<br>\n2. optionally call /metadata for one or more supported versions<br>\n3. obtain resources using content type negotiation</p>\n<p>We would have to create this single entry point (likely behind an API Gateway to abstract away our deployment strategy), support the $versions operation, start requiring fhirVersion in Accept/Content-Type headers, and gradually migrate 3rd party apps to use it.</p>\n<p>This would:</p>\n<ul>\n<li>allow one url for SMART launch</li>\n<li><em>help</em> with references between resources (though there are still complexities around resource renames, for example)</li>\n</ul>\n<p>As FHIR content becomes more and more normative, this seems like the right direction. In the meantime, with breaking changes and EHRs unable to keep up with constant uplifts, I recognize that it introduces more complexity into client libraries.</p>",
        "id": 154004650,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1538491990
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, isn't the burden of mixing versions already on the client application with the multiple version spec (<a href=\"http://build.fhir.org/versioning.html\" target=\"_blank\" title=\"http://build.fhir.org/versioning.html\">http://build.fhir.org/versioning.html</a>), with or without mixed version bundles? </p>\n<p><span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span>, isn't the $version you are proposing an additional web service call? In a SMART app, or especially in CDS Hooks where there is a constraint on turnaround time, and the FHIR server is not known until the App / Hook invocation (for any caching), doesn't this mean, there is yet another burden on the App/Service? The App has to first find versions supported, then if the bundle / collection of resources being requested spans across versions for different resources, the App needs to build logic to break that request into multiple separate requests for the same logical request? Or am I misunderstanding what is proposed?</p>",
        "id": 154004698,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1538495165
    },
    {
        "content": "<p>$versions is out on <a href=\"http://build.fhir.org/operation-capabilitystatement-versions.html\" target=\"_blank\" title=\"http://build.fhir.org/operation-capabilitystatement-versions.html\">http://build.fhir.org/operation-capabilitystatement-versions.html</a>; I'm suggesting it has use here. The call would be made up-front and cached.  For the bundle where the are multiple resources existing across different versions, I'll make up an example use-case: an app wanted resource A and B, where A exists for STU3 and DSTU2, but B only exists for DSTU2.  One option would be to get resource A at STU3 and resource B separately at DSTU2.  Alternatively, you could take a common denominator approach and load both at DSTU2 if chattiness is a concern.  EHRs will, of course, work with apps to prioritize resources uplifts to match use-cases.</p>",
        "id": 154004717,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1538496425
    }
]