[
    {
        "content": "<p>The SMART on FHIR sample apps I’ve experimented with so far simply use the token set from the EHR’s Authorization Server to do everything. They typically sign in using claims from the ID token, and obtain FHIR resources using the access token. What if the SMART app is itself a fully standalone app that has a user store, an Authorization Server that issues access tokens, permissions model, etc? Is it expected that the SMART app treat the EHR AS as an external IDP and link accounts? Or, is it ok to expect/require the end user to be signed into the target app first, then perform the SMART on FHIR OAuth2 dance to get the tokens needed for the FHIR server?</p>",
        "id": 201169154,
        "sender_full_name": "Brian Gammon",
        "timestamp": 1592412811
    },
    {
        "content": "<p>In short, the answer to your question is yes. The smart app launch specification focuses on connecting an app to an EHR or other fhir data system. The app can of course be tightly bound to that relationship or have a rich personal life unto itself. We don't try to draw any boundaries around what an app can do. most of our example apps focus on their relationship with the EHR because that is the piece where our specification has something to say.</p>",
        "id": 201169869,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592413176
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , I almost asked this during your Office Hours session yesterday, but didn't quite have the right wording ready to go. I have a couple of other SMART and CDS Hooks questions brewing that I'll post here in case it helps anyone else.</p>",
        "id": 201174010,
        "sender_full_name": "Brian Gammon",
        "timestamp": 1592414981
    },
    {
        "content": "<p>Sounds good -- keep in mind <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a> and <a class=\"stream\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks\">#cds hooks</a> for specifics</p>",
        "id": 201179504,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592417417
    },
    {
        "content": "<p>Hi Team, I tried a lot but not able to understand the concept of SMART on FHIR. Can someone explain in practical terms..more on business perspective will help</p>",
        "id": 204223011,
        "sender_full_name": "PKumar",
        "timestamp": 1595001066
    },
    {
        "content": "<p>Can you be more precise on what you're having an issue with?</p>",
        "id": 204223107,
        "sender_full_name": "David Pyke",
        "timestamp": 1595001110
    },
    {
        "content": "<p>We are having web application that has APIs and it has to be given access to various providers. I heard that SMART on FHIR will take care of authentication, so trying to understand what it is and how it helps</p>",
        "id": 204223404,
        "sender_full_name": "PKumar",
        "timestamp": 1595001212
    },
    {
        "content": "<p>You may find the info you need here: <a href=\"https://docs.smarthealthit.org/\">https://docs.smarthealthit.org/</a></p>",
        "id": 204223571,
        "sender_full_name": "David Pyke",
        "timestamp": 1595001263
    },
    {
        "content": "<p>Sure, THanks!<br>\nIs SMART concept is specific to EHR applications only? or can we use it for other applications as well?</p>",
        "id": 204223774,
        "sender_full_name": "PKumar",
        "timestamp": 1595001353
    },
    {
        "content": "<p>It was designed around healthcare applications, but not specifically EHR</p>",
        "id": 204224611,
        "sender_full_name": "David Pyke",
        "timestamp": 1595001691
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> </p>\n<p>I went through the <a href=\"https://gallery.smarthealthit.org/\">https://gallery.smarthealthit.org/</a> </p>\n<p>does the apps listed on this platform works only if I have FHIR APIs supported by my application. For ex: if I want to use one of the apps that create reports on vitals. I assume the workflow as:  My system has FHIR APIs of observation resource and enable access to this app, authenticated in backend using SMART standards. Then the app will consume data from my system and show results .</p>\n<p>Thanks in Advance!</p>",
        "id": 204790708,
        "sender_full_name": "PKumar",
        "timestamp": 1595507963
    },
    {
        "content": "<p>Yes, this is SMART on FHIR.  You need to have an exposed FHIR API for them to work.</p>",
        "id": 204791768,
        "sender_full_name": "David Pyke",
        "timestamp": 1595508568
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> </p>\n<p>I get it now. But there is mention about getting the context when app is launched, how do I get the context? Is it a FHIR resource based API that supplies me with context? how does the connection is established along with context?</p>",
        "id": 204794560,
        "sender_full_name": "PKumar",
        "timestamp": 1595509858
    }
]