[
    {
        "content": "<p>Hi All, Could you please help me to  get SNOMED CT International Standard Release Files which can be used for Terminology Servers. Appreciate your support. Ankita</p>",
        "id": 202068547,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1593163299
    },
    {
        "content": "<p>Hi Ankita, if you are in a SNOMED member country, then you should contact your national release centre, otherwise you will need to obtain an appropriate licence from SNOMED International.  See <a href=\"http://snomed.org\">http://snomed.org</a> for details.</p>",
        "id": 202090651,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1593178735
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  Thank you for the response. I will check with the respective team.</p>",
        "id": 202771454,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1593756505
    },
    {
        "content": "<p>Just curious to find out the reason behind using ICD-10 codes instead of SNOMED codes in Billing System. Can someone explain me please.</p>",
        "id": 203234964,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1594189297
    },
    {
        "content": "<p>The origins of ICD lie in the 1890s, so it has been used just a tad longer than SNOMED. That's probably the main reason why governments mandate its sue for billing and statistics.</p>",
        "id": 203235198,
        "sender_full_name": "René Spronk",
        "timestamp": 1594189609
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  for the quick response... I was wondering with this query because Snomed seems to be more precise than ICD-10. And if the billing system starts using it, then complication of creating maps will be much less.</p>",
        "id": 203235557,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1594190067
    },
    {
        "content": "<p>Hmm - personally I hope SNOMED will never be used by billing systems. But that's in the pessimistic/realistic expectation that upcoding for financial reasons will pollute the clinical record (and the snomed codes used).</p>",
        "id": 203236000,
        "sender_full_name": "René Spronk",
        "timestamp": 1594190534
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  Yeah.. I understand and agree to your point..</p>",
        "id": 203236218,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1594190809
    },
    {
        "content": "<p>Thank you for providing your views..</p>",
        "id": 203236362,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1594190978
    },
    {
        "content": "<p>Agree with René's concern. <br>\nAlso I think that not everyone wants the complication of creating maps [for billing] to be much less...</p>",
        "id": 203236535,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594191227
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> for sharing your views..</p>",
        "id": 203237545,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1594192278
    },
    {
        "content": "<p>Traditionally one has divided between terminology (like SNOMED) made for defining a complete set of detailed clinical concepts and terms, and classifications/code systems (ICD, NCSP, ICPC etc) made for reporting - where similar things are organized hierarchly in order to not have to deal with the complexity of all the details. In a way you can call them different technologies for different purposes. And for billing you often dont want to deal with the complete set of details, but consume it on a level and in a structure that makes sense for the purpose.</p>",
        "id": 203249979,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594202732
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> Much Appreciated.. This is really helpful. Thank You</p>",
        "id": 203251666,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1594203991
    }
]