[
    {
        "content": "<p>I am currently mapping non-Snomed clinical terms (used in-house) to Snomed CT in order to assign valid codes to Condition resources. I have trouble understanding the difference between Concept Domain Bindings and Value Set Bindings.</p>\n<p>Take for example this Condition example in the documentation: <a href=\"http://hl7.org/fhir/condition-example-family-history.json\" target=\"_blank\" title=\"http://hl7.org/fhir/condition-example-family-history.json\">http://hl7.org/fhir/condition-example-family-history.json</a><br>\nThe code assigned, 312824007, is part of the Concept Domain Binding (as it is a child of 413350009), but is not part of the Value Set Binding (as it is not a child of  404684003). Is this example code valid for a Condition resource? If so, when is the Value Set Binding relevant?</p>",
        "id": 154757430,
        "sender_full_name": "Hacène Khemici",
        "timestamp": 1547067775
    },
    {
        "content": "<p>Where are you seeing \"concept domain bindings\" in the FHIR space?</p>",
        "id": 154761251,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547071212
    },
    {
        "content": "<blockquote>\n<p>Where are you seeing \"concept domain bindings\" in the FHIR space?</p>\n</blockquote>\n<p><a href=\"http://hl7.org/fhir/condition-mappings.html#sct-concept\" target=\"_blank\" title=\"http://hl7.org/fhir/condition-mappings.html#sct-concept\">http://hl7.org/fhir/condition-mappings.html#sct-concept</a><br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 154920041,
        "sender_full_name": "Hacène Khemici",
        "timestamp": 1547216603
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 154920696,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547217323
    },
    {
        "content": "<p>I actually wasn't aware (or had forgotten?) that we were doing \"concept domain\" mappings to SNOMED CT in FHIR.   It looks like this was introduced in 1.8.0 (a little over 2 years ago), but I definitely am not recalling having any discussions about it.  It's basically the V3 notion of defining the semantic space, which I didn't think we had imported to FHIR other than in the element definition itself.  I can see why in some cases it could be useful (although possibly more work than it's worth?) to also do it in a clinical terminology.  And if we are doing to do it in terminology then SNOMED CT is the logical (probably only) choice as it is rich enough to at least often be useful for describing the intended semantic space of the element.  With an example binding the codes in the example(s) wouldn't theoretically need to conform to the value set binding, but they should conform to the concept domain binding - which is the way it is in this case.  So that doesn't seem actually wrong.  But in the core specification maybe the value set binding and the concept domain mapping should always be consistent?  Otherwise it can be confusing, as <span class=\"user-mention\" data-user-id=\"196273\">@Hacène Khemici</span> has described, and I'm not aware of a rationale for why they should be different.  <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 154954671,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1547248296
    }
]