[
    {
        "content": "<p>Looking at Condition.code there is an example VS binding that suggests using codes that are descendants of 404684003 (Clinical finding)</p>\n<p>For findings that reside within 413350009 (Finding with explicit context) - would these typically be \"Conditions\" or \"Observations\"?</p>",
        "id": 204775041,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595495422
    },
    {
        "content": "<p>Hi Richard,<br>\nThe SNOMED on FHIR project has done some work on the Condition resource, including a suggestion for binding for Condition.code:<br>\n<a href=\"https://confluence.ihtsdotools.org/display/FHIR/Condition+Resource\">https://confluence.ihtsdotools.org/display/FHIR/Condition+Resource</a><br>\nSo, the answer to your question would be Conditions, but there is a discussion about how much of the SNOMED context model to use vs. the corresponding FHIR facilities (and this discussion is not likely to go away soon).</p>",
        "id": 204775208,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1595495573
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192129\">@Daniel Karlsson</span>  a very useful starting point. And I agree the semantic clash between FHIR and SNOMED will exist for some time.</p>",
        "id": 204775507,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595495830
    },
    {
        "content": "<p>Yes, like forever would be a good guess <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 204775606,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1595495908
    },
    {
        "content": "<p>Looking closer, the proposed ECL looks a bit suspect. Not sure that all SNOMED events are conditions - it's a starting point though.</p>",
        "id": 204777122,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595497076
    },
    {
        "content": "<p>Maybe no events should be Conditions. I think the idea of these bindings were to be very inclusive, and that we might have been over-inclusive here. It is a live piece of work, so suggestions are more than welcome!<br>\nThanks!</p>",
        "id": 204777370,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1595497260
    },
    {
        "content": "<p>&lt;&lt; 420134006   |Propensity to adverse reactions| OR &lt;&lt; 473010000   |Hypersensitivity condition| also looks suspicious. If I remember correctly (big if...) the discussion was that we would exclude (and not include) things that are kept in other FHIR resources (here AllergyIntolerance).</p>",
        "id": 204777646,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1595497472
    },
    {
        "content": "<p>I'll put Condition on the agenda for next SNOMED on FHIR call...</p>",
        "id": 204777683,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1595497514
    },
    {
        "content": "<p>I think I need to start joining those calls to learn more. I'll try and persuade one of my clinical colleagues to do the same.</p>",
        "id": 204778116,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595497852
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 204778154,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1595497892
    },
    {
        "content": "<p>Here's a list of the most popular SNOMED codes used by GPs that are kinds of &lt;&lt;272379006 Event: </p>\n<p>217082002   Fall - accidental<br>\n214031005   Motor vehicle traffic accident<br>\n401270003   E-mail received from patient<br>\n418019003   Accidental event<br>\n217082002   Accidental fall<br>\n217697000   Dog bite<br>\n52684005    [X]Assault<br>\n419620001   Death<br>\n1912002 Fall<br>\n82313006    Suicide attempt<br>\n52684005    Assault<br>\n217701002   Cat bite<br>\n418420002   Intentionally harming self<br>\n217706007   Insect bites - nonvenomous<br>\n444386009   Exposure to Enterobius vermicularis<br>\n248110007   Sexual assault</p>\n<p>Whilst there's clearly an administrative code in there - and that's a possible source of an interesting digression - the huge majority are clearly highly significant clinical 'Problems' that should appear in the patient Problem List. You can argue all you like that these are codes for the cause of the problem, and not for the pathophysiological true problem itself. But that's clinical record keeping for you. If we filter the content of real patient records through an overly constrained semantic filter, bad stuff will happen. At least, until you also apply that same filter prospectively at the point of primary clinical data capture, and retrospectively over all clinically relevant data already captured but with less constraints over the last 20 years or so.</p>\n<p>So... if all phenomena that clinicians identify as a \"Problem\" on a patient Problem List must be cast only as instances of the CONDITION resource, then it follows that most SNOMED Events should be within the terminology binding for that resource.</p>",
        "id": 204787144,
        "sender_full_name": "Jeremy Rogers",
        "timestamp": 1595505703
    },
    {
        "content": "<p>From the Condition resource page: \"This resource is used to record detailed information about a condition, problem, diagnosis, or other event, situation, issue, or clinical concept that has risen to a level of concern.\"</p>",
        "id": 204788105,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1595506356
    },
    {
        "content": "<p>I don't recall the precise rationale around adverse reactions and hypersensitivity states being within the Condition resource binding; I remember much pain over the obvious overlap with the AllergyIntolerance resource. </p>\n<p>I think the expectation was that the AllergyIntolerance resource would typically be used only for those entries held specifically in some 'patient allergies or intolerances' table within the information model, rather than in any table but according to the SNOMED taxonomy. </p>\n<p>But information model \"allergy tables\" often hold only a very specific subset of all relevant patient allergies: typically only those specifically relating to prescribed medication. </p>\n<p>So where do all the other clinically relevant propensities and hypersensitivities go, such as these:</p>\n<p>21719001    Hay fever<br>\n300916003   Latex allergy<br>\n419271008   Dog allergy<br>\n39579001    Anaphylaxis</p>",
        "id": 204788218,
        "sender_full_name": "Jeremy Rogers",
        "timestamp": 1595506430
    },
    {
        "content": "<p>Since &lt;&lt; 420134006 |Propensity to adverse reactions| OR &lt;&lt; 473010000 |Hypersensitivity condition| are all clinical findings, at least those expressions are redundant in the context of the ECL query:<br>\n((<br>\n&lt; 404684003 |Clinical finding|<br>\n   OR &lt;&lt; 420134006   |Propensity to adverse reactions|<br>\n   OR &lt;&lt; 473010000   |Hypersensitivity condition|<br>\n   OR &lt;&lt; 79899007 |Drug   interaction|<br>\n)...)</p>",
        "id": 204788327,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1595506511
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194974\">@Jeremy Rogers</span>'s comment/question about <code>if all phenomena that clinicians identify as a \"Problem\" on a patient Problem List must be cast only as instances of the CONDITION resource ...</code> isn't strictly true for FHIR generally, as the original notion of at least many in FHIR was that the problem and allergy (and other) lists would be represented as instances of the List resource (sort of seems to make sense?).  The List resource instance would then have entries to reference to whatever resource instances are appropriate to be included as items in that list - which, for the problem list, would probably be Condition resource instances in the majority of cases, but would definitely not be limited to only that.  But in US Core that idea was rejected in favor of representing the problem list as the set of (active) Condition resources, which, as I recall, was felt to be a simpler and more understandable solution.  So it's being done that way in the US, and also elsewhere as the major EHR vendors (Epic, Cerner, etc.) are mostly (or entirely) following US Core.</p>\n<p>And I think Jeremy is correct about the reasons for carving out AllergyIntolerance separately from Condition, to represent the allergy and hypersensitivity items that would be included in the separate \"allergy list\" (or table) - and that does have features like 'criticality\" and the associated adverse reaction that distinguish it from the more general Condition.  In the AllergyIntolerance resource and systems that I know of, I would expect 'Latex allergy' to be included, as it's clearly a relevant risk in pretty much any healthcare setting.  Also I think that 'Hay fever' and 'Dog allergy' might be included on the allergy list, even though they don't represent a risk in the healthcare setting and instead may be conditions to be managed.  And when they are conditions to be managed they would also logically appear on the problem list (and could be in both).  And 'Anaphylaxis' represents the adverse reaction itself, so it shouldn't be in the allergy list but it can be represented in the AllergyIntolerance.reaction.manifestation, and if it's being actively managed it certainly should be in the problem list.</p>",
        "id": 204808293,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595516203
    }
]