[
    {
        "content": "<p>Hi. I'm working on importing a subset of Snomed required by an IG to our HAPI FHIR (where concept \"is-a\" 225400002). We don't want to load all of Snomed. It is important that we get the parent/child properties right, but I haven't been able to find an example of how this is modelled in an actual Snomed CodeSystem resource. Can anyone point me to an example?</p>",
        "id": 269697243,
        "sender_full_name": "Ole Hedegaard",
        "timestamp": 1643355619
    },
    {
        "content": "<p>You won't likely find it in a CodeSystem resource.  SNOMED is just <em>way</em> too big to express that way.  As well, SNOMED isn't published as a cohesive whole - every country (and a few other organizations) publishers their own subset.  So to find your answer, you need to know what country(ies) you need.</p>",
        "id": 269750158,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643382586
    },
    {
        "content": "<p>You could implement a subset of a particular versioned edition of SNOMED CT as a FHIR CodeSystem Resource where the content is set to 'fragment'  IF the relevant National Release Centre (i.e. code system steward) permits this see <a href=\"http://hl7.org/fhir/valueset-codesystem-content-mode.html\">here</a>. However, much will depend on your precise requirements - i.e. do you just require concept IDs and descriptions? Anything more and you'll need the relationships including all the concepts for attribute types and values. If you just require the former, maybe it would be easier to create an extensional ValueSet of these concepts (i.e. where the concepts are included in the value set definition) as it's not a very large sub-set?</p>",
        "id": 269835242,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1643427865
    },
    {
        "content": "<p>So the case is here that the original valueset expresses the (where concept \"is-a\" 225400002) formulated as intensional - and ideally the original shouldn't be flipped to being extensionally defined. The ideal solution would be if there was a(n easy) way to construct such a subset of SNOMED using CodeSystem fragments that wouldn't trigger the need for fiddling with the valueset</p>",
        "id": 271350950,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644442628
    },
    {
        "content": "<p>The permission of the Code System steward is required to do this. You can define filters in CodeSystem resources,  to use in ValueSet resources, but I'm not sure if the purpose of this is to create Code System fragments and it's worth noting what the  <a href=\"http://hl7.org/fhir/codesystem-definitions.html#CodeSystem.filter\">specification</a> has to say about Code System filters.</p>",
        "id": 271367589,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1644451915
    }
]