[
    {
        "content": "<p>Hello all,<br>\nHope all is well. I have a question related to conditions used in client application. we agree to use the standard SNOMED names e.g., \"Heart failure (disorder)\" as per SNOMED.</p>\n<p>From a medical perspective this is not good, since it adds a lot of clutter for the HCP to read. Medical would prefer to have a cleaner naming e.g.,  \"Heart failure\" only without the brackets.</p>\n<p>Does it ok our valueset display can have Designated preferred name (PT)? for ex...<br>\n        {<br>\n            \"code\": \"84114007\",<br>\n            \"display\": \"Heart failure\"<br>\n          }</p>\n<p>Thanks</p>",
        "id": 263269125,
        "sender_full_name": "Krishna Moorthi",
        "timestamp": 1638354255
    },
    {
        "content": "<p>yes</p>",
        "id": 263280231,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638360760
    },
    {
        "content": "<p>Thanks ! another question is : <br>\n How do we get clean / clutter-free condition names for all SNOMED codes without manually translating all 350k SNOMED codes?</p>",
        "id": 263284670,
        "sender_full_name": "Krishna Moorthi",
        "timestamp": 1638363246
    },
    {
        "content": "<p>You'd be better off using a UI filter that removes the bracketed text, rather than changing the display name.  That way you don't have to worry that your display names aren't compatible with someone else's system</p>",
        "id": 263299095,
        "sender_full_name": "David Pyke",
        "timestamp": 1638369305
    },
    {
        "content": "<p>Some SNOMED CT display names (without the bracketed text) are longer (&gt;70 characters). I'm curious how these are handled?</p>",
        "id": 263340336,
        "sender_full_name": "Donna Pertel",
        "timestamp": 1638385330
    },
    {
        "content": "<p>Handled in what way?</p>",
        "id": 263342777,
        "sender_full_name": "David Pyke",
        "timestamp": 1638386307
    },
    {
        "content": "<p>Actually, the spec (<a href=\"https://hl7.org/fhir/snomedct.html\">https://hl7.org/fhir/snomedct.html</a>) explicitly says that the best choice for the display term for a SNOMED CT concept is the preferred term in the relevant language, not the fully specified name (which is the one with the parentheses).</p>",
        "id": 263373206,
        "sender_full_name": "Jim Steel",
        "timestamp": 1638401729
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192587\">David Pyke</span> <a href=\"#narrow/stream/179166-implementers/topic/SNOMED.20display.20name/near/263299095\">said</a>:</p>\n<blockquote>\n<p>You'd be better off using a UI filter that removes the bracketed text, rather than changing the display name.  That way you don't have to worry that your display names aren't compatible with someone else's system</p>\n</blockquote>\n<p>Whatever is selected by a user needs to be persisted and therefore should be a valid description (preferably the preferred term, but any acceptable synonym within the context of use, or the FSN). Removing the Semantic Tag from the FSN and presenting that will not necessarily provide a valid description.</p>",
        "id": 263382177,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1638408258
    },
    {
        "content": "<p>In The Netherlands our health professionals frequently give feedback they don't like the SNOMED preferred term. Usually this is caused by too much context in the term which is really not necessary in the context of the system. So SNOMED preferred terms are often too elaborate to be user friendly display in GUI's. Out of curiosity: what is the experience in other countries?</p>",
        "id": 268394694,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1642514626
    },
    {
        "content": "<p>That could be a UI issue - i.e. the concepts that they are being presented with are too detailed. Otherwise, this should probably be fed back to whoever is responsible for your National Edition to see if alternative synonyms might be selected as preferred terms, or additional synonyms might be created that are better suited for national use.</p>",
        "id": 268431110,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1642528619
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191437\">@Arianne van de Wetering</span> I explored this a little here: <a href=\"http://www.healthintersections.com.au/?p=1716\">http://www.healthintersections.com.au/?p=1716</a></p>\n<p>The problem is that the display for a concept isn't related to a particular concept - it's a general description of the concept that uniquely differentiates it from any other concept. </p>\n<p>But almost always, when a concept is used, it's used in a context where certain things are known about it in advance e.g. what goes in this field is a body structure. Given that, the description will (should!) contain extraneous words that are a cognitive drag on the user. Ignoring this fact is an insult to the user (and the kind of thing that drives users to dislike information systems).</p>\n<p>So what a concept really needs is a general display that properly describes it in any context at all, and then context specific displays that concentrate on efficiently differentiating the concept from the other applicable concepts in a particular context. Terminologists tend to freak out about this, concerned at the danger of losing information or misusing concepts this way, and I've absolutely seen this. But it's easy for us to overlook the problem that's trying to be solved. Which is neatly illustrated by the Synthamine example in my blog post</p>",
        "id": 268442802,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1642533930
    },
    {
        "content": "<p>that's why you can and should specify displays for concepts in value sets, and then, if a field is associated with a value set, use the display found in the value set, which is contextualised. Though in an ideal system, I might use a different colour or something for the display if the concept was in the expected value set vs not one that was expected</p>",
        "id": 268443112,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1642534048
    }
]