[
    {
        "content": "<p>Is anyone sending SNOMED CT post co-ordinated expressions in FHIR resources? If so what do you do with the \"slots\" that would have had data when not using post co-ordination. For example in a Procedure resource, if the Procedure.code was post co-ordinated as a \"Change of dressing (procedure)\" post co-ordinated with \"left cheek\" - what would go into Procedure.bodySite?<br>\nI'd be interested in hearing from any members who do use post co-ordinated SNOMED expressions within FHIR, and whether there are advantages or disadvantages of this approach over using the FHIR information model.</p>",
        "id": 153939715,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1519314814
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 153939721,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519316250
    },
    {
        "content": "<p>This is not only relevant for post-coordinated SNOMED CT expressions.  The pre-coordinated ones have Finding Sites etc. as well.  This and other things are being discussed in the SNOMED on FHIR meetings: <a href=\"https://confluence.ihtsdotools.org/display/FHIR/SNOMED+on+FHIR\" target=\"_blank\" title=\"https://confluence.ihtsdotools.org/display/FHIR/SNOMED+on+FHIR\">https://confluence.ihtsdotools.org/display/FHIR/SNOMED+on+FHIR</a></p>",
        "id": 153939774,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1519322750
    },
    {
        "content": "<p>Yes, I was also going to refer to the SNOMED on FHIR discussions - but Daniel beat me to it.  We are working on providing guidance for exactly these sorts of questions.</p>",
        "id": 153939791,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1519324927
    },
    {
        "content": "<p>where we know about this in pre-coordinated systems, we discuss this on the elements - particularly on observation</p>",
        "id": 153939910,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519338288
    },
    {
        "content": "<p>more generally, at the spec level, our advice is that if you populate both, they shall not disagree</p>",
        "id": 153939911,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519338316
    },
    {
        "content": "<p>we have left making further rules to implementation guides. However.... my advice is duplication is better than not duplicating; systems that understand the code will have to choose which to use, but others that don't are not left in the dark</p>",
        "id": 153939916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519338380
    },
    {
        "content": "<p>I'd be also interested to know how to deal with codes that are not post-coordinated. For example, where to put the laterality of the body site. Also, where to place the type of procedure/surgery (e.g. whether primary, revision). Would really appreciate help on these two.  Thanks.</p>",
        "id": 153940113,
        "sender_full_name": "Finnie Flores",
        "timestamp": 1519398864
    },
    {
        "content": "<p>You can use the approach and target body structure extensions to point to BodyStructure when you want a more fine-grained description of what the procedure is doing.  (You can use a contained resource or a distinct resource depending on whether you want to track the site over time.)</p>",
        "id": 153940121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519401065
    },
    {
        "content": "<p>Primary vs. revision would need to be an extension I think.  <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> ?</p>",
        "id": 153940122,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519401120
    }
]