[
    {
        "content": "<p>can any one tell me that which resource can be used for SOAP notes?</p>",
        "id": 153932756,
        "sender_full_name": "kler",
        "timestamp": 1517228355
    },
    {
        "content": "<p>The answer to that question isn't fully nailed down yet.  However the leaning is ClinicalAssessment.</p>",
        "id": 153932761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517229225
    },
    {
        "content": "<p>I'm not sure if that's really the leaning :)</p>",
        "id": 153932763,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517229310
    },
    {
        "content": "<p>Has PatientCare landed on a different approach?</p>",
        "id": 153932764,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517229442
    },
    {
        "content": "<p>Hopefully we'll get some further clarity on that today Q2 in Patient Care.</p>",
        "id": 153932765,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517229468
    },
    {
        "content": "<p>It's been mostly on the back burner lately, but PC wants to try to land it.</p>",
        "id": 153932766,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517229566
    },
    {
        "content": "<p>You might want to check a previous discussion here <a href=\"https://chat.fhir.org/#narrow/stream/implementers/subject/GP.20Encounter.20Report\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/subject/GP.20Encounter.20Report\">https://chat.fhir.org/#narrow/stream/implementers/subject/GP.20Encounter.20Report</a></p>\n<p>And check the attached stuff from the agenda of todays PC meeting that Rob refers to: <a href=\"http://wiki.hl7.org/index.php?title=January_2018_WGM_New_Orleans;_Jan_27_to_Feb_8\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=January_2018_WGM_New_Orleans;_Jan_27_to_Feb_8\">wiki.hl7.org/index.php?title=January_2018_WGM_New_Orleans;_Jan_27_to_Feb_8</a></p>",
        "id": 153932767,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517229570
    },
    {
        "content": "<p>Yes.</p>",
        "id": 153932768,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517229587
    },
    {
        "content": "<p>My current leaning is Composition by the way. I've not yet checked the ClinicalNote thing that's been proposed (saw that this morning in the agenda)</p>",
        "id": 153932769,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517229633
    },
    {
        "content": "<p>I do not really see why structured reporting would be more than a profile on Composition, but I might be missing previously discussed rationales</p>",
        "id": 153932770,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517229716
    },
    {
        "content": "<p>Composition is a way of packaging data into a document.  It doesn't define net new data - that all needs to live in another resource or set of resources.  (And you shouldn't ever <em>have</em> to use documents to share any set of clinical or administrative data.)</p>",
        "id": 153932772,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517229982
    },
    {
        "content": "<p>That's a good part of what we need to discuss and decide - where do we represent the text of a <strong>written</strong> document (for this purpose, as well as others).</p>",
        "id": 153932773,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517230294
    },
    {
        "content": "<p>I think it is safe to say PatientCare doesn't want to use ClinicalAssessment.  I believe the leading candidates at the moment are DocumentReference and Composition.  Structured Document says that Composition can include net new data (in theComposition.section.text element).</p>",
        "id": 153932777,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517230722
    },
    {
        "content": "<p>What Michelle says is, I believe, the current leaning in PC.</p>",
        "id": 153932780,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517231686
    },
    {
        "content": "<p>Any information in FHIR <em>can</em> be represented in a document, but we try to ensure that all FHIR information never <em>has</em> to be conveyed in a document.  So whether we're talking about a discharge summary or a referral or anything else, you can package up all of the information and send it as a message or access the resources by navigating a RESTful resource cloud or over some other paradigm.  I don't understand why this one particular set of data would need to have an exemption from that principle.  At minimum, I think we'd need to take this up with FMG</p>",
        "id": 153932787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517233459
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  you have a .text element that by definition means composition is this source of information.  And I have several comments and followup to get Composition != Document, since I believe this conflation is the source of a lot of confusion.</p>",
        "id": 153932935,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517243991
    },
    {
        "content": "<p>But composition.text is text that is about the compilation of the information.  It's not appropriate to use it to capture an individual assessment.  The semantics of assesment are \"Observe\" not \"collect together\".</p>",
        "id": 153932978,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517248313
    },
    {
        "content": "<p>I'll have to chew on that <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>. The separate journal entry lines are never queried. They are always queried in context to each other. Suppose I really extract the section.text into an Observation, it'll be an Observation (S-O-A-P) that is impossible to look at unless you also get the rest.</p>",
        "id": 153933086,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517258997
    },
    {
        "content": "<p>Similar issue for \"would you ever get the MedicationRequest without the Medication\" or the \"Observation without the Specimen\".  And I'm not sure that it's true that you will <em>ALWAYS</em> want to look at all 4 parts of the SOAP.  Sometimes you might just want to query the \"Plan\" part for example.</p>",
        "id": 153933190,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517272079
    },
    {
        "content": "<p>\"But composition.text is text that is about the compilation of the information.\"  That intent was not communicated clearly at all... That is not how many of us use it or interpret it as.  It looks like a place to stick free text blob for narrative only sections.   I think Alex had a tracker that I have added extensive followup regarding this.</p>",
        "id": 153933195,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517274353
    },
    {
        "content": "<p>We have a challenge that there are multiple perspectives on this.  There are absolutely times where the Composition.text will be the only thing that exists - but that SHOULD happen only when you're dealing with systems that can't/won't encode the data or may not understand what the data is.  From a FHIR architecture perspective, it SHOULD always be possible to represent the information in an appropriate \"semantic\" resource.  That way the information can be expressed in a coded way and queried/manipulated independently of how it might be packaged in a particular document representation.  It may be that convention is that such discrete representation simply isn't \"a thing\" for stuff like SOAP notes.  Or practices might vary by system or by type of note.  But if we have a situation where the only place we can represent fully coded information is within Composition, then we've probably done something wrong.</p>",
        "id": 153933204,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517277883
    },
    {
        "content": "<p>In practice, even notes that could be represented as discrete data often won't be.  Until NLP advances and is widely adopted, plaintext notes are going to be the only place where important information exists.</p>",
        "id": 153933552,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517328791
    },
    {
        "content": "<p>And it isn't only important to pull notes out of an EHR; they also need to go back in.</p>",
        "id": 153933555,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517328826
    },
    {
        "content": "<p>Many clients will be unable and/or users will be unwilling to code the information manually.</p>",
        "id": 153933557,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517328858
    },
    {
        "content": "<p>I agree wholeheartedly on both points!</p>",
        "id": 153933558,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517328860
    },
    {
        "content": "<p>@Lloyd  as I read your interpretation let me rephrase into my crude words:</p>\n<p>Comp is a wrapper for an annotated outline of <em>resources</em>  and .text should not be there.... If I scribble down a few sentences for a progress notes they should be stored in some resource ( clinical impression is my fav) instead of cramming into .section.text... so why the hell is .section.text there.  IMO we've probably ignored this issue too long.</p>",
        "id": 153933586,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517329679
    },
    {
        "content": "<p>Yes, it's definitely been out there for too long.</p>",
        "id": 153933596,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517329905
    },
    {
        "content": "<p>I'm not strongly invested in any one specific solution. But we need <em>something</em> that will hold a note without needing much else.</p>",
        "id": 153933597,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517329949
    },
    {
        "content": "<p>that's important to me too - \"notes\" spans a wide range of contents  from a few paragraphs entered into the patient record through to a carefully constructed document with controlled structured data for exchange with an external party</p>",
        "id": 153933599,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517330120
    },
    {
        "content": "<p>the kinds of solution that work for the first case are not the ones that are suitable for the last case. That difference creates confusion</p>",
        "id": 153933600,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517330158
    },
    {
        "content": "<p>I agree.</p>",
        "id": 153933601,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517330659
    },
    {
        "content": "<p>We have an urgent need for the former.</p>",
        "id": 153933602,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517330681
    },
    {
        "content": "<p>And the latter is handled with C-CDA and Binary.</p>",
        "id": 153933603,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517330760
    },
    {
        "content": "<p>But I don't think anyone wants the overhead of C-CDA for a few paragraphs of text with no other data.</p>",
        "id": 153933604,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517330792
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>   and  <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>   This is strongly suggests to me that there is a tough choice to:</p>\n<ul>\n<li>a single resource that we can point to use for any  kind of scribbles from a provider for any context   So  a  PR goes here a History here and a PE here. </li>\n<li>a directory of resource for  scribbles from a provide for reach context.  History --&gt; obs,  PR --&gt; clinical impression,  phone call --&gt; communication etc.</li>\n</ul>",
        "id": 153933627,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517333519
    },
    {
        "content": "<p>We discussed this during the connectathon, and in Patient Care yesterday. Current leaning is to use DocumentReference to discover these 'notes'. The DocRef could return a pointer to a Binary (PDF, RTF, etc.) or something which support structure (Composition, or Binary-C-CDA)</p>",
        "id": 153933628,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517333644
    },
    {
        "content": "<p>This will allow a client to query for a 'Discharge Summary' with one entry point and then server can provide the format they have</p>",
        "id": 153933629,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517333683
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  did you read the issue above with the creation and representation of the \"de-novo\" content which I refer to as provider 'scribbles' (Cliff notes: It is not supposed to go into .section.text.)</p>",
        "id": 153933630,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517333785
    },
    {
        "content": "<p>and binary provides no context</p>",
        "id": 153933632,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517333826
    },
    {
        "content": "<p>yes (agreeing with Michael)</p>",
        "id": 153933635,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517333887
    },
    {
        "content": "<p>context for binary is provided by the DocRef</p>",
        "id": 153933637,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517333918
    },
    {
        "content": "<p>How does that address creating notes?</p>",
        "id": 153933638,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517333935
    },
    {
        "content": "<p>Maybe I am not fully understanding intent of 'ClinicalImpression' - do we have a list of values for clinicalImpression.code?</p>",
        "id": 153933640,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517334076
    },
    {
        "content": "<p>DocRef is clear for retrieval but not for creation and that is what I keep stumbling over</p>",
        "id": 153933641,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517334082
    },
    {
        "content": "<p>If we can articulate that then I agree could use it.</p>",
        "id": 153933643,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517334126
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191936\">@Michael Donnelly</span>  in clicnialImpression, would you want to exchange as RTF?</p>",
        "id": 153933644,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517334157
    },
    {
        "content": "<p>I guess root question is probably getting better understanding of intended use of Clinicalmpession</p>",
        "id": 153933645,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517334185
    },
    {
        "content": "<p>I don't think anyone should exchange RTF ever.</p>",
        "id": 153933646,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517334202
    },
    {
        "content": "<p>...along with a whole host of other formats we see in NZ GP2GP (transfers of complete primary care records)!</p>",
        "id": 153933653,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1517334260
    },
    {
        "content": "<p>oh, funny, that came up as a use case this weekend.</p>",
        "id": 153933658,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517334375
    },
    {
        "content": "<p>Well over 80% of point-of-care systems that I've seen have free text controls for notes/comments  in every clinical and administrative entry - these are used for both structured and unstructured notes. When this information is exchanged, receiving systems are going to expect to be able to (re)populate the 'notes' in those entries and won't take kindly to having to extract them from aggregations (or external documents).</p>",
        "id": 153933668,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1517334510
    },
    {
        "content": "<p>In the scope and use of ClinicalImpression we say \"An impression is a clinical summation of information and/or an opinion formed, which is the outcome of the clinical assessment process.\"  Assuming that we don't want or intend to change that, the impression is an important part of many (not all) notes, but it definitely is not <strong>the note</strong>.</p>",
        "id": 153933671,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517334557
    },
    {
        "content": "<p>Why is this suggestion hated by implementers?  Sticking the \"de-novo\"  text in the resource .text ?</p>\n<p>~~~</p>\n<p>&lt;Observation xmlns=\"<a href=\"http://hl7.org/fhir\" target=\"_blank\" title=\"http://hl7.org/fhir\">http://hl7.org/fhir</a>\"&gt;<br>\n  &lt;id value=\"foo\"/&gt; <br>\n  &lt;text&gt; &lt;status value=\"additional\"/&gt; &lt;div xmlns=\"http://www.w3.org/1999/xhtml\"&gt;&lt;p&gt; &lt;b&gt;<strong>*</strong><strong>FREE TEXT HERE</strong><strong>*</strong> &lt;/p&gt; &lt;/div&gt; &lt;/text&gt; <br>\n&lt;status value=\"final\"/&gt; <br>\n  &lt;subject&gt; <br>\n    &lt;reference value=\"Patient/example\"/&gt; <br>\n  &lt;/subject&gt; <br>\n  &lt;effectiveDateTime value=\"2016-05-18\"/&gt; <br>\n&lt;/Observation&gt; </p>\n<div class=\"codehilite\"><pre><span></span>\n</pre></div>",
        "id": 153933680,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517335121
    },
    {
        "content": "<p>Shouldn't all the text be populated from 'atomic' data elements in the resource, or is that just for CDA?</p>",
        "id": 153933697,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1517335498
    },
    {
        "content": "<p>This seems to say that in a general \"observation\" (no specific code or value) you can say anything about everything (or vice versa)?</p>",
        "id": 153933710,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517335574
    },
    {
        "content": "<p>If Composition.section.text ist Verboten and every section just consists of the entries that contain the text a reader should read (in the order occurring), how is that helping a reader?</p>",
        "id": 153933713,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517335635
    },
    {
        "content": "<p>Even worse: why would I use Composition at all and not just a pure Bundle of \"Observations\"?</p>",
        "id": 153933721,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517335763
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>  the Composition.text should be a union of all the resource narratives.  This topic is a particular unclear set of guidance in the resource and I think we both commented on that in GForge.</p>",
        "id": 153933725,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517335814
    },
    {
        "content": "<p>let's say there are no nested resources -- could Composition.text contain the Note?</p>",
        "id": 153933730,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517335879
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> Composition is like a table of contents.  Still begs the question what is the section.text is for.</p>",
        "id": 153933731,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517335889
    },
    {
        "content": "<p>Hmm, I don't view Composition as a Table of contents, but we can get to that when we discuss those logged trackers</p>",
        "id": 153933732,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517335913
    },
    {
        "content": "<p>section.text at minimum is just that, might have no entries. Second option is the sum of the entry resources.text. Third option is a mix (just like in CDA). Section.text.type indicates what the sender did</p>\n<p>In any case: section without section.text is pointless to me</p>",
        "id": 153933743,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517336039
    },
    {
        "content": "<p>What I showed Monday was section.text, no entries. Reason: you are never going to query separate journal entries (SOAP) in our context. So although you might envision exposing SOAP Observations, there's no current pressing need to.</p>\n<p>You could compare section.text without entries to CDA Level 2.</p>",
        "id": 153933750,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517336205
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> does SD have updated scope text after Q1 this morning?</p>",
        "id": 153933763,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517338186
    },
    {
        "content": "<p>Joining this a little late:<br>\n<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> The purpose of Composition.section.text (as I understand it) is as follows: The narrative that makes sense when a resource stands alone doesn't always work well when you're rendering it as part of a list of narratives that make up the rendering of a document.  As well there are a couple of additional cases - section resource doesn't have narrative (for whatever reason) and because there was a desire to avoid the overhead of List whenever you had a section that points to a collection of things.  So there is use for it.  However, there's not intended to be any situation where, when FHIR is \"done\", there's content that can <em>only</em> be expressed in Composition.section.text and doesn't have a home in a resource narrative or other discrete resource element.  Composition.text is generally intended to be the rendering of the document's metadata.  So it's generally needed.  For a non-encoded document, it would also represent all other content of the document - and there are legitimate cases for that.  The \"rule\"/\"intent\" of the Composition design (as I understand it) though is that there should never be a situation where the only place that a piece of information <em>can</em> appear is in Composition.text or Composition.section.text and there's no other resource home for that data if someone wants to fully encode.  (There's absolutely situations</p>\n<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> I would like to ensure that we're not limited to only Binary or Composition.  Observation should absolutely be in the list.  And ClinicalImpression too, most likely</p>",
        "id": 153933897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517349513
    },
    {
        "content": "<p>Shall we put that in the definition of section.text  :-)</p>",
        "id": 153933903,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517349667
    },
    {
        "content": "<p>That is not very clarifying Lloyd and this also begs the question of where do the section resource narratives go?  it sounds like you said in section.text instead of the [resource].text ( or both?)  I think appending  in the Composition.text makes sense.</p>",
        "id": 153933912,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517349957
    },
    {
        "content": "<p>If a section has text, you render that in place of the resource narrative.</p>",
        "id": 153933933,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517350683
    },
    {
        "content": "<p>Each MedicationRequest might say \"John Smith (MRN 12345) was prescribed....\".  If you concatenate 5 of those together, that's going to get really annoying.  The Section.text can put together a nice table and wouldn't mention the Patient at all because that'll be handled by rendering the subject hanging off the Composition</p>",
        "id": 153933937,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517350791
    },
    {
        "content": "<p>We are using composition resource to include all resource references.  And one resource is clinical impression, where we can include the \"free text\".</p>",
        "id": 153933940,
        "sender_full_name": "Venkateswara R Davuluri",
        "timestamp": 1517350943
    },
    {
        "content": "<p>Lets keep it simple ... I have one section and one resource.   Where does the narrative for the resource go?  Append to Composition.text, section.text, or [resource].text?</p>",
        "id": 153933944,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517351155
    },
    {
        "content": "<p>Narrative for the resource goes in Resource.text.  If, for some reason, the author of the document feels the narrative needs to be tweaked for use in the document, they put that in Composition.resource.text.  If the document has no resources or sections, the content could go in Composition.text</p>",
        "id": 153933951,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517351481
    },
    {
        "content": "<p>In our system we have the concept of a document that is a mixture of free-text sections, and structured sections that can reference data that lives somewhere else. The free-text sections only exists in that section of the document. There is no other place that is lives other than in the context of that free-text box in the UI that is then stored as a data element of the document. Putting that all in a composition.text doesn't feel structured/interoperable. Doesn't CDA have this concept today? A section has a template id that identifies the type of data in the document that can then have free-text/narrative? Can't we achieve the same thing in composition?</p>",
        "id": 153933958,
        "sender_full_name": "Drew Torres",
        "timestamp": 1517351856
    },
    {
        "content": "<p>We did not say put the text only in Composition.text.  I am only talking about how the narrative for the whole shebang is rendered.</p>",
        "id": 153933962,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517351977
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span> I believe that is the core question over which we proposed a connectathon track</p>",
        "id": 153933964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517352006
    },
    {
        "content": "<p>but it sounds like you are doing it wrong by sticking \"de-novo\" text into section.text.  In other words it needs to live elsewhere based on this chat.</p>",
        "id": 153933965,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517352037
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> sorry I must have misunderstood. In comparing with CDA do you have one huge narrative? Don't style sheets give the nice representations, and just link to the respective sections?</p>",
        "id": 153933968,
        "sender_full_name": "Drew Torres",
        "timestamp": 1517352156
    },
    {
        "content": "<p>sure but this also relates to what gos in section.text and resource.text that are referenced in the section</p>",
        "id": 153933969,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517352247
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> : \"but it sounds like you are doing it wrong by sticking \"de-novo\" text into section.text. In other words it needs to live elsewhere based on this chat.\" - it's not <em>wrong</em>. It's better to put it elsewhere, but it's not something that you SHALL do. I disagree with Drew about the best way to do it in this case, but it's for me to demonstrate the practical advantages I claim that exist. I'm looking forward to the connectathon</p>",
        "id": 153933970,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517352408
    },
    {
        "content": "<p>Interesting. So, your question was more: If I have have a resource that should be referenced in composition.section should the narrative of the resource.text be in section.text or get appended to composition.text. What I would like to see (if possible) a reference to the resource.text from section.text and/or composition.text, but not sure if people would be supportive of that. I don't see a huge advantage in copying the text from the resource, to the section, and finally to the composition.text.</p>",
        "id": 153933973,
        "sender_full_name": "Drew Torres",
        "timestamp": 1517352643
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> noted, I don't plan to restrict to only Binary or Composition for initial testing</p>",
        "id": 153933982,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517353357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<blockquote>\n<p>Narrative for the resource goes in Resource.text. If, for some reason, the author of the document feels the narrative needs to be tweaked for use in the document, they put that in <strong>Composition.resource.text.</strong> If the document has no resources or sections, the content could go in Composition.text</p>\n</blockquote>\n<p>Should Composition.resource.text be Composition.section.text ?</p>",
        "id": 153934022,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517363807
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I'm <em>not</em> saying \"It needs to live elsewhere\".  I'm saying \"It needs to <em>be able to</em> live elsewhere\".  We're not going to force systems to fully encode their content</p>",
        "id": 153934032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517365571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> Yes.  Typo on my part.  Meant Composition.section.text</p>",
        "id": 153934033,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517365611
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Saving discussion on Composition for Scope for Thursday Q3. Regrettably, i won't be there but <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span>  and <span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span>  plan to be.</p>",
        "id": 153934057,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517370570
    },
    {
        "content": "<p>ok</p>",
        "id": 153934113,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517400634
    },
    {
        "content": "<p>I'm sorry I can't make it either. I'm happy with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s statement that \"it's not wrong [to have text in a Composition that is not exposed otherwise]. It's better to put it elsewhere, but it's not something that you SHALL do\".</p>\n<p>I think most of the discussion should be around Composition.text versus Composition.section.text. The interesting thing about Composition is that it's design is to give some 'structure' to text that in turn may be derived from various entries.</p>\n<p>So if the section.text holds the text you need to render, why would you duplicate all that once more in Composition.text. Seems to me Composition.text is probably usually sparsely populated as opposed to .text in other resources.</p>",
        "id": 153934166,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1517412667
    },
    {
        "content": "<p>Composition is special in that the resource has multiple narratives. So we should be clear and explicit about this. And what we should be explicit about is that composition, you must render all the narratives, and there's no need for duplication</p>",
        "id": 153934168,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517412755
    },
    {
        "content": "<p>My point is that it's totally fine in some situations to render an allergy list or a diagnostic report using Composition.text or Composition.section.text - but that's never considered the \"preferred\" way to communicate the resource information.  Even if we only have text, it's \"better\" to capture the individual AllergyIntolerances with narrative only if you can - because then the data shows up in the correct location when someone doesn't query the data as a document.  My belief is that note information and other assessments needs to be handled the same way.</p>",
        "id": 153934171,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517413061
    },
    {
        "content": "<p>Ideally, I agree completely.</p>",
        "id": 153934172,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517413115
    },
    {
        "content": "<p>it seems to me that we have convergence on this point: it's better to do this, but if you can't, you can't</p>",
        "id": 153934173,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517413115
    },
    {
        "content": "<p>Right.</p>",
        "id": 153934174,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517413121
    },
    {
        "content": "<p>Discrete data are always better than plaintext when you know the discrete values.</p>",
        "id": 153934179,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517413199
    },
    {
        "content": "<p>And I think Lloyd's trying to build on this with something like \"plaintext packed into otherwise-empty domain-appropriate resources is better than plaintext packed into sections of a document.\"</p>",
        "id": 153934181,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517413300
    },
    {
        "content": "<p>the question is whether you have context/metadata/provenance about the resource that makes it possible to have a separate resource</p>",
        "id": 153934182,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517413351
    },
    {
        "content": "<p>Indeed.</p>",
        "id": 153934183,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517413360
    },
    {
        "content": "<p>I can get behind that too.</p>",
        "id": 153934184,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517413389
    },
    {
        "content": "<p>Interesting, generic article about textual data at <a href=\"https://www.ewsolutions.com/variations-textual-data/\" target=\"_blank\" title=\"https://www.ewsolutions.com/variations-textual-data/\">https://www.ewsolutions.com/variations-textual-data/</a></p>",
        "id": 153934367,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1517430998
    },
    {
        "content": "<p>I'd like to see the current ClinicalNote proposal (<a href=\"http://wiki.hl7.org/index.php?title=ClinicalNote_FHIR_Resource_Proposal\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=ClinicalNote_FHIR_Resource_Proposal\">http://wiki.hl7.org/index.php?title=ClinicalNote_FHIR_Resource_Proposal</a>) advanced, or at least discussed, and would be willing to contribute to whatever work is required to add it to the list of resources. What would it take to get this onto an agenda for the January 2019 San Antonio WGM?</p>",
        "id": 154021435,
        "sender_full_name": "Mike Henderson",
        "timestamp": 1543446194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span></p>",
        "id": 154021526,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543482411
    },
    {
        "content": "<p>Thanks Mike and Grahame -- Patient Care and Structured Documents discussed creating a new clinical notes resource, several times. <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  can probably point you to the minutes of several of these discussions, if you are interested. In more then one session we compared the potential new resource to Composition/DocumentReference/DiagnosticReport and found it quite difficult to differentiate when a system would use each. Fortunately, the Argonaut participants picked up the problem of  'exchanging Clinical Notes' and hosted a connectathon in May and September this year, and have decent design for exchange any clinical notes. -- no design is perfect, but please check it out and let us know what you think - <a href=\"https://argonautproject.github.io/clinicalnotes/guidance.html#resource-selection\" target=\"_blank\" title=\"https://argonautproject.github.io/clinicalnotes/guidance.html#resource-selection\">Argonaut Clincal Notes </a>. <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  and I presented some of this design at the Septemebr Work group and put much of the design in the HL7 ballot US Core.</p>",
        "id": 154021654,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1543498205
    },
    {
        "content": "<p>I'll just add that we do have a quarter (Tues Q2) at the Jan 2019 WGM planned to discuss clinical notes.  It is a joint quarter with Patient Care hosting OO (who owns DiagnosticReport), II, and SD (who owns DocumentReference).  I'm chairing this quarter.  The exact agenda isn't nailed down yet, but I suspect it will be a continuation of the strategy that Argonaut has started (i.e. which pieces of the IG need to be folded back into the core FHIR spec).  I presented at DevDays on ClinicalNotes and there was some additional feedback to share, but I don't foresee Patient Care pursuing a new resource.</p>",
        "id": 154021666,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1543499374
    }
]