[
    {
        "content": "<p>There was quite some interest at HIMSS about Social Determinants of Health, and what these look like in FHIR. Lots of people asked me about this. I wrongly thought we had some work in train... but we don't.</p>",
        "id": 159041078,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550725171
    },
    {
        "content": "<p>There is work happening through ONC (?I think) led by <span class=\"user-mention\" data-user-id=\"193423\">@Evelyn Gallego</span> to capture this but Evelyn (or someone else - it's amazing how many interactions I had at HIMSS) told me that this interest is fairly narrow, focused on Payor interests - which is not the same set of data s other interest groups</p>",
        "id": 159041170,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550725253
    },
    {
        "content": "<p>it overlaps with ODH (<a href=\"https://build.fhir.org/ig/HL7/us-odh/\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/us-odh/\">https://build.fhir.org/ig/HL7/us-odh/</a>), or relates to it (<span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> led that)</p>",
        "id": 159041186,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550725289
    },
    {
        "content": "<p>Who would own this in HL7 (which WG?)</p>",
        "id": 159041189,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550725306
    },
    {
        "content": "<p>Is there enough interest in this to drive a community? A Zulip stream? An HL7 project. Evelyn, can you describe what the project your are involved with is doing? - thanks</p>",
        "id": 159041244,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550725367
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> We work some of the marquee SDOH-specific software vendors. I'm happy to intro you, or outline their high level EHR-integration needs.</p>",
        "id": 159077762,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1550763772
    },
    {
        "content": "<p>SDOH is closely tied to all the Questionnaire work in Argo, SDC and PRO</p>",
        "id": 159090461,
        "sender_full_name": "Eric Haas",
        "timestamp": 1550772775
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194031\">@Nick Hatt</span> I'm happy to be introduced, but introducing them the community doing the work is more relevant.</p>",
        "id": 159105122,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550783839
    },
    {
        "content": "<p>I've asked Evelyn to detail how to get involved</p>",
        "id": 159105134,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550783850
    },
    {
        "content": "<p>MITRE would like to be involved. We have plenty of clinical talent in this area. We need to build a group of like-minded diverse interests. FHIR Fast Track???</p>",
        "id": 161103557,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1552949306
    },
    {
        "content": "<p>THis could be work that CBCP could focus on.  Social Determinants are a big part of Community Based Care</p>",
        "id": 161103592,
        "sender_full_name": "David Pyke",
        "timestamp": 1552949380
    },
    {
        "content": "<p>Hi All,<br>\nI'm looking to capture various social determinants of health for a project that I'm currently working on and was hoping to get some guidance from the community on the best approach. From the Gravity project, it appears they are using the Observation resource to capture this type of information. Have other followed a similar approach? Has anyone used a resource other than Observation? <br>\nThanks</p>",
        "id": 252678053,
        "sender_full_name": "Inderpal Singh",
        "timestamp": 1631214310
    },
    {
        "content": "<p>Actually, Gravity uses a mixture of 3 resources - QuestionnaireResponse for raw data capture; Observation for specific data points, scores, etc.;  and Condition for long-term tracking and management of patient state/problems</p>\n<p>What other resources were you evaluating?</p>",
        "id": 252689799,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631219277
    },
    {
        "content": "<p>QuestionnaireResponse is what I was originally evaluating and thought would be the best fit for the data I was trying to capture. I looked into Observation as well but I have not considered Condition. I'll take another look at the Gravity IG and review those resources. </p>\n<p>Thank you!</p>",
        "id": 252695579,
        "sender_full_name": "Inderpal Singh",
        "timestamp": 1631221480
    },
    {
        "content": "<p>Be aware that while QuestionnaireResponse is useful for capture, it's pretty useless for query.</p>",
        "id": 252796682,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631284626
    },
    {
        "content": "<p>How do these link together? Or just different states in the workflow?</p>",
        "id": 252861533,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1631314591
    },
    {
        "content": "<p>An Observation can have a derivedFrom link to QuestionnaireResponse and Condition can have 'evidence.detail' that points to either Observation or QuestionnaireResponse.</p>",
        "id": 252863464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631315914
    },
    {
        "content": "<p>I think QuestionnaireResponses are just fine for many kinds of queries :-)</p>",
        "id": 252881631,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1631335133
    },
    {
        "content": "<p>Okay so I'm imagining an observation being automatically generated by a questionnaireresponse and then created as a condition after clinician review</p>",
        "id": 252911672,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1631369093
    },
    {
        "content": "<p>You can query QuestionnaireResponses by patient, by Questionnaire type and by date.  But you <em>can't</em> query QuestionnaireResponses by the data they contain.  So if you're looking for particular diagnoses, allergies, medications, etc., QuestionnaireResponse isn't going to cut it and you'll need to extract the information into Conditions, AllergyIntolerances, MedicationStatements in order for it to be searchable.</p>\n<p>In Gravity, they auto-generate the Condition as 'unconfirmed' with a 'Device' author, inferred from a QuestionnaireResponse.  A human can then update it to confirm it and become the author after human review.</p>",
        "id": 252918345,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631375953
    }
]