[
    {
        "content": "<p>Is there a FHIR resource anyone has found to meet the needs of the countries where there is a social healthcare system in place, and the patient is going to have coverage provided by the government? Are you using Coverage? Is there another resource I should reference for medical coverage provided by a government?</p>",
        "id": 191671402,
        "sender_full_name": "Sean O'Quinn",
        "timestamp": 1585083473
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"274876\">Sean O'Quinn</span> <a href=\"#narrow/stream/179166-implementers/topic/Social.20Healthcare/near/191671402\" title=\"#narrow/stream/179166-implementers/topic/Social.20Healthcare/near/191671402\">said</a>:</p>\n<blockquote>\n<p>Is there a FHIR resource anyone has found to meet the needs of the countries where there is a social healthcare system in place, and the patient is going to have coverage provided by the government? Are you using Coverage? Is there another resource I should reference for medical coverage provided by a government?</p>\n</blockquote>\n<p>What is a social healthcare system?<br>\nIn Europe you have several flavours of government-paid healthcare.</p>",
        "id": 191674204,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585084922
    },
    {
        "content": "<p>There's two options.  You could just include the jurisdictional health number as a Patient.identifier and the existence of that identifier alone is sufficient for systems to infer the existence of coverage.  Alternatively, you can use Coverage.  Whether the financial responsibility is managed by the state or by a commercial enterprise shouldn't much matter to the applicability of the resource.  (If you find a situation where that's not true, please holler :) )</p>",
        "id": 191684829,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585091907
    },
    {
        "content": "<p>You have confirmed the conclusion my team has made. We provide national aliases as Patient.identifiers, and we are planning to use Coverage for specific government health care financial responsibility coverage. <br>\nSocial healthcare systems like UK, Sweden, Canada, and Denmark to name a few.</p>",
        "id": 191692047,
        "sender_full_name": "Sean O'Quinn",
        "timestamp": 1585098283
    }
]