[
    {
        "content": "<p>Is anyone using Device / DeviceDefinition to describe software or software components?</p>",
        "id": 161800664,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553632731
    },
    {
        "content": "<p>I was at one stage, and would again if I was maintaining an app registry</p>",
        "id": 161801976,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553633806
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Did you mean DeviceDefinition?  (Don't think we have DeviceInstance)</p>",
        "id": 161802475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553634178
    },
    {
        "content": "<p>Yes, DeviceDefinition.</p>",
        "id": 161804213,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553635348
    },
    {
        "content": "<p>I presume that since DeviceDefinition is the definitional part, I would use DeviceDefinition to say \"this is what my software does\".<br>\nIs that also the right one to express IHE actors (systems that have a definition, must support a couple of transactions, ...)</p>",
        "id": 161804527,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553635571
    },
    {
        "content": "<p>is there no overlap with capabilityStatement (when used to express capability?) Just to make sure</p>",
        "id": 161804569,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553635617
    },
    {
        "content": "<p>I don't have a strong feel for where/if DeviceDefinition will fit into the software space.  CapabilityStatement is much more descriptive from a FHIR software perspective.</p>",
        "id": 161805562,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553636464
    },
    {
        "content": "<p>so if we want to define an IHE actor, seems we have 2 choices: either an actor is defined by a DeviceDefinition which is conformant to a CapabilityStatement, or the actor IS a CapabilityStatement.  latter sounds better but i must play with it</p>",
        "id": 161806506,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553637304
    },
    {
        "content": "<p>what is the value added by the DeviceDefinition there?  Asked another way, What is missing in CapabilityStatement for describing an IHE Actor?  I agree DeviceDefinition is needed to describe software, but an IHE Actor is an abstraction specific to Interoperability requirements.  I think if we could identify the gap, it could be used to improve CapabilityStatement. Or where that gap is necessary functional or non-functional requirements we can define the tipping point for when a CapabilityStatement alone is not sufficient. Is that the thinking?</p>",
        "id": 161856496,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553691743
    },
    {
        "content": "<p>It may be that CapabilityStatement should point to DeviceDefinition in place of the 'software' element to capture name, version, releaseDate.  Though it turns out there's no home for releaseDate and the only extra stuff I see there that might be relevant are manufacturer and perhaps language.</p>",
        "id": 161871111,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553700718
    },
    {
        "content": "<p>That is a use-case for CapabilityStatement for a kind of Instance or Capability. I think Jose is focused on \"Requirements\", which is the IHE-Actor form of CapabilityStatement. In this case it is an abstraction, not an instance or a functionally complete capability. Hence why I am wondering what is missing for an IHE-Actor when CapabilityStatement is kind of Requirements.</p>",
        "id": 161872421,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553701614
    },
    {
        "content": "<p>Software isn't about an instance, it's about a \"kind\" of software.   The typical description we've provided is \"shrink-wrapped\".  Though I agree that wouldn't meet the need for a specification.   I'm not sure it makes sense to use DeviceDefinition for something that, in EHR equivalant terms, would be like saying \"I have a device that can measure systolic and diastolic blood pressure\" without differentiating whether it's cuff-based, involves pressure sensors in the blood stream or uses some other totally different technology.</p>",
        "id": 161873952,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553702443
    },
    {
        "content": "<p>I want to make some sense of the possible overlap from the monday discussion. <br>\nIf CapabilityStatement is ok for us to define a \"thing\" that has a series of functionalities, that is fine; if we need to consider extensions, that is also fine, and if we need to use DeviceDefinition (which is still Maturity 0), that would also work.</p>",
        "id": 161884627,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553709617
    },
    {
        "content": "<blockquote>\n<p>It may be that CapabilityStatement should point to DeviceDefinition in place of the 'software' element to capture name, version, releaseDate.  Though it turns out there's no home for releaseDate and the only extra stuff I see there that might be relevant are manufacturer and perhaps language.</p>\n</blockquote>\n<p>There's .version, which I'd say is more common/better than Release Date.</p>",
        "id": 161885038,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553709933
    },
    {
        "content": "<p>There is also the Endpoint resource, which covers more than just FHIR systems, and also includes the usages of the system, not just the capabilities. e.g. Clinical record, Patient Administration Record, Client Portal, Radiology system, referrals triage, XDS Repository, HL7v2 gateway, DICOM-RS ...<br>\nGetting the granularity of that description will have to build over time, and don't know that this is in the Device/DeviceDefinition either.<br>\nWill be discussing some of this on the PA call today/tomorrow.</p>",
        "id": 162417099,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1554288040
    },
    {
        "content": "<p>Ok so we have 3 options to select from.</p>",
        "id": 162419572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554290573
    },
    {
        "content": "<p>endpoint seems interesting, not sure if it is a) an instance (e.g. this endpoint from this provider which conforms to an IHE profile), b) a definition (e.g. the IHE actor) or c) if that distinction matters.</p>",
        "id": 162419804,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554290795
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> can you please post results you find interesting here? I will bring up any ideas to the workflow call next monday.</p>",
        "id": 162419828,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554290826
    },
    {
        "content": "<p>This is an instance, its pointing at a real thing that you would be expected to access.<br>\nIts the directory entry that says that this origanization is exposing its v2 server here for example.</p>",
        "id": 162420565,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1554291420
    },
    {
        "content": "<p>ok then it seems that we are down to 2 for defining an IHE actor</p>",
        "id": 162420586,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554291447
    },
    {
        "content": "<p>...for now :)</p>",
        "id": 162420877,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554291683
    }
]