[
    {
        "content": "<p>Hi!</p>\n<p>I'm wondering about references in resources connected to critical information. In the Norwegian standardization of critical information it is said that most critical information must be referred to by a code defined in the Volven code system. I'm looking at fields like asserter to reference to whom reported the critical information. In the specc asserter is reference to Patient, RelatedPerson, Practioneer, but as stated we do this by code.</p>\n<p>Am I breaking conformance by using a CodeSystem? What can be used with e.g Procedure (using for Device and not the Procedure it self)?</p>\n<p>Here is what I tried to make it look like. We are offering this resource on our server as well.</p>\n<p>\"asserter\": {<br>\n  \"reference\": \"CodeSystem?system=urn:uid:2.16.578.1.12.4.1.1.7519|1\"<br>\n}</p>\n<p>// Thomas</p>",
        "id": 153961873,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1526477155
    },
    {
        "content": "<p>asserter can't be a code - what makes it a code system?</p>",
        "id": 153961900,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526478500
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> As I mentioned, it is the definition by the Norwegian Standardization. We use codes from Volven on this. Reporter will be e.g Observed by treating doctor, result from tests etc. We don't use it the same way as in spec. You have any other ideas of how to use this? Trying to remove an extension here :) I guess I could try suggesting this as a CR</p>",
        "id": 153963776,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1526744604
    },
    {
        "content": "<p>this is still confusing; the asserter is a reference to a instance of a person, not a type of a person in a code system</p>",
        "id": 153963784,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526822438
    },
    {
        "content": "<p>Maybe that is the value that could be used in the practitionerrole.role property.</p>",
        "id": 153963790,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1526825180
    },
    {
        "content": "<p>Could always make an implementation specific extension.  Not sure how you can code all the performers.  There are type codes for a kind of performer and identifiers for actual living breathing performers.    For the latter you will still use Reference.</p>",
        "id": 153963985,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526949074
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Exactly, that's why I'm asking. Doctors aren't logging the 'who' on who observed or confirmed the information. They save an int 1 - 7 and that code refers to the general idea on who observed the case. So if there is nothing today, then maybe there is room for expanding the allowed reference?</p>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I was trying to avoid the extension obviously, cause we are still referring to the same general meaning of the observer, but there is no data on the actual person. </p>\n<p>Is Norway the only one with this approach to this way of confirming critical information on a patient? In that case I guess extension is the only way to go.</p>",
        "id": 153964022,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1526967751
    },
    {
        "content": "<p>well, nothing right now. You could create a task asking for that. but I've not seen it elsewhere personally. But it's definitely something we should cater for on Provenance</p>",
        "id": 153964039,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526976442
    },
    {
        "content": "<p>I am not sure I understand fully what is being discussed. What I think I hear is that the Provenance.agent.who can only be identified as a role, not an individual? In that case can it be a PractitionerRole that has no values n PractitionerRole.practitioner? Possibly a contained PractitionerRole?</p>",
        "id": 153964081,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526992787
    },
    {
        "content": "<p>actually, in Provenance, now that I actually look (!), it looks like this is covered by Provenance.agent.role</p>",
        "id": 153964082,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526992856
    },
    {
        "content": "<p>except that you must have a who. that was what I figured was the problem</p>",
        "id": 153964083,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526993003
    },
    {
        "content": "<p>given the purpose of Provenance is to capture Who, What, Where, When, and Why... the Who value is especially important for the concept of Provenance.</p>",
        "id": 153964084,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526993046
    },
    {
        "content": "<p>oh right. well, if you don't have it, and just have a role... that's still useful, right?</p>",
        "id": 153964085,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526993193
    },
    {
        "content": "<p>I think that this is the kind of use case that would make agent.who optional</p>",
        "id": 153964086,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526993212
    },
    {
        "content": "<p>possibly.. but I am not sure what the value of a Provenance with only one agent and only an agent.role... What value is provided? I might be convinced, but it is not clear to me.</p>",
        "id": 153964088,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526994090
    },
    {
        "content": "<p>more value than if you can't say anything at all , but less value than if you can identify the agent</p>",
        "id": 153964123,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527010870
    },
    {
        "content": "<p>I don't think I quite understand the practical use of Provenance. In this case the resource that needs an asserter must be able to refer to a Provenance resource? </p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> You are right that the issue is that a 'who' is required instead of a general idea of the person which observed the condition. I would required a simple 1..1 Coding as asserter.</p>",
        "id": 153964625,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1527183624
    },
    {
        "content": "<p>Provenance, the link is the other way around - Provenance refers to the resource</p>",
        "id": 153964636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527184548
    },
    {
        "content": "<p>That is what I thought, so I couldn't fit how it would fit the use case where a role would be the asserter on a resource. The role of how a resource was observed is very relevant especially for older data. Would be interesting if at least a resource could have a reference to a code that could describe the case. Not sure how to formulate it in a general way though.</p>",
        "id": 153964640,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1527185068
    },
    {
        "content": "<p>What would the proper way of using provenance for only parts of a resource be? I'm in a situation where I specifically need provenance on a Patients telecom, communication and address - individually. My idea is to make an identifier extension on the elements telecom, communication and address  and then provide that Identifier in the Provenance.target for each of the three elements. I don't find this design super awesome, but I should work, right?</p>",
        "id": 153986277,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534246609
    },
    {
        "content": "<p>The Provenance is recorded for each update of the target resource, thus showing each update provenance. This is focused on revision provenance, not element level provenance. This has been the scope to this point for Provenance. There are edge cases, such as yours, that have not been seen as within 80% of what systems do today.   I would be glad to work with you on some extensions to support the usecase, so that others can experiment with you.</p>",
        "id": 153986289,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534249169
    },
    {
        "content": "<p>Just as I would expect. My case (if we go into more of the gory details) is that I'm interfacing a custom Web service that serves me CDA documents with custom extensions and custom elements (all out of my control) - among these are relatives, languages and telecom. Each of these custom elements also have 'dataEnterer' field that supposedly provides a record of who has entered this information. Now, I'm mapping this document into FHIR resources and all of these fields fits nicely into the Patient resource . I just also need model the provenance part which requires me to find some kind of mapping on the element level - and that is why I thought that providing the elements with Identifiers and then reference them from the Provenance resource could be a way out for me. So essentially a ProvenanceIdentifierExtension on the elements</p>",
        "id": 153986295,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534249906
    },
    {
        "content": "<p>That might work. I do expect this kind of need to be mostly on the Patient resource. Most other resources tend to be single source.  So it would also be good to think about how widely needed this extension is, not to limit the use but to best characterize the need.  A resource that is an amalgamation of information from many sources is nice for readers, but is complicated for create/update/delete.</p>",
        "id": 153986300,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534250967
    },
    {
        "content": "<p>I thought I asked a similar question before, <a href=\"#narrow/stream/4-implementers/topic/Pop.20Health.3A.20Person.20vs.20Patient.20vs.20Provenance\" title=\"#narrow/stream/4-implementers/topic/Pop.20Health.3A.20Person.20vs.20Patient.20vs.20Provenance\">https://chat.fhir.org/#narrow/stream/4-implementers/topic/Pop.20Health.3A.20Person.20vs.20Patient.20vs.20Provenance</a>, and the response (at the time) was:</p>\n<blockquote>\n<p>the target on a provenance can have a fragment identifier, and so indicate a particular piece of information in the resource</p>\n<p>&lt;address id=\"23\"&gt;<br>\n &lt;blah...&gt;<br>\n &lt;/address&gt;</p>\n<p>&lt;Provenance&gt;<br>\n &lt;target value=\"....#23\"&gt;<br>\n &lt;Provenance&gt;</p>\n</blockquote>",
        "id": 153986341,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1534257670
    },
    {
        "content": "<p>Will that work? I would be happy if someone would write that up in a CR for improvement of the Provenance notes. The concern this brings for me is ho do I identify multiple elements in the Patient resource that -this- Provenance is describing? Does this Provenance.target hold many fragment identifiers? If so, are they all fully specified? Does this survive outside a transaction into persistence?</p>",
        "id": 153986345,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534258288
    },
    {
        "content": "<p>Well, fragment Identifiers to my knowledge are not fully qualified - so that won't fit the bill, unless I molest it and code some magic 'separators' into the ID. So I guess the proper way to do it would be to make an extension containing an Identifier</p>",
        "id": 153988346,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534500518
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Did anyone log that CR you asked about (Aug 14, 2018 - above)?  We have a situation now where we want to convey this Procedure, for example, was extracted from a specific service line item within Claim or ExplanationOfBenefit.  In the earlier examples (from 2018), there was a suggestion to use a fragmented identifier in the Provenance.target, but in my new example, the ask would be can we use a fragment identifier in the Provenance.entity.what?  In both cases, it would be nice to have some additional guidance or examples in Provenance.</p>",
        "id": 161448237,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1553262094
    },
    {
        "content": "<p>No one entered that CR. I agree that Provenance.entity.what might need clarificaiton. Can we put fragment identifiers into a Reference datatype? Or will there need to be an additional element(s) added to Provenance.entity?</p>",
        "id": 161448384,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553262241
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20583\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20583\">GF#20583</a> has been logged</p>",
        "id": 161449060,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1553262712
    },
    {
        "content": "<p>I thought <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  had suggested using fragment identifiers in that prior thread where Provenance.target is also a Reference data type (<a href=\"#narrow/stream/179166-implementers/topic/Pop.20Health.3A.20Person.20vs.20Patient.20vs.20Provenance\" title=\"#narrow/stream/179166-implementers/topic/Pop.20Health.3A.20Person.20vs.20Patient.20vs.20Provenance\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Pop.20Health.3A.20Person.20vs.20Patient.20vs.20Provenance</a>).  It was an older discussion, so not sure if that is still true or not.  It's a recurring question for me (on the pop health side), so hopefully <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20583\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20583\">GF#20583</a> will lead to some clarity on the recommended approach</p>",
        "id": 161449395,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1553262946
    },
    {
        "content": "<p>it would be an extension to clarify a particular element in the source, because reference is constrained to point to a whole resource. I don't think we actually defined the extension though</p>",
        "id": 161484548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553289233
    },
    {
        "content": "<p>can you help me with how that would look?</p>",
        "id": 161485397,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553289870
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><span class=\"p\">{</span>\n  <span class=\"nt\">&quot;resourceType&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Provenance&quot;</span><span class=\"p\">,</span>\n  <span class=\"nt\">&quot;target&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n    <span class=\"nt\">&quot;reference&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Observation/xxxxx&quot;</span><span class=\"p\">,</span>\n    <span class=\"nt\">&quot;extension&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n      <span class=\"nt\">&quot;url&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;http://hl7.org/fhir/StructureDefinition/targetElement&quot;</span><span class=\"p\">,</span>\n      <span class=\"nt\">&quot;valueUrl&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;#a1&quot;</span>\n    <span class=\"p\">}]</span>\n  <span class=\"p\">}]</span>\n<span class=\"p\">}</span>\n</pre></div>",
        "id": 161485574,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553290014
    },
    {
        "content": "<p>where there's an element in the target observation with id=\"a1\" on it</p>",
        "id": 161485602,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553290036
    },
    {
        "content": "<p>so the hash tag concept is well enough defined? I am simply showing my ignorance. It seems clear to me.</p>",
        "id": 161485704,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553290128
    },
    {
        "content": "<p>I think it is pretty clearly defined, except for 2 things:<br>\n- we didn't define the extension<br>\n- you need an id in the resource. There's been some interest in referring to an element by it's path, but it's not clear whether you'd use xpath, jsonpath, or fhirpath</p>",
        "id": 161493237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553296987
    },
    {
        "content": "<p>should FHIR-I be assigned to resolve this? Seems the better SME</p>",
        "id": 161645200,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553522243
    },
    {
        "content": "<p>is there a task?</p>",
        "id": 161681828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553544031
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20583\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20583\">GF#20583</a></p>",
        "id": 161692573,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553551660
    },
    {
        "content": "<p>And we'd like to use that in the VerificationResult resource too - and replace/update the targetLocation property.</p>",
        "id": 162426238,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1554296230
    },
    {
        "content": "<p>I think it should be a list of target elements:</p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;resourceType&quot; : &quot;Provenance&quot;,\n  &quot;target&quot; : [{\n    &quot;reference&quot; : &quot;Observation/xxxxx&quot;,\n    &quot;extension&quot; : [{\n        &quot;url&quot; : &quot;http://hl7.org/fhir/StructureDefinition/targetElements&quot;,\n        &quot;extension&quot; : [{\n            &quot;url&quot; : &quot;element&quot;,\n            &quot;valueUrl&quot; : &quot;#a1&quot;\n          },\n         {\n            &quot;url&quot; : &quot;element&quot;,\n            &quot;valueUrl&quot; : &quot;#b52&quot;\n          }]\n    }]\n  }]\n}\n</pre></div>\n\n\n<p>because usually more than one element would come from a certain source - and I don't think we want multiple Provenance just for that</p>",
        "id": 164583578,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1556664406
    },
    {
        "content": "<p>This should also be consistent with OperationOutcome location which points to a specific field in the resource (which is how VerificationResult currently does it)</p>",
        "id": 164583700,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1556664534
    },
    {
        "content": "<p>Using the element ids is much easier for a client - parsing FHIR paths and getting the element they reference is not trivial</p>",
        "id": 164583833,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1556664664
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><span class=\"p\">{</span>\n  <span class=\"nt\">&quot;resourceType&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Provenance&quot;</span><span class=\"p\">,</span>\n  <span class=\"nt\">&quot;target&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n    <span class=\"nt\">&quot;reference&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Observation/xxxxx&quot;</span><span class=\"p\">,</span>\n    <span class=\"nt\">&quot;extension&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n      <span class=\"nt\">&quot;url&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;http://hl7.org/fhir/StructureDefinition/targetPath&quot;</span><span class=\"p\">,</span>\n      <span class=\"nt\">&quot;valueString&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;context.name&quot;</span>\n    <span class=\"p\">}]</span>\n  <span class=\"p\">}]</span>\n<span class=\"p\">}</span>\n</pre></div>\n\n\n<p>where <a href=\"http://context.name\" target=\"_blank\" title=\"http://context.name\">context.name</a> is a FHIRPath. We would restrict that to the simple subset (<a href=\"http://hl7.org/fhir/fhirpath.html#simple\" target=\"_blank\" title=\"http://hl7.org/fhir/fhirpath.html#simple\">http://hl7.org/fhir/fhirpath.html#simple</a>), or maybe even more restricted.</p>",
        "id": 164876203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556987160
    },
    {
        "content": "<p>use that alternative if you can't put an id in theresource</p>",
        "id": 164876252,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556987175
    },
    {
        "content": "<p>also - we could do it as a list of target elements, as Michele put above - that would be legal, but it would be a departure from our usual way of doing extensions, which would just be this, as I showed earlier:</p>",
        "id": 164876433,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556987439
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><span class=\"p\">{</span>\n  <span class=\"nt\">&quot;resourceType&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Provenance&quot;</span><span class=\"p\">,</span>\n  <span class=\"nt\">&quot;target&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n    <span class=\"nt\">&quot;reference&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Observation/xxxxx&quot;</span><span class=\"p\">,</span>\n    <span class=\"nt\">&quot;extension&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n      <span class=\"nt\">&quot;url&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;http://hl7.org/fhir/StructureDefinition/targetElement&quot;</span><span class=\"p\">,</span>\n      <span class=\"nt\">&quot;valueUrl&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;#a1&quot;</span>\n    <span class=\"p\">}]</span>\n  <span class=\"p\">}]</span>\n<span class=\"p\">}</span>\n</pre></div>",
        "id": 164876438,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556987454
    },
    {
        "content": "<p>just repeat the extension if you have more ids</p>",
        "id": 164876448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556987468
    },
    {
        "content": "<p>OK, thanks, good for me</p>",
        "id": 164878658,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1556990713
    },
    {
        "content": "<p>Should I create a tracker?</p>",
        "id": 164919564,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1557063116
    },
    {
        "content": "<p>yes please</p>",
        "id": 164920856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557065213
    },
    {
        "content": "<p>Done - <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=21284\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=21284\">GF#21284</a></p>",
        "id": 164922230,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1557067381
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195227\">@Thomas Johansen</span>  Just for the record: The FHIR-profiles for critical information is now being cleaned up and moved to R4, and in the same time more compatible with International Patient Summary. It will now reffer to a \"real\" Practitioner (etc) from Recorder/Asserter (like in AllergyIntolerance). </p>\n<p>We do have an issue that we want a reference to a \"recording organization\", hopefully without using an Encounter or a hard profiled PractitonerRole. I'll probably open this issue as a new thread. </p>\n<p>Now that Forge R4 is out, drafts will be available in a week. Please contact me for any questions and/or if you want to contribute. Dugnad!</p>",
        "id": 165159527,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1557319913
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span>, Forge R4 is pretty stable but thare are a couple of rough edges I'd like to fix/improve, e.g. type slicing. Feel free to contact me if you run into trouble, or if you have suggestions for improvement.<br>\nCheers, Michel</p>",
        "id": 165198938,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1557347903
    },
    {
        "content": "<p>Regarding <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=21284\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=21284\">GF#21284</a>:</p>\n<blockquote>\n<p>Add two extensions <a href=\"http://hl7.org/fhir/StructureDefinition/targetElement\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/targetElement\">http://hl7.org/fhir/StructureDefinition/targetElement</a> and <a href=\"http://hl7.org/fhir/StructureDefinition/targetPath\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/targetPath\">http://hl7.org/fhir/StructureDefinition/targetPath</a> that specify the element that come from the Provenance in the target resource.</p>\n<p>Both extensions apply to the <code>target</code> element, the first one has a valueUri with the id of the target element, the second has a valueString containing a simplified FHIRPath specifying how to get to the element.</p>\n</blockquote>\n<p>For repeating elements, such as Patient.address, does FHIRPath allow us to specify a single address?  If so, can you show an example?  If not, then it sounds like we're concluding if there is different provenance for each repeating element (e.g. each address was from a different source), then we're forced to use targetElement with an id.</p>",
        "id": 165847688,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1558039519
    },
    {
        "content": "<p>You mean point to a specific repetition?  Just specify the repetition you want in brackets.  E.g. Patient.address[0] for the first one.  That said, be cautious about referring to specific repetitions for elements whose semantics is unordered.</p>",
        "id": 165848668,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558040341
    },
    {
        "content": "<p>(which is the case for Patient.address)</p>",
        "id": 165848685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558040353
    },
    {
        "content": "<p>Yep, that is what I was asking.</p>",
        "id": 165848975,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1558040608
    },
    {
        "content": "<p>I created <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23076\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23076\">GF#23076</a> to drive adding narrative description of this extension within Provenance given that it is very much in demand for Provenance, and an example showing the use. I request FHIR-I assist with the writing of this narrative and creation of this example.</p>",
        "id": 172861098,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565364961
    },
    {
        "content": "<p>Here is an example from our server (where we did implement the feature): <a href=\"/user_uploads/10155/_crtX3CB9bYTzElaQM28cM51/ExampleProvenance.zip\" target=\"_blank\" title=\"ExampleProvenance.zip\">ExampleProvenance.zip</a><br>\nIt is a Patient with data coming from two different sources - represented by two Provenance resources</p>",
        "id": 172862290,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1565365823
    },
    {
        "content": "<p>thanks.  so you used only targetElement extension, and in target id tagged elements. This seems like the one most would use. I will attach this zip to the new CR so that when the extension is added can derive off of this. This is very helpful.</p>",
        "id": 172863196,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565366465
    },
    {
        "content": "<blockquote>\n<p>I created <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23076\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23076\">GF#23076</a> to drive adding narrative description of this extension within Provenance given that it is very much in demand for Provenance, and an example showing the use. I request FHIR-I assist with the writing of this narrative and creation of this example.</p>\n</blockquote>\n<p>I have tried to make an extension for the targetElement, but had to include information about the old and new value of the element because the people making the specification of our Provenance needs to document that part as well. If any of you want to review it is is available in our simplifier project.<br>\nextension: <a href=\"https://simplifier.net/Grunndata-R4/targetElement\" target=\"_blank\" title=\"https://simplifier.net/Grunndata-R4/targetElement\">https://simplifier.net/Grunndata-R4/targetElement</a><br>\nProvenance profile using the extension: <a href=\"https://simplifier.net/grunndata-r4/gdprovenance\" target=\"_blank\" title=\"https://simplifier.net/grunndata-r4/gdprovenance\">https://simplifier.net/grunndata-r4/gdprovenance</a></p>",
        "id": 175059889,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1567773488
    },
    {
        "content": "<p>I don't see <a href=\"http://hl7.org/fhir/StructureDefinition/targetElement\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/targetElement\">http://hl7.org/fhir/StructureDefinition/targetElement</a> published anywhere.<br>\nFrom the example, <br>\n *  target points to resource<br>\n *  extensions identify elements, but not prior data.<br>\nThe NO extension (simplifier: <a href=\"http://hl7.no/fhir/StructureDefinition/reference-targetElement\" target=\"_blank\" title=\"http://hl7.no/fhir/StructureDefinition/reference-targetElement\">http://hl7.no/fhir/StructureDefinition/reference-targetElement</a>)<br>\n *  target points to resource<br>\n *  extension identifes target element _and_ (optionally) old and new values.<br>\n *  I think this is the one that meets our requirements (VA Pharmacy \"AMPL\")</p>",
        "id": 178670401,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1571674151
    },
    {
        "content": "<blockquote>\n<p>I don't see <a href=\"http://hl7.org/fhir/StructureDefinition/targetElement\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/targetElement\">http://hl7.org/fhir/StructureDefinition/targetElement</a> published anywhere.<br>\nFrom the example, <br>\n *  target points to resource<br>\n *  extensions identify elements, but not prior data.<br>\nThe NO extension (simplifier: <a href=\"http://hl7.no/fhir/StructureDefinition/reference-targetElement\" target=\"_blank\" title=\"http://hl7.no/fhir/StructureDefinition/reference-targetElement\">http://hl7.no/fhir/StructureDefinition/reference-targetElement</a>)<br>\n *  target points to resource<br>\n *  extension identifes target element _and_ (optionally) old and new values.<br>\n *  I think this is the one that meets our requirements (VA Pharmacy \"AMPL\")</p>\n</blockquote>\n<p>Missed this one <span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> <br>\nI though I also updated the GF23076, looks like my New name is Eric Rose?!?</p>",
        "id": 183915694,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1576828635
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> ; yours looks great; I'm just trying to work out US realm assumptions. Thanks.</p>",
        "id": 184265519,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1577371766
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span>  That extension (3 versions in Simplifier) still say \"draft\" and the canonical returns a 404. Do you have maturation assumptions or plans?</p>",
        "id": 203985137,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1594833611
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span>  We want to test it in our implementation. Looks like we can have an actual implementation this fall. Would be great to hear from any other implementers as well.</p>",
        "id": 206442700,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1597051783
    },
    {
        "content": "<p>This one <a href=\"https://jira.hl7.org/browse/FHIR-21284\">https://jira.hl7.org/browse/FHIR-21284</a> is still unimplemented, and it is not assigned to anyone. Can someone from FHIR-I take it on?</p>",
        "id": 235351910,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1618928650
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span>  Did you end implementing this extension in your implementation? any interesting learnings?<br>\nWe are looking at a similar use case where we want to enrich data using  an external service on the FHIR response coming back to the client. And we want do have why to communicate to the client what we changed.</p>",
        "id": 243962615,
        "sender_full_name": "Amit Cudykier",
        "timestamp": 1624650771
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"372024\">Amit Cudykier</span> <a href=\"#narrow/stream/179166-implementers/topic/Source.20of.20information/near/243962615\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"192856\">Thomas Tveit Rosenlund</span>  Did you end implementing this extension in your implementation? any interesting learnings?<br>\nWe are looking at a similar use case where we want to enrich data using  an external service on the FHIR response coming back to the client. And we want do have why to communicate to the client what we changed.</p>\n</blockquote>\n<p>We are still struggeling to get the Provenance records straight so the implementers have not gotten around to implement the targetElement unfortunately.</p>",
        "id": 244105203,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1624860747
    }
]