[
    {
        "content": "<p>Hi all.  First let me apologize if this topic has already been covered.   The topic is about how real world dates and times for lab results are stored in the Observation resource.   Apart from the observation value, there are only two date related fields in the Observation resource.  They are the effective[x] group and the issued instant.   Looking at the definitions of these fields, the physiologically relevant date and time for a patient test result is the date and time when the specimen was collected from the patient.   This may also exist in the specimen, but it belongs in the Observation.effectiveDateTime (or other effective[x]) regardless.   The issued instant is defined as the date and time when the result was made available to practitioners.   This was also thought of as the verified date and time. <br>\nI have been a long time HL7v3 RIM advocate.  Back then, we had effective, activity, and availability dates and times for each act.  It seems to appear that only effective and availability made it to the FHIR Observation.<br>\nHow have people been supporting the date and time that the lab results were reported/recorded?   What some call the result date/time.  I have a problem now where the original implementors of my environment copied the lab result date time to effectiveDateTime.  Now I have the problem of fixing this and reloading 3.5 years of lab results.  Before I do this, I was hoping that someone has already solved this problem.  <br>\nThanks in advance,<br>\nJeff</p>",
        "id": 195107101,
        "sender_full_name": "Jeff Jacobs",
        "timestamp": 1587669558
    },
    {
        "content": "<p>So you have three dates in your old system?  Specimen collection date, result recorded date, and result verified date?</p>",
        "id": 195108882,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1587670342
    },
    {
        "content": "<p>Specimen collection date goes in effectiveDateTime or effectivePeriod.<br>\nResult recorded and Result Verified would be issued but you'd have two different instances of the resource with different statuses.</p>",
        "id": 195109009,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1587670405
    },
    {
        "content": "<p>You could also look at Provenance to see what sort of updates to the result (and status) happened when - and who was involved.  If you absolutely need some of that data to be visible on the 'current' version of the resource, you'd be looking at an extension.</p>",
        "id": 195118763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587675523
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, that is what I was thinking too.  The big thing many non-clinical implementers forget is that specimen collection date is the effective date.   I'll take into account how the other dates are used downstream and see if an extension is in order.   I had not thought to check the existing extensions to see if one may have already been suggested before.</p>",
        "id": 195120206,
        "sender_full_name": "Jeff Jacobs",
        "timestamp": 1587676304
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"196418\">@Jeff Jacobs</span> long time no see. One of the reasons ActivityDate didn't make it into the resource is because there's so many candidates for ActivityDate. I don't think we have an extension for this, but I think baout provenance first, since you'll typically start doing things like Data Enterer etc as well once you go there</p>",
        "id": 195142319,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587697328
    }
]