[
    {
        "content": "<p>Our source systems sometimes have duplicate patient records by mistake, but we want to load just the current record into our ODS.  In such a case, we need an indicator so users know there may be additional information in the source system.</p>\n<p>The source system records have Alerts (Flags in FHIR) which will be loaded, but I am considering adding extensions to the Patient resource to be extra cautious around this.  The extensions would be something like parisDuplicateRecordFlag, profileDuplicateRecordFlag &amp; pixalereDuplicateRecordFlag (for our three source systems).  They would be set to True for any patient with a duplicate record in that source system, and they would also be mustSupport and isModifier.</p>\n<p>Does this make sense, or is there a better way?...</p>",
        "id": 207447461,
        "sender_full_name": "David Reeves",
        "timestamp": 1597863417
    },
    {
        "content": "<p>Why not use Patient.link?</p>",
        "id": 207447949,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597863629
    },
    {
        "content": "<p>We want to ensure we only ever have one record per patient in our ODS, with the expectation that will greatly simplify things.</p>",
        "id": 207455386,
        "sender_full_name": "David Reeves",
        "timestamp": 1597867476
    },
    {
        "content": "<p>You can have a single record and use the link to be a logical reference, with link.other.identifier.system identifying the system where the duplicate is, and link.other.identifier.value the identifier of the duplicate. This way you avoid the need for extensions.</p>",
        "id": 207457942,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597868899
    },
    {
        "content": "<p>Thanks Vassil, I like this idea, but it needs to be very, very noticeable if a patient has a duplicate record in the source system, because it could contain important clinical information. This is why both records in the source system have an Alert (Flag). Can such a link be mustSupport and isModifier, and be made always present with the Patient record. That is our biggest concern.</p>",
        "id": 207458621,
        "sender_full_name": "David Reeves",
        "timestamp": 1597869276
    },
    {
        "content": "<p>FYI, most duplicate records in our source systems are merged into one active record, but some cannot be merged (at least not without too much time and effort, often of a physician).  If they are merged we can simply disregard the duplicate record in our ODS, so this only applies to records that cannot be merged.</p>",
        "id": 207458933,
        "sender_full_name": "David Reeves",
        "timestamp": 1597869485
    },
    {
        "content": "<p>isModifier is  not something you need for this case, because you are not modifying the meaning of the Patient resource. A profile can make Patient.link be \"mustSupport\".</p>",
        "id": 207465860,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597874037
    }
]