[
    {
        "content": "<p>Hi all, </p>\n<p>We are just discussing the useage specimen resources for information exchange between two biobank products in the context of clinical studies.</p>\n<p>For now we are missing the possibility  to express container-container relations </p>\n<p>On the one hand a container is stored in some kind of rack <br>\nOn the other the specimen container may belong to some kind of sample kit which is used to collect different kinds specimen in different containers.</p>\n<p>Did anyone allready have some thoughts of how to add it to the specimen resource ?</p>",
        "id": 154021518,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1543480824
    },
    {
        "content": "<p>looks like an extension to me</p>",
        "id": 154021529,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543482659
    },
    {
        "content": "<p>I'm not sure whether an extension would really be a good idea.<br>\nContainers in real life have a recursive nature, OO seems to be aware of that too:</p>\n<blockquote>\n<p>....<br>\n It does not address the recursive nature of containers or the tracking of the location of a container within its parent container (for instance: a tube in a tray in a rack in a freezer).</p>\n</blockquote>\n<p>I guess in the long run, it may be useful to have some \"Container\" resource which can have a recursive reference an mabye referenced in Specimen as well instead of just having a container element in Specimen.</p>",
        "id": 154021536,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1543483772
    },
    {
        "content": "<p>Maybe that's the right the long term solution. but I don't think that is relevant to the near term?</p>",
        "id": 154021556,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543486109
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> that's right, my intention was to figure out if there allreade are some thoughts about these relations and how to implement them. And on the other hand to raise a hand for the need of it</p>",
        "id": 154021567,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1543486704
    },
    {
        "content": "<p>possibly the container could be described using Device.</p>",
        "id": 154021695,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543504522
    },
    {
        "content": "<p>replacing the container backbone element by a reference to a device sounds charming</p>",
        "id": 154021710,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1543505953
    },
    {
        "content": "<p>Feel free to submit a change request :)</p>",
        "id": 154024339,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544494252
    }
]