[
    {
        "content": "<p>Hello! It would be great if you advise me links or some materials that describe how I can develop/implement specialized patient registries based on FHIR such as Cancer Registry, HIV Registry and other types of registries for aggregation of administrative and medical data about patient's health?</p>",
        "id": 164067074,
        "sender_full_name": "Mike Ryzhikov",
        "timestamp": 1556099254
    },
    {
        "content": "<p>Hello! Could you check and help me with a mapping of a specialized register on HL7 FHIR? <br>\nWe need to create and manage the regional register of patients with particular diagnoses (a subset of diagnoses).</p>\n<p>The primary goal of this registry is to capture information about patients and available benefits/concessions for them. The benefits/concessions are assigned to the patients based on the diagnosis by special request from a medical organization to the regional organization. </p>\n<p>The first scenario of using the registry is the checking of medication prescriptions. If a patient doesn't have approved benefits/concessions then the patient can't receive medication prescription covered by government insurance. </p>\n<p>The second scenario of using the registry is a regional analysis of data about prescribed medications and the number of patients with specialized diagnoses.</p>\n<p>We need to collect and manage the following dataset:<br>\n- patient info (demographics, personal documents)<br>\n- insurance info (number, insurance company)<br>\n- type of benefit/concessions<br>\n- diagnoses (the reason for approving benefit for a patient)<br>\n- dates (when included into registry / excluded from registry)<br>\n- a medical organization (included a patient to the registry)<br>\n- a medical organization (excluded a patient to the registry)</p>\n<p>My draft for the solution:<br>\nI'm going to use the EpisodeOfCare resource for this registry. This resource has suitable meaning and attributes and links to needed resources (patient, diagnoses and organization).</p>\n<p>But I think that the information about benefits should be included in the Coverage resource, for example:<br>\nCoverage.Type = extended healthcare (EHCPOL)<br>\nCoverage.Class.Type = Group<br>\nCoverage.Class.Value = Type of Benefit/Concession (code)</p>\n<p>What do you think about that? Could you advise me the right way for my tasks?</p>",
        "id": 164072633,
        "sender_full_name": "Mike Ryzhikov",
        "timestamp": 1556105714
    },
    {
        "content": "<p>One of the scenarios you describe reminds me a little bit of the Da Vinci Prior Authorization use-case... You might want to take a look at that and see what they have planned. It might give you some ideas. <a href=\"http://wiki.hl7.org/index.php?title=Da_Vinci_Prior_Authorization_FHIR_IG_Proposal\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Da_Vinci_Prior_Authorization_FHIR_IG_Proposal\">http://wiki.hl7.org/index.php?title=Da_Vinci_Prior_Authorization_FHIR_IG_Proposal</a></p>",
        "id": 164073181,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1556106361
    },
    {
        "content": "<p>Agree.  This sounds like a PriorAuthorization, which uses the Claim resource.  Though the use of that as a 'registry' is a bit unusual.  If this is just describing their base coverage, then you'd need a combination of Coverage (which identifies who has the insurance coverage) with InsurancePlan (which describes, at a high level) what the plan covers.  Note that this wouldn't reflect coverage limits used to date.  If you need to know \"how much would be covered today\", then you should either do a pre-determination (Coverage) or eligibility check (EligibilityRequest/EligibilityResponse)</p>",
        "id": 164086041,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556116643
    }
]