[
    {
        "content": "<p>I have (at least) two URLs I want to share about a HealthcareService</p>\n<ol>\n<li>the service's marketing webpage</li>\n<li>the service's referral/contact page</li>\n</ol>\n<p>I think that the marketing page belongs at HealthcareService.telecom.url. Should I create an extension for the referral page? I was wondering if there's also a way to use HealthcareService.telecom.url with slicing but I don't know what i'd use as the discriminator.</p>",
        "id": 207263283,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1597759641
    },
    {
        "content": "<p>Since HealthcareService uses ContactPoint that uses a simple string for value, you could  add \"marketing\" and \"referral\" to the use codelist and then slice on that, putting the URL in value.</p>",
        "id": 207264764,
        "sender_full_name": "David Pyke",
        "timestamp": 1597760360
    },
    {
        "content": "<p>HealthcareService.endpoint has some hints that it could be used somehow for this purpose. Unfortunately  HealthcareService.telecom.use has a required binding... Maybe some kind of extension on telecom?</p>",
        "id": 207265059,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597760483
    },
    {
        "content": "<p>You're right, I misread the binding.  Then yes, likely needs an extension because endpoint is designed around interop, not marketing.</p>",
        "id": 207266050,
        "sender_full_name": "David Pyke",
        "timestamp": 1597760959
    },
    {
        "content": "<p>Using Endpoint is an interesting idea. I guess I would create it with a HealthcareSerivce.endpoint&gt;connectionType.code=referral-page, would that make sense?</p>\n<p>Similarly, I want to publish what a services SMART on FHIR url would be, I think I could do this same thing with HealthcareSerivce.endpoint&gt;connectionType.code=sof-referral-page.</p>\n<p>Would that make sense?</p>",
        "id": 207267324,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1597761538
    },
    {
        "content": "<p>The sof-referral page seems appropriate for an endpoint, but as David pointed out, my initial suggestion for referral contact page doesn't match the intent of the resource (I was skimming the references for directory entries).</p>",
        "id": 207268655,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597762140
    },
    {
        "content": "<p>Yes that makes sense to me. So extension for public referral page, endpoint for sof launch page sounds like a good idea. Thanks for the feedback.</p>",
        "id": 207268959,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1597762305
    }
]