[
    {
        "content": "<p>On a slightly more humorous/quasi-tragic/compassionate note, has anybody else tried to model Spoon Theory for chronic illnesses?<br>\n<a href=\"https://en.wikipedia.org/wiki/Spoon_theory\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Spoon_theory\">https://en.wikipedia.org/wiki/Spoon_theory</a><br>\n<a href=\"https://www.google.com/search?q=spoon+theory+images\" target=\"_blank\" title=\"https://www.google.com/search?q=spoon+theory+images\">https://www.google.com/search?q=spoon+theory+images</a></p>\n<p>We're in contact with a bunch of people counting daily spoons, and are putting together a spoon tracker as a quick pro-bono project.  The obvious approach seems to be to use a self-reported Observation; and perhaps reference it within <code>ClinicalImpression.investigation.item</code>.   It's mostly a matter of which code to use.  </p>\n<p>ICD-10-CM Diagnosis Code W27.4XXD \"Contact with kitchen utensil, subsequent encounter\" is NOT what we're looking for.  So, I'm thinking<br>\nLOINC 65411-1   Bring a spoon of water from lap level up to mouth and back again - repeat 7 additional times [PhenX], or <br>\nLOINC 83189-1   Picking up object - functional goal during 3 day assessment period [CMS Assessment]</p>\n<p>It's a bit literal compared to the lay interpretation of Spoon Theory, but I think it might be a good enough starting point; with the latter grounded in an actual CMS assessment.    Anybody else have any experience in this area?</p>",
        "id": 153945906,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521387699
    },
    {
        "content": "<p>What is the Observation actually measuring?  A subjective impression of how many \"spoons\" a patient has left?  How many were used in a particular day?</p>\n<p>I wouldn't recommend abusing an existing code.  If you can clearly define the meaning of it (even if it's a subjective assessment) and there's evidence of semi-widespread use, we can absolutely approach LOINC to add an appropriate code via HL7's terminology authority.  In the meantime, I'd just use a locally defined code with a system URL you control.</p>",
        "id": 153945909,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521390754
    },
    {
        "content": "<p>Yeah, it's a pretty subjective measure.  The thing it's probably closest to is the Wong-Baker FACES pain rating scale, maybe.  But spoons are more about cognitive load and energy levels (metabolism?) than pain (neurotransmitters).  A spoon (or lack thereof) can be a proxy measure of fatigue, anxiety, depression, and other mental health conditions.  </p>\n<p>But to the extent that there are patient education materials like the following, people have a functional enough definition that they're self-assessing and reporting and discussing.  <br>\n<a href=\"http://me-pedia.org/wiki/Spoon_theory\" target=\"_blank\" title=\"http://me-pedia.org/wiki/Spoon_theory\">http://me-pedia.org/wiki/Spoon_theory</a>  </p>\n<p>These things are actually fairly relevant to either of the existing LOINC codes.  Chronic fatigue, anxiety, depression... if they're bad enough, people can get to the point where they're unable to pick things up from the ground or feed themselves (in severe cases; aka. 'zero spoon days').  </p>\n<p>I think the biggest problem with the LOINC 83189-1 code may be cardinality.  A functional goal seems more like it's achieved or not.  But spoons in the sense of Spoon Theory are more of a self-assessed biomarker...  so 12 spoons today, 9 spoons yesterday, 3 spoons when a person has the flu; 5 on the day they attended a funeral, etc.</p>",
        "id": 153945950,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521392080
    },
    {
        "content": "<p>We'll do a locally defined code for the time being.  Happy to compare notes if anybody else happens to work on this.  Would be super cool to see a LOINC code for spoon theory.</p>",
        "id": 153945951,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521392266
    },
    {
        "content": "<p>Is the measure is one of \"energy expended\" or of \"energy available\"?  Cardinality shouldn't be an issue as you'd have a separate Observation for each day</p>",
        "id": 153945971,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521394931
    },
    {
        "content": "<p>I'd say 'energy available'.  The important distinction, I think, is that it's not a boolean.</p>",
        "id": 153946100,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521423930
    },
    {
        "content": "<p>If you put together a short email describing the nature of the Observation and provide some examples of places where it's being used, I can get it to the HL7 Terminology Authority who can make the request of LOINC for an official code.</p>",
        "id": 153946103,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521429242
    }
]