[
    {
        "content": "<p>Good morning everyone, hope you are all doing well. I am new working with Fhir, so I was wondering if there is a way to generate the whole Database model in MSSQL, where I can see all the tables and relations and constraints</p>",
        "id": 240822715,
        "sender_full_name": "Gustavo Jose Marcano Valero",
        "timestamp": 1622461252
    },
    {
        "content": "<p>We don't have a standard/recommend way to represent FHIR in SQL; many real-world servers that provide FHIR API support on top of a relational database wind up using techniques like JSON columns for core resource content, plus explicit indexes for search parameters</p>",
        "id": 240827846,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622464387
    },
    {
        "content": "<p>If you're asking about db schema as a kind of educational tool for visualizing the spec rather than an operational tool for hosting a DB, that's an interesting twist.</p>",
        "id": 240828127,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622464541
    },
    {
        "content": "<p>Oh thanks very much  <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , Is just that I was going over the directories of the localserver and noticed there are a few sql files, and exactly what you said, it would be more of a educational purpose, though I am guessing there should be at some level relational database involved (in my humble opinion, and forgive me if I'm wrong), given that by default it is stored in SQLite</p>",
        "id": 240828886,
        "sender_full_name": "Gustavo Jose Marcano Valero",
        "timestamp": 1622464940
    },
    {
        "content": "<p>It sounds like you're not asking a question about FHIR but about a specific software project. Maybe <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a> ? (If so, I'd recommend asking in that channel.)</p>",
        "id": 240830243,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622465734
    },
    {
        "content": "<p>And there is a <a class=\"stream\" data-stream-id=\"179289\" href=\"/#narrow/stream/179289-storage-for-FHIR\">#storage for FHIR</a>  steam for database related topics</p>",
        "id": 240846442,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1622475020
    },
    {
        "content": "<p>It sounds like an endavour as HTB did in the past with V3. It's doable but most probably very inefficient because of many subtables.</p>",
        "id": 240846597,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1622475117
    }
]