[
    {
        "content": "<p>Any best practices for building a dedicated FHIR server as a standalone demographics server to facilitate privacy protection?  Thanks.</p>",
        "id": 219550086,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1607644244
    },
    {
        "content": "<p>You'd have to think about subject.display and narrative of the referencing resources.  Those would often expose name and possibly limited other information.  Also, even if you completely protect demographics, other information (e.g. when someone visited particular locations) can, when combined with other information, still breach privacy).</p>",
        "id": 219551345,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607645331
    },
    {
        "content": "<p>Agree.  Thanks for your swift reply<span aria-label=\"smiling face\" class=\"emoji emoji-263a\" role=\"img\" title=\"smiling face\">:smiling_face:</span></p>",
        "id": 219551532,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1607645502
    },
    {
        "content": "<p>This seems to me to be an important use case. Is it expected that the \"client registry\" content will exist on the <strong>same FHIR server</strong> as the health data associated with the patient ID... or is it expected (or at least supported) that this will be a <strong>separate server</strong>? If it is a separate server, does it \"break\" any of the internal references in the other server, where the health data is persisted -- or can <strong>fully-formed id's </strong>(with the full URL) address cross referencing challenges? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- this appears to be related to the \"Logical ID changes\" thread...</p>",
        "id": 219867982,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1607964221
    },
    {
        "content": "<p>It's totally fine for it to be on a separate server.  There's no issue with logical id changes if a reference is a full URL and you're not creating or updating the referenced resource.</p>",
        "id": 219869226,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607964742
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . Would operations or transactions running on the \"health data\" server still be able to operate on data that is on the \"CR\" server? For example, if a plandefintion.action.condition needed to fire (or not fire) depending on the gender of the patient... would this still work if the patient resource was on another server (but referenced by a full-URL id)? (Sorry for not knowing how that's expected to operate... and I hope I'm not missing something obvious). <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  -- has anybody tried this cross-server kind of thing, executing a $apply, for example?</p>",
        "id": 219870425,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1607965258
    },
    {
        "content": "<p>Detecting a condition doesn't necessarily need to happen on the same server, though obviously it needs to be a server that the workflow engine is aware of and has access to.</p>",
        "id": 219873237,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607966513
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> , the $evaluate and $apply extensions in CPG-on-FHIR support accessing data on other servers through the use of Endpoints passed as parameters to the operations. See the $apply here: <a href=\"http://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/OperationDefinition-cpg-plandefinition-apply.html\">http://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/OperationDefinition-cpg-plandefinition-apply.html</a></p>",
        "id": 220023357,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1608057749
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> -- so in a situation where the health data was on one FHIR server (an SHR) and the demographic data was on another server (a CR) you could execute a $apply on one of these and pass it the location of the other server in the dataEndpoint parameter. This is a 0..1 cardinality -- so a federation of more than two servers is not supported; do I understand this correctly? (and I'm assuming that content that is on the local server will be included in addition... not <strong>just</strong> the content on the supplied endpoint... do I understand this correctly?)</p>",
        "id": 220042646,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1608066523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> , basically, the behavior supports 3 levels:</p>\n<ol>\n<li>Data provided as part of the request (via a bundle or a set of prefetch bundles)</li>\n<li>Data available in the server itself (and whether this can be used is controlled by the useServerData parameter)</li>\n<li>Data available in the dataEndpoint parameter, if provided.<br>\nAny federation scenarios more complicated than that would have to be handled either in the server itself, or with a federating endpoint that you would then pass as the dataEndpoint to the operation.</li>\n</ol>",
        "id": 220140564,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1608137313
    },
    {
        "content": "<p>We've applied those same semantics consistently across the $cql, Library/$evaluate, and PlanDefinition and CarePlan/$apply operations.</p>",
        "id": 220140608,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1608137346
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  -- much appreciated! <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 220145954,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1608139730
    }
]