[
    {
        "content": "<p>Basic question. How does an implementer express support for a standard extension that may not be formally included in a profile? Something like patient-birthTime, for example. Would it be legal to say this conforms to the Patient profile? Or does it need further qualification?</p>",
        "id": 153832540,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1465845364
    },
    {
        "content": "<p>Your Conformance statement should point to resource-specific profiles that identify the data elements (core + extension) that you're capable of handling.</p>",
        "id": 153832561,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1465852442
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is there a cross reference for standard extensions and existing profiles?</p>",
        "id": 153832562,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1465852587
    },
    {
        "content": "<p>for example, i should be able to go from patient-mothersMaidenName to the DAF Patient profile</p>",
        "id": 153832563,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1465852656
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191619\">@Peter Bernhardt</span> interesting question about extension cross-reference.  It seems to me that this could only be done in the context of a profile repository (e.g. HL7 balloted artifacts, or other organization specific repository).  Extensions may be specified on any resource independent of profile, so you'd need to index all known extensions and profiles.</p>",
        "id": 153832566,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1465853062
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span> yes, such a repository would be essential as profiles proliferate and we run the risk of duplication. In the meantime, for standard extensions and profiles covered in the FHIR docs I was hoping to save a bit of time in looking through the spec.</p>",
        "id": 153832568,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1465853487
    },
    {
        "content": "<p>So the \"repository\" in this case is all HL7 balloted extensions and profiles.  It would need to be integrated into HL7 build and publishing.  To generalize, would be best to implement as a secondary analysis of all published StructureDefinition files.  Unfortunately, I've never seen such an analysis.</p>",
        "id": 153832569,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1465853713
    },
    {
        "content": "<p>Interesting discussion. We're certainly aiming to implement useful features such as cross references into our FHIR profile registry at <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">http://simplifier.net</a>. All content is stored in a FHIR server and indexed, so the technical foundation is already in place.</p>",
        "id": 153832570,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1465854609
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> pretty close to what I was thinking about. Thanks.</p>",
        "id": 153832573,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1465855166
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191619\">@Peter Bernhardt</span> The most we could do in the HL7 publication is to cross-link to those profiles HL7 publishes with the spec - which will be a declining set.  You're free to submit a change request asking for that though.  Agree that the long-term solution is cross-references in tools like <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">simplifier.net</a></p>",
        "id": 153832595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1465859732
    }
]