[
    {
        "content": "<p>Hello, I am trying to find a way to represent the type of activity that was performed during a workout, however I cannot find the proper SNOMED or LOINC representation of a specific activity type. The goal is to map it from <a href=\"https://developer.apple.com/documentation/healthkit/hkworkoutactivitytype?language=objc\" target=\"_blank\" title=\"https://developer.apple.com/documentation/healthkit/hkworkoutactivitytype?language=objc\">HealthKit</a> or <a href=\"https://developers.google.com/fit/rest/v1/reference/activity-types\" target=\"_blank\" title=\"https://developers.google.com/fit/rest/v1/reference/activity-types\">Google Fit</a> activity constants.</p>",
        "id": 153947833,
        "sender_full_name": "Dimitar",
        "timestamp": 1522051818
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span> have you looked at this?</p>",
        "id": 153947849,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522056028
    },
    {
        "content": "<p>check out Simplifier profiles.   There is Finnish work on this.</p>",
        "id": 153948075,
        "sender_full_name": "Eric Haas",
        "timestamp": 1522082116
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Thanks, I did check out their profile, however I did not find within the fitness profile where they specify the precise activity type performed like running, walking or swimming - just physical activity.</p>",
        "id": 153948321,
        "sender_full_name": "Dimitar",
        "timestamp": 1522138399
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193693\">@Harri Honko</span> ?</p>",
        "id": 153948403,
        "sender_full_name": "Eric Haas",
        "timestamp": 1522162246
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194501\">@Dimitar</span>  &amp; <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> we're still to introduce actual workout/exercise profiles that would have package like [activity type, starttime, stoptime, HRavg, HRmax, maybe MET value] - but for now we only report in Finnish PHR fitness profiles moderate to vigorous PA (MET&gt;3) minutes over a period (day or week). For the first we had to use own fitness codesystem, the latter has a LOINC code. I recall seeing a fairly thorough list of activity types somewhere in LOINC. Hmm.</p>",
        "id": 153948807,
        "sender_full_name": "Harri Honko",
        "timestamp": 1522268960
    },
    {
        "content": "<p>We have looked into this as part of C3-PRO (patient reported outcomes research) and we're returning activity data as <code>QuestionnaireResponse</code> resources. <a href=\"https://github.com/C3-PRO/c3-pro-ios-framework/tree/master/Sources/HealthKit\" target=\"_blank\" title=\"https://github.com/C3-PRO/c3-pro-ios-framework/tree/master/Sources/HealthKit\">https://github.com/C3-PRO/c3-pro-ios-framework/tree/master/Sources/HealthKit</a></p>",
        "id": 153949349,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1522400878
    },
    {
        "content": "<p>Hello everyone, are there already newer attempts to represent physical workouts with FHIR? I know that the Finnish PHR already exists, but I would like to represent information that goes far beyond that (more information). In a first attempt I created a “network” of the resources Task, Observation, Device (for the equipment that is used during the workout), Goal, List and Patient because these resources are able to represent a lot of information like repetitions, the equipment that is going to be used, the goal of a workout, duration of a workout, intensity of a workout, distance during running and so on... Does anyone know a more simple/leaner representation? Are there any projects, working-groups, or other examples of representing a workout?</p>",
        "id": 197915698,
        "sender_full_name": "Armin Griebler",
        "timestamp": 1589797903
    }
]