[
    {
        "content": "<p>I have been implementing FHIR import/export for our spirometry software. I have bundle of resources (Patient, Device, Binary and bunch of Observations). At the moment I'm figuring out where to store few text fields from our software. There is a medication text field containing notes about medication. I know there is for example MedicationStatement but I'm not sure is it a best way to do it. Would it be smart to make whole new resource for just one text field? For interpretation there is a interpretation key. That I have already used in different observation for success of breath. But for that I'm not sure if it's the right fit for text field. There is interpretation codes but I didn't find any suitable for just a text of interpretation. I have a observation which gathers up whole study and I would like to place this information to that. Comment key of this resource is already in use. If someone has some kind of opinion about this, help would be very much appriciated! I have been trying to study lot of using extensions but haven't find any suitable extension for this kind of use.</p>\n<p>Edit: I found some extension in use which looks similar to what I was looking for: <a href=\"https://simplifier.net/structured/extension-careconnect-gpc-medicationquantitytext-1\" target=\"_blank\" title=\"https://simplifier.net/structured/extension-careconnect-gpc-medicationquantitytext-1\">https://simplifier.net/structured/extension-careconnect-gpc-medicationquantitytext-1</a><br>\nI haven't really used extensions in my implementation. Can I just take the url and use it in my implementation?</p>\n<p>Edit2: Would it be legal to use interpretation key with no code? Text field is all I need for this resource and there is not really any code for that. </p>\n<p><code>\"interpretation\": {\n    \"text\": \"text field of the Interpretation\"\n}</code></p>",
        "id": 154026041,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1545121703
    },
    {
        "content": "<p>Can you give an example of the type of medication information you need to store?  Is it patient's use of medication.  For example, taking ASA 80mg daily.  If so, a medicationStatement is appropriate for that.  If it is something else, an example would be useful.</p>",
        "id": 154026122,
        "sender_full_name": "Melva Peters",
        "timestamp": 1545150967
    }
]