[
    {
        "content": "<p>We are looking into a push scenario where loosely coupled systems send each other contra-indications on a patient they both have in their system. We are examining options for sending this data (Flag. Patient, Practitioner, PractitionerRole, Organization). Transaction Bundle seems be the best match. Questions: 1. Is there any IG that discusses this type of scenario? 2. We anticipate that at least some of the uploaded resources could exist on the target system and expect to need conditional create for that: what is the current state of support for that? 3. Are there alternatives to transaction Bundle that could apply here?</p>",
        "id": 210134805,
        "sender_full_name": "Ashwin Djorai",
        "timestamp": 1600179235
    },
    {
        "content": "<p>When you say \"sends each other contra-indications\" - do you mean specific detected contraindications (i.e. issues identified with specific planned/existing activities) or do you mean clinical information that could trigger contraindications (which might include a variety of resources)?</p>",
        "id": 210138639,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600180902
    },
    {
        "content": "<p>Hi Lloyd. We are hoping that the answer to that question is irrelevant. The contra-indications use case merely serves as setting the stage for \"a pattern for uploading data to a system where some of that data may already exist\".</p>",
        "id": 210147537,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1600184716
    },
    {
        "content": "<p>If you're trying to figure out \"what is the best exchange mechanism for this use-case?\", suggest you start here: <a href=\"https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html\">https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html</a></p>",
        "id": 210147760,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600184828
    },
    {
        "content": "<p>That looks really helpful indeed. It is a nice overview of methods. For our use case we have a focal resource (Flag) and 'related' resources like Patient/Practitioner. That sounds like a clear cut case for transaction Bundle, which is what the IG points to as well.</p>\n<p>So transaction Bundle it is. The core spec however notes that conditional create/update is not very well supported. The IG does not really allude to that. Are we to understand that this is, or is not an issue to worry about these days?</p>",
        "id": 210148522,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1600185226
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> how can I get Document Sharing added to this?</p>",
        "id": 210148944,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600185428
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Can you explain what you mean by 'Document Sharing'?</p>",
        "id": 210149872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600185800
    },
    {
        "content": "<p>And yet, transaction bundle is not the only approach. Since you have two systems with similar data, what you are asking for is how each system can take only the data that it needs, without overriding the data it already has. </p>\n<p>An alternative approach is for the initiating system to use the same trigger that you plan for \"pushing\" the data to 'ping' the recipient that there is data available, and the recipient retrieves the data they are interested in, and process it as their business rules specify. This way, you are not dependent on the FHIR capabilities of the recipient (as you note, conditional update/create, and even transactions are not that widely implemented, and aligning he FHIR API with business rules may not be straight forward), and relying the core FHIR capabilities of the initiator (+ subscriptions to allow for the 'ping' notification).</p>",
        "id": 210150578,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1600186095
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Strategy.20for.20push.20based.20interaction/near/210149872\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> Can you explain what you mean by 'Document Sharing'?</p>\n</blockquote>\n<p>You HL7 People... He means XDS/MHD and such</p>",
        "id": 210156050,
        "sender_full_name": "David Pyke",
        "timestamp": 1600188710
    },
    {
        "content": "<p>Sure - but how is that not covered by what's there?</p>",
        "id": 210156150,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600188737
    },
    {
        "content": "<p>MHD is still just using RESTful posts and queries, no?</p>",
        "id": 210156213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600188765
    },
    {
        "content": "<p>As could messaging, as do documents. So using HTTP isnt much of a criterium when selecting paradigms. But you're aware of that. That having been said, the burden is probably on the fans of 'document sharing' to propose what should be added, and how that paradigm differs from any of the others shown.</p>",
        "id": 210227902,
        "sender_full_name": "René Spronk",
        "timestamp": 1600240007
    },
    {
        "content": "<p>MHDS is just a RESTful document sharing exchange around one center. MHD is the API that clients use to any scale of document sharing exchange.</p>",
        "id": 210256693,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600260939
    },
    {
        "content": "<p>Document Sharing, when viewed by the consumer, is simply a Query and Retrieve. Well represented by DocumentReference and query against it. What is missing from this perspective is the focus on \"documents\". The principles of a document are very powerful in a cross-community exchange. A Document Sharing is a transport for FHIR Documents and Collection Bundles; but also supports non-FHIR documents such as CDA, PDF, DICOM, etc.</p>",
        "id": 210257146,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600261175
    },
    {
        "content": "<p>Document Sharing, when viewed by the publisher, allows for publication of completed works for discovery by consumers. This might be implemented as a REST create of a DocumentReference, but might also be recognizing distributed responsibility (repository vs registry vs federation gateway).  This publication might be of a completed work, or might be a promise to produce a completed work, or might be a promise to produce a current work of a given type. Always a document with the principles of a document.</p>",
        "id": 210257931,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600261519
    },
    {
        "content": "<p>There's discussion in the decision tree about when it's appropriate to store information as documents vs. not (generally when it's important to store the data as a group and necessary to tell a story).  If those requirements don't hold, then documents is probably not the best way to share the data.</p>",
        "id": 210270456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600266860
    }
]