[
    {
        "content": "<p>Is there any plan to publish the structuredefinitions for dstu2, stu3, r4  on github directly? That way packages that need to use these artifacts can get them from there instead of having to clone them, like we do here: <a href=\"https://github.com/google/fhir/tree/master/testdata/stu3/structure_definitions\" target=\"_blank\" title=\"https://github.com/google/fhir/tree/master/testdata/stu3/structure_definitions\">https://github.com/google/fhir/tree/master/testdata/stu3/structure_definitions</a></p>\n<p>i'm happy to help set it up.</p>",
        "id": 153996116,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1536717559
    },
    {
        "content": "<p>we're using npm to distribute these</p>",
        "id": 153996117,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536717633
    },
    {
        "content": "<p>there's npm packages at <a href=\"http://hl7.org/fhir/STU3/package.tgz\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/package.tgz\">http://hl7.org/fhir/STU3/package.tgz</a> etc</p>",
        "id": 153996118,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536717665
    },
    {
        "content": "<p>Right. One thing github gives you is the ability to reference a specific repo version. That lets a user update the pointer to the spec in their repo in the same change as any downstream generated code that would be modified as a result of the spec changing. Without this functionality, changing the fhir package may break downstream builds. I'm not that familiar with npm but i don't believe it provides that functionality.</p>",
        "id": 153996125,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1536723200
    },
    {
        "content": "<p>well, I thought that was the point</p>",
        "id": 153996126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536723651
    },
    {
        "content": "<p>I mean, of the npm package thing</p>",
        "id": 153996127,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536723661
    },
    {
        "content": "<p>perhaps I don't understand the context, but you reference the package you want...</p>",
        "id": 153996128,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536723685
    },
    {
        "content": "<p>The packages are version-specific</p>",
        "id": 153996230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536760378
    },
    {
        "content": "<p>except for current</p>",
        "id": 153997209,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537052617
    },
    {
        "content": "<p>I don't know if this is relevant, but I've moved some of my server support to <a href=\"https://github.com/FHIR/packages\" target=\"_blank\" title=\"https://github.com/FHIR/packages\">https://github.com/FHIR/packages</a> - this is the various resources that are useful for servers for testing but not suitable for the spec itself</p>",
        "id": 153997210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537052656
    },
    {
        "content": "<p>some is sourced from MIHIN (thanks)</p>",
        "id": 153997211,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537052663
    },
    {
        "content": "<p>contributions are welcome.</p>",
        "id": 153997212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537052677
    },
    {
        "content": "<p>I suppose we could put the structure definitions up there too.... I'm just not clear on the value proposition right now</p>",
        "id": 153997213,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537052698
    },
    {
        "content": "<p>from what i can tell you were referring to this npm package: <a href=\"https://www.npmjs.com/package/fhir-schemas\" target=\"_blank\" title=\"https://www.npmjs.com/package/fhir-schemas\">https://www.npmjs.com/package/fhir-schemas</a><br>\nwhich seems to be generated from source here: <a href=\"https://github.com/clinical-meteor/fhir-schemas\" target=\"_blank\" title=\"https://github.com/clinical-meteor/fhir-schemas\">https://github.com/clinical-meteor/fhir-schemas</a><br>\nthat package doesn't contain the structure definitions in json format, the schemas are in json-schema. is there another npm package i should be looking at?</p>\n<p>the testdata you've posted does seem relevant to me, we'll have a look at it. also, i personally like github a lot better, because it's easier to integrate with as a dependency. putting the structure definitions in your new package would help us out.</p>",
        "id": 153997223,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1537073959
    },
    {
        "content": "<p>just found <a href=\"#narrow/stream/99-IG-creation/subject/NPM.20Package.20File\" title=\"#narrow/stream/99-IG-creation/subject/NPM.20Package.20File\">https://chat.fhir.org/#narrow/stream/99-IG-creation/subject/NPM.20Package.20File</a></p>\n<p>i think i was missing a lot of context. So, you're building npm packages but they are not published on the npmjs site, instead you list them all in <a href=\"http://hl7.org/fhir/package-list.json\" target=\"_blank\" title=\"http://hl7.org/fhir/package-list.json\">http://hl7.org/fhir/package-list.json</a> and similar. The actual data is in $path/package.tgz, and these files have a lot more data in them than the package i found on npmjs, including (i think) the stuff i want. Overall this setup looks quite nice. Now I just have to see if I can integrate it with our build tools.</p>\n<p>I'm assuming packages are immutable once published? If so, can you also add checksums to the package list?</p>",
        "id": 153997226,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1537082426
    },
    {
        "content": "<p>They haven't been immutable in practice as we've had to fix various errors in them and/or add content to older ones needed by newer tools.</p>",
        "id": 153997242,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537113449
    },
    {
        "content": "<p>then we're back to why i would have liked to see these packages on github. various downstream artifacts are generated from the structure definitions; if the structure definitions change, downstream artifacts will also change, and suddenly the build will break. or worse, the build won't break, but depending on when you downloaded the dependencies, it will produce different results. what you're describing sounds more like release branches, which occasionally get updated, ie hl7.fhir.core.stu3 v1.0.0 to v1.0.1 when fixing errors or v1.1.0 when adding content needed by newer tools. or am i off base here?</p>",
        "id": 153997246,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1537121526
    },
    {
        "content": "<p>The formal models don't change.  What was legal as a Patient in STU2 is still the same.  However, for example, the FHIRPath language has changed and become the primary mechanism for expressing constraints.  To work with the tools, the rules as they were for STU2 need to be expressed in a way the tools can support.  Also, in some cases, we had models that were invalid and didn't notice because the tooling at that point couldn't detect the issue.  So we updated the formal representation to reflect what the ballot actually said in the user presentation.</p>",
        "id": 153997259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537134932
    },
    {
        "content": "<p>this all makes sense, but the problem still remains: if i have unittests that for some obscure reason depend on some bug in the models, these tests will break when you fix the bug and push an updated package. imho a better way of handling this situation is to mark the existing package invalid or deprecated, push a new one with a new version number, and let downstream consumers atomically switch out the dependency and fix the unittests. </p>\n<p>the situation is particularly bad for deeper dependencies. let's say i'm writing a package which has versions 1.0.0, 1.1.0, and 2.0.0, and other users depend on my package. Some users are happy with 1.x, but all new development is on 2.x. When the underlying fhir model package changes, all three of these versions may break, and require patches. Now I have to fix all branches of my package, and then all users of my package have to update their dependencies to unbreak their builds. This is exactly the situation package versioning is meant to avoid.</p>\n<p>If the package.tgz files were pushed to github, in the same directory structure they exist now on the fhir website, ie<br>\n<a href=\"http://hl7.org/fhir/us/core/2018Jan/package.tgz\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/2018Jan/package.tgz\">http://hl7.org/fhir/us/core/2018Jan/package.tgz</a> -&gt; <a href=\"https://github.com/FHIR/packages/us/core/2018Jan/package.tgz\" target=\"_blank\" title=\"https://github.com/FHIR/packages/us/core/2018Jan/package.tgz\">https://github.com/FHIR/packages/us/core/2018Jan/package.tgz</a>, github would provide the necessary versioning, and i'd be happy.</p>",
        "id": 153997261,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1537137515
    },
    {
        "content": "<p>(i'd probably be even happier if the packages were expanded fully into individual files, since github will automatically .tar.gz the content anyway, and doing it twice seems unnecessary)</p>",
        "id": 153997263,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1537140360
    },
    {
        "content": "<p>well, there's kind of 2 different issues here.</p>",
        "id": 153997321,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537176555
    },
    {
        "content": "<p>We'll have to talk about the versioning policy. We actually haven't made updates the tgz like Lloyd talks about - he's referring to older things. But we might still have to do that. And it wouldn't work well. But we can't version the packages the same way as a primary packge - it's a secondary asset</p>",
        "id": 153997323,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537176825
    },
    {
        "content": "<p>in practice, if you can promise that the updates are \"rare\" for some definition of rare it might still be enticing to try these packages out now, while the debate for how to handle updates goes on.</p>",
        "id": 153997512,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1537245313
    },
    {
        "content": "<p>they are very rare for anything older than 3.6.0.</p>",
        "id": 153997575,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537269420
    },
    {
        "content": "<p>fyi, this: <a href=\"https://github.com/google/fhir/commit/d0eb78f70ced5e5c3e0d23eaef13e4cf1918c8d6#diff-25fd6a5ac4c10dd98d574a5b4004f777\" target=\"_blank\" title=\"https://github.com/google/fhir/commit/d0eb78f70ced5e5c3e0d23eaef13e4cf1918c8d6#diff-25fd6a5ac4c10dd98d574a5b4004f777\">https://github.com/google/fhir/commit/d0eb78f70ced5e5c3e0d23eaef13e4cf1918c8d6#diff-25fd6a5ac4c10dd98d574a5b4004f777</a> is the only real change we had to hack into the definitions to get the protobuf generation working. how would an update like that work in this model?</p>",
        "id": 153997721,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1537298852
    },
    {
        "content": "<p>I'm not sure what you're asking</p>",
        "id": 153997769,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537301434
    },
    {
        "content": "<p>if we filed a tracker request to make this change, and that request was approved, and it was decided that the official structure definitions should be updated:<br>\n- would this process result in a 3.0.2 release?<br>\n- would this update be included in a larger set, and that release be 3.0.2?<br>\n- would there be an update to the structure definitions, but the version would be kept at 3.0.1 still because the edits were minor?<br>\n- is this question moot because these 3.0.1 structure definitions will remain the final stu3 set?<br>\njust trying to understand the versioning policy.</p>",
        "id": 153997852,
        "sender_full_name": "Patrik Sundberg",
        "timestamp": 1537311324
    },
    {
        "content": "<p>I'm not sure. we might handle it as a technical correction, or not. We might not make the change at all. And then the version policy would follow from that. we might issue a set of informal corrections... I just don't know. All the options are not great. I wish I could offer more clarity</p>",
        "id": 153997858,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537315961
    }
]