[
    {
        "content": "<p>I have a STU3 API that wants to be able to use HealthcareService as the recipient and sender of a Communication. This has been added for Communication in R4. What's the best way to achieve this (other than going to R4!). Is it to create an extension (but that might look a bit odd as you'd have a different concept name - \"senderExtension\" to the actual concept name \"sender\"). Is there a good pre-adoption route for adding references?</p>",
        "id": 214203982,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1603380657
    },
    {
        "content": "<p>There is a standard way to create extensions to back-port elements: <a href=\"http://hl7.org/fhir/r4/versions.html#extensions\">http://hl7.org/fhir/r4/versions.html#extensions</a></p>",
        "id": 214205219,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1603381174
    },
    {
        "content": "<p>Michele - thanks for the link. My issue isn't about elements that missing from STU3, but additional choices on a Reference. Its a bit like the STU3 issue didn't have many references to PractitionerRole (which were put in for R4). So I guess I'll have to create an extension for a STU3 Communication to be able to have a HealthcareService reference for sender &amp; recipient. Just seems a bit of a shame to complicate the profile in this way to add in extra choices in the References!</p>",
        "id": 214554875,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1603706987
    },
    {
        "content": "<p>Ah I see, sorry I misread it</p>",
        "id": 214574466,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1603719834
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192158\">@Dave Barnet</span>  A pattern for this was mentioned lately on an FHIR-I call. <br>\nInstead of adding a new extension to replace the attribute (\"e.g. mySender\"), you can use the existing reference (sender) and just not have a value in it. <br>\nAnd then you put an extension for the new type in there. If I remember correctly, this \"empty\" reference is ok (that was the surprising part, for me), and it is closer to the original meaning.</p>",
        "id": 214596370,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603729152
    },
    {
        "content": "<p>On the page <a href=\"http://hl7.org/fhir/stu3/references.html\">http://hl7.org/fhir/stu3/references.html</a> it does say \"At least one of reference, identifier and display SHALL be present (unless an extension is provided).\" So Something like <br>\n&lt;sender&gt;<br>\n    &lt;extension url=\"<a href=\"https://fhir.nhs.uk/STU3/StructureDefinition/Extension-RefHealthcareService\">https://fhir.nhs.uk/STU3/StructureDefinition/Extension-RefHealthcareService</a>\"&gt;<br>\n        &lt;valueReference&gt;<br>\n             &lt;reference value=\"HealthcareServicePatient/ABC123\" /&gt;<br>\n        &lt;/valueReference<br>\n    &lt;/extension&gt;<br>\n&lt;/sender&gt;</p>\n<p>That works for me!</p>",
        "id": 214601138,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1603731016
    },
    {
        "content": "<p>Not sure I agree with this. I'm not sure of the scenario here but I'm seeing this as MessageHeader. </p>\n<p>In that case I have scenarios where HealthcareService is a legitimate Sender and Receiver, more so the Recipient </p>\n<p>Should MessageHeader be similar to CommunicationRequest and HealthcareService (and CareTeam) is a valid receiver? (and maybe requester/sender)</p>",
        "id": 214666550,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1603782434
    },
    {
        "content": "<p>On a side note. From a UK perspective and messaging. </p>\n<p>I'm not sure it would be practical to send 'extranet' messages using PractitionerRole and HealthcareService, that expects internal organisation knowledge. <br>\nFor intranet messages HealthcareService and PractitionerRole may be more practical. </p>\n<p>For pragmatic reasons it may be desirable to send pairs of references, Organisation+HealthcareService or Practitioner+PractitionerRole. Messaging infrastructure can handle what it understands.</p>",
        "id": 214667142,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1603783144
    },
    {
        "content": "<p>Right.  You shouldn't use Communication to serve the place of MessageHeader in messaging.  If you must use messaging, then use  messaging.  (Though it's better still to use REST from an interoperability/less negotiation/better re-use perspective.)</p>",
        "id": 214696841,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603804458
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> nobody is suggesting that. If we are messaging within an organisation, sending to/from services/clinics seems reasonable.</p>",
        "id": 214796295,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1603860961
    },
    {
        "content": "<p>I'm sorry, I misread the thread when responding.  It's reasonable to ask that MessageHeader support HealthCareService.</p>",
        "id": 214797299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603862606
    }
]