[
    {
        "content": "<p>In STU3, Immunization has only \"completed\" and \"entered-in-error\" as allowed statuses.  In DSTU2, there were more options (\"in-progress, on-hold\" etc) and it looks like in R4 there is an additional option \"not-done\".  I'm working on implementing STU3 and I've got immunizations that are intended for future administration, or deferred -- so they're not completed, but they're also not errors.  We also record when a patient refuses an administration -- also not completed, but also not an error.  </p>\n<p>How have others represented this data in STU3?</p>",
        "id": 157622931,
        "sender_full_name": "Samantha Mater",
        "timestamp": 1549387565
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span></p>",
        "id": 157623092,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549387731
    },
    {
        "content": "<p>The Immunization resource documents the vaccination event itself which probably explains why \"in-progress\" was removed. An immunization event is essentially instantaneous and probably doesn't have a state of being partially done.</p>\n<p>In STU3, Immunization. notGiven exists to indicate that the vaccination was not given. Presumably Immunization.status=complete and Immunization.notGiven=True would indicate a refused attempt at vaccination (hopefully with Immunization.explanation.reasonNotGiven populated). </p>\n<p>In R4, we tried to align with the Event pattern and removed notGiven and added \"not-done\" to Immunization.status</p>\n<p>One thing that we are discussing is how to document immunization orders. There are several gForge tickets on this topic and we discussed it in San Antonio. The current recommendation seems to be heading in the direction of using MedicationRequest to indicate the desire/intent to immunize and then enhancing Immunization in R5 to point back to MedicationRequest (or ImmunizationRecommendation). The MedicationRequest would be the only FHIR resource until the event actually happened at which point it would be documented with an Immunization resource.</p>\n<p>At least within the immunization community in the US, most centralized registries (who receive data from providers, pharmacies, etc) don't like to get immunization data before the event actually happens (too often providers document \"intent\" to immunize like an actual immunization event and then never go back and fill in the details (or worse yet, don't indicate when that intent is never fulfilled)). This probably contributes to the idea that Immunization is about an event which happened (or didn't happen) rather than an intent.</p>\n<p><span class=\"user-mention\" data-user-id=\"191418\">@Joginder Madra</span>  may have more to add.</p>",
        "id": 157636735,
        "sender_full_name": "Craig Newman",
        "timestamp": 1549397583
    },
    {
        "content": "<p>Planned immunizations wouldn't be represented using Immunization - they'd use MedicationRequest.</p>",
        "id": 157637014,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549397771
    },
    {
        "content": "<p>The approach Craig describes is fairly typical for the immunization reporting that I'm most familiar with in Canada</p>",
        "id": 157637579,
        "sender_full_name": "Joginder Madra",
        "timestamp": 1549398245
    },
    {
        "content": "<p>..also patient refusals are considered to be \"complete\"</p>",
        "id": 157637637,
        "sender_full_name": "Joginder Madra",
        "timestamp": 1549398328
    },
    {
        "content": "<p>There is probably a subtle distinction between \"refused\" vaccinations and \"deferred\" vaccinations. A deferral is typically a short term delay (the patient has a fever and so the vaccination is delayed until they feel better) where a refusal is likely something that would prevent a vaccination at any point in the future (medical exemption, religious exemption, etc). There is probably a fair bit of variation in how systems treat these. I've seen some systems that don't really distinguish between them (to these systems, the event didn't happen and it doesn't really matter why (although the why is often documented)). Presumably some system do distinguish between these.</p>",
        "id": 157639884,
        "sender_full_name": "Craig Newman",
        "timestamp": 1549400284
    },
    {
        "content": "<p>What about immunizations that are only partially administered (such as if a child only receives a partial dose due to knocking the needle loose or some other interruption)?</p>",
        "id": 157721194,
        "sender_full_name": "Samantha Mater",
        "timestamp": 1549483518
    },
    {
        "content": "<p>I'm not sure there is a good way to do it in STU3. <br>\nIn R4, there is the isSubpotent element to indicate that a dose was given but may not be fully effective an the subpotentReason element to indicate why it's subpotent (partial dose, cold chain break, etc).</p>",
        "id": 157723313,
        "sender_full_name": "Craig Newman",
        "timestamp": 1549485089
    },
    {
        "content": "<p>In STU3 you'll probably need an extension</p>",
        "id": 157723329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549485114
    },
    {
        "content": "<p>I'm assuming the best practice would be to base the STU3 extension on what R4 looks like. Is that true?</p>",
        "id": 157723404,
        "sender_full_name": "Craig Newman",
        "timestamp": 1549485159
    },
    {
        "content": "<p>Yes.  In fact, I belive there's an intention to define all of those.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 157723443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549485188
    }
]