[
    {
        "content": "<p>We are starting the thought process around upgrading to R4 or to skip and wait for R5. We are just seeing large scale implementation of Stu3 so the decision cannot be taken lightly. Are there any case studies around this topic and/or potential migration paths that we can consider?</p>",
        "id": 158377921,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1549998195
    },
    {
        "content": "<p>Much depends on your perspective - national, regional, vendor/product, etc. At some layers, it's a governance decision and for others more of a technical one. The most common question that I'm being asked in NZ is about the product roadmap and release timetable for R5. In particular, whether there will be breaking changes to the R4 versions of the clinical resources slated to become normative in R5 - in other words, the degree of risk in pressing the \"go\" button on R4.  I'm hoping that there might be some discussion on this at the Montreal WGM in May.</p>",
        "id": 158380112,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1549999823
    },
    {
        "content": "<p>Thanks for that take. I agree that ultimately context decides. I’m still interested in different takes as I expect many commonalities. We’ve already hit the STU3 button in 2016 so we’ve already passed phase 1 :-)</p>",
        "id": 158380503,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550000113
    },
    {
        "content": "<p>Another consideration is that many large organisations have policies that don't permit the adoption of new versions until they are considered to be mature and may even skip releases as it's not practical for them to follow an 18 month cycle. For example, I've heard that some are planning to move directly from DSTU2 to R4.</p>",
        "id": 158380795,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1550000295
    },
    {
        "content": "<p>Well yes. I for one lean towards skipping R4. R4 is a fine release but the timing for us doesn’t seem right. We need stability for implementers to give them time and space to adjust to a FHIR landscape. At least imho: we will be discussing this at scale and others may disagree or even propose a multi version landscape. We’ll see</p>",
        "id": 158381329,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550000672
    },
    {
        "content": "<p>Happy to put this topic on the agenda of the International Council meeting in Montreal.</p>",
        "id": 158381661,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1550000917
    },
    {
        "content": "<p>There's certainly a risk of breaking change in the clinical resources (other than Observation) in R5.  However, many of the resources are at level 4 or 5, so such changes will be run past the community first.  Well-used resources (AllergyIntolerance, MedicationDispense, Procedure) are unlikely to see radical change.  Others like MedicationAdministration and FamilyHistory haven't necessarily seen much use yet and could evolve a bit more significantly.  One of the interesting things to watch for is the final rules from the ONC on FHIR version.  Right now it references DSTU2 and STU3 because R4 wasn't quite out in time.  However, it might add R4 into the mix as part of the \"feedback\" process.  I know some Canadian projects that are currently using an interim release between R2 and R3 and don't plan to move until R6 when they're hopeful that all of their resources will be normative.  (Though they're paying for being on a weird version in terms of custom tooling support and not being able to interoperate with anyone else.)</p>",
        "id": 158382715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550001673
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> some round table input on if/how country affiliates deal with it might be useful for everyone? Perhaps there could even be a task on creating a checklist of things to consider in moving from version to version.</p>",
        "id": 158430322,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550054821
    },
    {
        "content": "<p>discussion at HIMSS here yesterday amongst a large group of argonaut + other venders indicated very strong support for converging on R4.</p>",
        "id": 158431344,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550056006
    },
    {
        "content": "<p>Australia will be converging on R4</p>",
        "id": 158431360,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550056015
    },
    {
        "content": "<p>Agree that this is a very excellent discussion for the international council to have</p>",
        "id": 158431382,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550056047
    }
]