[
    {
        "content": "<p>Where would I put a Study instance UID in a radiological Observation resource?<br>\nI have plain text, which is the focus of the Observation, so I'd chose value[x]=string. But I also want to add the StudyInstanceUID to the resource. Is there a recommendation where to put this?</p>",
        "id": 153843900,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471249765
    },
    {
        "content": "<p>We're currently discussing, using a DiagnosticReport with reference to both an Observation, holding the text result and a ImagingStudy holding the SIU. But it's a bit difficult/overkill to create an ImagingStudy Resource, when all I have is a SIU...</p>",
        "id": 153843902,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471250853
    },
    {
        "content": "<p>it's kind of a black art, matching study id to other things. In your case, what does it identify?</p>",
        "id": 153843906,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471253247
    },
    {
        "content": "<p>Actually, it's a parameter we'd need to call the (non-fhir) PACS webviewer to display the pics associated with the Observation.</p>",
        "id": 153843907,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471253354
    },
    {
        "content": "<p>valueAttachment?</p>",
        "id": 153843908,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471253393
    },
    {
        "content": "<p>nope. I already wasted my choice of values for the plain text of the observation.</p>",
        "id": 153843909,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471253454
    },
    {
        "content": "<p>Observation.component, maybe?</p>",
        "id": 153843910,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471253508
    },
    {
        "content": "<p>this is starting to sound like an extension then</p>",
        "id": 153843911,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471253535
    },
    {
        "content": "<p>Yes. Quite a corner case, I guess. In a (more) perfect FHIR world, the PACS would \"speak\" FHIR and we'd just reference the appropriate  ImagingStudy resource :)</p>",
        "id": 153843912,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471253678
    },
    {
        "content": "<p>one day....</p>",
        "id": 153843913,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471255108
    },
    {
        "content": "<p>Way to go :)</p>",
        "id": 153843915,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471255285
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  Can you share an example or  two?   I am looking for more imaging stuff to put in the DiagnosticReport examples</p>",
        "id": 153843942,
        "sender_full_name": "Eric Haas",
        "timestamp": 1471279478
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Agree, it does sound a little heavy weight. Although, it should be possible to fill out a skeleton ImagingStudy . Can you file a tracker item, or ballot comment, and II WG can look at this? Thanks.</p>",
        "id": 153843945,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1471282342
    },
    {
        "content": "<p>Yes, creating an ImagingStudy is definitely possible and also necessary in case you have a 1..n relationship between Observation and SIU. But since I know nothing more of the Study than it's identifier, I'm stumbeling over some 1..1 attributes (e.g. numberOfSeries).</p>\n<p>For cases in which we have a 1..1 relationship betwees Observation and SUI (or in most cases: Observation and AccessionNumber) I wonder if these could simply  be considered as Identifiers for the Observation from the PACS's namespace?</p>\n<p>As said: the main reason why we want to save these is that we need them to construct the URLs to access the Studies via a non-fhir REST service (DICOM viewer).</p>",
        "id": 153844014,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471335354
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  I just noticed those attributes too. They should probably have a min cardinality of zero. Submitted #GF10463.<br>\nBy the way, to construct the URL, you may need more than the studyUID. For example, you may need to know which server you can get these particular images from. The baseLocation element in ImagingStudy is meant to address this. If the viewer you're invoking isn't IHE IID compliant, use the extensible baseLocation.type coding, to  put in a value to identify \"Simone's viewer\" URLs.<br>\nI'd be interested to hear more about your use cases and what's needed to make them work better.</p>",
        "id": 153844043,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1471468004
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> I just noticed those attributes too. It seems to be an oversight, and they should probably have min cardinality 0. I've filed #GF10463.<br>\nI think ImagingStudy is what you want to use. In many cases having the Study UID isn't enough-- you'll need to know which server has that particular study. The baseLocation is designed exactly to support invoking a viewer on the study. (If your viewer isn't an IHE IID-compliant viewer, you can extend the baseLocation value set to include \"Simone's viewer\".)<br>\nI'd be interested in hearing more about your use cases and what's needed to support them.</p>",
        "id": 153844045,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1471468005
    },
    {
        "content": "<p>Well, I think my use case just blew up. Turned out, that the Accession number can be used just as well as a parameter for accessing the pacs viewer and that the accession number also happens to be the local identifier of the DiagnosticReport that RIS sends to HIS. So...case closed. </p>\n<p>+1 for the Change request on the cardinalities of ImagingStudy, though.</p>",
        "id": 153844632,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471877025
    }
]