[
    {
        "content": "<p>Hi,</p>\n<p>Can anyone recommend how I should specify a subscription request for new Bundles, matching specific criteria?</p>\n<p>For example, I would like to specify a subscription request for new Bundles which contain a Patient which has a managingOrganization reference to a specific Organisation resource</p>\n<p>I have found an example of this kind of subscription request , <a href=\"https://developer.nhs.uk/apis/ems-beta/explore_create_subscription.html#criteria-examples\" target=\"_blank\" title=\"https://developer.nhs.uk/apis/ems-beta/explore_create_subscription.html#criteria-examples\">https://developer.nhs.uk/apis/ems-beta/explore_create_subscription.html#criteria-examples</a></p>\n<p>However, although it isn't totally clear, this appears to use a search parameter extension <a href=\"https://fhir.nhs.uk/STU3/SearchParameter/EMS-SubscriptionRuleType-1\" target=\"_blank\" title=\"https://fhir.nhs.uk/STU3/SearchParameter/EMS-SubscriptionRuleType-1\">https://fhir.nhs.uk/STU3/SearchParameter/EMS-SubscriptionRuleType-1</a></p>\n<p>Many thanks</p>",
        "id": 178287661,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571232167
    },
    {
        "content": "<p>My original instinct was to specify a subscription to new Patient resources which met my criteria, but I can't see an obvious way of then retrieving the original message Bundle which contains that Patient resource.</p>",
        "id": 178287936,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571232350
    },
    {
        "content": "<p>Bundles can exist for a variety of reasons.  They're generally only persisted if they're FHIR documents - is that your use-case?</p>",
        "id": 178288592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571232757
    },
    {
        "content": "<p>I want to be able to access a message Bundle, as identified by search criteria which apply to one of the resources within it.</p>\n<p>I MAY have answered my own question - the _containedType parameter appears to enable this <a href=\"https://www.hl7.org/fhir/search.html#containedType\" target=\"_blank\" title=\"https://www.hl7.org/fhir/search.html#containedType\">https://www.hl7.org/fhir/search.html#containedType</a></p>\n<p>However, if the message Bundle is not persisted, then I guess that would not work?</p>",
        "id": 178288950,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571232972
    },
    {
        "content": "<p>Typically messages aren't stored if submitted for processing.  Are you just storing undirected messages and then having systems query to retrieve them?  The challenge if your Bundle is a message is that the Patient isn't at a pre-determined location.  It depends on what the focus for the message is.  That makes it hard to search on.  Unfortunately the _contained and _containedType aren't going to do what you want.  They work on 'contained' resources which is not the same as Bundle entries.  You could define a new search parameter that would let you look at any entry in the Bundle (rather than just the root MessageHeader or Composition which is all that's supported by standard search parameters).  However, you'd need to customize your server to support it.</p>",
        "id": 178290008,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571233580
    },
    {
        "content": "<p>Thanks.   So, it sounds like I would need to use documents not messages.   I am still not clear how I access the containing document Bundle though.    Feels like I am missing something obvious here, I would assume this is a pretty normal thing to do....? </p>\n<p>Basically the use-case is:<br>\n- FHIR server receiving Bundles of resources<br>\n-  My system subscribes to receive notifications of new bundles/resources, and is then able to retrieve the whole bundle.</p>",
        "id": 178290750,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571233977
    },
    {
        "content": "<p>Why is the data coming in as a Bundle at all?</p>",
        "id": 178291407,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571234397
    },
    {
        "content": "<p>If you use Document, you can access the Patient filtering on Bundle?composition.subject</p>",
        "id": 178291490,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571234421
    },
    {
        "content": "<p>Sorry, my mistake, what I am dealing with would be a transaction Bundle, not a message or a document.</p>",
        "id": 178291578,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571234483
    },
    {
        "content": "<p>The reason the data is coming in as a Bundle, is that it is a package of data required to trigger an event, which includes mandatory elements over multiple resource-types.   It's really a message at this stage in the workflow, which will be submitted as a Bundles of resources in a FHIR POST. </p>\n<p>Depending on the outcome of the event,  at a later stage of the workflow, the amount of information received on the patient would then be expanded, in one or more subsequent PUT/POST operations.</p>",
        "id": 178297681,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571238083
    },
    {
        "content": "<p>My understanding now is:</p>\n<p>- In FHIR it is not possible to re-create or reference a non-document Bundle after it has been unpacked by the FHIR service.  </p>\n<p>- If a client solution wants to subscribe to notifications about a new multi-resource batch/transaction, it needs to subscribe to a specific resource-type within that, and then resolve the references between the previously-Bundled resources, to access them all.</p>",
        "id": 178297832,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571238180
    },
    {
        "content": "<p>I think I am reassured that I am not missing some important feature of post-request, intra-Bundle referencing! </p>\n<p>I remain slightly mystified about how the NHS solution works though, <a href=\"https://developer.nhs.uk/apis/ems-beta/explore_create_subscription.html\" target=\"_blank\" title=\"https://developer.nhs.uk/apis/ems-beta/explore_create_subscription.html\">https://developer.nhs.uk/apis/ems-beta/explore_create_subscription.html</a></p>",
        "id": 178298275,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571238449
    },
    {
        "content": "<p>I wouldn't necessarily say \"it's not possible\", but it would certainly be a-typical for a system that had received a transaction Bundle and executed the transaction to subsequently make the Bundle available for retrieval via search.</p>",
        "id": 178299189,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571239058
    },
    {
        "content": "<p>Looks like the NHS solution is subscribing to Message bundles. Those could be either persisted on the server, or executed through $process-message. If they're just persisting bundles, then this is a normal subscription pattern.</p>\n<p>There was some discussion in subscriptions of subscribing to operations, i.e. \"notify when operation $foo is executed\" that could in theory apply to executing a transaction bundle. I don't think that particular idea has come up though.</p>",
        "id": 178299253,
        "sender_full_name": "Paul Church",
        "timestamp": 1571239083
    },
    {
        "content": "<p>For subscriptions, systems generally care about data that's been created or changed regardless of how the change was originated (transaction, batch or direct REST operation</p>",
        "id": 178299264,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571239089
    },
    {
        "content": "<p>The revised subscription model will indeed support subscribing to particular types of events focused on a resource/class of resources rather than just subscribing to updates to a resource that matches a particular query</p>",
        "id": 178299347,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571239159
    },
    {
        "content": "<p>Subscribing to transaction Bundles wouldn't be terribly efficient and could pose privacy/access control issues too.  A given transaction could theoretically contain data relating to thousands of patients.  If you had to query the whole Bundle to see data on a single patient of interest, that could be problematic</p>",
        "id": 178299509,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571239270
    },
    {
        "content": "<p>Yes, its only the use-case of a multi-resource transaction relating to a single patient that I am concerned with at the moment.   If it were possible to define that as an event type, and subscribe to that, that would simplify what I am currently trying to specify.</p>",
        "id": 178300091,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571239666
    },
    {
        "content": "<p>Just to throw out an alternative idea, could you accomplish roughly the same thing by subscribing to patient changes and using \"Patient/$everything?_since=[last event the client heard about]\" to figure out the full set of resources that changed?</p>",
        "id": 178300350,
        "sender_full_name": "Paul Church",
        "timestamp": 1571239820
    },
    {
        "content": "<p>Thanks.  Yes, I think this would be the pragmatic solution.  Only slight concern would be theoretical possibility of getting two co-incident requests mixed/merged.</p>",
        "id": 178467648,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571401139
    },
    {
        "content": "<p>Also the added complexity of stored date-time of most-recent previous event on the client, although I guess there could be ways round this using _history</p>",
        "id": 178467888,
        "sender_full_name": "Martin Morrey",
        "timestamp": 1571401326
    }
]