[
    {
        "content": "<p>Hello, I'm looking for advice from experts on what is the best way to represent substance use in FHIR. Is <code>MedicationStatement</code> the proper choice to represent this?<br>\nIf 'yes', then what is the way to distinguish recreational vs prescribed? <br>\nIs <code>MedicationStatement.category</code> the proper way to do it? <br>\nSay using  such codes as <code>Prescription drug (product) SCTID: 73639000</code> and <code>Non-prescription drug (product) SCTID: 80288002</code>.</p>\n<blockquote>\n<p>The 'Substance Use' section is for any drug the patient may have taken or is currently using for recreational use. This could be alcohol, tobacco, cannabis, heroin, cocaine, meth, etc.<br>\nIt is used just for knowledge. It's good to know if a patient is currently consuming psychedelic mushrooms and also taking antidepressants. This could cause “serotonin syndrome” and cause major depression for the patient. We also want to be able to help them discontinue use of harmful recreational drugs if the patient is wishing to do so. Also we should keep recreational vs prescribed separate.</p>\n</blockquote>",
        "id": 153856307,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1478776370
    },
    {
        "content": "<p>The MedicationStatement is intended to be used to represent what a patient (or a care giver or a provider) tells you the patient is taking or was taking or will take.  It can be used for prescribed drugs, over the counter drugs and other substances the patient declares.  The value set for category doesn't include recreational but does include patientspecified which is intended to support medications/substances the patient tells you about.  It also supports  inpatient, outpatient and community - which are intended to reflect the orders for medications that are administered or consumed in different settings.  </p>\n<p>Currently the codes that we provide as an example for medication are: <br>\n-Include codes from <a href=\"http://snomed.info/sct\" target=\"_blank\" title=\"http://snomed.info/sct\">http://snomed.info/sct</a> where concept is-a 410942007 (Drug or medicament (substance))<br>\n-Include codes from <a href=\"http://snomed.info/sct\" target=\"_blank\" title=\"http://snomed.info/sct\">http://snomed.info/sct</a> where concept is-a 373873005 (Pharmaceutical / biologic product (product))<br>\n-Include codes from <a href=\"http://snomed.info/sct\" target=\"_blank\" title=\"http://snomed.info/sct\">http://snomed.info/sct</a> where concept is-a 106181007 (Immunologic substance).  </p>\n<p>I believe the 2 codes you listed are children of 373873005 (Pharmaceutical / biologic product (product)).</p>\n<p>Which resource did you find the substance use section information in?  That resource may specify other ways to represent this type of substance use when it is included as part of other information.</p>",
        "id": 153856334,
        "sender_full_name": "Melva Peters",
        "timestamp": 1478787917
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>, thank you for your response. The information about  'Substance Use'  is not from any FHIR resource, it's just an explanation what we need to record in our application. This is the section that we have in our care management application. I need to find a proper FHIR resource to store this information. I'm thinking of MedicationStatement resource, and want to verify this solution with FHIR experts.</p>",
        "id": 153856357,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1478793323
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191329\">@Aleksandra Pavlyshina</span>  That sounds like Social History, which can be captured using Observation (or QuestionnaireResponse)</p>",
        "id": 153856362,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1478802221
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  Putting this a substance into social history would mean it's not considered a medication. I'd like to see a strong use case for why that is a better solution then putting it into someplace that understands this is a substance. I'd really NOT be in support of recording a substance concept as a social history. If you want something in social history, use a finding that indicates \"use of a substance.\" I see that SCT does not have \"Marijuana user\" but perhaps it should. You could put that into the social history.</p>",
        "id": 153856377,
        "sender_full_name": "Robert McClure",
        "timestamp": 1478805646
    },
    {
        "content": "<p>MedicationStatement has a \"reasonForUse\" code.  Presume that could be used to capture \"recreation\" if that were desired.  Agree with Melva that you'd want it in the same place regardless of reason - whether you're taking Marijuana for nausea, ptsd or pleasure, the ramifications in terms of adverse reactions and other considerations would be the same.</p>",
        "id": 153856385,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478808978
    },
    {
        "content": "<p>In our application, we have the following fields on the Substance Use form to capture:</p>\n<ul>\n<li>Substance Type</li>\n<li>Substance Amount</li>\n<li>Route</li>\n<li>Start Date</li>\n<li>Stop Date</li>\n<li>Is the patient actively using?    Yes/No  </li>\n<li>Does the patient desire to quit?  Yes/No</li>\n<li>Does the patient perceive any negative health effects?    Yes/No</li>\n<li>Perceived health effects? (free text)</li>\n</ul>",
        "id": 153856400,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1478811646
    },
    {
        "content": "<p>I'm not saying it couldn't also be MedicationStatement, but I am saying that Social History forms with Q&amp;A like what is listed above (e.g. desire to quit) could be considered QuestionnaireResponses and/or Observations.  The scope and usage section for Observation includes \"Social history like tobacco use\" -- which is consistent with the US-based Argonaut implementation guide as well.<br>\n<a href=\"http://build.fhir.org/observation.html#scope\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#scope\">http://build.fhir.org/observation.html#scope</a><br>\n<a href=\"http://build.fhir.org/questionnaireresponse.html#scope\" target=\"_blank\" title=\"http://build.fhir.org/questionnaireresponse.html#scope\">http://build.fhir.org/questionnaireresponse.html#scope</a><br>\n<a href=\"http://hl7.org/fhir/us/daf/2016Sep/daf-core-smokingstatus.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/daf/2016Sep/daf-core-smokingstatus.html\">http://hl7.org/fhir/us/daf/2016Sep/daf-core-smokingstatus.html</a></p>",
        "id": 153856403,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1478812192
    },
    {
        "content": "<p>The <a href=\"http://hl7.org/fhir/us/daf/2016Sep/daf-core-smokingstatus.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/daf/2016Sep/daf-core-smokingstatus.html\">http://hl7.org/fhir/us/daf/2016Sep/daf-core-smokingstatus.html</a> is social history, captured as an Observation, whether the patient currently smokes/has-ever-smoked etc. (just a simple status). To me the details of what they smoked/how much/frequency (cigs a day, year packs) would be a MedicationStatement, referenced from the social history Observation via Observation.related.target and where Observation.related.type is 'derived-from'. <br>\nWe have a use case to capture both Smoking Status as well as the details of the tobacco use. Do you see an issue with the above use of FHIR resources for this purpose? </p>",
        "id": 153862743,
        "sender_full_name": "René Spronk",
        "timestamp": 1481296821
    },
    {
        "content": "<p>mmm - with the foot note that currently (STU 3) a reference to a MedicationStatement is not allowed from an Observation.</p>",
        "id": 153862746,
        "sender_full_name": "René Spronk",
        "timestamp": 1481297511
    },
    {
        "content": "<p>I think most implementers and clinicians would find it surprising to see smoking captured as a MedicationStatement given historical precedent.  Things like packs/day, total packs, etc. have always been represented as Observations in any system I've seen.  I certainly understand why you might go that way from a pure modeling perspective, but I wouldn't condone it as terribly useful if you're wanting to interoperate with other systems.  </p>",
        "id": 153862819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481318255
    },
    {
        "content": "<p>In a related context, where would the Nocotine patches be recorded?</p>",
        "id": 153862872,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481350215
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Opinions expressed earlier in this chat seem to be different from what you're stating here. The resource itself states that one of its purposes is \"the recording of non-prescription and/or recreational drugs \". Nicotine (whether cigarettes, Patches or chewing gum) fits that definition.  A clinician may regard the use of Nicotine Patches as a drug / medication and not the recreational use of Cigarettes; just as they may regard the recreational use of Marijuana as not being a medication, whereas if one takes Marijuana to deal with the symptoms of an illness it suddenly becomes a medication. That distinction doesn't make a lot of sense to me.<br>\nIt'll be up to the implementation guides to decide what to use - the fact that historically (which means: HL7v3/CDA) this is reported using an observation doesn't mean we have to keep doing it that way.</p>",
        "id": 153862877,
        "sender_full_name": "René Spronk",
        "timestamp": 1481363042
    },
    {
        "content": "<p>(but I fully realise I'm not  a pharmacy domain pundit, hence my question)</p>",
        "id": 153862878,
        "sender_full_name": "René Spronk",
        "timestamp": 1481368089
    },
    {
        "content": "<p>The main difference is that whether a patient is taking/may take recreational drugs can have the same impact on drug-drug interactions as prescribed meds, while smoking hasn't (to my knowledge) been captured that way.  As well, many recreational drugs can be prescribed in some situations.   Fully agree that from a modeling perspective, there's no reason for smoking tobacco vs. marijuana to be modeled differently.  However, historical representation within systems *is* a good reason to keep doing it that way if there's no reason beyond modeling consistency to drive change.  (Modeling consistency may make modelers happy but implementation consistency tends to make implementers happiest and FHIR is generally focused on the latter.)</p>",
        "id": 153862884,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481383370
    },
    {
        "content": "<p>k, I see that. But if only from a standpoint to prevent adverse reactions, and certainly of one uses clinical support systems when prescribing, one would hope that those that create profiles for Tobacco Use would use MedicationStatement. I'll certainly argue in favor of it when we're going to define a Dutch FHIR profile to capture information about Tobacco use. The logical model used (a Dutch Clinical Building Block, CBB) maps neatly to it, whereas mapping it to Observation is a bit of a kludge. Either could be used if push came to shove..   </p>",
        "id": 153862885,
        "sender_full_name": "René Spronk",
        "timestamp": 1481386002
    },
    {
        "content": "<p>You could record nicotine patch use as a medicationStatement if told to you by a patient or relatedPerson or it could be as a MedicationRequest if being ordered by a prescriber.</p>",
        "id": 153862906,
        "sender_full_name": "Melva Peters",
        "timestamp": 1481412530
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> I would ask the main EHR implementers what they'd prefer to use rather than being driven by modeling.  You certainly wouldn't want to be in a situation where a modeling decision caused things to be different in the Netherlands than it is everywhere else.  That'd cause you problems using SMART on FHIR and with lots of other exchanges.</p>",
        "id": 153862948,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481471882
    },
    {
        "content": "<p>From the Cerner perspective, we are capturing Social History Q&amp;A as Observations, but that doesn't prevent a user from also documenting substance use as a MedicationStatement as well (albeit less common).  <br>\nDuring the Nov 10 HL7 Pharmacy conference call, we logged <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12340\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12340\">GF#12340</a> to clarify the MedicationStatement guidance around substance use.</p>",
        "id": 153863140,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1481552302
    }
]