[
    {
        "content": "<p>In AllergyIntolerance, there is a field reaction.substance which is a CodableConcept. But since there is a Substance resource, wouldn't it make more sense to make reaction.substance a reference instead? Pro: more expressiveness (which would help my case). Con: somewhat more convoluted if all you want is a Snomed code. What else?</p>",
        "id": 153925969,
        "sender_full_name": "Petter Wolff",
        "timestamp": 1513611917
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 153925972,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513612004
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194313\">@Petter Wolff</span> Feel free to log a change request.  I question whether Patient Care will debate whether it falls within the 80% use case here, but worth a discussion nonetheless.</p>",
        "id": 153925995,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1513621571
    },
    {
        "content": "<p>shouldn't AllergyIntollerance should be a codeableConcept OR a reference to substance|medication|...?</p>",
        "id": 153926069,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1513637686
    },
    {
        "content": "<p>Only if we think most systems support such references - and I've never seen a system capture an allergen as anything other than a code.</p>",
        "id": 153926072,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513637776
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"194313\">@Petter Wolff</span> Feel free to log a change request.  I question whether Patient Care will debate whether it falls within the 80% use case here, but worth a discussion nonetheless.</p>\n</blockquote>\n<p>Thanks. I seem to be confused by the possible/likely correlation between AI.code and AI.reaction.substance... What would several different reactions with a variety of reaction.substances  mean in the context of a specific AI.code? Every known allergen should be perfectly specified by the AI.code I guess, or otherwise any 'non-confirmed' suspicion (the caregiver's or the patient's) of what substance has caused a reaction in the context of an identified AI, should be marked clearly as such. It's a tricky subject, for sure, but it would seem to me that every AI that is \"confirmed\" should be unambiguous in terms of unwanted substances, while every reaction that cannot \"perfectly\" be linked to an identified AI.code should have it's own instance of AI, with the associated reaction descriptions.</p>",
        "id": 153926131,
        "sender_full_name": "Petter Wolff",
        "timestamp": 1513672240
    },
    {
        "content": "<p>The reaction substance is the specific product they were exposed to.  The AI.code is what they've been deemed to be allergic to - which could be an active ingredient or an excipient and often encoded at a higher level.  If a patient has had reactions to several different medications that happen to contain the same dye, the conclusion might be reached that the allergy is to the dye, but the reactions would still list each medication.</p>",
        "id": 153926244,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513698033
    },
    {
        "content": "<blockquote>\n<p>If a patient has had reactions to several different medications that happen to contain the same dye, the conclusion might be reached that the allergy is to the dye, but the reactions would still list each medication.</p>\n</blockquote>\n<p>This is partly what I'm after. You then determine the proper AI.code based on a number of reactions (to the dye, in your example). But what AI.code would you associate these reactions with, before you had determined that the dye was the culprit (or whatever active substance is in the dye)? How do you reach the conclusion that you mention, based on the FHIR data? This model does not seem to lend itself very well to help determine what intolerances to look out for, which surely would be the purpose for most requests for this resource?</p>",
        "id": 153926795,
        "sender_full_name": "Petter Wolff",
        "timestamp": 1513934470
    },
    {
        "content": "<p>You wouldn't record an allergy until you had some sense of what they were allergic to.  Or alternatively, you'd record an allergy to each medication that triggered a reaction and then eventually replace those with the new allergy that identified the dye as a culprit.  (The AdverseEvent resource is intended to support tracking all of the concommittent meds and other contextual information around a reaction or other adverse event to help in evaluating causality and evaluating appropriate mitigation steps to prevent future events.</p>",
        "id": 153926837,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513962824
    },
    {
        "content": "<p>Thanks for the input. Yeah AdverseEvent is what I'd go for (even if maturity=0), and treat AI.reaction as vestigial (and use references to AdverseEvents instead). I don't see any source system managing AIs and AEs like you propose above (with substituting allergy theories with the correct ones and linking up the associated reactions) but I'm willing to be shown evidence to the contrary.</p>",
        "id": 153926931,
        "sender_full_name": "Petter Wolff",
        "timestamp": 1514052694
    }
]