[
    {
        "content": "<p>When Subscription.channel.type == message (<a href=\"https://www.hl7.org/fhir/valueset-subscription-channel-type.html\">https://www.hl7.org/fhir/valueset-subscription-channel-type.html</a>) is that type intended to be the messaging using FHIR resources described in the spec (<a href=\"https://www.hl7.org/fhir/messaging.html\">https://www.hl7.org/fhir/messaging.html</a>)? </p>\n<p>Or can it be used for any other type of messaging/events that fit the description of: \"The channel is executed by sending a message (e.g. a Bundle with a MessageHeader resource etc.) to the application identified in the URI.\"? For example, triggering some internal event, but not sending a Bundle with a MessageHeader to do so?</p>",
        "id": 270778794,
        "sender_full_name": "Hannah Riggs",
        "timestamp": 1644012040
    },
    {
        "content": "<p>The intention is FHIR Messaging.  In R4B (via extension) and R5 the channels are extensible, so you can define your own if none of the pre-defined ones work.</p>",
        "id": 270781749,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1644013726
    },
    {
        "content": "<p>Thanks for the info; that clarifies it!</p>",
        "id": 270985482,
        "sender_full_name": "Hannah Riggs",
        "timestamp": 1644244083
    },
    {
        "content": "<p>I'm also not clear on the correct use of rest-hook (\"The channel is executed by making a post to the URI. If a payload is included, the URL is interpreted as the service base, and an update (PUT) is made.\"). Does this imply making an HTTP request somewhere?</p>",
        "id": 270988972,
        "sender_full_name": "Hannah Riggs",
        "timestamp": 1644245594
    },
    {
        "content": "<p>Yes, a <code>rest-hook</code> subscription is used for a server to send notifications via an HTTP request to the endpoint specified in the subscription, so the FHIR server makes an HTTP request when the subscription is triggered.</p>\n<p>I want to note that there have been a lot of changes to subscriptions for R5 (and R4B), so there is a lot more documentation available on those branches (e.g., <a href=\"http://build.fhir.org/subscriptions.html\">Subscriptions Framework R5</a> and <a href=\"http://build.fhir.org/ig/HL7/fhir-subscription-backport-ig/index.html\">R4B Backport IG</a>).  I also walked through topic-based subscriptions, the specs, a reference implementation, etc. for the last connectathon and posted the videos on <a href=\"https://www.youtube.com/playlist?list=PLsR-zcO--dyq3nxmrQQW0S8W-JziBd1j7\">YouTube</a> if that is helpful.</p>",
        "id": 271004678,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1644251500
    },
    {
        "content": "<p>Very helpful - thank you so much!</p>",
        "id": 271007896,
        "sender_full_name": "Hannah Riggs",
        "timestamp": 1644252906
    }
]