[
    {
        "content": "<p>Why is this extension a complex one, that replaces the AllergyInolerance.code?<br>\n<a href=\"http://build.fhir.org/extension-allergyintolerance-substanceexposurerisk.html\">http://build.fhir.org/extension-allergyintolerance-substanceexposurerisk.html</a></p>",
        "id": 221204608,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609325660
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 221560887,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609784693
    },
    {
        "content": "<p>Based on <a href=\"http://build.fhir.org/allergyintolerance.html#9.1.4.2\">http://build.fhir.org/allergyintolerance.html#9.1.4.2</a>, we noted:</p>\n<blockquote>\n<p>The substanceExposureRisk extension is also available for use as a more completely structured and flexible alternative to the 'code' element for representing positive and negative allergy and intolerance statements (either the 'code' element or the substanceExposureRisk extension may be used, but not both).</p>\n</blockquote>\n<p>Not sure if I know what you mean by \"complex\" but the intent was to offer a way to negate a substance when a precoordinated code doesn't exist.  For example, the extension isn't needed for \"No known latex allergy (situation)\" since a SNOMED code exists SCTID: 716184000.  However, less common assertions may require a combination of the substance + exposureRisk of no-known-reaction-risk</p>",
        "id": 221797211,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1609954660
    },
    {
        "content": "<p>Complex extension - contains several elements - <a href=\"https://www.hl7.org/fhir/extensibility-examples.html#complex\">https://www.hl7.org/fhir/extensibility-examples.html#complex</a>.<br>\nThe main question is  - why does the extension replace an element that is in the core resource?  Doesn't seem a good approach.<br>\nFor example I cannot make the AllergyIntolerance.code mandatory.</p>",
        "id": 221802622,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609957240
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191403\">Michelle (Moseman) Miller</span> <a href=\"#narrow/stream/179166-implementers/topic/substanceExposureRisk/near/221797211\">said</a>:</p>\n<blockquote>\n<p>the intent was to offer a way to negate a substance when a precoordinated code doesn't exist.  For example, the extension isn't needed for \"No known latex allergy (situation)\" since a SNOMED code exists SCTID: 716184000.  However, less common assertions may require a combination of the substance + exposureRisk of no-known-reaction-risk</p>\n</blockquote>\n<p>For that purpose, isn't a Modifier extension better?</p>",
        "id": 221802875,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609957354
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/extensibility.html#isModifier\">https://www.hl7.org/fhir/extensibility.html#isModifier</a></p>",
        "id": 221802881,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609957358
    },
    {
        "content": "<p>I don't see a reason why we'd duplicate (and in this case replace) the core elements.</p>",
        "id": 221802946,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609957399
    },
    {
        "content": "<p>I'm going to phone a friend here since <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  created the original JIRA and created the extension as part of <a href=\"http://jira.hl7.org/browse/FHIR-10358\">J#10358</a> back in 2016.</p>",
        "id": 222093133,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1610123390
    },
    {
        "content": "<p>Yes, that was a long time ago. :)  Let me catch up on this thread, and I'm happy to contribute.</p>",
        "id": 222098303,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1610125864
    },
    {
        "content": "<p>I don't think (unless there is a reason for it) that the ExposureRisk should repeat the substance code. It could well be a simple extension(or modifier extension if that is more accurate).</p>",
        "id": 222108858,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610130948
    },
    {
        "content": "<p>If I want to say a) \"allergic to seafood\", and if I want to say b) \"allergic to seafood - risk of anaphylaxis\", I don't see why \"seafood\" in case a) is in one element, and in case b) is another element in an extension</p>",
        "id": 222109032,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610131040
    },
    {
        "content": "<p>makes profiling esp difficult, because I want to make allergyIntolerance.code mandatory, which I cannot do if I am to support this extension</p>",
        "id": 222109094,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610131078
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>'s inclination to have the code in only one place, but there is a little more to it than that.  Even though we didn't actually make it explicit in the extension with a value set binding (and I think I probably should have, as preferred or example), the idea was that in the extension we retain the original semantics and the name of the 'substance' element, rather than the broader semantics of 'code', which logically would mean binding it to a more restricted value set that contains only codes for substances.  If we were to try to do this in the base spec using the 'code' element, I'm not sure how we would (or if we even could) go about that.  I don't think that we can effectively use an invariant to restrict or change the the allowable set of codes in the way that we would want.  So, even with the issues that Jose points out, I think it's probably best to leave the extension as it is - or, if we think that it is not useful (which may well be the case) or is too confusing or misleading, then instead to just remove it. <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 222119646,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1610136803
    },
    {
        "content": "<p>I'm not going to use it because it messes up the profile</p>",
        "id": 222121721,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610137875
    },
    {
        "content": "<p>I can understand in some cases may be for a different concept - but I don't see the use case for different codes.<br>\nStill, the issue, more than duplication, is the fact that I the extension prevents the use of allergyIntolerance.code</p>",
        "id": 222124430,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610139241
    }
]