[
    {
        "content": "<p>Is the 'district' element of address the same as 'suburb' ? My reading is that a district can include multiple cities, whereas a suburb is part of a city so they are not the same. We do want to be able to keep it separate from address lines, so are thinking that an extension is needed...</p>",
        "id": 193102692,
        "sender_full_name": "David Hay",
        "timestamp": 1586207600
    },
    {
        "content": "<p>The description says that district is the same as a county.  Based on locales I know, that is between the <code>state</code> and <code>city</code> levels.  I'm not sure there is a standard place for suburb, beyond if the city maps it (e.g., I live in Fitchburg (suburb) and can use either Fitchburg or Madison for the city in my postal address).</p>",
        "id": 193103442,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1586208018
    },
    {
        "content": "<p>what gino just said :)</p>",
        "id": 193103784,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1586208177
    },
    {
        "content": "<p>Fitchburg is not part of another city in a formal way, though. In the US the delineation of governance is quite straight forward. I believe what David is looking for is a designated area that is formally part of the city, maybe similar to <a href=\"https://en.wikipedia.org/wiki/Boroughs_of_New_York_City\" title=\"https://en.wikipedia.org/wiki/Boroughs_of_New_York_City\">Boroughs in NYC</a>.</p>",
        "id": 193104203,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1586208401
    },
    {
        "content": "<p>Yes and no.  Fitchburg is officially part of the Madison WI Metropolitan area, as defined by the Office of Management and Budget.</p>\n<p>That said, if I address a letter to Brooklyn, NY, it will be delivered (assuming I have the zip code correct).  Though part of the reason is zip code resolution, that appears to be the standard way residents of the area write their address.</p>",
        "id": 193105256,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1586208993
    },
    {
        "content": "<blockquote>\n<p>maybe similar to Boroughs in NYC.</p>\n</blockquote>\n<p>Yes - an example is the suburb of 'Mt Eden' which is part of Auckland city...</p>",
        "id": 193106927,
        "sender_full_name": "David Hay",
        "timestamp": 1586209923
    },
    {
        "content": "<p>in any case, that isn't district and you'll need an extension if you want to represent that</p>",
        "id": 193107001,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1586209970
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>  Within NZ, where the eSAM address format is required, there is an element for 'suburb', but not 'district', 'county' or 'state' .  Therefore, the suburb should be one of the address lines, or we'll need to create an extension. Thus far, in my Directory Service (which I use a fair bit myself in my day job), I've found it easy to search on suburb within address lines, but postcode is actually more useful as, in NZ at least, it covers &gt;1 suburb within a city ( very different from the UK where, in a town or city, a postcode can takes you to within 3 addresses either side of your home!).</p>",
        "id": 193107431,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1586210237
    },
    {
        "content": "<p>FYI - sorry, if it's off-topic.  Whenever I run into parts of addresses, I go back to this reference:  <a href=\"https://github.com/openvenues/libpostal#parser-labels\" title=\"https://github.com/openvenues/libpostal#parser-labels\">https://github.com/openvenues/libpostal#parser-labels</a> <br>\nI am unsure where the authoritative source is, but I think it works nicely, and it's built to be worldwide, so it doesn't get hung up on US/North America concepts.  <br>\nE.g. this is how that project delineates suburb vs district:</p>\n<ul>\n<li>...</li>\n<li>suburb: usually an unofficial neighborhood name like \"Harlem\", \"South Bronx\", or \"Crown Heights\"</li>\n<li>city_district: these are usually boroughs or districts within a city that serve some official purpose e.g. \"Brooklyn\" or \"Hackney\" or \"Bratislava IV\"</li>\n<li>city: any human settlement including cities, towns, villages, hamlets, localities, etc.</li>\n<li>...</li>\n</ul>",
        "id": 193114916,
        "sender_full_name": "Matt Zajack",
        "timestamp": 1586215177
    },
    {
        "content": "<p>In Australian addresses we generally use the city field for the suburb/locality. So Hendra and Nundah are both recorded in the city field, though both are suburbs of the city of Brisbane.</p>",
        "id": 193983416,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1586924245
    },
    {
        "content": "<p>Furthermore, Australia does not have a 1-1 between suburb and postcode.</p>",
        "id": 194015103,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1586949834
    },
    {
        "content": "<p>In Germany we add that to city, separated by a dash</p>",
        "id": 194015688,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1586950312
    }
]