[
    {
        "content": "<p>Hello, I was uploading a patient bundle to a public SMART server, <a href=\"https://r4.smarthealthit.org\">https://r4.smarthealthit.org</a>, and encountered a \"400 Bad Request\" HTTP response on an entry in the bundle. I learned that this was because the entry had an id &gt; 64 characters with some further troubleshooting. However, I believe the diagnostic message in the OperationOutcome I got from checking the response doesn't immediately indicate that: </p>\n<p>\"Can not process entity with ID[mCODETrialMatchingCancerRelatedRadiationProcedure02PatientExample02], this is not a valid FHIR ID\"</p>\n<p>I'd like to suggest that perhaps the diagnostic message could be changed to be more descriptive as to why a FHIR ID is not valid, or that an additional diagnostic message can be added to indicate that (since OperationOutcome.issue.diagnostics is an array), similar to this diagnostic message:</p>\n<p>\"Can not create resource with ID[123], no resource with this ID exists and clients may only assign IDs which contain at least one non-numeric character\".</p>\n<p>I apologize in advance if there is some terminology I could better use to describe the issue- I am still new to FHIR.</p>\n<p>edit: I've received some insight about this potentially being an issue with how the server handles invalid IDs, so this topic may not apply to the FHIR spec.</p>",
        "id": 259402659,
        "sender_full_name": "Joyce Quach",
        "timestamp": 1635433547
    },
    {
        "content": "<p>Good practice is to provide an OperationOutcome with a detailed description of why something failed.  However, depending on the layer of software at which the issue is detected, that's not always possible.  So FHIR can't make a stronger statement than we already have.  You're free to nudge particular implementers to be clearer - and sometimes they'll both be able to and care to change :)</p>",
        "id": 259405975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635434957
    }
]