[
    {
        "content": "<p>There is a UK requirement (<span class=\"user-mention\" data-user-id=\"192548\">@Alan Pinder</span> <span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> <span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> ) <br>\nto state which clinician is nominally in charge of an encounter - even though they may not be actively taking part in this encounter. The person in charge of the shift perhaps.</p>\n<p>This is in addition to a need for a role of someone actively involved in the encounter, which is ATND, attender, so it cannot be that.</p>\n<p>There has been discussion about using ADM, admitter: The practitioner who is responsible for admitting a patient to a patient encounter. </p>\n<p>This could (at a stretch imho) be interpreted is \"is responsible for the <em>admitted</em> patient\". </p>\n<p>I don't feel that is correct for this (it just has a general tone of supervision to it). And the patient may not even be \"admitted\", if that implies an \"in-patient\" and not just someone who is in the ED.</p>\n<p>I assume ADM is meant to be: \"The person who made the decision to admit the patient\"</p>\n<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  has suggested the root of ADM code may be \"a physician who is senior enough to have powers to refer people directly into hospital\", which is different again. </p>\n<p>What do PA folks think? <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 271572499,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1644584632
    },
    {
        "content": "<p>What happens if the encounter spans multiple shifts?  Would you have multiple 'responsible' practitioners each with a distinct time-period?</p>",
        "id": 271611566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644601350
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Supervising.20clinician.20for.20.20an.20encounter/near/271611566\">said</a>:</p>\n<blockquote>\n<p>What happens if the encounter spans multiple shifts?  Would you have multiple 'responsible' practitioners each with a distinct time-period?</p>\n</blockquote>\n<p>In the UK, Lloyd, the 'Responsible HCP' role is typically more like a 'Spell of Care' person - they can span several shifts.  I think there are quite specific rules in the NHS as to when an Encounter remains under one Responsible HCP vs not - typically a change of Ward or a change of Specialty will trigger a change, but not much else.</p>",
        "id": 271613780,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1644602394
    },
    {
        "content": "<p>In any case, it makes sense as a distinct participation type because it sounds like a new code is needed.  Unfortunately, because the extensible value set includes 'PART', you'll have to send it too - because it applies to everything (and essentially makes the binding 'required' rather than 'extensible').  I've submitted a change request to ditch 'PART' in R5.  <a href=\"http://jira.hl7.org/browse/FHIR-36014\">FHIR#36014</a>.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 271626614,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644608334
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .  I think its the textual definitions in <a href=\"https://build.fhir.org/valueset-encounter-participant-type.html\">https://build.fhir.org/valueset-encounter-participant-type.html</a> for ATND and ADM that are not quite fitting the UK use case.  Do they even still fit the US Use Case?  See: <a href=\"#narrow/stream/179189-uk/topic/Responsible.20Consultant.20in.20NHS.20Encouner/near/271472895\">https://chat.fhir.org/#narrow/stream/179189-uk/topic/Responsible.20Consultant.20in.20NHS.20Encouner/near/271472895</a> .   The suggestion in that thread is that we have carried over the term ADM from HL7v2, where it has grown from Admitter to Responsible Provider - during HL7v2's lifetime and certainly in the days of FHIR.</p>\n<p>So: the Responsible HCP that is usually attached to an Encounter in the UK / NHS sounds like the ADM in the textual definition of ADM in the value-set, but the word Admitter doesn't fit the normal description in our sense of who was the person that clerked them onto the ward.  The description for ATND in the valueset sounds like the Responsible HCP, but the Responsible HCP may not actually attend the patient routinely.  </p>\n<p>So if I make Responsible HCP the ADM as per the value-set description for that role (and as per mapping to the HL7v2 data that came before the FHIR..),  then I have no place for the second code the older HL7v2 systems generate, the admitter who clerked them onto the ward. And I have nothing of value to put in the role of ATND. Re <a href=\"http://jira.hl7.org/browse/FHIR-36014\">FHIR#36014</a>,  I am not sure allowing adding a new code for eg RESP. solves this without adjusting the descriptions of the other two.</p>",
        "id": 271799224,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1644829398
    },
    {
        "content": "<p>V2 codes tend to be pretty poor in terms of definitions and relationships, so using them in required and extensible bindings is always suspect.  Feel free to submit a change request to the resource.</p>",
        "id": 271842066,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644852649
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Supervising.20clinician.20for.20.20an.20encounter/near/271842066\">said</a>:</p>\n<blockquote>\n<p>V2 codes tend to be pretty poor in terms of definitions and relationships, so using them in required and extensible bindings is always suspect.  Feel free to submit a change request to the resource.</p>\n</blockquote>\n<p>don't think i know the correct process to submit one, or where?</p>",
        "id": 272150205,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1645033086
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192548\">@Alan Pinder</span> Use the 'propose a change' link at the bottom of any page in the spec.  You'll need to request an id (we manually review requests to avoid spammers).  After that, you can submit requests for change to your heart's content :)</p>",
        "id": 272170272,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645041564
    },
    {
        "content": "<p>In the US the admitting physician (rarely do other roles have admitting privileges) is the individual who is authorized (credentialed) by the facility to admit the patient.  It does not refer to someone who refers the patient for admission.  In most cases the admitting physician would also be the attending physician.  But the attending physician is the one currently holding overall responsibility for the patient in the facility (encounter).  If, as an example, the individual who admitted the patient went on vacation 2 days later, the covering physician would become the attending.  Sometimes, the patient is transferred to another service (the T in ADT) and another physician becomes the attending physician.  The attending physician is ultimately responsible 24/7, but does not have to sign off on all orders for treatment(ie all care plans) during the encounter and therefore may not be aware of those orders.</p>",
        "id": 272392237,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1645185166
    }
]