[
    {
        "content": "<p>Seeking feedback on what boundary if any exists in implementer systems Between requestng stuff for restock and for use in a patient.<br>\nNamely is there a split between patient specific requests and bulk requests for restock? <br>\nIs there a difference for  patient specific logistical request and patient specific clnical request?<br>\ni.e deliver wheelchair to room 202 for patient  </p>\n<p>vs  </p>\n<p>Order a wheelchair for Mr Smith in Room 202 because Mr Smith just had surgery and is unable to walk.</p>",
        "id": 153828237,
        "sender_full_name": "Eric Haas",
        "timestamp": 1463525889
    },
    {
        "content": "<p>isnt there similiarities all up the supply chain?</p>",
        "id": 153828239,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463526148
    },
    {
        "content": "<p>urgently supply large gloves (needed for ward 7) vs needed for room 22?</p>",
        "id": 153828240,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463526181
    },
    {
        "content": "<p>is the issue arround billability and cost tracking?</p>",
        "id": 153828241,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463526261
    },
    {
        "content": "<p>sometimes items transferred to a cost-centre, sometimes assigned to an individual patient??</p>",
        "id": 153828242,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463526368
    },
    {
        "content": "<p>ie distinction between \"billable\" and \"non-billable\" items</p>",
        "id": 153828243,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463526533
    },
    {
        "content": "<p>Mr Smith's wheel-chair probably wouldn't be billable, so even if it gets to room 202 the nurse from room 203 may pinch it first</p>",
        "id": 153828244,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463526597
    },
    {
        "content": "<p>but an expensive splint that the Mr Smith is getting a bill for would be different</p>",
        "id": 153828245,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463526667
    },
    {
        "content": "<p>The question isn't so much whether there are similarities (there definitely are), but whether most implementers differentiate the use-cases.  If they do, then distinct resources may make sense.  If they don't - i.e. they use the same database tables and/or the same user interfaces to manage both - then separate resources is going to be problematic.  The other question is, if the two use-cases are handled separately, what the \"standard\" criteria are for differentiating them.</p>",
        "id": 153828311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463532711
    }
]