[
    {
        "content": "<p>We have the need to tag a Patient as a \"donor\" or as a \"recipient.\" This is in the context of a hematopoietic stem cell transpant (eg bone marrow, peripheral blood stem cells). How would we do this? (edited typo)</p>",
        "id": 153907785,
        "sender_full_name": " Bob Milius",
        "timestamp": 1505338751
    },
    {
        "content": "<p>You could define an extension.</p>",
        "id": 153907789,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505338901
    },
    {
        "content": "<p>Meta.tag may be another option<br>\n<a href=\"https://www.hl7.org/fhir/resource-definitions.html#Meta.tag\" target=\"_blank\" title=\"https://www.hl7.org/fhir/resource-definitions.html#Meta.tag\">https://www.hl7.org/fhir/resource-definitions.html#Meta.tag</a></p>",
        "id": 153907803,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1505338988
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> this sounds like a PA issue to me. Have PS discussed it?</p>",
        "id": 153907810,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505339018
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/resource-definitions.html#Meta.tag\" target=\"_blank\" title=\"https://www.hl7.org/fhir/resource-definitions.html#Meta.tag\">https://www.hl7.org/fhir/resource-definitions.html#Meta.tag</a><br>\n\"Tags are intended to be used to identify and relate resources to process and workflow, and applications are not required to consider the tags when interpreting the meaning of a resource.\"</p>",
        "id": 153907811,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1505339040
    },
    {
        "content": "<p>Consent or Provenance might also be useful in relation to the (potential) donor recruitment process</p>",
        "id": 153907813,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1505339182
    },
    {
        "content": "<p>A given patient could be both a donor and a recipient - and might end up being both multiple times over their lifetime.  So this doesn't sound like a characteristic of Patient, but rather a characteristic of their relationship to the planned procedure. - so perhaps an extension on ProcedureRequest.subject?</p>",
        "id": 153907819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505339370
    },
    {
        "content": "<p>yes, Lloyd, good catch. This is not uncommon, so as you say it's a description of the relationship between the two patients and the transplant material itself (where it came from and who received it)</p>",
        "id": 153907832,
        "sender_full_name": " Bob Milius",
        "timestamp": 1505339538
    },
    {
        "content": "<p>We also have to identify Potential Donors, eg. those who have been typed and are entered in a donor registry, but not yet (if ever) donated</p>",
        "id": 153907844,
        "sender_full_name": " Bob Milius",
        "timestamp": 1505339694
    },
    {
        "content": "<p>So for those that have donated, you'd have an explant procedure on one patient, an inplant procedure on the other and the linkage would be the common product.  What would be the need to tag the patient themselves?</p>",
        "id": 153908015,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505360027
    },
    {
        "content": "<p>In terms of those on a donor registry, you could have a List for each type of registry</p>",
        "id": 153908016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505360042
    },
    {
        "content": "<p>I don't recall this specifically being discussed at PA, but a flag indicating is an organ donor I think does makes sense.<br>\nThe details of it that have given, or recieved a donation I agree does not belong on here.</p>",
        "id": 153908034,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1505361227
    },
    {
        "content": "<p>There's a difference between \"Patient has donated an organ\" (e.g. kidney) vs. \"Patient is willing to donate their organs upon death\".  Agree an indicator makes sense in the latter case.</p>",
        "id": 153908044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505364686
    },
    {
        "content": "<p>The CBCC committee has been asked to support this on Consent. Is that not true anymore? I have been in ongoing discussions in another stream <a href=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Organ.20Donor.20Registry.20records\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Organ.20Donor.20Registry.20records\">https://chat.fhir.org/#narrow/stream/implementers/subject/Organ.20Donor.20Registry.20records</a></p>",
        "id": 153908907,
        "sender_full_name": "John Moehrke",
        "timestamp": 1505745267
    },
    {
        "content": "<p>there's a clear difference between recording an actual consent, and flagging on the patient record that such a consent exists. In practice, existing electronic records are more likely to do the second, and delegate the 1st to an external ad-hoc system (paper, or email)</p>",
        "id": 153908942,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505769035
    },
    {
        "content": "<p>Agreed. I would not be against simple flags on the Patient. I just wanted to point out the need for a more complete model in Consent resouce; rather than creating any complex extensions in Patient. I am just bringing up the topic, and reaching out for support and eagerness to have experts help CBCC (us).</p>",
        "id": 153908955,
        "sender_full_name": "John Moehrke",
        "timestamp": 1505781368
    },
    {
        "content": "<p>Some comments/background on the hematopoietic stem cell transplantation (HSCT) story ...</p>\n<p>A need to tag (or flag) the Patient as a \"recipient\" would arise if, for example, the initial search for a donor with a matching tissue type fails and the Patient's search for a matching donor needs to continue.  Additionally, the privacy and confidentiality constraints applicable to a \"recipient\" differ from those for a donor (e.g. organizational affiliations ...).</p>\n<p>Using a FHIR List to represent the HSCT donor registry (which has over 10 million members) seems impractical.  Additional FHIR operations for working with a large List might help, but it seems the use case would still eventually require custom SOA operations.  For example, the full use case would involve a \"match result\" data structure (or resource?) containing a comparison of the (mostly HLA) tissue types of a recipient and donor.</p>\n<p>Side note:  Patients who are candidates for HSCT generally have conditions which disqualify them from acting as a HSCT donor.</p>\n<p>To me, it feels like parts of the HSCT story may be of general interest, but other parts may fall into extension territory.</p>",
        "id": 153909179,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1505879425
    }
]