[
    {
        "content": "<p>If a server receives a FHIR resource, and it detects anomalies, (but business rules require one to persist that resource anyway), how would one flag that resource and identify the issues found? meta I guess ..</p>",
        "id": 223132282,
        "sender_full_name": "René Spronk",
        "timestamp": 1610982955
    },
    {
        "content": "<p>would most applications notice a meta tag?   There is one for .meta.security = #UNCERTREL or #UNRELIABLE  --- see this valueset <a href=\"http://hl7.org/fhir/v3/SecurityIntegrityObservationValue/vs.html\">http://hl7.org/fhir/v3/SecurityIntegrityObservationValue/vs.html</a></p>",
        "id": 223136880,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610985218
    },
    {
        "content": "<p>What do you mean by \"anomalies\" and \"receive\"? If you mean a POST of a resource, my understanding is that the server is responsible to create a <strong>valid</strong> instance of the resource, and if that is different than what was POSTed, it is perfectly fine.</p>",
        "id": 223137222,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1610985384
    },
    {
        "content": "<p>_most servers do not store data as FHIR_</p>",
        "id": 223137231,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1610985388
    },
    {
        "content": "<p>Provenance can clearly be used to show any corrections of the anomalies that were fixed during import. But it would be a poor solution for pointing out anomalies that one left in the imported resource.</p>",
        "id": 223137605,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610985600
    },
    {
        "content": "<p>There may be very good business reasons for storing that that is known to be either unreliable or incomplete - would you for instance refuse a FHIR based set of resources from another hospital if the patient is currently in your ER department? Better to flag is as 'problematic data', one can always attempt to fix any issues at some later point in time.</p>",
        "id": 223141307,
        "sender_full_name": "René Spronk",
        "timestamp": 1610987501
    },
    {
        "content": "<p>I am not disagreeing that there are good business reasons to <strong>handle</strong> unreliable or incomplete resources. I think it is important to determine what is to best way to <strong>handle</strong> them in different situations.  Again, if there is a POST of a resource to a valid endpoint, the server is expected to provide the resource for subsequent GETs, and insisting that it must be capable of providing <strong>invalid</strong> resource instances is not reasonable.</p>\n<p>The use case you are providing, however, is unlikely to result in a POST. If the patient is currently in your ER department, the anomalous resource is most likely in a bundle of type \"searchset\". The question now becomes, what should I do if I get a searchset where one or more resources is \"anomalous\"?</p>\n<p>Is this a valid reduction of your initial question?</p>",
        "id": 223142732,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1610988351
    },
    {
        "content": "<p>effectively that's the same problem, but yes, it could also be a searchset. And one can support subsequent GETs, with label to indicate that ihe data doesn't follow normal quality guidelines. Servers are likely to receive data from clients that may, or may not, be conformant to one or more known/unknown profiles. (Yes one can agree to only support a limited set of profiles, but this severely limits ones options)</p>",
        "id": 223143278,
        "sender_full_name": "René Spronk",
        "timestamp": 1610988699
    },
    {
        "content": "<p>That is why I asked what the definition of \"anomalous\" is. If it means \"non-conformant for a particular profile\", but still a valid resource according to the base specification, then the question becomes, \"how do I tag a resource as not conformant to my declared capability statement?\"</p>\n<p>Is that a fair description?</p>\n<p>Even then, I think this can only go as far as an optional capability, and not the expectation that any particular FHIR server would serve resources that do not correspond to their capability statement. So you have the secondary question, if the server changes the data to fit their capability statement, how can they indicate what the original data was (John suggests provenance).</p>",
        "id": 223146027,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1610990316
    },
    {
        "content": "<p>Definitely provenance. But that wasn't the focus of my question: if a server is bound to a specific set of business rules, and hence an x number of FHIR profiles, and it receives/ingests something that doesn't conform, and can't be automatically made to conform, how would on (as a FHIR server) identify that 'please note, fields x, y and z are non-conformant', so the data can be patched during a subsequent human review process? A security tag would indicate unreliability/incompleteness, but it wouldn't tag fields x, y and z.</p>",
        "id": 223194568,
        "sender_full_name": "René Spronk",
        "timestamp": 1611041749
    },
    {
        "content": "<p>Given the conditions you have outlined, I would expect it to reject that data.     I recommend Postel's Law be applied rather than rejecting.</p>",
        "id": 223225113,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611062810
    },
    {
        "content": "<p>It might be possible to express the human review and data patching process as a workflow.</p>",
        "id": 223252059,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1611073796
    },
    {
        "content": "<p>How to know if a code system (and resulting valueset) is case sensitive?<br>\nThe valueset I am trying to use is the All-languages <a href=\"http://hl7.org/fhir/R4/valueset-all-languages.html\">http://hl7.org/fhir/R4/valueset-all-languages.html</a>.<br>\n<a href=\"https://www.hl7.org/fhir/valueset.html\">https://www.hl7.org/fhir/valueset.html</a>  says to check the underlying code system. But I can find the underlying code system.<br>\nWhen I check <a href=\"https://www.rfc-editor.org/rfc/rfc5646.txt\">https://www.rfc-editor.org/rfc/rfc5646.txt</a><br>\nit has the text: \"Modified the text in Section 2.1 to place more emphasis on the<br>\n      fact that language tags are not case sensitive.\"</p>\n<p>Does that confirm it is not case sensitive?</p>",
        "id": 243017761,
        "sender_full_name": "Sean Mahoney",
        "timestamp": 1623936882
    },
    {
        "content": "<p>I'd treat that with caution - write language tags in the correct case, and be careful to do so, but not assume all systems will when reading tags</p>",
        "id": 243067510,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623956637
    }
]