[
    {
        "content": "<p>Are there any existing tags that a server can use to indicate that a particular resource cannot be updated?</p>",
        "id": 153836824,
        "sender_full_name": "David Hay",
        "timestamp": 1467924954
    },
    {
        "content": "<p>not that I can see</p>",
        "id": 153836829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467925471
    },
    {
        "content": "<p>More tag questions.  Can tags be used to categorize resources right?  and  so why not use them instead of inline category codes for query?  ( I asked this before but I forgot the answer :-( )  If we have both then maybe some guidance around using one verses the other is needed? </p>",
        "id": 153836845,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467930258
    },
    {
        "content": "<p>One disadvantage to using tags would be that the existing category field is a CodeableConcept, so there are existing semantics for putting your category codes into valuesets and searching based on those valuesets, or based on other valuesets containing those same codes.</p>",
        "id": 153836847,
        "sender_full_name": "James Agnew",
        "timestamp": 1467930848
    },
    {
        "content": "<p>there's restrictions around the content of tags. It must be safe to ignore them, or to change them without changing the meaning of the content </p>",
        "id": 153836848,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467930924
    },
    {
        "content": "<p>Observation.category doesn't change the content.  If I mis-categorize a BP as Lab is still a BP.   I can ignore the category and look at the code - which is Rob's argument all along.   What I'm saying is that  .category is really a convenience for sort and searching.  </p>",
        "id": 153836851,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467931204
    },
    {
        "content": "<p>This is no different than a tag really.</p>",
        "id": 153836852,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467931261
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>   can't I do the same with tags which are codes too?</p>",
        "id": 153836853,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467931360
    },
    {
        "content": "<p>Actually... I suppose you could. Technically I suppose you should be allowed to say <code>Observation?_tag:in=http://some_tag_valueset</code></p>\n<p>That never occurred to me as something that would be legal to do.</p>",
        "id": 153836854,
        "sender_full_name": "James Agnew",
        "timestamp": 1467931496
    },
    {
        "content": "<p>well, tags cannot be just text. It's a lot harder to properly value set tags - mainly by intent. Tags can be changed much more easily, and are not part of the signature. It's true that we might be able to achieve the same outcomes as category using tags, but I think it would be a harder way to get to the sam epalce</p>",
        "id": 153836856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467931606
    },
    {
        "content": "<p>If they're in tags, no-one will remember to populate them is the main reason I think.  Also, it's much harder to use profiling or the spec to enforce they must be present or to constrain their values.</p>",
        "id": 153836857,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1467931632
    },
    {
        "content": "<p>Sounds a little hand wavy.  I'm not sure whether we should give some guidance or not.  let this sleeping dog lie.</p>",
        "id": 153836859,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467931994
    },
    {
        "content": "<p>What kind of guidance? \"don't put things in tags that clearly have an appropriate field in the resource\"? :)</p>",
        "id": 153836860,
        "sender_full_name": "James Agnew",
        "timestamp": 1467932092
    },
    {
        "content": "<p>yes that's a good piece of guidance</p>",
        "id": 153836866,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467935360
    },
    {
        "content": "<p>And tag changes don't flow in the history, so no good for subscriptions.</p>",
        "id": 153836928,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1467958653
    }
]