[
    {
        "content": "<p>How can I convey a target disease in Immunization in R4</p>",
        "id": 153946156,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1521457171
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191532\">@dr Kai U. Heitmann</span>  Apparently the whole vaccinationProtocol information from STU3 has been moved to the new ImmunizationEvaluation resouce:  <a href=\"http://build.fhir.org/immunizationevaluation.html\" target=\"_blank\" title=\"http://build.fhir.org/immunizationevaluation.html\">http://build.fhir.org/immunizationevaluation.html</a></p>",
        "id": 153946168,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521460338
    },
    {
        "content": "<p>Yes we know, but what is the rationale to remove the target disease  from the Immunization, and if I need it there is that an extension??</p>",
        "id": 153946193,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1521468621
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> <span class=\"user-mention\" data-user-id=\"191418\">@Joginder Madra</span> ?</p>",
        "id": 153946195,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521472112
    },
    {
        "content": "<p>The idea in STU 4 is that the Immunization resource will be a record of dose given and so the vaccine code is the key piece of information.  In the past, would you be populating both the vaccine code and the target disease and if so, why are both necessary? what happens if they contradict? For example, the vaccine code indicates that the HepA vaccine was given but that the target disease (for some reason) was Polio?</p>",
        "id": 153946209,
        "sender_full_name": "Craig Newman",
        "timestamp": 1521476568
    },
    {
        "content": "<p>Preventing contradiction is one thing that needs to be done anyhow, but what if a drug name like \"Twinrix\" doesn't tell you something about the target disease(s)? Do you expect that I have explicit knowledge of the target diseases then? What if a system like in an international patient summary consumer does not necessarily have this explicit knowledge?</p>",
        "id": 153946214,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1521477444
    },
    {
        "content": "<p>I would think that the receiving system should understand the meaning of the coded values. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  do these (the vaccine code and target disease) sound like two separate concepts to you?  In FHIR, what assumptions can be made about a system's ability to decode a coded value?</p>",
        "id": 153946226,
        "sender_full_name": "Craig Newman",
        "timestamp": 1521481998
    },
    {
        "content": "<p>The assumptions you can make depend on common implementation practice.  If sending just the code is common practice, that's fine.  If sending additional information is common practice now, that shouldn't end just because FHIR enters the picture.  Certainly the vaccine code and the disease are two different things.  One vaccine can cover multiple diseases.</p>",
        "id": 153946287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521496422
    },
    {
        "content": "<p>In my (North American-centric) experience, providers just report what they gave and not what their intent was (that's analyzed later by clinical decision support logic), but the feedback we've been getting seems to be that in other countries, having the provider report the intent of the dose (target disease, dose sequence number, etc) may be the norm. If that's the case, please submit a comment with the May 2018 ballot and we can look at adding protocol information back to Immunization, although I think we'd likely also keep the new ImmunizationEvaluation resource for the post-event CDS evaluation.</p>",
        "id": 153946436,
        "sender_full_name": "Craig Newman",
        "timestamp": 1521549688
    },
    {
        "content": "<p>Just to make the use case clearer: in an international environment there is no guarantee that the receiver knows everything about a \"local\" vaccine code, like the code for Twinrix. Neither the name tells you anything, not the official code from a country would. Therefore indicating against which target disease the patient is vaccinated is important. It is not about bringing back the whole vaccination protocol into Immunization, it is about allowing to say \"vaccinated against disease x\".</p>",
        "id": 153946796,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1521623587
    }
]