[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12657\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12657\">GF#12657</a> includes an instuction to add a rather bizarre note to the Media resource: </p>\n<p>This resource can embed the image information directly through the attachment.data element.  However, good practice is generally to use attachment.url to point to a Binary resource.  Servers will frequently be able to persist Binaries in purpose-dedicated repositories more suitable to potentially large artifacts.</p>",
        "id": 153871671,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487188000
    },
    {
        "content": "<p>I don't understand this rationale, and it will cause questions for implementers. In what sense are implementers not allowed to do purpose dedicated respositories for Media? that's a *stupid* comment</p>",
        "id": 153871672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487188037
    },
    {
        "content": "<p>I've added it, but I'd like to take it out</p>",
        "id": 153871673,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487188055
    },
    {
        "content": "<p>You're allowed to do purpose-dedicated repositories for Media or Observation or anything if you like, but it's less common (and useful) than for Binary.  Binary has no searchable metadata and is always binary information.  Media is a resource just like Observation where there's a whole bunch of Metadata.  And it's useful to be able to retrieve the Media instance without necessarily retrieving the associated binary blob.  Thus the recommendation to stick the raw data of the image/video/whatever in Binary rather than including it directly.</p>",
        "id": 153871695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487189365
    },
    {
        "content": "<p>that's a much better reason. only it's not really valid because of _summary</p>",
        "id": 153871714,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487192767
    },
    {
        "content": "<p>_summary filters a bunch of things.  If you use _summary, you exclude the mime type, size and other information until you actually retrieve the whole thing.  </p>",
        "id": 153871760,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487203260
    }
]