[
    {
        "content": "<p>In most task management programs I've used (e.g., Asana, Things, Trello, etc...) tasks have a title and a description. In the FHIR resource I only see \"description\", and no title. </p>\n<p>Should there be a title in the task resource, or is there already one there that I'm just not interpreting correctly? (i'm going through a use case right now where a title would be useful)</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153930257,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1516684846
    },
    {
        "content": "<p>Can you share the use case? There's also a workflow stream, where you may get more discussion on this...</p>",
        "id": 153930259,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1516685346
    },
    {
        "content": "<p>I'm using the /task resource to trigger a \"Request for information\" in a /referalRequest, where the provider asks for more information from the requester (such as, \"please send the assessment\".</p>\n<p>I want to build a very specific process for when the TITLE of the task is \"Request for Information\", then use the DESCRIPTION field to hold the contents of the information request (e.g., please send the assessment). </p>\n<p>When a task arrives that is titled \"Request for information\", it can trigger some specific workflow actions.</p>",
        "id": 153930260,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1516685926
    },
    {
        "content": "<p>Have you looked at <a href=\"http://build.fhir.org/communicationrequest.html\" target=\"_blank\" title=\"http://build.fhir.org/communicationrequest.html\">CommunicationRequest</a> for this instead.  Task <br>\n tracks the state of a task.  The details would be handled by this request resource.</p>",
        "id": 153930263,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516687199
    },
    {
        "content": "<p>Task.title makes sense IMO, but indeed if your use case is for the request, you may opt for the dedicated resource</p>",
        "id": 153930275,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516708874
    },
    {
        "content": "<p>Interesting, thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> and <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  , this could work ... It seems quite similar to \"task\" but has a more appropriate structure for a communication \"payload\". </p>\n<p>Would it be accurate to say that what i previously put as \"description\" (i.e., please send the assessment\") would go into the payload.contentString of the communicationRequest, and the response would come back in a communication resource?</p>",
        "id": 153930277,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1516715471
    },
    {
        "content": "<p>Along a similar lines, i find the \"status\" list on /referralRequest very limited, and so i have tried attaching a /task resource to use the tasks status field (referral is accepted/rejected/hold, etc...) as well as the custom BUSINESS status (waitlisted, deferred, no show, etc...). </p>\n<p>I call the task \"process referral request\", and attach it on submission to every /referralRequest. It lives during the whole life of the referral, and is only completed once the referral has been completed.</p>\n<p>Does this sound like an appropriate use of the task resource, or is there another purpose built resource for this?</p>",
        "id": 153930279,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1516715907
    },
    {
        "content": "<p>You can take a look at <a href=\"http://build.fhir.org/workflow-communications.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow-communications.html\">http://build.fhir.org/workflow-communications.html</a> to see a (totally made up) example of task, task status, statusReason, and businessStatus for a referral.</p>",
        "id": 153930280,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1516716531
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  ... those processes seem pretty spot on for what I'm trying to do. Seems like /task may indeed be the correct choice for this particular flow, and replace my \"Request for Information\" task with CommunicationRequest.</p>",
        "id": 153930281,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1516716731
    },
    {
        "content": "<p>I guess i should start calling my referralRequest ServiceRequest by the looks of it...</p>",
        "id": 153930282,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1516717237
    },
    {
        "content": "<p>What is the best way to submit a file attachment with a ServiceRequest (e.g., an assessment PDF)? </p>\n<p>I see in  <a href=\"http://build.fhir.org/workflow-communications.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow-communications.html\">http://build.fhir.org/workflow-communications.html</a> that <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> pointed me to that when completing a referral, the suggestion is to reference a composition resource. Would a composition resource be the best way for the requester to submit attachments too?  Or should i use a simpler format such as a document reference, or binary? </p>\n<p>Also, should it be reference via serviceRequest.supportingInfo, or some other mechanism? (such as a communicationRequest)</p>",
        "id": 153930295,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1516721060
    },
    {
        "content": "<p>RE: What is the best way to submit a file attachment with a ServiceRequest (e.g., an assessment PDF)?</p>\n<p><a href=\"http://build.fhir.org/servicerequest-definitions.html#ServiceRequest.supportingInfo\" target=\"_blank\" title=\"http://build.fhir.org/servicerequest-definitions.html#ServiceRequest.supportingInfo\">ServiceRequest.supportingInformation</a> --&gt; reference(DocumentReference|Binary) is one way</p>",
        "id": 153930299,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516722312
    },
    {
        "content": "<p>In my opinion, using the composition resource is the preferred way to reference different types of documents, including binary documents like a PDF.  One option in this case would be to reference a composition from task.input.</p>",
        "id": 153930301,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1516722442
    },
    {
        "content": "<p>IMO  :-) If all you want is to attach a pdf then using supportingInformation would be fine.</p>",
        "id": 153930308,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516722698
    },
    {
        "content": "<p>Composition would be unnecessary overhead to convey a PDF.  A plain PDF would be a Binary resource.  A PDF with some metadata would be DocumentReference (and the content conveyed in DocumentReference.content.attachment).</p>\n<p>On the original question, we talked briefly about adding title, but couldn't think of a situation where Task.code.text wouldn't satisfy the need and we didn't want to provide two ways to say the same thing.  If you have a need for both, feel free to use the \"propose a change\" link at the bottom of the resource.  And if you think that Task.code.text will meet your needs, feel free to submit a change proposal to make this use more obvious through both examples and perhaps some usage notes :)</p>",
        "id": 153930313,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516723023
    },
    {
        "content": "<p>You are correct, I was mixing composition and documentReference. I do think that some metadata is preferred. As to why to link to it from the task resource, in a managed workflow the task resource is expected to be shared by the two sides.</p>",
        "id": 153930355,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1516727082
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> , this is really helpful, in fact this is exactly the clarification I needed. </p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Ok, I see how  task.code.text could work just fine for the scenario i originally described. I guess pulling that observation out the documentation then might be the only thing. </p>\n<p>I've never submitted a change proposal, how do i do that?</p>",
        "id": 153930534,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1516828789
    },
    {
        "content": "<p>At the bottom of every page in the spec there's a \"Propose a Change\" link.  The first time you'll need to register and we'll confirm that you appear to be a real human being as opposed to a bot that wants to sell stuff.  That's a manual process and can sometimes take a businesss day or two, though usually it's pretty fast.  Keep an eye on your spam folder for a response.  Once that's done, you can request any change you like and will be able to see as your suggestions are commented on, scheduled, resolved, etc.  (You can also search and see what other changes are pending and can subscribe to them if you wish.)</p>",
        "id": 153930577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516833409
    },
    {
        "content": "<p>If you hit any issues, let me know.</p>",
        "id": 153930578,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516833417
    }
]