[
    {
        "content": "<p>Seeking feedback on how systems differentiate between Task vs Procedure, so we can beef up the boundaries section of these resources.</p>\n<p><strong>Background</strong>:  This topic surfaced when a question was raised whether to use Task or Procedure to represent medication reconciliation was completed. DaVinci landed on using Task due to it being more administrative in nature.  However, please note that Procedure recently expanded its scope to include activities performed ON, WITH, or FOR a patient to accommodate long term services (such as installing a wheel chair ramp, flashing doorbell, transportation, or walking the dog).</p>",
        "id": 153975778,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1531837515
    },
    {
        "content": "<p>Task is intended for a few things:<br>\n- checklist items where you've got a hierarchy of steps to be performed (possibly assigned to different people)<br>\n- asking for things to be done to a record/tracking things done to a record (e.g. \"please suspend\", \"please cancel\", \"please fulfill\"<br>\n- tracking the details of the fulfillment process (e.g. \"has the specimen been drawn?  the blood centrifuged?  preliminary results recorded?  waiting on sign-off?\")</p>",
        "id": 153975780,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531837955
    },
    {
        "content": "<p>Procedure is more about actions that result in physical or mental change</p>",
        "id": 153975781,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531837980
    },
    {
        "content": "<p>However, it would be useful to know what sorts of divisions of records actually exist in real systems - is there a boundary between where you capture information about surgeries, physio therapy and training from where you track \"Dr. X would like this prescription to be suspended\"?</p>",
        "id": 153975782,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531838049
    },
    {
        "content": "<p>Task is an intent, where as procedure is an event record (technically, those are the act.mood mappings). Doesn't that define a very big differentiation?</p>",
        "id": 153975857,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531862899
    },
    {
        "content": "<p>this difference is clear in the scope definitions for the 2 resources</p>",
        "id": 153975858,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531862937
    },
    {
        "content": "<p>Task spans both intent and event</p>",
        "id": 153975867,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531863687
    },
    {
        "content": "<p>It tracks the execution through to completion.  A Task can be \"in progress\".  A ServiceRequest can't - the ServiceRequest can only be active - i.e. an active authorization.</p>",
        "id": 153975868,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531863763
    },
    {
        "content": "<p>(Though this point does mean we also need to differentiate ServiceRequest from Task...)</p>",
        "id": 153975870,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531863794
    },
    {
        "content": "<p>better update the mappings then</p>",
        "id": 153975873,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531863822
    },
    {
        "content": "<p>RIM mappings?</p>",
        "id": 153975881,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531864310
    },
    {
        "content": "<p>y</p>",
        "id": 153975887,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531865744
    },
    {
        "content": "<p>Proper RIM mappings on this are going to be a real pain.  The set of statuses probably cover at least 3 different acts and I don't really know how to express that within the mapping syntax we have.  We do have mappings to both the Request and Event patterns.</p>",
        "id": 153975893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531866688
    },
    {
        "content": "<p>Here is what I have summarized from this stream and would like to add to the boundaries section of Task:</p>\n<blockquote>\n<p>Task spans both intent and event and tracks the execution through to completion.  Task is intended for \"administrative\" actions like requesting and tracking things to be done to a record, or keeping track of a checklist of steps to be performed as part of a fulfilment process.  In contrast to Task,  Procedure is an event record and is more about actions that result in changes to a patient. and ServiceRequest  is a record of a request for a service to be performed that would result in a procedure.</p>\n</blockquote>",
        "id": 153977678,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532452213
    },
    {
        "content": "<p>and this to ServiceRequest:</p>",
        "id": 153977684,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532453181
    },
    {
        "content": "<blockquote>\n<p>ServiceRequest is a record of a request for a service to be performed that would result in a procedure. In contrast to ServiceRequest, Task which spans both intent and event and tracks the execution through to completion and  is intended for \"administrative\" actions like requesting and tracking things to be done to a record, or keeping track of a checklist of steps such to be performed as part of a fulfilment process.  A ServiceRequest can be higher-level authorization that triggered the creation of Task, or it can be the \"request\" resource Task is seeking to fulfill.</p>\n</blockquote>",
        "id": 153977685,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532453526
    },
    {
        "content": "<p>On Task, last sentence, change \"and ServiceRequest...\" to \"ServiceRequest is a record of a proposal/plan or order for a service to be performed that would result in a Procedure, Observation, DiagnosticReport, ImagingStudy or similar resource.\"  Same change for first sentence for ServiceReuqest.</p>",
        "id": 153977773,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532478186
    },
    {
        "content": "<p>Fine with the remainder.</p>",
        "id": 153977774,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532478203
    },
    {
        "content": "<p>So let's see if were all in agreement for the following examples:<br>\n1. Provider contact instructions (Call provider if SBP &lt; 90, ....)<br>\n2. Specialist Consult Order (consult cardiology ...)<br>\n3. Order to perform an intervention (Take vitals, BGL, IV start, etc.)<br>\n4. Wound change directions/order.<br>\n5. HIM request for documentation correction.</p>",
        "id": 153977794,
        "sender_full_name": "Brian Zimbelman",
        "timestamp": 1532482723
    },
    {
        "content": "<p>1. Task (though we may need to make the definition clearer)<br>\n2. ServiceRequest<br>\n3. ServiceRequest<br>\n4. ServiceRequest<br>\n5. Task</p>",
        "id": 153977797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532484145
    },
    {
        "content": "<p>For #1, couldn't that also be a CommunicationRequest?</p>",
        "id": 153977884,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1532523312
    },
    {
        "content": "<p>You could, though CommunicationRequest doesn't have the notion of pre-condition and the focus of CommunicationRequest is \"please share information X\" and it's not totally clear what the 'X' would be here.</p>",
        "id": 153977896,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532528193
    },
    {
        "content": "<p>The reason why I mentioned CommunicationRequest was due to its scope including the following statement:</p>\n<blockquote>\n<p>A physician requesting notification from the nurse if a patient's temperature exceeds a value</p>\n</blockquote>",
        "id": 153977959,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1532535858
    },
    {
        "content": "<p>Sounds like some differentiation between CommunicationRequest and Task would be a good idea too... :)</p>",
        "id": 153977961,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532535996
    },
    {
        "content": "<p>Does Task handle pre-conditions?  If so, where?</p>",
        "id": 153977963,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1532536094
    },
    {
        "content": "<p>Not coded ones, no.  But I expect a lot of tasks won't be coded - the instructions will just be in Task.code.text</p>",
        "id": 153977964,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532536429
    },
    {
        "content": "<p>OK updated BNRs</p>\n<blockquote>\n<p>Task spans both intent and event and tracks the execution through to completion. Task is intended for \"administrative\" actions like requesting and tracking things to be done to a record, or keeping track of a checklist of steps to be performed as part of a fulfilment process. In contrast to Task, Procedure is an event record and is more about actions that result in changes to a patient. ServiceRequest is a record of a proposal/plan or order for a service to be performed that would result in a Procedure, Observation, DiagnosticReport, ImagingStudy or similar resource.  CommunicationRequest is record of a request for a communication to be performed between patients, practitioners, related persons, organizations, and/or devices.</p>\n<p>ServiceRequest is a record of a proposal/plan or order for a service to be performed that would result in a Procedure, Observation, DiagnosticReport, ImagingStudy or similar resource. In contrast to ServiceRequest, Task which spans both intent and event and tracks the execution through to completion and is intended for \"administrative\" actions like requesting and tracking things to be done to a record, or keeping track of a checklist of steps such to be performed as part of a fulfilment process. A ServiceRequest can be higher-level authorization that triggered the creation of Task, or it can be the \"request\" resource Task is seeking to fulfill.</p>\n</blockquote>",
        "id": 153978026,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532549153
    },
    {
        "content": "<p>Consider the ability to identify the status or outcome of a service:                                  Status<br>\nWorkflow<br>\n[Intent – proposed, planned, order, etc.]<br>\nScheduled<br>\nInitiated (for lab test this might mean specimen obtained)<br>\nIn progress (may include sub-levels e.g., lab test – received in lab, on machine, machine output, verification)<br>\nFinished (e.g., result reported/available to others)<br>\n                                                                                                                                                                 Adequacy<br>\nFully able to provide an answer for next step in workflow<br>\nPartially able to provide an answer but sufficient not to repeat<br>\nPartially able to provide an answer but needs repeat to be sure<br>\nUnable to provide an answer</p>\n<p>Outcome<br>\nPatient-centered results that lead to next steps in evaluation or treatment<br>\nMay require additional information (e.g., pathology report from biopsy obtained at a procedure)</p>",
        "id": 154003411,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1538337408
    }
]