[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"401577\">Kyle Thompson</span> has marked this topic as unresolved.</p>",
        "id": 276099468,
        "sender_full_name": "Notification Bot",
        "timestamp": 1647889434
    },
    {
        "content": "<p>I am looking for feedback on how we are interpreting and planning on implementing using Tasks to fulfill a RequestGroup <a href=\"/user_uploads/10155/HUga2PZaF4Swz40eDz5RQxgs/Proposed-Fulfillment-of-RequestGroup.pdf\">Proposed-Fulfillment-of-RequestGroup.pdf</a>.</p>\n<ol start=\"0\">\n<li>\n<p>RequestGroup will be treated as a monolithic Request. Each referenced ServiceRequest will have the same status as the referencing RequestGroup. The RequestGroup is only used to capture the complex timing and orderings of the Request.</p>\n</li>\n<li>\n<p>The green Tasks seek fulfillment of the referenced ServiceRequests. These will be assigned to individuals to preform. Note, the individuals owning each Task could be different.</p>\n</li>\n<li>\n<p>The grey Task seeks fulfillment of the entire RequestGroup.  Each green Task will reference the grey Task through the partOf field. The grey Task  will be assigned to our system since the system is responsible for fulfilling the RequestGroup and making sure that each of the green Tasks is actioned out properly.</p>\n</li>\n</ol>",
        "id": 276104448,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1647892167
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"456716\">@Dario Segura</span></p>",
        "id": 276104476,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1647892178
    },
    {
        "content": "<p>That's completely viable.  Presumably if a green task failed, you'd either create a replacement, fail the RequestGroup or deem that the overall RequestGroup was 'sufficiently' complete based on completion of the remaining Tasks and/or evolution of circumstances.</p>",
        "id": 276125359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647904128
    }
]