[
    {
        "content": "<p>The \"task\" <a href=\"http://build.fhir.org/task-definitions.html#Task.basedOn\" target=\"_blank\" title=\"http://build.fhir.org/task-definitions.html#Task.basedOn\">documentation says</a>:</p>\n<blockquote>\n<p>For example, based on a ProcedureRequest (= BasedOn), a task is created to fulfil a procedureRequest ( = FocusOn ) to collect a specimen from a patient.</p>\n</blockquote>\n<p>is this a typo? Are we saying that a given task might \"focus on\" *and* be \"based on\" the same ProcedureRequest? Or two different ProcedureRequests? I'd propose a clearer example, but I don't understand what's happening yet.</p>",
        "id": 153875515,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1488981830
    },
    {
        "content": "<p>It would have to be two different procedure requests.  \"basedOn\" is \"under what authorization is this task being undertaken\".  Focus is \"what is being manipulated by the task\".  It would make no sense for an authorization to be created that authorizes the manipulation of itself.</p>",
        "id": 153875547,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488990881
    },
    {
        "content": "<p>If you have \"QA\" recommendations to improve either definition, they're welcome</p>",
        "id": 153875548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488991078
    },
    {
        "content": "<p>I'm hoping the documentation could include an example spelling out a scenario where both are used. As it is (including your explanation here) I just can't understand it. </p>",
        "id": 153875555,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1488992692
    },
    {
        "content": "<p>K.  Example: You have a ProcedureRequest A that orders a surgery.  Scheduling software creates a bunch of child ProcedureRequests, one of which (PR 'B') is to have some pre-surgical lab work done.  A task is created seeking to get the lab work to be performed at a particular community lab.  That task would be \"basedOn\" PR 'A' and would have a focus of PR 'B'.  Does that make sense?</p>",
        "id": 153875563,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488996567
    },
    {
        "content": "<p>Maybe. Is it \"based on PR A\" because PR A is the root task that you find when climbing up the parent hierarchy from PR B? Or for some other reason?</p>",
        "id": 153875884,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1489097443
    },
    {
        "content": "<p>It's based on PR A because the legal authorization for doing the pre-surgical lab tests stems from the order for the procedure.</p>",
        "id": 153875897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489099377
    },
    {
        "content": "<p>\"based on\" is all about chain of responsibility</p>",
        "id": 153875898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489099402
    },
    {
        "content": "<p>Filler order D created by Lab Inc. is \"based on\" lab order C created by Dr. Smith.  Lab order C exists \"based on\" the care plan B put together by Dr. Jones.  Care plan B is \"based on\" recommendation A from decision support system XYZ.</p>",
        "id": 153875901,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489099556
    },
    {
        "content": "<p>Thus some degree of fault/responsibility for Filler order D is held by Dr. Smith, Dr. Jones and decision support system XYZ, despite the fact that it was authored by Lab Inc.</p>",
        "id": 153875902,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489099623
    },
    {
        "content": "<p>My simple example in the spec is a request and task for a lab spawns a request and task for a blood draw.</p>",
        "id": 153875918,
        "sender_full_name": "Eric Haas",
        "timestamp": 1489101808
    },
    {
        "content": "<p>Argh. Every time I try to understand this I feel more and more lost.</p>",
        "id": 153876069,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1489181075
    },
    {
        "content": "<p>I wish I could make a more constructive comment.</p>",
        "id": 153876070,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1489181084
    }
]