[
    {
        "content": "<p>anyone have comments?</p>",
        "id": 153872278,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487309555
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=11028\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=11028\">GF#11028</a> says that \"the semantics of an element comes from the mappings, not the code\" .But the definition of elementDefinition.code is 'A code that provides the meaning for the element according to a particular terminology.'</p>",
        "id": 153872279,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487309555
    },
    {
        "content": "<p>these seem rather in conflict with each other</p>",
        "id": 153872280,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487309555
    },
    {
        "content": "<p>The semantics of the element come from the element definition.  The semantics of the element may be interpreted as they correspond to other things using the code and/or mappings - and you can have multiples of each.  To suggest that the mappings or the code are \"definitional\" would be problematic, I think.</p>",
        "id": 153872286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487310563
    },
    {
        "content": "<p>that leads to even more redefinition of code &amp; mapping than I had in mind. What do we wnat to do with this? </p>",
        "id": 153872289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487310698
    },
    {
        "content": "<p>Well, I don't think the definition for \"code\" is too bad.  The big problem is we don't really want to do what CIMI wants - which is to say that an element is definitively defined by some external terminology.  However, it's a negative that was found persuasive and the ballot reconciliation sheet is out.  So I'm not sure we have much choice other than to apply the disposition as written.  Write up a new CR to consider in release 4 to fix this - it's not like anyone outside of CIMI is likely to care.</p>",
        "id": 153872296,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487312354
    },
    {
        "content": "<p>you don't think that 'A code that provides the meaning for the element according to a particular terminology' is a problem?</p>",
        "id": 153872298,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487312466
    },
    {
        "content": "<p>I don't know what I would apply. put a note against some defined as 'providing the meaning' to say that it doesn't actually provide the meaning? </p>",
        "id": 153872300,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487312503
    },
    {
        "content": "<p>I read that definition as \"this is what this element means from LOINC's perspective; and from SNOMED's perspective; and from ICD9's perspective . . .\"</p>",
        "id": 153872301,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487312747
    },
    {
        "content": "<p>I don't see a 'code' element (or the definition Grahame quoted) actually represented in the resource (current build).  What am I missing?</p>",
        "id": 153872323,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1487321449
    },
    {
        "content": "<p>ElementDefinition.code</p>",
        "id": 153872334,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487322968
    },
    {
        "content": "<p>ok - that makes more sense - the tracker is about StructureDefinition, so I wasn't thinking about drilling in further to ElementDefinition  </p>",
        "id": 153872336,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1487323654
    }
]