[
    {
        "content": "<p>What's the best way to represent the tattoos that a person may have? My initial thought was to have an Observation for each one, but I'm wondering if an extension to Patient might be a simpler approach...</p>",
        "id": 153839039,
        "sender_full_name": "David Hay",
        "timestamp": 1468791947
    },
    {
        "content": "<p>you want photos with that? </p>",
        "id": 153839042,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468792707
    },
    {
        "content": "<p>eventually...</p>",
        "id": 153839051,
        "sender_full_name": "David Hay",
        "timestamp": 1468795372
    },
    {
        "content": "<p>sounds like an administative observation to me </p>",
        "id": 153839054,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468797216
    },
    {
        "content": "<p>Yes, not an extension on the Patient, especially if you also want the photo's too.</p>",
        "id": 153839061,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468799474
    },
    {
        "content": "<p>I understood this was a use of Patient.photo? Is it really an Observation? Is the Tattoo being considered medically relevant, or as an identity confirmation method?</p>",
        "id": 153839366,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468851321
    },
    {
        "content": "<p>Patient.photo is for a head-shot to use in recognition.  It's not for specific images of particular tattoos.  (I'm quite curious what the use-case is to capture images of a patient's tattoos in a healthcare setting . . .)</p>",
        "id": 153839377,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468857288
    },
    {
        "content": "<p>I have been thinking about other contexts for using the patient data structure and want to represent tattoos for identity confirmation. So yes, it would be for specific images of particular tattoos.</p>",
        "id": 153839629,
        "sender_full_name": "Reuben Bijl",
        "timestamp": 1468923607
    },
    {
        "content": "<p>I've heard of doing that for law enforcement.  Not something I'm familiar with in the healthcare space.</p>",
        "id": 153839657,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468935759
    },
    {
        "content": "<p>Patients in a prison...</p>",
        "id": 153839728,
        "sender_full_name": "David Hay",
        "timestamp": 1468950261
    },
    {
        "content": "<p>Identification of a corpse (patient identity is unknown and pre-deceased)</p>",
        "id": 153839729,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1468950362
    },
    {
        "content": "<p>In this instance a picture of the face may not provide useful information</p>",
        "id": 153839730,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1468950437
    },
    {
        "content": "<p>HSPC has (or is developing) a FHIR profile for skin assessment. Would tattoo fit in there? but not for identification purposes</p>",
        "id": 153839736,
        "sender_full_name": "Bret H",
        "timestamp": 1468953175
    },
    {
        "content": "<p>generally, there's an overlap between healthcare and law enforcement in lots of jurisdictions</p>",
        "id": 153839753,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955815
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> - going back to an earlier comment - there's no extension for an Administration Observation. Shoudn't we define one?</p>",
        "id": 153839754,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955882
    },
    {
        "content": "<p>I don't know how it would/should be coded it, but a tattoo I would have expected in the observation, as they are timed, and may change over time, just like a mole. (and could be removed too).<br>\nWhich is really why I don't lean toward the extension on patient, or photo on patient.<br>\n(That and would need some form of tag on the photo to indicate which to use, and would be a lot of baggage to drg around with the patient resource, than a low res photo to assit in identification)</p>",
        "id": 153839797,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468959674
    },
    {
        "content": "<p>I'd leave how to code the observation up to the PC folk to define. (well not me anyway ;)</p>",
        "id": 153839798,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468959706
    },
    {
        "content": "<p>well, I was asking about administrative observsations generally. we've certainly seen lots of them over the years, and there's a number of the v2 segments. So wouldn't it make sense for PA to define a standard extension on Patient where you can refer to an observation made about the patient? Of course these are observations precisely because these are changeable values....</p>",
        "id": 153839803,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468960931
    },
    {
        "content": "<p>It would also be reasonable for there to be a distinct \"category\" for administration observations too (as a sibling to vitals, lab, etc.</p>",
        "id": 153839839,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468966347
    },
    {
        "content": "<p>I think we should be clear on the intended use of the tattoo picture. If it is just for Identification, then it is best in Patient.photo. If it is something being treated, or affecting treatment; then it logically becomes an observation. Both use-cases seem reasonable, but using Observation for both could be very combersome for identity purposes. For example the person that needs access to the photo might not be the kind of person you want to give access to Observations. (going back to the Jail, but applicable everywhere too).</p>",
        "id": 153839846,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468967970
    },
    {
        "content": "<p>I was surprised to find that Patient.photo was a 0..* as the primary use-case - showing a headshot when retrieving a list of possible matches requires only 1 - and would need to choose from among the list to display only one.</p>",
        "id": 153839858,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468968337
    },
    {
        "content": "<p>By the way, If doing this for treatment purposes, there are photo image quality and calibration issues that can't be ignored.  FDA, ICC, DICOM, and others have image objects and calibration requirements covered.  That's a different use case.</p>",
        "id": 153839881,
        "sender_full_name": "Robert Horn",
        "timestamp": 1468969126
    },
    {
        "content": "<p>Tattoo removal in cosmetic surgery would be health care. Before and after photos could be useful.</p>",
        "id": 153839891,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1468972029
    },
    {
        "content": "<p>Just an FYI on the photo as implemented in one of our production systems (not FHIR) we only have a single photo, and it is always reduced in size to be contained within a 300x300pixel box (which ensures size is more sensible, as had some 14MB images which slowed things down somewhat)</p>",
        "id": 153839897,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468974158
    }
]