[
    {
        "content": "<p>Hi,</p>\n<p>Long time lurker, first time posting.</p>\n<p>I'm looking at using FHIR data model for a (hopefully) simple teledermatology app for our public clinic.</p>\n<p>We want to enable patients to send photos of rashes using their mobile. This will allow us to monitor response to treatment more closely without the need to recall them physically to the clinic. (We have many patients who live several hours away.)</p>\n<p>I'm wondering what the best FHIR resource is to represent a patient sending a message to the clinic with one or more photos attached with a simple comment. Is it Encounter + a reference to a Media resource? Or is it a referral?</p>\n<p>What is the best FHIR resource to represent a clinician responding with instructions in response to the patient's message? Communication?</p>\n<p>Thanks,</p>\n<p>Blake</p>",
        "id": 153897416,
        "sender_full_name": "Blake Mumford",
        "timestamp": 1500525140
    },
    {
        "content": "<p>Maybe the patient sends the photos in Observation.component.valueAttachment and the comments in Observation.comment.</p>",
        "id": 153897417,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1500527924
    },
    {
        "content": "<p>Maybe the clinician response can be a Communication with a Clinical Impression and a Task</p>",
        "id": 153897418,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1500528290
    },
    {
        "content": "<p>Pictures are most ideally represented using Media.  Comment would be Observation.  \"Sending instructions\" depends on the types of instructions you're providing - ProcedureRequest or CarePlan are the most likely...</p>",
        "id": 153897419,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500528357
    },
    {
        "content": "<p>Thanks! I'll give those a go</p>",
        "id": 153897420,
        "sender_full_name": "Blake Mumford",
        "timestamp": 1500540943
    },
    {
        "content": "<p>Just an FYI, but when you're sending the images, check on the sizes that you're sending, and in your create call, you might want to set the prefer header to <code>outcome</code> so that you don't get the image sent back to you that you just saved.<br>\n<a href=\"http://hl7.org/fhir/http.html#2.21.0.5.2\" target=\"_blank\" title=\"http://hl7.org/fhir/http.html#2.21.0.5.2\">http://hl7.org/fhir/http.html#2.21.0.5.2</a></p>",
        "id": 153897841,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1500870135
    }
]