[
    {
        "content": "<p>I am working on a profile for blood glucose for a context in which both mg/dL and mmol/L are commonly used as units (they differ only by a conversion factor). I expected there to be a LOINC code that would cover both units, but as far as I can tell (corrections welcome...), the relevant LOINC codes are either specifically for blood glucose in moles/volume (15074-8, 14749-6) or in mass/volume (2345-7). One could imagine different ways of dealing with this:</p>\n<p>1. Make two profiles - one per LOINC code - fixing the units accordingly<br>\n2. Make a single profile for which the <code>code</code> field is bound to a value set containing the two LOINC codes (and possibly with constraints enforcing the appropriate units based on the code)<br>\n3. Make a single profile with a custom code for blood glucose (no unit format specified) and allow both units.<br>\n4. Choose one set of units and the corresponding LOINC code, and force clients to convert on their side if they use the other units.</p>\n<p>The examples I have seen (which may be from regions where only a single unit is common) go with option 4. Option 1 is easier on the clients,  sticks with a standard code system,  and avoids complicated constraints (making it more transparent),  but it requires two profiles for what is really a single type of measurement. Does anyone have experience and/or good arguments from similar cases?</p>",
        "id": 154026317,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1545220381
    },
    {
        "content": "<p>1. is easier on clients for creating, but harder on clients for querying, harder on decision support systems, etc.  Having the data in consistent form is generally useful.  And for the clients, they're often having to do some degree of unit conversion and code conversion even to comply with the base LOINC codes, so a bit more conversion to a standard representation isn't necessarily that much of an ask.  (And doing so benefits everyone downstream.)</p>",
        "id": 154026341,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545232116
    },
    {
        "content": "<p>#1 is the approach we've taken for standardizing vital signs.</p>",
        "id": 154026342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545232161
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ! Just to make sure I understand you correctly,  are you saying that #4 (single profile w. single LOINC) is preferable (consistent, easy query, not much extra work for clients)?</p>",
        "id": 154026448,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1545254418
    },
    {
        "content": "<p>Yes.  It's a bit more work for clients on the create side, but easier for all clients for query/analysis/decision support</p>",
        "id": 154026450,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545254839
    },
    {
        "content": "<p>This is a trap, this one, because it's not about unit conversion. concentration vs mass is a bit more fundamental than this. if you're good, you can still convert, but you need to know the mass of a glucose molecule to do so. Bread and butter once you do (for a lab weenie anyway). I don't believe that LOINC captures the molecular mass anywhere? (we could publish a code system supplement?)</p>",
        "id": 154026459,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1545257483
    },
    {
        "content": "<p>I think that most clinical chemists would argue that this kind of conversion is outside the scope of what software should be doing; they choose mass or concentration for a reason (and reflecting on this, mass vs concentration in plasma is much more complicated than a simple conversion in simple aqueous solution). So from a clinical perspective, you have to choose either #1 or #2. I'd lean towards #2 but I don't know what your deployment issues are</p>",
        "id": 154026460,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1545257624
    },
    {
        "content": "<p>Nice to see another answer from the clinician than from a developer.. :-), seen that before. To my believe standardisation is not letting every clinician walk the same direction. It's a bit of a joke, but also my experience. So your answer will be at the client side (ask the doctor..)</p>",
        "id": 154026607,
        "sender_full_name": "Jan-Marc Verlinden",
        "timestamp": 1545294062
    },
    {
        "content": "<p>Thanks for the input! Once again, things turn out to be more complicated than they first appear, but with this I can makr a more informed choice.</p>",
        "id": 154026613,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1545303354
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>, what's your current status with this?<br>\nWe're just profiling blood glucose observations for Finnish PHR and discussing this very matter.</p>",
        "id": 156684424,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1548246334
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> </p>\n<blockquote>\n<p>I don't believe that LOINC captures the molecular mass anywhere? (we could publish a code system supplement?)</p>\n</blockquote>\n<p>In fact they do. See for instance <a href=\"https://s.details.loinc.org/LOINC/15074-8.html?sections=Comprehensive\" target=\"_blank\" title=\"https://s.details.loinc.org/LOINC/15074-8.html?sections=Comprehensive\">https://s.details.loinc.org/LOINC/15074-8.html?sections=Comprehensive</a>, MEMBER OF THESE EQUIVALENCE GROUPS, LG49883-8 Glucose|Pt|Bld|180.156 g/mole</p>",
        "id": 156684623,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1548246516
    },
    {
        "content": "<blockquote>\n<p>Hi <span class=\"user-mention silent\" data-user-id=\"194703\">@Morten Ernebjerg</span>, what's your current status with this?<br>\nWe're just profiling blood glucose observations for Finnish PHR and discussing this very matter.</p>\n</blockquote>\n<p>Where this gets complicated is when modeling data produced by devices used by diabetics for glucose measurement. Most continuous glucose monitors create the originating data in mg/dl, even if the device has been set to display mmol/l for the user, and implementing a system that requires all data to be stored in mmol/l would mean requiring unit conversion to happen on storage, which in turn can result in the data stored in the FHIR system to be different from the originally observed value (and in many cases different from the originally produced data).</p>",
        "id": 156684993,
        "sender_full_name": "Sulka Haro",
        "timestamp": 1548246879
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> In the end, I went for option (2), i.e. a single profile allowing for two possible overall LOINC codes (blood glucose in mass/volume and in moles/volume). I also bound the units to a ValueSet with the two value we allow (mmol/L &amp; mg/dL) and put in constraints that ensure that the units match the overall LOINC code. It sticks with standard codes and in the end, it made sense to me to have this as a single profile since corresponding Observations differing only in the the units are stating the same physiological fact. What I'm not entirely happy about is the use of constraint to enforce the code-unit correlation, I think constraints are much easier for implementers to miss.</p>\n<p>(nice stand-up talk on Nightscout in Amsterdam, BTW!)</p>",
        "id": 156759840,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1548322329
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>. That approach puts some more responsibility on the apps (the apps need to be aware of both codes and units). As I'm making a diabetes app that's anyway well aware of both units I appreciate that. I also see the other view, though, that for generic apps it's easier to fix one code and unit and stick to that. There's only burden for apps writing the data (they need to do the conversions), not for apps presenting it and doing analytics. Let's see where we end up in the context of <a class=\"stream\" data-stream-id=\"179222\" href=\"/#narrow/stream/179222-finnish-PHR\">#finnish PHR</a>...</p>",
        "id": 156766397,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1548330406
    },
    {
        "content": "<p>FYI, I think we see difference in units in other observations and I believe (from what I've heard from our clinical folks) that there are some that are specified in mmols and others in micrograms.   If I remember right, Sodium and Potassium are two where we see this difference in clinical practice in the US and Europe.</p>",
        "id": 156770025,
        "sender_full_name": "John Silva",
        "timestamp": 1548334726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> with blood glucose it also depends on market, but is even more variable. Some countries in Europe use mg/dl, others mmol/l.</p>",
        "id": 156844022,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1548412898
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> ...which implies a different LOINC, of course.</p>\n<p>There are many useful \"co-constraints\" between Observation codes (LOINC et al.) and units (UCUM et al.) published in the \"harmonized Rosetta Table\" on <a href=\"https://rtmms.nist.gov\" target=\"_blank\" title=\"https://rtmms.nist.gov\">https://rtmms.nist.gov</a> - unfortunately, the site is affected by the shutdown, some information here: <a href=\"https://www.nist.gov/itl/ssd/systems-interoperability-group/medical-device-communication-rtmms\" target=\"_blank\" title=\"https://www.nist.gov/itl/ssd/systems-interoperability-group/medical-device-communication-rtmms\">https://www.nist.gov/itl/ssd/systems-interoperability-group/medical-device-communication-rtmms</a></p>",
        "id": 156845378,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548414487
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span>  - thanks for the feedback.   My observation (pun intended) was that it doesn't only happen with Glucose, it happens with other measurements.  In my example of Sodium and Potassium I didn't remember the correct units, it is mmol/L and mEq/L (I think mEq/L is used more in the US, mmol/L in Europe if I remember right.)   BTW, here's a reference that talks about the unit conversion for this:  <a href=\"http://unitslab.com/node/50\" target=\"_blank\" title=\"http://unitslab.com/node/50\">http://unitslab.com/node/50</a>   From what I remember talking to our clinicians, this is not always a straight forward calculation because it depends on the solution (I think)?</p>",
        "id": 156845798,
        "sender_full_name": "John Silva",
        "timestamp": 1548415011
    },
    {
        "content": "<p>Good to see some nightscout/openaps'ers on this thread <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>",
        "id": 158455153,
        "sender_full_name": "Kelly Watson",
        "timestamp": 1550075721
    }
]