[
    {
        "content": "<p>I'm a bit confused on the function of a terminology server.  Do you connect with one to retrieve appropriate value sets for a given code system definition found in a structure definition? If so, are there open source options?</p>",
        "id": 154008967,
        "sender_full_name": "Kesara Liyanage",
        "timestamp": 1539557272
    },
    {
        "content": "<p>yes, and there are plenty of options. we haven't made a formal list, but see</p>",
        "id": 154008969,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539557559
    },
    {
        "content": "<p>actually:</p>",
        "id": 154008970,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539557582
    },
    {
        "content": "<blockquote>\n<p>see <a href=\"http://wiki.hl7.org/index.php?title=Open_Source_FHIR_implementations\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Open_Source_FHIR_implementations\">http://wiki.hl7.org/index.php?title=Open_Source_FHIR_implementations</a> for a start, but no one has assembled a complete list. I'd list Ontoserver, Apelon DTS, Terminz, Art Decor, VSAC, HAPI, <a href=\"http://fhir.loinc.org\" target=\"_blank\" title=\"http://fhir.loinc.org\">fhir.loinc.org</a> and my own server at <a href=\"http://healthintersections.com.au/FhirServer\" target=\"_blank\" title=\"http://healthintersections.com.au/FhirServer\">http://healthintersections.com.au/FhirServer</a> - but these are all different sorts of servers that are adaptable to some degree or other. Ontoserver is the best general purpose server</p>\n</blockquote>",
        "id": 154008971,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539557584
    },
    {
        "content": "<p>Thanks Grahame very helpful</p>",
        "id": 154008973,
        "sender_full_name": "Kesara Liyanage",
        "timestamp": 1539560117
    },
    {
        "content": "<p>Hi, does anyone know of anyone has implemented a terminology server solution that takes a Lab V2.4 message inbound and then validates it using a FHIR terminology server and sends a outbound HL7 V2 message to the backend database to store. I have an interesting problem that requires replacing a HUB solution that validated terminology, location and provider information, the problem is that the HUB does a translation from a local code to a LOINC code, so the HUB must maintain mappings.</p>",
        "id": 158918950,
        "sender_full_name": "Anil Patel",
        "timestamp": 1550610367
    },
    {
        "content": "<p>this has not happened yet. We haven't described how to handle table 396 rather than fhir code system URIs</p>",
        "id": 158919001,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550610434
    },
    {
        "content": "<p>We sort of have.  The NamingSystem resource can capture the v2 codes as well as the FHIR URIs for a given code system and could be used as the basis for transformation.  What we haven't done is publish NamingSystems for the code systems in table 396 that show the codes, OIDs and URIs for each.</p>",
        "id": 158922397,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550613205
    },
    {
        "content": "<p>What we haven't done is defined what it looks like on the terminology service API</p>",
        "id": 158923162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550613800
    },
    {
        "content": "<p>It would seem to me that defining V2 in a terminology service API would be something everyone is looking for. Are there other counties or organisations working on this.? Can I help to contribute to this effort? what is needed?</p>",
        "id": 158938783,
        "sender_full_name": "Anil Patel",
        "timestamp": 1550628399
    },
    {
        "content": "<p>If the inbound and outbound are V2 messages, why do you need a FHIR terminology server sit in the middle to do validation?</p>",
        "id": 159013873,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1550696063
    },
    {
        "content": "<p>Depends what you're validating, I guess. I suppose if you're doing code mapping on the way through, you might want to validate that a code from the incoming message is valid (against a ValueSet) before you translate into a code for inclusion in the outgoing message</p>",
        "id": 159041839,
        "sender_full_name": "Jim Steel",
        "timestamp": 1550726223
    },
    {
        "content": "<p>(Just guessing)</p>",
        "id": 159041848,
        "sender_full_name": "Jim Steel",
        "timestamp": 1550726245
    },
    {
        "content": "<p>I don't know why code validation is less important in the v2 world than the FHIR world</p>",
        "id": 159044470,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550730392
    },
    {
        "content": "<p>Yes <span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> yes you would want to validate the code from the valueset, but if the terminology server had a namespace for each sending system, with maps from the local code to a valueset, then it might be possible to do translation, but it would still need to forward the message as V2 to the backend.</p>",
        "id": 159082386,
        "sender_full_name": "Anil Patel",
        "timestamp": 1550766721
    },
    {
        "content": "<p>Code Validation is important</p>",
        "id": 159082454,
        "sender_full_name": "Anil Patel",
        "timestamp": 1550766741
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Do you know of any organisations that are doing these for a Lab V2 inbound message</p>",
        "id": 159082564,
        "sender_full_name": "Anil Patel",
        "timestamp": 1550766825
    },
    {
        "content": "<p>I don't, but if they were, I probably wouldn't - it's not a world I'm terribly tied to.</p>",
        "id": 159082715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550766942
    },
    {
        "content": "<p>The code translation we (Ontoserver) do - I'm sure other TS products do too - but the decoding/reencoding as V2 is (IMHO) outside the scope of FHIR terminology services (which doesn't mean a product won't do it)</p>",
        "id": 159111462,
        "sender_full_name": "Jim Steel",
        "timestamp": 1550788561
    },
    {
        "content": "<p>right. but where is impacts the terminology service API is how the systems are identified</p>",
        "id": 159120555,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550798458
    }
]