[
    {
        "content": "<p>Hello all, I have several use cases where I need to bind DeviceMetric.deviceType to specific value sets from within Observation profiles.  How is this done without creating profiles of DeviceMetric for each needed value set?  Thanks in advance!</p>",
        "id": 177844101,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1570734911
    },
    {
        "content": "<p>Can you expand on the use-case a bit?  How is it determined which value set applies?</p>",
        "id": 177847201,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570737117
    },
    {
        "content": "<p>The determination made by the profile of Observation.  For example, for a SystolicBloodPressure profile i need to bind to a blood pressure specific value set for DeviceMetric.deviceType and for BodyTemperature this binding is different.</p>",
        "id": 177847610,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1570737385
    },
    {
        "content": "<p>At the moment, your choices are separate profiles or a really evil constraint that enumerates the Observation.codes and the corresponding value sets.</p>",
        "id": 177847717,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570737473
    },
    {
        "content": "<p>That's a legitimate use for a contained profile</p>",
        "id": 177872098,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570760543
    },
    {
        "content": "<p>Hi all.  I've been working with a group of ophthalmologists and we have been discussing the condition resource and how you would go about defining a CodeableConcept for the \"code\" attribute.  There are divergent views within the group about whether to use ICD codes or SNOMED codes.  My understanding is that most EMRs enable clinicians to specify conditions with ICD codes because that is what is being used for billing purposes.  However, an alternative view within the group is that ICD codes are not necessarily fully representative from a clinical perspective and are not used widely outside of the US.  It looks like EPIC, Cerner, Allscripts etc are supporting both terminology systems.  I would be interested in learning about how other implementers have dealt with this issue in other health domains.  To be more specific, if you were going to provide guidance in an IG then would you pick one terminology or allow multiple?</p>",
        "id": 216275776,
        "sender_full_name": "Warren Oliver",
        "timestamp": 1605043051
    },
    {
        "content": "<p>The general guidance - in the U.S. - is \"SNOMED for clinical, ICD10 for billing\".  SNOMED tends to allow finer-grained and more clinical expression.</p>",
        "id": 216280284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605045410
    },
    {
        "content": "<p>Also note that CodeableConcept explicitly allows for two (or more) codes to be included for the same concept. How the user selects to record a concept then becomes a business decision, while the interoperable content can communicate one or both of ICD and SNOMED.</p>",
        "id": 216636275,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1605285175
    },
    {
        "content": "<p>CodeableConcept can also capture which of the codes was actually selected by the user (as opposed to populated using a map)</p>",
        "id": 216955305,
        "sender_full_name": "Jim Steel",
        "timestamp": 1605575458
    },
    {
        "content": "<p>I think the rule is \"SNOMED is for clinical, ICD10 is not\".  ICD10 is a statistical analysis tool that has been used for billing in a number of jurisdictions (both directly and indirectly), and has also been  (mis-)used for clinical purposes (often, I imagine, because it is more readily available than SNOMED due to the differing licensing conditions).<br>\nEither way, I would NOT mix them, and without knowledge of other constraints / influences on the data uses, would generally default to SNOMED.</p>",
        "id": 216958782,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1605578899
    }
]