[
    {
        "content": "<p>I don't understand how TestScript.rule/ruleset is supposed to work. Which type of resource TestScript.rule(ruleset).resource should be pointing to?</p>",
        "id": 153933788,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1517341968
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span></p>",
        "id": 153933818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517345518
    },
    {
        "content": "<p>It doesn't link to a resource. It links to an external rule (as a function, program, code, whatever) that can be used in an assertion. This is the magical escape hatch when TestScript assertions as defined do not have enough functionality to test the scenario in question.</p>",
        "id": 153934220,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1517415510
    },
    {
        "content": "<p>Ah, I see. I was hoping it would allow me to reuse block of asserts somehow (I guess, technically it does allow that, by using custom convention).</p>",
        "id": 153934235,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1517418307
    },
    {
        "content": "<p>Yes.  The rule and ruleset elements are defined to let the test engine implement an external rules engine.  In the case of Touchstone we use this to provide the ability to define Groovy, XSLT or Schematron based asserts.  Our online documentation describes this in detail in our Test Authoring Guide here <a href=\"https://touchstone.aegis.net/touchstone/testAuthoring\" target=\"_blank\" title=\"https://touchstone.aegis.net/touchstone/testAuthoring\">https://touchstone.aegis.net/touchstone/testAuthoring</a>.</p>",
        "id": 153934545,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1517497582
    },
    {
        "content": "<p>How would you specify a set of actions that are expected  in in a certain order? Is this the purpose of the ExampleScenario resource?</p>",
        "id": 153934551,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1517497985
    },
    {
        "content": "<p>The TestScript tests and operations are executed in sequential order.  Overall, 'setup' then 'test(s)' then 'teardown'.</p>",
        "id": 153934559,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1517498399
    },
    {
        "content": "<p>The ExampleScenario resource is draft and (very) recently added.  I don't even see a Resource Proposal for it.  So, not sure what the intent is (yet).</p>",
        "id": 153934561,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1517498581
    },
    {
        "content": "<p>The ExampleScenario is to help provide documentation in an implementation guide to highlight what a particular workflow might look like and what instances (and versions of them) would be involved.  It's a very different usage from TestScript.</p>",
        "id": 153934592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517499820
    },
    {
        "content": "<p>So if one would want to specify an order of events on a FHIR repo in way that can be used in regression testing, how would you approach this? <br>\nAn example scenario would be trigger some event, $apply a plan definition. interact with the CarePlan, update the CDR based on the results of the interaction... -</p>",
        "id": 153934612,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1517500297
    },
    {
        "content": "<p>Example scenario isn't intended to trigger anything - it's intended as documentation only</p>",
        "id": 153934624,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517500562
    },
    {
        "content": "<p>It's for inclusion in an implementation guide as an explanation of \"here's what a real-world usage situation might look like\"</p>",
        "id": 153934628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517500590
    },
    {
        "content": "<p>Sounds like there should be a relationship to TestScript; something like being able to generate a TestScript from an ExampleScenario.  Just a thought.</p>",
        "id": 153934675,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1517504622
    },
    {
        "content": "<p>I'm not sure that would be terribly useful.  The behaviors defined in the example scenario aren't \"thow shalt\" items.  They're just \"in this case, stuff worked out this way\".</p>",
        "id": 153934686,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517505746
    },
    {
        "content": "<p>That link to authoring guide was incredibly helpful!</p>\n<p>One thought I have is that, I think, there is a functional gap between external rules and completely \"standard\" TestScripts. Would be helpful to have a way to reuse simple assertions (like \"check that response is ok + plus few other checks, like resource type\") without resorting to external rules engine. Something really simple as having a block of assertions inside rule/ruleset definition + some semantics adjustment, like being able to reference ruleset/rule parameters in assertions as variables.</p>\n<p>That would improve tests interoperability.</p>",
        "id": 153934751,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1517514790
    },
    {
        "content": "<p>There is an existing gforge tracker to address this which is currently in a \"Consider for Future Use\" condition - <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9197&amp;start=25\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9197&amp;start=25\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9197&amp;start=25</a>.<br>\nI hope to get time to work on this in the near future.  Not sure if I'll get it in in time for R4 ballot.</p>",
        "id": 153934756,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1517515498
    }
]