[
    {
        "content": "<p>This is a simple question that I have not found an answer for. IT may be buried somewhere in the FHIR site but I have not stumbled on it yet.<br>\n'text' elements show up in the resource definitions in various places. But from the examples there is a suggestion that a text element can be added anywhere. It does make sense that text could be present anywhere since they are really only for human consumption.</p>\n<p>So the question is, can I insert a text element anywhere with another construct?</p>",
        "id": 153846945,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1473602990
    },
    {
        "content": "<p>I do not want to retype this whole message. Lost the first one.<br>\nCan I insert a text element anywhere within another element?</p>",
        "id": 153846946,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1473603130
    },
    {
        "content": "<p>\"text\" is defined in DomainResource, which is the parent of most resources - that's where the narrative for the resource goes.  Some other resources have explicit \"text\" elements in other places.  These are part of the resource definitions.  You can't add \"text\" wherever you like though.  In fact, you can't even add \"extension\" wherever you like.  We define most elements in FHIR as including extension, but there are a few places (root of Bundle, inside Narrative.div and various other locations where extensions aren't allowed).</p>",
        "id": 153846948,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473604079
    },
    {
        "content": "<p>Okay thanks. That answers it. So I cannot do something like Observation.valueRange.low.text = human readable string</p>",
        "id": 153846949,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1473604204
    },
    {
        "content": "<p>No.  But you could add an extension.  I'd be in favor of a general extension on Quantity that let you capture a human-readable representation.  Feel free to submit a change request :)</p>",
        "id": 153846950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473605806
    },
    {
        "content": "<p>when would human readable representation of a quantity not be (compoarator) value units? </p>",
        "id": 153847057,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473703973
    },
    {
        "content": "<p>Well, if we're talking original text or rendered text, it could be \"greater than 50 milimoles\".  If we're talking about exceptions it could be \"approximately 35\".</p>",
        "id": 153847122,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473711025
    },
    {
        "content": "<p>doesn't seem like a value proposition to me </p>",
        "id": 153847145,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473741297
    },
    {
        "content": "<p>Not for core, no.</p>",
        "id": 153847201,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473779357
    },
    {
        "content": "<p>Is there room or need for a comparator value of 'approximately'? <br>\nOf course, this opens the question of how approximate?</p>",
        "id": 153847233,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473815825
    },
    {
        "content": "<p>yes. indeed. I've never seen it used. The only place I've ever seen it is the openEHR data type</p>",
        "id": 153847326,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473931849
    },
    {
        "content": "<p>this is already baked into the Quantiy data-type  type \"Quantity.unit<br>\nDefinition  <br>\nA human-readable form of the unit.\"</p>",
        "id": 153847401,
        "sender_full_name": "Eric Haas",
        "timestamp": 1473965437
    },
    {
        "content": "<p>That's just of the unit, not the full quantity</p>",
        "id": 153847403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473966775
    }
]