[
    {
        "content": "<p>The IVD Industry Connectivity Consortium (IICC) is a global, nonprofit organization dedicated to creating and encouraging adoption of a unified connectivity standard to reduce the cost and variability of data exchange between IVD devices and healthcare informatics in clinical laboratories. This will improve healthcare efficiency and patient care. </p>\n<p>IICC is  collaborating with SDOs, including HL7, IHE and Regenstrief Institute.  HL7 v2.x has been selected as a baseline standard for clinical laboratory connectivity.</p>\n<p>How about FHIR?</p>\n<p>IICC website:<br>\n<a href=\"http://ivdconnectivity.org/\" target=\"_blank\" title=\"http://ivdconnectivity.org/\">http://ivdconnectivity.org/</a></p>",
        "id": 153903777,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1503808395
    },
    {
        "content": "<p>LAW – Laboratory Analytical Workflow Profile – The LAW Profile defines the physical connection, message definitions (based on the HL7 Messaging Standard v2.5.1), and workflow definitions between instruments, middleware, and LIS systems in the laboratory. IICC collaborated with the IHE Pathology and Laboratory Medicine (PaLM) domain to develop the LAW Profile. LAW is currently being implemented by all major IVD companies.<br>\nFor more information on LAW, see <a href=\"http://ivdconnectivity.org/law-profile/\" target=\"_blank\" title=\"http://ivdconnectivity.org/law-profile/\">http://ivdconnectivity.org/law-profile/</a></p>",
        "id": 153903778,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1503808552
    },
    {
        "content": "<p>IVD = In Vitro Diagnostics</p>",
        "id": 153903779,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1503808602
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span>  where does this fit into the picture?</p>",
        "id": 153903813,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1503920846
    },
    {
        "content": "<p>Orders and Observations is working on a project right now....  <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> is working on this with the LIVD project will be reporting on it Q2 Thursday</p>",
        "id": 153903861,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503935092
    },
    {
        "content": "<p>There are at least three initiatives of interest here:<br>\n- HL7 V2 Lab Implementation Guides (eDOS, LOI, LRI) to enable exchange of orderable tests from Lab to ordering system (eDOS), placement of orders to a Lab (LOI), and results reporting from the Lab to ordering provider, Public Health, etc. (LRI).  These are message based transactions and expected to still stay in the V2 space for some time to come.  This effort is US focused.   FHIR has opportunity as it augments with dynamic queries, or that the worfklow management required can substantially benefit from FHIR.<br>\n- IHE LAW, also V2 based, focuses on the device-LIS communication.  This has an international focus.  Surely if FHIR offers substantial improvements that justify replacement of something that works, there are opportunities.<br>\n- LIVD - IICC (in collaboration with FDA, ONC, NLM, HL7, CDC and I'm sure I missed somebody) established a set of requirements on how to communicate between device manufactures and Laboratories on suggested LOINC codes given the IVD test codes used by the devices.  This can aid in easier mapping efforts to enable results reporting using the appropriate and consistent LOINC codes.  Initially this is being express in straight JSON.  HL7 has a project in progress to express these proposed mappings using FHIR and hopes to go to ballot on implementation guides/profiles in January.  This has an international focus.</p>\n<p>HL7 OO also did some initial work (see Eric Haas) to define FHIR profiles to represent LOI, LRI, eDOS, which helped us validate completeness/gaps in FHIR (at least is should be able to represent the data set already agreed to in the US).</p>\n<p>Generally, FHIR resources necessary for enabling RESTful service based data access/exchange are in play, while profiles/implementation guides require a bit of work.  In the US, the Argonaut/US-Core profiles/implementation guides have started to address that, but would not be able to support all the relevant Lab workflows currently supported by something HL7 based.  Flipping perfectly functional, working V2 messages to FHIR based messages and services will require a good business case to make that worth everybody's effort.  But augmenting these flows with FHIR based solutions and over time perhaps reaching a tipping point where we might as well move everything to FHIR is possible.  So far it is still easier/faster to build on the V2 capabilities in place then it is to switch to FHIR for these workflows.  \"tomorrow\" that answer may change, but the question is when would that make sense.</p>",
        "id": 153904232,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1504208309
    },
    {
        "content": "<p><a href=\"http://www.pchalliance.org/sites/pchalliance/files/Fundamentals_Data_Exchange_20170404.pdf\" target=\"_blank\" title=\"http://www.pchalliance.org/sites/pchalliance/files/Fundamentals_Data_Exchange_20170404.pdf\">http://www.pchalliance.org/sites/pchalliance/files/Fundamentals_Data_Exchange_20170404.pdf</a></p>",
        "id": 153904361,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1504459629
    },
    {
        "content": "<p><a href=\"http://wiki.hl7.org/index.php?title=Mapping_between_ISO/IEEE_11073-10201_Domain_Information_Model,_IHE_PCD_DEC,_and_FHIR_Resources\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Mapping_between_ISO/IEEE_11073-10201_Domain_Information_Model,_IHE_PCD_DEC,_and_FHIR_Resources\">http://wiki.hl7.org/index.php?title=Mapping_between_ISO/IEEE_11073-10201_Domain_Information_Model,_IHE_PCD_DEC,_and_FHIR_Resources</a></p>",
        "id": 153904362,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1504459857
    }
]