[
    {
        "content": "<p>Hello everyone. <br>\nWe are trying to implement an FHIR based Informational system for a small hospital. So as far as I understand, when working with FHIR  there many circumstances when there is a need to create a few objects simultaneously. For example in a Financial module when the PaymentNotice is issued, the Claim also should be created. So in my opinion it is not a good practice to rely on the UI (the application which implements the user interface) to execute a multi-step requests toward the FHIR server, because the UI is not transnational aware. Is it correct that all the objects which are subjects of a workflow should be managed trough some workflow engine like Flowable or Activity? By application architecture perspective is it a good practice to implement an workflow aware application  module  which deal with all the resources related to a workflow execution or the UI should talk directly with the FHIR server? I see this as a something in the middle. The UI should execute the searches directly to the FHIR server, and when it comes to the workflow, it should talk with the workflow backend. Am i right?</p>",
        "id": 167793154,
        "sender_full_name": "Dimitar Dimitrov",
        "timestamp": 1560198301
    },
    {
        "content": "<p>we have created the transaction interaction for that.</p>",
        "id": 167793266,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560198378
    },
    {
        "content": "<p>we don't have a position about using a workflow engine or not</p>",
        "id": 167793277,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560198388
    },
    {
        "content": "<p>You can use Task to initiate complex workflows and delegate the specific execution to the server, or you can allow the client to choreograph it.  You can also use messaging, though that's slightly less interoperable</p>",
        "id": 167795374,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560199906
    }
]