[
    {
        "content": "<p>Hi all - I have a question in regards to modelling the concept of a \"clinical email\" in a message based infrastructure. It's essentially a message that  can contain text about the given patient and the content is typically an epicrisis but is not restricted to that, so it's essentially free text. The message can be sent from both doctors,  nurses and domestic helpers. Since it is essentially free text, I've been looking to use either the Communication resource or just the Basic resource. The reason that Basic could seem sufficient is that the addressing information is contained in the MessageHeader, which means that the recipient and sender information found in the Communication looks like it will be duplicated. Any guidance on this choice would be much appreciated.</p>",
        "id": 205881216,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1596527840
    },
    {
        "content": "<p>I would still use Communication. It might be duplicated but I wouldn't be surprised if some the values ended up being different as the process of messaging about the communications starts getting into multiple layers</p>",
        "id": 205881316,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596527923
    },
    {
        "content": "<p>follow up question: I would like the free text expressed as markdown. Is it possible to constrain the payload.contentString to markdown, or does that require an extension?</p>",
        "id": 205881803,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1596528316
    },
    {
        "content": "<p>I think you cannot constrain it directly. You can create a custom data type</p>",
        "id": 205891239,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596536783
    },
    {
        "content": "<p>I had a (similar?) challenge when I needed to make Communication a string with 320 characters max</p>",
        "id": 205891869,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596537328
    },
    {
        "content": "<p>markdown is tricky. After all, mark down is just a fancy string. So you can put markdown in there, and say that it's markdown in your implementation...</p>",
        "id": 205891975,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596537413
    },
    {
        "content": "<p>but which element are you asking about?</p>",
        "id": 205892030,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596537460
    },
    {
        "content": "<p>Communication.payload.contentString</p>",
        "id": 205899699,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1596543934
    },
    {
        "content": "<p>well, you could although you could also use ContentAttachment with type = text/markdown</p>",
        "id": 205899904,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596544053
    },
    {
        "content": "<p>hmmm .... good point</p>",
        "id": 205899966,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1596544086
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/the.20concept.20of.20a.20clinical.20email/near/205891869\">said</a>:</p>\n<blockquote>\n<p>I had a (similar?) challenge when I needed to make Communication a string with 320 characters max</p>\n</blockquote>\n<p>I've made such restriction by using FhirPath <a href=\"/user_uploads/10155/dizets4kdfzOFNYjuWNl1GuX/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/dizets4kdfzOFNYjuWNl1GuX/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/dizets4kdfzOFNYjuWNl1GuX/image.png\"></a></div>",
        "id": 205900002,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1596544115
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/the.20concept.20of.20a.20clinical.20email/near/205899904\">said</a>:</p>\n<blockquote>\n<p>well, you could although you could also use ContentAttachment with type = text/markdown</p>\n</blockquote>\n<p>That seems like a pretty sane way to do it. It won't be directly readable however, as it would then be base64, but I guess I'll just have to live with that</p>",
        "id": 205900251,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1596544318
    },
    {
        "content": "<p>There's also an extension that allows you to provide a markdown expression along with (or instead of) a string: <a href=\"http://build.fhir.org/extension-rendering-markdown.html\">http://build.fhir.org/extension-rendering-markdown.html</a>.  (Instead of is less interoperable)</p>",
        "id": 205923659,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596555843
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/the.20concept.20of.20a.20clinical.20email/near/205923659\">said</a>:</p>\n<blockquote>\n<p>There's also an extension that allows you to provide a markdown expression along with (or instead of) a string: <a href=\"http://build.fhir.org/extension-rendering-markdown.html\">http://build.fhir.org/extension-rendering-markdown.html</a>.  (Instead of is less interoperable)</p>\n</blockquote>\n<p>do you have any examples of where it has been used?</p>",
        "id": 206451245,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597059440
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/the.20concept.20of.20a.20clinical.20email/near/205881316\">said</a>:</p>\n<blockquote>\n<p>I would still use Communication. It might be duplicated but I wouldn't be surprised if some the values ended up being different as the process of messaging about the communications starts getting into multiple layers</p>\n</blockquote>\n<p>back to Communication: The description of Communication states: </p>\n<blockquote>\n<p>\"It does not represent the actual flow of communication\"</p>\n</blockquote>\n<p>Me and the team at <span class=\"user-mention\" data-user-id=\"295892\">@MedCom FHIR Team</span> are a bit puzzled about that sentence. I am in the need of building a profile on a message bundle with patient, messageheader, (communication) and so on  - and the content of the text part of the message  could eg. be that the the nursing home would like to ask the elderly's practitioner about parts of the medication in the patients journal or contents about the latest discharge report, so the text of the message that would go into the Communication resource would be \"Hi [doctor dolittle] - we've asked [the patient] and she wasn't all keen on taking the new substance due to ... \" or \"The discharge report says that [the patient] should not lie down more than 8 hours a day. How should we proceed ...\". Does such content belong in a Communication?</p>",
        "id": 206451710,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597059918
    },
    {
        "content": "<p>ain't that the \"actual flow of communication\"?</p>",
        "id": 206451771,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597059966
    },
    {
        "content": "<p>That sounds like a <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>-ism, and I think it means, the actual transmission level e.g. using a twilio API for sending an SMS</p>",
        "id": 206455353,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597063035
    },
    {
        "content": "<p>that technical stuff isn't part of the Communication resource, which speaks about the human level of what happened</p>",
        "id": 206455374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597063069
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I <em>really</em> have no idea of what you just said. Can you agree to that the example texts that I wrote would be within the intended definition/scope of what <strong>could</strong> be the content of eg. Communication.payload.contentString?</p>",
        "id": 206458122,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597064943
    },
    {
        "content": "<p>yes definitely</p>",
        "id": 206502296,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597087471
    },
    {
        "content": "<p>May I then suggest a rephrasing of some of the text on the Communication resource as the text confused at the very least 5 non-native english speakers entirely. At least 2 people had the idea that the resource was about the act of sending the information itself.</p>",
        "id": 206512221,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597093002
    },
    {
        "content": "<p>Sounds like a good idea to me. Make a task?</p>",
        "id": 206512275,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597093030
    },
    {
        "content": "<p>sure</p>",
        "id": 206512309,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597093046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <a href=\"https://jira.hl7.org/browse/FHIR-28235\">https://jira.hl7.org/browse/FHIR-28235</a></p>",
        "id": 206516022,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597095029
    },
    {
        "content": "<p>Following up on the above discussion, the team <span class=\"user-mention\" data-user-id=\"295892\">@MedCom FHIR Team</span> has elaborated a bit over the discussion and our approach and we would like to add the following:<br>\nThe Danish messaging standard ClinicalEmail serves several purpose, where being a traditional email is just one of these.<br>\n1.  ClinicalEmails are standalone messages serving the need of communicating between clinicians email-style<br>\n2.  ClinicalEmails are somehow the glue that can qualify almost every message flow <br>\na.  Questions and answers regarding the understanding of a former message<br>\nb.  Further information in relation to a former message<br>\n3.  ClinicalEmails are also clinical observations carrying both the narrative around a condition of a patient and an observation on the exact condition thus also carrying the observation in itself, for instance like a discharge letter, and therefore in these matters also part of the medical journal itself.</p>\n<p>ClinicalEmail messages are heavily used in the Danish healthcare sectors and has a long history 15-20 years back in time, and should it be invented just now with FHIR, it would probably have been differentiated out as a lot of difference profiles instead of just one, just because FHIR will approach these different needs in many different ways, almost one for each use case mentioned above and all the others, which I haven’t mentioned. We see it much more as a clinical document rather than an email/text message, which serves a complexity of functionality and therefore also should have the flexibility to serve those.</p>\n<p>Therefore our approach for ClinicalEmail has been to work with the Composition resource, although very narrow with only the observation text and a file attachment for a starting point, but planning to allow for more complexity over time as Danish Healthcare grows and matures with FHIR.<br>\nDischarge Letters in FHIR are using the Composition resource, we believe this is the closest FHIR example we can think of in regard to the use of the ClinicalEmail. <br>\nIt is our believe, that when receiving messages like Discharge Letters and ClinicalEmails, these message types are handled very similar in most IT-systems, and therefore will ease the task of receiving and handling them being as similar as possible.</p>",
        "id": 207224576,
        "sender_full_name": "Ole Vilstrup",
        "timestamp": 1597728157
    },
    {
        "content": "<p>I don't see how the use of Composition is a better fit. Since the profile on the message bundle is profiled itself, there is plenty room for specifying relevant observations and attachments. Setting that content inside the Composition creates and unnessecary convolution, IMHO.</p>",
        "id": 207244050,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597746655
    },
    {
        "content": "<p>Sounds like a Communication with a reference(Composition) as it's content to me</p>",
        "id": 207247797,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597749806
    },
    {
        "content": "<p>This sounds like mixing several concepts that might result in a sub-optimal solution. Different types of purpose (communicating between clinicians email-style vs. discharge letter for example) usually means that you need different type of content. </p>\n<p>A discharge letter is a typical example of a clinical document, and as such it's purpose and existence is useful beyond the act of communicating between clinicians. Communication between clinicians is not always a clinical document.</p>\n<p>Orthogonal to that is how the content is made available to the proper consumers at the right time (which is not always just moving bits from point A to point B). One of the major strengths of FHIR is the RESTful API, and I hope that it is not being ignored.</p>",
        "id": 207259831,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597757845
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> I agree with your comments on mixing several concepts. Our challenge here is legacy from our old message regime based on UN EDIFACT and a widespread use of these mixed conecpts. Our first approaches into FHIR in MedCom are 2 \"old\" standards needing an update, and instead of continuing in the old message regime, we want to move to FHIR. This will draw the old use into the FHIR world, but as I see it, over time we will transition all our old message regime standards to FHIR, where new approaches to the  paradigmes these messages cover. In these steps we will be able to implement the FHIR way of handling these concepts and thereby little by little narrow down the use of the ClinicalEmail. The whole discussion around this has at least for me clarified, that we need to redefine the name of this message, as it brings in too much confusion around its use, especially in the english based FHIR world.<br>\nTransitioning into FHIR is also transitioning the mindsets around the old way of approaching different concepts, and our approach is somehow also to have respect for our legacy and giving time for maturing into these new mindsets, which also include ourselves in MedCom, the Danish standardization organisation for healthcare messaging.</p>",
        "id": 207612125,
        "sender_full_name": "Ole Vilstrup",
        "timestamp": 1598000048
    },
    {
        "content": "<p>Based on this, we still have the following different pieces:</p>\n<ol>\n<li>an existing messaging system</li>\n<li>different content is being exchanged using the existing messaging system</li>\n</ol>\n<p>I think the point that is being made is that while the transition to FHIR needs to be gradual and allow for adoption based on existing exchange patterns, the different content needs be represented based on the appropriate purpose of FHIR resources, and not based on the exchange mechanism.</p>\n<p>Examples of different content:</p>\n<ul>\n<li>A discharge letter is a document - a DocumentReference pointing to (or containing) a CDA document or PDF, or a FHIR Bundle of type document with Composition and related resources in the Bundle.</li>\n<li>A message from one provider to another with, or without attachments, is most likely Communication, the awkward definition of the resource not-withstanding.</li>\n</ul>\n<p>The content can get from point A to point B in different ways, for example:</p>\n<ul>\n<li>Using the existing messaging infrastructure</li>\n<li>Using FHIR Messaging</li>\n<li>Using SubscriptionNotification to alert point B to retrieve the content from point A</li>\n</ul>\n<p>And among all that, if the intent is to transition to more ubiquitous use of FHIR, it is good to keep in mind how these resources will work once everyone supports FHIR servers, e.g. how will the discharge letter for patient X will be made available by hospital A to properly authorized clients using the FHIR RESTful API?</p>",
        "id": 207639456,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1598019626
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> I appreciate your input and we will take it into considerations going forward</p>",
        "id": 207644476,
        "sender_full_name": "Ole Vilstrup",
        "timestamp": 1598022020
    },
    {
        "content": "<p>In general, we don't encourage the use of Communication to 'wrap' the sharing of information - you just send the relevant information.  So if you want to send a prescription, you post a MedicationRequest, you don't post a Communication that points to or contains a MedicationRequest.  That's what the original sentence was trying to convey.  However, if you're replicating the notion of email, then Communication is a reasonable resource to use.</p>",
        "id": 207794571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598222323
    }
]