[
    {
        "content": "<p>Hello all<br>\nI'm looking to find a way to express observation threshold values in FHIR, and wanted to find out, if anyone has tried to model this before.<br>\nWhat i mean by observation threshold values, is values that explicate intervals of observation results that indicate for example whether the results are normal, high or very high. An example could be if a diabetic measures his/her bloodsugar and it is between 4 and 8, this could be considered normal. If it is above 8 it should be considered high, and if it is way above 8, it would be considered very high, and should trigger an alert with the clinician.</p>\n<p>Thresholds should be able to exist independently of patients, as they should also allow for expressing default thresholds for a single type of observation or for a group of patients suffering from a specific condition.</p>\n<p>Has anyone tried to model something like this in FHIR before? Or does anyone have an idea of how to model this?</p>\n<p>Best regards<br>\nSimon Hammerholt Madsen</p>",
        "id": 153971060,
        "sender_full_name": "Simon Hammerholt Madsen",
        "timestamp": 1529652626
    },
    {
        "content": "<p>We have a draft ObservationDefinition resource that's intended to do that.  Look at \"qualifiedInterval\" in <a href=\"http://build.fhir.org/observationdefinition\" target=\"_blank\" title=\"http://build.fhir.org/observationdefinition\">http://build.fhir.org/observationdefinition</a></p>",
        "id": 153971200,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529682008
    },
    {
        "content": "<p>Perfect, thank you!</p>",
        "id": 153971417,
        "sender_full_name": "Simon Hammerholt Madsen",
        "timestamp": 1529910062
    },
    {
        "content": "<blockquote>\n<p>We have a draft ObservationDefinition resource that's intended to do that.  Look at \"qualifiedInterval\" in <a href=\"http://build.fhir.org/observationdefinition\" target=\"_blank\" title=\"http://build.fhir.org/observationdefinition\">http://build.fhir.org/observationdefinition</a></p>\n</blockquote>\n<p>Is there a plan to combine this with CarePlan? For instance, if a patient is supposed to take their weight once a day (as in one of the CarePlan examples), could this eventually be linked with an ObservationDefinition, rather than just a (LOINC) code as in the weight example? I think this would be a good combination to fully express a self-monitoring plan, incl. adherence goals and evaluation thresholds.</p>",
        "id": 153975765,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1531834701
    },
    {
        "content": "<p>To echo and expand on Simon and Tilo's questions...<br>\nIs Goal appropriate to use to define Observation thresholds that you might want to act on in an automated fashion?  <br>\nOr are there other resources that address this better or in addition?</p>",
        "id": 154020286,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1542825990
    },
    {
        "content": "<p>ObservationDefinition will define normal ranges, but it won't associate actions with those.  If you want automated action, you probably want the \"trigger\" from PlanDefinition</p>",
        "id": 154020288,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542826306
    },
    {
        "content": "<p>Would you use PlanDefinition to define the thresholds at an individual Patient level? <br>\nLike suppose I want to set weight low/high value for a Patient with the intent to adjust medication levels if their weight changes by +-5%. <br>\nThey weigh 200 pounds, so I define range of 190-210, and if they go outside I want to act in some way.</p>",
        "id": 154020310,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1542832643
    },
    {
        "content": "<p>PlanDefinition is the only way to say \"if X happens, then do Y\".</p>",
        "id": 154020311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542833014
    },
    {
        "content": "<p>But it's not patient-specific, correct?  Like a Goal is patient-specific.</p>",
        "id": 154020312,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1542833121
    }
]