[
    {
        "content": "<p>We handle scanned medical documents using <code>DocumentReference</code> (STU3) and are looking into how to attach thumbnails. At least 3 solutions seem possible: (1) multiple entries in <code>DocumentReference.content</code>, (2) separate <code>DocumentReference</code> resources liked by <code>relatesTo</code>, or (3) a (custom) extension to <code>Attachment</code>.  I found somewhat contradictory advice on this and was hoping from some \"interpretive support\" <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> </p>\n<p>On the one hand, the ticket <a href=\"https://jira.hl7.org/browse/FHIR-14532?jql=text%20~%20%22Thumbnail%22\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-14532?jql=text%20~%20%22Thumbnail%22\">FHIR-14532</a> dealt with a similar case for <code>Media</code> and rejected adding extra field in favour of solution (1), with the following reasoning:</p>\n<blockquote>\n<p>The functionality of having a thumbnail (smaller rendering) can be supported through DocumentReference.content repetition; where one is a thumbnail and the other is full resolution. (note This could be through a relatesTo 'transforms' relationship, but that seems overkill for this usecase.) The distinction between the .content would be detectable through the DocumentReference.content.attachment metadata elements (e.g. size, height, width, etc).</p>\n</blockquote>\n<p>On the other hand,  it seems this might potentially confuse some receiving system into mistaking the thumbnail for the image itself. The reasoning would be same that <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> offered in a <a href=\"#narrow/stream/179166-implementers/topic/DocumentReference.20Multiple.20Pages\" title=\"#narrow/stream/179166-implementers/topic/DocumentReference.20Multiple.20Pages\">Zulip thread about multiple pages in <code>DocumentReference</code></a>, arguing that separate document pages in separate <code>content</code> element is problematic:</p>\n<blockquote>\n<p>Using the existing repeating element would not be adviseable because the expectation is that a receiving system would look for the first syntax they recognize or prefer and display that. Some might keep looking and would error out at seeing multiple repetitions with the same mime type. But others would happily just display the first page they encountered.</p>\n</blockquote>\n<p>Furthermore, the spec seems to rule out having a thumbnail with the same mime-type as the original image in <code>content</code>, which would be an odd constraint if you want to add a thumbnail of, say, a JPEG.</p>\n<p>Would be very grateful for any thoughts on this.</p>",
        "id": 190164076,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1583841357
    },
    {
        "content": "<p>Can you submit a change request on this?  It seems like something there should be standard guidance on.  My personal leaning is an extension.</p>",
        "id": 190182246,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583852512
    },
    {
        "content": "<p>Do we have a group to discuss in details about the #US Drug Formulary IG?</p>",
        "id": 190185816,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1583854059
    },
    {
        "content": "<p><a class=\"stream\" data-stream-id=\"179249\" href=\"/#narrow/stream/179249-Medication\">#Medication</a> or <a class=\"stream\" data-stream-id=\"179190\" href=\"/#narrow/stream/179190-united-states\">#united states</a></p>",
        "id": 190188399,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583855257
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> you moved this resolution</p>",
        "id": 190212829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583867507
    },
    {
        "content": "<p>I don't think that a different DocumentReference is an appropriate solution</p>",
        "id": 190212918,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583867539
    },
    {
        "content": "<p>likely extension URL would be <a href=\"http://hl7.org/fhir/StructureDefinition/iso21090-ED-thumbnail\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/iso21090-ED-thumbnail\">http://hl7.org/fhir/StructureDefinition/iso21090-ED-thumbnail</a> (type = Attachment)</p>",
        "id": 190213015,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583867611
    },
    {
        "content": "<p>after reading this thread I think that having an extension for now and depending on usage creation of a 'content.thumbnail' element in the future makes sense.  Since you could have multiple contents elements each with  it own thumbnail and I don't think the current resolution covers that.</p>",
        "id": 190233120,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583879145
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Sure, just created <a href=\"https://jira.hl7.org/browse/FHIR-26556\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-26556\">FHIR-26556</a>.</p>",
        "id": 190258562,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1583914785
    },
    {
        "content": "<p>one reasoning i had for not having a defined thumbnail element, is that there are many different sizes of thumb. Using many .content elements is already available, with the .content.attachment size elements indicating the size of the thumb. If we add a thumbnail element, we will just have to totoally duplicate the existing .content under .thumbnail to support this. I am not understanding why the existing method doesn't work.</p>",
        "id": 190299478,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583942876
    },
    {
        "content": "<p>The key thing is whether a thumbnail is considered to be a presentation of the 'thing' or a distinct 'thing'.  I lean towards the latter.  If you send a Word or PDF version of a document, those are different representations of the same thing.  Similarly if you send a JPEG or BMP version of an image, that's representing essentially the same thing.  But if you send me the 'abstract' of the document or a low-rez thumbnail, that's <em>not</em> really an alternate rendering.  It's not intended to be used for the same purpose.</p>",
        "id": 190302144,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583944233
    },
    {
        "content": "<p>If you have 3 different thumbnails, then send 3 different extension reps.</p>",
        "id": 190302198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583944263
    },
    {
        "content": "<p>Not super impacted with this (today), but I don't particularly like having conflicting uses of multiple <code>content</code> records.  Essentially, it means that a system needs to parse out which ones are previews vs different formats, etc.  Specifically, <code>content</code> says:</p>\n<blockquote>\n<p>The document and format referenced. There may be multiple content element repetitions, each with a different format.</p>\n</blockquote>\n<p>To use Lloyd's example, a .doc and .pdf <em>may</em> be equivalent, but the PDF may be a preview with everything rasterized at 50 DPI.  May even have both. That means the system will need to compare the sizes on the PDFs and correctly choose the right one for the right situation.</p>\n<p>Feels like something that will cause confusion/issues.</p>",
        "id": 190302628,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1583944477
    },
    {
        "content": "<p>I am confused.  I thought a thumbnail is  a \" reduced-size versions of pictures or videos\"  ( thank you <br>\nWikipedia)  and basically are a link to the full sized thingy....</p>\n<p>e.g.</p>\n<p><span aria-label=\"rabbit\" class=\"emoji emoji-1f407\" role=\"img\" title=\"rabbit\">:rabbit:</span></p>\n<p>(sadly I can't add a link to image in Zulip)</p>\n<p>so if you have a single content elements  ... say pdf treatise on Easter Bunnies then a separate content element using the above thumbnail could work, but agree with <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  is klunky.  BUT if you have already multiple contents elements  ... say pdf treatise on Easter Bunnies and a doc on easter egg hunts, then I can't image how you can keep all the thumbnails straight without an extension or separate element.</p>",
        "id": 190308025,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583947210
    },
    {
        "content": "<p>Thumbnails are not links to full-sized representations.  Easier than a document (to illustrate) is a photo - to start, lets consider an average 12 megapixel (MP) photo.</p>\n<p>In normal use, you may have access to the RAW format of the photo (25 MB), a JPEG (with conservative settings) for 'normal' use (6 MB), and a TIFF version for specific workflows (15 MB).  Each of these formats should be included as separate <code>content</code> elements in the same <code>DocumentReference</code>, since they are different versions of the same \"thing\".</p>\n<p>Continuing from above, the 6 MB JPEG is too large for something like a navigation tile, so you also want a thumbnail.  To make the thumbnail, you take the 6 MB image, downscale it to 2 megapixels and increase JPEG compression to get a nice 200 KB JPEG.</p>\n<p>Now you have two JPEG files of the same thing, but they are distinct files with very different qualities.</p>\n<p>If you tried to print the 200 KB file as a photo, the quality would suck.  If you tried to use the 6 MB photo as a navigation tile, your performance would suck.</p>\n<p>In the first case, a system consuming the <code>DocumentReference</code>will see a RAW, a TIFF, and a JPEG.  It would pick the format it wants the most, any one it understood to convert , or whatever.  This works since they are all equivalent.</p>\n<p>If you now want to add the thumbnail via another <code>content</code> record, systems will need to figure out that the two JPEG records are a full-size and a thumbnail, based on the sizes of the files.  These are NOT equivalent, and cannot be treated as such.</p>\n<p>In your example <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , the two different documents should be two different <code>DocumentReference</code> resources, since they are different things.</p>",
        "id": 190310573,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1583948586
    },
    {
        "content": "<p>Thanks for the clarification.  but in the end <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> you agree the thumbnail should be an extension on the thing is thumbnailing,  right?</p>",
        "id": 190311509,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583949093
    },
    {
        "content": "<p>I don't think it should be another record in <code>content</code>.  Whether that means an extension (and where) or a new element, I don't know that I have an opinion.</p>",
        "id": 190311690,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1583949208
    },
    {
        "content": "<p>This is confusing. Gino, you explain quite eloquently why each of these different views (pdf vs word, 6MB vs 200 KB) are the same thing. As I read this, it seems you are arguing that these should be just different .content entries in the DocumentReference.  Yet, I am also seeing you say you don't want them this way. Can you help me understand what the bright-line is in your logic?  To me, these all should be repetitions at the .content level. It is not hard to spin thru the .content entries to find the one that fits your needs.</p>",
        "id": 190382754,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584015702
    },
    {
        "content": "<p>I am not totally against an independent element for thumbnail, but every discussion comes away with no clear definition of what a thumbnail is.</p>",
        "id": 190382849,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584015780
    },
    {
        "content": "<p>My argument is around my reading/impressions of the docs.  I feel that <code>content</code> entries should be equivalent.  Thumbnails are not equivalent to full-scale renderings.</p>\n<p>This means that we have two different uses of entries in <code>content</code>, without a clear differentiator.  Relying on systems to dig into the attachment and make their own value judgments feels wrong when we can just label the content properly during creation.</p>",
        "id": 190385623,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1584017661
    },
    {
        "content": "<p>I think they are intended to be representations of the full-fidelity. This concept is being used for medical imaging, where the full-fidelity is dicom, while a JPEG is provided for systems that can't understand dicom. The JPEG can be full-fidelity in many cases, like a simple x-ray. Down-scaling is just a transform.  Much similar to having a C-CDA as the primary, and having a PDF rendering, a TEXT rendering, and other renderings. These all allow the consumer (app + user) to decide which works best.</p>",
        "id": 190387194,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584018618
    },
    {
        "content": "<p>One can't even declare that ONE of the .content are the 'best' fidelity, as that is dependent on the viewer capability.   But I would far prefer to have a flag that indicted which .content is considered prime by the publisher.</p>",
        "id": 190387363,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584018730
    },
    {
        "content": "<p>note other uses of the .content repetition are not-at-all different renderings. There are other use-cases that are wanting (currently doing it today) to use multiple .content for different pages within a document. Mostly done when the document is historic paper, that was scanned. (Note I don't like this, and in the XDS world this would be done with multiple linked DocumentReference.) -- so we are getting good trial-use.  I expect more people should weigh in so that we get the most input on consensus.</p>",
        "id": 190387559,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584018878
    },
    {
        "content": "<p>Some representations are intended to be interchangeable.  Whether you display a word document, full PDF or text version of a document doesn't matter.  On the other hand, could have a word, PDF or text file that's just a summary and that's <em>not</em> interchangeable with the full text.  You need to separate the intended use of 'summary purposes only' vs. 'useable to convey full intended meaning'.  Certainly you could have different resolutions of an image available (or even a PDF), but if it's not useable to convey the whole meaning, it shouldn't be sent alongside those that are.</p>",
        "id": 190396651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584023922
    },
    {
        "content": "<p>so it seems we do have many mutually-exclusive views of what multiple .content elements are useful for. Note that in IHE, multiple are simply forbidden; as the relationship element is more explicit and the metadata of each DocumentReference can explain these different perspectives.</p>",
        "id": 190396996,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584024085
    },
    {
        "content": "<p>Quick clarification, you are saying that people are using <code>content</code> entries as pages?  As an implementer reading the spec, I would have no clue that was possible, so if I had done a system it would not handle those correctly.</p>\n<p>Also, are the pages assumed to be in-order, reverse-order?   That sounds terrible.</p>",
        "id": 190399044,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1584025048
    },
    {
        "content": "<p>As of now, I felt the docs were clear:</p>\n<blockquote>\n<p>The document and format referenced. There may be multiple content element repetitions, each with a different format.</p>\n</blockquote>\n<p>This does not say that multiple elements can be different pages, or even two versions of the same format (e.g., a hi-res JPEG and a low-res JPEG).  It says that if there's a repetition, the difference is the format.</p>",
        "id": 190399273,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1584025159
    },
    {
        "content": "<p>If that's not the case, then I feel like the docs need to be updated.  This would show the issue clearly, e.g.,:<br>\nThere may be multiple content references, each with a different format.  Or, multiple pages.  Or, thumbnails.  Or, ...</p>\n<p>Reading that, it becomes obvious that there's a piece of context missing - a code or something describing the use of the element.</p>",
        "id": 190399720,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1584025336
    },
    {
        "content": "<p>yes,  that is my understanding.</p>",
        "id": 190407745,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584029002
    },
    {
        "content": "<p>My 5 implementer cents:<br>\n(1) In our use case, thumbnails are simply highly minified versions of an image/document meant to give the user a very  rough visual idea of what it is in e.g. a list in an app.  They are hence not interchangeable with the full documents, e.g. no text would be readable in a document thumbnail.<br>\n(2) Like <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>, as an implementer I would really not want to try to write code logic that decides based on e.g. image size whether a given element in <code>content</code> is the \"full version\".<br>\n(3) Like <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I would favor a semantic for <code>content</code> that says that all elements can be used interchangeably for display/other typical usage without the risk of loss of information (e.g. each element would contain the full content for the relevant context). The notion of \"typical usage/relevant context\" would need probably need some thought, though, since there are (cornerish) use cases, e.g. extraction of structured data from the document files, where it might be hard to say what counts as \"interchangeable\". Still, in this logic, a thumbnail would clearly not count as interchangeable with the full image (unless the only use case is display of visual summary info <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>  )</p>",
        "id": 190411981,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1584030919
    },
    {
        "content": "<p>that ignores the fact that a C-CDA and a PDF of that are also NOT. So, I keep asking for a clear distinction of when is something a transform and when is it not? I think the distinction being made here is not something that is based in logic.</p>",
        "id": 190413126,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584031449
    },
    {
        "content": "<p>Yes, but anyone processing something that has a C-CDA and a PDF would presumably know that.</p>\n<p>To use your DICOM example from earlier (which I'm more comfortable with), a JPEG rendering is typically NOT fully equivalent to a DICOM version.  But, if you don't have the ability to parse/display a DICOM file, there is some representation which is 'good enough' for basic use (same resolution, window/leveled to a proper setting, etc.).  While not truly equivalent, anyone processing DICOM would understand that.</p>\n<p>If I'm processing a PDF, I have no way of inherently knowing that multiple records are different pages, low-res previews, or something else.</p>",
        "id": 190415407,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1584032486
    },
    {
        "content": "<p>A C-CDA that represents the full content and a PDF of the full content are both interchangeable in that they both represent the full content.  Obviously the capabilities are going to be different (just as a BMP, JPEG and SVG representation have different capabilities).  But a PDF of a summary is not interchangeable with a PDF of the full document.  And the author who links the summary knows it's intended to be a summary and is not ever intended to stand in for the full content.  Neither syntax nor metadata (unless you try to guesstimate based on raw size) will tell you that a PDF is summary vs. full document.  You might have multiple versions of a document in different sizes, but there's still a difference between a 'thumbnail' vs. a \"version for use on low-resolution/low-bandwidth devices\"</p>",
        "id": 190435786,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584042342
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/Thumbnails.20in.20Attachments/near/190213015\">said</a>:</p>\n<blockquote>\n<p>likely extension URL would be <a href=\"http://hl7.org/fhir/StructureDefinition/iso21090-ED-thumbnail\">http://hl7.org/fhir/StructureDefinition/iso21090-ED-thumbnail</a> (type = Attachment)</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I attempted to apply this CR <a href=\"http://jira.hl7.org/browse/FHIR-26556\">J#26556</a>. I am not an expert in iso21090, is the extension recommended in the resolution really aligned in some way with iso21090 and thus appropriate to be added to <a href=\"http://build.fhir.org/iso-21090\">http://build.fhir.org/iso-21090</a></p>",
        "id": 275550440,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647452546
    },
    {
        "content": "<p>or should it just be a simple boolean extension on DocumentReference.content? that is, not trying to state that it is aligned with 21090.</p>",
        "id": 275550734,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647452665
    },
    {
        "content": "<p>I agree with the disposition there. you'd add it to /source/profiles/iso-21090-spreadsheet.xml</p>",
        "id": 275577482,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647464908
    }
]