[
    {
        "content": "<p>This may be a stupid question ... but how are time synchronization rules enforced within a FHIR-based implementation?  For example, if you have data coming from multiple device sources, it is imperative to ensure at least second level synchronization, if not sub-second.  Obviously, security has similar needs.  Is this simply a policy driven outside of FHIR or are there specific support elements?  I assume it is the former but would love to be surprised! </p>",
        "id": 153834665,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1466727166
    },
    {
        "content": "<p>we assume that if you care about that, you will ensure that all nodes are running some time synchronization protocol. - so, outside FHIR</p>",
        "id": 153834668,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466727621
    },
    {
        "content": "<p>Thanks ... and thus a HUGE issue for device informatics ... I added it to the device track + will address in a new FHIR PSS that we are creating for the DEV WG.</p>",
        "id": 153834758,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1466738802
    },
    {
        "content": "<p>why do you think this is a huge issue? Aren't time sync protocols pretty routine these days?</p>",
        "id": 153834761,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466739890
    },
    {
        "content": "<p>This is an operational requirement, not something that would be found in a core model. IHE has been very successful with the Consistent Time profile, many have thanked IHE for this quite basic reminder.  I looked on the FHIR Security.html page, as  expected to find it there as it is critical to many aspects of security including audit and provenance. It could be mentioned here among the other operational requirement reminders.</p>",
        "id": 153834816,
        "sender_full_name": "John Moehrke",
        "timestamp": 1466778817
    },
    {
        "content": "<p>Do you want to write a change request (for yourself :&gt;)</p>",
        "id": 153834821,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1466779819
    },
    {
        "content": "<p>I certainly can, if we think it is the security page where this best belongs. I wonder if the FHIR spec should have  a more general landing place for \"Operational Considerations\", where things that we recognize as operational can be mentioned without binding them into the specification. Similar to the checklist on the security page, but broader.  -- I actually thought we had something like this, but can't find it rightnow.</p>",
        "id": 153834823,
        "sender_full_name": "John Moehrke",
        "timestamp": 1466781650
    },
    {
        "content": "<p>I agree that having \"Operational Considerations\" page would be very helphul. I would also suggest to use it to officially document Grahame's FHIR Implementer’s Safety Checklist from <a href=\"http://www.healthintersections.com.au/?p=2426\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2426\">http://www.healthintersections.com.au/?p=2426</a></p>",
        "id": 153834828,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1466783013
    },
    {
        "content": "<p>check list is here: <a href=\"http://hl7.org/fhir/implementation.html#2.0.0.1\" target=\"_blank\" title=\"http://hl7.org/fhir/implementation.html#2.0.0.1\">http://hl7.org/fhir/implementation.html#2.0.0.1</a>. it would be good to add in both places</p>",
        "id": 153834940,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466893748
    },
    {
        "content": "<p>I created the <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10243\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10243\">GF#10243</a> for this topic.</p>",
        "id": 153834978,
        "sender_full_name": "John Moehrke",
        "timestamp": 1466954171
    },
    {
        "content": "<p>Nice checklist </p>",
        "id": 153835008,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466991597
    },
    {
        "content": "<p>I would also suggest to have separate checklist / Operational Considerations for server and client applications.</p>",
        "id": 153835164,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1467051426
    },
    {
        "content": "<p>how would they differ?</p>",
        "id": 153835188,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467060374
    },
    {
        "content": "<p>I assume that a FHIR server might decide what they want/need to implement (e.g. support 5 resources, only specific search types and no paging) and declare the supported functionality in conformance while a client might need to be able to work with different servers. In other words, a server has more control and is mostly focused on complex back-end business rules, exposing some predefined tightly controled information to the outside world. A client, on the other hand, is focused on the user interface and correct processing of information they can get/create/update on one or more servers.</p>",
        "id": 153835459,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1467122787
    },
    {
        "content": "<p>? wrong topic</p>",
        "id": 153835509,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467142834
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , my last message was about the differences I can seebetween the Operational Considerations for a server and for a client applications (in response to your question \"how would they differ?\")</p>",
        "id": 153835680,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1467210597
    },
    {
        "content": "<p>ah ok. I was hoping for specific comments with regard to the current implementers safety checklist </p>",
        "id": 153835740,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467232592
    }
]