[
    {
        "content": "<p>Hello all, I am creating a profile for capturing Alcohol History using Observation resource. I want to capture the frequency of Alcohol use in years or months or days. In Observation resource there is no \"Timing\" datatype. So please add the datatype in Observation.value[x]</p>",
        "id": 153910318,
        "sender_full_name": "Mounika",
        "timestamp": 1506344911
    },
    {
        "content": "<p>Hi @<strong>Mounika K</strong>, Observation.value[x] does support the Ratio datatype, maybe you can use that to express consumed amount per unit of time?</p>",
        "id": 153910406,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1506346894
    },
    {
        "content": "<p>You can create also create an extension for your observation value if feel this is need in your use case.  The timing of an observation can also be expressed using effective time which does support timing.</p>",
        "id": 153910441,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506350155
    },
    {
        "content": "<p>Need to implement recurrence pattern in CarePlan using Timing datatype, However didn't find properties to implement particular pattern (eg: Yearly, The second WeekDay on April Please see the attached image). Please let us know best possible way to implement the same in DSTU2. <a href=\"/user_uploads/10155/gHC2_5R8eNPy_Psehi2VEmxA/recurrence.PNG\" target=\"_blank\" title=\"recurrence.PNG\">recurrence.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/gHC2_5R8eNPy_Psehi2VEmxA/recurrence.PNG\" target=\"_blank\" title=\"recurrence.PNG\"><img src=\"/user_uploads/10155/gHC2_5R8eNPy_Psehi2VEmxA/recurrence.PNG\"></a></div>",
        "id": 153910573,
        "sender_full_name": "Rajeev Jagadeesh",
        "timestamp": 1506384774
    },
    {
        "content": "<p>Second weekday of April and \"Every year on Jan. 1\" would require extensions.  The remainder is doable within the scope of the existing resource.  You're welcome to propose either or both as core elements to the data type if you wish...</p>",
        "id": 153910585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506396580
    },
    {
        "content": "<p>Is there any exisiting extensions we can use?</p>",
        "id": 153910588,
        "sender_full_name": "Rajeev Jagadeesh",
        "timestamp": 1506397239
    },
    {
        "content": "<p>Not that have been defined by HL7 International and not any others I'm aware of.</p>",
        "id": 153910589,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506397705
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191388\">@Thomas Beale</span> asked me about the use of Timing, specifically, how actually useable is it? This is a good question, because it's certainly messy. But all the things in there are real requirements. So I'm interested in 3 things:<br>\n- a good user interface for inputting a general timing (I know that in some cirumstances, the options for a particular use will be more limited, but let's say, prescription, it's not going  to be)<br>\n- a good rendering routine for displaying general timing <br>\n- a good routine for determining the next time that a Timing will be 'on' (or if it is presently on)</p>\n<p>(Psuedo code preferred for the latter 2)</p>",
        "id": 153954919,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525046978
    },
    {
        "content": "<p>has anyone got anything like this? I think these would be good additions to the reference implementations as well as useful for documentation purposes</p>",
        "id": 153954920,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525047002
    },
    {
        "content": "<p>Rendering would be good in 2 modes, patient friendly and clinician shorthand</p>",
        "id": 153954928,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1525065986
    }
]