[
    {
        "content": "<p>Copying Timing constraint tim-3: </p>\n<blockquote>\n<p>On Timing.repeat: Either frequency or when can exist, not both (expression on Timing.repeat: ((period or frequency) and when).not())</p>\n</blockquote>\n<p>This constraint creates some problems on our side, because it does not allow quite simple statements like \"once a week in the morning\", or \"twice a day, (30 minutes) before meals\". In fact, this constraint invalidates the following 3 timing examples at <a href=\"http://build.fhir.org/datatypes.html#Timing\" target=\"_blank\" title=\"http://build.fhir.org/datatypes.html#Timing\">http://build.fhir.org/datatypes.html#Timing</a> when they are implemented as shown on the table:</p>\n<ul>\n<li>1 tablet 3 times daily, 30 minutes before meals -&gt; this can be handled by using when and offset only</li>\n<li>BID, 30 mins before meal, for next 10 days -&gt; it is not possible to express this, as aligning with meal normally implies 3 major meals in <a href=\"http://hl7.org/fhir/event-timing\" target=\"_blank\" title=\"http://hl7.org/fhir/event-timing\">http://hl7.org/fhir/event-timing</a> while BID means twice a day</li>\n<li>Mon, Wed, Fri Morning -&gt; this can be handled by using dayOfWeek and when only</li>\n</ul>\n<p>Would it be possible to relax or remove this constraint? </p>\n<p>Secondly, although the constraint verbally states that frequency and when cannot exist at the same time, the expression in the parenthesis does not allow period with when either. It is implemented this way in HL7 validator and in some public servers as well (e.g. Grahame's). Well, of course period implies frequency and vice versa by definition (\"Event occurs frequency times per period\"), but I think it would be better if a separate constraint is introduced for that if that is absolutely necessary. </p>",
        "id": 153865193,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1483359347
    },
    {
        "content": "<p>this has come up before. What if you said, every hour before meals?</p>",
        "id": 153865200,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483375851
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12460\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12460\">GF#12460</a></p>",
        "id": 153865201,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483376252
    },
    {
        "content": "<p>Then you'd have a non-sensical timing - just is if you said 20mg 2-4 times a day to a maximum of 10mg/day.  I'm not sure we should prevent saying useful things on the premise that sometimes people might say nonsensical things . . .</p>",
        "id": 153865202,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483376319
    },
    {
        "content": "<p>no we shouldn't. Question is whether that task shoud be deferred - I think not</p>",
        "id": 153865203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483376387
    },
    {
        "content": "<p>Agree, this should be fixed for this release.</p>",
        "id": 153865217,
        "sender_full_name": "Melva Peters",
        "timestamp": 1483390402
    },
    {
        "content": "<p>I undeferred it</p>",
        "id": 153865223,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483395463
    },
    {
        "content": "<p>Thanks. I have read the forge tracker item. It is a quite similar issue with \"timeOfDay\" and \"dayOfWeek\", but not exactly the same with our problem with \"when\". Therefore I issued a follow-up in forge.</p>",
        "id": 153865233,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1483425993
    },
    {
        "content": "<p>I ran into a  similar problem for nutrition orders like \" give this protein supplement at 12 and 4 and before bed.\"  The contstraint makes it so you need multiple timings to mix n match 'whens' with frequency.  So I support removing the constraint.</p>",
        "id": 153866023,
        "sender_full_name": "Eric Haas",
        "timestamp": 1483905114
    }
]