[
    {
        "content": "<p>MedicationDispense includes a status = declined (dispense was declined and not performed) and stopped (Actions implied by the dispense have been permanently halted, before all of them occurred). It also allows a MedicationDispense.statusReason.  However, what timing should be used to reference when such a status and reason is documented?  The only timing that might work is MedicationDispense.whenHandedOver, but the medication was not handed over. Similarly, MedicationDispense.whenPrepared doesn't fit since it wasn't necessarily prepared (but it may have been prepared and not handed over). The use case is to know the coded reason why the dispense did not occur and, for quality measurement, determine if the reason for the dispense \"failure\" is acceptable for the measure criteria.  Can you suggest what timing should be used? If needed, we can create a FHIR tracker asking for more explicit language explaining whenHandedOver to allow our use case, or to add a timing. <br>\n I don't see any new options in the FHIR R5 modeling either.   Thank you</p>",
        "id": 178947836,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571921316
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 178957131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571927058
    },
    {
        "content": "<p>I wouldn't use either of those timings.  Instead, I would add an extension to the statusReason to include the date when the status was set.</p>",
        "id": 178977354,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1571938865
    },
    {
        "content": "<p>Thanks - that was the advice I was seeking. We can add an extension but we wanted to understand the direction Pharmacy might be considering for future FHIR versions. Would Pharmacy consider an additional timing for MedicationDispense to support our use case? We try to keep our extension modeling to be consistent with future base resource plans.</p>",
        "id": 178978328,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571939497
    },
    {
        "content": "<p>We'd need to reach out to the implementer community to see if they have status timings.  To date, yours is the first use case needing that data element.</p>",
        "id": 178978673,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1571939723
    },
    {
        "content": "<p>Thank you - should I enter a FHIR tracker item?</p>",
        "id": 178979070,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571939988
    },
    {
        "content": "<p>How about this being part of an audit event? Sounds like a question that could be asked for any status update to any resource?</p>",
        "id": 179048698,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1572009842
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191437\">@Arianne van de Wetering</span> The use case is clinical - that there is clinical documentation about why a MedicationDispense did not occur, and there should be a dateTime when that documentation (reasonNotDone) occurs. Audit may have timing but the clinical documentation timing should be available without an audit.</p>",
        "id": 179327636,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1572355283
    },
    {
        "content": "<p>+1 to having a task for this issue</p>",
        "id": 179365635,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572377620
    },
    {
        "content": "<p>If we are going to have a time, perhaps it should be a generic \"recordTime\" - that would work for time of registering non-dispense, but also time for registering dispense.</p>",
        "id": 179426908,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1572439282
    }
]