[
    {
        "content": "<p>JIRA ticket <a href=\"http://jira.hl7.org/browse/FHIR-25172\">FHIR-25172</a> has resolution:</p>\n<blockquote>\n<p>Will update the search page to indicate that 'token' can be used when searching elements of type uri - and that when doing so, the uri is expressed in the value portion of the token and the system, if specified, would be urn:ietf:rfc:3986.</p>\n</blockquote>\n<p>which is conflict to the current token section (<a href=\"https://www.hl7.org/fhir/search.html#token\">https://www.hl7.org/fhir/search.html#token</a>) which states</p>\n<blockquote>\n<p>For token parameters on elements of type ContactPoint, uri, or boolean, the presence of the pipe symbol SHALL NOT be used - only the [parameter]=[code] form is allowed</p>\n</blockquote>\n<p>Should we update the resolution to say \"... the uri is expressed in the value portion of the token and the system SHALL NOT be used\" <br>\nor clarify the \"the presence of the pipe symbol SHALL NOT be used\" to \" the presence of the pipe symbol SHALL NOT be used for ContactPoint or boolean. For uri,  the system, if specified, would be urn:ietf:rfc:3986.\"</p>",
        "id": 240761409,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1622389691
    },
    {
        "content": "<p>Why would we say system shall not be used?  What does that have to do with pipe symbol?</p>",
        "id": 240764430,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622393580
    },
    {
        "content": "<p>If using system, then the search parameter would be <code>parameter]=[system]|[code]</code> which contradict to \"the presence of the pipe symbol SHALL NOT be used - only the [parameter]=[code] form is allowed\"</p>",
        "id": 240765811,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1622395619
    },
    {
        "content": "<p>Ah.  Then I agree, no need for the system if the type is known to be URI</p>",
        "id": 240766496,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622396831
    },
    {
        "content": "<p>Added to Monday's agenda to reopen this ticket and update resolution</p>",
        "id": 240769127,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1622401098
    }
]