[
    {
        "content": "<p>Hi! I need to store breath number of top3 breaths of spirometry study and I should be able to store information is the reproducibility of breath true/false. Breaths should be in order based on their quality: top1 top2 top3.  I have already implemented observations for breaths. So my question is: is there a way to do this. If someone have done something similar with spirometry study or different kind of measurements. I have been trying to search a lot for solution but with no luck. Some help would be very much appreciated.</p>",
        "id": 154015600,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1541411040
    },
    {
        "content": "<p>Hmm - the List resource would be an option.</p>",
        "id": 154015607,
        "sender_full_name": "René Spronk",
        "timestamp": 1541420553
    },
    {
        "content": "<p>List is possible, but it seems a stretch.  List is really for curated collections over a long period of time.  I'd recommend capturing order of quality as a component in each of the breath observations or (and perhaps better) with an extension on the Observation.hasMember relationship</p>",
        "id": 154015609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541422678
    },
    {
        "content": "<blockquote>\n<p>List is possible, but it seems a stretch.  List is really for curated collections over a long period of time.  I'd recommend capturing order of quality as a component in each of the breath observations or (and perhaps better) with an extension on the Observation.hasMember relationship</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Do You mean by \"with extension on the Observation.hasMember relationsship\" that I should do a separate resource for the order of top breaths and reproducibility of top breaths? Because that was what I was planning to do. In actual breath resource I have interpretation telling was the quality normal or was there some \"quality control failure\" such as lazy blow or early termination.  I just cant find suitable field of observation to show reproducibility of breath and not sure about the way of presenting top breaths order. Top order is at the moment presented as numbers in valueString. Feels like it's not the right way to do it.  In addition to that I'm struggling with finding loinc/snomed which would present that the information is about top breaths and their reproducibility. Can't really find any examples of any similar scenarios. Help is very much appreciated! Thanks!</p>",
        "id": 154015844,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1541487966
    },
    {
        "content": "<p>I'm not sure about appropriate LOINC/SNOMED codes - <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>\n<p>The rationale for handling order with an extension on hasMember is that \"top breaths\" would be specific to those observations' inclusion in a particular panel, so capturing the linkage in a way that's tied to the linkage between panel Observation and leaf-level Observation seems the most appropriate.  The extension would most likely be valueInteger to allow for easy ordering.</p>",
        "id": 154015902,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541512255
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> any other thoughts?</p>",
        "id": 154015903,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541512264
    },
    {
        "content": "<p>I think that <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>'s suggestion on how to approach this probably makes sense.  This isn't a common use case (although obviously a quite legitimate one) so I think that using an extension is a reasonable way to do it.  I think this is also a difficult search to do to look for existing codes that would apply.  So far with what I've tried I didn't find anything related in either LOINC or SNOMED.  I can't say that I'm confident that there couldn't be something there that so far I've missed, but I also have the feeling from prior experience that likely there isn't anything currently for this in either terminology.  We probably would need help from the Regenstrief and SNOMED Int. folks to verify that - and that will happen as a matter of course if new codes for these items are requested.</p>",
        "id": 154015932,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541517634
    },
    {
        "content": "<p>how about using the  terminology to indicate order instaed of an extension?</p>",
        "id": 154015953,
        "sender_full_name": "Eric Haas",
        "timestamp": 1541527178
    },
    {
        "content": "<p>e..g  codes = 1st measurement of foo, 2nd measurement of foo, etc</p>",
        "id": 154015954,
        "sender_full_name": "Eric Haas",
        "timestamp": 1541527235
    },
    {
        "content": "<p>Thanks for the advices <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> and <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> . I'm still figuring out how to use extension. I have no experience about that yet. I guess I or someone have to define extension somehow? Is that a thing that anyone can do? I guess i found ok snomed codes for 1st, 2nd and 3rd. At the moment I have topbreaths resource where I have just the order of breaths as valueString. I tried to plan extension about their reproducibility. I guess I can just use the text field to tell information about reproducibility. First I was planning to use valueBoolean but component does not accept that and codableConcept has only text option. This extension I made seems to be valid and uploadable to FHIR test server. I use (<a href=\"http://hapi.fhir.org/baseDstu3/\" target=\"_blank\" title=\"http://hapi.fhir.org/baseDstu3/\">http://hapi.fhir.org/baseDstu3/</a>). Would this be valid way to represent reproducibility with extension?</p>\n<p><code>    \"extension\": [\n        {\n            \"url\": \"http://test.com/fhir/topbreathsandreproducibility\",\n            \"valueCodeableConcept\": {\n                \"coding\": [\n                    {\n                        \"system\": \"http://snomed.info/sct\",\n                        \"code\": \"255216001\",\n                        \"display\": \"First (qualifier value)\"\n                    }\n                ],\n                \"text\": \"Reproducible\"\n            }\n        },\n        {\n            \"url\": \"http://test.com/fhir/topbreathsandreproducibility\",\n            \"valueCodeableConcept\": {\n                \"coding\": [\n                    {\n                        \"system\": \"http://snomed.info/sct\",\n                        \"code\": \"81170007\",\n                        \"display\": \"Second (qualifier value)\"\n                    }\n                ],\n                \"text\": \"Reproducible\"\n            }\n        },\n        {\n            \"url\": \"http://test.com/fhir/topbreathsandreproducibility\",\n            \"valueCodeableConcept\": {\n                \"coding\": [\n                    {\n                        \"system\": \"http://snomed.info/sct\",\n                        \"code\": \"70905002\",\n                        \"display\": \"Third (qualifier value)\"\n                    }\n                ],\n                \"text\": \"Not Reproducible\"\n            }\n        }\n    ]</code></p>",
        "id": 154016165,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1541593024
    },
    {
        "content": "<p>The exclusion of valueBoolean from component was an error.  (You can use valueCode in STU3 and valueBoolean becomes available in R4.)    Anyone is free to define extensions. </p>\n<p>Order and reproduceability seem like orthogonal things to me, but perhaps I'm not understanding the use-case.  My understanding:<br>\n- in a particular panel of tests, you measure the patient's breaths several times<br>\n- for each, you record either a qualitative or quantitative measure of the breath<br>\n- you also flag whether that breath was reproduceable or not<br>\n- when you're finished the test, you flag the top three breaths and order them</p>\n<p>If this understanding is correct, then \"reproduceability\" would be component of each Observation and \"order\" would either be merged as part of the test code or sent as an extension on the 'parent' Observation's \"hasMember\" relationship.  I'm not sure that you're allowed to send the qualifier value codes alone with SNOMED.  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 154016169,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541595317
    }
]