[
    {
        "content": "<p>Is there a resource we could use to track overall cost / utilization for a given episode of care (potentially across providers/organizations)?</p>",
        "id": 190222370,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1583873091
    },
    {
        "content": "<p>Or at least something to group the Encounters over time to make that possible?</p>",
        "id": 190224274,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1583874132
    },
    {
        "content": "<p>We were thinking to use EpisodeOfCare (with extensions), but were scared away by its Scope statement which says that if multiple organizations are involved in the EpisodeOfCare, then each will have its own instance.  (and note there is only a single managingOrganization in the resource body)</p>",
        "id": 190224372,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1583874169
    },
    {
        "content": "<p>What makes it tricky is the mix of clinical and financial data.  But even ignoring the financial aspect, is use of EpisodeOfCare to track a full episode (across organizations) out of scope?</p>",
        "id": 190224398,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1583874182
    },
    {
        "content": "<p>Cost for whom? For patient? For payers?</p>",
        "id": 190225787,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583874935
    },
    {
        "content": "<p>In any case, for grouping - CarePlan? Or just for collecting info - composition?</p>",
        "id": 190225953,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583874996
    },
    {
        "content": "<p>Lets say payers.  Lots of utility to this type of info.  Usually a result of analytics I presume.  Wondering how to package that up in the case of FHIR.  Perhaps Composition is the right answer (and one we're considering).  Basically composing the related Encounters/Claims into a coherent whole.  Any other options we should be considering?</p>",
        "id": 190226289,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1583875181
    },
    {
        "content": "<p>did you look at measure / measureReport?</p>",
        "id": 190229853,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583877157
    },
    {
        "content": "<p>and you can also use Task which, despite its name, is a pretty powerful way of tracking a series of activities - I had to do cost tracking in v2 and I wish I had a Task resource at a time - to track all activities (clinical or administrative e.g. reschedules) that have a cost associated with it.</p>",
        "id": 190229972,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583877224
    },
    {
        "content": "<p>oh and pinging <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 190230862,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583877675
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> we like EpisodeOfCare as a way to organize encounters but we'd like to do it across organizations. Has the financial management working group thought about this use case? The current documentation states that each org would have a new instance of EoC but if an external entity is tracking an EoC it would be nice to do it in a way that is cross-organizational. Thoughts?</p>",
        "id": 190410572,
        "sender_full_name": "John Timm",
        "timestamp": 1584030249
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 190435883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584042381
    },
    {
        "content": "<p>Patient Admin owns EpisodeOfCare, so tagging <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  for this thoughts</p>",
        "id": 190440469,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1584044656
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> have you had a chance to read this topic yet?  Do you think using EpisodeOfCare in a cross-organization way to record a full medical episode is an abuse of EoC?</p>",
        "id": 190985655,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1584541045
    },
    {
        "content": "<p>I don't think the notion of a distinct Episode per Organization is a hard requirement - just what's typical.  If you actually have an ability to coordinate episodes across organizations, congratulations :)</p>",
        "id": 190993421,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584544031
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<p>I think one of the  issues stems from EpisodeOfCare.managingOrganization being [0..1] indicating the expectation of a single org and also this blurb from the docs:</p>\n<p>\"Many organizations can be involved in an EpisodeOfCare; however each organization will have its own EpisodeOfCare resource instance that tracks its responsibility with the patient.<br>\nWhen an Organization completes their involvement with the patient and transfers care to another Organization. This is often in the form of a referral to another Organization (or Organizations).\"</p>\n<p>I think what we are looking for is a way for a single EoC instance to reference multiple different organizations and that can be used to group multiple Encounters (that are also coming from different organizations).</p>",
        "id": 191017362,
        "sender_full_name": "John Timm",
        "timestamp": 1584553660
    },
    {
        "content": "<p>If you've got a group of organizations that are sharing an EpisodeOfCare, presumably there's some overarching group that defines that collection of organizations - that becomes the managingOrganization - if you want to declare one at all.  Keep in mind that Organization doesn't have to be a legal entity, it's just a collection of people (or sub-organizations) that can take on responsibility.</p>",
        "id": 191028220,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584558634
    },
    {
        "content": "<p>The hierarchy of organizations is handled by the children pointing to the parent.  Though there <em>is</em> a challenge that an organization can't currently be part of multiple organizations.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 191028413,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584558726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> Short answer, no there isn't. Currently you would need to aggregate costs across providers, whether it be costs to them for costs analysis or by accounts to determine amounts billed and recovered by insurance, patient etc. Several claims analytics firms are using ExplantionOfBenefits from the insurers to support analytics.</p>",
        "id": 191061913,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1584579629
    },
    {
        "content": "<p>Thanks for the input all.  I think we're going to attempt the EpisodeOfCare + financial extensions for this and see where we get to.  Would anyone be opposed to loosening the wording in the summary and scope sections to make it clear that this can be used to group encounters that span multiple organizations (while retaining the words that make it clear it typically is just the view from a single organization's perspective)?</p>",
        "id": 191280875,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1584727767
    },
    {
        "content": "<p>For example:</p>\n<blockquote>\n<p>An association between a patient and an organization / healthcare provider(s) during which time encounters may occur. The managing organization assumes a level of responsibility for the patient during this time.</p>\n</blockquote>\n<p>could become</p>\n<blockquote>\n<p>An association between a patient and organization(s) / healthcare provider(s) during which time encounters may occur. The managing organization (if present) assumes a level of responsibility for the patient during this time.</p>\n</blockquote>",
        "id": 191281074,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1584727842
    }
]