[
    {
        "content": "<p>Hello - Dose under MedicationAdministration is defined as \"Amount of medication per dose.\"  How would I represent total dose?</p>",
        "id": 158546230,
        "sender_full_name": "Sandy Sorensen",
        "timestamp": 1550164539
    },
    {
        "content": "<p>Can you provide more information on the specific use case?  Do you mean give 250mg per dose up to a maximum dose?</p>",
        "id": 158550736,
        "sender_full_name": "Melva Peters",
        "timestamp": 1550168005
    },
    {
        "content": "<p>The total dose is the total delivered dose of each drug during the reporting period.  Prescribed doses or daily doses are not reported.  For example, if 50 mg/kg of a drug was given for 5 days, a total dose of 250 mg/kg should be reported.</p>",
        "id": 159092604,
        "sender_full_name": "Sandy Sorensen",
        "timestamp": 1550774465
    },
    {
        "content": "<p>We haven't had a use case for this data element in the MedicationAdministration, so you would need to represent it using an extension.  Having said that, to date, our use cases for MedicationAdministration have been to report a single administration so the idea of a total dose per reporting period does not make sense for the current scope.</p>",
        "id": 159092778,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1550774613
    },
    {
        "content": "<p>If this is reporting information, you might look at MeasureReport.  Observation would also be an option.</p>",
        "id": 159095338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550776423
    },
    {
        "content": "<p>This seems to also be required for Infusion admin reporting; what you're reporting is the amount given in the specific period, e.g. per hour.  This can be reported by knowing the dose rate per unit of volume and calculated by the volume per unit time or it could be from the concentration and the volume, etc.</p>",
        "id": 159111408,
        "sender_full_name": "John Silva",
        "timestamp": 1550788525
    },
    {
        "content": "<p>For infusions, we do have rate which allows you to say, in combination with effectivePeriod, that I have this much per hour over this many hours.</p>",
        "id": 159111698,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1550788754
    },
    {
        "content": "<p>and you could use something similar for total drug dose - use effectivePeriod to say \"from day X to day Y\" and then dosage would be how much was given over that period.  but again, that would sort of be abusing the indicated scope and usage of the resource</p>",
        "id": 159111792,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1550788812
    },
    {
        "content": "<p>Would <a href=\"http://hl7.org/fhir/R4/medicationstatement.html\" target=\"_blank\" title=\"http://hl7.org/fhir/R4/medicationstatement.html\">MedicationStatement</a> also be appropriate?</p>",
        "id": 159307751,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1551061607
    },
    {
        "content": "<p>Yes, a statement of use would might work for this use case.</p>",
        "id": 159307772,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1551061651
    },
    {
        "content": "<p>I have the same problem reporting the total amount of medication given during a procedure to a quality registry. We only need the total amount for the reporting case period (during the procedure). The registry doesn't want (and need) any more specific data. And clinicians don't want to report more specific data.<br>\nYour advise is still to create an extension for this?</p>",
        "id": 227451927,
        "sender_full_name": "Marten Smits",
        "timestamp": 1614095439
    },
    {
        "content": "<p>as I re-read this thread, I think what you put in the dosage.dose really depends on what you are calling one discrete administration.  After all, that is the scope of the resource - to describe what happened in one discrete administration.  If you want to communicate a summary of a number of administrations because you don't have the data, then you either need to say that \"all of the administrations that occurred during this event, i.e. procedure,encounter,visit, are being considered one administration for purposes of reporting\" or you need to use a different resource.</p>",
        "id": 227457279,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614096952
    },
    {
        "content": "<p>Not having all of the details of your use case, I think that an Observation seems appropriate with a code of \"amount of drug given during a procedure\" and a valueQuantity.</p>",
        "id": 227457482,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614097008
    },
    {
        "content": "<p>for infusion, what IHE has done (a while ago) was to use one MedAdministration for the infusion, and individual MedAdministrations to individual settings or periods.</p>",
        "id": 227463409,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614099036
    },
    {
        "content": "<p>This allows interoperability in cases where one system wants the details, the other system just cares about the total.</p>",
        "id": 227463480,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614099062
    },
    {
        "content": "<p>But this was for one administration \"event\" which is an infusion. For \"taken this amount over time\" would be a good case for Observation (we don't have anything closer, I think).</p>",
        "id": 227463749,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614099149
    },
    {
        "content": "<p>But then I have to create an Observation for each different medication, and have to create codes for observation.code like \"amount of penicillin given during procedure\", \"amount of amoxicillin during procedure\" etc? <br>\nSince there is no place in Observation to specify a Medication.</p>\n<p>Does anyone see a problem with adding a \"total dose\" extension to dosage?</p>",
        "id": 227567233,
        "sender_full_name": "Marten Smits",
        "timestamp": 1614157140
    },
    {
        "content": "<p>for \"during procedure\" I would not  use Observation</p>",
        "id": 227571274,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614159254
    },
    {
        "content": "<p>if \"procedure\" is a time-limite event</p>",
        "id": 227571301,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614159275
    },
    {
        "content": "<p>I don't know what is the duration for your \"treatment\", <span class=\"user-mention\" data-user-id=\"191334\">@Marten Smits</span> . Is it a single clinical session/event, or a seeral-day treatment?</p>",
        "id": 227571568,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614159431
    },
    {
        "content": "<p>It's a colonoscopy, so yes, single clinical session.</p>",
        "id": 227572005,
        "sender_full_name": "Marten Smits",
        "timestamp": 1614159695
    },
    {
        "content": "<p>so if you administer bolus of medication (e.g. anesthetics), that for me is one case that you have both:<br>\na) one administration split in several bolus (which is what happens anyway because you have one syringe and administer as you need to adjust the sedation level)<br>\nb) one administration in each time you push the syringe.<br>\nFor me, the parent administration contains the total dosage.</p>",
        "id": 227577136,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614162313
    }
]