[
    {
        "content": "<p>In MedicationUsage, we have an Adherence section that is used to detail the use of the medication.  We have had a request to add an effectiveTime and effectively make the section repeat within a MedicationUsage.  We believe that this is to reflect the statements of \"over the last year, I took it as my doctor directed for 3 months, then I stopped taking it for 3 months, then I took it slightly differently (1/day instead of 2/day) for a month, and now I'm taking it as directed\".</p>\n<p>Today, that would be recorded as 4 instances of MedicationUsage.  We are considering changing the Adherence section to be 0..* with the effectivePeriod so that it would be just 1 instance with 4 repetitions of Adherence.</p>\n<p>Can implementers of this resource provide us some feedback on which would be preferred?</p>",
        "id": 268879849,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642788239
    },
    {
        "content": "<p>At the risk of incurring the wrath of <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  and others...</p>\n<p>Why wouldn't you use the MedicationAdministration resource to record the 4 instances and then put the statement in the resource designed to record statements?</p>",
        "id": 268891036,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1642793092
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> for your question.  The use case we are dealing with is one where you don't have a record of actual administrations but just the statements that the patient gives you that I had above \"I was taking this as directed for 3 months\".  That is just a statement of usage as opposed to any record of actual administrations.</p>",
        "id": 268897419,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642796032
    },
    {
        "content": "<p>From our implementation (and I will gather more feedback): <br>\nMaking effectiveTime doesn't break anything, so it won't break anything for those who don't use it. It could be used for those that are using the MedicationUsage as a summary statement (as we are). However, it seems this change also doesn't fully solve for example the issue you mention - just repeating the time doesn't allow to say that \"I took it slightly differently\". You can just spot intervals where the patient did or did not take the medication as indicated in the rest of the MedUsage</p>",
        "id": 268911388,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642803775
    },
    {
        "content": "<p>Assuming the above reasoning doesn't have any gap, I would ask if there's an alternative. One would be to make a backbone element for medication usage details, and that would be 0..*. One with dosage, effectiveTime, or reason..</p>",
        "id": 268912212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642804209
    },
    {
        "content": "<p>Another would be to allow medUsages to nest each other</p>",
        "id": 268912248,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642804234
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> - the question wasn't really would it break implementations but which would implementers prefer to record a statement like the example I provided.  But I do value the fact that you are saying some are using it as summary statement.</p>",
        "id": 268912253,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642804239
    },
    {
        "content": "<p>Not as such. Repeating the time only repeats the time, doesn't allow the other variables you mention (took it slightly differently)</p>",
        "id": 268912365,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642804321
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Tracking.20Adherence.20over.20time.20in.20MedicationUsage/near/268912365\">said</a>:</p>\n<blockquote>\n<p>Not as such. Repeating the time only repeats the time, doesn't allow the other variables you mention (took it slightly differently)</p>\n</blockquote>\n<p>Sorry, I might have not been clear in my original ask.  It's not just adding an effectiveTime 0..* , but making the adherence section be 0..* and include an effectiveTime to provide periods for each repetition of the adherence.</p>",
        "id": 268912503,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642804392
    },
    {
        "content": "<p>Oh that. Sorry</p>",
        "id": 268912529,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642804415
    },
    {
        "content": "<p>Let me see how that would look like</p>",
        "id": 268912542,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642804428
    },
    {
        "content": "<p>The MedUsage is already an adherence statement as a whole. Having .reason above and inside adherence already feels confusing. I believe having effectiveTime inside would make .adherence a mini MedUsage inside the MedUsage. And it still wouldn't allow us to say \"I've taken as instructed 3 times per day but last month I took 4 times a day\", right?</p>",
        "id": 268913212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642804875
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Tracking.20Adherence.20over.20time.20in.20MedicationUsage/near/268913212\">said</a>:</p>\n<blockquote>\n<p>The MedUsage is already an adherence statement as a whole. Having .reason above and inside adherence already feels confusing. I believe having effectiveTime inside would make .adherence a mini MedUsage inside the MedUsage. And it still wouldn't allow us to say \"I've taken as instructed 3 times per day but last month I took 4 times a day\", right?</p>\n</blockquote>\n<p>Thanks, you raise a good point against making this change.  MedUsage was never intended as a summary and this would be a slippery slope towards that.</p>",
        "id": 268913397,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642805011
    },
    {
        "content": "<p>I believe it is how it is actually being used</p>",
        "id": 268917246,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642807442
    },
    {
        "content": "<p>I mean a \"summary\" of taking or not medication, as expressed by a patient or asserted by someone else. I checked some other implementation that seems to align with ours, even if it is unrelated and didn't even start with the same scope.</p>",
        "id": 268917443,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642807574
    },
    {
        "content": "<p>I can check other implementations. Perhaps I am just not understanding the term 'summary' in the same way</p>",
        "id": 268917535,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642807621
    },
    {
        "content": "<p>The sentence \"MedUsage was never intended as a summary\" is concerning, though. <br>\nI think that a summary statement of whether a patient is/was taking a medication is pretty much what MedUsage is being used for.</p>",
        "id": 268942129,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642834708
    },
    {
        "content": "<p>Otherwise, what is the scope / intent of this resource? I thought this was relatively stable, and with implementations contributing to that interpretation (that is how I see it), I don't understand if most implementers are doing it wrong and what would be the action.</p>",
        "id": 268942245,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642834811
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Tracking.20Adherence.20over.20time.20in.20MedicationUsage/near/268917535\">said</a>:</p>\n<blockquote>\n<p>I can check other implementations. Perhaps I am just not understanding the term 'summary' in the same way</p>\n</blockquote>\n<p>Yeah, I think we are using two different meanings of summary.  The WG will need to clean up some of language but it was not intended to be, as an extreme example, a resource that could describe a lifetime of usage of a specific drug, i.e. I took this for 4 years, then I stopped for 2, and then I restarted.  It was intended to be the resource that was used when a patient was asked the question \"what drugs are you currently taking and for how long?\"  It has expanded a little bit to allow for saying what drugs you aren't taking any more and for saying what drugs you plan on taking in the future.  But I feel that there is a big gulf between those statements and recording a lifetime history of a drug, which this proposal would allow.</p>",
        "id": 268967994,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642872301
    },
    {
        "content": "<p>We are planning to use(a set of)  MedicationStatement for summaries of usage (regardless of whether they are lifelong, recent, or current or active - it's not easy to distinguish when to use one or other of these). <br>\nWe could use CarePlan for that as well, as was an indication some years ago to do that, but meanwhile we've started to look into MedStatement.</p>",
        "id": 268970865,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642876039
    },
    {
        "content": "<p>Looking at IPS and other specs I think the usage of MedicationStatement as a summary of past usage of medication seems clearly in scope. <br>\nConcretely I'm having this use case: <br>\nPatient has taken Paracetamol <br>\na) 1 months ago for pain after surgery<br>\nb) 1 week ago a bit more for fever</p>\n<p>And someone declares <br>\nc) patient has  been on paracetamol for 1 month</p>\n<p>a, b and c are MedStatements/MedUsages - unless this has changed?</p>",
        "id": 269175932,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643059977
    },
    {
        "content": "<p>yes, those are MedicationUsage instances.  The question I'm asking implementers is: Is that 1 MedicationUsage instance with a chance in the Adherence section to allow for the different adherence patterns over time?  or Is that multiple MedicationUsage instances for each different Adherence?</p>",
        "id": 269186837,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643066313
    },
    {
        "content": "<p>Multiple</p>",
        "id": 269218540,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1643096035
    },
    {
        "content": "<p>Just so I understand. For <a href=\"http://build.fhir.org/medicationusage.html\">MedicationUsage</a>, for the same medication, every time the context of use changes, a new instance of medicationUsage resource is used? So if a medication is to be taken every hour, every instance of the medication where there is change in adherence will need to be captured individually?</p>\n<p>If the intent of this resource is to capture \"A record of a medication that is being consumed by a patient.\" Is this supposed to be captured from the patient recording of the medication they took or was supposed to take but didn't take? Will each instance of the medication be captured like a MAR? The design of this resource looks like its supposed to work like a MAR but that is not how patients self report their medication use. </p>\n<p>Oxycodone 5 mg tablet take prn for pain - person take as directed today at 0800</p>\n<p>MedicationUsage.medication = Oxycodone<br>\nMedicationUsage.effectiveDateTime = march 15, 2022 0800<br>\nMedicationUsage.adherence.code= taking-as-directed<br>\nSame medication</p>\n<p>Oxycodone 5 mg tablet take prn for pain - person did not take as directed today at 1600 because they are nauseated</p>\n<p>MedicationUsage.medication = Oxycodone<br>\nMedicationUsage.effectiveDateTime = march 15, 2022 1600<br>\nMedicationUsage.adherence.code= not-taking<br>\nMedicationUsage.adherence.reason= 182864000 Drug not taken - side-effects</p>",
        "id": 275374541,
        "sender_full_name": "Emma Jones",
        "timestamp": 1647351957
    },
    {
        "content": "<p>For the MAR you use the MedicationRequest (for intent) and MedicationAdministration (for event)</p>",
        "id": 275418194,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647369748
    },
    {
        "content": "<p>MedUsage is, I guess, more for summary information</p>",
        "id": 275418238,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647369780
    },
    {
        "content": "<p>MedicationUsage should be for summary information<br>\nThe MedicationUsage.adherence - cardinality should be 0..* as there is a need to flag different adherence patterns over different periods of time<br>\nTherefore, adding Medication.adherence.effectiveTime is useful for expressing different adherence patterns</p>",
        "id": 275430872,
        "sender_full_name": "Stephen Chu",
        "timestamp": 1647376111
    },
    {
        "content": "<p>The Pharmacy WG already discussed this and determined that implementers are not using this as a long-standing statement of use but rather a short summary of use.  If the adherence changed over time, those should be statements.  \"I was taking this according to my doctor's order for 3 months then I stopped taking it for a couple months\" are two different MedUsage instances.</p>",
        "id": 275431419,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1647376409
    },
    {
        "content": "<p>if the intent for MedUsage is \"short term\" you may need to define what is meant by \"short term\" and remove the use of the period element in effective[x]. if you leave it as is, the resource have no control over how business rules will use it. </p>\n<p>Also, you make mention of \"implementers\" - are these implementers of MARs or patient generated data systems?</p>",
        "id": 275507579,
        "sender_full_name": "Emma Jones",
        "timestamp": 1647436092
    },
    {
        "content": "<p>The short answer is: yes, changes in the “context” of MedicationUsage would need a new MedicationUsage instance.  </p>\n<p>However, your comment scenario of tracking individual doses administered (or taken) is not the use case behind MedicationUsage.  From the introduction of the resource: “A common scenario where this information is captured is during the history taking process during a patient visit or stay.”  MedicationAdministration would address the individual administrations (even those self-administered by the patient) including reasons why an administration did not occur (MedicationAdministration.statusReason).</p>\n<p>Regarding tracking adherence over time: at each encounter where a medication history is taken, that history would create a set of MedicationUsage instances.  Each instance would address the use of a particular medication, and the reporters claim on adherence (over the period being reviewed by the encounter).  While not spelled out in the resource documentation, one could create additional MedicationUsage instances for odd circumstances.  For example, if a patient reports that they take their once-a-day med regularly, but there was a 1 month period where they stopped because they ran out and couldn’t get a refill.  That could be recorded as one MedicationUsage effectiveTime=(adherence.code=”taking-as-directed” and a second Medication usage effectiveTime=(the month they ran out), adherence.code=”taking-not-as-directed”, adherence.reason=”Drug not taken - patient lost tablets”</p>",
        "id": 277806522,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1649113920
    },
    {
        "content": "<p>I will create a jira ticket to review and update the narrative of MedicationUsage</p>",
        "id": 277806608,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1649113960
    }
]