[
    {
        "content": "<p>Can anyone point me to the right person at HL7 to talk to when it comes to trademark and usage questions around the term \"FHIR\"? We're working on a tool to query FHIR resources more efficiently, and are planning to open source it (we even have a presentation scheduled for Dev Days). Just wanted to make sure it would be okay for us to include the word \"FHIR\" in the name of the tool/product.</p>\n<p>I see <a href=\"mailto:HL7trademarks@HL7.org\">HL7trademarks@HL7.org</a> and this page (<a href=\"http://www.hl7.org/about/product.trademark.application.cfm\">http://www.hl7.org/about/product.trademark.application.cfm</a>). -- was wondering if those are where I should pose my questions, or if anyone here is familiar with this topic and could point me in the right direction/</p>",
        "id": 277936969,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1649189431
    },
    {
        "content": "<p>Those are the right places.</p>",
        "id": 277940355,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649191268
    },
    {
        "content": "<p>That'd be me. you can ask the questions here</p>",
        "id": 277950125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649196568
    },
    {
        "content": "<p>Hi Grahame, thanks in advance. My coworker, <span class=\"user-mention\" data-user-id=\"379536\">@Matt Willer</span>  is building a GraphQL-based tool to query FHIR resources within our company. We believe this will very helpful to our internal developers in that it will make it easier to access FHIR data and it will optimize the API calls. We also believe that this will be useful to the broader FHIR community, as this tool can be easily integrated with other FHIR servers, and we are planning to open source this tool. </p>\n<p>(Matt is actually scheduled to present on this topic at the upcoming DevDays conference.)</p>\n<p>Internally, we are calling this tool \"Grafhir\". We were hoping to continue to use this name when we open source it. </p>\n<p>Would HL7 have any legal or trademark issues with us naming this \"Grafhir\"? We thought we should run this past someone, since the text contains the term \"FHIR\".</p>\n<p>Thanks!</p>\n<p>-Daniel</p>",
        "id": 278229140,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1649367101
    },
    {
        "content": "<p>in principle. no. you need written permission (us <a href=\"http://www.hl7.org/about/product.trademark.application.cfm\">http://www.hl7.org/about/product.trademark.application.cfm</a> as above)</p>",
        "id": 278241672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649375839
    }
]