[
    {
        "content": "<p>We will be implementing a transaction POST for height and weight.  The end goal is to POST both the height and weight within a transaction bundle such that a BMI is also captured.  </p>\n<p>We are trying to determine if it is more appropriate for the app performing the POST to calculate the BMI and include it as an entry within the bundle (in addition to the height and weight) or to perform the BMI calculation via the FHIR server and only require the height and weight in the bundle?</p>",
        "id": 267508341,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1641852651
    },
    {
        "content": "<p>I think most typically, the app would calculate and include 3 separate Observation resources in the Bundle to the FHIR server. You can find examples if needed in the US Core Vital Signs profiles. - <a href=\"https://build.fhir.org/ig/HL7/US-Core/StructureDefinition-us-core-vital-signs.html\">https://build.fhir.org/ig/HL7/US-Core/StructureDefinition-us-core-vital-signs.html</a></p>",
        "id": 267512079,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1641854419
    },
    {
        "content": "<p>You can't expect most FHIR servers to perform any auto-calculation.  If you want a BMI to exist, unless you're aware of a custom arrangement, you'll need to do it yourself.</p>",
        "id": 267535514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641875405
    },
    {
        "content": "<p>You might need to coordinate with the specific servers you are wanting to integrate with.  Some servers may behave as Lloyd suggests.  Some may prefer or require that they use their own BMI calculation.  (I don't know offhand which Epic does, but I know we have built-in BMI calculation functionality).</p>",
        "id": 267585359,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1641909983
    },
    {
        "content": "<p>The other thing to consider is that there are different algorithms to calculate BMI so it seems like it would make sense to have the client (source of the BMI) to send this in based on the algorithm user on the source system, e.g. an EHR.</p>",
        "id": 267586910,
        "sender_full_name": "John Silva",
        "timestamp": 1641910644
    },
    {
        "content": "<p>I wonder what an implementer who creates implicit observations (such as BMI, BSA, etc) would do in the event that a bundle <em>contained</em> those observations. I guess they'd either still go ahead and produce their own entry <em>and</em> consume the one posted; or, just accept the posted observations.</p>",
        "id": 267601545,
        "sender_full_name": "Rob Resendez",
        "timestamp": 1641916464
    },
    {
        "content": "<p>Depends on their rules for creating implicit ones.  If it's \"create if there isn't already one\", then maybe they won't.  If it's \"create every time there's a new body weight or height recorded\", then that's what they'll do.</p>",
        "id": 267610994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641920109
    },
    {
        "content": "<p>We have been looking at Observation.component.  Would it be acceptable to include a height, weight, and BMI as a Observation.component where we'd POST a single Observation instead of using a transaction POST?</p>",
        "id": 267774758,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1642016157
    },
    {
        "content": "<p>No.  Component is for content that can't (or is rarely) interpreted or used separately and where the data is all gathered as part of a single measurement.  Think APGAR, blood pressure, the drug and sensitivity level for a susceptibility test, etc.  Height, weight and BMI are all captured independently using different mechanisms and can all be used independently of each other.</p>",
        "id": 267775296,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642016362
    },
    {
        "content": "<p>Another wrinkle here is that the various medical device regulations require that any data associated with medical device claims are not reinterpreted by integrated systems. In this example, if it's a medical device sensing height and weight and computing BMI as part of its claimed medical device functions then an integrated system cannot reinterpret the device's computed BMI value without being considered part of the medical device. There's some ambiguity around derivative works and where the medical device function starts/stops but the spirit is you can't alter the medical device function in a way that is not under controls even in integrated systems.</p>",
        "id": 267802598,
        "sender_full_name": "Mike Lohmeier",
        "timestamp": 1642030185
    },
    {
        "content": "<p>If the requirement is to transmit all three measurements at once, a transaction Bundle is likely your best option.</p>",
        "id": 267805046,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642031648
    },
    {
        "content": "<p>I suppose you could 'tag' the 'computed BMI' differently from the (server-side) calculated BMI.  (maybe even use different codes for them if that made sense or at least different display labels).   Here's a scenario that might happen in the 'real world' --- the vital sign data is sent from different types of vital sign monitors, some which source (internally calculate) BMI and others that don't.  So, the FHIR server (and some backend computing engine) always calculated the BMI so that there is always a value available but in the case where a vital sign monitor sources this you could have 2 values for the same time.</p>",
        "id": 267855734,
        "sender_full_name": "John Silva",
        "timestamp": 1642073290
    },
    {
        "content": "<p>Wouldn't the device calculated BMI have provenance author of the device?<br>\nWouldn't the server calculated BMI have provenance author of the server?<br>\nWouldn't a provider calculated BMI have provenance author of the provider?</p>\n<p>Seems like no matter who authored the BMI observations, you'd know.</p>",
        "id": 267867189,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1642080052
    },
    {
        "content": "<p>Assuming the FHIR server supports Provenance?</p>",
        "id": 267889694,
        "sender_full_name": "John Silva",
        "timestamp": 1642089872
    },
    {
        "content": "<p>Forget Provenance.  The Observation itself would have a performer - which ought to be sufficient.  The Observation could also indicate the source height and weight Observations that were used and what 'method' was used to perform the calculation.</p>",
        "id": 267909252,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642097915
    }
]