[
    {
        "content": "<p>I'm supporting a clinical trial where the researchers want to record information on treatment changes that occur at the time of a clinical encounter.  The specific question is: \"Based on your evaluation today, are you making a change in the cancer treatment plan?\" and the proposed answer set consists of {no change in treatment plan | yes-disease not responding | yes-due to adverse event/toxicity | yes-planned change | yes-due to patient request}.  The doctors do not want to document the change itself,  just whether or not there was a change, and why the change was made. Treatments  are not limited to medications (e.g. could be a series of radiation treatments).  I have explored using statusReason on MedicationRequest  or the extension request-statusReason on ServiceRequest, but there was pushback, because literally, all they want is an answer to the question above. Any suggestions on the best way to record that information in FHIR?</p>",
        "id": 170554809,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1562775187
    },
    {
        "content": "<p>Would Task be appropriate (using SNOMED 445528004 Treatment changed (situation) as the code) and reasonCode to contain the reason for the treatment change?</p>",
        "id": 170559180,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1562778153
    },
    {
        "content": "<p>I really think that this is a clinical impression with a finding of {no change in treatment plan | yes-disease not responding | yes-due to adverse event/toxicity | yes-planned change | yes-due to patient request}</p>",
        "id": 170587337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562799724
    },
    {
        "content": "<p>I would have said \"yes\" to Task.  ClinicalImpression seems a bit heavy</p>",
        "id": 170591279,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562803830
    },
    {
        "content": "<p>Why a Task? Doesn't that imply that something still needs to be done? Or is this a 'pre-completed' task...</p>",
        "id": 170591579,
        "sender_full_name": "David Hay",
        "timestamp": 1562804216
    },
    {
        "content": "<p>It's something that was done.  Task is used to request and record the execution of changes to orders.</p>",
        "id": 170591656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562804315
    },
    {
        "content": "<p>Ah - handy!</p>",
        "id": 170592300,
        "sender_full_name": "David Hay",
        "timestamp": 1562805116
    },
    {
        "content": "<p>why is clinical impression a bit heavy? It's exactly what it is, and there's no elements you don't want that are mandatory</p>",
        "id": 170627065,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562847547
    },
    {
        "content": "<p>Thank you all for your inputs. Since they are recording an action, it seems closer to Task than Clinical Impression,  which seems more like an assessment than an action. Unless there is strenuous objection, I'll go with Task.</p>",
        "id": 170645069,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1562859613
    },
    {
        "content": "<p>I agree with Grahame, at least that the \"why the change was made\" part sounds like a ClinicalImpression.  The \"whether or not there was a change\" part doesn't really fit with that and might be a Task, but I don't know how good the fit is there.  I don't think we would normally be thinking of creating a Task to record \"no change in treatment plan\" - because with no change being made there is nothing that was or is to be done.</p>",
        "id": 170650051,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1562863424
    },
    {
        "content": "<p>If the task is \"treatment change\" then I suppose \"no change in treatment\" would fit with a Task status implying the task was not performed (rejected or cancelled). It's essentially the equivalent of Procedure not-done status (although the value sets are inconsistent <em>grrr</em>)</p>",
        "id": 170722283,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1562938550
    },
    {
        "content": "<p>You could have a Task that says \"Please continue unchanged\" and the receiver could agree or refuy</p>",
        "id": 170808973,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563059732
    }
]