[
    {
        "content": "<p>'The _total parameter has the status trial-use pending real world experience of it's use.' (<a href=\"http://hl7.org/fhir/search.html#total\" target=\"_blank\" title=\"http://hl7.org/fhir/search.html#total\">http://hl7.org/fhir/search.html#total</a>), we are using it in production, how do we report this 'real world experience' ?</p>",
        "id": 185726880,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1579112246
    },
    {
        "content": "<p>_total seems difficult to take advantage of because it's not clear what the default is, and the server is allowed to treat it as a hint. So how does the client know what mode happened?</p>",
        "id": 185728044,
        "sender_full_name": "Paul Church",
        "timestamp": 1579112837
    },
    {
        "content": "<p>It works OK for us - but that's not what I was asking</p>",
        "id": 185745826,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1579123470
    },
    {
        "content": "<p>We are beginning to develop smart on FHIR apps to be used within EHRs. We have everything working really well for what we need so far.</p>\n<p>However, we would like to add logging to our application so that we can determine which client and or application install is making each particular call and log accordingly. We do such logging with other types of applications we build and would like to have the same with our SMART Offerings.</p>\n<p>as if right now, we are starting to explore the possibility of leveraging the Practitioner resource and possibly using the system OID to track which particular install or client of a specific EHR is making the call.</p>\n<p>We are curious as to what others are doing in regards to tracking which particular install of an app is making the calls to their respective environment. Any insights would be greatly appreciated.</p>\n<p>Thank you</p>",
        "id": 185748994,
        "sender_full_name": "Ron Gowen",
        "timestamp": 1579125665
    }
]