[
    {
        "content": "<p>continuation of this thread: <a href=\"#narrow/stream/179166-implementers/topic/FHIR.20Community.20navigation.20help\" title=\"#narrow/stream/179166-implementers/topic/FHIR.20Community.20navigation.20help\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/FHIR.20Community.20navigation.20help</a><br>\n(opened new one for a proper topic heading)</p>\n<blockquote>\n<p>Does your tumor conference software represent regular encounters as well?</p>\n</blockquote>\n<p>not right now, but will possibly handle chemotherapy encounters in the future</p>\n<blockquote>\n<p>Certainly we'll need a computable means of distinguishing the patient-centric from non-patient-centric events if we do decide to use a single resource for both concepts.</p>\n</blockquote>\n<p>I see multiple caradinalities in tumor boards: the appointment for the conference itself (invitation to participating physicians), the appointment for every patient (to track which patients will be discussed).<br>\nFor the resulting encounters this could be the same, one Encounter for the whole conference and one encounter for every patient discussed.</p>",
        "id": 167941173,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1560342525
    },
    {
        "content": "<p>The linkage between the higher level encounter and the patient specific encounter could be made trough part-of. For Appointments there is no part-of so we would need an extension.</p>",
        "id": 167941924,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1560343116
    },
    {
        "content": "<p>Would an Appointment for each Patient make sense?<br>\nUsually the patients do not participate in \"their\" tumor conference, so would they even be a \"participant\" in such an Appointment resource?<br>\nOr, if it is agreed that they are \"participants\": why not put all patients into the single Appointment instance?<br>\nIt's still the same 5 doctors talking about 10 patients in the same room and timespan.</p>\n<p>I would tend to represent the patient specific \"Appointment\" (i.e. \"we plan to talk about Patient X during that conference\") as an Encounter of status=planned, but I suspect that might not be the way to go from the FHIR workflow perspective.</p>",
        "id": 167942863,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1560343839
    },
    {
        "content": "<p>To us the patients are participants, as we need to track which patient will be discussed in which conference meeting.<br>\nAlso we can't use one Appointment for all participants/ the whole conference as we want to support external patients/physicians which are only allowed to see the data of their own patient (captured in the appointment).<br>\nSo our current working theory is:<br>\n- One parent Appointment for the conference itself (can be set to weekly)<br>\n- multiple sub Appointments (one for each patient) pointing to the parent<br>\n- same for Encounter</p>\n<p>Open questions:<br>\n- How to link Appointments together<br>\n- Appointment has no repeating/scheduling options. We want to capture things like: Appointment occurs every week</p>",
        "id": 168388788,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1560854973
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 168419766,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560876837
    },
    {
        "content": "<p>The security constraint you are trying to enforce -- a participant in an appointment can't see who else is in that same appointment -- seems unusual. Your solution (cascade of appointments) is logical potential solution. However do you really need the sub appointments to be full appointments?  Does this security constraint need to be enforced at the interop layer, or can it be a business-rule enforced in the application?  I guess it could be implemented much like BCC field in e-mail in that when the appointment notification is sent, each copy is targeted but doesn't include the other BCC identifiers, and thus only the original author has the full BCC.</p>",
        "id": 168522455,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560962148
    }
]