[
    {
        "content": "<p>In one project, \"Problem\" maps to different concepts - I'm mapping these concepts to resources, and I am not sure they would all fit under \"condition\" or if we should create profiles on different resources.<br>\nFeedback appreciated. These are our business terms and definitions (liberally translated): </p>\n<ol>\n<li><strong>Diagnosis</strong> Information about a disease, identified after clinical reasoning from physiological and pathological realizations</li>\n<li><strong>Problem</strong> Problems that the practitioner finds noteworthy, potentially harmful or deserving further study or treatment</li>\n<li><strong>Risk</strong> Problem or health situation that may call for surveillance or continuous attention</li>\n<li><strong>Antecedent</strong> Information about a problem considered resolved (not family history)</li>\n<li><strong>Anamnesis</strong> - conclusion from an anamnesis from another practitioner other than a physician</li>\n</ol>",
        "id": 200988998,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592298316
    },
    {
        "content": "<p>any experience out there with these?</p>",
        "id": 200989020,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592298334
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 201004603,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592309195
    },
    {
        "content": "<p>I can add this to the agenda of an upcoming Patient Care discussion (may not be until late July given we have a few other topics on the agenda for the next couple meetings).  I'm confident that we've scoped Condition to include:  Diagnosis, Problem, and Risk (provided it rises to a level of concern that warrants tracking / management) noting that Condition has a clinicalStatus (for resolved problems) and asserter (for source of information).</p>",
        "id": 201327111,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1592514961
    },
    {
        "content": "<p>Patient Care reviewed these today.  Patient Care doesn't endorse or expect to use those labels (bold) for #4 and #5, but we agree that Condition <strong>can </strong> be used for what is being described and defined (i.e. resolved conditions , condition that occurred following another condition, conditions asserted by non-physicians).</p>",
        "id": 204151480,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1594938614
    },
    {
        "content": "<p>Thank you. We'll review the labels - maybe there are translation nuances - I'd be glad to forward suggestions for the names.</p>",
        "id": 204173501,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594966016
    }
]