[
    {
        "content": "<p>Hi, </p>\n<p>My question is a bit diffuse but i will try to keep it simple.</p>\n<p>Lets say i make a profile on \"Device\" in Forge and then then make an extension and add it to the \"Device\".  The type of my extension is \"Coding\" (valueCoding). So my profile Device is a basic Device with one extension of the type Coding.</p>\n<p>When i generate a snapshot of my profile on Device, is there any way i can determine what the type of my extension is based on the snapshot? As far is i can see there is nothing in the  Device snapshot that tells me that my extension is of the type Coding? It pretty much only holds the url to my extension which means i have to go to the specific extension defintion to be able to know what the type of my extension is?</p>\n<p>Is this the way it should be or have i missed some settings on my Device profile in Forge that can enable me to get that information in the profile snapshot?</p>",
        "id": 154009773,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1539780126
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span></p>",
        "id": 154009785,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1539783488
    },
    {
        "content": "<p>That's the way it should be.  The extension is just  a profile on the extension data type.  When we render profiles in the IG publisher we have to look up the extension definitions in order to expose the type.</p>",
        "id": 154009787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539783607
    },
    {
        "content": "<p>As <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> explains, works as designed. A snapshot usually does not include the full snapshot of any referenced types (depending on actual diff constraints). A consumer will need to resolve these separately.</p>",
        "id": 154009790,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1539784183
    },
    {
        "content": "<p>Ok thanks for the answers. </p>\n<p>But there is no way to be able to work around this? In my case it would help alot if i could just add something in the snapshot indicating the type of my extension.</p>",
        "id": 154010163,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1539850199
    },
    {
        "content": "<p>A snapshot is algorithmicaly generated based on what's in the snapshot of the base and what's in the differential of the derived profile.   None of the tools will do what you're looking for and if you manually tweak the snapshot, you're likely to confuse or even break some of the tools.  Pointing to an extension profile is no different than pointing to a profile on Address or HumanName.  And the Extension.value[x] element can't be treated as any more important than the Extension.url or Extension.extension element.  (Plus, if you drill down into the profile on an Extension, do you then drill down into the profiles on the Extension.extension?  We have discussed fully blowing out profile references in a \"special\" snapshot mode, but it gets messy when you have recursive references.</p>",
        "id": 154010186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539869728
    }
]