[
    {
        "content": "<p>Hello, Hoping to get a bit of clarification on when the ElementDefinition type should appear in a differential.  The cases that are confusing to me are when we have a CodeableConcept slicing on a profile, e.g., bodyheight: <a href=\"https://www.hl7.org/fhir/bodyheight.profile.json.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/bodyheight.profile.json.html\">https://www.hl7.org/fhir/bodyheight.profile.json.html</a>.  <br>\nTake the elements: Observation.code.coding:bodyheightcode of type Coding, and Observation.code.coding:bodyheightcode.code of type Code.  In both cases, the type is unchanged in the profile from the base value defined in Observation, <br>\nbut the differential in BodyHeight for the Code lists type: [ {code: \"code\"}]<br>\nwhile the differential for coding does not list the type.  Why does it appear for Code but not Coding?</p>",
        "id": 153999625,
        "sender_full_name": "Nick George",
        "timestamp": 1537827642
    },
    {
        "content": "<p>(I should clarify - in neither of those cases is the base type actually defined in Observation, since Observation only defines Observation.code.  Both Observation.code.coding and Observation.code.coding.code are defined through the CodeableConcept type</p>",
        "id": 153999627,
        "sender_full_name": "Nick George",
        "timestamp": 1537827767
    },
    {
        "content": "<p>Some of the tooling requires a declaration of type if you're going to assert a fixed value or pattern - that may have driven the inclusion.</p>",
        "id": 153999651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537833372
    },
    {
        "content": "<p>Yeah I figured it was something like that.  Are rules like that documented anywhere?  I've read the slicing and profiling page :)</p>",
        "id": 153999655,
        "sender_full_name": "Nick George",
        "timestamp": 1537834160
    },
    {
        "content": "<p>That's not so much a rule as it is a tooling limitation.  Not all tools will necessarily have the limitation</p>",
        "id": 153999659,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537834305
    }
]