[
    {
        "content": "<p>Does anyone know if any company/organization has converted UB-04 billing claim form to digital fomat?<br>\nIf so, what data models from FHIR did you incorporate for digitizing UB-04 form?</p>\n<p>Thanks!</p>",
        "id": 191635758,
        "sender_full_name": "raj",
        "timestamp": 1585067000
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 191637729,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585067693
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"268400\">@raj</span> I have uploaded a draft UB04 -&gt; FHIR STU3 mapping spreadsheet to the Financial Management Confluence Documents page at <a href=\"https://confluence.hl7.org/display/FM/Documentation\" target=\"_blank\" title=\"https://confluence.hl7.org/display/FM/Documentation\">https://confluence.hl7.org/display/FM/Documentation</a></p>",
        "id": 191644995,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1585070693
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  I will check and documentation and will get back to you for any further queries!</p>",
        "id": 191748417,
        "sender_full_name": "raj",
        "timestamp": 1585144752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <br>\nIf I understand correctly, the mapping to UB04 document has been done with the below claim resource of FHIR. right?<br>\n<a href=\"http://hl7.org/fhir/stu3/claim.html\" title=\"http://hl7.org/fhir/stu3/claim.html\">http://hl7.org/fhir/stu3/claim.html</a></p>\n<p>If so, I don't see the mapping for some of the fields like Claim.Item (for fields Claim.Item.Service,Claim.Item.Category,Claim.Item.servicedate,etc...)<br>\nIs there a full implementation for digitizing UB04 with this FHIR model and if so, would it be possible to view sample Claim Invoice(test data) from a Nursing Home/Health Care agency?</p>\n<p>Our company is trying to digitize these Invoices that we receive from Providers/Health care facilities and we are looking if it would be feasible to get the Invoice data in this FHIR Data structure </p>\n<p>Thanks for any information you provide!</p>",
        "id": 191769268,
        "sender_full_name": "raj",
        "timestamp": 1585152053
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"268400\">@raj</span> Note that that mapping is to STU3 and I would strongly recommend using FHIR R4. </p>\n<p>The UB-04 is a Claim (payer facing) not an Invoice (patient facing) - I'm picky with the language because it matters in terms of who is the target and the target's responsibility for payment: insurers consider a claim in light of a plan, parties responsible for invoices are responsible for 100% of the outstanding balance. Typically for institutional care statements (which FM is working on developing for R5) are used rather than Invoices for patient billing.</p>\n<p>In the mapping I mapped UB-04 field 44 to service/unit - the billing code, which may include NDC or RxNorm codes, goes in Claim.service and the amount in Claim.item[n].unitPrice.</p>\n<p>Field 44 is mapped to .item[n].serviceDate.</p>\n<p>It would be useful if you could provide more description of your use case, for example are you building an insurer application or a patient supporting applications.</p>",
        "id": 191773334,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1585153588
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <br>\nThanks for the explanation. I was able to find the mapping details for service and servicedate fields, and will check R4 version as well.</p>\n<p>To provide more info, this application would be an insurer application(internal application to our insurance company).<br>\nCurrently, we receive billing details/forms from Facilities/Care Providers and they are processed manually . We are trying to digitize them and checking if it can be implemented through  FHIR DataModel. The payment processing is done at our end.</p>\n<p>All of these facilities do send the same data to CMS  system via Blue Button API and therefore, we are checking if the UB04 Billing form can be  modeled with any FHIR Data Structure, our company could implement a Data Model that mimics it, and all of these facilities would be able to send the billing info via API in this new FHIR format.</p>\n<p>Thanks again for your response.</p>",
        "id": 191795702,
        "sender_full_name": "raj",
        "timestamp": 1585162860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>   <br>\nWanted to know if you could provide any more details on the above query that I mentioned.</p>\n<p>Also,for accessing and building a .NET project that uses this Claim resource and UB04 template, will the following github project work?<br>\n<a href=\"https://github.com/FirelyTeam/fhir-net-api\" title=\"https://github.com/FirelyTeam/fhir-net-api\">https://github.com/FirelyTeam/fhir-net-api</a></p>",
        "id": 192389940,
        "sender_full_name": "raj",
        "timestamp": 1585661725
    }
]