[
    {
        "content": "<p>The HL7 UCUM value set at <a href=\"https://www.hl7.org/fhir/valueset-ucum-units.html\">https://www.hl7.org/fhir/valueset-ucum-units.html</a> lists only 1000 codes on that page.  Where can the entire value set be found?  The page references <a href=\"http://unitsofmeasure.org\">unitsofmeasure.org</a>, which redirects to <a href=\"http://ucum.org\">ucum.org</a>, but even on a page like <a href=\"https://ucum.org/ucum.html\">https://ucum.org/ucum.html</a>, I cannot find a full list of units that is analogous to what is in the HL7 value set.  For example, the HL7 value set includes {Capsule}, but this item cannot be found at <a href=\"https://ucum.org/ucum.html\">https://ucum.org/ucum.html</a>.</p>",
        "id": 247402734,
        "sender_full_name": "Howard Strasberg ",
        "timestamp": 1627426241
    },
    {
        "content": "<p>The list of UCUM codes is infinite.  That's because cm^2, cm^3, cm^4, cm^28759917, etc. are all valid UCUM codes.  (There are other combination approaches that are also essentially infinite.)  A terminology server that understands UCUM can parse a code and evaluate whether it's valid and determine its relationship to other codes.  But no-one can enumerate all the possible codes.  Terminology services download the UCUM 'part' codes from the source of truth and then implement the algorithm.</p>",
        "id": 247404826,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627427579
    },
    {
        "content": "<p>Note that this limitation is true of most post-coordinating code systems.  Post-coordinated SNOMED is also essentially infinite.</p>",
        "id": 247404869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627427612
    },
    {
        "content": "<p>(And non-post-coordinated SNOMED is exceptionally large - and isn't even all published in a single place)</p>",
        "id": 247404885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627427630
    },
    {
        "content": "<p>Thanks.  I understand that the list is infinite, but among the 1000 members listed in the HL7 value set, there are items such as {Capsule}, which as far as I can tell are not enumerated in UCUM.  Where did HL7 get these items, if not from UCUM?</p>",
        "id": 247414421,
        "sender_full_name": "Howard Strasberg ",
        "timestamp": 1627437607
    },
    {
        "content": "<p>That's a question for <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, but he's on extended vacation at the moment, so may take a while to get the answer.  (<span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> might also know?)</p>",
        "id": 247415362,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627438832
    },
    {
        "content": "<p>The FHIR build terminology server (<a href=\"http://tx.fhir.org\">tx.fhir.org</a>) uses the ucum-essence.xml file in its UCUM implementation, but that file doesn't contain any term such as \"Capsule\" (or similar).  So I don't actually know what the source of this specific expansion content set of the UCUM value set is.</p>",
        "id": 247416767,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1627441083
    },
    {
        "content": "<p>{Capsule} is a UCUM annotation. It's for all intents a comment. In UCUM you put words inside {}, no spaces, and UCUM ignores them. They are not part of the measurement, they are hints to the user. </p>\n<p>Quote from the UCUM page \"§6 curly braces       ■1 The full range of characters 33–126 can be used within a pair of curly braces (‘{’ and ‘}’). The material enclosed in curly braces is called annotation.   ■2 Annotations do not contribute to the semantics of the unit but are meaningless by definition. Therefore, any fully conformant parser must discard all annotations. Parsers of limited conformace should not value annotations in comparison of units.   ■3 Annotations do, however, signify the end of a unit symbol.   ■4 An annotation without a leading symbol implies the default unit 1 (the unity).\"</p>",
        "id": 247450560,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1627474396
    },
    {
        "content": "<p>The real valueset of UCUM is infinite, but some validators don't parse the value, they compare the value against a list of \"most common\" UOM. A quick and dirty validation method. But since we are in the medical domain and most of the actual values are used repeatedly, it works most of the time. Meds are measured in mg, people are measured in kg rarely is something measured in dg.</p>",
        "id": 247450925,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1627474680
    },
    {
        "content": "<p>FYI: if you want to learn more about the history of UCUM and the thought process behind it, you might find this JAMIA article very informative:    <a href=\"https://academic.oup.com/jamia/article/6/2/151/770093\">https://academic.oup.com/jamia/article/6/2/151/770093</a></p>\n<p>The authors of this article are some of the 'fathers of UCUM' (and healthcare informatics), e.g. Gunther Schadow, MD, Clement J. McDonald MD, etc.</p>",
        "id": 247697722,
        "sender_full_name": "John Silva",
        "timestamp": 1627645903
    },
    {
        "content": "<p>it just lists the first 1000 codes it knows about, and says that it's just some of them</p>",
        "id": 249678348,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629175743
    }
]