[
    {
        "content": "<p>Hi All</p>\n<p>I am relatively new to FHIR and just getting my head around it over the last few working days.</p>\n<p>I've recently been reviewing various FHIR implementation options and I just wanted to check what the latest is with UK Core v2 and FHIR? It seems to be under discussion / development. If we were to go with an implementation such as Firely server would there be issues if we were to do some sort of integration with say the NHS, or would it just be a minor inconvenience if it wasn't exactly to UK core v2 spec?</p>",
        "id": 240971379,
        "sender_full_name": "Alan Oakden",
        "timestamp": 1622566427
    },
    {
        "content": "<p>hi Alan, I don't think there is a UK Core 2 yet and UK Core (1) is still under construction.</p>\n<p>It's not really correct to think of a general purpose server like Firely being \"to the UK core\" or not, to be honest. UK Core (as with all profiles) is a <em>subset</em> of FHIR. So a server that supports all of FHIR (such as Firely, or HAPI) will not limit you in any way. Profiles can introduce extensions though, and to conform to it the <em>applications</em> at both ends may need to understand those things - and do something with them, probably. But a server in between will normally support all extensions, in that it will just carry them, transparently. So it's not an issue in itself.</p>",
        "id": 240977264,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1622569011
    },
    {
        "content": "<p>Uk core 2 has a few changes which are mostly to remove some hard coded links to fhir versions. <br>\nIt's effectively stable and subject to minor amendments. <br>\nSome big changes will occur such as drug coding moving from UK snomed to dm+d codes but that's a wider nhs change not limited to FHIR.</p>\n<p>It isn't going to give you 100% uk interop, each home country has its own codes and valuesets. For example England use main specialty codes which NI, Wales and Scotland don't use. Only England and Wales use nhs numbers. Etc, etc.</p>\n<p>Do you have an application in mind? In some areas of fhir, home country rules don't matter that much.</p>",
        "id": 241108453,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1622613330
    }
]