[
    {
        "content": "<p>How are people handling uncoded procedures in FHIR?</p>\n<p>My organization receives faxes from other provider systems, with the details of the procedures for the patients we have referred out. However, these faxes rarely contain a CPT or SNOMED code. Yet US Core requires the procedure.code to be filled out (1...1 cardinality).</p>\n<p>How are others filling out this code field for US Core when missing a code?<br>\nAre you planning to include these uncoded procedures if an external app requests patient data? <br>\nWill you provide these uncoded procedures if an external provider requests patient data, such as via an HIE or interoperability connection?</p>",
        "id": 243857998,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1624576452
    },
    {
        "content": "<p>CodeableConcept allows .text for a string.  However, to meet the binding requirement, you'll also have to send a generic SNOMED code (likely 71388002) because the binding requires that a code be sent if one applies - and because of the nature of the value set, 71388002 at minimum always applies.</p>",
        "id": 243936396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624637155
    },
    {
        "content": "<p>We describe this in the latest soon to be published version of us core. Lloyd is technically correct but it adds little value and we recognize this.  Extensible bindings allow for text only.</p>",
        "id": 243940843,
        "sender_full_name": "Eric Haas",
        "timestamp": 1624639386
    },
    {
        "content": "<p>Extensible bindings allow for text only <em>only</em> when what's in the text isn't covered by the value set.  If it is covered by the value set, you must send a code to be conformant (regardless of whether sending the code has value).</p>",
        "id": 243941352,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624639677
    },
    {
        "content": "<p>Thanks Lloyd and Thanks Eric. This is helpful.<br>\n<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> : When will the next version of US Core be published -- and am I able to see the draft of this online? And any guidance on whether or not these should be shared via interoperability connections; or are most health providers not sharing out data if it's uncoded?</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : I'm also considering setting up a shortened list of CPT's and SNOMEDS that my primary care clinic generally sees, but then calling that code set something like \"CPT Guess\" or \"Possible CPT\". The values would mirror actual CPT's and SNOMEDS, but then I could use the code set name to identify this as an uncoded procedure, and to exclude from HEDIS metrics. <br>\nWhat are your thoughts on this approach?</p>",
        "id": 243952125,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1624645273
    },
    {
        "content": "<p>If you put that code in the Procedure.code element, it's going to be treated as the valid code - even if you include an extension indicating that there's some uncertainty.  You could send a 'guess' code as a completely separate extension element, but that's not going to satisfy the profile constraint.</p>",
        "id": 243970413,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624654992
    },
    {
        "content": "<p>Any idea how other health systems are dealing with these in terms of interoperability? My understanding is that many providers are putting in their own \"local organization\" codes into that field -- which do not necessarily map to CPT or SNOMED. Are providers planning to go ahead and send these non-standard code systems and codes out via interop exchanges? Or would the receiving provider prefer to not receive these if they're uncoded?</p>",
        "id": 243977598,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1624659756
    },
    {
        "content": "<p>By definition, all procedures can be coded as SNOMED because 71388002 says 'Procedure' - and it's hard to say that any local code can't, at minimum, be mapped to that.  FHIR binding strengths don't allow for \"too expensive to map\" or \"can't be bothered to map\".  If it's possible for a human being taking 40 hours per code to figure out a mapping, then the implicit requirement is \"a mapping is expected\".  There are some challenges in that the FHIR mapping strengths don't always communicate what the community that wrote the spec ideally wishes they did - which I think in this case is \"do your best\".</p>",
        "id": 243977817,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624659962
    },
    {
        "content": "<p>Thanks Lloyd! Really appreciate your advice. SNOMED 71388002 may end up being my default. I'm going to talk with my team about this SNOMED code, vs using local codes. But the SNOMED 71388002 seems like the safest option right now.</p>",
        "id": 243978532,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1624660583
    },
    {
        "content": "<p>here is the <a href=\"http://build.fhir.org/ig/HL7/US-Core/conformance-expectations.html#extensible-binding-for-codeableconcept-datatype\">updated guidance</a> in US Core 4.0.0  ( ci build ) and we have gone several rounds on this issue and I don't think it is settled.</p>",
        "id": 243982757,
        "sender_full_name": "Eric Haas",
        "timestamp": 1624665040
    },
    {
        "content": "<p>I've got a serious issue with that guidance.  You're trying to relax the rules of the core spec, and IGs can't do that - regardless of how much they might want to.  An instance that fails to send a code where there's an extensible binding to a value set that includes an over-arching SNOMED concept is non-conformant with FHIR and this is, by definition, non-conformant with US Core.  Implying otherwise is simply misleading the implementer community.</p>",
        "id": 243989630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624673935
    },
    {
        "content": "<p>So your point is that the core spec has an error and needs updating, right?</p>",
        "id": 244146925,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624888182
    },
    {
        "content": "<p>That US Core guidance is exactly what the implementer community (based on what I've heard) wants out of that binding type.</p>",
        "id": 244147558,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624888473
    },
    {
        "content": "<p>My point is that US Core has an error.</p>",
        "id": 244167645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624896269
    },
    {
        "content": "<p>US Core can't change the meaning of the binding type</p>",
        "id": 244167656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624896279
    },
    {
        "content": "<p>They're free to propose adding a new binding type, though I'm not sure that what you're trying to do is actually appropriate as a binding at all.  It seems you're actually trying to establish two different sets of conformance rules - which means two different profiles.</p>",
        "id": 244167737,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624896332
    },
    {
        "content": "<p>These are trade-offs.</p>",
        "id": 244168870,
        "sender_full_name": "Eric Haas",
        "timestamp": 1624896879
    },
    {
        "content": "<p>Being non-conformant with the core spec isn't a tradeoff - it's being non-conformant.  Extensible was defined with a particular purpose in mind.  It meets that purpose.  It's also normative.  IGs can't override it to mean something different.</p>\n<p>There are other tools that can allow you to express what you want, be that multiple profiles, warning invariants, best practice invariants and/or hand-wavy documentation in text.  But using the 'extensible' binding and saying \"in our IG, the rules for it are completely different\" is not kosher.</p>",
        "id": 244169390,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624897109
    },
    {
        "content": "<p>Related to this -- what are people planning in terms of interoperability when they have uncoded procedures? Is it appropriate to include these when you receive a query for a patient's list of procedures from another health system, or from an HIE? </p>\n<p>Or are people choosing to exclude these uncoded procedures from external requests?</p>\n<p>If you are on the other end, and you are pulling records for a patient via an interoperability or HIE request, would you expect to see the uncoded procedures? Or would you only wish to see the procedures that have an actual CPT / SNOMED code?</p>\n<p>Just curious what the community is thinking / expecting.</p>",
        "id": 244210101,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1624917734
    },
    {
        "content": "<p>I am not clear how you have \"uncoded procedures\". I understand that you get a fax with a description of the procedure. Is that a report of a procedure that already took place? What happens next? Does your system record the procedure electronically?</p>",
        "id": 244227020,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1624934350
    },
    {
        "content": "<p>We include our \"uncoded\" procedures in the API response, we just don't include a standard code like SNOMED or CPT.  We just include an local code (basically just the internal database identifier for our procedure), along with a text property.  The local code is meaningless to the world (unless there is pre-coordination with the client), but it allows us to  send the procedures (which is important) and still be US Core compliant.</p>",
        "id": 244276586,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624971838
    },
    {
        "content": "<p>-</p>",
        "id": 244277021,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624972035
    },
    {
        "content": "<p>1..1 with required or extensible binding basically prohibits a server from returning relevant uncoded clinical data.  Or at least this is true for non-trivial value sets.</p>",
        "id": 244277024,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624972037
    },
    {
        "content": "<p>Unless you use the US Core flavor where the \"text\" in the CodeableConcept meets the requirement.</p>",
        "id": 244277990,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624972482
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/Uncoded.20procedures.20from.20external.20providers/near/244227020\">said</a>:</p>\n<blockquote>\n<p>I am not clear how you have \"uncoded procedures\". I understand that you get a fax with a description of the procedure. Is that a report of a procedure that already took place? What happens next? Does your system record the procedure electronically?</p>\n</blockquote>\n<p>Hi Vassil -- the vast majority of faxes that we receive do not have the CPT of the procedure, though it does have a description. It is a report of the procedure that took place. I've noticed the same as a patient -- I rarely see codes in the documentation I receive. We then hand enter the info from the fax or image into the chart (though we are evaluating OCR and machine learning algorithms to do this in the future).</p>\n<p>This is different from a C-CDA -- in those cases we receive structured data with the procedure code -- in those cases we have a definitive code from the originating institution, can enter a value into procedure.code, and we have everything we need for quality metrics.</p>",
        "id": 244362492,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1625010016
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/179166-implementers/topic/Uncoded.20procedures.20from.20external.20providers/near/244276586\">said</a>:</p>\n<blockquote>\n<p>We include our \"uncoded\" procedures in the API response, we just don't include a standard code like SNOMED or CPT.  We just include an local code (basically just the internal database identifier for our procedure), along with a text property.  The local code is meaningless to the world (unless there is pre-coordination with the client), but it allows us to  send the procedures (which is important) and still be US Core compliant.</p>\n</blockquote>\n<p>Cooper, have you received any feedback from the receiving institution on these local coded procedures? Have they stated whether they use these or not, and whether or not they are valuable? Do they simply use the text description, and basically ignore the code if they notice it is a local code?</p>",
        "id": 244362543,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1625010095
    },
    {
        "content": "<p>If there is a process to enter the procedure into the chart, it seems to me that at that point you could use a coding tool to add a code - SNOMED or CPT, if possible, or at least a local code, as Cooper suggests.</p>",
        "id": 244413473,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1625055452
    },
    {
        "content": "<p>Having end users add a SNOMED or CPT code sounds terrible.  &lt;Physician burnout&gt;++ .  It is much better to have those codes mapped to your procedure records so when a physician orders a procedure, the codes are just there.  The issue comes from historical procedures, or unmapped procedures.  Many organizations have goals to map all their procedures, but that is a big effort, and includes ongoing maintenance.</p>",
        "id": 244442059,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1625066998
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"408229\">@Daniel Tam</span>  - regarding feedback, we 100% expect that receiving institutions won't be able to do anything useful with local codes.  I don't expect they are valuable.  Unless that receiving institution has a business relationship and pre-coordinates the meaning of the local value set.</p>",
        "id": 244444032,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1625067763
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/Uncoded.20procedures.20from.20external.20providers/near/244413473\">said</a>:</p>\n<blockquote>\n<p>If there is a process to enter the procedure into the chart, it seems to me that at that point you could use a coding tool to add a code - SNOMED or CPT, if possible, or at least a local code, as Cooper suggests.</p>\n</blockquote>\n<p>Hi Vassil, we would not want to add a CPT / SNOMED code. The reason is that the procedure was already coded -- we would want the original code from the institution, especially when it comes to quality / HEDIS metrics. Re-coding a procedure, while possible using mappings, would probably not stand up to an audit. We are going to see if the CPT/SNOMED can be pulled from an HIE like CareQuality -- will be trying that in the coming months. In the meantime the local codes would probably work -- we definitely would not have the end user add those -- Cooper is right that would result in physician burnout.</p>",
        "id": 244450265,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1625070157
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/179166-implementers/topic/Uncoded.20procedures.20from.20external.20providers/near/244444032\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"408229\">Daniel Tam</span>  - regarding feedback, we 100% expect that receiving institutions won't be able to do anything useful with local codes.  I don't expect they are valuable.  Unless that receiving institution has a business relationship and pre-coordinates the meaning of the local value set.<br>\n<span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> : Yep, I agree, the local codes won't help the receiving institution. I was more curious whether the receiving institutions you worked with wanted to know about these uncoded procedures coming from a third party? Or should we as a community avoid returning uncoded procedures when others query our FHIR servers? I suspect it is helpful for receiving institutions to have these uncoded procedures but wanted to see what you had heard.</p>\n</blockquote>",
        "id": 244450508,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1625070273
    },
    {
        "content": "<p>Excluding clinical data from an API response just because it is not coded using the value set you want seems like a bad idea.  I have the very strong opinion that all data should be returned regardless of the codes available, and that receiving systems MUST have some method of handling un-coded data, because such data exists and is common in the healthcare ecosystem.  What systems do with un-coded data is really up to them.  Some may treat it as just textual content.  Some might log some sort of error or require an end user to do some reconciliation step.  It really varies a lot based on the use case.</p>",
        "id": 244451692,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1625070823
    },
    {
        "content": "<p>I agree that you would not want to re-code a previously coded procedure. It wasn't clear that the source actually had the information as properly coded discrete data. If that is the case, why on earth are you getting it as a fax? An HL7 v2 interface over HTTPS would work just fine, wouldn't it? Or a CDA document with discrete entries?</p>",
        "id": 244461831,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1625075064
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/Uncoded.20procedures.20from.20external.20providers/near/244461831\">said</a>:</p>\n<blockquote>\n<p>I agree that you would not want to re-code a previously coded procedure. It wasn't clear that the source actually had the information as properly coded discrete data. If that is the case, why on earth are you getting it as a fax? An HL7 v2 interface over HTTPS would work just fine, wouldn't it? Or a CDA document with discrete entries?</p>\n</blockquote>\n<p>Vassil: Agreed, a CDA or HL7 v2 would probably be better! But not all health systems use those consistently -- sometimes the provider simply sends a fax, even if they have access to HL7 or CDA's. Also, there are times when we'll get a CDA on the surface but it's just a fax attached. I think it sometimes depends on the individual clinician, if if that clinician is working at a larger health system with access to HL7 and CDA's.</p>",
        "id": 244469251,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1625078210
    }
]