[
    {
        "content": "<p>Hello! I'm new here and I just recently found out about FIHR. If my question is not directed to the right stream, please let me know and I will resend it to the correct stream! </p>\n<p>Anyways I have a question around the use cases of FIHR. I am confused about when and how FIHR would be used. Assume I built an EHR system that was currently in operation in a clinic. Now assume It's been active for years and so I have years of data stored in whatever format I decided. At what point would I interact with a FIHR server? Is it only when there is a need to communicate this data out to another system?</p>",
        "id": 223858001,
        "sender_full_name": "Danial Betres",
        "timestamp": 1611553967
    },
    {
        "content": "<p>Yes.  FHIR is fundamentally in exchange standard.  If you don't have a need for exchange, you don't have a need for FHIR.  However, if you've got an EHR system, it's pretty much a given that there'll be a need for exchange - your patients are going to want their data to be accessible elsewhere, and you'll likely want to be able to consume information that gets originally captured outside your EHR.  You might also have an interest in supporting SMART on FHIR or CDS Hooks which allow your EHR to be extended by 3rd party apps - and which depend on having a FHIR server.</p>",
        "id": 223858157,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611554191
    },
    {
        "content": "<p>Thanks for the quick reply Lloyd! That makes sense. So if I am to understand this correctly, that means when the time comes for there to be a need for the data to be accessible elsewhere, I would:</p>\n<ul>\n<li>Convert my data to fit the FIHR format</li>\n<li>Allow other clinics/organizations to access my server that contains my data in FIHR format (Done through some API's)</li>\n</ul>\n<p>And because it is in a mutually understandable format, they will be able to process and make sense of the data, assuming they are also in line with FIHR. Is this correct?</p>",
        "id": 223858827,
        "sender_full_name": "Danial Betres",
        "timestamp": 1611555011
    },
    {
        "content": "<p>Also, if you will, I would just like to understand another use case. If someone were to develop a new EHR system, where would FIHR come into play at the beginning stages?  One option that comes to mind is I may consider using something like FIHRBase so that I could also persist my data in FIHR format, but if I decide against that, then is there no use for it ?</p>",
        "id": 223859043,
        "sender_full_name": "Danial Betres",
        "timestamp": 1611555274
    },
    {
        "content": "<p>FHIR is an interoperability standard, and may (but that's not the intent of FHIR) be used by some as a persistence format. There are pros and cons to such a decision (see <a href=\"http://build.fhir.org/storage.html\">http://build.fhir.org/storage.html</a> for some of the considerations). <br>\nGiven that it's an exchange standard, most legacy systems will just create some sort of facade / interface module that translates between the internal representation (whatever it may be) and the exchange-representation (FHIR) of the data.</p>",
        "id": 223862622,
        "sender_full_name": "René Spronk",
        "timestamp": 1611559939
    }
]