[
    {
        "content": "<p>Working on the FHIR interface for an EHR solution was crossing a text style issue. Seeing that the markdown data type is using GMF there is a particular downside with it. GMF specification <a href=\"https://github.github.com/gfm/\" target=\"_blank\" title=\"https://github.github.com/gfm/\">https://github.github.com/gfm/</a> doesn't cover underlined text. However we see such when users are writting various texts. <br>\nDoes anyone has seen same issue and what is your way to deal with it?</p>",
        "id": 155086760,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1547475504
    },
    {
        "content": "<p>Well underlines get confused with links so I think that its good they are not in GMF,  <br>\nhere is a better answer:...</p>\n<blockquote>\n<p>There are no mention of \"bold\" or \"italics\" in the markdown syntax document. What there is, is an emphasis section, which describes how the use of underscore and asterix -marked spans (*, _, **, __) should produce code wrapped in &lt;em&gt; and &lt;strong&gt; tags.</p>\n</blockquote>\n<p><a href=\"https://softwareengineering.stackexchange.com/questions/207727/why-there-is-no-markdown-for-underline\" target=\"_blank\" title=\"https://softwareengineering.stackexchange.com/questions/207727/why-there-is-no-markdown-for-underline\">https://softwareengineering.stackexchange.com/questions/207727/why-there-is-no-markdown-for-underline</a></p>",
        "id": 155107851,
        "sender_full_name": "Eric Haas",
        "timestamp": 1547492916
    },
    {
        "content": "<p>Sure, have seen this and similiar statements. But really wondering when facing of a situation were to provide FHIR support to existing system how to deal with it. Most of EHR system have to a certain extend basic styling capabilities for writing text. Usually italic, bold, underline maybe bullet points too. Not having such semantic meaning in legacy data it means that a idenitical representation is not possible. Know I sound picky here, but after many conversations with physicians about text styling I see here a reasonable need.</p>",
        "id": 155153713,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1547540929
    },
    {
        "content": "<p>it's a problem that you should take up with the CommonMark spec - say, at <a href=\"http://talk.commonmark.org\" target=\"_blank\" title=\"http://talk.commonmark.org\">talk.commonmark.org</a></p>",
        "id": 155169603,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547559791
    },
    {
        "content": "<p>Hm, not sure how taking it up to CommonMark might help since they had this discussion several times already and there are valid reasons not to include it in CommonMark. I'm wondering what the recommended way would be to deal with Axel's use case. An extension? Using the narrative with xhtml? Wouldn't it make sense to allow xhtml in strings as well?</p>",
        "id": 155241600,
        "sender_full_name": "Johannes Faber",
        "timestamp": 1547632938
    },
    {
        "content": "<p>we won't allow xhtml. Allowing it in narrative has raised many questions....</p>",
        "id": 155247743,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547639737
    },
    {
        "content": "<p>what are commonmark's reasons?</p>",
        "id": 155247758,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547639757
    },
    {
        "content": "<p>Basically this is coming from HTML specs I guess. Read HTML5 specification you can read that &lt;u&gt; tag should avoided due to same visualisation as links. &lt;u&gt; has marked as dated in HTML4 afaik. <br>\nWould use of this tag a possibilty even so?</p>",
        "id": 155252416,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1547644610
    },
    {
        "content": "<p>I wish that I knew the answer to this. We don't allow raw HTML for extremely good reasons. We wouldn't define our own extensions to commonmark for very good reasons</p>",
        "id": 155253978,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547646236
    },
    {
        "content": "<p>but I see the problem</p>",
        "id": 155254410,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547646704
    },
    {
        "content": "<p><a href=\"https://talk.commonmark.org/t/revisting-underline-healthcare-documents/3078/2\" target=\"_blank\" title=\"https://talk.commonmark.org/t/revisting-underline-healthcare-documents/3078/2\">https://talk.commonmark.org/t/revisting-underline-healthcare-documents/3078/2</a></p>",
        "id": 158841702,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550540153
    },
    {
        "content": "<p>Wow, that was a long discussion --- but it does point out the \"conflicting concerns\".   One person makes the point, which I've heard before in the HTML world is \"keep the display styling separate from the semantics of the mark-up.  This allows client visualizers to use whatever is appropriate for communicating the content's semantics (think of an audio for visually impaired readers -- I think this is one of the classic examples of why display needs to be separated from semantics in HTML).   I'm not sure if the suggestion of the \"____\" markup works in this case or not but there was another more verbose markup that does.</p>",
        "id": 158845567,
        "sender_full_name": "John Silva",
        "timestamp": 1550546728
    },
    {
        "content": "<p>well, in principle, of course, I completely agree about separating semantics and display. But legacy documents don't work that way</p>",
        "id": 158845893,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550547285
    },
    {
        "content": "<p>Oh, I didn't see the mention of 'legacy documents' in that discussion thread.</p>",
        "id": 158847641,
        "sender_full_name": "John Silva",
        "timestamp": 1550550155
    },
    {
        "content": "<p>not explicitly, no, but that's what it's all about</p>",
        "id": 158848641,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550551850
    }
]