[
    {
        "content": "<p>Suppose I have an IG that says to use param X once and with 1 value:</p>\n<ul>\n<li>\n<p>Is there a default expectation for a compliant server on how to deal with repetitions of param X? <br>\n** Ignore (or Support if it chooses to do so), <br>\n** Refuse</p>\n</li>\n<li>\n<p>Is there a default expectation for a compliant server on how to deal with repetitions of the value of param X? <br>\n** Ignore (or Support if it chooses to do so), <br>\n** Refuse</p>\n</li>\n</ul>",
        "id": 180723439,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1573732552
    },
    {
        "content": "<p>unknown parameters should be ignored?</p>",
        "id": 180724270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573733334
    },
    {
        "content": "<p>Is the second repetition of a known parameter considered \"unknown\"?<br>\nIs the second value of a known parameter considered \"unknown\"?</p>",
        "id": 180724657,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1573733719
    },
    {
        "content": "<p>no it's still a known parameter. What it means depends on the parmaeter</p>",
        "id": 180725021,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573734010
    },
    {
        "content": "<p>Sure, but the second occurrence or value was not specified so it might not be catered for. Would the server logic then be expected to ignore that extra occurrence or value (Prefer: handling=lenient), or could it refuse to answer (Prefer: handling=strict). Or should the server logic always be prepared for repetitions of value, but not necessarily for repetitions of the parameters?</p>",
        "id": 180725519,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1573734461
    },
    {
        "content": "<p>it should be prepared for both</p>",
        "id": 180725823,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573734746
    },
    {
        "content": "<p>So that means an IG could not meaningfully constrain repetitions of either param or its value? Or by preparation you mean, being able to detect them and not simply skip them?</p>",
        "id": 180725976,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1573734863
    },
    {
        "content": "<p>If the server had its own business logic which constrains the use of a particular parameter to one occurence, I'd definitely expect the server to create an error. We want P=a&amp;P=b to be isomorphic with P=b&amp;P=a if P is a known parameter.  The problem is of course that this constraint use case has never been considered, and as such Alexander may just have to put forward an issue with a proposal as to what wording should be added to the standard.</p>",
        "id": 180802369,
        "sender_full_name": "René Spronk",
        "timestamp": 1573793545
    }
]