[
    {
        "content": "<p>Can a CarePlan start without a practitioner planning specific care? E.g. can we use CarePlan to support COVID-19 case following, having the care plan start from a screening in a nursing home, or a contact tracing app trigger..</p>",
        "id": 212387365,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1601963619
    },
    {
        "content": "<p>isn't that more of an Encounter?</p>",
        "id": 212421101,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601988055
    },
    {
        "content": "<p>I would hope that a CarePlan doesn't require a PCP to initiate. I as a patient might want to set my own goals, set my own plan, and track toward it.. right?</p>",
        "id": 212421167,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601988099
    },
    {
        "content": "<p>The detection of COVID-19 would be modeled as a Concern resource. A CarePlan could be instantiated to 'address' the Concern.CarePlan resources don't actually have to have any activities, so the creation of an 'empty' CarePlan is certainly an option, should the 'meta information' of the CarePlan be known prior to any planned activities. If that meta information isn't of importance, then a Conrenc would be sufficient.</p>",
        "id": 212425567,
        "sender_full_name": "René Spronk",
        "timestamp": 1601990203
    },
    {
        "content": "<p>Is there a resource that can be used to track the whole cycle, from the moment my app says that I had contact with someone that may or may not have been infected (which just tells me to stay home), until immunization or resolution?</p>",
        "id": 212426998,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1601990912
    },
    {
        "content": "<p>Condition could work that way, as Condition.stage has space for many observations but you'd need others for things like immunizations.  Condition.abatement can handle resolution, though.</p>",
        "id": 212428742,
        "sender_full_name": "David Pyke",
        "timestamp": 1601991673
    },
    {
        "content": "<p>There has been a running discussion within a group of engineers doing Computable Care Guideline (CCG) prototyping as to whether or not the CarePlan should be used (as a bucket) to contain both forward-looking activities <strong>and</strong> a history of activities that <strong>were done</strong> in support of a care plan. In this way, the metadata in the CarePlan can be leveraged to usefully organize the activities. What do others think of this idea? <span class=\"user-mention\" data-user-id=\"192545\">@Alex Goel</span></p>",
        "id": 212443305,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1601997496
    },
    {
        "content": "<p>seems CarePlan, even in most formal use as a 'plan of care', is intended to track success/failure toward that plan... so are you just asking if things that are not scheduled, but happen, that are relevant to the goals of the plan, can be recorded as having happened in the carePlan?</p>",
        "id": 212449549,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602000348
    },
    {
        "content": "<p>We used the CarePlan as a contextual bucket in our demonstration: <a href=\"https://simplifier.net/guide/LungCancerDiagnosisComputableCareGuidline/Resources\">https://simplifier.net/guide/LungCancerDiagnosisComputableCareGuidline/Resources</a> to track references to our other resources</p>",
        "id": 212452841,
        "sender_full_name": "Alex Goel",
        "timestamp": 1602001810
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I don't think its as much to put everything that might be (tangentially) relevant in the bucket... rather to put everything that was done in satisfaction of a PlanDefinition (a guideline-based plan of care) in the bucket. Or not... as I said... it is an ongoing discussion whether it should be a forward-looking bucket (only) or an \"everything\" bucket. ;-)</p>",
        "id": 212455468,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602003278
    },
    {
        "content": "<p>that seems very fundimental. So there is uncertainty that a CarePlan would point at what was done? I was thinking that was clear., as the CarePlan model includes elements explicitly for including .activity.outcomeReference, and .activity.outcomeCodeableConcept.</p>",
        "id": 212458004,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602004627
    },
    {
        "content": "<p>Or is the question... why use the .activity.outcome[x] where the .activity.reference resource includes what should be done and what was done? Meaning is it really important to update the CarePlan when an activity is done? Especially when that activity may not have known that it was part of a carePlan?</p>",
        "id": 212458489,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602004857
    },
    {
        "content": "<p>With my security hat on... the completion of a MedicationRequest certainly has and needs the access controls to update the MedicationRequest and all the other medication resources to complete the dispensing etc... but that department does not (should not) need the rights to update the carePlan</p>",
        "id": 212458678,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602004969
    },
    {
        "content": "<p>Scenario at hand: <br>\n\"Last month we started tracking a person, and 3 days ago we found  that last week they were in a meeting with someone that today is tested positive for COVID. From now on we start isolating, then if the result is positive  we need to do something else.\"</p>",
        "id": 212469110,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602010215
    },
    {
        "content": "<p>I want to see which resource i'd use since the beginning (Last month). I think it is a care plan.</p>",
        "id": 212469174,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602010249
    },
    {
        "content": "<p>Concern \"may have been exposed to COVID-19\" ? (Would be true for all of us, but this would reflect the reason for the tracking). CarePlan would only (?) be applicable once the patient has contracted COVID-19. We have various countries (e.g. US, Germany) that have IGs related to covid, so it would make sense to start looking there.</p>",
        "id": 212519773,
        "sender_full_name": "René Spronk",
        "timestamp": 1602052530
    },
    {
        "content": "<p>let me take that one step back - what if 2 months ago someone decided that \"patient contacts must be traced\" ?</p>",
        "id": 212521967,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602054983
    },
    {
        "content": "<p>so I don't feel very comfortable that a care plan only starts when someone is sick. To me a care plan could also be preventive</p>",
        "id": 212522007,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602055024
    },
    {
        "content": "<p>That's why I used a ? in my statement, I'm not sure. But signing someone up to a tracking program - is that a preventive measure? It doesn't prevent anything for the patient, just for those in contact with the patient. But your question isn't in anyway specific to  country, so again I'd first look at SANER (US) and COCOS (DE, I haven't read that spec I must confess).</p>",
        "id": 212522574,
        "sender_full_name": "René Spronk",
        "timestamp": 1602055520
    },
    {
        "content": "<p>thanks</p>",
        "id": 212523386,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602056073
    },
    {
        "content": "<p>I'm trying to avoid a hard boundary between \"patient\" and \"not yet patient\". Perhaps I should have called it \"subject\".<br>\nFor a initially healthy subject, i'm looking at how to track activities - could be a health habits questionnaire, a diabetes risk assessment, sleep patterns or fitbit data... and then continue that, in sickness and in health. As a coleague said - making it about health, not only about care.</p>",
        "id": 212523892,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602056476
    },
    {
        "content": "<p>I like the name \"Concern\" but that resource seems to be not an actionable flow, and seems to start when someone is actually concerned.</p>",
        "id": 212524014,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602056562
    },
    {
        "content": "<p>My perspective is that a CarePlan is about <em>managing</em> care.  Sometimes management is just about monitoring.  Sometimes management is about noting concerns and goals so they can be evaluated next time you talk.  Sometimes management is about identifying the set of stakeholders who are relevant and what role each will have if/when there's action to take.</p>",
        "id": 212553925,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602075506
    },
    {
        "content": "<p>Patient,  in FHIR, is anyone who is potentially subject to care.</p>",
        "id": 212553976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602075531
    },
    {
        "content": "<p>Yes,in FHIR, Patient is a generic concept.</p>",
        "id": 212556461,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602076702
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I think we should take care to not make CarePlan too generic to be of value. At its extreme, we can say that everyone has a CarePlan (even it is just to eat right and get enough sleep). As <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> has noted, however, for some of us there is a very deliberate care management that is being operationalized. For me -- I focus very much on the notion that a CarePlan can be connected to such a management definition through the PlanDefinition relationship. We are making use of this in our CCG work. Importantly... a top-level, person-centric CarePlan could be the container for multiple (hopefully) coordinated PlanDefinition-based care plans addressing multiple conditions. This starts to move us to the golden idea of person-centric (as opposed to disease-centric) care. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 212563806,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602079894
    },
    {
        "content": "<p>You <em>could</em> have a CarePlan that just says \"eat right and get enough sleep\".  The question is whether clinicians (or patients or caregivers) would bother creating one if that's all it was going to say.  A CarePlan can be captured whenever there's care to be managed and someone feels it's useful to document that plan.  Having a CarePlan doesn't imply that there must be planned interventions.</p>",
        "id": 212567117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602081319
    },
    {
        "content": "<p>pinging <span class=\"user-mention\" data-user-id=\"346209\">@Hanne Vuegen</span></p>",
        "id": 213284004,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602680357
    }
]