[
    {
        "content": "<p>Is there a way to indicate that two Patients are unrelated, other than the absence of FamilyMemberHistory or RelatedPerson?</p>\n<p>We need to indicate the relationship between a transplant Donor and a Recipient. The fact that these two people may be unrelated is important for us to capture. We prefer to assert that these two are unrelated, instead of relying on the absence of an assertion that they are related.</p>",
        "id": 169907816,
        "sender_full_name": " Bob Milius",
        "timestamp": 1562622656
    },
    {
        "content": "<p>I think the only thing you could use is the RelatedPerson resource with a new code of 'Donor' or 'Recipient'.</p>",
        "id": 169909529,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1562624586
    },
    {
        "content": "<p>does this mean, no genetic relationship?</p>",
        "id": 169909628,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562624714
    },
    {
        "content": "<p>Genetic or personal I presume.</p>",
        "id": 169910865,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562626209
    },
    {
        "content": "<p>well, we need to specific statements around the difference then</p>",
        "id": 170409578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562626950
    },
    {
        "content": "<p>No genetic relationship other than histocompatibilty (HLA typing). There are donors that are family members (e.g., sibling). Others are found using a donor registry (people who have signed up to get their HLA typed and agree to be a donor for a stranger if a match is found). I can create a familial relationship between two patients using FamilyMemberHistory extension  familymemberhistory-patient-record. But other than the absence of that, I can't see how to assert that two patients are unrelated (matched though a donor registry).</p>",
        "id": 170458432,
        "sender_full_name": " Bob Milius",
        "timestamp": 1562682718
    },
    {
        "content": "<p>I agree this doesn't feel right to leverage RelatedPerson or familymemberhistory for this, and would thinkba specific value somewhere else specifically for it.<br>\nAn extension on the RelatedPerson might make sense, but could also be related to however the donor part is identified.</p>",
        "id": 170864600,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1563167436
    },
    {
        "content": "<p>Would it be appropriate to create modifier extension to RelatedPerson to assert they are NOT related? from <a href=\"https://www.hl7.org/fhir/extensibility.html#isModifier\" target=\"_blank\" title=\"https://www.hl7.org/fhir/extensibility.html#isModifier\">https://www.hl7.org/fhir/extensibility.html#isModifier</a> : \"There are some cases where the information provided in an extension modifies the meaning of the element that contains it. Typically, this means information that qualifies or negates the primary meaning of the element that contains it\"</p>",
        "id": 171008611,
        "sender_full_name": " Bob Milius",
        "timestamp": 1563298627
    },
    {
        "content": "<p>Don't think you'd need a modifier.  Something as simple as as an \"unrelated\" relationship code could work.</p>",
        "id": 171014917,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563302475
    }
]