[
    {
        "content": "<p>The specification is clear that unsupported search parameter modifiers should be rejected, but I couldn't find any guidance about unsupported search parameters. Should unsupported search parameters result in the request being rejected or is the parameter ignored and the result returned as though the parameter was not provided?</p>",
        "id": 153826697,
        "sender_full_name": "Heath Frankel",
        "timestamp": 1462936401
    },
    {
        "content": "<p>Unsupported search parameters are ignored.  You echo back what search parameters you actually use in the location header</p>",
        "id": 153826698,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1462936861
    },
    {
        "content": "<p><a href=\"http://hl7-fhir.github.io/compatibility.html#1.10.3\" target=\"_blank\" title=\"http://hl7-fhir.github.io/compatibility.html#1.10.3\">http://hl7-fhir.github.io/compatibility.html#1.10.3</a></p>",
        "id": 153826699,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462936916
    },
    {
        "content": "<p>In theory, we specify that:</p>\n<blockquote>\n<p>Unrecognized search criteria SHALL always be ignored</p>\n</blockquote>\n<p>In practice some popular servers don't find this approach palatable.</p>",
        "id": 153826701,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462936951
    },
    {
        "content": "<p>Also, the only way I was able to find that quote was by knowing it existed and googling carefully. It's totally undiscoverable information.</p>",
        "id": 153826702,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462937025
    },
    {
        "content": "<p>On <code>search.html</code> we say:</p>\n<blockquote>\n<p>server SHALL reject any search request that contains is suffixed by a modifier that the server does not support</p>\n</blockquote>\n<p>but we say nothing about \"unrecognized search criteria\".</p>",
        "id": 153826703,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462937080
    },
    {
        "content": "<p>Glad to know I wasn't the only one that couldn't find it. I had a feeling I had read it before but couldn't find it when I reread looking for it again.</p>",
        "id": 153826710,
        "sender_full_name": "Heath Frankel",
        "timestamp": 1462938765
    },
    {
        "content": "<p>what we specifically say is that don't reject a search because of unknown url parameters. </p>",
        "id": 153826748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462963409
    },
    {
        "content": "<p>we do not make any rules about recognised but unsupported search parameters. A server can ignore them, return a bigger result set than expected, and let the client now in the _self link. or it can refuse to perform the search. </p>",
        "id": 153826749,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462963456
    },
    {
        "content": "<p>I do not think that forcing all servers to do one or the other is a good thing</p>",
        "id": 153826750,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462963468
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153826751,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462963483
    },
    {
        "content": "<p>I agree strongly.  :)</p>",
        "id": 153826775,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1462967503
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9985\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9985\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9985</a></p>",
        "id": 153826779,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462968922
    },
    {
        "content": "<p>After talking with <span class=\"user-mention\" data-user-id=\"191936\">@Michael Donnelly</span>  for a bit in the real world, I would say that I'm more in favor of at minimum specifying the servers SHOULD ignore these parameters rather than return an error. From a client perspective, allowing servers to error on unsupported search parameters means that clients need to bake in behavior to avoid errors emitted from servers due to differing search parameter support. by saying servers should ignore, the likely case is that clients will get additional data back that they did not expect, and good clients will filter themselves anyway.</p>",
        "id": 153826969,
        "sender_full_name": "Sean Moore",
        "timestamp": 1462989838
    },
    {
        "content": "<p>Ignoring the parameters seems far more likely to allow clients to work across server implementations</p>",
        "id": 153826970,
        "sender_full_name": "Sean Moore",
        "timestamp": 1462989865
    },
    {
        "content": "<p>I continue to be surprised that so many people would want servers to more-or-less silently ignore search parameters they don't understand. I mean yeah, you can figure it out by examining the self link, but the behaviour \"you asked for X but I'm going to give you Y instead because I don't understand X\" just seems to me like a recipe for bugs (at best), or just plain unsafe at worst.</p>\n<p>Ultimately I'm glad we're in agreement that this should not be prescriptive on the part of FHIR. I guess this should really be configurable in HAPI.</p>",
        "id": 153826993,
        "sender_full_name": "James Agnew",
        "timestamp": 1462992006
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> -- it's dangerous for a server to return an answer that is not for the question it was asked.  I think that in something as life-and-death as healthcare, we should not design on the assumption that clients will employ well-written, defensive code.  &lt;horrible-analogy&gt; Sam has a gluten allergy.  Sam goes to the store and buys a box of cookies from the \"gluten-free\" aisle.  He eats them and gets sick.  When he complains to the store, they tell him that even though the cookies were in the gluten-free aisle, it's his fault because he should have read the ingredients label. &lt;/horrible-analogy&gt;.  Aren't supported search params part of the conformance statement?  If so, then the \"good clients\" should already know not to issue the search anyway -- and the \"not-so-good clients\" will get the error they deserve (and that won't harm anyone).</p>",
        "id": 153827007,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462994402
    },
    {
        "content": "<p>I think this is recognition that in REST a query is an ask of the server to do the best job it can to find the results, and not an expectation that the query is a perfect query that produced absolute results.</p>",
        "id": 153827008,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462994746
    },
    {
        "content": "<p>Where does that principle come from?</p>",
        "id": 153827010,
        "sender_full_name": "James Agnew",
        "timestamp": 1462994842
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> - This is the behavior of every website that I can think of when I pass it a query parameter that it doesn't understand. It just ignores it because it isn't looking for that particular param. Eg: <a href=\"http://www.google.com/search?btnG=1&amp;pws=0&amp;q=fhir&amp;unknownParameter=foo\" target=\"_blank\" title=\"http://www.google.com/search?btnG=1&amp;pws=0&amp;q=fhir&amp;unknownParameter=foo\">http://www.google.com/search?btnG=1&amp;pws=0&amp;q=fhir&amp;unknownParameter=foo</a></p>",
        "id": 153827012,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462995267
    },
    {
        "content": "<p>I feel like using how websites work isn't the best way of informing our choices..... I mean, google's homepage isn't a REST API, it's a website. They want to maximize eyeballs on their page, not maximize safe use of their data.</p>",
        "id": 153827016,
        "sender_full_name": "James Agnew",
        "timestamp": 1462995430
    },
    {
        "content": "<p>Well, that is what REST is -- the web.</p>",
        "id": 153827021,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462995560
    },
    {
        "content": "<p>Part of the reasoning for using REST (and the success of it) is the conventions that are part of REST and what make it nice/easy to work with as a developer</p>",
        "id": 153827024,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462995600
    },
    {
        "content": "<p>I think there is a difference between an unknown search parameter (not listed in the specs) - that is quite safe to ignore - and a parameter that is in the spec but the server does not implement</p>",
        "id": 153827027,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1462995693
    },
    {
        "content": "<p>I do believe that so far we have found strong support for my contention that we should not force behaviour either way</p>",
        "id": 153827029,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462995701
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> - Good point. A well designed server will advertise the search params it honors in the Conformance and a well designed client will check this</p>",
        "id": 153827034,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462995858
    },
    {
        "content": "<p>Heh, on that there is no doubt.</p>",
        "id": 153827037,
        "sender_full_name": "James Agnew",
        "timestamp": 1462995925
    },
    {
        "content": "<p>Yeah, it's the assumption of a \"well designed client\" that concerns me.  In so many spaces, it doesn't matter too much if the server \"does its best\"-- but I feel that in <strong>this</strong> space, a well-intentioned best effort can lead to disastrous results.</p>",
        "id": 153827039,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462996199
    },
    {
        "content": "<p>it depends on the search parameter. </p>",
        "id": 153827040,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462996233
    },
    {
        "content": "<p>ignoring subject/patient search parameter is probably going to be a disaster, but ignoring some qualifier will lead to too many matches in a way that is obvious to the user immediately</p>",
        "id": 153827041,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462996279
    },
    {
        "content": "<p>/AllergyIntolerance?substance=http://snomed.info/sct| 227493005&amp;status=refuted</p>\n<p>Deadly if status is not supported.</p>",
        "id": 153827042,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462996369
    },
    {
        "content": "<p>Given that so many fhir resources can have their meaning totally changed (or even inverted) by a single attribute, there are many examples where this can be very bad.</p>",
        "id": 153827043,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462996441
    },
    {
        "content": "<p>1. This is the predominant convention of the web -- ignore unknown query params<br>\n2. You're calling out a poorly designed client which is the root problem -- not the lack of an error on the unhandled <code>status</code> param. If the client is getting this wrong by wrongly assuming the server can handle <code>status</code>, it's probably missing a bunch of other stuff too</p>",
        "id": 153827048,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462996884
    },
    {
        "content": "<p>(disclaimer here: I'm happy with where we've landed, and I'm certainly not trying to feed a war or change anyone's mind.. I just find this topic interesting)</p>\n<p>I don't see why web conventions apply here. REST APIs and websites use the same underlying protocol, but that doesn't mean they are the same thing. Do Google's AdWords APIs ignore things they don't understand? (maybe they do, i have no idea)</p>",
        "id": 153827049,
        "sender_full_name": "James Agnew",
        "timestamp": 1462997176
    },
    {
        "content": "<p>I don't know if Google's AdWords API ignores them but I'd bet you a beer they do. :-)<br>\nEvery JSON API I've seen ignores any key that it doesn't know about</p>",
        "id": 153827055,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462997514
    },
    {
        "content": "<p>Strictly, this is not a fair comparison - google are not choosing to implement a spec they didn't write, and interop spec, They are - as we already recommend - ignoring unknown parameters </p>",
        "id": 153827056,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462997582
    },
    {
        "content": "<p>but I stil agree with Kevin in general</p>",
        "id": 153827057,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462997613
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span>: I'm OK with ignoring truly <strong>unkown</strong> parameters, but as <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> noted -- there is a difference between unknown (not in the spec) and unsupported (in the spec but not supported).  And yep -- I am calling out a poorly designed client because I have a hunch that if we look at all of the clients making queries to fhir, we'd find more than a few that neither check the server conformance nor check the self url to ensure support of the parameters they are using.  But it is only a hunch (I haven't researched it).</p>",
        "id": 153827058,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462997655
    },
    {
        "content": "<p>I agree with you <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>, I'm sure there are lots of badly behaving clients out there. Bugs exist anywhere, even in (unfortunately) our space (healthcare)</p>",
        "id": 153827059,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462997713
    },
    {
        "content": "<p>I supposed there is the flipside -- if we say servers must return an error for unsupported parameters, then badly behaved servers (who don't return errors) will cause problems for technically spec-compliant clients.</p>",
        "id": 153827061,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462997791
    },
    {
        "content": "<p>Also - defining what \"truly unknown\" is becomes problematic. What if my poorly behaving client is running an STU 3 client against a DSTU 2 server. They can check conformance for that as well, but that's also where the param support is documented :)</p>",
        "id": 153827062,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1462997826
    },
    {
        "content": "<p>Does this mean someone owes someone else a beer?<br>\n<a href=\"https://developers.google.com/doubleclick-search/v2/standard-error-responses#BAD_REQUEST\" target=\"_blank\" title=\"https://developers.google.com/doubleclick-search/v2/standard-error-responses#BAD_REQUEST\">https://developers.google.com/doubleclick-search/v2/standard-error-responses#BAD_REQUEST</a></p>",
        "id": 153827065,
        "sender_full_name": "Corey Spears",
        "timestamp": 1462998003
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> - Note that we could take this entire discussion and apply it to FHIR resources and a 404 response. In this case the client doesn't know if it got a 404 because the FHIR resource isn't implemented in the server (since we're assuming they are poorly designed client that isn't checking Conformance) or the server cannot find the resource.</p>",
        "id": 153827067,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462998008
    },
    {
        "content": "<p>Maybe :-)</p>",
        "id": 153827068,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462998046
    },
    {
        "content": "<p>It does look like it. This is the first API I've seen with this behavior. Still doesn't change my opinion on this, but I'll honor that beer bet with <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>  nevertheless :-)</p>",
        "id": 153827069,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462998156
    },
    {
        "content": "<p>Two beers?<br>\n<a href=\"https://msdn.microsoft.com/en-us/library/azure/dd179357.aspx\" target=\"_blank\" title=\"https://msdn.microsoft.com/en-us/library/azure/dd179357.aspx\">https://msdn.microsoft.com/en-us/library/azure/dd179357.aspx</a></p>\n<blockquote>\n<p>UnsupportedQueryParameter: One of the query parameters specified in the request URI is not supported.</p>\n</blockquote>",
        "id": 153827070,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462998252
    },
    {
        "content": "<p><a href=\"https://developer.github.com/v3/#client-errors\" target=\"_blank\" title=\"https://developer.github.com/v3/#client-errors\">Github's API</a> ignores unknown params so -1</p>",
        "id": 153827071,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1462998335
    },
    {
        "content": "<p>just because they have an error code doesn't mean they actually raise it on a search, for instance</p>",
        "id": 153827073,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462998358
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span>:  I think the 404 response is a little different, in that 404 is usually returned as the result of the client asking for something specific (by ID) that it believes exists.  So if it gets a 404, then it probably suspects something is off since it really expected something.  That's a little different than a server returning 10 results versus 8.  As far as I recall, FHIR search never returns a 404, but I could be wrong...</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> : Yeah.  I was actually about to admit that when I quickly googled I found several well-regarded APIs that indicated they ignored unknown parameters.  But... when they own the API, then unknown parameters tend to only be unspecified parameters.  It would be weird for Google to create a REST API and then not support the parameters it specified itself.</p>\n<p>BTW-- I've made the arguments I wanted to make.  I will leave you in peace. ;-)  </p>",
        "id": 153827079,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462998628
    },
    {
        "content": "<p>From Google calendar (I can try the add ones in a sec): GET /calendar/v3/users/me/calendarList?maxResults=10&amp;holyfoocow=100 HTTP/1.1</p>\n<p>Response: HTTP/1.1 200 OK<br>\nContent-length: 6628 ...</p>",
        "id": 153827087,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1462999175
    },
    {
        "content": "<p>\"holyfoocow\"? How do you know this is not supported? </p>",
        "id": 153827088,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462999200
    },
    {
        "content": "<p>true... ;)</p>",
        "id": 153827089,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1462999227
    },
    {
        "content": "<p>that was nasty, actually, I can't really laugh out loud in a committee meeting</p>",
        "id": 153827090,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462999251
    },
    {
        "content": "<p>LMAO</p>",
        "id": 153827091,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1462999266
    },
    {
        "content": "<p>I can't try out double-click specifically because I don't have an account :) If someone does, I can tell you how to try it. You can choose evilfoocow as your extra param if you so want</p>",
        "id": 153827094,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1462999420
    },
    {
        "content": "<p>Ha.  <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span>, I don't think that will be necessary!  I have the feeling that the results of that experiment won't really affect the outcome of this discussion either way.  On the other hand, if that's how we have fun around here (issuing evilfoocow queries), then don't let me get in anyone's way! ;-)</p>",
        "id": 153827097,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462999615
    },
    {
        "content": "<p>it will be a holyfoocow and evilfoocow duel</p>",
        "id": 153827098,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1462999775
    },
    {
        "content": "<p>I think I might have to add something to my server. </p>",
        "id": 153827099,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462999796
    },
    {
        "content": "<p>Don't leave out the agnosticfoocow.</p>",
        "id": 153827100,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1462999836
    },
    {
        "content": "<p>if url.hasParameter('evilfoocow') <br>\n  throw new Exception(\"Jenni, please do not hack with the server, it's very fragile today\");</p>",
        "id": 153827101,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462999838
    },
    {
        "content": "<p>If we can't decide between returning an error or ignoring parameters, there is an option to leave it to the client.</p>\n<p>I see three types of clients (for this discussion):<br>\n1. Client written for a local setting, that will always query the same server. Returning an error is appropriate, since the client should be aware of the server's capabilities.<br>\n2. Client written to target potentially any server (like an app), subdivided in:<br>\n2a: Potentially leading to severe injury when search results are not checked properly. Returning an error is helpful here.<br>\n2b: Not leading to severe injury, but the maker just wants her/his app to run against any server without bothering the user with errors. A server could help the maker by allowing a 'loose' mode.</p>\n<p>To cater for the cases 1 and 2a, a 'strict' mode should be the default. So a server should at a minimum return an error on unsupported parameters.<br>\nThe loose mode is optional for servers to support, and the client has to ask for it specifically. </p>\n<p>But it would be yet another addition to the already rich search api.</p>",
        "id": 153827102,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1462999932
    },
    {
        "content": "<p>PS: I don't mind to rename the modes to holyfoocow and evilfoocow, but I'm still figuring out which should mean 'strict'.</p>",
        "id": 153827103,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1463000067
    },
    {
        "content": "<p>Yeah I just spent too long trying to sign up for adwords to see what they actually *do*. But I've given up :p</p>",
        "id": 153827106,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1463000391
    },
    {
        "content": "<p>Me too. :-) It's an extremely complicated process involving manager production accounts, test accounts, manager API keys, test API keys. Ugh</p>",
        "id": 153827108,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1463000431
    },
    {
        "content": "<p>So U have learned. I got all the way to a developer token and a local download of the python API. I'm still not sure it's not a SOAP API  (one of their docs mentions the 'suds' python package).</p>",
        "id": 153827109,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1463000466
    },
    {
        "content": "<p>Ha, I went the route of cloning their Ruby &amp; Rails API and was setting up the example server</p>",
        "id": 153827111,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1463000511
    },
    {
        "content": "<p>FINE FINE FINE you all win.</p>\n<p>Holyfoocow has been implemented: <a href=\"http://fhirtest.uhn.ca/baseDstu3/Patient?holyfoocow=true\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu3/Patient?holyfoocow=true\">http://fhirtest.uhn.ca/baseDstu3/Patient?holyfoocow=true</a></p>\n<p>I'll be proposing this as a stream at the baltimore connectathon, testing partners welcome.</p>",
        "id": 153827123,
        "sender_full_name": "James Agnew",
        "timestamp": 1463003907
    },
    {
        "content": "<p>James and Jenni win the FHIR prize</p>",
        "id": 153827128,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463009494
    },
    {
        "content": "<p>Could we have a behavior where, by default, servers error if they receive an unexpected search parameter, but you can send an extra search parameter (e.g. softFail=true or something) that causes the server to ignore extra search parameters?  That way clients explicitly tell the server to ignore extra parameters and therefore explicitly take responsibility for checking what was actually processed?</p>",
        "id": 153827139,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463017048
    },
    {
        "content": "<p>I think that approach keeps the client in charge of behavior, which is desirable, and also helps ensure safety.</p>",
        "id": 153827140,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463017073
    },
    {
        "content": "<p>What's the default behaviour for servers that don't support softFail?</p>",
        "id": 153827153,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1463022427
    },
    {
        "content": "<p>They'd have to raise an error when receiving unexpected search parameters</p>",
        "id": 153827165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463023629
    },
    {
        "content": "<p>And you don't see any inherent contradiction in this behaviour?</p>",
        "id": 153827166,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1463023750
    },
    {
        "content": "<p>The default is the safe behavior</p>",
        "id": 153827167,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463023851
    },
    {
        "content": "<p>So there's no problem then with a query that would have otherwise been successful, but now fails because of the addition of \"shotFail-true\"?</p>",
        "id": 153827171,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1463024801
    },
    {
        "content": "<p>I prefer less optionality rather than more.  If a client wants to be sure that what was returned is what it asked for (effectively, hardFail=true), the client can compare its search URL to the one returned by the server.  </p>",
        "id": 153827292,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1463062314
    },
    {
        "content": "<p>I'm concerned about having two different options for servers, sort of for the same thing that concerns people about soft failing.  </p>",
        "id": 153827294,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1463062340
    },
    {
        "content": "<p>If some servers - particularly reference servers - return errors, a client may assume that will always happen.</p>",
        "id": 153827295,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1463062357
    },
    {
        "content": "<p>Yeah, this whole thread of discussion seems over the top to me.</p>",
        "id": 153827296,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1463062357
    },
    {
        "content": "<p>If all servers ignore unknown or unsupported parameters, clients are less likely to make this error.</p>",
        "id": 153827299,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1463062410
    },
    {
        "content": "<p>Most test servers support most parameters.  As well, the failure to pay attention to inbound parameters isn't necessarily immediately noticable when you're testing.  So I don't think we can count on all client implementers picking up on this \"feature\" before they hit production.  As well, clients created to talk to a specific server may work just fine until the server's support changes (or even changes what name they use for a given parameter - which can happen too).  So I think \"failing safe\" is important here.</p>",
        "id": 153827315,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463063490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> Bonus points for using the I'm a Teapot http error status</p>",
        "id": 153827319,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1463065226
    },
    {
        "content": "<p>So I think we need to be clearer about this at the top of the search page, but otherwise the discussion bears out my original statement: we won't get to consensus on this </p>",
        "id": 153827337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463066966
    },
    {
        "content": "<p>Well, non-consensus on this is even less safe - because clients will expect one behavior and may get another and have no control over what happens.  Why would we *not* want to leave the choice of behavior in the client's hands?  The only reasons for driving server behavior I've heard so far is \"what's typical\" and \"safety\" - I don't see why those two concerns couldn't be addressed by giving the client the control of what happens.  Are there any technical reasons why a server *couldn't* error on or *couldn't* ignore unsupported extensions if the client told them their desired behavior?</p>",
        "id": 153827403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463073965
    },
    {
        "content": "<p>Personally I side with Lloyd. The inherent contradiction of a server providing an error on an invalid parameter (softFail) when it does not support erring on invalid parameters is not lost on me. Pragmatically, in that case, the requirement is that all servers would have to support an indication as to whether softFail is supported. <br>\nWe are talking about health information here. Much more critical than many APIs dealing with Ads and the like. We certainly can debate the details, but it seems some sort of feedback regarding the validity of requests is warranted.</p>",
        "id": 153827410,
        "sender_full_name": "Corey Spears",
        "timestamp": 1463075903
    },
    {
        "content": "<p>Keep in mind that if a server does this, there are still going to be \"holes.\" For example, if we state that a server errors when it sees \"known unknown\" parameters (parameters it chooses not to implement), what happens when an app is expecting the server to be running a different version of the spec?</p>",
        "id": 153827431,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1463076323
    },
    {
        "content": "<p>What about custom parameters that the server doesn't know about (AFAIK, there is no \"parameter extension\" syntax)? EG: when an IG defines a new param?</p>",
        "id": 153827435,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1463076464
    },
    {
        "content": "<p>I know we say \"this is healthcare\" but if our stance is to ignore the underlying norms of the transport/architecture we're on top of because we're special, we may get unintended results. Google apis deal with many different aspects of data that have financial and personal privacy impact, so it's not like data there isn't also sensitive</p>",
        "id": 153827438,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1463076563
    },
    {
        "content": "<p>This doesn't prevent following underlying norms, it just forces an explicit acknowledgment in the instance that the client knows that's what's going on and has taken responsibility for the ramifications.  To resolve the contradiction, one possibility is to say that all servers have to support the \"softFail\" parameter - then you don't have to worry about it not being supported.  If a client is wanting to pass extra stuff that the server is going to ignore, they have a choice - trim those before going to the server or make sure their client detects what clients are paid attention to.</p>",
        "id": 153827458,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463078811
    },
    {
        "content": "<p>Despite my belief that ignoring unknown parameters is the wrong default, this probably isn't a spot where we could make a hard and fast rule.</p>\n<p>There are going to be times when the client doesn't even know it is adding parameters. Lots of reverse proxies add things along the way, caching or session-pinning mechanisms may too..</p>",
        "id": 153827467,
        "sender_full_name": "James Agnew",
        "timestamp": 1463079185
    },
    {
        "content": "<p>there's a difference between unknown parameters and unsupported search parameters </p>",
        "id": 153827469,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463079228
    },
    {
        "content": "<p>There is, but there will be \"unknown FHIR parameters\" IE: A paramenter added in an IG that the server isn't aware of, a client running a different version of the FHRI spec that the server, etc...</p>",
        "id": 153827472,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1463079429
    },
    {
        "content": "<p>Right.  There's no way of knowing what a server knows about and doesn't support.</p>",
        "id": 153827474,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463079588
    },
    {
        "content": "<p>+1 for Lloyd's softFail idea, making \"failing safe\" (or failing fast) the default.  The alternative seems dangerously similar to exception eating.</p>",
        "id": 153828025,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1463425761
    },
    {
        "content": "<p>there is a way of knowing what a server supports. Maybe we should say that a server cannot ignore a parameter it claims to support in it's conformance statement. </p>",
        "id": 153828026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463425873
    },
    {
        "content": "<p>Or maybe we should look into how we could return an OperationOutcome in a bundle. I know Lloyd has been asking for it, and it keeps popping up. A server could at least then return a warning status with a specific code about the search parameter. </p>",
        "id": 153828579,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1463651831
    },
    {
        "content": "<p>well, we could add a new search mode 'commentary'</p>",
        "id": 153828791,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463694582
    },
    {
        "content": "<p>IMHO it is potentially dangerous to ignore unknown parameters.<br>\nso I would still leave it up to the server to decide how to handle this situation.</p>\n<p>But on the other hand, giving the client the opportunity to suggest a behaviour would be a good idea.</p>\n<p>But if we do so, I think there is a better place than an additional parameter.<br>\nI would prefer to designate this using a <br>\nPrefer: handling=strict  resp. handling=lenient in the header as described in<br>\n<a href=\"https://tools.ietf.org/html/rfc7240#section-4.4\" target=\"_blank\" title=\"https://tools.ietf.org/html/rfc7240#section-4.4\">https://tools.ietf.org/html/rfc7240#section-4.4</a></p>",
        "id": 153828842,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1463740447
    },
    {
        "content": "<p>interesting idea</p>",
        "id": 153828846,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463743667
    }
]