[
    {
        "content": "<p>We have developed an application that stores it's data in the HAPI FHIR server. Right now, for development and testing purposes, we are storing images right in the 'data' field of an Attachment resource that is referenced by a Media resource. I read that the data field could also hold a link to the raw data of the attachment (the image in this case). How would the upload process be realized for the images? Is there already an API that stores the files in the filesystem and creates a link that can be stored in the resource?</p>",
        "id": 215448004,
        "sender_full_name": "Michael Albert",
        "timestamp": 1604407507
    },
    {
        "content": "<p>Large object datatype supported by your db.</p>",
        "id": 215451886,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1604409835
    },
    {
        "content": "<p>Store the image data (base64) and the containing resource instance in such a field?</p>",
        "id": 215452367,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1604410080
    },
    {
        "content": "<p>Put your object in a FHIR Binary resource, and point at that Binary using .attachment.url</p>",
        "id": 215456198,
        "sender_full_name": "John Moehrke",
        "timestamp": 1604412004
    },
    {
        "content": "<p>note, you should move away from Media and toward use of DocumentReference as Media is being retired in preference for DocumentReference.</p>",
        "id": 215456277,
        "sender_full_name": "John Moehrke",
        "timestamp": 1604412036
    },
    {
        "content": "<p>So .. if I store the image data inline (as base64) or as FHIR Binary would the backend store that efficient in the file system or would I slow down my database because it has to handle large amounts of data? We have a usecase where lots of images will be stored and in near future videos should also be stored. Is a FHIR Binary the way to do that?</p>",
        "id": 215481612,
        "sender_full_name": "Michael Albert",
        "timestamp": 1604422819
    },
    {
        "content": "<p>FHIR Binary stores and usually transmits the data as 'raw' - i.e. not base64 encoded.  (And can be transmitted compressed if your HTTP request asks for it that way.)</p>",
        "id": 215501067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604432471
    }
]