[
    {
        "content": "<p>I've reviewed the FHIR spec and Lloyd McKenzies google paper from 2017 discussing URI's.  The question I have is whether it is \"legal\" (a term Lloyd used in a response relating to this) to use an organization's root web address as the basis for a URI and then assign to it further explanation like \"<a href=\"http://thiscompany.com/fhir/memberidentifier/someothersubsystem\">http://thiscompany.com/fhir/memberidentifier/someothersubsystem</a>\".   Is it really that simple?</p>",
        "id": 220556858,
        "sender_full_name": "Ruth berge",
        "timestamp": 1608532292
    },
    {
        "content": "<p>Also a kind-of agonizing question for me</p>",
        "id": 220567327,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608543713
    },
    {
        "content": "<p>Let's say you need an identification scheme for 'CocaCola lot numbers for cans produced in its plant in Berlin, Germany' - how would you get hold of the URI? You could try asking the Coca Cola company, but in all likely hood they haven't assigned a URI to this, they won't likely know what you're talking about anyway. <br>\nNow I could assign a URI like <a href=\"http://www.MyConsultancyCompany.com/idschemes/cocacola/cans/berlin/lot\">www.MyConsultancyCompany.com/idschemes/cocacola/cans/berlin/lot</a>, but essentially my organization has nothing to do with the id scheme at all. <a href=\"http://Cocacola.com/cans/berlin/lot\">Cocacola.com/cans/berlin/lot</a> makes a lot more sense. <br>\nIs it 'legal' to re-use the company name in this way? Interesting question, albeit for lawyers, not for the average reader of this forum. You can always revert back to using OID based URNs, the OID parts do not have any semantics.</p>",
        "id": 220573331,
        "sender_full_name": "René Spronk",
        "timestamp": 1608549147
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> That's helpful.  Thanks a lot.</p>",
        "id": 220576145,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608551582
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> , but to add context, if you were in a position to tell Coca Cola that they need a uri, would you ask them if you can use their root url in the way described?  Would you tell them to apply to the IANA for a uri?  What other options? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  (for use and Canada)</p>",
        "id": 220599751,
        "sender_full_name": "Ruth berge",
        "timestamp": 1608566999
    },
    {
        "content": "<p>No need to apply to IANA for a URI.  Your choice is either get a URL from the specified company, define one yourself, or use a URN (e.g. OID or UUID).  In general, human readable and at least potentially resolvable URLs are better for implementers</p>",
        "id": 220601162,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608567565
    },
    {
        "content": "<p>I am concerned still about how to make sure a system name remains the same over time, so that 5 years from now the url hasn't switch to \"newcoke\" for example.  Or that the domain is sold to another company.  Assuming that this is indeed covered by the assignment of the url itself  , then a potential future for this is to either create a web page that resolves the link in some way and/or create the trial use Naming System resource to resolve the link to an old and any other mapping.  That seems to be what FHIR (as a group) is suggesting.</p>",
        "id": 220617227,
        "sender_full_name": "Ruth berge",
        "timestamp": 1608577068
    },
    {
        "content": "<p>There are a set of globally registered naming systems that, once established for a given identifier or code system, are expected to not change (though it's possible that they won't resolve in the future).  Ideally, countries would maintain the same for national/regional shared identifiers and code systems.  It's up to organizations to ensure consistency of naming systems within the organization.  For stuff that's not registered with a central trusted authority, there's both no guarantee that the owner won't change it, nor a guarantee that other organizations will use the same URL.</p>",
        "id": 220633431,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608586623
    }
]