[
    {
        "content": "<p>I have a question about URL encoding special characters in a FHIR request. For example, let's say I'm performing a search on a Condition resource and I want to include Conditions with clinical-status of \"active\" or \"resolved\", are these two URLs equivalent? \"GET [base]/Condition?clinical-status=active,resolved\" and \"GET [base]/Condition?clinical-status=active%2Cresolved\"? That is, should the %2C be treated the exact same as an un-encoded comma?</p>\n<p>Looking at the \"escaping\" portion of the search spec, it isn't entirely clear to me (<a href=\"https://www.hl7.org/fhir/search.html#escaping\" target=\"_blank\" title=\"https://www.hl7.org/fhir/search.html#escaping\">https://www.hl7.org/fhir/search.html#escaping</a>). The examples there imply the two are equivalent but I am not sure if the examples are normative.</p>",
        "id": 153972449,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1530216521
    },
    {
        "content": "<p>we don't say much about this because HTTP rules apply, and under those rules, the URLs are equivalent</p>",
        "id": 153972464,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530223862
    },
    {
        "content": "<p>OK, sounds good. Thanks for clarifying.</p>",
        "id": 153972572,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1530282267
    },
    {
        "content": "<p>Actually, hang on a second... We looked into this further and we're not sure that HTTP rules say the URLs are equivalent. Specifically, RFC 3986 section 2.2 (<a href=\"https://tools.ietf.org/html/rfc3986#section-2.2\" target=\"_blank\" title=\"https://tools.ietf.org/html/rfc3986#section-2.2\">https://tools.ietf.org/html/rfc3986#section-2.2</a>) defines the set of reserved characters to include \",\" and then states:</p>\n<p>The purpose of reserved characters is to provide a set of delimiting characters that are distinguishable from other data within a URI. URIs that differ in the replacement of a reserved character with its corresponding percent-encoded octet are not equivalent.  Percent-encoding a reserved character, or decoding a percent-encoded octet that corresponds to a reserved character, will change how the URI is interpreted by most applications.  Thus, characters in the reserved set are protected from normalization and are therefore safe to be used by scheme-specific and producer-specific algorithms for delimiting data subcomponents within a URI.</p>\n<p>That sounds like a URL with , is not equivalent to a URL with a percent-encoded version of %2C.</p>",
        "id": 153972590,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1530285897
    },
    {
        "content": "<p>I was too tired... we define that those URLs are equivalent in that section (see last example)</p>",
        "id": 153972641,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530299186
    },
    {
        "content": "<p>Is that permissible for us (HL7/FHIR) to override the URI RFC?</p>",
        "id": 153972648,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1530302915
    },
    {
        "content": "<p>I don't believe that we override anything; just made some scheme specific use notes</p>",
        "id": 153972649,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530304348
    },
    {
        "content": "<p>It just seems that the URI RFC (3986) is somewhat clear in saying that reserved characters that are percent-encoded are not equivalent to the reserved character itself. Then we're saying \"Yes they are equivalent.\" How is that not overriding the rule in the RFC?</p>",
        "id": 153972869,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1530539880
    },
    {
        "content": "<p>um, we're not. We're concerned with the interpretation of escaped characters - they're escaped either way, but we have a second level of escaping</p>",
        "id": 153972908,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530545396
    },
    {
        "content": "<p>Hi Grahame, sorry I'm not quite able to parse what you're saying in that last response. Do we agree that the URI RFC (3986) rule I quoted above means that these URLs are not equivalent (solely according to that RFC, not our FHIR specification)?: \"GET [base]/Condition?clinical-status=active,resolved\" and \"GET [base]/Condition?clinical-status=active%2Cresolved\"</p>",
        "id": 153974331,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1531149290
    },
    {
        "content": "<p>Also, can we be clear on the terminology we're using here and say \"percent-encoded\" like RFC 3986 uses when we're talking about changing a comma to %2C? \"Escaping\" as defined in the FHIR specification deals with prepending special characters with the '\\' character. I'm not really talking about \"escaping\" here -- there just happens to be a mention of percent-encoding in that portion of the FHIR spec and I feel like that's causing some confusion here.</p>",
        "id": 153974332,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1531149799
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17464\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17464\">GF#17464</a> - <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> prompt for you</p>",
        "id": 153975578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531774279
    },
    {
        "content": "<p>it would help me understand what the problem is here better if rfc 3986 defined what 'equivalence' means in that context. I presume that we should not think that they mean that if 2 URIs are not equivalent, they cannot return the same outcome</p>",
        "id": 153975580,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531774487
    },
    {
        "content": "<p>I think we are confusing two types of escaping.   One is the encoding described in RFC3986 to turn FHIR search parameters and values into URLs, the other is <em>within</em> the FHIR spec to differentiate between two possible ambiguous values.  Section <a href=\"https://www.hl7.org/fhir/search.html#escaping\" target=\"_blank\" title=\"https://www.hl7.org/fhir/search.html#escaping\">https://www.hl7.org/fhir/search.html#escaping</a> is about the latter:</p>\n<ul>\n<li><code>GET [base]/Condition?clinical-status=active,resolved</code>  means get me conditions with the <code>clinical-status</code> \"active\" OR the clinical status \"resolved\"</li>\n<li><code>GET [base]/Condition?clinical-status=active\\,resolved</code> means get me conditions with the <code>clinical-status</code> \"active,resolved\" (so, the status includes a comma as a character - uncommon but possible).</li>\n</ul>\n<p>For sure, you might still need RFC3986 to get the characters in the resulting FHIR search strings shown above across on a URL, but that's something on the http/interchange level. </p>\n<p>To put it differently: even if we would switch from http (and url encoding) to another transport mechanism, we would still need the distinction between search string \"clinical-status=active,resolved\" and \"clinical-status=active\\,resolved\".</p>",
        "id": 153975686,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1531817469
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I agree. :) <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> thanks for the clarification. It would be nice if the FHIR specification explained this more solidly. The way the <a href=\"https://www.hl7.org/fhir/search.html#escaping\" target=\"_blank\" title=\"https://www.hl7.org/fhir/search.html#escaping\">https://www.hl7.org/fhir/search.html#escaping</a> section is right now, this logic is implied instead of spelled out in a clear manner (at least for me so maybe that's my fault).</p>",
        "id": 153976490,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1532033140
    },
    {
        "content": "<p>ok I updated the task with a pointer to this thread and a note to add more explanation</p>",
        "id": 153976602,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532039861
    },
    {
        "content": "<p>ok updated the section in question at <a href=\"http://build.fhir.org/search.html#escaping\" target=\"_blank\" title=\"http://build.fhir.org/search.html#escaping\">build.fhir.org/search.html#escaping</a></p>",
        "id": 153983442,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533682447
    }
]