[
    {
        "content": "<p>In QuestionnaireResponse resources we try to use an urn as the canonical \"questionnaire\" reference, like this:</p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;resourceType&quot;: &quot;QuestionnaireResponse&quot;,\n  &quot;questionnaire&quot;: &quot;urn:uuid:f14997cf-e16e-4e4b-8b3a-1f419386f597|1.0.0&quot;,\n   ...\n}\n</pre></div>\n\n\n<p>Is this legal FHIR? (The documentation in relation to canonical reference is not the clearest English I have read :-))</p>",
        "id": 168124915,
        "sender_full_name": "Michael Christensen",
        "timestamp": 1560509197
    },
    {
        "content": "<p>That would be a legal reference, but only if the QuestionnaireResponse was inside a Bundle where the guid resolved to a questionnaire (and there was a version match too).  I don't think it's a legal reference for stand-alone.  (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> can you confirm?)</p>",
        "id": 168140508,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560523180
    },
    {
        "content": "<p>yes only in a bundle</p>",
        "id": 168173180,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560547826
    },
    {
        "content": "<p>Just trying to get my head around why this wouldn't be legal: The documentation of \"canonical\" data type says \"A URI that refers to a resource by its canonical URL (resources with a url property).\". Questionnaire.url has data type \"uri\" and this is described as \"A Uniform Resource Identifier Reference (RFC 3986 )\".  So since a URN is a URI I concluded that it was legal to use a URN as the canonical reference in a QuestionnaireResponse. Where is the restriction that this is only legal in a Bundle stated? And why have this restriction?</p>\n<p>My specific challenge relates to building an infrastructure where resources should only ever use logical reference, no literal references. This works fine until I get to canonical references, if there is a hard requirement that canonical references should always contain a URL.</p>",
        "id": 168446436,
        "sender_full_name": "Michael Christensen",
        "timestamp": 1560885496
    },
    {
        "content": "<p>you are right - it is legal for it to be a urn</p>",
        "id": 168451034,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560888688
    },
    {
        "content": "<p>Sorry.  I was thinking of it as a Reference, not a canonical.  It's good practice for canonicals to be URLs, but they're not required to be.</p>",
        "id": 168469740,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560906844
    }
]