[
    {
        "content": "<p>US-core DocumentReference is used for general purpose clinical documents. The content element with attachment is set to mandatory. How would I support text only reports with the profile as a document contributor? Should I generate an xhtml format of the textual content and put that in the content field?</p>",
        "id": 248622461,
        "sender_full_name": "frank cao",
        "timestamp": 1628262428
    },
    {
        "content": "<p>Plain text should be fine, no need to generate XHTML</p>",
        "id": 248635104,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628267866
    },
    {
        "content": "<p>Thanks. So if I want to send each text line similar to OBX segments, I need to 1) produce a text file and put it in the content field, and 2) put each text line in an observation resource and put it in context.related. Is this a good implementation?</p>",
        "id": 248653528,
        "sender_full_name": "frank cao",
        "timestamp": 1628276093
    },
    {
        "content": "<p>Not sure what would be the purpose of the Observations (?) - and context.related is not a US Core must support, so most (all?) systems will ignore it</p>",
        "id": 248653797,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628276238
    },
    {
        "content": "<p>If 'text only report' = something like a radiology report then no, no separate Observations needed</p>",
        "id": 248654064,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628276375
    },
    {
        "content": "<p>It could be something like a discharge summary or consultation note, but we don't expect systems to be able to support the IPS style. We have a existing v2 implementation that uses OBXes for the report text. That's why I want to replicate that with observations. Is that an overkill? If I want to support a text only diagnostic report such as cardiology, should I ignore result[x] and just use presentedForm?</p>",
        "id": 248656151,
        "sender_full_name": "frank cao",
        "timestamp": 1628277439
    },
    {
        "content": "<p>I'd say overkill. And yes, text-only report like cardiology would be a DiagnosticReport with a presentedForm and not result. result is for things like lab panels</p>",
        "id": 248667630,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628283485
    },
    {
        "content": "<p>Thank you. Is there any downside to just use document bundle for all the document types I want to support?</p>",
        "id": 249239392,
        "sender_full_name": "frank cao",
        "timestamp": 1628777454
    },
    {
        "content": "<p>Yes, clients would not handle that</p>",
        "id": 249240464,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628777960
    },
    {
        "content": "<p>You generally won't see SMART apps or CDS hooks services that have any ability to dig inside a document wrapper.  It's pretty much impossible to search on the content of a document unless you're just looking at header information.</p>",
        "id": 249240635,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628778024
    },
    {
        "content": "<p>Similar issues for other types of clients.</p>",
        "id": 249240671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628778038
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192869\">frank cao</span> <a href=\"#narrow/stream/179166-implementers/topic/US-core.20DocumentReference.20modeling/near/249239392\">said</a>:</p>\n<blockquote>\n<p>Thank you. Is there any downside to just use document bundle for all the document types I want to support?</p>\n</blockquote>\n<p>The fact that you have a FHIR-Document made up of Composition and a bunch of other stuff, does not mean that the only access to the Composition and the other stuff is through a Bundle. The document Bundle would only be useful for specific scenarios. Such as pushing to a remote recipient, publishing into a nationwide exchange, or covering the whole content with a digital signature. I expect that others will attack me for promotion of these benefits of a document bundle. I am not saying that RESTful access to these as resource is not a good idea. I am just answering your question of when is a document bundle beneficial.</p>",
        "id": 249242554,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628778824
    },
    {
        "content": "<p>downsides, I fully agree with Michele and Lloyd. I fully agree with them that making the data available in RESTful resource form is proper. I just also see use-cases where a document bundle is ALSO proper.</p>",
        "id": 249242812,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628778945
    },
    {
        "content": "<p>Thanks. I agree with Lloyd about the inaccessability of discrete data when wrapped in a document bundle. However if we only care about accessing those data as part of the document, it should be fine. For querying documents, I'd like to only use DocumentReference for simplicity and we can include discrete data in it too, if I'm not mistaken.</p>",
        "id": 249254186,
        "sender_full_name": "frank cao",
        "timestamp": 1628784025
    },
    {
        "content": "<p>Keep in mind that even if <em>your</em> system will only want to access the data in the context of a document, that won't necessarily be true of other systems.</p>",
        "id": 249255509,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628784708
    },
    {
        "content": "<p>Agreed. We'll take it for consideration. Much appreciated for your help!!</p>",
        "id": 249278678,
        "sender_full_name": "frank cao",
        "timestamp": 1628795197
    }
]