[
    {
        "content": "<p>We are collecting transplant outcomes data from different organizations and part of this effort includes collecting patient demographic data. We are planning on using us-core for this, including the race extension. One transplant center records a value of \"multiracial\" but that is not in the valueset bound by the extension. We're looking for best practices on collecting this data.</p>\n<p>Since the \"text\" element is required in the extension, we'll ask them to record \"multiracial\" in there, but we are reluctant to using non-structured data element for downstream analysis. Would it be reasonable to add UNK as a structured field? e.g.,</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n    &quot;url&quot;: &quot;http://hl7.org/fhir/us/core/StructureDefinition/us-core-race&quot;,\n    &quot;extension&quot;: [\n        {\n            &quot;url&quot;: &quot;ombCategory&quot;,\n            &quot;valueCoding&quot;: {\n                &quot;system&quot;: &quot;http://terminology.hl7.org/CodeSystem/v3-NullFlavor&quot;,\n                &quot;code&quot;: &quot;UNK&quot;,\n                &quot;display&quot;: &quot;Unknown&quot;\n            }\n        },\n        {\n            &quot;url&quot;: &quot;text&quot;,\n            &quot;valueString&quot;: &quot;Multiracial&quot;\n        }\n    ]\n}\n</code></pre></div>\n\n\n<p>Has anyone else had to deal with this issue (non-specific multiracial)? How did you deal with it?</p>\n<p>And, would it be good practice to create another extension to add \"multiracial\" to a valueset?</p>",
        "id": 211948607,
        "sender_full_name": " Bob Milius",
        "timestamp": 1601574873
    },
    {
        "content": "<p>might ask this question on <a class=\"stream\" data-stream-id=\"179190\" href=\"/#narrow/stream/179190-united-states\">#united states</a> ? but those value sets are regulatory so additions doesn't seem likely to me. So it would be an extension, like what you have, but with a URL</p>",
        "id": 211969645,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601584118
    },
    {
        "content": "<p>The extension isn't really targeted at clinical use</p>",
        "id": 211972004,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601585085
    },
    {
        "content": "<p>The data is/will be used for observational research.</p>\n<p>It would be interesting to know if others have encountered, solved, or worked around this same issue (a non-specific \"multiracial\" category).</p>",
        "id": 211976393,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1601586910
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191926\">@Joel Schneider</span> It is my understanding that currently OMB (which is the start-point for the CDC code system) has specifically decided to <strong>not</strong> include a multiracial category. <a href=\"https://www.whitehouse.gov/wp-content/uploads/2017/11/Revisions-to-the-Standards-for-the-Classification-of-Federal-Data-on-Race-and-Ethnicity-October30-1997.pdf\">See:</a><br>\n(1) OMB accepts the following recommendations concerning reporting more than one race:<br>\nWhen self-identification is used, a method for reporting more than one race should be adopted.<br>\nThe method for respondents to report more than one race should take the form of multiple responses to<br>\na single question and not a \"multiracial\" category.<br>\nWhen a list of races is provided to respondents, the list should not contain a \"multiracial\" category.<br>\nBased on research conducted so far, two recommended forms for the instruction accompanying the multiple response question are \"Mark one or more ...\" and \"Select one or more....\"</p>\n<p>So it seems that your source data is not compliant with regs. Assuming the actual races that the person could have selected are not known, I think your use of UNK and the text may be the best solution. <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"197115\">@Steve Posnack</span></p>",
        "id": 212186054,
        "sender_full_name": "Robert McClure",
        "timestamp": 1601752885
    },
    {
        "content": "<p>As a temporary solution, sure add an extension. Did you ask if they considered using the values required by all EHRs?</p>",
        "id": 212295939,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1601903214
    }
]