[
    {
        "content": "<p>US Meaningful Use documentation around capturing patient race and ethnicity mentions handling responses for \"patient declined to specify\". This is a valid response for patients to make and to be record by physicians.</p>\n<p>However, the US Core extensions for patient race and ethnicity do not include options for \"patient declined to specify\" nor \"practitioner did not ask\".</p>\n<p>How best to represent these valid responses?</p>",
        "id": 153869388,
        "sender_full_name": "Michael Poremba",
        "timestamp": 1485548994
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193285\">@Michael Poremba</span> , for any missing data you can use a standard extension <a href=\"http://build.fhir.org/extension-data-absent-reason.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-data-absent-reason.html\">http://build.fhir.org/extension-data-absent-reason.html</a> with the codes bound to valueset <a href=\"http://build.fhir.org/valueset-data-absent-reason.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-data-absent-reason.html\">http://build.fhir.org/valueset-data-absent-reason.html</a></p>",
        "id": 153869390,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1485552301
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193285\">@Michael Poremba</span> Igor is right that that's an option, but the general recommendation in FHIR is that if \"unknown\" or other similar responses are valid answers for a coded element, those concepts should be part of the value set.  I'd recommend submitting a change request to the US Core IG to get those concepts added to the race and ethnicity value sets.  It makes things a lot cleaner for everyone.</p>",
        "id": 153869409,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485575153
    },
    {
        "content": "<p>This is already documented in IG under <a href=\"http://hl7.org/fhir/us/core/definitions.html#mustsupport\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/definitions.html#mustsupport\">Must Support</a></p>",
        "id": 153869420,
        "sender_full_name": "Eric Haas",
        "timestamp": 1485623526
    },
    {
        "content": "<p>The rules around this for US implementations, are a bit odd. In essence only actual race values were allowed as originally specified which of course was unworkabe given the need to document R&amp;E to qualifiy for MU. So for eCQMs and CCDA they allowed the use of NULL codes ASKU for refused to answer and UNK for unknown.  I don't know why FHIR had to make it's own set of \"data absent\" codes that Igor lists - perhaps the word \"Null\" is so laden with improper use (yep) they abandoned the codes, but they do provide a mapping.</p>",
        "id": 153869430,
        "sender_full_name": "Robert McClure",
        "timestamp": 1485634091
    },
    {
        "content": "<p>no we use the same codes, we just say that they should be explicit in the value set. </p>",
        "id": 153870145,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486352564
    },
    {
        "content": "<p>unlike in CDA where the codes are implicitly merged with every value set in an uncontrolled implementer surprise </p>",
        "id": 153870146,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486352596
    }
]