[
    {
        "content": "<p>Hello All,<br>\nWe are working on implementing US Core VitalSigns profile in our FHIR server. The data is coming from our EHR system.</p>\n<p>In a particular encounter, if only height was taken and no weight, does we need to create an observation result for weight with DataAbsentReason set to Not-Performed? The same goes for other measurements.</p>\n<p>What does this statement mean - \"The table below represents a minimum set of vital sign concepts\"? Is it required to have at least one observation record for all the \"vital-signs concepts\" listed here - <a href=\"http://hl7.org/fhir/R4/observation-vitalsigns.html\">http://hl7.org/fhir/R4/observation-vitalsigns.html</a></p>\n<p>Also I am not sure I understand \"Vital Signs Panel\" - is it required to create a vital signs panel observation record with loinc code - '85353-1'? In a panel, are we supposed to set references to all observation result records in a particular encounter using related links (with type=has-memeber)?</p>\n<p>I appreciate any direction I can get with regards to this.</p>\n<p>Thank you.</p>",
        "id": 200611905,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1591912477
    },
    {
        "content": "<p>You create Observations only for the data you have available - so if you have weight you return an Observation for weight etc. You are not required to create a vital signs panel</p>",
        "id": 200629015,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591928417
    },
    {
        "content": "<p>Thank you. If we create observations only for the data that is available,  what is the purpose of DataAbsentReason extension?</p>",
        "id": 200670273,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1591968875
    },
    {
        "content": "<p>It is used when you have data for a resource but not for all its required elements - for example if you have a weight Observation but don't have (or cannot compute) its status you put DataAbsentReason on the Observation.status element</p>",
        "id": 200671420,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591969458
    },
    {
        "content": "<p>Thanks. According to the spec, it says if you don't have a value, then DataAbsentReason is to be populated.<br>\n\"Either one Observation.value[x] or, if there is no value, one code in Observation.DataAbsentReason\"<br>\n\"Either one Observation.component.valueQuantity or, if there is no value, one code in Observation.component.DataAbsentReason\".</p>",
        "id": 200676289,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1591971827
    },
    {
        "content": "<p>Yes, you can / have to do that if an observation was made but for some reason you do not have the corresponding value - then you can generate an Observation resource and specify that the value is missing (I'd argue that it would be better just not to generate the Observation at all in that case but up to you) . . . but if no observation was made in the first place there is no data (no date, no patient...), so there is no Observation resource at all</p>",
        "id": 200678275,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591972743
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span></p>",
        "id": 200682102,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1591974490
    }
]