[
    {
        "content": "<p>Hi all, I'm looking at the <a href=\"https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-pulse-oximetry.html\">US core pulse oximetry profile</a> for Observation and had a quick question about the flow rate and concentration components - specifically, we are currently representing spO2 and oxygen concentration are two separate observations rather than a single observation with components (due to these concepts being documented independently in our system - we'll have effective timestamps that can be used to link the two, but no discrete linkages). Given that the components are must support rather than must have (and we will support them available via other Observation resources), would this meet the intent of the profile?</p>",
        "id": 249788963,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1629240619
    },
    {
        "content": "<p>The intention of must-support is if you have the data you need to populate it according to the profile. It sounds like you do have the data, so you'd need to populate it according to the profile (not in a different structure of your choice).</p>",
        "id": 249792653,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629243796
    },
    {
        "content": "<p>What is the Observation.code you used for oxygen concentration?</p>",
        "id": 249796806,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629248277
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  got it, thanks! (We we've been treating the oxygen flow rate + concentration as observations fitting the vitals signs profile only /assumed they didn't have to be components on the spO2 Observation when we don't require both to be captured at the same time/linked)</p>\n<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> oxygen concentration is configurable/user selectable, but our suggestion is the 3150-0  code (the same that's required by the pulse oximetry profile components)</p>",
        "id": 249799015,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1629251172
    }
]