[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  and others - do you plan to incorporate support in the US Core Spec (or have thoughts on why you will not) for searching non-Patient resources by patient identifer and not just id? It is coming up more and more that implementers would like to search resources like condition by the patient identifier (how THEY know the patient) vs the patient id.</p>",
        "id": 216380231,
        "sender_full_name": "Christopher Marchand",
        "timestamp": 1605118653
    },
    {
        "content": "<p>I think most of the EHRs work on the premise \"first search for the patient and verify you're looking at the right one, THEN search for other stuff\".  Otherwise, you risk accessing data you shouldn't.  (E.g. if there's a typo when you put in the identifier)</p>",
        "id": 216380506,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605118797
    },
    {
        "content": "<p>Requiring that you search by <a href=\"http://Patient.id\">Patient.id</a> helps ensure you've gone through that process</p>",
        "id": 216380577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605118825
    },
    {
        "content": "<p>Great question, we had always thought about it the way Lloyd mentioned -- first search by patient. I am curious what other implementers think.</p>",
        "id": 216385650,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1605121414
    },
    {
        "content": "<p>We do have search by identifier in our server and it is used a lot, but by internal clients that know the risk (and we can - and do - disable it for external apps)</p>",
        "id": 216387639,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1605122561
    },
    {
        "content": "<p>We actively discourage it in the upcoming version of US Core:</p>\n<blockquote>\n<p>The search expectations and US Core Profiles have been developed and thoroughly tested using only logical FHIR ids. Therefore a reference to a US Core resource SHOULD include a logical id (Reference.reference), not an identifier (Reference.identifier).</p>\n</blockquote>",
        "id": 216389833,
        "sender_full_name": "Eric Haas",
        "timestamp": 1605123758
    }
]