[
    {
        "content": "<p>I'm looking for some help interpreting the US Core guidance for Missing Data. The IG states, if required coded data with a required terminology binding cannot be populated using the terminology, then 'a 404 http error code and an OperationOutcome SHALL be returned in response to a query for the resource.' (<a href=\"https://www.hl7.org/fhir/us/core/general-guidance.html#missing-data\">https://www.hl7.org/fhir/us/core/general-guidance.html#missing-data</a>) </p>\n<p>Does this mean that any search that would have returned the data in question should return a 404, even if other, valid resources meet the search criteria?</p>\n<p>If so, how is that implemented? Is there a requirement that the system maintain a FHIR resource for the information in question that does not conform to US Core, and identify that resource as a hit for the search, in order to know it should return a 404? Or is there another way to know when to return a 404?</p>\n<p>Alternately, is the intent of the guidance that the system should return a 404 in response to a Read request for the resource directly, should one exist, as opposed to a Search? </p>\n<p>(A similar question has come up here before -- <a href=\"#narrow/stream/179166-implementers/topic/Condition.2EclinicalStatus/near/211164347\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Condition.2EclinicalStatus/near/211164347</a> -- but I didn't see an answer.)</p>",
        "id": 231894775,
        "sender_full_name": "Matt Pfeffer",
        "timestamp": 1616716822
    },
    {
        "content": "<p>see updated guidance here: <a href=\"http://build.fhir.org/ig/HL7/US-Core/general-guidance.html#contained-resources\">http://build.fhir.org/ig/HL7/US-Core/general-guidance.html#contained-resources</a></p>\n<p>the expected server error behavior for read and search would be slightly different.</p>",
        "id": 231897763,
        "sender_full_name": "Eric Haas",
        "timestamp": 1616718899
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Thank you. This is very helpful.</p>",
        "id": 231973486,
        "sender_full_name": "Matt Pfeffer",
        "timestamp": 1616768925
    }
]