[
    {
        "content": "<p>Hi there, my name is Kevin Tao, I am a complete newbie to FHIR. I'm trying to represent Patients using v3 US Core Race, and I was wondering why is it that under 'white' there are so few choices? Specifically there's no Icelandic, there's no Dutch, and there's no Ashkenazi Jewish. Is there any way to add those to the coding system? <a href=\"https://www.hl7.org/fhir/v3/Race/index.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/v3/Race/index.html\">https://www.hl7.org/fhir/v3/Race/index.html</a></p>",
        "id": 153842423,
        "sender_full_name": "Kevin Tao",
        "timestamp": 1470334076
    },
    {
        "content": "<p>This a HL7 v3 code system and to add it you would need to make the request to add these code and since they stem from the CDC-REC tables I'm really not sure what the outcome of that request would be.  Depending on how the race valueset is bound to your element you can \"extend\" the valueset and add your own system defined codes or if the valueset is required can provide a code\" translation\"  for the white in another coding element.  </p>",
        "id": 153842458,
        "sender_full_name": "Eric Haas",
        "timestamp": 1470349649
    },
    {
        "content": "<p>AS to the why those concepts are not there.  You will have to delve into the history of US OMB tracking race because I believe that is where they came from.</p>",
        "id": 153842459,
        "sender_full_name": "Eric Haas",
        "timestamp": 1470349834
    },
    {
        "content": "<p>Hey Eric, thanks so much for addressing my question! Is there someone to whom I would be able to make this request?  Or is there any other public coding system we can use that would include Ashkenazi Jewish as a race or ethnicity?</p>\n<p>To give you some context, right now I'm trying to explore implementing a new application from scratch that will accept as input FHIR-formatted json, and respond with a patient's cancer risk, and people of Ashkenazi Jewish descent / race have different cancer risk coefficients. So I really have no idea how to extend any valuesets or add any custom coding elements. Is that difficult to do?</p>",
        "id": 153842666,
        "sender_full_name": "Kevin Tao",
        "timestamp": 1470409177
    },
    {
        "content": "<p>Be cautious about using that extension for clinical purposes.  It's primary reason for existence is demographic reporting purposes and it represents self-asserted statements which may have no genetic/clinical foundation.  You may be better off using a specific Observation if you're wanting to capture particular genetic ancestry information.</p>",
        "id": 153842689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470419410
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192381\">@Kevin Tao</span> and <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>, in the US the CDC is the steward for the Race and Ethnicity code system - not HL7 and not FHIR. You can see that code system here: <a href=\"https://phinvads.cdc.gov/vads/ViewCodeSystem.action?id=2.16.840.1.113883.6.238\" target=\"_blank\" title=\"https://phinvads.cdc.gov/vads/ViewCodeSystem.action?id=2.16.840.1.113883.6.238\">https://phinvads.cdc.gov/vads/ViewCodeSystem.action?id=2.16.840.1.113883.6.238</a>. The \"HL7 Race\" code system really should not exist as it copies the CDC code system and uses the CDC identifiers. I have to admit I didn't know this was going on and will work to find why it's still in place. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is correct that the code system was created for demographic uses (census) and the whole race v ethnicity split is something that is problematic at best. <br>\nSo I looked and am surprised to find that indeed none of the \"races\" are in the current code system. why - who knows but Lloyd is likely correct, there was/is no census-based reason to track this. I suspect we can't easily get the CDC to fix this but we certainly should figure out if we can. One thing we should not do is pretend the HL7 Race code system should be \"improved\". Instead I suggest we might want to use SNOMED CT concepts to represent \"race/ethnicity\" if it has the coverage we want. <span class=\"user-mention\" data-user-id=\"192381\">@Kevin Tao</span> - would you be willing to help me bring this to completion? </p>",
        "id": 153844318,
        "sender_full_name": "Robert McClure",
        "timestamp": 1471536810
    },
    {
        "content": "<p>well,. it exists because it's in the v3 MIF. I can stop publishing it from the MIF if that's appropriate, but I'm not sure where the actual source is published</p>",
        "id": 153844334,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471547757
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> commented elsewhere that this is yet another remnant of prior work that did not get cleaned up in harmonization. SO we need to discuss in Vocab and it should be removed so you won't find it in the next MIF. Instead we'd want to use the external CDC code system. Of course that does not fix Kevin's issue and we need to come up with the right solution for that. </p>",
        "id": 153844342,
        "sender_full_name": "Robert McClure",
        "timestamp": 1471548254
    },
    {
        "content": "<p>ok</p>",
        "id": 153844343,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471548303
    }
]