[
    {
        "content": "<p>The FHIR Specification includes a JSON Schema File for the specification here <a href=\"https://www.hl7.org/fhir/fhir.schema.json.zip\">https://www.hl7.org/fhir/fhir.schema.json.zip</a> - Are there corresponding JSON Schema Files for the US Core and other profiles If they are, I haven't found them.</p>",
        "id": 208356328,
        "sender_full_name": "Art Huston",
        "timestamp": 1598628007
    },
    {
        "content": "<p>we don't generate json schema files for the Implementation guides, since the schema itself doesn't change, only the constraints. It's not clear whether we can usefully generate json schema for the profiles at all, but the whole json schema area is such a problem that I'm not going to take that problem on yet</p>",
        "id": 208400697,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598653026
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I'm not clear why the json schema is a problem. Is it because it doesn't do everything that the official FHIR Validator does, or is there another reason?</p>",
        "id": 208690513,
        "sender_full_name": "Art Huston",
        "timestamp": 1598968725
    },
    {
        "content": "<p>JSON schema is quite new - and the different schema validation tools have different interpretations of the spec and complain about different things that, according to the spec/experts, are legal to do.</p>",
        "id": 208706233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598974933
    },
    {
        "content": "<p>and there's lots of things that json schema can't do either - particularly around slicing</p>",
        "id": 208750392,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598995203
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . JSON Schema validation also will not support expresssions like \"contained.contained.empty()\". There's a good reason why JSON schema validation is not sufficient for FHIR</p>",
        "id": 208870418,
        "sender_full_name": "Art Huston",
        "timestamp": 1599072780
    }
]