[
    {
        "content": "<p>Tagging <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> because he previously provided <a href=\"http://hl7.org/fhir/us/core/general-guidance.html\">http://hl7.org/fhir/us/core/general-guidance.html</a> in another thread, and hoping he might have answers to questions below: </p>\n<p>I'm checking for USCDI compliance, and was unclear how to identify previous name and previous address. <br>\nDo we simply use the tag 'use': \"old\" to identify a previous name or previous address? <br>\nIf so, should that be added to the URL above for clarity?<br>\nAnd would current address and current name utilize 'use': \"current\" ?</p>\n<p>USCDI also requires email address for the patient, but I don't see that mentioned in the general guidance for FHIR. I am guessing we would use patient.telecom, with 'system' = \"email\" ? If so should we add this to the general guidance? It's probably obvious if you're already familiar with the telecom field, but I had to look at the profile to find this.</p>\n<p>Lastly, USCDI's Inhaled oxygen concentration and Pulse oximetry are both mapped to US Core Pulse Oximetry. Anyone know the difference between Inhaled oxygen vs pulse oximetry? I'll also ask ONC but was curious if anyone here knows.</p>",
        "id": 246015462,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1626294465
    },
    {
        "content": "<p>Because inhaled oxygen concentration is a component of a O2 Saturation observation (of which pulse oximetry is a style of measuring). <br>\nie O2 Sat = 92% with 0 inhaled oxygen <br>\nvs O2 Sat = 99% with 5 inhaled oxygen </p>\n<p>inhaled oxygen is not an observation in itself, it is a factor that modifies the base observation, O2 sat via pulse oximetry in this case.</p>",
        "id": 246016714,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626295064
    },
    {
        "content": "<p>The General Guidance section on USCDI links to the Patient Profile for \"Previous Address\", which states \"Previous name is represented by providing an end date in the Patient.name.period element for a previous name.\"  Does that help?</p>",
        "id": 246019180,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1626296189
    },
    {
        "content": "<p>(though I'm a little confused why \"period\" isn't flagged as \"must support\" in this case)</p>",
        "id": 246019270,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1626296236
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> - I think your comment above is in the wrong thread, but not sure which thread you intended it to be in - if you tell me, I can move it.</p>",
        "id": 246028736,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626300755
    },
    {
        "content": "<p>it is a correct response to :</p>\n<blockquote>\n<p>Lastly, USCDI's Inhaled oxygen concentration and Pulse oximetry are both mapped to US Core Pulse Oximetry. Anyone know the difference between Inhaled oxygen vs pulse oximetry? I'll also ask ONC but was curious if anyone here knows.</p>\n</blockquote>",
        "id": 246042491,
        "sender_full_name": "Eric Haas",
        "timestamp": 1626313349
    },
    {
        "content": "<blockquote>\n<p>USCDI also requires email address for the patient, but I don't see that mentioned in the general guidance for FHIR. I am guessing we would use patient.telecom, with 'system' = \"email\" ? If so should we add this to the general guidance? It's probably obvious if you're already familiar with the telecom field, but I had to look at the profile to find this.</p>\n</blockquote>\n<p>If you think this would help others, please log a tracker.</p>",
        "id": 246087518,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1626352735
    },
    {
        "content": "<p>Inhaled oxygen concentration is the percent of oxygen inhaled vs oxygen saturation in your blood! both are captured in the one observation</p>",
        "id": 246087666,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1626352841
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192576\">Robert Scanlon</span> <a href=\"#narrow/stream/179166-implementers/topic/USCDI.20to.20US.20Core.20for.20previous.20name.2Faddress.2C.20email.2C.20SpO2/near/246019180\">said</a>:</p>\n<blockquote>\n<p>The General Guidance section on USCDI links to the Patient Profile for \"Previous Address\", which states \"Previous name is represented by providing an end date in the Patient.name.period element for a previous name.\"  Does that help?</p>\n</blockquote>\n<p>Robert, yes that is very helpful. I missed that note. That said, the name field also has the \"use\" field, with one value being \"old\". Could institutions choose to simply use this rather than period if they wanted to? I'm thinking we will generally not know when the previous name stopped being in use -- might be simply to just tag it with the \"old\" flag.</p>",
        "id": 246167377,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1626390540
    },
    {
        "content": "<p>I'd like to suggest that we flag previous names by using name.'use' = \"old\", rather than using the period field. Reasoning is we are very unlikely to know the legal end date for the previous name. </p>\n<p>I also think we should be consistent and do the same thing for previous address.</p>\n<p>Who should I provide this suggestion to, so that we can have this added to the US Core pages, and also to the USCDI to US Core mapping page? Or is there a process or ticketing system by which I need to submit this?</p>\n<p>I know this may seem like a small thing, but it is relates to USCDI and I think it would be good to provide uniform guidance to implementers on US Core.</p>",
        "id": 246259463,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1626459084
    },
    {
        "content": "<blockquote>\n<p>Who should I provide this suggestion to, so that we can have this added to the US Core pages, and also to the USCDI to US Core mapping page? Or is there a process or ticketing system by which I need to submit this?</p>\n</blockquote>\n<p>At the bottom of each page is a link to <code>Propose a Change</code>, which is the HL7 Jira instance that is used to manage changes to the spec.  If it is your first time using the system, you'll need to create an account, I believe.</p>",
        "id": 246270502,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1626465193
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 246272936,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1626466512
    },
    {
        "content": "<blockquote>\n<p>Reasoning is we are very unlikely to know the legal end date for the previous name.</p>\n</blockquote>\n<p>One potential solution is to use a DataAbsentReason on <code>period.end</code>, but that doesn't feel quite right.  I'm also interested in the right way of handling this. Also, what if the <code>period.end</code> is in the future?  Is it still a previous name, or a current name?</p>",
        "id": 246274813,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1626467537
    },
    {
        "content": "<p>I don't think there is such a thing as a \"legal\" end date for a name.  You can do a legal name change, but that isn't the same thing as previous names necessarily.   I agree that use=old is a much better option than a name.period.  Name usage doesn't really have a firm start and end date.  They might on legal documents, but that is just one use context for names.</p>",
        "id": 246288998,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1626475347
    },
    {
        "content": "<p>DAR for period.end seems like a perfectly reasonable workaround to me, given that period.end seems like the wrong solution to start with.</p>",
        "id": 246289018,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1626475376
    },
    {
        "content": "<p>Note that any changes to USCore would be published in a future version ( likely V5.0.0). Also note that US Core 3.1.1 (based on FHIR R4) is named in ONC Cures Update Certification regulation</p>",
        "id": 246295005,
        "sender_full_name": "Eric Haas",
        "timestamp": 1626482362
    },
    {
        "content": "<p>Thanks all. I submitted a couple small change requests. I know these seem insignificant, but these fields are specified by USCDI, so I think it will be good for the US Core community to be consistent on these fields. </p>\n<p><a href=\"https://jira.hl7.org/browse/FHIR-33080\">https://jira.hl7.org/browse/FHIR-33080</a> -- Requesting previous names and previous address are flagged as patient.name.use = \"old\" and patient.address.use = \"old\", rather than relying the on period and end date elements. Also asked that we include notes in the USCDI mapping page.</p>\n<p><a href=\"https://jira.hl7.org/browse/FHIR-33079\">https://jira.hl7.org/browse/FHIR-33079</a> -- Asked that we include instructions for capturing patient email in the USCDI mapping page.</p>",
        "id": 246882165,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1626976190
    }
]