[
    {
        "content": "<p>Regarding USCDI, can anyone explain the difference between Health Concern and Problem to me? Both in a clinical sense, and also if they should be flagged differently in the Condition resource. </p>\n<p>These are separate data elements in USCDI, yet both map to the Condition resource in the US Core to USCDI Guidance page.<br>\n<a href=\"https://www.hl7.org/fhir/us/core/general-guidance.html\">https://www.hl7.org/fhir/us/core/general-guidance.html</a></p>\n<p>Someone in this chat also noted that Epic has two separate API's for these, but are both based on Condition<br>\n<a href=\"#narrow/stream/179166-implementers/topic/Condition.20-.20differing.20between.20problem.20and.20diagnosis/near/241851726\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Condition.20-.20differing.20between.20problem.20and.20diagnosis/near/241851726</a><br>\n<a href=\"https://fhir.epic.com/Specifications?api=985\">https://fhir.epic.com/Specifications?api=985</a><br>\n<a href=\"https://fhir.epic.com/Specifications?api=953\">https://fhir.epic.com/Specifications?api=953</a></p>",
        "id": 263487828,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1638472879
    },
    {
        "content": "<p>A Health Concern is any issue that may affect care that isn't necessarily a healthcare specific issue.  That may include SDOH concerns.</p>",
        "id": 263488303,
        "sender_full_name": "David Pyke",
        "timestamp": 1638473088
    },
    {
        "content": "<p>Also, something like Pregnancy is a Concern but not necessarily a Problem.</p>",
        "id": 263488849,
        "sender_full_name": "David Pyke",
        "timestamp": 1638473306
    },
    {
        "content": "<p>There's lots of good information on the difference here: <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=443\">http://www.hl7.org/implement/standards/product_brief.cfm?product_id=443</a></p>",
        "id": 263489037,
        "sender_full_name": "David Pyke",
        "timestamp": 1638473351
    },
    {
        "content": "<p>I must have missed that thread from back in June, as I would have chimed in there, but for Epic, our \"health concerns\" are really just items on the problem list that are tagged as a \"health concern\".    So that depends on the clinician manually tagging problem list items, which is pretty rare.  </p>\n<p>Anything tagged as a \"health concern\" will also show up as a problem list item, so most folks can probably just use the problem list API.</p>",
        "id": 263489572,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1638473624
    },
    {
        "content": "<p>Note that the CCDS definition of Health Concerns (which carried forward into USCDIv1) didn't refer to the HL7v2 DAM that David pointed to, so I don't think there is necessarily any expectation that USCDI Health Concerns match the HL7v3 DAM definition.  The CCDS/USCDI definition is super generic.</p>",
        "id": 263489831,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1638473762
    },
    {
        "content": "<p>It sounds like a Health Concern is broader, and can include general and even items that are not clinically coded. I have heard that examples can include SDOH items, such as \"Transportation difficulties\" or \"Underinsured\". Is that accurate?</p>\n<p>However, the guidance page (<a href=\"https://www.hl7.org/fhir/us/core/general-guidance.html\">https://www.hl7.org/fhir/us/core/general-guidance.html</a>) is mapping Health Concerns to US Core Condition Profile -- this profile requires a Category Code (1... *) and a Condition Code (1...1). </p>\n<p>Am I correct that Health Concerns may not necessarily have a Category Code and/or a Condition Code? <br>\nIf so, should we consider mapping Health Concerns to the general Condition Resource? I'd be happy to submit a JIRA for this change.<br>\nIf I am incorrect, can someone point me to the codes that we should be using for Health Concerns?</p>\n<p>I realize I may be a bit pedantic here, but I'm encountering this in the course of certification with my company's EHR, and I think others are going to encounter the same questions.</p>",
        "id": 263516167,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1638488384
    },
    {
        "content": "<p>Health concerns have a category <code>health-concern</code> and must have a code that specifies what the concern is, otherwise they won't really make much sense</p>",
        "id": 263518658,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1638490337
    },
    {
        "content": "<p>Codes can be icd-10, icd-9 and a good chunk of SNOMED, so will likely exist for most anything (eg <a href=\"https://phinvads.cdc.gov/vads/http:/phinvads.cdc.gov/vads/ViewCodeSystemConcept.action?oid=2.16.840.1.113883.6.96&amp;code=266934004\">https://phinvads.cdc.gov/vads/http:/phinvads.cdc.gov/vads/ViewCodeSystemConcept.action?oid=2.16.840.1.113883.6.96&amp;code=266934004</a>)</p>",
        "id": 263518767,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1638490431
    },
    {
        "content": "<p>..and the binding is extensible, so for things that are not really there you can just make up a code</p>",
        "id": 263518836,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1638490461
    },
    {
        "content": "<p>\"make up a code\" - If you have an item that doesn't match anything in snomed, I'm sure snomed would like to know about it. And until then if you do make up a code, publish a website that corresponds to your system that defines the code, that way, it might actually be more than a placeholder.</p>",
        "id": 263577923,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1638537596
    }
]