[
    {
        "content": "<p>I've been doing analysis  on the USCDI version 1 criteria. A large number of clinical data does not meet the applicable standard defined by USCDI one for example is many<br>\nProviders are not using LOINC or SNOMED yet. The provider EHR transformation to USCDI is not until 24 months after the 21st Century Cures Act final rule. While some of the transformations are easier to engineer or described in IG, some are more complex. </p>\n<p>Such as US Core Laboratory CPT to LOINC. Conditions profile requires SNOMED. How are others handling these situation. Also, is a Provence Resource required for each clinical input?</p>",
        "id": 228023493,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614390359
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span></p>",
        "id": 228030590,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614398356
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"379418\">@Donna Lehr</span> have you looked at <a href=\"http://hl7.org/fhir/us/core/\">US Core</a>?</p>",
        "id": 228138915,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614528107
    },
    {
        "content": "<p>Yes, but it seems there are a lot of open issues with the IG even related to this topic. Example <a href=\"https://jira.hl7.org/browse/FHIR-28375\">https://jira.hl7.org/browse/FHIR-28375</a></p>\n<p>Here is one example- a lot of the payer lab data does not have LOINC:<br>\n<a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-observation-lab.html\">http://hl7.org/fhir/us/core/StructureDefinition-us-core-observation-lab.html</a></p>\n<p>The lab code requires LOINC as a Must Support element, but alot of payers and providers are still only using CPT there is a text description of the lab within the ordered test, but the exact text varies by payer. </p>\n<p>You can go from LOINC to CPT easily but its unidirectional, there are multiple LOINC for one CPT so transforming from CPT to LOINC is more complicated and I do not see it clearly defined anywhere in the IG. Wondering how others are handling this?<br>\n<a href=\"user_uploads/10155/VDUcZzi94-G5mL3K5O7WeLWF/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/10155/VDUcZzi94-G5mL3K5O7WeLWF/image.png\" title=\"image.png\"><img src=\"user_uploads/10155/VDUcZzi94-G5mL3K5O7WeLWF/image.png\"></a></div><p>The Provider EHR updates to USCDI v1 are not required until 24 months after the 21st Century Cures Act. However, payers are still having to convert the historical data to USCDI v1 applicable standards by 7/1 based on what is available in the IGs for Patient Access.</p>",
        "id": 228139882,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614529023
    },
    {
        "content": "<blockquote>\n<p>However, payers are still having to convert the historical data to USCDI v1 applicable standards by 7/1</p>\n</blockquote>\n<p>Where is that mentioned?</p>",
        "id": 228144195,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614533471
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> <br>\nWithin the federal register. The final rules for each payer type says only data that applies to the USCDI v1 data classes, elements, and applicable standards. The USCDI v1 guide defines the applicable standards for each type here <a href=\"https://www.healthit.gov/isa/sites/isa/files/2020-10/USCDI-Version-1-July-2020-Errata-Final_0.pdf\">https://www.healthit.gov/isa/sites/isa/files/2020-10/USCDI-Version-1-July-2020-Errata-Final_0.pdf</a></p>\n<p>So for laboratory data (which code element is also LOINC for the US CORE must support field) the USCDI v1 applicable standard, element, and class is: <br>\n<a href=\"/user_uploads/10155/k3OiFFxQFtzIL4Mcbr-1g9GW/image.png\">image.png</a></p>\n<p>Within the Federal Register rule <a href=\"https://www.govinfo.gov/content/pkg/FR-2020-05-01/pdf/2020-05050.pdf\">https://www.govinfo.gov/content/pkg/FR-2020-05-01/pdf/2020-05050.pdf</a><br>\nwithin the commentary/ CMS responses to questions it says  (this is also in line with what several different consultant companies are advising payers on, that even if its not in the standard defined- they have to conform it to the standard for Patient Access). Logically, I expected that if the clinical data didn't fully meet the standard that there would be additional time before payer to payer to do a full transformation (considering the providers EHR have not fully transitioned to USCDI v1 yet either, and the open issues related to the US Core IG). Within the 21st Century Cures Act, the USCDI v1 also introduced for the first time 8 defined types of free text clinical notes that will be visible through Patient Access API. Wondering if others are pushing all the possible Clinical for the 7/1 deadline and how they are handling the profiles that don't have the must support data types (CPT instead of LOINC) </p>\n<p>Here are some clips from federal register that touch on the topic:</p>\n<p>page 58<br>\n<a href=\"/user_uploads/10155/9xqNSCBkEYUCUBEzMzxbD6LS/image.png\">image.png</a></p>\n<p>p29-30</p>\n<p><a href=\"/user_uploads/10155/yBuRRRTteMwjoufHHT18qe_w/Image-from-iOS-1.png\">Image-from-iOS-1.png</a> <a href=\"/user_uploads/10155/soxCZnuzdH-QhR-Ck1Tn_v6a/Image-from-iOS.png\">Image-from-iOS.png</a></p>",
        "id": 228146317,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614535522
    },
    {
        "content": "<p>The US Core IG for Laboratory has observation.code as must support for LOINC.</p>",
        "id": 228147454,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614536781
    },
    {
        "content": "<p>Just confirmed the dead line for provider EHR to comply with uscdi v1 standards is 12/22. Odd that payers have to comply with the transformation my 7/21.</p>",
        "id": 228166267,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614556293
    },
    {
        "content": "<p>There are discussions about US Core, but there is an officially released version and that's what implementers should use</p>",
        "id": 228174118,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1614565651
    },
    {
        "content": "<p>Note also that the UCSDI version or the discussions about the exact meaning of 'Must support' have no bearing on the codes to use for observations: those have to be LOINC. If the only thing the system has is CPT it must try to convert them, and if that's not possible use the CPT code - it won't be compliant but better than nothing</p>",
        "id": 228174124,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1614565668
    },
    {
        "content": "<p>(ie Observation.code is not just 'must support' - it is actually required, with an extensible binding to LOIC, that means it must always be present and using a LOIC code unless there is no LOINC code available for that specific observation, so whatever 'must support' means does not affect that)</p>",
        "id": 228174412,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1614565991
    },
    {
        "content": "<p>For the mapping from CPT to LOINC, methodless LOINC codes probably could mitigate the efforts.</p>",
        "id": 228217282,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1614599632
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  thank you, I was taking the same approach. I did find there is a large open ticket that looks like some of this will be addressed in the next release <a href=\"https://jira.hl7.org/browse/FHIR-28375\">https://jira.hl7.org/browse/FHIR-28375</a></p>\n<p>I don't think only passing a CPT there will be helpful though- CPT would require a supporting field to map to a specific LOINC which would be the text description of the lab- but that is not standard either the lab result description language may not crosswalk directly to a LOINC description. For example, the CPT code tells me a Comprehensive Metabolic Panel (CMP) was complete, but the protein level within that CMP is what the LOINC would be. For one CPT there are several LOINC codes. I do not see a translation for that specifically in the IG.</p>",
        "id": 228240853,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614609544
    },
    {
        "content": "<p>Yes. My point was that that open ticket has nothing to do with which codes to use - whichever way it is resolved won't change the fact that systems are expected to return LOIC for Observation (etc. for all the other code system)</p>",
        "id": 228241609,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1614609785
    },
    {
        "content": "<p>So would you agree that if LOINC is not present in the data source, that profile would not meet criteria for 7/1- without the defined translation? I am looking for a consensus on how others are handling this. And if they are seeing alot of clinical data that does not meet the criteria/ have a defined translation from the payer inputs? I see we have a translation for ICD to SNOMED. I do not see a translation for CPT to LOINC. Curious if others are experiencing barriers with the USCDI v1 Payer data as well, and which US Core Profiles it is occurring with.</p>",
        "id": 228242264,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614609990
    },
    {
        "content": "<p>It's ok for LOINC to not be present <em>if</em> LOINC doesn't have any codes that could be used to convey the Observation that was done (at any level of granularity).  That'll be very unusual, but it's not impossible.  As such, it typically takes human inspection to determine whether an instance that doesn't include a LOINC code is conformant or not.  (Because only a human would be able to look at the shared CPT or other code and figure out whether an appropriate LOINC code exists.)</p>",
        "id": 228243254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614610348
    },
    {
        "content": "<p>This is not uncommon for the payers, we are seeing it across most payers. Even though EHRs were set up for LOINC and SNOMED back in 2015, I'm not sure payer systems could receive them is one example. Across several payers I am seeing lab result data without LOINC. . They aren't in any of the data- some is easier to engineer for the vital signs as its a smaller data set. But Lab data crosswalk would be much more complex and the translation does not seem to exist.</p>",
        "id": 228244834,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614610895
    },
    {
        "content": "<p>For vitals, it's not just USCore that mandates LOINC.  Everyone in the world is expected to do the mappings for the 10 profiled vital signs</p>",
        "id": 228245723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614611178
    },
    {
        "content": "<p>Understand. Which is not complicated. What is the world expected to do for the thousands of granular lab results that do not have a LOINC in the payer data? How are others handling this?</p>",
        "id": 228246533,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614611450
    },
    {
        "content": "<p>I don't think any of the Cures rules really defined any expectations on the world for doing stuff with data.  That is up to the world to figure out once they have the data.  However, they will always need to deal with data that doesn't have the desired codes.  I always mention historical data, patient-provided data, and data you may have received (without codes) from other organizations.   In many cases it is not appropriate for either the payer or the EHR to assign codes to data (sometimes it is ok, but sometimes not).    </p>\n<p>Note that USCDIv1 doesn't actually say anything about how much of the data or what data much have codes.  It only lists the \"applicable standards\" in a column next to the data classes.  I think that was a good approach, as it encourages everyone to use those when they can, but doesn't put undue burden on folks to reach out to that retired lab system from the organization that merged with another one back in 2017 to get the LOINC code for every lab test processed pre-merger in CY 2016 (for example).  </p>\n<p>tl;dr:  a bunch of data will be un-coded.  That's just how it is.</p>",
        "id": 228289389,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614626117
    },
    {
        "content": "<p>Right.  But much of that un-coded data will not be conformant with the specifications referenced by regulations - and might therefore carry regulatory ramifications.</p>",
        "id": 228316563,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614637068
    },
    {
        "content": "<p>The regs more or less require that systems be capable of supporting this kind of coding; and that users configure their software to create data with this kind of coding -- but to Cooper's point there's also the real world issue of data from an earlier time, and data from non-regulated external sources.</p>",
        "id": 228318564,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614637924
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  I agree its not appropriate to assign codes like this. The systems at the source (EHR) aren't required to do this until 12/2022.  Even just passing through a CPT code because the system allows may not appear well from a patient app standpoint.</p>\n<p>My interpretation of the regulation is that if the data, as it currently is maintained requires a translation that does not exist or within the IG- it does not meet criteria for 7/1. Looking to see if others are interpreting this the same. I am also a registered nurse, supporting the transformation so maybe I am seeing this from a different perspective.  Seeing if my interpretation of the reg is in line with how others are interpreting/implementing.</p>",
        "id": 228341399,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614650739
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"379418\">@Donna Lehr</span>  What is the 12/2022 requirement you are referencing?  For Cures certification, EHRs are required to enable data collection, and support relevant terminologies, but even after 12/2022 you should not assume all data will be coded.  Just because the EHR supports it, doesn't mean that end users will use it.</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - we've been very active in making sure the relevant specifications referenced by regulation support real-world data.  In every case I'm aware of, the relevant value set is either optional, or at the very least you can DAR a code.  If that were not true, then in some cases we would have to <em>not</em> expose data in the API if we didn't have a code for it.  This came up with UDI, where the FDA was pushing to <em>require</em> the discrete UDI in the US Core IG.  We pushed back (even though we fully support the push for UDI), because that meant that any historical implants where the UDI wasn't documented could not be sent via the API.  Or any implants implanted in other countries that don't adhere to UDI (yet?) wouldn't be compatible with the API.</p>\n<p>In the spirit of the rules, we do our best to make sure as much data has useful codes as we can, <strong>but there will always be data that is un-coded</strong>.</p>",
        "id": 228418478,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614695429
    },
    {
        "content": "<p>If there's a required binding or extensible binding, DAR doesn't bypass the binding.</p>",
        "id": 228422020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614696696
    },
    {
        "content": "<p>I'm not arguing that there won't be data that is un-coded.  I'm saying that, the way the US Core profiles are written, in at least some cases, sending non-coded data is non-conformant.</p>",
        "id": 228422153,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614696735
    },
    {
        "content": "<p>(Or even coded data that doesn't adhere to US Core rules)</p>",
        "id": 228422190,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614696749
    },
    {
        "content": "<blockquote>\n<p>I'm saying that, the way the US Core profiles are written, in at least some cases, sending non-coded data is non-conformant.</p>\n</blockquote>\n<p>Non-conformant in what way?  In the \"resource fails validation\" way, or \"the data exists but isn't truthfully represented in FHIR\" way?</p>",
        "id": 228427870,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614698683
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/USCDI.20US.20core/near/228422020\">said</a>:</p>\n<blockquote>\n<p>If there's a required binding or extensible binding, DAR doesn't bypass the binding.</p>\n</blockquote>\n<p>IMO, this would make the FHIR spec (or IG) non-conformant to real world use cases.  We would object strongly to having to not expose data via the API just because a code is missing.  For things like status properties with required bindings... meh.  But for any of the main terminologies (SNOMED, CPT, LOINC), there should always be an option to either omit or DAR the code.    We would see it as a major patient safety issue if a standard prevented us from communicating important clinical data via the API just because of a missing code.</p>",
        "id": 228429995,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614699384
    },
    {
        "content": "<p>Validation has two aspects - what's automatable and what can be determined through manual review.  Extensible bindings typically can't be determined to be non-valid except by human review.  If you've got an Observation that has a code that's determined by a human expert to be expressible in LOINC and there wasn't a LOINC code in the Observation, then you're non-conformant with the current US Core profiles.  That's true regardless of whether a DAR extension is present.  That's just how the FHIR rules work.</p>\n<p>The notion of \"you had data and didn't expose it\" is around mustSupport, not binding, and it too requires human review - because you have to inspect the data the system had available.  You also have to evaluate the access permissions that are in place to evaluate whether the receiver had the right to the data, but if the user has the right to receive it and you've got data and didn't share it and the element that would have contained the information is 'mustSupport' in US Core, then as a server you'd be non-conformant.  (My recollection is that the rules are more lax for clients.)</p>",
        "id": 228433142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614700448
    },
    {
        "content": "<p>The version of the US Core specifications referenced by regulations don't have an 'out' for compliance that is tied to legacy or externally sourced data.  That doesn't mean that regulators couldn't choose to be lenient, but if you're following letter of the standard, legacy and externally sourced don't matter.  There's an expectation that mapping (or even coding if source is raw text) will be done no matter what the source data looks like.</p>",
        "id": 228433755,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614700633
    },
    {
        "content": "<p>I think there's some confusion here <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- just because US Core profiles exist and are the subject of regulations doesn't imply that every resource made available (e.g., through Patient Access APIs) will conform to the US Core profiles. And this doesn't require regulators to be \"lenient\"; it's just outside the scope of the data API regulations. (Providers are still on the hook for correctly coding they data they create, but that's a separate layer of control.)</p>",
        "id": 228450191,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614706108
    },
    {
        "content": "<p>Technically, are providers on the hook for correctly coding data they create?  I don't know that there is anything on the books that requires that right now.  Certified EHRs must be able to support US Core, but that doesn't impose a requirement on a provider.  Even when incentive payments push certified EHR use, providers don't need to use it to code (though that depends on what the incentive regulation says).   So the certified path doesn't require provider coding.</p>\n<p>From another direction, Info Blocking says USCDI (and later, EHI) be shared.  But as far as I know, that is just about sharing the data you have.  It doesn't require providers start documenting additional info (codes) for the purpose of sharing.</p>",
        "id": 228453550,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614707200
    },
    {
        "content": "<p>Re: information blocking and EHR certification -- agree with the characterization here <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> (as you've described this is focused on the data you have).</p>\n<p>Re: provider requirements, these come in various forms attached to conditions of participation or to specific incentive programs like...</p>\n<ul>\n<li>mandates like <a href=\"https://www.cms.gov/Medicare/Coding/ICD10\">https://www.cms.gov/Medicare/Coding/ICD10</a> which requires use of ICD-10</li>\n<li>requirements for standardized assessments like <a href=\"https://www.cms.gov/Medicare/Quality-Initiatives-Patient-Assessment-Instruments/Post-Acute-Care-Quality-Initiatives/IMPACT-Act-of-2014/IMPACT-Act-of-2014-Data-Standardization-and-Cross-Setting-Measures\">https://www.cms.gov/Medicare/Quality-Initiatives-Patient-Assessment-Instruments/Post-Acute-Care-Quality-Initiatives/IMPACT-Act-of-2014/IMPACT-Act-of-2014-Data-Standardization-and-Cross-Setting-Measures</a> which requires use of LOINC</li>\n<li>quality reporting requirements like <a href=\"https://qpp.cms.gov/docs/QPP_quality_measure_specifications/Web-Interface-Measures/2020_Measure_PREV7_CMSWebInterface.pdf\">https://qpp.cms.gov/docs/QPP_quality_measure_specifications/Web-Interface-Measures/2020_Measure_PREV7_CMSWebInterface.pdf</a> which requires use of CVX</li>\n</ul>",
        "id": 228457098,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614708409
    },
    {
        "content": "<p>(I don't think there's a broad/universal mandate for providers like \"shall produce data conformant with FHIR US Core\" or anything.)</p>",
        "id": 228457201,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614708441
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> The specific language is \"US Core Responders SHALL be capable of populating all data elements as part of the query results as specified by the US Core Server Capability Statement.\" - that, to me, says that if you're responding to a query response, you must be able to populate all data elements as US Core required.  (You don't always have to do so - because maybe some elements get held back.)  However if, for any record, you're not capable of populating data elements as per the US Core profiles, then you'd be in violation of the 'SHALL' statement</p>",
        "id": 228467017,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614712061
    },
    {
        "content": "<p>If regulations don't refer to a specific US Core IG version, then there may be more wiggle-room.</p>",
        "id": 228467136,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614712102
    },
    {
        "content": "<p>But that just says a responder must be capable.  it doesn't say that capability must be exercised.</p>",
        "id": 228473718,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614714622
    },
    {
        "content": "<p>Right.  But if you can't demonstrate the capability of expressing all data properly coded, you're not conformant.  You can choose not to share certain data, but if you're not able to share it properly coded, you've got a problem.</p>",
        "id": 228474058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614714755
    },
    {
        "content": "<p>But demonstrating capability means you need to have at least one resource has the relevant code.  Not that all resources have the relevant codes.</p>",
        "id": 228475803,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614715382
    },
    {
        "content": "<p>It's a question of how you read the requirement.  By your reading, the requirement would be satisfied if you have a single fixed record for a single patient you can export compliantly and everything else is not exposed or not compliant.  While you <em>could</em> interpret the wording that way, it seems unlikely that's the intent behind it.</p>",
        "id": 228477519,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614715997
    },
    {
        "content": "<p>Certainly, having some explicit wording in US Core around expectations for external, legacy and other data would be helpful.</p>",
        "id": 228477723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614716071
    },
    {
        "content": "<p>I think you <em>have</em> to interpret it there is the minimum bar.  And based on the context of certification, I think that is reasonable.  If you interpret it differently, then non-conformant <em>data</em> would be incompatible with FHIR APIs.  And if that were true, then nobody would want to use FHIR since it wouldn't support real-world data.</p>",
        "id": 228478560,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614716420
    },
    {
        "content": "<p>The requirements like \"SHALL be capable of populating\" are things that ONC tests at certification time; they're product capabilites, essentially.</p>",
        "id": 228479186,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614716681
    },
    {
        "content": "<p>FHIR core sets pretty limited expectations around fixed bindings and mandatory elements.  It also sets <em>no</em> expectations in terms of what data needs to be exposed.  Implementation Guides up the bar.  And implementation guides <em>can</em> say that you're responsible for ensuring all the data in your system is conformant.  Whether this particular implementation guide is asserting that is the question.  Unfortunately, the guide (and USCDI) aren't very clear about expectations for legacy/externally sourced data.  In talking with the authors of US Core, they definitely <em>don't</em> want a situation where there's a single magic record that satisfies the requirements and thus ticks the regulatory check-box and all other data is an improperly coded mess.  On the other hand, they didn't necessarily have the expectation that EHRs would have a team of people re-coding 20-year old data.  Unfortunately, the specific requirements aren't clearly spelled out - which means you're subject to the whims of tester interpretation.</p>\n<p>Key thing is: An <em>instance</em> can't claim conformance to a US Core profile if you don't meet the required or extensible binding requirements aren't met - doesn't matter if DAR is present, doesn't matter where the data was sourced from.</p>",
        "id": 228479900,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614716966
    },
    {
        "content": "<blockquote>\n<p>which means you're subject to the whims of tester interpretation.</p>\n</blockquote>\n<p>We have tried to write US Core to allow the appropriate 'real-world' use of DAR and free-text when necessary. I would love your advice (<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ) to how to say code the dang data as specified, but if you can't, expose it as you have it...</p>",
        "id": 228485640,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1614719171
    },
    {
        "content": "<p>We are currently struggling with <a href=\"https://jira.hl7.org/browse/FHIR-30109\">FHIR-30109</a> which we had extensible SNOMED -- which you said was bad.</p>",
        "id": 228485997,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1614719306
    },
    {
        "content": "<p>so we updated to required.</p>",
        "id": 228486021,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1614719317
    },
    {
        "content": "<p>Now we can't use DAR or free text</p>",
        "id": 228486037,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1614719323
    },
    {
        "content": "<p>Do we go back to extensible (which i am told is wrong) or do we ignore the real-world implications that folks sometimes don't have things coded.</p>",
        "id": 228486322,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1614719426
    },
    {
        "content": "<p>because you have the top-level codes, wouldn't that help people send what they have?</p>",
        "id": 228486546,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614719507
    },
    {
        "content": "<p>for the cases in this thread, where you have unencoded data that can't or won't be mapped to existing codes, wouldn't sending the 'Procedure' code with the code.text carrying the unencoded data satisfy the profile? (same thing applies to Condition and the 'Clinical Finding' code)</p>",
        "id": 228487388,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614719813
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179166-implementers/topic/USCDI.20US.20core/near/228487388\">said</a>:</p>\n<blockquote>\n<p>for the cases in this thread, where you have unencoded data that can't or won't be mapped to existing codes, wouldn't sending the 'Procedure' code with the code.text carrying the unencoded data satisfy the profile? (same thing applies to Condition and the 'Clinical Finding' code)</p>\n</blockquote>\n<p>Has this been done elsewhere and did it result in a benefit over the cost?</p>",
        "id": 228488414,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614720239
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191401\">Eric Haas</span> <a href=\"#narrow/stream/179166-implementers/topic/USCDI.20US.20core/near/228488414\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179166-implementers/topic/USCDI.20US.20core/near/228487388\">said</a>:</p>\n<blockquote>\n<p>for the cases in this thread, where you have unencoded data that can't or won't be mapped to existing codes, wouldn't sending the 'Procedure' code with the code.text carrying the unencoded data satisfy the profile? (same thing applies to Condition and the 'Clinical Finding' code)</p>\n</blockquote>\n<p>Has this been done elsewhere and did it result in a benefit over the cost?</p>\n</blockquote>\n<p>I don't know.  But I'm presuming that you created the value set because there was a mandate to send SNOMED codes for procedures and conditions.  If you are getting push back from the vendors, then one solution is to keep the value set as you have it, have them send the top-level Procedure code and send their existing coding and/or unencoded procedure/conditions.  You effectively lose interoperability but if it comes down to sharing vs not-sharing, I <em>think</em> that benefit outweighs the cost? <br>\nBut I really have no skin in this game at all, so I'm just offering potential ways forward.</p>",
        "id": 228490460,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614721025
    },
    {
        "content": "<p>The key thing is, what Brett says, is there a FHIR blessed way to say, <em>\"code (and send) the dang data as specified, but if you can't, expose it as you have it\"</em> . Currently whatever US Core has tried - someone doesn't like. In other words, we want to encourage best practice and avoid low bar antics, but understand real world needs.</p>",
        "id": 228491311,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1614721385
    },
    {
        "content": "<p>Why not use a Preferred binding?  \"Instances are encouraged to draw from the specified codes for interoperability purposes but are not required to do so to be considered conformant.\"  This would say that vendors should be sending SNOMED from the value set, but if they can't, they can send their own codes or free text and still be conformant.  Again, that assumes that the mandate from USCDI wasn't \"Thou shalt send SNOMED always.\"</p>",
        "id": 228492011,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614721656
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191991\">Gay Dolin</span> <a href=\"#narrow/stream/179166-implementers/topic/USCDI.20US.20core/near/228491311\">said</a>:</p>\n<blockquote>\n<p>is there a FHIR blessed way to say, <em>\"code (and send) the dang data as specified, but if you can't, expose it as you have it\"</em> . </p>\n</blockquote>\n<p>I am also disappointed that FHIR makes this statement so hard.  I think everyone knows what <em>should</em> happen.  It just seems like the FHIR conformance language is broken, since it can't easily be used to describe this in an IG.</p>",
        "id": 228493463,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614722207
    },
    {
        "content": "<p>Neither required nor extensible allow you to bypass the binding with DAR.  You could add specific codes for \"unknown\" or \"non-convertable\", etc. in the value set - that might get what you're looking for.</p>",
        "id": 228494028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614722422
    },
    {
        "content": "<p>To say what Gay proposed, you can declare an optional mustSupport slice of coding within the element with a  \"required\" binding (or extensible if not a broad SNOMED binding) and then set some expectations around what \"support\" means.  E.g. \"Must provide this if it's net new data, nice to have if legacy/external\".</p>",
        "id": 228494414,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614722582
    },
    {
        "content": "<p>I think the issue <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> is we <em>don't</em> want a system to say \"I can't expose my data in SNOMED at all right now, so I guess I'm fully compliant\".  That doesn't meet the objective.  The objective is that systems must change what they do to expose SNOMED all the time/most of the time, but perhaps leave some wiggle-room over legacy data/external data that they can't reasonably encode properly.  That, in turn requires defining what constitutes \"legacy\" or \"external\" data.  (We know from experience with CDA and other standards that if the vocabulary rules are too loose, systems will just send whatever they've got, do no mapping, and we get zero computable interoperability.)</p>",
        "id": 228494907,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614722765
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I disagree with your premise.  FHIR (base spec and IGs) should define how existing data should be exchanged.  It should not be imposing workflow requirements on end users to enter data that is compliant with FHIR.  There certainly may be vehicles for driving workflow change, but those should be independent of the interoperability language.</p>",
        "id": 228495368,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614722951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> FHIR base spec doesn't impose workflow requirements.  It provides building blocks that IGs can use to do what they will in the realm of imposition.  You keep saying FHIR when I think you actually mean US-Core?</p>",
        "id": 228495560,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614723027
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  I keep including FHIR because some of the fundamental conformance rules are in the base spec, and are inherited by US Core.</p>",
        "id": 228495771,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614723107
    },
    {
        "content": "<p>FHIR base spec doesn't impose.  Some IGs don't impose either, some IGs do.  It depends how much expectation there is around achieving interoperability.</p>",
        "id": 228496064,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614723223
    },
    {
        "content": "<p>hmm, interesting, I can't think of any conformance rules that FHIR imposes on clients.  Maybe in the vital signs area?  I might be looking at rose-coloured glasses, but I still say my earlier assertion is correct - FHIR doesn't impose workflow or conformance requirements.  It provides building blocks to describe those requirements and some IGs, US-Core in particular, do exactly that.</p>",
        "id": 228496286,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614723267
    },
    {
        "content": "<p>The conformance rules around \"what does 'required' mean\" and \"what does 'extensible' mean\" are indeed inherited.  But it's up to IGs to decide if the rules that those binding strengths define is what they want to have in effect.</p>",
        "id": 228496828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614723437
    },
    {
        "content": "<p>There's a 'preferred' binding strength that says \"we'd like you to send this, but you don't have to\" - and that's too soft for what US Core is trying to accomplish.  And in reality, I haven't seen a firm definition that says exactly what the conformance rules they'd like to have in effect are.  E.g. \"how old is 'legacy'?\"</p>",
        "id": 228497016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614723539
    },
    {
        "content": "<p>Legacy is an example, but there is also patient-reported data, data that is reconciled from paper after a downtime, data we got from other organizations via HL7v2 or CDA exchange, etc.   Also data that came over into a US system from an international system for a tourist for example.  If we have a procedure in our system that was initially performed in Germany or Egypt or wherever, expecting a CPT code seems silly.  There are also cases where codes are end-user entered, so it isn't about system capability it is about just normal human workflow non-adherence.</p>",
        "id": 228497736,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614723833
    },
    {
        "content": "<p>I do think the required binding really has two different use cases.  A required binding to observation-status is very different than a required binding to SNOMED CT.  This is probably too drastic to be a real suggestion, but I'd almost suggest a new binding type for the SNOMED/LOINC/CPT style value sets that just expresses what we want directly.  The <em>\"code (and send) the dang data as specified, but if you can't, expose it as you have it\"</em></p>",
        "id": 228498158,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614724013
    },
    {
        "content": "<blockquote>\n<p>The \"code (and send) the dang data as specified, but if you can't, expose it as you have it\"</p>\n</blockquote>\n<p>Isn't that preferred binding?</p>",
        "id": 228499625,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614724668
    },
    {
        "content": "<p>Sure, but I do feel you need to be careful what you ask for.  what does \"if you can't\" mean?  If you just don't feel like encoding it as SNOMED?  Does it imply any desire to have clients move towards eventually coding data using SNOMED?  Most of us look at IGs and think of how we are going to implement them.  It is very interesting to look at things from a conformance perspective.  Hans Buitendijk did a wonderful job of pointing out some of the concerns around MustSupport and what that would mean from a conformance perspective.  It seems to me Cooper, that you want the conformance requirements for the coded data to be lessened but then there is no teeth them and your original statement of \"code (and send) the dang data as specified, but if you can't, expose it as you have it\" becomes \"send me whatever you feel like sending me\".</p>",
        "id": 228499910,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614724791
    },
    {
        "content": "<p>to be clear in many cases there is a us regulation that specifies a codesystem for a data element and US Core reflects that through the FHIR binding concept.  I personally think it is a FHIR issue if we can not represent  simply how codes are used in the real world. Many times a string can be used if non-coded when the binding is extensible and that covers a lot of cases.   (provocatively - maybe US Core should define a dirty binding extension to modify extensible definition)</p>",
        "id": 228500609,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614725108
    },
    {
        "content": "<p>also... to me a preferred and example bindings are the same to a data source with a budget and deadline.  Its nothing nefarious just human nature</p>",
        "id": 228500697,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614725141
    },
    {
        "content": "<p>Bindings are about what goes over the wire.  It could care less about what you have or don't have, only the rules for validating the instance.  And if the rules are \"it can be anything you like, but we'd like it to be this\", then that's a 'preferred' binding. </p>\n<p>The difference between 'preferred' and 'example' is that 'preferred' says \"this is appropriate for use and you should be ok if you designed an IG and tightened it to required or extensible\".   'example' says \"here's some codes to give you an idea of what's possible, but don't presume the set of codes is complete, useful or even fully representative\".</p>",
        "id": 228506736,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614728075
    },
    {
        "content": "<p>Part of the issue here is the notion of \"can't\".  If internally you have NDC codes, then right now you \"can't\" expose RxNorm codes.  However, if you download the mapping and write some code, you could.  If right now, your system allows organizations to capture conditions according to custom codes, then you \"can't\" expose SNOMED codes.  However, if you revamp your system to force organizations to capture condition codes using SNOMED, then you could.  And the intention of US Core is that EHR vendors do both of those things.  So \"can't\" isn't the right verbiage.  (Landing on the 'right' verbiage is a tough problem though because there are costs associated with modifying to support interoperability.)</p>",
        "id": 228506978,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614728237
    },
    {
        "content": "<blockquote>\n<p>To say what Gay proposed, you can declare an optional mustSupport slice of coding within the element with a \"required\" binding (or extensible if not a broad SNOMED binding) and then set some expectations around what \"support\" means. E.g. \"Must provide this if it's net new data, nice to have if legacy/external\".</p>\n</blockquote>\n<p>I hate to make the SD more complicated and harder to divine our intent... but here goes... assuming we are talking about Condition.code then what Lloyd is suggesting is this... with the the MS rules on the open slicing as:</p>\n<ol>\n<li>Server <strong>SHALL</strong> support at least one slice</li>\n<li>Client <strong>SHALL</strong> support all.</li>\n</ol>\n<p>So this allows for:</p>\n<ul>\n<li>validation on standard codes in valueset</li>\n<li>Server to populate with free text</li>\n<li>Server to populate with legacy or local code using coding without violating the binding  - Although not shown in the view, since is open slicing there  are 0..*  \"add your own coding \" slices.</li>\n</ul>\n<p><a href=\"/user_uploads/10155/GcWvOgbjo6Wyuh4I05hQOXUk/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/GcWvOgbjo6Wyuh4I05hQOXUk/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/GcWvOgbjo6Wyuh4I05hQOXUk/image.png\"></a></div>",
        "id": 228529939,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614742756
    },
    {
        "content": "<p>I think you'll still need some guidance around what \"SHALL support at least one slice\" means.  You want tighter than \"server can spit out a nominal conformant instance that satisfies the rules, but everything else will be non-conformant\" but looser than \"every instance emitted must be valid against one of the 3 MS  slices.  When is it valid to have non-conformant data and when is there an expectation that the server is obligated to do the necessary work to ensure conformance (if it wants the benefits of being declared conformant)?</p>",
        "id": 228530496,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614743165
    },
    {
        "content": "<p>Then it seems to me doing slicing doesn't get us any closer to what we are looking for.</p>",
        "id": 228533533,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614745237
    },
    {
        "content": "<p>It's slicing plus tighter mustSupport.  Slices allow you to separate \"this element must be present\" from \"this element must have this binding\".  You can have an optional slice (fine to stick all 3 code systems in one value set if you want) and then have specific conformance language about what \"mustSupport\" means in the context of that optional slice.  From a pure validation perspective, anything will be allowed - because that's what you need to happen.  However, you can trigger warnings about the slice being omitted and you can set rules for when the slice must be present that are testable by humans.</p>",
        "id": 228533871,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614745522
    },
    {
        "content": "<p>\"Just write some code\" to map from codesets of different inherent granularity and constantly updating lists in a way that has no clinical impact is a product to be created and marketed after hiring teams of clinical informaticists, like Apelon.</p>\n<p>\"force organizations to capture condition codes using SNOMED\" EHR vendors have tremendous influence. It's not something in their control to demand and force feed these sorts of operational changes at tens of thousands of their customer healthcare organizations all at once, diverting resources from planned projects at those healthcare organizations, requiring possible education and training of clinicians, all while avoiding clinical impact. </p>\n<p>The world is not perfectly encoded. We can strive for the best but plan for the worst. There has to be some middle ground between the pragmatism of Implementers and the idealism of architects.</p>",
        "id": 228545821,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1614754642
    },
    {
        "content": "<p>How about two profiles? One with strong constraints (e.g. required binding) and one with lax constraints (e.g. preferred binding) and then two conformance checks, one that all records meet the lax constraints and a second that a certain set of records (e.g. 20%) meet the strong constraints. The set that must meet the strong constraints can be changed as time goes by.</p>",
        "id": 228552355,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1614759155
    },
    {
        "content": "<blockquote>\n<p>The world is not perfectly encoded. We can strive for the best but plan for the worst. There has to be some middle ground between the pragmatism of Implementers and the idealism of architects.</p>\n</blockquote>\n<p>What could we call this binding?</p>",
        "id": 228576148,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1614770899
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191410\">Brett Marquard</span> <a href=\"#narrow/stream/179166-implementers/topic/USCDI.20US.20core/near/228576148\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>The world is not perfectly encoded. We can strive for the best but plan for the worst. There has to be some middle ground between the pragmatism of Implementers and the idealism of architects.</p>\n</blockquote>\n<p>What could we call this binding?</p>\n</blockquote>\n<p>Super useful.  <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 228600744,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614781861
    },
    {
        "content": "<p>In the end, it comes down to rules.  There are monitory consequences to complying with the rules.  The rules are very much intended to force operational changes on tens of thousands of customer organizations.  However, realistically, the rules can only drive change in those systems that face those financial consequences - either directly or through trickle-down arrangements.  E.g. If a hospital is paying a downstream system for services, it may have leverage to get that system to improve the standardization of its coding.  If not, no such luck.  Also realistically, the rules can't be retroactive - at least not without the regulations providing a huge infusion to support up-coding historical records.</p>\n<p>What I haven't seen clearly expressed in US Core (or the regulation) is \"what constitutes sufficient effort\"?  From an architecture perspective, I don't care.  I'm not trying to force the use of anything.  I just want to help IG designers understand how to use the FHIR conformance machinery to say what they want.  If you don't want to force systems to use a particular set of codes all the time, then 'required' and 'extensible' aren't for you.  To figure out what to use instead, we need clear (preferably objective) rules about what's conformant and what's not.  Then we can try to define profiles that encode those rules.</p>",
        "id": 228602514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614782463
    },
    {
        "content": "<p>Perhaps my focus is too narrow. I'm fenced by the FHIR IG(s) on one side and a data store on the other. My direction is take the data and make FHIR resources out of them. FHIR (USCORE) requires code system X. My data store doesn't have code system X. How do I resolve that? Who tells the Providers that they SHALL record in code system X? Who enforces it? Who tells the EHR vendors that they have to upgrade their systems to allow usage of code system X? Who tells the providers they have to upgrade to new EHR software? Plus all the points raised above (patient entered, foreign source, historical). </p>\n<p>All of this means that the interop person looks at a pile of data, often in a proprietary code system, and asks how do I get to standard from here? </p>\n<p>The only answer, much like the game we played during CCDA certification. We output what we have/can and IG/Standard/requirement be \"ignored\". We structure our solution such that IF EHR supports entering code system X AND the provider licensed code systems X AND the provider chooses to enter code system X then the FHIR resource will have code system X. The system has the capability of meeting conformance if all the dominoes fall correctly. Should a regulatory agency knock, look right here at this test patient all the boxes are checked and meet standard. That data that brought you here was old, hasn't been converted, provider hasn't started using ..... You have test data you want us to use? Sure let us load it into the system... ta da!</p>\n<p>Yes there are converters for some (inter)national code systems to other (inter)national code systems. Some only go one way. Easy to go from icd-10 to 9 but not the other way. Plus any \"automated\" translation of clinical coding has to be vetted at the highest level. One little bit of incorrect transpose and the patient goes from \"allergic to latex\" to \"NOT allergic to latex\". Better to not risk an incorrect translation than worry about any particular resource not complying with a standard. If there is an industry accepted, useable everywhere, understood to be 99.99% accurate code system Y to code system X translator available, then what's the point of limiting the resource to X, it could be X or Y and if the receiver needed X they can use the translator.</p>\n<p>Value Sets (Code systems) have to have all appropriate values (probably good here). EHRs need to only allow items from corresponding value set (no where close in my experience). Standards need to allow any value that was ever in the value set (any version), not just current. This allows historical data to conform. \"When recorded X was a valid value, now 2 years later we don't use that anymore, at least we don't get dinged for invalid resources .\" If all of the professional systems record the standard values, transmit the standard values, receive the standard values, then those little odd ball items (patient entered, etc) probably probably fall to the \"oh well\" bucket.</p>",
        "id": 228646301,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1614797603
    },
    {
        "content": "<blockquote>\n<p>FHIR (USCORE) requires code system X. </p>\n</blockquote>\n<p>My question to everyone is why is US-Core requiring code system X?  I always thought that US-Core was requiring the code system because USCDI and regulation was requiring it?  If that's not the case, then the binding should totally be preferred with the recognition that there is zero weight to a preferred binding when it comes to conformance expectations.  I keep hearing people complaining that US-Core (or FHIR) is forcing them to do something, but I thought US-Core requirements were just FHIR representations of US regulation requirements as expressed by USCDI?</p>",
        "id": 228647942,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614798160
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  wrote:</p>\n<blockquote>\n<p>I always thought that US-Core was requiring the code system because USCDI and regulation was requiring it\"</p>\n</blockquote>\n<p><strong>This is complicated (of course).</strong> ONC's final rule is designed so that (<a href=\"https://www.federalregister.gov/d/2020-07419/p-335\">citation</a>):</p>\n<blockquote>\n<p>interoperability-focused [certification] criteria ... ensure that any system of certified health IT meeting the Base EHR definition is capable of using and exchanging data on a patient's problems using content, format, and other standards applicable to each mode of exchange (e.g., standardized API and C-CDA).</p>\n</blockquote>\n<p>You can also get a sense of intent from:</p>\n<blockquote>\n<p>we believe that the adoption of USCDI v1 for all certified health IT will advance interoperability by ensuring utilization of common data and vocabulary code sets</p>\n</blockquote>\n<p>... but this intent applies only to a product's capabilities -- products need to support the use of USCDI data and vocabularies. But what obligations to providers have to correctly use these products? One hint is from the following, which explains that for the next 24 months, an actor avoids information blocking by if they</p>\n<blockquote>\n<p>provide at least the content that is within the USCDI in response to a request for access, exchange, or use of EHI</p>\n</blockquote>\n<p>but \"the content\" here doesn't necessarily mean <em>coded according to USCDI</em> requirements, on my reading. Rather, USCDI identifies things like CVX coding for vaccinations as an \"applicable standard\".  I think some clarity would help on the information blocking implications, but my current reading aligns with Cooper's.</p>",
        "id": 228653754,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614800227
    },
    {
        "content": "<p>Before we all start piling on US Core being too restrictive take a minute to look at the actual content.  Here is the Imm profile:</p>\n<p><a href=\"/user_uploads/10155/oRh3cpBKrEWKVOqdDa42w5N_/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/oRh3cpBKrEWKVOqdDa42w5N_/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/oRh3cpBKrEWKVOqdDa42w5N_/image.png\"></a></div><p>status is <code>required</code> - does any one have a problem with that.  I hope not.</p>\n<p>the code is <code>extensible</code> -  THIS reflect  a compromise between a) the intent of regulations  and b) real world challenges.   Where this becomes a problem is when the pure definition and the real world definition collide.   When you don't have a matching CVX  code  What are you gonna do?... you can use it or present as text or go through the 172 concept to figure out if there is an appropriate match.  I actually don't see how extensible would ever be truly implemented in the real world as it is formally defined.  Is any system going to reject data because the code was not mapped - the only way they would know would be to map it themselves.</p>",
        "id": 228659805,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614802391
    },
    {
        "content": "<p>To me, extensible should be rarely used as it has a specific purpose - CVX, NDC, RxNorm, HealthCanada DINs are prime examples in my mind where you have a constantly updated set of codes that are published on a scheduled basis but where a product normally covered by that code system may exist before the code is out in the wild.  So you have a product that has a code but it's not in the valueset expansion yet.<br>\nThe other case would be where you have a set of values that you agree should use these codes when exchanged but you know beforehand that you clearly haven't and/or can't cover the entire code space.<br>\nBut from what Cooper, Daniel, Josh, and others are saying, maybe US-Core should relax all of the large bindings to preferred.  As long as everyone understands that means almost any implementation will be conformant.</p>",
        "id": 228660713,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614802705
    },
    {
        "content": "<p>and I do want to point out that I'm not trying to be pile on US-Core for being too restrictive.  I'm not sure I'm convinced that preferred bindings make sense because they are too conformance-lax.  Like I said earlier, I always assumed that the various conformance requirements as stated in US-Core where coming from regulation and USCDI statements which would make required bindings or the slicings you showed us earlier totally appropriate.</p>",
        "id": 228661077,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614802845
    },
    {
        "content": "<blockquote>\n<p>But from what Cooper, Daniel, Josh, and others are saying, maybe US-Core should relax all of the large bindings to preferred. As long as everyone understands that means almost any implementation will be conformant.</p>\n</blockquote>\n<p>Rereading Josh's last post , I don't think that is what they are saying.  And I think you could and should implement extensible the way that makes sense</p>",
        "id": 228661645,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614803058
    },
    {
        "content": "<p>Yeah, I'd rather see very precise US Core profiles and have the understanding that <em>not all resources are gonna meet them</em>.</p>",
        "id": 228661985,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614803179
    },
    {
        "content": "<p>(This feels preferable to \"relaxing\" the profiles to the point where all data flowing through the API will be declared conformant.)</p>",
        "id": 228662040,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614803205
    },
    {
        "content": "<p>That way we can measure progress over time -- like, how often can/do resources meet the profiles, and is this improving, and when they don't... can we start to explain \"why\" (beyond: old data and external data, which are well-understood reasons already).</p>",
        "id": 228662203,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614803270
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191401\">Eric Haas</span> <a href=\"#narrow/stream/179166-implementers/topic/USCDI.20US.20core/near/228661645\">said</a>:</p>\n<blockquote>\n<p>And I think you could and should implement extensible the way that makes sense</p>\n</blockquote>\n<p>I'm not sure what you mean by \"makes sense\".  It currently means \"here is a set of codes.  You must one of these codes if at all possible.  If none of these codes matches what you want to send, then you are allowed to send a different code.\"  What else would extensible mean?</p>",
        "id": 228663168,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614803641
    },
    {
        "content": "<p>When you say \"extensible\" you're saying \"implementers must map to these codes if one applies\".  Implementers on this thread are saying they don't want to/can't do that.  If they don't/can't, their instances won't conform with the profiles.</p>",
        "id": 228664291,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614804077
    },
    {
        "content": "<p>You <strong>can't</strong> interpret extensible \"in the way that makes sense\".  'extensible' means something very clear and specific.  It means <em>you must map</em>.  If that's not what the requirement is, the implementation guide shouldn't say 'extensible'.</p>",
        "id": 228664465,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614804138
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>)</p>",
        "id": 228664503,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614804155
    },
    {
        "content": "<p>Just because folks mention \"mapping\" a lot, I wanted to provide some information about how we (Epic) actually determine which codes are included in our FHIR resources.  There are three main methods:</p>\n<ol>\n<li>\"Mapping.\"  This is what is often assumed, and is fairly common.  We have an internal record that represents something (e.g. an influenza vaccine), and we (normally some IT staff with clinical review) map it to the relevant standard terminologies (e.g. CVX).</li>\n<li>\"Stamping.\"  In this case, we stamp a code on a record when we create the record.  This is different from mapping, because if you re-map a record, that will immediately change the codes returned for all resources.  Stamping means that you can't (easily) remap.  The code we stamp on the record may be from an Epic-internal source, but most often we are getting the code from an external system.  The most common example is lab results, where the lab system tells us the LOINC code and we stamp it on the result.  Another example is CDA document exchange, where we will file content from a CDA document, using the codes we got from the sending system.</li>\n<li>\"User-entered\".  This is fairly rare, but some codes are manually entered by users.  CPT codes on surgical procedures is a common example.</li>\n</ol>",
        "id": 228675681,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614808578
    },
    {
        "content": "<p>Thank you all for collaborating.</p>\n<p>This is also pushing end users to support it I think that is where it will<br>\nevolve. Especially in quality measurement end users will support them.</p>\n<p>I see lab results will allow a cpt code to go through even though the must<br>\nsupport binding is missing. There is also a path for a text description. We<br>\nwill have to integrate lab type there.</p>\n<p>Youll see something similar with the cvx code on immunization data as you<br>\nare describing with udi.</p>",
        "id": 228717285,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1614833780
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>   the 21st Century Cures act gives providers 24 months to update from CCDA to USCDI v1, which was extended due to COVID-19.</p>",
        "id": 236508991,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1619617525
    },
    {
        "content": "<p><a href=\"https://www.healthit.gov/cures/sites/default/files/cures/2020-11/ONC_IFC_Webinar_Slides_v2_508.pdf\">https://www.healthit.gov/cures/sites/default/files/cures/2020-11/ONC_IFC_Webinar_Slides_v2_508.pdf</a></p>",
        "id": 236509348,
        "sender_full_name": "Donna Lehr",
        "timestamp": 1619617655
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"379418\">@Donna Lehr</span> I think you mean CCDS</p>",
        "id": 236526127,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1619623018
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"379418\">@Donna Lehr</span> I'm not sure what you mean by the CCDS / USCDIv1 comment above.   Can you clarify what point you are trying to make?  Are you suggesting something about standard terminology availability due to USCDIv1?  Or FHIR API availability?  Or Info Blocking Scope?  Or talking about incentive program measures?</p>",
        "id": 236530713,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1619624685
    }
]