[
    {
        "content": "<p>USCDI includes a requirement for Care Team. The HL7 general guidance page states that we should use the Care Team profile to document this.<br>\n<a href=\"https://www.hl7.org/fhir/us/core/general-guidance.html\">https://www.hl7.org/fhir/us/core/general-guidance.html</a></p>\n<p>However, my company is solely involved in primary care. The only care team member would be a PCP (in contrast to an inpatient setting, where there may be multiple groups).</p>\n<p>We noticed that the Patient resource has a generalPractitioner field that allows us to document the PCP, and in effect serves as the care team field. I was thinking it would be simpler to include the PCP under Patient.generalPractitioner, rather than having to create CareTeam resourceS that will only contain one practitioner per patient.</p>\n<p>Thoughts on this? Or will I be causing interoperability issues, as others will be expecting to find PCP's and other clinicians under Care Teams?</p>\n<p>Or perhaps Care Teams is only used for inpatient or non-primary care settings -- in which case perhaps my company should ignore the Care Team resource?</p>",
        "id": 248392584,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1628103507
    },
    {
        "content": "<p>If you're planning to undergo g10 certification (<a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services\">https://www.healthit.gov/test-method/standardized-api-patient-and-population-services</a>), not supporting CareTeam will be a problem.</p>",
        "id": 248396324,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1628105136
    },
    {
        "content": "<p>Hi, just to clarify, we will definitely support CareTeam -- if we receive this info from another EHR we will be able to store it.</p>\n<p>But what are primary care clinics doing -- are they actually creating CareTeam resources? Or can primary care clinics use Patient.generalPractitioner field, and avoid creating CareTeam resources? The CareTeam resource would be ready to use if we ever received data from a hospital or other health system.</p>",
        "id": 248412494,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1628113187
    },
    {
        "content": "<p>In primary care, you might still have a PCP, an Ob/gyn, a psychiatrist, a preferred pharmacy,  a preferred dental clinic, a social worker, etc.  I.e. CareTeams are still very much relevant in primary care.</p>",
        "id": 248415114,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628114783
    },
    {
        "content": "<p>generalPractitioner is not a 'must support' in US core, so most US-bases systems would not populate (server) / ignore (client) it. Our clients ignores it.</p>",
        "id": 248429192,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628127293
    },
    {
        "content": "<p>Good point. I think within my organization, we will use generalPractitioner, as it may make it easier to tie a patient to a specific location or region -- for reporting purposes. But we'll be adding the Care Team resource too, for USCDI and interoperability. Thanks all.</p>",
        "id": 248539577,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1628198896
    }
]