[
    {
        "content": "<p>Hi all,<br>\nFor a condition of category \"encounter-diagnosis\", is Condition.clinicalStatus intended to represent the status of the condition at the time it was assessed, or at the current time? For instance, if a provider diagnoses a condition (e.g. Influenza) on 1/1/2017 and it was not moved to the patient's Problem List, should this be represented as?<br>\n- clinicalStatus \"active\", assertedDate \"1/1/2017\"<br>\n- clinicalStatus \"inactive\", assertedDate \"1/1/2017\"</p>\n<p>Or for encounter diagnoses, is it recommended to also represent onsetDate and abatementDate as \"1/1/2017\"?</p>",
        "id": 153964616,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1527180246
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 153964617,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527180332
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> bumping this. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is there anyone else that might be able to help, or some additional documentation you could point me to?</p>",
        "id": 153966446,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1527863830
    },
    {
        "content": "<p>The clinical status reflects the status as it was on the asserted date.  Whether a given Condition will appear on a problem list is independent of the clinical status.  (Some active conditions might not be important enough or relevant to a particular type of care to appear on a given practitioner's problem list for the patient.  Other resolved conditions might still be deemed relevant.)  So if you're asserting that the patient had something in the past, the clinical status would be resolved, the asserted date would be now and the onset and abatement would capture the period over which you beleive the condition was effective</p>",
        "id": 153966452,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527865195
    },
    {
        "content": "<p>I'm not sure if that's entirely correct, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.  The comments on assertedDate state that \"The assertedDate represents the date when this particular Condition record was created in the EHR, not the date of the most recent update in terms of when severity, abatement, etc. were specified.\"  It's not specifically mentioned, but I think that clinicalStatus would be expected to be updated along with severity, abatement, etc., so over time it wouldn't be statically tied to the assertionDate.  This is probably something that we need to clarify in PCWG.</p>",
        "id": 153966455,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1527865592
    },
    {
        "content": "<p>The short definition and long definition aren't terribly well-aligned :(  I think the asserted date has to be the date the Condition \"as recorded\" was deemed to be true.  If you're asserting someone has stage 4 lung cancer and you've been tracking it since they were stage 2, you don't want the asserted date to be the date they had stage 2.  But agree the wording definitely needs clarification</p>",
        "id": 153966464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527867428
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17285\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17285\">GF#17285</a></p>",
        "id": 153966466,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1527867896
    },
    {
        "content": "<p>great, thanks! and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, to your stage 2/4 lung cancer example, my understanding is that you would have two separate records for the Condition. one for stage 2 lung cancer with assertedDate = (last date this was recorded) and clinicalStatus = Resolved (or Inactive) ; and one for stage 4 lung cancer with assertedDate = today and clinicalStatus = Active. would you agree?</p>",
        "id": 153966477,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1527868671
    },
    {
        "content": "<p>That's one possibility.  The other is that the same condition will have been updated over time.  If you dig into the history you can see that it was once stage 2, but the current record will show stage 4.</p>",
        "id": 153966478,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527868733
    },
    {
        "content": "<p>so that design decision would be up to the implementer?</p>",
        "id": 153966479,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1527869020
    },
    {
        "content": "<p>Yes - based on their business processes.  It could also be driven by the user</p>",
        "id": 153966480,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527870754
    },
    {
        "content": "<p>I'll get <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17285\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17285\">GF#17285</a> added to the Patient Care work group agenda to discuss (maybe even today if time allows).</p>",
        "id": 153967875,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1528401124
    },
    {
        "content": "<p>Speaking from Cerner's perspective, both scenarios are possible.  We have point in time diagnoses (for billing, represented using ICD-X) and we have the problems (represented using SNOMED).  In our system, the problem might get updated from stage 2 to stage 4, but I would expect multiple diagnoses (per visit or encounter) where one might be stage 2 and another might be stage 4 because diagnoses don't typically get modified after the encounter.</p>",
        "id": 153967885,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1528401553
    },
    {
        "content": "<p>Patient Care discussed <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17285\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17285\">GF#17285</a> tonight.  A suggestion was made to rename assertedDate to initialAssertionDate, but this suggestion was countered saying we could just as easily clarify the description / definition instead.  Before voting on the change request, Patient Care is inviting implementers to voice their opinion about whether the element should be renamed (or not).</p>",
        "id": 153967923,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1528411066
    },
    {
        "content": "<p>I don't think that renaming brings any value over a clear definition</p>",
        "id": 153967925,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528412232
    },
    {
        "content": "<p>Don't you want the date at which the currently reflected assessment was made? If the initial assessment a year ago was stage 1 and the current assessment is stage 4, I presume you'd want the date at which the current state was determined.</p>",
        "id": 153967929,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528415076
    },
    {
        "content": "<p>Most recent assessment date seems much more useful than initial assessment date when you've got onset date.</p>",
        "id": 153967930,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528415110
    },
    {
        "content": "<p>I raised that question, too.  But the sense of the group was along the lines that meta.lastUpdated likely captured the date of most recent assessment reasonably well, and you have onset, but the missing piece of information (if you don't implement history) is when you started tracking the condition (not when it became noted for the patient, which is onset).  And that's how assertedDate has been documented, so that is consistent.  I thought the name change would probably make the intended meaning more obvious, but I'm perfectly well persuaded that it's not worth it to do that at this point and that making the documentation even clearer (than it already is) should suffice.</p>",
        "id": 153967945,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1528419143
    },
    {
        "content": "<p>meta.lastUpdated does <em>not</em> capture the date of the most recent assessment.  It captures when you stored this copy of the resource on your server.  If you receive a record of an assessment that was done 5 years ago today, your system will have a meta.lastUpdated value of \"today\".  Content in meta is typically server-specific.</p>",
        "id": 153967984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528422779
    },
    {
        "content": "<p>Yes, I agree, Lloyd - that's exactly right.  What you described isn't the most common scenario, but it certainly can occur.  I agree that trying to rely on anything in metadata for specific semantics like this probably is not a good idea.  So I think we need to give this some further thought (which I believe we'll discuss further next week).</p>",
        "id": 153968040,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1528467990
    },
    {
        "content": "<p>Speaking as PC co-chair, I can add this to the Patient Care agenda for Thursday to revisit.</p>\n<p>Speaking as an EHR vender, I will just add:</p>\n<ul>\n<li>Users have a hard enough time documenting the onset date (often leaving it blank), so I think we'd have no luck trying to get users to explicitly document their assessment date.  </li>\n<li>Technically, in our mapping/implementation, we're using the system defaulted date/time stamp (not a manually entered date/time) for recordedDate (in DSTU2) and assertedDate (in STU3)</li>\n<li>Going back to the original question, I will just clarify that all of our encounter-diagnosis conditions have a clinicalStatus of active (which reiterates what I mentioned earlier about \"billing diagnosis\" being immutable -- so their status, stage, etc. don't ever change)</li>\n</ul>",
        "id": 153968774,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1528836027
    },
    {
        "content": "<p>More detailed meeting minutes are available in the <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17285\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17285\">GF#17285</a>, but to summarize the resolution (applicable to both AllergyIntolerance and Condition)<br>\n1) Move assertedDate from core resource to an extension (because no implementer on the call supported this field)<br>\n2) Add recordedDate to the core resource, which is the date when this particular AllergyIntolerance/Condition record was created in the EHR, which is often a system-generated date.  The recordedDate is valuable to have in absence of the onset date (for example, when patient doesn't recall when a diagnosis was made) and when FHIR server doesn't support version history (to get version 1's lastUpdated)</p>",
        "id": 153970024,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1529015783
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>, appreciate you clarifying this. We used the same approach for encounter-diagnosis conditions, always setting the status to 'active'. We also set the onset date and abatement date to the date of the encounter diagnosis. The main reason for doing so is that quality measures look at these two attributes to determine the prevalence period. If we didn't set abatement date to the date of the diagnosis, then all encounter diagnoses would appear as active and relevant past the date of the diagnosis. Our perspective is that ongoing conditions should also be tracked in the problem list, where there is a workflow to indicate the a problem is no longer active (i.e. historical).</p>\n<p>Do you take a similar approach for onset date and abatement date for encounter-diagnoses?</p>",
        "id": 153976521,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1532035077
    }
]