[
    {
        "content": "<p>Hi all.  I am brand new to FHIR and have what I hope is a simple question or two.  To provide some scope I am modeling and creating an entirely new database using the FHIR spec.  So I am essentially trying to persist this spec.  We will be getting data in HL7 format and at some point will also get and send data in FHIR format.  So the group felt FHIR was good since it is flexible and should make it easier for future data feeds.    </p>\n<p>I know that 1 patient resource can have many identifiers (SSN, MRN, etc).  Each will tie back to that 1 patient resource.  Can the same patient be in the patient resource more than once?  If so then I guess the identifier could tie back to more than 1 patient resource right?</p>\n<p>My other question is that since an observation can be related to a patient, it looks like observation.subject is how to relate back to the patient.  That seems clear to me.  But what about also using observation.identifer?  In other words does it make sense to include MRN as an identifier within observation resource even though it isn't unique to the specific observation?  Or would this MRN identifier only be in the patient.identifer</p>\n<p>Any feedback is greatly appreciated!</p>",
        "id": 153957624,
        "sender_full_name": "Jim Indelicato",
        "timestamp": 1525967252
    },
    {
        "content": "<blockquote>\n<p>I know that 1 patient resource can have many identifiers (SSN, MRN, etc).  Each will tie back to that 1 patient resource.  Can the same patient be in the patient resource more than once?  If so then I guess the identifier could tie back to more than 1 patient resource right?</p>\n</blockquote>\n<p>I don't understand the question: Can the same patient be in the same patient resource? What are you trying to achieve. (Or perhaps it is a typo?)</p>",
        "id": 153957635,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1525968434
    },
    {
        "content": "<blockquote>\n<p>My other question is that since an observation can be related to a patient, it looks like observation.subject is how to relate back to the patient.  That seems clear to me.  But what about also using observation.identifer?  In other words does it make sense to include MRN as an identifier within observation resource even though it isn't unique to the specific observation?  Or would this MRN identifier only be in the patient.identifer</p>\n</blockquote>\n<p>A resource Identifier identifies that specific resource. An observatin Identifier is an identifier for an observation. So if you are asking \"can we put the patient identifier as an identifier for the observation\" i don't see how that would work.</p>",
        "id": 153957638,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1525968569
    },
    {
        "content": "<p>The same identifier can appear on the same Patient in a few cases:<br>\n- data entry error (wrong identifier on wrong patient, accidental duplicate patient)<br>\n- deliberate duplication (separate records for different departments, separate records for 'legacy' patients vs. current patients)<br>\n- deliberate use of the same identifier by multiple patients (e.g. sharing of social security numbers in the US)</p>",
        "id": 153957641,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525969289
    },
    {
        "content": "<p>It can happen for practitioners too - different practitioner records for different hospitals or multi-licensed practitioners.  FHIR doesn't require that, but it may come about due to data sources and/or business decisions</p>",
        "id": 153957642,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525969343
    },
    {
        "content": "<p>In regards to 1 patient being in the patient resource more than once...lets say that data for patient Jim I is sent on 5/10.  This data is stored in my FHIR like tables.  Then on 5/11 data is sent for the same Jim I patient.  I am trying to understand if it makes sense to create a new patient record and use   Patient.link to replace old record or just update the old record?</p>",
        "id": 153957643,
        "sender_full_name": "Jim Indelicato",
        "timestamp": 1525969863
    },
    {
        "content": "<p>if by \"patient data\" you mean \"information about the patient\" (and not any procedures or observations), then from the FHIR perspective these are two different versions of the same resource</p>",
        "id": 153957644,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1525970098
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"195845\">@Jim Indelicato</span>, Typically, an application would only be required to send a patient resource to a server in order to create a new patient resource or to mutate an existing patient resource. However when the intent is to exchange e.g. clinical information about a certain patient, the application would send resources that <em>refer</em> to an existing patient resource, by means of a resource reference. The application might retrieve an existing patient resource (selected by the user), but there would be no need to the patient resource itself back to the server.</p>",
        "id": 153957646,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1525970853
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  Yes I mean information/attributes at the patient level (not observation, etc).  So I think I am following.  Since it is a different version of the same resource then I definitely shouldn't create a new resource and use patient.link.  I should instead version that patient resource</p>",
        "id": 153957647,
        "sender_full_name": "Jim Indelicato",
        "timestamp": 1525971238
    },
    {
        "content": "<p>Versioning in FHIR is handled with \"update\"</p>",
        "id": 153957653,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525972041
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>My other question is that since an observation can be related to a patient, it looks like observation.subject is how to relate back to the patient.  That seems clear to me.  But what about also using observation.identifer?  In other words does it make sense to include MRN as an identifier within observation resource even though it isn't unique to the specific observation?  Or would this MRN identifier only be in the patient.identifer</p>\n</blockquote>\n<p>A resource Identifier identifies that specific resource. An observatin Identifier is an identifier for an observation. So if you are asking \"can we put the patient identifier as an identifier for the observation\" i don't see how that would work.</p>\n</blockquote>\n<p>Let me ask my question like this...if I was to receive observation data in FHIR format and they included MRN, would I see MRN in observation.identifier or extension?</p>\n<p>You guys are great!  I am glad I joined</p>",
        "id": 153957655,
        "sender_full_name": "Jim Indelicato",
        "timestamp": 1525972229
    },
    {
        "content": "<p>You shouldn't see MRN in the Observation.identifier because it isn't an identifier for the observation.  It would be an identifier of the patient so should be found on the Patient resource that the Observation references.  If you needed to include it on the Observation resource, then it would have to go in an extension.</p>",
        "id": 153957656,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1525972537
    },
    {
        "content": "<p>In my case there is no 1 col/attribute that uniquely defines an observation (in the HL7 observation feed).  But the combination of MRN and observationDateTime would uniquely identify an observation.  That is why I am wondering it both MRN and observationDateTime would belong in observation.identifier or if both would still belong in an extension.</p>",
        "id": 153957660,
        "sender_full_name": "Jim Indelicato",
        "timestamp": 1525974018
    },
    {
        "content": "<p>your Identifier would be MRN+datetime</p>",
        "id": 153957661,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525974528
    },
    {
        "content": "<p>do you actually need an identifier for the observation?</p>",
        "id": 153957663,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1525974638
    },
    {
        "content": "<p>the _id could be sufficient.</p>",
        "id": 153957664,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1525974688
    },
    {
        "content": "<p>In the HL7 feed I am not receiving the FHIR _id.  I need a way to determine if the observation already exists in my database.  If I make the identifier MRN+datetime does that mean it would need to be concatenated into a single identifer</p>",
        "id": 153957666,
        "sender_full_name": "Jim Indelicato",
        "timestamp": 1525975320
    },
    {
        "content": "<p>the id is always there for a fhir resource</p>",
        "id": 153957670,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1525978196
    },
    {
        "content": "<p>If a resource has an \"identifier\" element, is the system/value pair supposed to be unique across all resources of that type. Or is it possible that two resources could be considered equivalent according to one system (but not another)?</p>",
        "id": 153957698,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1525996966
    },
    {
        "content": "<p>well, almost always :) . - not in a 'create' operation...http://hl7.org/fhir/resource.html#id</p>",
        "id": 153957713,
        "sender_full_name": "David Hay",
        "timestamp": 1526018187
    },
    {
        "content": "<p>I think Thomas is talking about .identifier, not .id.</p>",
        "id": 153957777,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526042988
    },
    {
        "content": "<p>The answer for .identifier is \"it depends\" :)</p>",
        "id": 153957778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526042998
    },
    {
        "content": "<p>Servers are certainly free to enforce that certain identifier types are unique, but there are all sorts of reasons why they wouldn't be.  Examples include multiple versions of value sets, code systems and other resources with a \".version\" element; multiple records for the same individual/device due to business practice (or data entry error); Deliberate re-use of identifiers; Cycling through an identifier namespace again after a period of time has passed (not good practice and there should be a distinct validity period for the identifier, but good practice isn't always followed)</p>",
        "id": 153957779,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526043148
    },
    {
        "content": "<p>Thanks Lloyd. That helps. I think what I was thinking of doing woudl have been effectively using multiple .identifiers to store custom attributes of resources. And I think that probably would have been an abuse of the elements.</p>",
        "id": 153960759,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526346429
    },
    {
        "content": "<p>For custom attributes, you're much better off with extensions</p>",
        "id": 153960943,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526382864
    },
    {
        "content": "<p>back to the notion that identifiers should/must be unique.  FHIR does not prohibited that an identifier can repeat within an environment, but where does an identifier start becoming a grouper  - a way of connecting resources.  The use case I have in mind is a member Id for insurance.   <br>\nMe and my kids are all have  the same member ID <code>1234</code>.   To me this seems is a legitimate identifier, its just not unique to me and a shortcut for instead of supporting Coverage with a proper reference to the patient.</p>\n<p>Does the spec say more about handling business identifiers if there is no guarantee they are not unique (e.g. when referencing them by a business identifier) ?</p>",
        "id": 153961325,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526401054
    },
    {
        "content": "<p>There is no expectation of a general guarantee of uniqueness.  Systems can choose to enforce specific identifiers they feel should be unique in their particular context.</p>",
        "id": 153961345,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526409642
    },
    {
        "content": "<p>what happens if Observation.subject  uses  Reference.identifier and points to three Patients?  Is that documented?</p>",
        "id": 153961348,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526410014
    },
    {
        "content": "<p>Systems could choose to treat that as an error - assuming they even tried to resolve</p>",
        "id": 153961353,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526410204
    },
    {
        "content": "<p>If I am understanding correctly, in the example member id for insurance...the member id of the main holder would be stored in the identifier for the main holder since it uniquely identifies him/her.  But it sounds like their member id should not be in the kids identifier attribute.  Instead the most appropriate place would be in the extension.  Am i correct?</p>",
        "id": 153962411,
        "sender_full_name": "Jim Indelicato",
        "timestamp": 1526510728
    },
    {
        "content": "<p>what extension?  I think we are saying you could have 3 patients with the same identfier of type member id.  Is up to the system</p>",
        "id": 153962413,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526510832
    },
    {
        "content": "<p>Is there a reason not to have a separate resource to represent the coverage and either have the Patient resources point at it or it points at them?</p>",
        "id": 153963902,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526929194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> regarding the comments on this topic back in May.  You seem to indicate that identifiers do not need to be unique within the context of a specific system.  However the <a href=\"http://build.fhir.org/datatypes.html#Identifier\" target=\"_blank\" title=\"http://build.fhir.org/datatypes.html#Identifier\">current spec for the identifier data type</a> says that they should be.  Was there an update to the spec between May and now that required value to be unique within a system?</p>",
        "id": 154005473,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1538591973
    },
    {
        "content": "<p>And if so, I'm kinda stuck on how to handle stuff like SSN, where the value very likely will not be unique due to data entry errors.</p>",
        "id": 154005474,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1538592053
    },
    {
        "content": "<p>And if it isn't unique, then how does that work with the Reference data type.  I normally think of a property with a type of Reference as something that will resolve to a single record.  And if identifiers aren't unique per system, then a reference property could resolve to multiple records.</p>",
        "id": 154005492,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1538592926
    },
    {
        "content": "<p>FHIR rules about canonical urls require Reference.reference to resolve uniquely.<br>\nHowever for Reference.identifier to resolve uniquely, the implementer has to make sure the system does not assign/contain duplicate business identifiers.</p>",
        "id": 154005508,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1538595743
    },
    {
        "content": "<blockquote>\n<p>You seem to indicate that identifiers do not need to be unique within the context of a specific system. However the current spec for the identifier data type says that they should be</p>\n</blockquote>\n<p>should be unique = do not need to be</p>",
        "id": 154005522,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538597519
    },
    {
        "content": "<p>Identifiers <em>should</em> be unique.  But there are various business reasons why they won't be - duplicate records, resource granularity is different than identifier granularity, errors, fraud, multiple versions with different resource instances</p>",
        "id": 154005539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538598334
    },
    {
        "content": "<p>The value SHALL be unique within the defined system and have a consistent meaning wherever it appears.</p>\n<p>Pasted from the link below....</p>",
        "id": 154005603,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1538606302
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/datatypes.html#Identifier\" target=\"_blank\" title=\"http://build.fhir.org/datatypes.html#Identifier\">http://build.fhir.org/datatypes.html#Identifier</a></p>",
        "id": 154005604,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1538606382
    },
    {
        "content": "<p>Right.  But that doesn't mean that it'll be unique in the server.  Only that it uniquely corresponds to a particular concept.  For example, US Social Security Number might still be associated with multiple Patient records.</p>",
        "id": 154005609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538617576
    },
    {
        "content": "<p>And the US SSN also re-assigns the SSN to different people, so the system may be an accurate representation of reality</p>",
        "id": 154006072,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1538682401
    },
    {
        "content": "<p>it's that \"SHALL\" I think that is tripping us up (vs. should with no qualifiers about real world issues)</p>",
        "id": 154006073,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1538682430
    },
    {
        "content": "<p>it's subtle but important:</p>\n<ul>\n<li>value SHALL be unique in the system</li>\n<li>it SHOULD only be associated with one thing</li>\n</ul>",
        "id": 154006096,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538684510
    },
    {
        "content": "<p>Isn't that a contradiction, though, Grahame? What does \"unique within the system\" actually mean if the second point means that it's cool for the same identifier to appear on more than one resource in a server?</p>",
        "id": 154006103,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1538685214
    },
    {
        "content": "<p>Frankly, I'm confused too...</p>",
        "id": 154006104,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1538685290
    },
    {
        "content": "<p>I do not think it's a contradiction</p>",
        "id": 154006106,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538685717
    },
    {
        "content": "<p>if you have a system, then the value SHALL be unique. That is, the issuer(s) of values within the systems must not ever issue the same value to identify to different things</p>",
        "id": 154006108,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538685826
    },
    {
        "content": "<p>e.g: if there's a system issuing driver's license numbers, it should never issue the same number more than once (to identify different people)</p>",
        "id": 154006112,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538686005
    },
    {
        "content": "<p>So, the US SSN doesn't follow that rule</p>",
        "id": 154006117,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1538686145
    },
    {
        "content": "<p>Or so I've been told... :)</p>",
        "id": 154006118,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1538686190
    },
    {
        "content": "<p>but when systems associate driver's license numbers with patient records, there's a few valid reasons why a single driver's license might actually  end up correctly associated with more than one patient record</p>",
        "id": 154006119,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538686199
    },
    {
        "content": "<p>the principle reason for this is the workflow between primary issuers of an identifier and secondary users</p>",
        "id": 154006120,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538686279
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <a href=\"https://www.ssa.gov/history/hfaq.html\" target=\"_blank\" title=\"https://www.ssa.gov/history/hfaq.html\">https://www.ssa.gov/history/hfaq.html</a></p>\n<blockquote>\n<p>Q20:  Are Social Security numbers reused after a person dies?<br>\nA:  No. [...]</p>\n</blockquote>",
        "id": 154006121,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1538686290
    },
    {
        "content": "<p><a href=\"https://www.pcworld.com/article/3004654/government/a-tale-of-two-women-same-birthday-same-social-security-number-same-big-data-mess.html\" target=\"_blank\" title=\"https://www.pcworld.com/article/3004654/government/a-tale-of-two-women-same-birthday-same-social-security-number-same-big-data-mess.html\">https://www.pcworld.com/article/3004654/government/a-tale-of-two-women-same-birthday-same-social-security-number-same-big-data-mess.html</a></p>",
        "id": 154006122,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1538686321
    },
    {
        "content": "<p>Interesting...</p>",
        "id": 154006123,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1538686335
    },
    {
        "content": "<p>yeah :)</p>",
        "id": 154006124,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1538686343
    },
    {
        "content": "<p>as for US SSN: I believe, from previous investigation of this, that it is in fact true that a few SSNs have been reused, and so, if we are to be pedantic, SSN is not a proper identifier. However I believe that these are considered an administrative mistake</p>",
        "id": 154006125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538686359
    },
    {
        "content": "<p>Grahame's comment above about primary vs. secondary users is a good one.  For example for MRNs, they would almost definitely be unique per system (ignoring active vs. historical in unmerge scenarios) when you are talking to the issuing system.  But if you are talking to a partner organization across the street that receives the MRNs via paper requisitions and has staff manually enter them, you might have duplicates.  So different systems may have different uniqueness confidence for the same identifier system.</p>",
        "id": 154006127,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1538686663
    },
    {
        "content": "<p>in V3, we introduced an actual attribute for this. No one ever used it, but it does exist as an extension in FHIR if anyone really wants it</p>",
        "id": 154006139,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538689364
    },
    {
        "content": "<p>Which attribute are you talking about?</p>",
        "id": 154006429,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1538764232
    },
    {
        "content": "<p>II.reliability</p>",
        "id": 154006462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538773505
    }
]