[
    {
        "content": "<p>Hi all, </p>\n<p>I did implement an MHD client and found out that it promotes the use of contained resources, see <a href=\"https://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_MHD.pdf\" target=\"_blank\" title=\"https://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_MHD.pdf\">https://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_MHD.pdf</a>, section 4.5.1 Metadata Object Types mapped to FHIR<br>\n...<br>\nSome Document Sharing Metadata attributes must be treated as ‘contained’ FHIR Resources.<br>\nThese are indicated using “Note 1”, and use of the word ‘contained’ in the Notes column of<br>\nTable 4.5.1.1-1. The details of the FHIR ‘contained’ mechanism is found at<br>\n<a href=\"http://hl7.org/fhir/STU3/references.html#contained\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/references.html#contained\">http://hl7.org/fhir/STU3/references.html#contained</a>.</p>\n<p>Reading <a href=\"https://www.hl7.org/fhir/domainresource-definitions.html#DomainResource.contained\" target=\"_blank\" title=\"https://www.hl7.org/fhir/domainresource-definitions.html#DomainResource.contained\">https://www.hl7.org/fhir/domainresource-definitions.html#DomainResource.contained</a> I find the description above controversial at least.</p>\n<p>Also, given that the FHIR specification provides clear alternatives through the search include mechanism in a reply Bundle, I am wondering if this was discussed before and couldnt be done in a more acceptable way.</p>\n<p>Is there anyone involved in the creation or review of the MHD profile that can comment on this?</p>\n<p>Thank you,</p>\n<p>Theo.</p>",
        "id": 153935788,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1518026350
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?</p>",
        "id": 153935789,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518026680
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192814\">@Theo Stolker</span> , most of us involved in MHD hang out on the <a class=\"stream\" data-stream-id=\"179223\" href=\"/#narrow/stream/179223-ihe\">#ihe</a> stream. </p>\n<p>However, the logic for use of contained resources is the need to provide a proxy for an XDS registry/repository. XDS metadata essentially has \"contained\" source patient, author, and institution content, and requiring creation of FHIR resources for this would complicate the proxy process. Further, the \"contained\" content is meant to be a snapshot in time (here's how we knew the patient when the document was published). Since FHIR doesn't have to support versioning, there is no other way to say here's the current patient info, and here's the old.</p>",
        "id": 153935790,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1518026742
    },
    {
        "content": "<p>Elliot already covered the ground...   Any Implementation Guide (aka IHE Profile) examines a use-case and provides constraints to meet that profile, and through those constraints avoid problems with interoperability. In the case of MHD, which is an API to a Document Sharing system, there is a use-case need to capture the values of the Patient Identity (demographics), and authors in a way that preserves what they were know as at publication, and thus what the Document content would be using to express these. Where as the main patient ID does point at a managed Patient resource, so that patient identity and demographics would float to current knowledge at all time. Thus overtime the DocumentReference has linkages to current and past, and that past linkage explains the content of the document. This is expressly important when dealing with documents from history. It is not very helpful with non-historic documents. The MHD Document Sharing space is focused on Healthcare Information Exchange longitudinally, so history is important.</p>",
        "id": 153935805,
        "sender_full_name": "John Moehrke",
        "timestamp": 1518029593
    },
    {
        "content": "<p>so it makes sense why constrained resources are allowed, but I read that they are required?</p>",
        "id": 153935833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518036179
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> , <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> !</p>\n<p>It might be useful to extend the documentation of <a href=\"https://www.hl7.org/fhir/domainresource-definitions.html#DomainResource.contained\" target=\"_blank\" title=\"https://www.hl7.org/fhir/domainresource-definitions.html#DomainResource.contained\">https://www.hl7.org/fhir/domainresource-definitions.html#DomainResource.contained</a> I to include the use cases intended to be covered here. </p>\n<p>At the same time I do not see why historical patient information is needed,  or why this couldn't have been solved by passing the Patient Resource with the DocumentReference in a Bundle. </p>\n<p>Anyhow, I really do appreciate the hard work on the m-profiles. </p>\n<p>Thanks</p>",
        "id": 153936176,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1518078264
    },
    {
        "content": "<p>Grahame, MHD use-case analysis comes to the conclusion that sourcePatientInfo needed to be contained to assure that it would NOT change over time. Using contained assured this. So I would agree that containment in general should not be manditory, but when a use-case requires it, then it should.</p>",
        "id": 153936241,
        "sender_full_name": "John Moehrke",
        "timestamp": 1518100031
    },
    {
        "content": "<p>There is a non contained Patient, it is the current Patient resource. One does NOT need to fill in the sourcePatientInfo... and it would seem really odd to have both sourcePatientInfo and Patient pointing at the same thing.</p>",
        "id": 153936242,
        "sender_full_name": "John Moehrke",
        "timestamp": 1518100072
    },
    {
        "content": "<p>so, ultimately there is a choice.. you can fill in sourcePatientInfo, or choose not to fill it out.... one always must point at an actively managed Patient</p>",
        "id": 153936248,
        "sender_full_name": "John Moehrke",
        "timestamp": 1518100108
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192814\">@Theo Stolker</span>, there is no reason that the FHIR documentation provided by HL7 should reference the MHD use case defined by IHE. There are many other implementation guides out there that FHIR ignores documentation; bringing them into the FHIR spec would cause it to be unweildly, subject to continual revision, and force HL7 to choose which IGs it wants to bless, and which to ignore. If the FHIR documentation is generally insufficient though, feel free to submit a change request (bottom of every page of the spec); if the MHD documentation is insufficient, please let IHE know, and we can look at improving.</p>\n<p>The historical patient information is needed because MHD is designed to be able to proxy between a FHIR server and an XDS environment. The XDS environment stores the historical patient data, so we need to be able to convey that in MHD. Whether XDS should convey that or not is a separate discussion, but MHD was written to meet that use case, and so the historical information is needed.</p>",
        "id": 153936385,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1518112089
    },
    {
        "content": "<p>The additional reason for the contained Patient for sourcePatientInfo is driven by the use-case for Cross-Enterprise and Cross-Community - Document Exchange. Where the contained Patient within the DocumentReference enables the thousands of document source systems to preserve their Patient description, independent of any centralized or federated Patient identity management system. Often there are thousands of organizations participating in a nationwide network, there is no way to create a unified Patient directory that maintains all versions of all Patients as known by those thousands of organizations. This contained mechanism overcomes this problem.</p>",
        "id": 153936389,
        "sender_full_name": "John Moehrke",
        "timestamp": 1518113319
    },
    {
        "content": "<p>I have a blog article from June 2016 that I think is still useful <a href=\"https://healthcaresecprivacy.blogspot.com/2016/06/mhd-why-use-of-fhir-contained.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2016/06/mhd-why-use-of-fhir-contained.html\">https://healthcaresecprivacy.blogspot.com/2016/06/mhd-why-use-of-fhir-contained.html</a></p>",
        "id": 153936390,
        "sender_full_name": "John Moehrke",
        "timestamp": 1518113412
    }
]