[
    {
        "content": "<p>I have seen some confusion regarding the Identifier data type and its use in implementation guides and in real world use. IGs often do not provide guidance on the requirements of Identifier elements, unless they belong to clearly defined and official identifier systems (such as the US NPI).</p>\n<p>The FHIR standards states “The value SHALL be unique within the system …”. However, the system (uri) has a cardinality of 0..1. </p>\n<p>The ambiguity arises around expressing local system business identifiers without a clearly defined system uri (or assigner resource) for internal system business identifiers. An example of this might be a claim number that is unique in context of a combination of attributes (such as the payer, plan, coverage type, etc.). In such a case, the claim number’s context may be clear by other data in the resource or the very nature of the interaction itself (a client may not understand the context of the identifier, but the source system/business would).</p>\n<p>Any thoughts on this? How do we effectively express and use business identifiers like this? How should systems that do not have an officially defined or locally managed systems express an Identifier type? How should IGs define use of Identifier elements?</p>",
        "id": 226755794,
        "sender_full_name": "Corey Spears",
        "timestamp": 1613613573
    },
    {
        "content": "<p>There's no requirement to include an Identifer.system - but if you don't have one, you can't do reliable matching because the value could correspond to <em>any</em> identifier namespace.  If a value is identifier in the context of multiple elements and you want to communicate it as a computably unique identifier, you must define a 'system' for that set of attributes - or alternatively construct a complex 'value' with some set of those elements.</p>",
        "id": 226756337,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613614174
    },
    {
        "content": "<p>Thanks Lloyd. I understand the situation where a computably unique identifier is needed, and completely agree. I am thinking of those situations where there is not yet so much rigor or maturity in defining these systems (URIs) by individual implementers/organizations, but the information is still useful (or required) for out-of-band non-computational use. For example, a call to a call center that, given a member number and coverage, can identify the context of a claim number to look up the right information. <br>\nOne could argue that such an organization could devise some sort of system uri, but there may be a cost/benefit question here for that organization.</p>",
        "id": 226760523,
        "sender_full_name": "Corey Spears",
        "timestamp": 1613618929
    },
    {
        "content": "<p>Sure.  You're free to just capture the Identifier.value and Identifier.type.text.  That gives enough for human-to-human communication.</p>",
        "id": 226761936,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613620722
    }
]