[
    {
        "content": "<p>I have a setup that includes a FHIR server and a FHIR client where the client is responsible for posting and updating resources on the server - e.g. a stream of recorded events . The organization that owns the server would like to know if the client is alive, which can be hard to tell if no new events have happened over a longer period of time. One proposal have been to let the client spawn a daemon process that continuously in a fixed interval posts 'heartbeat' resources to the server, which would then be a specific FHIR resource. While this not a bullet proof architecture, it does give some assurance of this given setup. I'm looking for comments/inputs to this, and I can imagine other people might also have this need.</p>",
        "id": 153888921,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1494410561
    },
    {
        "content": "<p>Why do a POST?  Why not do a simple GET - e.g. against the \"capabilities\" endpoint</p>",
        "id": 153888932,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494411570
    },
    {
        "content": "<p>The detail that I forgot to mention is that the client is basically shipping out events from a queue. What the the receiving part would like to know is if there is congestion/delay in the received events. This is why I would post a resource containing a timestamp from when this event was put into the queue.</p>",
        "id": 153888941,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1494411819
    },
    {
        "content": "<p>Then the server is able to calculate the delay itself</p>",
        "id": 153888943,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1494411856
    },
    {
        "content": "<p>I think that this is one of those things that is outside FHIR. Just define an end-point on your server like /ping and post an empty body to it</p>",
        "id": 153888962,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494413161
    },
    {
        "content": "<p>Or send an empty Bundle as a batch</p>",
        "id": 153888974,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494414083
    },
    {
        "content": "<p>FYI <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13050&amp;start=0\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13050&amp;start=0\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13050&amp;start=0</a></p>",
        "id": 153888978,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1494414229
    },
    {
        "content": "<p>Revisiting my original thought, a more clean strategy could be simply to use the HTTP header Date field reflecting the time of the generation of the message. It would then not require any custom FHIR stuff, but simply use the standards as intended</p>",
        "id": 153889010,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1494418319
    },
    {
        "content": "<p>I've must have been stuck in the HL7v2 thinking when I started thinking of this ... tsk tsk ...</p>",
        "id": 153889012,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1494418407
    },
    {
        "content": "<p>crap ... empty bundle's it is as the use of the header would only be able to inform whether there is congestion or not - the use of the header alone does not provide any value if nothing is sent</p>",
        "id": 153889023,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1494422220
    }
]