[
    {
        "content": "<p>I'm brainstorming potential solutions for <a href=\"http://jira.hl7.org/browse/FHIR-25174\">FHIR#25174</a> and I had a couple questions about search parameter expressions:</p>\n<ol>\n<li>Is there any rule (formal or informal) that all core searchparameters must have both an xpath and a fhirpath expression?</li>\n<li>Is there any rule (formal or informal) that all core searchparameters fhirpath expressions must be limited to \"SimplePath\" (a simple subset of FHIRPath)?</li>\n</ol>",
        "id": 201791229,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592950762
    },
    {
        "content": "<p>in this particular issue, the CDS group wanted to define a single search parameter which can search over their choice of either decimal (which maps to number) or Range (which maps to quantity) and so I was wondering if it might be possible to \"cast\" the decimal to a quantity within the search parameter expression</p>",
        "id": 201791423,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592950898
    },
    {
        "content": "<p>The search engine would likely need to canonicalize the units so that comparison is actually possible in many cases.</p>",
        "id": 201795298,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1592953426
    },
    {
        "content": "<p>in this particular case the unit is fixed to <code>%</code></p>",
        "id": 201796676,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592954535
    },
    {
        "content": "<p>which is why I thought it might be possible to do safely</p>",
        "id": 201796699,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592954559
    },
    {
        "content": "<p>I think they would have used a decimal range instead of Quantity Range if there were such a type...</p>",
        "id": 201796730,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592954589
    },
    {
        "content": "<p>at the request of committee, we opened a new issue <a href=\"http://jira.hl7.org/browse/FHIR-27875\">FHIR#27875</a> instead of re-opening <a href=\"http://jira.hl7.org/browse/FHIR-25174\">FHIR#25174</a> (seems the JIRA re-open process is set up for ballot-comment re-opens and thus has too-stringent rules).  Anyway, new tracker but same issue.</p>",
        "id": 201875732,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1593018527
    }
]