[
    {
        "content": "<p>Hi All,<br>\nI am new to chat.fhir, please guide me how better I can utilize it. Currently I need clarification on following question.<br>\nI want to understand when to use ExplanationofBenefit resource and ClaimResponse resource.</p>",
        "id": 231954429,
        "sender_full_name": "swapna v",
        "timestamp": 1616761156
    },
    {
        "content": "<p>Welcome to the community.  :)  You've already passed the first test in knowing to create a specific topic heading for your first question, so well done on that.  Other hints are to use the little 'gear' icon to sign up for other streams of interest and to use the search functionality to see what questions have already been asked.</p>\n<p>ClaimResponse is used to to convey the adjudication of a specific claim, prior authorization or predetermination.  ExplanationOfBenefits (EOB) provides a summary of all claims processed over a period of time (though it could be specific to a single claim).  ClaimResponse is generally sent to the provider who performed the Claim submission.  EOB is generally shared with the Patient.</p>",
        "id": 231961237,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616764362
    },
    {
        "content": "<p>Hey  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thank you so much.. May next doubt  is :  When we receive an ERA from a Payer, which resource should we use to store the response?</p>",
        "id": 231987362,
        "sender_full_name": "swapna v",
        "timestamp": 1616773670
    },
    {
        "content": "<p>I <em>think</em> PaymentReconciliation.  <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span>?</p>",
        "id": 231990879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616774931
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"400759\">@swapna v</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> The corollary to ERA would be a ClaimResponse as it contains the adjudication details and optionally payment information if you are making actual payments per claim. The PaymentReconciliation supports the Payments for claims, such as bulk payments to providers, and the distribution of that amount across a number of claims: e.g. a payment of $100 with $40 for claim #1, $35 for claim #16 and #25 for claim #21.</p>",
        "id": 231994459,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1616776305
    }
]