[
    {
        "content": "<ul>\n<li>\n<p>We are creating a brand new application in EHR domain. The client has requested the application to be FHIR compliant. While reading more we discovered FHIR is mainly used for interoperability between systems.</p>\n</li>\n<li>\n<p>As the system is a prototype and not have much of the resource data (it may become a full fledge EHR in future). Do we really need to create each resource in our system. We prefer to keep it simple without adding overhead of the difficult structure? In future if any system/client requires FHIR data from our system, we can always build FHIR compliant API from the existing system data.</p>\n</li>\n</ul>",
        "id": 153975257,
        "sender_full_name": "Kristian Ray",
        "timestamp": 1531567035
    },
    {
        "content": "<p>\"FHIR Compliant\" isn't a terribly useful request.  You can be \"FHIR conformant\" if you just expose a \"metadata\" endpoint that declares that you can't send or receive any FHIR content of any sort.  I'm pretty sure that's not what your client is looking for though.  It's probably best to have a conversation with your client to get a better sense of exactly looking for - and at what point in the system's release cycle they're going to be necessary.  Key questions are what types of data your system may need to consume from others, what types of data your system may need to produce for others and what sort of workflow interactivity might be relevant.  You might also want to look at SMART on FHIR, CDS Hooks and, if US-based, Argonaut for functionality that may be of interest.</p>",
        "id": 153975266,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531588597
    },
    {
        "content": "<p>Thanks Lloyd! I did find guidance in SMART indicating that Refresh tokens SHOULD be set ti expire within 24 hrs. But I'm left wondering whether most within the FHIR community concur?</p>",
        "id": 153975269,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1531589019
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"194675\">@Doug Bulleit</span> , fyi - the recommendation that refresh tokens last no longer than 24 hours is being removed from the spec. I think you're exactly right that the FHIR community did not concur. See <a href=\"https://groups.google.com/forum/#!topic/smart-on-fhir/Lu6l1Ico_U0\" target=\"_blank\" title=\"https://groups.google.com/forum/#!topic/smart-on-fhir/Lu6l1Ico_U0\">https://groups.google.com/forum/#!topic/smart-on-fhir/Lu6l1Ico_U0</a> and <a href=\"https://github.com/HL7/smart-app-launch/pull/243/files\" target=\"_blank\" title=\"https://github.com/HL7/smart-app-launch/pull/243/files\">https://github.com/HL7/smart-app-launch/pull/243/files</a>.</p>",
        "id": 153975509,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1531767656
    }
]