[
    {
        "content": "<p>All - dealing w/a mapping question, wondered if people might have an answer as to what's intended:</p>\n<p>Is there a standard for distinguishing between \"inexact\" match and \"wider/narrower\" match in concept mapping?<br>\n<a href=\"https://www.hl7.org/fhir/valueset-concept-map-equivalence.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-concept-map-equivalence.html\">https://www.hl7.org/fhir/valueset-concept-map-equivalence.html</a></p>\n<p>Reason I ask:<br>\nWe (McKesson Clear Value Plus) have terms that seem in grey area between these. Example: We're mapping our (source) \"Colon Cancer Stage at Diagnosis: Stage IIA\" to NCI Thesaurus (target) \"Stage IIA Colon Cancer.\" Would folks consider that \"wider\" or \"inexact?\"<br>\nSupport for \"wider:\" Target includes all Stage IIA colon cancers; ours is a specific (at diagnosis) Stage IIA colon cancer.<br>\nSupport for \"inexact:\" Target concerns stage without any information re: temporal/sequential/contextual info; ours specifies \"at diagnosis,\" a part of the meaning external to NCIt concept.</p>\n<p>Some instances are obviously wider/narrower (e.g., a general Stage II Colon Cancer is wider than Stage IIA Colon Cancer); this is one where, depending on what we're thinking at a particular point, we might go either way. Any guidance as to how absolute the boundaries are would be deeply appreciated. <img alt=\":simple_smile:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/simple_smile.png\" title=\":simple_smile:\"></p>\n<p>(In case anyone's interested, the NCI Thesaurus concept:<br>\n<a href=\"https://ncit.nci.nih.gov/ncitbrowser/ConceptReport.jsp?dictionary=NCI_Thesaurus&amp;code=C115041\" target=\"_blank\" title=\"https://ncit.nci.nih.gov/ncitbrowser/ConceptReport.jsp?dictionary=NCI_Thesaurus&amp;code=C115041\">https://ncit.nci.nih.gov/ncitbrowser/ConceptReport.jsp?dictionary=NCI_Thesaurus&amp;code=C115041</a> )</p>",
        "id": 153893447,
        "sender_full_name": "Thomas Wicker",
        "timestamp": 1497376235
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 153893477,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497377440
    },
    {
        "content": "<p>(or anyone else? :) )</p>",
        "id": 153893598,
        "sender_full_name": "Thomas Wicker",
        "timestamp": 1497393142
    },
    {
        "content": "<p>I would call that inexact. In general, if it is not specifically 'narrower', in that the semantic space of the 2 concepts overlaps without one completely containing the other, then it is an inexact mapping</p>",
        "id": 153893606,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497393901
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -- thanks; we're going w/your answer from here (makes a lot of sense). Would it be appropriate to submit request for <a href=\"https://www.hl7.org/fhir/valueset-concept-map-equivalence.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-concept-map-equivalence.html\">https://www.hl7.org/fhir/valueset-concept-map-equivalence.html</a> to include examples/more detail around wider, inexact, etc.? Would be happy to volunteer to work on that, since we're in middle of implementing equivalences.</p>",
        "id": 153893720,
        "sender_full_name": "Thomas Wicker",
        "timestamp": 1497445285
    },
    {
        "content": "<p>sure that would be good. add suggested text to the task</p>",
        "id": 153893721,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497445656
    },
    {
        "content": "<p>I agree with Grahame's reasoning, but using it I arrive at a different conclusion.  From my reading of the descriptions I think that the semantic space of \"Colon Cancer Stage at Diagnosis: Stage IIA\" is completely contained within \"Stage IIA Colon Cancer\".  \"Colon Cancer Stage at Diagnosis: Stage IIA\" has the additional temporal qualification of \"at diagnosis\", and any instance of it is also an instance of \"Stage IIA Colon Cancer\", so I think that a mapping of \"wider\" in this case is entirely appropriate.</p>",
        "id": 153893875,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1497477097
    },
    {
        "content": "<p>but the cancer might now be at stage III. Or in remission. The qualifier 'at diagnosis' is more significant to me. (but good that we agree about the principles ;-) )</p>",
        "id": 153893893,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497479321
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> re: \"might now be\" -- exactly how this came up. For our system (Clear Value Plus, an oncology CDS system), current stage is more important than stage at Dx. For colon cancer specifically, <em>when</em> we care about stage, it's pathologic (post-surgical, well after diagnosis) stage. So we're going w/inexact &amp; explaining our reasoning in the equivalence comments <em>(since all this really does is help external parties understand why we did what we did so they can determine if their understanding of ConceptX matches ours well enough to map)</em>.</p>",
        "id": 153894006,
        "sender_full_name": "Thomas Wicker",
        "timestamp": 1497540547
    },
    {
        "content": "<p>Basically, by using \"inexact,\" we're hoping to flag the term for external mappers to say, \"You'll want to closely check this mapping because it loses some of our meaning\" -- same as a \"narrower\" mapping would. Might be that they're ok w/that (e.g., if theirs is also Stage at Dx &amp; we're the only system they integrate with), might be that it's a problem; this just helps them determine that <em>(we hope)</em>. </p>\n<p>Same reason we're explaining \"wider\" maps and not just narrower/inexacts; if you're sending us information, and your concept is equal to a concept that's wider than ours (and especially if we end up mapping one wider target concept to several of our source concepts), if we return the info to you, we might not return the correct value <em>or</em> we might misinterpret what you meant.</p>\n<p>Thanks, all!</p>",
        "id": 153894008,
        "sender_full_name": "Thomas Wicker",
        "timestamp": 1497540985
    },
    {
        "content": "<p>Yes, there is this \"temporal shift\" aspect which I wasn't addressing in my response.  But, thinking about it further, I'm still not sure if that makes the \"inexact\" mapping to \"Stage IIA Colon Cancer\" the best one.  I think it may matter whether we consider what we are mapping to be a reference to the instance of the tumor which was characterized as \"Colon Cancer Stage at Diagnosis: Stage IIA\", or a reference to the diagnosis itself.  Following on with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s example, if we are thinking of the tumor instance, which may progress over time (and if we either do not know or are not considering information about the current stage), then the only thing that you really know for sure is that it is a \"Colon Cancer\" (whether in the same or a different stage or in remission), and a mapping to a concept of \"Colon Cancer\" (not further qualified) would be the best - and that mapping, I think, would still be \"wider\".  If, on the other hand, we're looking at the diagnosis itself as an independent entity, then whatever happens with the instance at a later time isn't really relevant, and in that case I think that the \"wider\" mapping to \"Stage IIA Colon Cancer\" would still be the best one.  This is tricky.  If I'm still missing something, let me know what you think it is.</p>",
        "id": 153894259,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1497648561
    },
    {
        "content": "<p>well, this is something that comes up - the mapping depends on context as much as the underlying meaning of the codes. This is why ConceptMaps are always qualified by a value set (as a proxy for context)</p>",
        "id": 153894261,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497648673
    },
    {
        "content": "<p>I will also grant that <span class=\"user-mention\" data-user-id=\"192544\">@Thomas Wicker</span>'s last point about using \"inexact\" as a flag to alert downstream mappers/users that they need to pay attention because meaning may be lost is probably legitimate, and may hold sway here.</p>",
        "id": 153894262,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1497648932
    },
    {
        "content": "<p>Agree, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> </p>",
        "id": 153894263,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1497648957
    }
]