[
    {
        "content": "<p>Lloyd and I are arguing about <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12637\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12637\">GF#12637</a>. The task proposes the removal of the sentence \"Timing schedules are not used for recording when things did happen, but when they are expected or requested to occur\", so that Timing can (magically) be used for recording when things did happen. </p>\n<p>But to actually remove that sentence, a lot of definitions need to be updated (e.g.  definitions of Timing, the requirements, the comments, and the same for the elements Timing.repeat, Timing.repeat.count, Timing,repeat.timeOfDaym, Timing.repeat.when). And examples added. And probably a new element added to express mood. Also,l  think this is *bad* idea (I wasn't there when it was discussed).</p>\n<p>So I have refused to remove that sentence, and referred the task back to the committee (MnM). Which means that this task won't make the STU3 cut-off. </p>\n<p>And that leaves Procedure.performedTiming as illegal- though it already is illegal, since it doesn't conform to it's own definition. </p>",
        "id": 153871507,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487125452
    },
    {
        "content": "<p>It also leaves MedicationStatement.dosageInstruction.effectiveTiming as of questionable legality as this will often be used not to convey \"how were you instructed to take it\" but \"how did you take it\" as MedicationStatement is frequently used to capture over-the-counter and even illicit substances where no instructions were provided.  (And even if instructions were given, MedicationStatement is intended to reflect what did actually happen/is actually happening, not what was supposed to happen.)</p>",
        "id": 153871531,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487134420
    },
    {
        "content": "<p>It's not clear that a new element to convey the mood is needed - the mood should be implicit in the use of the data type.  I.e. the element would need to indicate whether it's an intended timing or an actual timing.</p>",
        "id": 153871532,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487134481
    },
    {
        "content": "<p>It would be helpful if you could indicate the reasons why you feel it's a bad idea.  Certainly there are use-cases for discretely capturing the frequency, duration, min-max repetitions, alignment and offset from meals, etc. for things like exercise and medications that have happened in the past or are currently ongoing.</p>",
        "id": 153871533,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487134558
    },
    {
        "content": "<p>I mis-typed.  It's MedicationStatement.dosage.timing.  And the description is explicit that the information indicates how the medication *was* taken, so it's definitely about the past.</p>",
        "id": 153871534,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487134665
    },
    {
        "content": "<p>well, MedicationAdministration is a deeper mess then. <br>\nMedicationAdministration.dosage: Details of how medication was taken<br>\nDosageInstruction: How medication should be taken</p>\n<p>I had interpreted this as 'the instructions the medication were taken according to', which is not the same. And how to reconcile MedicationAdministration.period vs DosageInstruction.timing? I thought it was clear, but to me, the definition of MedicationAdministration.dosage is wrong and impossible. </p>\n<p>Further, all the definitions of DosageInstruction follow Timing: \"this is what you should do\"; it has the same problem if you just wantonly use it to be 'this is what we did do'</p>",
        "id": 153871536,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487135794
    },
    {
        "content": "<p>I think that using Timing for what did happen is overkill. So far, I'm aware of:<br>\n- this event happened at a given time<br>\n- this event happened over a time interval<br>\n- this event happened on a given day, relative to an event (e.g. evening, or breakfast, etc)</p>",
        "id": 153871537,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487135894
    },
    {
        "content": "<p>This isn't about MedicationAdministration - it doesn't use Timing.  MedicationStatement does.  If you're talking about medications and other things like certain physiotherapies, how often matters.  And \"how long\" can matter too.  Essentially, if it matters on the request side, then it matters on the event side.  The reason it matters is because these resources are used to capture summaries of event patterns, not just discrete individual events.  MedicationAdministration lets you say \"on this date, at this time I gave drug x\".  MedicationStatement lets you say \"I take this med 2-3 times a day with meals\" or \"I run for 30-45 minutes every morning before breakfast\".  If you want decision support to evaluate the adherence of the event behavior to the order behavior, then the event timing needs to be captured discretely.</p>",
        "id": 153871539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487138463
    },
    {
        "content": "<p>Agree that DosageInstruction needs to be recast to allow it to reflect both \"instruction\" and \"behavior\"</p>",
        "id": 153871540,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487138490
    },
    {
        "content": "<p>MedicationStatement not MedicationAdministration. Made the mistake once and copy/pasted it</p>",
        "id": 153871541,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487138948
    },
    {
        "content": "<p>\"These resources are used to capture summaries of event patterns\" - that pretty clearly is *not* the stated scope of Procedure, and it would be nice if that was more clearly stateed in the definition of MedicationStatement. The definition of Procedure makes it aligned tightly with MedicationAdministration. </p>",
        "id": 153871542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139021
    },
    {
        "content": "<p>it might be useful to consider this difference in the event pattern itself, btw. </p>",
        "id": 153871543,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139070
    },
    {
        "content": "<p>I do not like data types that cross moods. The definitions are messy, because the elements that apply to both get screwy definitions, and some elements only apply to one mood, and not the others. </p>",
        "id": 153871544,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139114
    },
    {
        "content": "<p>Well, Procedure is currently an amalgamation of a detailed procedure record and a \"statement-like\" structure.  It doesn't do either terribly well.  There's a proposal to split it in STU 4.  The detail would be useful within surgical and other systems, and the \"statement\" would be useful for capturing medical history and patient summary information.</p>",
        "id": 153871545,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139162
    },
    {
        "content": "<p>Most of our data types cross moods.</p>",
        "id": 153871546,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139175
    },
    {
        "content": "<p>also, I'm far from convinced that you can meaningfully say 'over this year, I took this medication at the following times' as opposed to 'for this year, I took this medication per the following instructions'</p>",
        "id": 153871547,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139180
    },
    {
        "content": "<p>All the other time data types cross moods.</p>",
        "id": 153871548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139193
    },
    {
        "content": "<p>such as?</p>",
        "id": 153871549,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139197
    },
    {
        "content": "<p>no they are mood independent </p>",
        "id": 153871550,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139201
    },
    {
        "content": "<p>date</p>",
        "id": 153871551,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139202
    },
    {
        "content": "<p>time</p>",
        "id": 153871552,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139204
    },
    {
        "content": "<p>Right.  And we want this to be mood independent too.</p>",
        "id": 153871553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139216
    },
    {
        "content": "<p>I don't believe in that .</p>",
        "id": 153871554,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139226
    },
    {
        "content": "<p>anyway, you're basically making up stuff you wish to be true irrespective of the stated definitions. </p>",
        "id": 153871555,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139242
    },
    {
        "content": "<p>I think pharmacy will have to sort out the definitions urgently</p>",
        "id": 153871556,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139257
    },
    {
        "content": "<p>With MedicationStatement, we don't care what the instuctions were - we care about what the patient's actually doing.  If we cared about the instructions, we'd send a copy of the order.</p>",
        "id": 153871557,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139277
    },
    {
        "content": "<p>I'm talking about the use-cases I've seen the work groups discuss.</p>",
        "id": 153871558,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139293
    },
    {
        "content": "<p>that's not how you read it when it says 'dosage instructions'</p>",
        "id": 153871559,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139300
    },
    {
        "content": "<p>But it doesn't say that</p>",
        "id": 153871560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139330
    },
    {
        "content": "<p>I'm pretty sure \"DosageInstructions\" means 'dosage instructions'</p>",
        "id": 153871561,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487139363
    },
    {
        "content": "<p>Element is Medication.dosage, definition \"Details of how medication was taken\".  It's just that the type happens to be labeled DosageInstruction.</p>",
        "id": 153871562,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139372
    },
    {
        "content": "<p>The semantics come from the element, not the type</p>",
        "id": 153871563,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139382
    },
    {
        "content": "<p>(Though the type ought to be labeled in a more agnostic way)</p>",
        "id": 153871564,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139399
    },
    {
        "content": "<p>Anyhow, I'll be quiet for a bit and wait for <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> and some of the others more directly involved with these resources to say their piece.</p>",
        "id": 153871565,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487139470
    },
    {
        "content": "<p>well, the type says \"How medication should be taken\".  and the definition states that this granularity should only be populated when the medicationStatement is derived from scheduled dosage instructions (in a labeled container, or from a request)</p>",
        "id": 153871571,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1487155167
    },
    {
        "content": "<p>there is no guarantee that the medication in a statement was taken as per the instructions.</p>",
        "id": 153871572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1487155254
    },
    {
        "content": "<p>medicationStatement is kind of aligned with the mess that most systems do when capturing \"medication lists\".  (i.e. ixing orders and events in one flat line)</p>",
        "id": 153871573,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1487155317
    },
    {
        "content": "<p>all the medication event resources handle the event timing in a different way, instead of using dosageInstructions. I'd say that statement should also do the same, and not reuse the dosageInstructions for that. Or otherwise make it clear that one thing is the dosageInstruction and the other tihing is the actual dose.</p>",
        "id": 153871575,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1487155689
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> The element definition does make clear that it's reflecting actual use, not instructions.  But the fact the type is called \"DosageInstructions\" rather than \"Dosage\" is certainly a source of confusion.</p>",
        "id": 153871623,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487182857
    },
    {
        "content": "<p>I see the confusion here. Maybe it would be better to call the type \"Dosage\" and to call the element in MedicationRequest &amp; Medication Dispense \"DosageInstructions\"?</p>",
        "id": 153871633,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1487184434
    },
    {
        "content": "<p>Changing the type name to dosage.</p>",
        "id": 153871733,
        "sender_full_name": "Melva Peters",
        "timestamp": 1487195525
    },
    {
        "content": "<p>Patient Care will discuss how to handle Procedure tomorrow (Thurs, Feb 16 at 5pm Eastern).  I believe there are use cases to document a procedure of \"attended counseling once a week\" or \"exercised 3 times a week for 30 minutes\" especially in context of CarePlan.activity.outcomeReference, which can reference a Procedure. </p>",
        "id": 153871754,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487202540
    },
    {
        "content": "<p>Patient Care voted today to remove Procedure.performedTiming and instead add an extension for Procedure.schedule.  I've applied those changes tonight.<br>\nCC:  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> </p>",
        "id": 153872213,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487298906
    },
    {
        "content": "<p>thanks</p>",
        "id": 153872218,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487300303
    },
    {
        "content": "<p>We talked about Observation needing more of a fuzzy effective time than a timing element.  code + offset.  Should I make an standard extension for that?  so can record things occuring  at bedtime or half an hour before dinner.</p>",
        "id": 153872230,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487303900
    },
    {
        "content": "<p>I think you should, yes. </p>",
        "id": 153872232,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487304255
    }
]