[
    {
        "content": "<p>Hi, sorry, me again,<br>\nOur Medications Management application runs CDS prior to creating a medication order in the database. When a 3rd party application Posts a MedicationRequest we also perform the same CDS processing. It's quite clear from the documentation that we need to return any CDS errors to the 3rd party application via the DetectedIssue resource but we are not 100% how we should use it.<br>\nIf we have a drug to drug interaction for example and the medications interacting have been posted as 2 MedicationRequests in a bundle we intend to create a DetectedIssue for each MedicationRequest with a reference pointing to the other medication.<br>\nWe have a couple of issues, firstly, when we return the response to the post do we return the Bundle and link the DetectedIssue(s) to the relevant MedicationRequests or do we return the Bundle including the DetectedIssue(s) within the MedicationRequest?<br>\nWe understand that if the 3rd party application retries the Post the have the DetectedIssue and Mitigation included in the MedicationRequest but are not sure if we are allowed to / supposed to include the DetectedIssue.<br>\nThe other issue is that until we create the Medication Order in our DB we do not have an identifier for the MedicationRequest so we are not sure how we are supposed match the resubmitted request if we do not assign an identifier.<br>\nAny help greatly appreciated as always.</p>",
        "id": 153900099,
        "sender_full_name": "Julia Davis",
        "timestamp": 1501656738
    },
    {
        "content": "<p>what's the bundle? a transaction?</p>",
        "id": 153900102,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501660341
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Hi Grahame, sorry I got dragged off on other things. Yes, this would be a transaction as we would expect all CDS warnings to be mitigated against all the relevant MedicationRequests before we would create / update any of the \"orders\" in the application.</p>\n<p>Cheers</p>\n<p>Julia</p>",
        "id": 153901388,
        "sender_full_name": "Julia Davis",
        "timestamp": 1502326485
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194026\">@Julia Davis</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> If I understand correctly, this is happening as part of processing a POST of a MedicationRequest resource, and that if there are detected issues, they will prevent the server from actually creating the order. In that case, you'd have to return an error status and an OperationOutcome indicating the result, right?</p>",
        "id": 153903257,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1503420892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"bryn@databaseconsultinggroup.com\" data-user-id=\"53\">@Bryn Rhodes</span> Rhodes Hi Bryn, yes our intention is to return an OperationOutcome notifying that the POST transaction failed and including the actual clinical issues with the MedicationRequest in DetectedIssues.</p>",
        "id": 153903318,
        "sender_full_name": "Julia Davis",
        "timestamp": 1503442204
    },
    {
        "content": "<p>So how will the DetectedIssue resources be made available to the calling application? Would they be included as \"contained\" resources in the OperationOutcome you return? Or would the calling application need to make a separate request to retrieve the DetectedIssues?</p>",
        "id": 153903320,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1503442991
    },
    {
        "content": "<p>We are planning on including the DetectedIssue(s) as \"contained\" resources when we return the MedicationRequest and OperationOutcome. Although we are not sure (hence my original post) if this is allowable or if it is only the calling application that can include the DetectedIssue and associated Mitigation as contained resources in the resubmitted MedicationRequest</p>",
        "id": 153903326,
        "sender_full_name": "Julia Davis",
        "timestamp": 1503446179
    },
    {
        "content": "<p>I can see them being returned as part of the OperationOutcome, or even on the MedicationRequest, but if they are on the MedicationRequest, you'd then have to include that in the OperationOutcome as well, so it may be cleaner to only return them in the OperationOutcome. As far as how to reference the MedicationRequest from the DetectedIssue, you could use an identifier on the MedicationRequest and have the reference from the DetectedIssue be by identifier.</p>",
        "id": 153903415,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1503498497
    }
]