[
    {
        "content": "<p>In a recent discussion, someone mentioned the use of Composition as an entry point to request individual resources from the server. However, the documentation seems to suggest that Composition should always be used as part of a Bundle to create a Document; a Document is a Bundle that provides a \"snapshot\" of the resources at the time of creation.<br>\nDoes anyone have prior experience with the Composition resource being used this way? Is it expected that a Composition resource is sent \"alone\", without a Bundle?</p>",
        "id": 203002363,
        "sender_full_name": "Stephan Opdenberg",
        "timestamp": 1594048568
    },
    {
        "content": "<p>that's not the only expected use of Composition. It's one thing you can do with it</p>",
        "id": 203044558,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594071971
    },
    {
        "content": "<p>there are other ways to use Composition - used more, say, like EN 13606, which seems aligned with what you are talking about</p>",
        "id": 203044595,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594072005
    },
    {
        "content": "<p>Thank you for your reply Grahame. I'll have a more in depth look into EN 13606, since it does indeed look like its aligned with this discussion</p>",
        "id": 203082129,
        "sender_full_name": "Stephan Opdenberg",
        "timestamp": 1594113640
    },
    {
        "content": "<p>While we are on the Compositon resource topic.  CMS has the DPC Api which allows Organizations to request claims data for Patients in the care.  First an organization must attest that a certain Practitioner in the Organization has a treatment relationship with a Patient.  This process is called attribution.  The FHIR resources used to document the attribution are Group (which associates the Practitioners and Patients through the attributed to and member objects) and Provenance (which holds the attestation).  Could this also be done with a Composition resource?</p>",
        "id": 203379616,
        "sender_full_name": "Richard Braman",
        "timestamp": 1594298140
    },
    {
        "content": "<p>not in the same sense - Composition is bout the editorial process, not the actual statement of content</p>",
        "id": 203380141,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594298512
    }
]