[
    {
        "content": "<p><strong>Question</strong>:  <br>\nAs it pertains to <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17169\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17169\">GF#17169</a>, should Meta.tag or Request.intent be used to convey that an order is authoritative vs non-authoritative?  This distinction is critical because there can be different business rules around authoritative and non-authoritative orders.  For example, an authoritative order will probably have far more required fields than a non-authoritative historical/recorded order.  Additionally, there are presumably more restrictions around who can modify authoritative orders (and when).</p>\n<p><strong>Using Meta.tag</strong></p>\n<ul>\n<li>'authoritative' could be considered orthogonal to 'intent' (e.g. non-authoritative order, non-authoritative plan)</li>\n<li>tags can be applied to resources more broadly (e.g. it isn't limited to *Request resources)</li>\n<li>tags can be changed without breaking digital signatures</li>\n<li>tags are <em>not</em> considered a modifier element</li>\n<li>consider changing Meta.tag binding strength to extensible (to enforce consistency of codes used)</li>\n<li>mitigate risk of being overlooked by adding examples and documentation (to both request pattern + resource notes section)</li>\n</ul>\n<p><strong>Using Request.intent</strong></p>\n<ul>\n<li>intent <em>is</em> a modifier element</li>\n<li>intent is more visible \"face up\" when viewing the resource specification, which makes it less likely to be overlooked</li>\n</ul>\n<p><strong>Background context</strong>:<br>\nUsing pharmacy as an example...</p>\n<ul>\n<li>In DSTU2, there was a MedicationOrder resource, which was scoped narrowly to “authorizations to dispense” only.  </li>\n<li>In STU3, the scope (and name) of MedicationOrder changed to MedicationRequest to accommodate more than just “authorizations to dispense.”  </li>\n<li>The Request.intent element was introduced with definition </li>\n</ul>\n<blockquote>\n<p>Indicates the level of authority/intentionality associated with the {{title}} and where the request fits into the workflow chain\"</p>\n</blockquote>\n<p>Note that MedicationStatement is NOT equivalent to a non-authoritative prescription/order. The MedicationStatement is intended to represent what the patient said they are <em>actually</em> doing.  By contrast, the MedicationRequest is intended to represent what the patient <em>should</em> be doing regardless of whether the request is authoritative (e.g. MedicationRequest can include the non-authoritative representation of an order from an external provider/system OR an over the counter medication.)</p>\n<p><strong>Feedback Welcome</strong><br>\nPlease share your thoughts - including additional pros/cons we may have missed.</p>",
        "id": 153975588,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1531777180
    },
    {
        "content": "<p>Also see <a href=\"#narrow/stream/48-terminology/subject/Extensible.20bindings.20when.20data.20type.20.3D.20Coding\" title=\"#narrow/stream/48-terminology/subject/Extensible.20bindings.20when.20data.20type.20.3D.20Coding\">https://chat.fhir.org/#narrow/stream/48-terminology/subject/Extensible.20bindings.20when.20data.20type.20.3D.20Coding</a></p>",
        "id": 153975611,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531784234
    },
    {
        "content": "<p>why would we put this in a tag? Do we want this to change without changing the signature? That sounds off to me...</p>",
        "id": 153975616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531785445
    },
    {
        "content": "<p>The same record is authoritative on one system and non-authoritative when it's stored on another system.  All the other information remains the same and the signature could (and should) remain valid when moving from one to the other.  (The same approach is taken with the \"actionable\" tag - it's actionable when you send it to pharmacy A, but not when you cc it to pharmacy B and C.)</p>",
        "id": 153975619,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531787023
    },
    {
        "content": "<p>It's also an assertion you can make about pretty much any resource.</p>",
        "id": 153975620,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531787043
    },
    {
        "content": "<p>The point of making the binding of meta.tag extensible is to support shared work-flow. It seems to me that work-flow should be specified in implementation guides rather than in base resources. So this binding should remain example in the FHIR resources, but be extensible in most implementation guides.</p>",
        "id": 153975628,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1531794153
    },
    {
        "content": "<p>The core specification isn't defining what workflows must be used, only standardizing some of the components that can be used in workflows.  It wouldn't make sense for different jurisdictions to come up with different tags that convey that a resource is actionable or authoritative.  That's also a general requirement that's going to be relevant across a wide variety of jurisdictions and use-cases.  If we were to push it into an international-level IG, it would be just as binding as if it were in the core specification.</p>",
        "id": 153975629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531795715
    },
    {
        "content": "<p>we don't need an extensible binding for this, actuall.y</p>",
        "id": 153975630,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531795852
    },
    {
        "content": "<p>we can just make rues about particular tags in narrative.</p>",
        "id": 153975631,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531795887
    },
    {
        "content": "<p>but on the whole I agree with Richard - we can define tags, and it's for IGs to mandate them</p>",
        "id": 153975632,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531795914
    },
    {
        "content": "<p>I agree it's for IGs to mandate them.  But I think it's reasonable to say that if we standardize the meaning of a tag at the international level, it's inappropriate for a downstream IG to define a different tag for the same purpose - that's what we're trying to avoid.</p>",
        "id": 153975634,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531795979
    },
    {
        "content": "<p>And the purpose of the extensible binding would be to do that.</p>",
        "id": 153975635,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531795990
    },
    {
        "content": "<p>that's not an extensible binding thing. that's something else</p>",
        "id": 153975636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531795998
    },
    {
        "content": "<p>I don't think the tags are the right place for this functionality.  First, I am concerned that tags have historically not been critical to the function of the Resource, they are 'meta'. This use-case seems to indicate that this specific tag is critical to understanding of the Resource.  <br>\nWe also have all kinds of exclusion rules around meta, such as the signature exclusion Grahame mentioned; or the fact that Versioning doesn't happen when meta is changed... <br>\nCould this be done with a second Resource that carries the meaning of authority? When it is communicated, it expresses the authority explicitly being conveyed, when it is not present then the original Resource is simply data.</p>",
        "id": 153975748,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531831889
    },
    {
        "content": "<p>The tag doesn't change the understanding of the resource - a prescription is a prescription is a prescription.  Tags do change what you can do with a resource.  Security tags affect who can see or change a resource.  Other tags can impact workflow.  No one has to support a particular tag, but if you've agreed to support a particular tag, paying attention to it is going to be vitally important.</p>",
        "id": 153975756,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531833708
    },
    {
        "content": "<p>Meaning of authority in some other resource would be super dangerous.</p>",
        "id": 153975757,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531833731
    },
    {
        "content": "<p>Resources need to stand alone</p>",
        "id": 153975758,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531833745
    },
    {
        "content": "<p>But not all statements are prescriptions. And the signature worries me: if a doctor <em>didn't</em> intend something as an authorization to dispense, but the tag is flipped, the signature won't detect that. This means another system could receive this as an actual authorization to dispense from that physician.</p>",
        "id": 153975759,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1531833810
    },
    {
        "content": "<p>Flipping tags is problematic no matter what.  Flipping a tag from \"highly restricted - assigned GP only\" to \"public test data\" would be an equally bad thing.  Tags contain stuff that drive data access and workflow - they're pretty important elements.  The signature reflects the contents of the prescription as authored.  When you pass the data around, whether the recipient is allowed to dispense or not is going to vary.  Even if the initial prescription was sent to a pharmacy intended to dispense, that pharmacy might then pass the prescription along to someone else - e.g. a payor or another pharmacy.  The pharmacy itself might need to flip the tag to \"not actionable\" in its local store if it's transferred the prescription elsewhere (whether using FHIR or by fax).</p>",
        "id": 153975764,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531834538
    },
    {
        "content": "<p>the problem is that the fact that a resource is authoritative is contextual - it's not a property of the resource itself</p>",
        "id": 153975850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531862552
    },
    {
        "content": "<p>Right - and we generally put contextual things in tags.  (Similar to how the resource is \"restricted\" on my system but \"normal\" on your system.)</p>",
        "id": 153975862,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531863153
    },
    {
        "content": "<p>I don't think these are the same concepts. The fact that the word \"authoritative\" is used, does not make it a \"Security Access Control\" concept. It seems that what was described was more of a business layer workflow enabling some action to begin.  I might very well be convinced, I am not that much against it... I just don't think that the original thread request is being fully engaged in this discussion.</p>",
        "id": 153975930,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531882316
    },
    {
        "content": "<p>ON the topic of \"Is this observation authorized by an authoritative individual\", this is not a Access Control decision, this is a fact of Provenance. It might be satisfied by Observation.performer (lightweight provenance), or might need full strength Provenance resource.  <br>\nI am just thinking that this is closer to Provenance concept of authoritative, than it is to Security Access Control</p>",
        "id": 153975933,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531882473
    },
    {
        "content": "<p>tag != security label</p>",
        "id": 153975934,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531882489
    },
    {
        "content": "<p>I am fully willing to accept that, like Provenance, there is a light weight flavor and a full strength Resource.</p>",
        "id": 153975935,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531882505
    },
    {
        "content": "<p>I'm not suggesting that tags are security labels.  But tags and security labels work the same way - outside the signature, live in metadata and define expectations around how the data is going to be used.  Security tags around permissions and tags around workflow.  Both are important and should not be ignored.  Both require negotiation between partners around which ones will be supported and how they'll be used.</p>",
        "id": 153975955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531885468
    },
    {
        "content": "<p>My point was that it's not inappropriate to put \"very important information\" in a tag any more than it's inappropriate to put such information in a security label.</p>",
        "id": 153975956,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531885519
    },
    {
        "content": "<p>and my point is that by definition the Meta.tag the tag can't have an effect on the meaning of the resource..</p>\n<p>Meta.tag<br>\nElement Id  Meta.tag<br>\nDefinition  <br>\nTags applied to this resource. Tags are intended to be used to identify and relate resources to process and workflow, and applications are not required to consider the tags when interpreting the meaning of a resource.</p>",
        "id": 153976313,
        "sender_full_name": "John Moehrke",
        "timestamp": 1532004510
    },
    {
        "content": "<p>how does the meaning of the resource change?</p>",
        "id": 153976314,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532004968
    },
    {
        "content": "<p>authorized or not authorized.... that is my understanding of what this vocabulary is saying. (or to pull from the other thead on the same topic \"Authorized because my boss said so.\" --- or something like that)</p>",
        "id": 153976317,
        "sender_full_name": "John Moehrke",
        "timestamp": 1532005251
    },
    {
        "content": "<p>my understanding is that sometimes this tag value will be on the exact same Resource for various intent. It will be used to communicate to the pharmist to go ahead and dispense, where as everyone else will see it without this tag value not present and understand it simply as a statement of facts found in the resource... same resource content, just a different tag value.... that seems to violate the \".. are not required to consider the tags when interpeting the meaning of the resource\"</p>",
        "id": 153976318,
        "sender_full_name": "John Moehrke",
        "timestamp": 1532005410
    },
    {
        "content": "<p>depends what you think meaning is. the tricky thing here is that meaning is not a property of the resource, but the context it is in</p>",
        "id": 153976322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532006129
    },
    {
        "content": "<p>The meaning of \"Patient is prescribed 100mg Tylenol BID\" is the same whether the copy you have locally is \"for reference\" or \"intended to be dispensed\".  Exactly the same instance (with the same digital signature) on two different systems could be \"for reference\" on one system and \"intended to be dispensed\" on a different system.</p>",
        "id": 153976343,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532010727
    },
    {
        "content": "<p>The meaning hasn't changed.  The workflow expectations have.</p>",
        "id": 153976344,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532010763
    },
    {
        "content": "<p>I think I still lean towards using Request.intent.  The non-authoritative version isn't always a copy from the source of truth -- meaning the authenticity and veracity greatly varies depending on whether it is THE order to be dispensed or just documented hearsay (when it's patient reported).</p>",
        "id": 153976359,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1532013502
    },
    {
        "content": "<p>Here is a specific example illustrating when meaning changes:  When an authoritative request is documented, maybe we follow the guidance in the spec (as it exists today) that says:  If nothing is specified substitution may be done.  However, for a non-authoritative request, I don't think I'd be so bold because nothing specified can mean the patient doesn't recall whether substitution is allowed.</p>",
        "id": 153976360,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1532013647
    },
    {
        "content": "<p>One example of non-authoritative is recorded as patient-hearsay.  Another is a record is forwarded from another system as a \"FYI\".  The former will likely differ from the original order.  The latter could well be identical - down to the signature.  The differentiation needs to handle both.</p>",
        "id": 153976363,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532014228
    },
    {
        "content": "<p>There's no argument that the business rules you would use for authoritative and non-authoritative would be different.  That's the point.  Tags on resources can change what business rules apply.</p>",
        "id": 153976365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532014264
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> I wonder what you mean 'use Request.intent' since that's just a pattern?</p>",
        "id": 153976482,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532032765
    },
    {
        "content": "<p>It would be MedicationRequest.intent or ServiceRequest.intent, etc. - same solution for all Request resources.  (Which doesn't much help with authoritative vs. not for non-Request resources.)</p>",
        "id": 153976492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532033202
    },
    {
        "content": "<p>Pharmacy had requested a new value added to Intent - called \"reported\".  That's what started this discussion.</p>",
        "id": 153976774,
        "sender_full_name": "Melva Peters",
        "timestamp": 1532053140
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I agree with what Lloyd and Melva clarified -- I meant adding a new code in the intent value set, which is used by MedicationRequest.intent (which is what started all this).<br>\nI believe this distinction is a modifier (intent is a modifier whereas tags are not modifiers).  It changes how an end user interprets empty elements (e.g. implicit no refills and implicit substitution allowed -- versus -- unknown refills and unknown substitution allowed)</p>",
        "id": 153976850,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1532090895
    },
    {
        "content": "<p>I'm not sure I follow the domain logic, but if you're right, haven't you answered your own question?</p>",
        "id": 153976851,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532091115
    },
    {
        "content": "<p>I haven't convinced <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , who advocates for tags, which is why we started this discussion thread...</p>",
        "id": 153976852,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1532091189
    },
    {
        "content": "<p>Nothing in the definition of MedicationRequest implies that the record is authoritative.  So by our definition, I don't think that's a modifier.  (In fact, based on our new understanding of isModifier, it may be that even Request.intent isn't a modifier as the resource definitions now make clear that requests are proposal, plan or order.  </p>\n<p>From a signature perspective, I don't see that you'd want to break the signature if you had a non-authoritative copy.</p>",
        "id": 153976862,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532095827
    },
    {
        "content": "<p>This conversation sort of stalled.  From a \"modifier\" perspective, the copy of a prescription being actionable or not doesn't break the definitions of prescription as defined.  Nothing in the definition of MedicationRequest says that it's the record of something actionable (and adding that would be rather problematic for a lot of the uses of the resource).  I don't understand Grahame's initial reluctance to put this sort of thing in tag.  And it would be good to land this before the ballot if we can...</p>",
        "id": 153980343,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533147048
    },
    {
        "content": "<p>So far, most of the arguments <em>against</em> this seem to be around forwarding on requests and having them become \"statements\" in the other system (I would hope there was a way to indicate this intent on the resource). How does one determine whether the system is sending me what use to be a MedicationOrder (indicated authorization to dispense/take) vs a MedicationStatement? If it's not a field changing on the resource, you're assuming the receiver somehow \"knows\" this based on other setup/config vs. first class in the representation of the resource.</p>",
        "id": 153980345,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1533148667
    },
    {
        "content": "<p>In addition, for systems that will be communicating intent to authorize dispense as well as historical records, I have no way (if using a tag) to confirm that the message was not modified in flight to flip the authorization.</p>",
        "id": 153980346,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1533148732
    },
    {
        "content": "<p>You have no way of knowing \"in flight\" whether a tag was flipped from \"actionable\" to \"not-actionable\" or \"restricted\" to \"test data public access\" either.  If you're concerned about tags changing inappropriately, it's possible to have signatures that encompass the tags too.  Data isn't put in tags because \"it's unimportant\".  It's put in tags because it's information that's expected to change as the data is moved from system to system or based on workflow expectations independently from the \"signed\" core of the resource.</p>",
        "id": 153980348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533149791
    },
    {
        "content": "<p>If we forget about medications for a second, lets look at this with lab orders.  If you have a copy of a ServiceRequest on your system, that doesn't necessarily imply that it's an active order intended to be fulfilled.  It could be a \"FYI\" copy of an order someone else wrote and sent to you, or that was included with a referral or CDA document or something like that.  There's no \"MedicationStatement\" equivalent in that space, but the need is the same.  We agree that there needs to be an element on the order that tells you whether it's authoritative or not.  The question is whether that's an \"intent\" or a \"tag\".  The rationale for tag is: <br>\n- it lets you distinguish authoritative from non-authoritative without losing whether something is a plan/intent/order (or whether it's a placer/filler or reflex order)<br>\n- it allows the signature to be retained on the record as it's sent from a system where it's authoritative to one where it won't be<br>\n- it allows for systems that can \"transfer\" custody of orders to be clear about what's happening - i.e. the authoritative copy is no longer the authoritative copy because another system now owns and is making the authoritative updates<br>\n- it's consistent with how we flag whether an order is \"actionable\" or not - that's also done with tags<br>\n- the notion of authoritative vs. non-authoritative record is not specific to orders - it holds with events, definitions and even entities (e.g. organizations, devices).  The tag solution scales to all of them</p>\n<p>The primary rationale against tags is:<br>\n- tags are burried and are perceived as unimportant/ignorable information</p>\n<p>I don't think that perception is accurate or safe.  I agree that if we do go the tag route, we're going to need to make a concerted effort to change that perception.</p>",
        "id": 153980350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533150338
    },
    {
        "content": "<p>I think there is a big distinction between using intent (modifier) versus tags (not a modifier).  My best example of why I believe it is a modifier is around how you interpret empty elements or \"default\" values.  </p>\n<ul>\n<li>Authoritative orders with empty MedicationRequest.substitution defaults to a meaning of substitution allowed = <strong>true </strong>per the comment in the spec that says </li>\n</ul>\n<blockquote>\n<p>If nothing is specified substitution may be done</p>\n</blockquote>\n<ul>\n<li>Non-authoritative \"hearsay\" with empty MedicationRequest.substitution defaults to a meaning of <strong>unknown </strong>substitution allowed</li>\n</ul>",
        "id": 153980357,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1533153206
    },
    {
        "content": "<p>so it sounds like you are proposing another tag type 'intent' that operates similar to what Lloyd outlines, but also has the meaning of expressing the intent for this copy... I like that far better than Lloyds overloading of the existing tag that clearly indicates it can be ignored.  is tis a Resource specific element? or do you see this applying to all Resources and thus would go down where meta is?</p>",
        "id": 153980358,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533153409
    },
    {
        "content": "<p>I would ask that you separate the concept of provenance authority, from the more intent based concept.   There is already two ways to carry provenance authority: ( 1 ) Provenance, and ( 2 ) meta.security  with the vocabulary <a href=\"http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html\">http://build.fhir.org/v3/SecurityIntegrityObservationValue/vs.html</a>  -- see UNRELIABLE, CLINAST, DEVAST, PATAST, SDMAST, etc...</p>",
        "id": 153980362,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533153718
    },
    {
        "content": "<p>I think, based on our new definition of modifier, that Request.intent isn't a modifier anymore either.  The definitions of MedicationRequest, ServiceRequest, etc. all acknowledge that the resource might be a plan, proposal or order.  As such, the value in intent doesn't cause the meaning to violate the expectation of the definitions in the resource.</p>",
        "id": 153980512,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533160591
    },
    {
        "content": "<p>Having distinct business rules for the value of an element doesn't make it a modifier.  You may have very different rules for human patients vs. animal patients - but subject isn't a modifier.</p>",
        "id": 153980514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533160643
    },
    {
        "content": "<p>You could have a tag that prohibits editing of a resource by anyone other than the author.  That wouldn't be a modifier.</p>",
        "id": 153980516,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533160679
    },
    {
        "content": "<p>Bringing this back to try to get it landed.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, what is the issue with using a tag to distinguish authoritative vs. non-authoritative (given that we already use tag to differentiate \"actionable\" vs. not)?</p>",
        "id": 153995417,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536605441
    },
    {
        "content": "<p>did I say it was?</p>",
        "id": 153995422,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536605975
    },
    {
        "content": "<p>You weren't thrilled with it.  If you've changed your mind - great :)</p>",
        "id": 153995483,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536607613
    },
    {
        "content": "<p>It was me that was not thrilled. My concern is less given where things are going. However I am wondering why we would use a general solution (tags) that exist in all resources to support a functionality needed in some. Why not make that functionality appear where it is needed, and be visible as first-class element in those resource?</p>",
        "id": 153995497,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536608603
    },
    {
        "content": "<p>Because it <em>is</em> needed in almost all resources.  The need to say \"this is non-authoritative\" applies to all orders, to protocols (i.e. PlanDefinitions), Encounters, Procedures, Immunizations and lots of other events and definitions.  It could even apply to something like Group.</p>",
        "id": 153995499,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536608753
    },
    {
        "content": "<p>That's one of the reasons for the proposed solution.  The other is that it works well with signed data that gets moved from an authoritative server to a non-authoritative server, we don't break the signature</p>",
        "id": 153995528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536610192
    },
    {
        "content": "<p>okay, that is the part that made me less worried...</p>",
        "id": 153995536,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536610407
    },
    {
        "content": "<p>I'm worried that the part of the request that tells a server how to process the data <em>isn't</em> part of the signature, when (especially for meds) a \"statement\" from a patient has historically been treated as a separate concept than the actual requests that authorize dispense/carry physician authority. Would need to delve more into the international meds requirements and electronic transfer to understand implications of that.</p>",
        "id": 153995602,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618051
    },
    {
        "content": "<p>well, I share jenni's concern, but I think it goes further for me: whether something is authoritative or not is often not a property of the thing, but of the reference to the thing</p>",
        "id": 153995603,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536618103
    },
    {
        "content": "<p>I think it can <em>also</em> be that</p>",
        "id": 153995604,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618191
    },
    {
        "content": "<p>but when the source of both an authoritative order and a statement can be \"born\" in the same system for the first time... that's harder to get to a reference.</p>",
        "id": 153995605,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618227
    },
    {
        "content": "<p>That came out confusing...</p>",
        "id": 153995606,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618232
    },
    {
        "content": "<p>IE, I'm a meds management app that both a patient and a physician can sign into</p>",
        "id": 153995607,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618250
    },
    {
        "content": "<p>the store of the data is a single system</p>",
        "id": 153995608,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618258
    },
    {
        "content": "<p>That app needs to create, for the first time ever, the record that the patient is taking something w/o prior auth (required or not: eg, illegally or otc) AND the med that the doc authorized</p>",
        "id": 153995609,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618295
    },
    {
        "content": "<p>So it needs to create the \"thing\" to be referenced for both cases?</p>",
        "id": 153995610,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618318
    },
    {
        "content": "<p>but then you have to go look somewhere else to find out what that data means?</p>",
        "id": 153995611,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618336
    },
    {
        "content": "<p>A lot of what Lloyd talks about assumes the transfer from 2 systems is involved, and that there's a source somewhere with an authoritative authorization</p>",
        "id": 153995612,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618425
    },
    {
        "content": "<p>at least, if I'm following that concern around why we want the tag correctly</p>",
        "id": 153995613,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618566
    },
    {
        "content": "<p>I also think there's some confusion around what \"authoritative\" means - technically the patient is authoritative (in most cases) about what they put into their body, but the physician is authoritative in what can legally be dispensed?</p>",
        "id": 153995615,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618723
    },
    {
        "content": "<p>well, physician + pharmacist or whatever laws hold true in the country :)</p>",
        "id": 153995616,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618783
    },
    {
        "content": "<p>Would really love to see input from some other implementers to see if I'm an oddity here :)</p>",
        "id": 153995617,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1536618934
    },
    {
        "content": "<p>You can choose to sign tags if you want to.  There are reasons to sign tags  and security labels.  But there are reasons not to sign them too.  Tags and security labels can often change as data migrates between systems.  What's authoritative on system \"A\" is <em>not</em> authoritative on system \"B\".  If you're concerned about bad actors messing around with security labels or tags, then you'll want a signature on them too, but that's not usually an issue for most systems.</p>\n<p>You don't have to look elsewhere to find out what the data means - the tag is in the instance.  Authoritative means the official source-of-truth record.  And for an order, that never comes from the patient.  In terms of a medication statement, then yes the patient's PHR is probably the source of truth.</p>",
        "id": 153995638,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536628418
    },
    {
        "content": "<p>Now I am back confused... are we talking about authoritative in the way Lloyd just described? Because THAT is Provenance. are we talking about this in the way Jenni described? because THAT is workflow. I am not sure what we are talking about. The less clear, the less sure I am that there is a use-case to be worked on that hasn't already a home. If a use-case has a home, we should be careful about creating another alternative home without clear differentiation of why the two homes for that use-case exist.</p>",
        "id": 153995693,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536668831
    },
    {
        "content": "<p>When you copy a record from one system to another, you can produce a non-authoritative record from an authoritative record.  The relationship between them is Provenance.  But the derived record still needs to be marked and it has impact on workflow.  Provenance is not sufficient for that.</p>",
        "id": 153995712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536671540
    }
]