[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> : feedback on UserSession:<br>\n- let's just change identifier to 0..1 and see what happens<br>\n- I don't follow how a session can have one status, <em>with a source</em>.<br>\n- I don't follow workstation as a CodeableConcept. I don't know where else we've misused a code for something like this. Let's just change it now<br>\n- let's fix value to value[x] now</p>",
        "id": 153919882,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510797968
    },
    {
        "content": "<p>focus remains very confusing for me; it blurs the boundary of live vs stored in a way we haven't seen on any other resource</p>",
        "id": 153919883,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510798001
    },
    {
        "content": "<p>Yeah, I'm not clear on status either, I suggested it be defined just as status and source as top-level elements. <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> any thoughts?</p>",
        "id": 153919911,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510820426
    },
    {
        "content": "<p>well there's 2 different issues - why does status have a source? and if it has a source, does that imply that different sources can have different statuses? and why is there a backbone element - but there are cases where we do that just for logical grouping</p>",
        "id": 153919916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510820950
    },
    {
        "content": "<p>I actually really liked focus, and we've been talking about adding focus as a general feature to knowledge resources (as a type element at the definition level) because it lets you talk about what the artifact is \"about\" (e.g. a measure's focus is implicitly Patient now, but we'd like to be able to say it's Organization for structure measures).</p>",
        "id": 153919917,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510821013
    },
    {
        "content": "<p>On status having a source, from the comments in the specs I was working from, it's a way to prevent looping in a bi-directional sync, but that implies it's the source of the UserSession information, not the source of the status, so the grouping doesn't really make sense.</p>",
        "id": 153919919,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510821136
    },
    {
        "content": "<p>well, the focus here is different to the focus you'd have on knowledge resources</p>",
        "id": 153919921,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510821196
    }
]