[
    {
        "content": "<p>Hi all.<br>\nIs there a resource which i can send condiential data like user/password?<br>\nThanks!</p>",
        "id": 226150861,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1613143611
    },
    {
        "content": "<p>Can you explain a little more about your use case?</p>",
        "id": 226151667,
        "sender_full_name": "David Pyke",
        "timestamp": 1613143885
    },
    {
        "content": "<p>Its a smart app that recibes a certificate from the EHR, and the medic has to sign it. To sign it, he must put his user and password.</p>",
        "id": 226152881,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1613144383
    },
    {
        "content": "<p>The user and password are located in the EHR database</p>",
        "id": 226153000,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1613144409
    },
    {
        "content": "<p>As FHIR doesn't have encryption in the resources, sending the userid/password in a FHIR resource would be a problem, unless you encrypt it prior to placing it in the resource.  However, there are no specific resources for this kind of information.  You would need to create an extension on one of the standard resources to hold it.</p>",
        "id": 226155711,
        "sender_full_name": "David Pyke",
        "timestamp": 1613145579
    },
    {
        "content": "<p>FHIR is a REST data model for healthcare information.  It is intended to be used within a general IT security model. The most common is OAuth based, for which there is an Implementation Guide from HL7 in smart-on-fhir. Please see the Security and Privacy pages in the FHIR core specification for more guidance <a href=\"http://hl7.org/fhir/secpriv-module.html\">http://hl7.org/fhir/secpriv-module.html</a></p>",
        "id": 226164739,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613149348
    },
    {
        "content": "<p>Most EHRs will probably be very unwilling to accept a password for a user via FHIR.  Just because you implement an option for sending a password over the wire, I wouldn't expect most EHRs would (or should) accept it.  I'd suggest looking at other options for communicating a signature rather than sending clear-text passwords.</p>",
        "id": 226164946,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1613149423
    },
    {
        "content": "<p>Would suggest taking a look at <a href=\"https://hl7.org/fhir/smart-app-launch/\">https://hl7.org/fhir/smart-app-launch/</a> if you need to connect a user to an EHR system from within a 3rd paty app</p>",
        "id": 226178234,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1613155012
    },
    {
        "content": "<p>As a general point, not specifically FHIR-related, moving user names and passwords around in a software stack not specifically designed (and tested) for security purposes (identity and authentication) is highly undesirable, and unlikely to get past any serious security audit. Supporting the point made by <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>, I would suggest looking at other options designed for the purpose.</p>",
        "id": 226566488,
        "sender_full_name": "Colin E.",
        "timestamp": 1613505053
    },
    {
        "content": "<p>SCIM - <a href=\"http://www.simplecloud.info/\">http://www.simplecloud.info/</a></p>",
        "id": 227542986,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614137648
    }
]