[
    {
        "content": "<p>Hi all,</p>\n<p>Aetna is working on the Authentication and Consent piece of Patient Access API. We are wondering what others are using as expiry times for their user tokens. Token granted at the time of authentication, before we force the user to re-authenticate.  I did a few searches on Zulip and couldn't find a consensus. I think it is up to the implementers to decide, but wanted to see what others are doing.</p>\n<p>Thanks in advance<br>\nJoel</p>",
        "id": 199891226,
        "sender_full_name": "Joel Hansen (Aetna)",
        "timestamp": 1591370136
    },
    {
        "content": "<p>CMS uses 10 hours (on the long side), Anthem uses 30 minutes (maybe too short), anything between those two should be good. Longer are a little bit riskier security-wise obviously.<br>\n(You support refresh tokens I assume?)</p>",
        "id": 199907226,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591377160
    },
    {
        "content": "<p>We use 60 minutes.</p>",
        "id": 200099960,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1591624407
    },
    {
        "content": "<p>I'd avoid providing IG-specific advice on this point. Would refer to the <a href=\"http://hl7.org/fhir/smart-app-launch/\">SMART authz guide</a> (which today says \"Access tokens SHOULD have a valid lifetime no greater than one hour.\").</p>",
        "id": 200122744,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591633575
    },
    {
        "content": "<p>and indeed the strong preference is to support refresh tokens, to keep the access tokens short-lived without interrupting the user to re-authenticate.</p>",
        "id": 200123084,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591633736
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> , <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Thanks so much for the replies. We had proposed 24hours but that sounds like it's waaay too long of t ime. Will probably look at the 60 minute time.</p>\n<p>Joel</p>",
        "id": 200414350,
        "sender_full_name": "Joel Hansen (Aetna)",
        "timestamp": 1591795034
    },
    {
        "content": "<p>Sure thing. And yeah, I would definitely recommend steering clear of specifying anything that you don't need to in a particular guide. Or if you want to say something, keep it at the level of advice and not requirements.</p>",
        "id": 200417262,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591796543
    },
    {
        "content": "<p>Our company has decided to implement a validity period of 3 months for refresh token (long lived) before user is asked to authorize again.  The 3rd party apps would use this refresh token to request for new access tokens (short lived) when it expires</p>",
        "id": 202261629,
        "sender_full_name": "Suma Addagadde",
        "timestamp": 1593388482
    }
]