[
    {
        "content": "<p>Is userSelected exclusively meant for communicating a selection from a human being as the end user? </p>\n<p>For example - if a human being selected a visit type from a drop-down and that type determined the visit class that was recorded in the system based on the actions of the human user- would that be excluded for userSelected as an inferred value (even though it was entirely driven by a clinician selection)?</p>\n<p>I ask because Visit types and classes can be sanitized/re-coded/translated for a variety of reasons both inside and outside the hospital- it would be nice to have a mechanism to communicate that the coding for something like encounter class was in fact the original coding for decided at point of care.</p>",
        "id": 239120220,
        "sender_full_name": "Sheridan Cook",
        "timestamp": 1621269005
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 239133372,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621274357
    },
    {
        "content": "<p>From the spec: </p>\n<blockquote>\n<p>There is some ambiguity about what exactly 'directly chosen' implies</p>\n</blockquote>",
        "id": 239149579,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621281217
    },
    {
        "content": "<p>Our system mostly aggregate data coming from other systems and we use userSelected to mean 'this is the original code we got' as opposed to codes we added via mappings or other data enrichment functions</p>",
        "id": 239154598,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1621283196
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179166-implementers/topic/userSelected.20-.20have.20to.20be.20a.20human.20user.3F/near/239154598\">said</a>:</p>\n<blockquote>\n<p>Our system mostly aggregate data coming from other systems and we use userSelected to mean 'this is the original code we got' as opposed to codes we added via mappings or other data enrichment functions</p>\n</blockquote>\n<p>Thanks Michele! This is the exact scenario I was curious about. Can I ask what you do if the originating source provides more than one coding for a CodeableConcept (i.e. local code and snomed code for the same concept)... Both userSelected in that case?</p>\n<p>From Grahame's message it sounds like there is flexibility in this approach. I'd hate to add an extension if there was an element that could reasonably be used to communicate the concept.</p>",
        "id": 239155783,
        "sender_full_name": "Sheridan Cook",
        "timestamp": 1621283675
    },
    {
        "content": "<p>If we receive multiple codes from the source they are all going to have userSelected=true in our implementation</p>",
        "id": 239163057,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1621286804
    }
]