[
    {
        "content": "<p>Hi,<br>\nBelow is mu Question on usage of coverage,CoverageEligibilityRequest/Response</p>\n<p>Should i be using coverage or CoverageEligibilityRequest/Response if i want to expose coverage data that i got from eligibility lookup (using EDI..etc)?</p>\n<p>Thanks<br>\nRavi</p>",
        "id": 164039209,
        "sender_full_name": "Ravindra Kondiparthi",
        "timestamp": 1556062387
    },
    {
        "content": "<p>Coverage will provide indication that coverage exist.  EligibilityResponse will indicate whether a patient is eligible for coverage.</p>",
        "id": 164040757,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556064099
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\ncan you confirm my below understanding<br>\n coverage will say if i have vision coverage but my eligibility response will say if i am eligible to use vision coverage(incase if i have exhausted my covered dollar amounts then i am not eligible)</p>",
        "id": 164041133,
        "sender_full_name": "Ravindra Kondiparthi",
        "timestamp": 1556064567
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 164067796,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1556100006
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192272\">@Ravindra Kondiparthi</span> Coverage would provide the administrative details of an insurance coverage, eg. identify the insurer, covered party, network, plan etc. The CoverageEligibilityRequest/Response may be used to ask the insurer whether the supplied Coverage is still in-force (has not been cancelled) and optionally request details of the types of benefits provided (vision, dental, medical, drugs etc).</p>\n<p>The ability to get back your benefits and benefit balance, amounts used or remaining,  is new and not supported by most other eClaims standards so most insurers still don't support this feature. Typically if you want to know what your insurance will pay if you receive service or product 'X' then your provider will submit a preauthorization, or in some cases a predetermination, listing 'X' and the providers change for 'X' and the insurer will respond indicating whether the service is covered and to what amount.</p>\n<p>If you have used up your funds this is typically a temporary thing and your annual accumulators will reset at the beginning of the next policy year - so you remain at all times eligible but your benefit amount may be $0.</p>",
        "id": 164068400,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1556100726
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> for the explanation.<br>\nGoing back to my original question what resource/resources would you recommend for us if i am building a api for our consumers that would return their coverages and benefits information.</p>",
        "id": 165122436,
        "sender_full_name": "Ravindra Kondiparthi",
        "timestamp": 1557273897
    }
]