[
    {
        "content": "<p>When referring to community services, a \"Reason for Referral\" field is usually open style narrative/free text.  e.g., \"pt is experiencing social distress, is at a risk for falls and has been advised by a friend that this is a useful service\"</p>\n<p>Can i use ServiceRequest.reasonCode.text to hold this free text, or should I only be using reasonCode if i am applying some kind of code system to the reason?</p>",
        "id": 153943625,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1520712755
    },
    {
        "content": "<p>It's totally fine to use CodeableConcept.text if all you have is free text.</p>",
        "id": 153943626,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520717253
    },
    {
        "content": "<p>That is music the my ears ...</p>",
        "id": 153943627,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1520725231
    },
    {
        "content": "<p>Unless it is specifically disallowed. In situations where coded data is expected then often you aren't permitted to make up a code which doesn't already exist in the codeset nor are you generally permitted to send text in place of a code. It depends on the use case, profile, IG and/or community of use. It depends more on what the users of the resource are expecting - if a machine is receiving and triaging based on an expected code then it likely isn't readying your text, but if the information is being presented to a human with a code, if supplied, and the text if not or to augment the code then using the text would work for your intended purpose.</p>",
        "id": 153944181,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1520920063
    },
    {
        "content": "<p>That's true of any element.  FHIR doesn't require <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a>, but lots of implementations to.  From a FHIR compliance perspective, CodeableConcept with no codings is fine.  Some implementations may demand codings.  Some may throw them away.</p>",
        "id": 153944322,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520939888
    }
]