[
    {
        "content": "<p>How do I express the fact that a patient is a selfpayor or another person (parent) covers for the costs. It's still a Coverage. But Coverages can only be issued by Organizations, not by people... </p>",
        "id": 153816074,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1458214493
    },
    {
        "content": "<p>Sorry that isn't a coverage, that is a guarantor or simply as payee. Coverage is an insurance policy or equivalent which pays for health costs (claims).</p>",
        "id": 153816108,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1458226355
    },
    {
        "content": "<p>A patient would have an account with a provider, or not if it is is retail health transaction. The provider would provide goods or services and then: if there is Insurance(s) send the billable items as a claim to the insurers until there is no balance remaining or all coverages have been used, then if a balance remains they would charge the patient or guarantor(s).</p>",
        "id": 153816109,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1458226524
    },
    {
        "content": "<p>Often the provider will during the provision of goods and service generate one or many charge transactions which will go against the patient account. These charges are not ncesessarily what the patient is billed - sometimes the patient is billed for a 'service' which is a portion of a service or the billed item accumulates multiple procedures. Sometimes charges which have been collected for inventory or cost accounting purposes are not actually passed on to the patient. Sometimes the provider is billing for 'a natural uncomplicated delivery' or roster billing (the patient is covered by my service and billed for that regardless of whether they actually received care this month) where the billing bears little or not relation to services rendered.</p>",
        "id": 153816111,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1458226784
    },
    {
        "content": "<p>I think the question remaining then is - how do you convey the Guarantor for a particular Account?</p>",
        "id": 153816139,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458236041
    },
    {
        "content": "<p>Should be a subclass containing it in Account - if not it needs to be added (although you will find many systems with that info in their Patient file).<br>\nJust checked, guarantor isn't there it should be guarantor 0..* Reference(Patient|Organization|RelatedPerson) </p>\n<p>(although just Patient and Organization is cleaner and doesn't attract the issue that: an account may cover multiple patients (a family) and if you say RelatedPerson then you have to declare which Patient they are related to then do you have to create an instance of teh RelatedPerson for each person in the account which the guarantor is guaranteeing...?)</p>",
        "id": 153816214,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1458241011
    },
    {
        "content": "<p>The account resource is still in its infancy, and both PA and FM are working together to move it forward. (Have had joint sessions that past 2 WGMs on it)</p>",
        "id": 153816387,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1458265357
    },
    {
        "content": "<p>I know there was a reason, why we (the Germans) never used guarantor even back in V2. I think the semantics between saying \"I will *cover* for the extra fee for single room and TV myself\" is very different from saying \"I act as an guarantor for the whole amount due in case no one else pays\", but I am not sure whether that was the reason.  I will investigate...</p>",
        "id": 153816811,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1458469213
    },
    {
        "content": "<p>Definition of Guarantor: \" A guarantor is a person who guarantees to pay for someone else's debt if he or she should default on a loan obligation. \".  -definitely something different from a Selfpayor. It wouldn't even make sense for a person to be their own \"guarantor\". </p>",
        "id": 153819138,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459361949
    },
    {
        "content": "<p>Although I admit, the term \"selfpayor\" doesn't cut it either as the person covering for some fees or surcharges might as well be a parent or a related person...</p>",
        "id": 153819140,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459362036
    },
    {
        "content": "<p>So... \"Payor\" it is. :)</p>",
        "id": 153819142,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459362053
    },
    {
        "content": "<p>Payor is typically someone who is adjudicating a charge (claim) against the terms and conditions of a financial contract (insurance) - therefore it may pay all to none - they do not guarantee payment.</p>",
        "id": 153819418,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1459442428
    },
    {
        "content": "<p>A guarantor is responsible for the balance outstanding regardless of the services/goods rendered - so they pay up to a capacity.</p>",
        "id": 153819419,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1459442567
    },
    {
        "content": "<p>Any balance outstanding after the payor has correctly applied their rules is NOT the responsibility of the payor but is always the responsibility of the guarantor.</p>",
        "id": 153819420,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1459442668
    },
    {
        "content": "<p>So the patient, or their parent/guardian etc., is the implied guarantor - you are ultimately responsible for any balances outstanding regarding You..</p>",
        "id": 153819421,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1459442925
    },
    {
        "content": "<p>@Simone: I was just looking at the Patient resource and currently Guarantor is a Contact on Patient.</p>",
        "id": 153821719,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460633219
    },
    {
        "content": "<p>I still don't see how that answers the question of \"how do I model  Coverage, if the covering party is a person and not an organisation\"...</p>",
        "id": 153821727,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460636322
    },
    {
        "content": "<p>I'm sorry but I didn't see that question, and I'm not understanding your question: do you mean if the Guarantor is an organization or if the party paying directly for service is a person? (Coverage referes to insurance only.)</p>",
        "id": 153821728,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460636896
    },
    {
        "content": "<p>All charges (financial transactions) for an individual will go to an account. typcially for a person or a family. The Account resource contains the Patient(s) whom the account is for and the Patient resource lists the guarantors in addition to the Patient who is the first party responsible for payment of the account.</p>",
        "id": 153821730,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460637216
    },
    {
        "content": "<p>I would think that Account might want to link to the person who's promised to pay for the account, not just the Patient.  E.g. the mother or father for an infant.  Sending a bill addressed to Baby Jones isn't going to make a hospital popular.</p>",
        "id": 153821807,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460646135
    },
    {
        "content": "<p>And overloading Patient.contact as a primary means of carrying financial information seems risky.  Patient.contact is primarily about next-of-kin type uses.  If you want to make a specific financial assertion, I'd tie that explicitly to Account.</p>",
        "id": 153821808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460646186
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Yes, the question is: What if a person agrees to pay certain fees or surcharges( e.g. for special treatments or amenities) out of his own pocket or someone agrees to do so for another person. This is not a default like \"everything left in the account  that's not covered by any insurance goes to the guarantor \" but rather an agreement upfront ... I'd say that's a coverage, because it  <em>covers</em> a predefined set of services that might be detailed in a referenced contract. The existance of a coverage may determine if certain services are provided to a patient or not. </p>",
        "id": 153821813,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460649028
    },
    {
        "content": "<p>Regarding sending bills to infants: billing systems in the Netherlands simply send the bills to 'the parents/guardians of Baby Jones' so we have no need to link the parent to the account. But other realms might, so in PA we though we should design payer to be patient, related person or organization. Let me see if I can find a way to share the pic.</p>",
        "id": 153821882,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460709736
    },
    {
        "content": "<p><a href=\"https://photos-1.dropbox.com/t/2/AACDTmoMQ0sBonaFIvNA8CnM3OoLViI23nrmTNYY07d6iw/12/138610850/png/32x32/1/1460725200/0/2/Coverage%20and%20Related%20Resources.png/EPz3mGoYxPABIAcoBw/TQoGFmD79v-Cg5hdfUW10YS4RtUZQ7GEP5qAiTDIRUI?size_mode=3&amp;size=1024x768\" target=\"_blank\" title=\"https://photos-1.dropbox.com/t/2/AACDTmoMQ0sBonaFIvNA8CnM3OoLViI23nrmTNYY07d6iw/12/138610850/png/32x32/1/1460725200/0/2/Coverage%20and%20Related%20Resources.png/EPz3mGoYxPABIAcoBw/TQoGFmD79v-Cg5hdfUW10YS4RtUZQ7GEP5qAiTDIRUI?size_mode=3&amp;size=1024x768\">https://photos-1.dropbox.com/t/2/AACDTmoMQ0sBonaFIvNA8CnM3OoLViI23nrmTNYY07d6iw/12/138610850/png/32x32/1/1460725200/0/2/Coverage%20and%20Related%20Resources.png/EPz3mGoYxPABIAcoBw/TQoGFmD79v-Cg5hdfUW10YS4RtUZQ7GEP5qAiTDIRUI?size_mode=3&amp;size=1024x768</a></p>",
        "id": 153821883,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460709773
    },
    {
        "content": "<p>Sorry, I can't see the pic. However, I'm curious: Where does this \"payor\" live? Is that a field of Coverage?</p>",
        "id": 153821887,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460715037
    },
    {
        "content": "<p>it s an association from coverage to 1 of (patient, related person, organization). <a href=\"/user_uploads/10155/rTJhz4vYaYQCftZriAUjqQ18/fm-am-resources.png\" target=\"_blank\" title=\"/user_uploads/10155/rTJhz4vYaYQCftZriAUjqQ18/fm-am-resources.png\">fm-am-resources.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/rTJhz4vYaYQCftZriAUjqQ18/fm-am-resources.png\" target=\"_blank\" title=\"/user_uploads/10155/rTJhz4vYaYQCftZriAUjqQ18/fm-am-resources.png\"><img src=\"/user_uploads/10155/rTJhz4vYaYQCftZriAUjqQ18/fm-am-resources.png\"></a></div>",
        "id": 153821942,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460728465
    },
    {
        "content": "<p>can you see the diagram now?</p>",
        "id": 153821943,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460728480
    },
    {
        "content": "<p>Yes, that's exactly what  we need. </p>",
        "id": 153821944,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460729216
    },
    {
        "content": "<p>:)</p>",
        "id": 153821945,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460729238
    },
    {
        "content": "<p>...and that would replace the issuer, right? </p>",
        "id": 153821946,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460729257
    },
    {
        "content": "<p>Coverage pertains only to insurance. That diagram is conceptual not physical connections.</p>",
        "id": 153821948,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460729454
    },
    {
        "content": "<p>\"Coverage pertains only to insurance.\"  -&gt; why?</p>",
        "id": 153821949,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460729537
    },
    {
        "content": "<p>at this point Coverage doesnt 'cover' this diagram. Not sure it s because we have different points of view or just time</p>",
        "id": 153821950,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460729549
    },
    {
        "content": "<p>SO from teh diagram: the Account should list the the patients (s) who are jointly and severally responsible for the account, the Coverages (Insurance), which relate to an insuracne policy (Contract), and a list of Guarantors.<br>\nThe diagram is showing the high level relations ships not defining low level links. You will see there is no guarantor, and also that this is a link between encounters and episodes of care and billable items and the claim - conceptually yes but physically no so much.</p>",
        "id": 153821951,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460729769
    },
    {
        "content": "<p>because it is short for Insurance Coverage but people didn't want long names</p>",
        "id": 153821952,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460729813
    },
    {
        "content": "<p>the concept of guarantor doesnt excist everywhere, prob not within 80% so was excluded (for now)</p>",
        "id": 153821953,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460729865
    },
    {
        "content": "<p>i know that might be a shocking statement ;)</p>",
        "id": 153821954,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460729912
    },
    {
        "content": "<p>We don't store credit cards, guarantee obligations or all manner of details in the coverage which would be reasonable to have for payment from the patient, their parent, or a guarantor</p>",
        "id": 153821955,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460729925
    },
    {
        "content": "<p>nope - it does exist already on patient </p>",
        "id": 153821958,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460729969
    },
    {
        "content": "<p>check patient.contact for the relationship - it may be a person or an organization</p>",
        "id": 153821959,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460730012
    },
    {
        "content": "<p>that s true, I meant exclude from the diagram</p>",
        "id": 153821960,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460730047
    },
    {
        "content": "<p>definitely not 80% - that's foresight! haha</p>",
        "id": 153821961,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460730071
    },
    {
        "content": "<p>@Simone: are you looking for somewhere to store the guarantor or their obligations or ?</p>",
        "id": 153821962,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460730197
    },
    {
        "content": "<p>No: A guarantor and a payor are two different things. I am looking for somewhere to store payor information. The patient chooses to have a single room and agrees to pay for the surcharge (or someone else does). Where do I put this? IMHO this is a coverage for a single room ( as defined by the referenced contract) and a reference to a person who will pay for it. A guarantor on the other hand will have to pay for every debt the patient has, even the car he bought last week. And with the guarantor there is no defined scope. He just has to pay for everything left in the Account that's not covered by any insurance. </p>",
        "id": 153821968,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460730771
    },
    {
        "content": "<p>How do I know whether the patient is entitled to a single room if i cannot query for the existance of a \"Single-Room-Coverage\"? The mere existence of a guarantor doesn't tell me that.</p>",
        "id": 153821969,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460730878
    },
    {
        "content": "<p>The human is the patient, is someone else is taking responsibility for their costs, such as a parent, they are a guarantor. If a friend wants to pay for your TV rental then typically they just go to the payment location in the provider and pay without their being formal details recorded.</p>",
        "id": 153821970,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460730973
    },
    {
        "content": "<p>But the coverage doesn't give you the Single Room Coverage detail either. An insuracne policy (Contract) could if insurers provide them, but my TV paying friend example above usually wouldn't result in that complexity.</p>",
        "id": 153821971,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460731084
    },
    {
        "content": "<p>This is not how things work over here :) If you agree to selfpayment at admission, this will have effects for what services are going to be provided to you and how they are going to be charged/billed. The information is vital to know for every party involved during an encounter.</p>",
        "id": 153821972,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460731216
    },
    {
        "content": "<p>The patient agrees to a single room and accepts the fee - not in the existing resources. The fee would then go against the account, the account would be rendered only claims(s) if their is applicable coverage, the amount the insurer is reimbusing the payor would be subtracted from the account (nothing is subtracted if the insurer pays the subscriber, and whoever is responsible for the account pays it.</p>",
        "id": 153821973,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460731268
    },
    {
        "content": "<p>Ok, that's unfortunate. Normally your treatment should be independant of whether you have insurance and the price for services rendered should be the same (or its considered fraud). But ok, the system is the system - this sounds like a new use case: what does a patient fill in or answer and how does the payment or processes change to accomodate this?</p>",
        "id": 153821974,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460731487
    },
    {
        "content": "<p>the price of the service could differ based on the contract the insurer has with the hospital. If the patient has to pay for the service himself, the price may be different</p>",
        "id": 153821975,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460731620
    },
    {
        "content": "<p>or part of the service: the standard room is included in the coverage, the additional fee for private room is payed for by the patient</p>",
        "id": 153821976,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460731669
    },
    {
        "content": "<p>Yes Irma, thats exactly the issue. Also, reimbursement from insurances is often \"flat rate\" per case, so balancing the account won't work. The patient doesn't pay what's left in the account but only what he agreed to pay.</p>",
        "id": 153821977,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460731866
    },
    {
        "content": "<p>right. our healthcare systems are quite simular</p>",
        "id": 153821978,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460731940
    },
    {
        "content": "<p>Guarantor should be something that can be associated to an Account, not just to Patient.  The guarantor for different accounts could well be different.</p>",
        "id": 153821992,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460745468
    },
    {
        "content": "<p>And you'd want to capture role-specific contact information and possibly payment information in conjunction with that association.</p>",
        "id": 153821993,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460745501
    },
    {
        "content": "<p>I agree that Guarantor should be on account not patient, I'm just telling you that is it currently on patient and given that a patient only typically has 1 account that may not be a problem.</p>",
        "id": 153822030,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460755212
    },
    {
        "content": "<p>I don't think there is anything here which isn't also in the Candaina, US and other healthcare systems.</p>",
        "id": 153822032,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460755316
    },
    {
        "content": "<p>\"And you'd want to capture role-specific contact information and possibly payment information in conjunction with that association.\" that's a discussion to have with PA.</p>",
        "id": 153822033,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460755419
    },
    {
        "content": "<p>The fact there's a code for guarantor amongst all of the other Patient.contact relationship codes does *not* mean that that's a desired or intended place to capture guarantor information.  And there can be *lots* of accounts for a given patient, particularly if there's a need to have different payment expectations for different types of services.</p>",
        "id": 153822035,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460756951
    },
    {
        "content": "<p>I would have expected systems would normally handle mutliple accounts. Inpatient/outpatient/mental health/community would all have funding coming from different places, and handled by different processes/means based on different health sector arrangements. (at least it is here in Australia)</p>",
        "id": 153822069,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1460770594
    },
    {
        "content": "<p>So then a list of guarantors and their scope (what they will pay for) and a list of insurance coverages needs to be placed on the Account resource.</p>",
        "id": 153822134,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460887837
    },
    {
        "content": "<p>Typically I'd expect multiple accounts and one guarantor per account.</p>",
        "id": 153822142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460904489
    },
    {
        "content": "<p>I fear it is a bit more complicated (at least in Germany)<br>\nI try to paint out one of the most complex scenarios which occur :</p>\n<p>A patient gets admitted to a stroke unit ,<br>\nit starts up as a treatment in an ICU, the payment is covered by the normal health insurance of the patient (depending on the type of insurance two different tarrifs my aply as the statuary health insurance has a different contract than a private insurance). <br>\nAfter the initial treatment the patient is transfered to a normal nurse unit, now he states that he has an additional  insurance contract which serves for a single bed room and treatment by the head physician.<br>\nAdditionally the patient wants a telephone and internet bed-side service for which he will pay on his own.</p>\n<p>Up to now, we have three different groups beeing resposible for some payments related to his stay in hospital.</p>",
        "id": 153822143,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460907497
    },
    {
        "content": "<p>But to make the things a bit more complicated:</p>\n<p>When his recovery moves on, after a while an evaluation of situation using some scoring system gets responsible for the fact that he is no longer an acute incident but a rehabilitation patient leading to a different type of inpatient stay, which has to be charged on a new bill with different charges applying althoug the patient has not moved at all. </p>\n<p>After a short while, his constitution gets worse, and a new case starts beeing billed like the first one, but having a different identifier.</p>\n<p>That game can go on for quite a while.</p>",
        "id": 153822144,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460907808
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> no question you could have multiple accounts however you can have multiple guarantors on each account. This is a basic finance, think co-signers on a loan, or a mortgage, same business principle.</p>",
        "id": 153822149,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1460915689
    },
    {
        "content": "<p>If we do that, then we'd need to indicate precedence.  If there's a percentage, it might make more sense to create sub-accounts for each so you can track the balance for each guarantor.</p>",
        "id": 153822150,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460918120
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> legally (remember this is not about healthcare this is about financial and legal responsibilities) there often is a precedence. I don't understand why you feel it would be necessary to redesign how the majority of financial systems work today. I thought we were basing our stuff on how things currently work in applications. </p>",
        "id": 153822151,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1460918938
    },
    {
        "content": "<p>I'm not trying to re-design anything.  I understand the potential use-case for multiple guarantors.  But in that case, there's two options - multiple people, with a precedence as to who you go after first, or responsibility for differing percentages, which would be easiest to handle with distinct accounts given that each guarantor would presumably have their own balance.  My primary point is that the guarantor on the Patient resource isn't going to be terribly useful for financial purposes.</p>",
        "id": 153822198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460933814
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\">@Lloyd McKenzie</span> hmmm, you should see if someone from PA can address your primary point.</p>",
        "id": 153822212,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1460935373
    },
    {
        "content": "<p>Multiple guarantors are the norm for any account, there is a precedence in some cases, not in others (think of your mortgage, did you and your wife both sign? How much is either of you responsible for?) any guarantor is responsible for the amount of the account. These are the legal requirements for financing. </p>",
        "id": 153822214,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1460935846
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span>: What you are describing is what occurs in every country I can think of.</p>\n<p><span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : Yes their may be multiple accounts, but normally changes would NOT be split across accounts. The accounts may reflect diffferent classes of service or functional areas within the care facility. There are definitely multiple guarantors: the patient is first unless they cannot be held responsible followed by spouse, parents, social care organizations and others. There may also be multiple insurance coverages which may be event or risk specific in their application and will normally follow a jurisdiction specific Coordination of Benefit order (by class: risk or event specific; national or jurisdictional plan; general health insurance (3rd party); and social programs, and within each class ordered by: more specific to less specific and/or payor of first resort to payor of last resort). <br>\nNormally changes will go to one account. Insurance will normally be applied before the patient, and the patient before the guarantors. The charge recovery process generates logical bills, which may bear little or no resemplance to the actual services rendered (such as 'normal delivery') and these bills to the patient are presented as claims to the patient's insurance coverages until the balance outstaning is 0.00 or the list of coverages is exhaused, then the net-bills or account balance are presented to the patient and then the guarantors in a serial fashion until the the balance is 0.00 or the list exhausted.<br>\nOften when someone says 'I'll pay for the TV or extra chatge for the single room' they are charged then and the credit put on the patients account, or a note simply written to file for the person who will later contstruct claims and handle the billing process.<br>\nIf you wish to model the nice person above who is offering to be responsible for certain costs then you would need two classes of guarantor - one class which is processed before the patient and one class which is processed after.</p>",
        "id": 153822249,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460957019
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\">@Lloyd McKenzie</span>: a guarantor is someone who guarantees an entire risk (a loan, an account) not subsets or percentages thereof. Typically the guartors are jointly and severally responsible - meaning they are each responsible for 100% of the risk.</p>",
        "id": 153822251,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460957759
    },
    {
        "content": "<p>Are we mixing the concepts of guarantors and payors in this discussion? The payor is the organization (usually the healthcare insurance company or the patient himself) that will get and pay the invoice and in some countries there is this concept of guarantor who promisses to pay when the payor doesnt, right? </p>",
        "id": 153822255,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460964066
    },
    {
        "content": "<p>A Payor is an Insurance Company or program whether it be a national program or a private program or insurance just for the patient.<br>\nThe patient is responsible for paying all costs if they are of age and otherwise capable of being responsible. The patient may have insurance coverages which will reimburse them for healthcare services and the patient may assign the benefit under those coverages to the provider rather than the patient having to pay the provider directly and be reimbursed by the Payor.<br>\nA Guarantor is someone (person or organization) who will guarantee payment of the patient's account if the patient is not able to.<br>\nGenerally a provider can sue the patient and guarantors for non-payment but not payors (unless the payor promised to pay and didn't) as the relationship from the provider to the payor is via the patient.</p>",
        "id": 153822263,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460966249
    },
    {
        "content": "<p>@Irma: We are considering both payors and guarantors as they both play a role and hopefully by doing so we get clarity and not confusion.</p>",
        "id": 153822264,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460966642
    },
    {
        "content": "<p>Also, the patient gets the invoice, the Payor gets a Claim.</p>",
        "id": 153822265,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460966719
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  that is definaty not correct for Germany.<br>\na) The vast majority of patients have a statuary health insurance and will never ever receive an invoice for the treatment. <br>\nb) there is no concept of a guarantor at all<br>\nc) self paying contracts are never limited by amount but by service they apply to<br>\nd) same applies to additional insurances who cover certain services</p>",
        "id": 153822267,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460968489
    },
    {
        "content": "<p>H Peter: <br>\nI don't see invoices for my medical, hospital and diagnostics but do for other services.<br>\nThe national plan covers all treatment, inpatient, outpa<br>\ntient, dental, vision, pharmacy, rehab, etc. both requred and optional and cosmetic?<br>\nWhy would you need self paying contracts or additional insurance if the national program pays for everything?</p>",
        "id": 153822268,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460968835
    },
    {
        "content": "<p>Paul the national plan covers : inpatient, outpatient, dental, vision, pharmacy, rehab - required treatments . Cosmetic treatments will be covered in case of accidents (reconstructive) or if there is a psychiatric need.<br>\nand that applies to more than 90% of all treatments</p>",
        "id": 153822269,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460969125
    },
    {
        "content": "<p>Ok, that's like other programs. So for the other 10% the patient is responsible and they may have other insurance to cover some or all of that right?</p>",
        "id": 153822270,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460969236
    },
    {
        "content": "<p>it s obvious that there are many differences in the way healthcare is payed for between different countries. I think the challenge we re facing is to identify the 80% and to create (standard and/or realm specific) extentions for the parts in the 20%.</p>",
        "id": 153822271,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460969317
    },
    {
        "content": "<p>like this concept of guarantor. I know it exists in the US, but I dont know if it does in other countries, like Canada, Australia, South American countries etc. Should it be in the 80%?</p>",
        "id": 153822272,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460969418
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191797\">@Irma Jongeneel</span>  true, the only problem might be, that there might be to find a suitable intersection appropriate for 80% ;)</p>",
        "id": 153822273,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460969458
    },
    {
        "content": "<p>Irma, I'm really not seeing a difference. Sure what any given insurance program covers is particular to that plan, but that is not a structureal <a href=\"http://difference.it\" target=\"_blank\" title=\"http://difference.it\">difference.it</a> is a difference of application.</p>",
        "id": 153822274,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460969499
    },
    {
        "content": "<p>I'm Canadian, and guarantors exist there and in most countries.</p>",
        "id": 153822275,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460969576
    },
    {
        "content": "<p>What happens in Germany if the national program doesn't cover the cost - is the patient expected to pay?</p>",
        "id": 153822276,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460969616
    },
    {
        "content": "<p>to me, bringing the guarantor into the discussion, is making it more confusing, especially since it gets a lot of attention ;) may i suggest we try to get a good fitting model for the payor concept first, without talking about guarantor and then do the work on guarantor?</p>",
        "id": 153822277,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460969709
    },
    {
        "content": "<p>Paul, the difference is the way responsibility is handled. <br>\nAs I said, there is no concept of guarantor here, <br>\nthere is a promise of coverage for a certain and well defined service (which is negotiated in advance) </p>",
        "id": 153822278,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460969724
    },
    {
        "content": "<p>Ok, ignore the concept of guarantor. What happens if the national program doesn't cover a service, is the patient expected to pay?</p>",
        "id": 153822279,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460969782
    },
    {
        "content": "<p>yes</p>",
        "id": 153822280,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460969803
    },
    {
        "content": "<p>So they would get an invoice.</p>",
        "id": 153822281,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460969823
    },
    {
        "content": "<p>yes.</p>",
        "id": 153822283,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460969881
    },
    {
        "content": "<p>Nope,<br>\nonly if he accepts in advance.</p>",
        "id": 153822284,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460969900
    },
    {
        "content": "<p>well, depending ofcourse on possible private insurances the patient might have in addition to the national program</p>",
        "id": 153822285,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460969920
    },
    {
        "content": "<p>I expect when they get treament then services which paid for by the national program are deducted from the costs incurred first, and if there is a balance owing the patient pays that, and that since most services are known and payable by the national program the patient rarely actually receives and invoice.<br>\nWhen there is some portion payable by other insurance a claim is sent to the insurer who indicates what they will pay and they may pay that directly to the provider or reimbuse the plan holder.</p>",
        "id": 153822286,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460970096
    },
    {
        "content": "<p>basically only if the patient doesnt have the national program (It s a bit different here from Germany I think but not that much). Here is it s a 'basic insurance' they you have to have (unless you claim you dont want it for religious reason or something like that), so that should cover the basic healthcare at all times. But you have a choice in where you get this basic insurance (what insurance company), that is where it might differ from Germany</p>",
        "id": 153822287,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1460970152
    },
    {
        "content": "<p>So the patient agrees to the treatment and any cost which they will bear (directly or though their insurance) in advance. And probably this discussion only happens if there is some part of the treatment which the nation program doesn't cover?</p>",
        "id": 153822288,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460970155
    },
    {
        "content": "<p>But I'm guesssing they don't actually pay usually until the treatment is provided?</p>",
        "id": 153822289,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460970231
    },
    {
        "content": "<p>Who pays for wards of the state or people who cannot pay for themselves - a social program of some sort?</p>",
        "id": 153822290,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460970449
    },
    {
        "content": "<p>By 'self-pay contract' do you mean the up-front agreement by the patient, or someone on the patient's behalf, agreeing to pay for a list of services which are not covered by the national program?</p>",
        "id": 153822291,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460970599
    },
    {
        "content": "<p>Paul: unless the patient accepts responsibilty for the payment in advance, he can't be charged at all</p>",
        "id": 153822292,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460971388
    },
    {
        "content": "<p><strong>*</strong><strong> Summary to see if I'm getting this correctly: </strong><strong>*</strong><br>\n1) Patient goes to provider and agrees on the services to be rendered and what if any services the patient will be responsible for (usually few or none)<br>\n2) Service is rendered, then the National program (or basic insurance program) pays its portion and the patient is only responsible for their portion.<br>\n3) If the patient has insurance which will pay for some of their portion then that is applied next.<br>\n4) Once all insurance, if any, is applied then if there is a remaining balance the patient will pay or someone will pay on their behalf.<br>\n5) The patient does not receive an invoice unless there is some amount which is not paid for by one of the insurance programs.</p>\n<p>Does that sound about right?</p>",
        "id": 153822293,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460971503
    },
    {
        "content": "<p>typically \"self pay contracts\" apply to kind of \"hotel services\" like rooms with 1 bed onyl or telephone, different meals etc. There was some time where a self pay contract existed, as patients had to pay a certain fee per day during the first 14 days as an inpatient per year, but that is gone again.</p>\n<p>a patient can't go to hospital unless it is a case of emergency, otherwise he has to see a GP and will be transferred to hospital by him</p>\n<p>to put it right, there is differcence between patients having a statuary health insurance, and those having a private one.</p>\n<p>for the first case the patient will receive an invoice on medical servicses ony and only if he agrees on beeing responsible for the service after beeing informed that this kind of service is not covered by statuary insurance. <br>\nFor the second case, the invoice is handed to the patient , and he sends it to his insurance for reimbursement.</p>",
        "id": 153822294,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460972007
    },
    {
        "content": "<p>Ok thanks.<br>\nThis is not different from Canada or US or Britain or France or ...</p>\n<p>What differs between the countries is where you get your insurance (national program, provincial program, you buy, employer buys, cooperative plan, whatever) and the services covered by the plan. The fundamental elements and flow are the same.</p>\n<p>But this doesn't alter the eClaim resources as they aren't dependant on where you get your coverage or what services are covered, they are just involved with moving the required information between the provider and the insurers to get their adjudication. And it doesn't alter the Accounts and Billing resources as they record the charges, the plans, who may pay in addition to the patient, and the balance.</p>",
        "id": 153822295,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460972428
    },
    {
        "content": "<p>ping</p>",
        "id": 153827320,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1463065500
    }
]