[
    {
        "content": "<p>I am working on a project that need to transport a list of prescription with prescription ID and RxNorm code only. Both MedicationRequest and MedicationUsage have more required field such as subject and status which are not relevant (and sometimes unknown) in this use case. Is there a way to skip those required field while still make the resource valid?</p>",
        "id": 167413345,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1559757673
    },
    {
        "content": "<p>Not with the resource as defined.  But if all you have is an ID and a RxNorm code, you don't really have a MedRequest as the request pattern defines the subject, status, intent all to be required.  If you truly don't know those other items, then I would suggest that you can't use the Request resources.</p>",
        "id": 167414081,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1559757934
    },
    {
        "content": "<p>You could fill things like 'subject' with a data-absent-reason extension indicating that it's not known.  The MedicationRequest has a status of unknown as well.</p>",
        "id": 167414234,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559758021
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> That's good idea. Thanks.<br>\n<span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> I agree this is not real request. I am trying to find some resource that can fit this situation.  My plan B is to create a customized resource but really don't want to go that route.</p>",
        "id": 167415120,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1559758502
    },
    {
        "content": "<p>can you tell more about your use case? I agree with Jean, doesn't seem like a request resource.</p>",
        "id": 167416987,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559759673
    },
    {
        "content": "<p>If it's summarizing prescriptions, it could still be a MedicationRequst, though obviously not an actionable one</p>",
        "id": 167421556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559762355
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> This is a data analysis service. It has two components. The data collector queries different clinical data source to collect prescriptions for a patient, then the data collector removes not needed data element (to reduce the payload) and send collected data to analysis service. The data comes in at the step 1 are either MedicationRequest or MedicationUsage. I am considering what data schema I should use for the step 2.</p>",
        "id": 167425337,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1559765118
    },
    {
        "content": "<p>ah ok, if this were after the analysis i could point at measure or something else.</p>",
        "id": 167425416,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559765170
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 167425675,
        "sender_full_name": "John Moehrke",
        "timestamp": 1559765311
    }
]