[
    {
        "content": "<p>Hi, the latest version of FHIR uses hyphens in the search parameters of some profiles, e.g. Patient has address-city and general-practitioner. However, using hyphens in query parameters does not follow the RFC6570 specification. Libraries that follow this specification strictly will give an error message when they encounter a query with a hyphen, e.g. this library <a href=\"https://github.com/grncdr/uri-template\" target=\"_blank\" title=\"https://github.com/grncdr/uri-template\">https://github.com/grncdr/uri-template</a> . Is there a way to update the FHIR specification to follow the URI specification? This affects how data models are constructed and REST queries that implementations can make.</p>",
        "id": 153900810,
        "sender_full_name": "Omar El-Begawy",
        "timestamp": 1502175748
    },
    {
        "content": "<p>does rfc 6570 matter?</p>",
        "id": 153900848,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502181991
    },
    {
        "content": "<p>since when is a hyphen not allowed in an URI ?<br>\nI don't see that anywhere</p>",
        "id": 153900858,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502182904
    },
    {
        "content": "<p>My understanding is that 6750 simply provides an additional syntax to express some queries. And in that additional syntax hyphens are not part of the syntax. URIs allow hyphens, but RFC6750-formatted queries (they call them \"URI templates\" do not. If that is correct, I'd say the question is: do we want to provide additional rfc 6750 syntax ? It does not affect current specification IMO. I may be wrong.</p>",
        "id": 153900865,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502187444
    },
    {
        "content": "<p>We are testing our API implementation with REST requests, but the test tool uses a validation library which considers query parameters with hyphens to be malformed. We found that the reason was that they did not conform to RFC6570.</p>\n<p>This could be a problem also with other tools that closely follow RFC 6570.</p>\n<p>URIs can take many different forms, some even arbitrary ones. RFC 6570 is an attempt to standardize their formats and make them well-formed.</p>\n<p>Here is the specification: <a href=\"https://tools.ietf.org/html/rfc6570\" target=\"_blank\" title=\"https://tools.ietf.org/html/rfc6570\">https://tools.ietf.org/html/rfc6570</a><br>\nA list of implementations: <a href=\"https://code.google.com/archive/p/uri-templates/wikis/Implementations.wiki\" target=\"_blank\" title=\"https://code.google.com/archive/p/uri-templates/wikis/Implementations.wiki\">https://code.google.com/archive/p/uri-templates/wikis/Implementations.wiki</a></p>",
        "id": 153900887,
        "sender_full_name": "Omar El-Begawy",
        "timestamp": 1502195926
    },
    {
        "content": "<p>what is recommmended instead of hyphens?</p>",
        "id": 153900950,
        "sender_full_name": "Eric Haas",
        "timestamp": 1502203338
    },
    {
        "content": "<p>The spec gives these:</p>\n<div class=\"codehilite\"><pre><span></span> varchar       =  ALPHA / DIGIT / &quot;_&quot; / pct-encoded\n</pre></div>\n\n\n<p>where</p>\n<div class=\"codehilite\"><pre><span></span> ALPHA          =  %x41-5A / %x61-7A   ; A-Z / a-z\n DIGIT          =  %x30-39             ; 0-9\n pct-encoded    =  &quot;%&quot; HEXDIG HEXDIG\n HEXDIG         =  DIGIT / &quot;A&quot; / &quot;B&quot; / &quot;C&quot; / &quot;D&quot; / &quot;E&quot; / &quot;F&quot;\n                   ; case-insensitive\n</pre></div>\n\n\n<p>I'd say it's up to you to select from this set.</p>\n<p>I saw that you had camelcasing at some point. What happened to that?</p>",
        "id": 153901085,
        "sender_full_name": "Omar El-Begawy",
        "timestamp": 1502256355
    },
    {
        "content": "<p>we had a mix of camel casing and hyphens. We standardised on hyphens.</p>",
        "id": 153901378,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502319462
    },
    {
        "content": "<p>I have no idea why this rfc decided that hyphens are not approprate - it seems like an odd decision to me</p>",
        "id": 153901379,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502319490
    },
    {
        "content": "<p>I have no idea either.  But my guess is that either the spec writing group did not have a use case where the hyphen was part of a query parameter and therefore did not even think that it could be an issue, or the hyphen is unreserved until given a role as a special character in the future.</p>",
        "id": 153901604,
        "sender_full_name": "Omar El-Begawy",
        "timestamp": 1502371514
    },
    {
        "content": "<p>i don't see any rationale why variable names should be treated different than all other parts of the URI<br>\nas far as I understand variable names are the only parts that have different rules </p>\n<p>IMHO there is no real benefit in adding the restrictions of RFC 6750.</p>",
        "id": 153901606,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502373962
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  there is no \"instead\" it would just mean, that submitting the query would need to escape the hyphen like</p>\n<p>GET ..../Patient?adress%2dcity=New%20York</p>",
        "id": 153901607,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502374380
    },
    {
        "content": "<p>I did just sent such an encoded query to Grahame's server and it worked well. So imho there is no need to change the search parameters.<br>\nIt would be up to the client to encode search parameter names according to RFC 6750 if desired.</p>\n<p>Therefore I think there is no need for action regarding the specs</p>",
        "id": 153901609,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502375477
    },
    {
        "content": "<p>Well, if some servers can handle dashes in search parameters and others can't, that creates a barrier for interoperability.  How prevelant are libraries that expect RFC 6750 adherence?</p>",
        "id": 153901620,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502377737
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> just to put that right: RFC 6750 does not forbid dashes in variable names, but enforces escaping on transmission. </p>\n<p>That escaping will be undone in the HTTP receiver on the server side before passing the HTTP request to the layer above. Therefore the  application will receive \"normal\" search parameters. <br>\nFor that reason, RFC 6750 can't be an issue on the server side, but only on the client side.</p>",
        "id": 153901688,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502385163
    },
    {
        "content": "<p>So perhaps adding a note that some client systems may need to escape the \"-\" in search parameters is sufficient?</p>",
        "id": 153901785,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502396887
    },
    {
        "content": "<p>We already tried replacing - with %2d. Didn't work.</p>",
        "id": 153902006,
        "sender_full_name": "Omar El-Begawy",
        "timestamp": 1502430839
    },
    {
        "content": "<p>That should have worked, as that ist what RFC 6750 says, <br>\nIf it didn't work your library is buggy on which side is the library located server or client ?</p>",
        "id": 153902014,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502436379
    },
    {
        "content": "<p>The spec gives these:</p>\n<div class=\"codehilite\"><pre><span></span> varchar       =  ALPHA / DIGIT / &quot;_&quot; / pct-encoded\n</pre></div>\n\n\n<p>where</p>\n<div class=\"codehilite\"><pre><span></span> ALPHA          =  %x41-5A / %x61-7A   ; A-Z / a-z\n DIGIT          =  %x30-39             ; 0-9\n pct-encoded    =  &quot;%&quot; HEXDIG HEXDIG\n HEXDIG         =  DIGIT / &quot;A&quot; / &quot;B&quot; / &quot;C&quot; / &quot;D&quot; / &quot;E&quot; / &quot;F&quot;\n                   ; case-insensitive\n</pre></div>\n\n\n<p>The percentage sign is not part of the spec, and therefore %2d is not valid. Your query works because STU3 is not compliant with RFC 6570. But if client applications want to adhere to the spec or they use libraries that do so, there will be queries that they cannot make to a FHIR server. This affects url validation, routing, etc.</p>\n<p>Templates and standards are useful because they are general and reusable in different contexts. URIs can very well be arbitrary, but nonstandard URIs are a hindrance to interoperability, because it requires more time for developers to learn their patterns. Nonstandards compliance also makes systems prone to errors.</p>\n<p>It would be quite questionable for us to ask application developers and contractors to replace - with %2d, as this cannot be found in the STU3 documentation. With multiple vendors building mobile applications for health care and contractors building services in a microservice environment, it is important to adhere to standards. We cannot guarantee that all parts of our system are interoperable if some follow a standard that others do not, nor can we guarantee that contracted parts of our system will pass the necessary audits.</p>",
        "id": 153902156,
        "sender_full_name": "Omar El-Begawy",
        "timestamp": 1502459233
    },
    {
        "content": "<p>Please reference RFC 6570, which is about URI templates. I am not concerned with RFC 6750, which is about OAuth (earlier there was one question in this stream about OAuth, probably because the person made a query with the OAuth spec reference)</p>",
        "id": 153902157,
        "sender_full_name": "Omar El-Begawy",
        "timestamp": 1502459394
    },
    {
        "content": "<p>well, I think you should go to the authors of the library and suggest that they support '-' anyway. Even if we changed policy on this and made <em>breaking changes</em> to all of our resources - something I find unlikely at best - the change would still not be effective till R4 - which won't be published until end of next year and only adopted gradually after that. And none of this discussion has demonstrated that RFC 6570 has any real reason to ban '-'. I smells like an oversight to me.</p>",
        "id": 153902196,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502483674
    }
]