[
    {
        "content": "<p>Hi everyone,</p>\n<p>I'm looking into a way of converting structure definitions from IG into customized resource implementation which I then can use with validator.</p>\n<p>I saw this utility <a href=\"https://github.com/hapifhir/org.hl7.fhir.core/tree/master/org.hl7.fhir.core.generator\">https://github.com/hapifhir/org.hl7.fhir.core/tree/master/org.hl7.fhir.core.generator</a> which if I understand correctly helps building custom R5 by applying customization on top of core R5.</p>\n<p>Can someone please explain what steps should I take to enable this flow: IG -&gt; Structure Definition -&gt; Customized R5?</p>",
        "id": 200973952,
        "sender_full_name": "Dimi",
        "timestamp": 1592284226
    },
    {
        "content": "<p>we don't really support that workflow - that's why it's not really working for you</p>",
        "id": 200982814,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592294034
    },
    {
        "content": "<p>The point of FHIR is to have a single consistent schema across all FHIR implementations for a given version.  If your notion of customization is defining what extensions are allowed, that's fine.  If your notion is changing what elements or resources exist, then you're no longer really using FHIR - and that's not something we feel would be helpful to interoperability across the community.  That doesn't mean you can't do it, but it's not something we'd invest in supporting.</p>",
        "id": 201004151,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592308899
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ,</p>\n<p>As you suggested my intention is not to change the default resource implementation, but define a new model by appending default resource with all possible extensions, so then I can use this model for validation later.</p>\n<p>Will I be able to do this using java core code generator?</p>",
        "id": 201069420,
        "sender_full_name": "Dimi",
        "timestamp": 1592339138
    },
    {
        "content": "<p>The code in the various reference implementations (Java, .NET, etc) already supports extensions all the places they're allowed to be.  We don't have a code generator that generates code specific to particular profiles - so no getters for specific extensions, though because you can grab an extension by URL, that generally isn't too much of an issue.</p>",
        "id": 201070780,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592339852
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , looks like I misunderstood the meaning of java core code generator then, would you be able to clarify please what is the use case when I would use java code generator?</p>",
        "id": 201071369,
        "sender_full_name": "Dimi",
        "timestamp": 1592340228
    },
    {
        "content": "<p>Generally, you wouldn't.  It is used to produce the base HAPI, .NET and other interfaces.  If you wanted to tweak the code generated somehow to meet special requirements, you could do that, but otherwise it's probably simpler (and you'd certainly have more community support if you ran into issues) to just use the officially published reference implementation.</p>",
        "id": 201071701,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592340395
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , we have our custom StructureDefinition for our patient(by add few new fields), and we are using HAPI FHIR, does that means we need manually create our custom Patient java code by extend hapi Patient?</p>",
        "id": 201072185,
        "sender_full_name": "Steven Wang",
        "timestamp": 1592340613
    },
    {
        "content": "<p>Are you adding new fields or are you using extensions?  (Because you should be doing the latter...)</p>",
        "id": 201079916,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592345043
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  we are adding extensions, the example resource that we need to serve via API: <a href=\"http://build.fhir.org/ig/HL7NZ/northernRegion/branches/master/StructureDefinition-HaPatient.html\">http://build.fhir.org/ig/HL7NZ/northernRegion/branches/master/StructureDefinition-HaPatient.html</a></p>\n<p>Can you please advise what will be the most efficient way taking that this resource is derived from a resource in another IG?</p>",
        "id": 201082179,
        "sender_full_name": "Dimi",
        "timestamp": 1592346684
    },
    {
        "content": "<p>You are the authors of the HaPatient profile and you're wanting to indicate it's derived from a profile defined in another IG?</p>",
        "id": 201083383,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592347609
    },
    {
        "content": "<p>If you're using extensions, no need to extend HAPI Patient.  If you really feel the need to have custom accessors for your extensions, you could define a class on top that adds alias methods for those, but the default extension methods should work fine.</p>",
        "id": 201083481,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592347682
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  from the HAPI FHIR guide, it recommend using custom type <a href=\"https://hapifhir.io/hapi-fhir/docs/model/profiles_and_extensions.html\">https://hapifhir.io/hapi-fhir/docs/model/profiles_and_extensions.html</a></p>",
        "id": 201084029,
        "sender_full_name": "Steven Wang",
        "timestamp": 1592348072
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  yes, we are maintaining implementation of haPatient derived from nzPatient(we don't maintain) and we are looking for efficient way of maintaining haPatient using HAPI FHIR. </p>\n<p>Building a class on top of Patient seems like a good approach, but I'm not sure about how to handle the fact that haPatient is derived from another custom type (nzPatient) maintained in another IG.</p>\n<p>I'm trying to avoid building class for resource that we don't maintain but need to derive from.</p>",
        "id": 201085507,
        "sender_full_name": "Dimi",
        "timestamp": 1592349221
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span></p>",
        "id": 201092061,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592355845
    },
    {
        "content": "<p>see <a href=\"#narrow/stream/179167-hapi/topic/Generating.20code.20for.20Profiles\">https://chat.fhir.org/#narrow/stream/179167-hapi/topic/Generating.20code.20for.20Profiles</a></p>",
        "id": 201092067,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592355865
    }
]