[
    {
        "content": "<p>Hi<br>\nWe are trying to implement a FHIR version of an existing API which allows third parties via their CRM systems (B2B) to request services to be performed - mostly getting historical information, but sometimes requesting procedures to be performed.<br>\nWe have found that an Order goes only part of the way to providing the API equivalent functionality and we need to supplement this with additional information:</p>\n<ul>\n<li>An authority form (Consent)</li>\n<li>Additional Persons (adviser, case manager)<br>\n*External reference information - this will be reflected back to allow cross referencing within their CRM later when information is known.<br>\nLooking at Order, we could</li>\n<li>Load these additional information into 'Order.Detail' (some data would not be known as a reference, so a contained resource)</li>\n<li>Create our own Profile - this profile would be specific to our company and the CRM integration would be aware of this Profile</li>\n<li>Place Order plus these additional resources info into a Bundle<br>\nDue to backward compatibility with the API, we are looking at using FHIR as the main integration to the base storage, then transpose the FHIR resource/profile/bundle into the only API objects - this is primarily to allow existing customers to seamlessly use their existing investment.<br>\nWhich would be the preferred method ?</li>\n</ul>",
        "id": 153859097,
        "sender_full_name": "Neil Grooby",
        "timestamp": 1480477752
    },
    {
        "content": "<p>I can only speak to the Consent... Yes, use the Consent to convey privacy authorizations, advanced directives, and authorizations to treat. These are distinct concepts from the  Order, or Careplan, etc...</p>",
        "id": 153859287,
        "sender_full_name": "John Moehrke",
        "timestamp": 1480526211
    },
    {
        "content": "<p>have you looked at the current build, at task, and the associated description stuff? Order will be deprecated and replaced with task in FHIR release 3</p>",
        "id": 153859289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480531313
    },
    {
        "content": "<p>Where can I find the current build? We were about to start implementing Order, we didn't see anywhere that it would be deprecated.</p>",
        "id": 153859409,
        "sender_full_name": "Jose Montoya",
        "timestamp": 1480552017
    },
    {
        "content": "<p><a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a></p>",
        "id": 153859412,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480552046
    },
    {
        "content": "<p>Thanks Grahame. I believe our developers are using Spark as a basis for integration which looks to only be at DSTU2.<br>\nIf we use DSTU2 then we will not be already developing to an old release which is not ideal for a new project.</p>",
        "id": 153859497,
        "sender_full_name": "Neil Grooby",
        "timestamp": 1480559877
    },
    {
        "content": "<p>release 3 is due late Feb next year</p>",
        "id": 153859499,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480560094
    },
    {
        "content": "<p>OK, so 3 months away. Are you talking R3 Spark or STU3 being at a maturity level we should use ?</p>",
        "id": 153859500,
        "sender_full_name": "Neil Grooby",
        "timestamp": 1480560156
    },
    {
        "content": "<p>STU3. You'd have to ask on the dotnet stream what the likely release date for R3 spark is, though I expect it would be fairly close</p>",
        "id": 153859501,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480560228
    },
    {
        "content": "<p>Current public domain <a href=\"https://github.com/furore-fhir/spark\" target=\"_blank\" title=\"https://github.com/furore-fhir/spark\">Spark</a> will be DSTU2 for the near future. The new Spark (currently in development) will add STU3 support as soon as STU3 is released. The first version of that new Spark will itself be released sometime in Q1, 2017.<br>\nIf you want further help in developing upon Spark, please send me a PM.</p>",
        "id": 153863216,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1481639136
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span>  - some of our devs who are also on here may contact you.</p>",
        "id": 153863553,
        "sender_full_name": "Neil Grooby",
        "timestamp": 1481773244
    }
]