[
    {
        "content": "<p>I'm relatively new to FHIR and have read about PDQm and FHIR Patients for a few hours including the parts on patient.html about patient ids, linking, and merging.</p>\n<p>I'm a developer on a software project that offers PIX, PDQ, and XDS transactions. We want to wrap the PIX and PDQ SOAP endpoints with REST services to offer the PDQm and PIXm transactions.</p>\n<p>Now to the technical question: A PIX Manager stores patient records of different assigning authorities, for example IHERED, IHEBLUE and IHEGREEN for the Connectathon. All 3 of them are linked together using a newly created XAD-PID because they share the same demographics. The Connectathon tests for PDQm even tell you to load the same patient with different assigning authorities into your system.</p>\n<p><a href=\"https://gazelle.ihe.net/EU-CAT/testing/testsDefinition/viewTestPage.seam?id=768&amp;testKeyword=PDQ%2FPIX_10_Do_This_First\" target=\"_blank\" title=\"https://gazelle.ihe.net/EU-CAT/testing/testsDefinition/viewTestPage.seam?id=768&amp;testKeyword=PDQ%2FPIX_10_Do_This_First\">https://gazelle.ihe.net/EU-CAT/testing/testsDefinition/viewTestPage.seam?id=768&amp;testKeyword=PDQ%2FPIX_10_Do_This_First</a></p>\n<p>Is each one of them its own Patient Resource with its own logical id or do they have to be merged to one Patient entry? If there should be one Patient entry per assigning authority, should the \"link\" property be filled with the URLs of the same patient in other assigning authorities with the link type property set to \"seealso\"?</p>\n<p>Also is it a bad idea to use an auto-generated primary key value from the database for the <a href=\"http://Resource.id\" target=\"_blank\" title=\"http://Resource.id\">Resource.id</a> of a Patient?</p>\n<p>I hope anyone can answer my questions.</p>\n<p>Best regards,<br>\nStefan Berger</p>",
        "id": 154599904,
        "sender_full_name": "Stefan Berger",
        "timestamp": 1546894066
    },
    {
        "content": "<p>This is my understanding, which I suspect we are all discovering the complexity. This very much depends on if you are told to Merge, or Link. Merged would end up with one Patient with two .identifier values. Linked would be an update of the 'linked' Patient.link... which brings up more issues/questions than it closed.</p>",
        "id": 154600888,
        "sender_full_name": "John Moehrke",
        "timestamp": 1546894830
    },
    {
        "content": "<p>Yes, <a href=\"http://Resource.id\" target=\"_blank\" title=\"http://Resource.id\">Resource.id</a> should use your auto-generated primary key.... as long as it is a legitimate GUID</p>",
        "id": 154600900,
        "sender_full_name": "John Moehrke",
        "timestamp": 1546894856
    },
    {
        "content": "<p>issues with linked Patients that I initiated is <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19687\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19687\">GF#19687</a></p>",
        "id": 154601115,
        "sender_full_name": "John Moehrke",
        "timestamp": 1546895071
    }
]