[
    {
        "content": "<p>We are planning on using ClinicalImpression to bundle conditions and observations as input for a CDS tool. In our case: A specific type of cancer including its stage (Condition) and the presence of some types of genes (Observations). Is ClinicalImpression supposed to be used for this? <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> </p>",
        "id": 153875482,
        "sender_full_name": "Marten Smits",
        "timestamp": 1488963648
    },
    {
        "content": "<p>ClinicalImpression is still in draft (FMM=0) as the scope continues to be discussed and refined.  Furthermore, we identified some QA issues that we need to address post-STU3 around circular references between Condition and ClinicalImpression (per <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10635\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10635\">GF#10635</a>).  As such, let me take the question back to Patient Care to discuss tomorrow (Thurs, March 9) and get back to you.</p>",
        "id": 153875629,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1489013524
    },
    {
        "content": "<p>Great, thank you!</p>",
        "id": 153875717,
        "sender_full_name": "Marten Smits",
        "timestamp": 1489048844
    },
    {
        "content": "<p>In general, the Patient Care WG discussion included:</p>\n<ul>\n<li>ClinicalImpression is not intended to bundle Conditions and Observations -- why not use the Bundle resource?</li>\n<li>ClinicalImpression is intended to represent the clinical assessment (\"A\" in SOAP notes)</li>\n</ul>",
        "id": 153875920,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1489102278
    },
    {
        "content": "<p>The Bundle resource is a transport resource, not a semantic resource.</p>",
        "id": 153875934,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489109956
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> How do you assess (A in SOAP), without linking to Conditions and Observations? Bundle is a no-go as <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> just said, since it's for infrastructural purposes only.</p>",
        "id": 153876918,
        "sender_full_name": "Marten Smits",
        "timestamp": 1489574985
    },
    {
        "content": "<p>My comments above were terse since I was typing while simultaneously chairing the conference call -- sorry about that.  To elaborate, I don't think Patient Care had enough context to answer your question definitively.  We couldn't tell if you were just needing a transport (e.g. a way to \"bundle\" input for CDS purposes) or a true semantic linking.  If your use case is representing an actual clinical assessment (i.e. clinical summation of information and/or an opinion formed, which is the outcome of the clinical assessment process), then you can use ClinicalImpression (with caution since it is only FMM=0), which includes references for the problem, investigation, and findings.  In your use case, is the condition stage the finding or outcome of the assessment? </p>",
        "id": 153876953,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1489589647
    },
    {
        "content": "<p>In our use case these are findings: The condition and observations are all input for a CDS tool to decide the best therapy for the patient. A patient has a specific kind of cancer, which includes it's stage etc. (Conditions) The observations are, for example, the presence of a certain gene in the patient. These observations have to be linked somehow to the conditions (as they are related to only certain types of cancer) for the CDS tools and we were thinking of using ClinicalImpression for that.</p>",
        "id": 153876973,
        "sender_full_name": "Marten Smits",
        "timestamp": 1489595152
    },
    {
        "content": "<p>We had a similar use case (<a href=\"https://chat.fhir.org/#narrow/near/64679/stream/implementers/topic/event-reasonReference.20extension\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/near/64679/stream/implementers/topic/event-reasonReference.20extension\">https://chat.fhir.org/#narrow/near/64679/stream/implementers/topic/event-reasonReference.20extension</a>). In short we are using the reasonReference extension to link back from an observation to the tumor it resulted from.</p>",
        "id": 153877013,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1489603672
    }
]