[
    {
        "content": "<p>Hi FHIR Folks! </p>\n<p>I just wanted to pop in here and pick the brains of anyone familiar with a utilization of the R4 \"List\" resource, and even more specifically the use of a List resource for ordering screens to patients wherein those screens are R4 Questionnaire resources? </p>\n<p>I understand the general structure of the List resource and which are the functional fields for using it as a list of record items. What I was hoping for some insight on, was the formatting of the \"coding\" field inside the \"Flag\" field inside each Entry item. I see there is a specific one used in the examples for medication orders, etc. but I don't see any examples dealing with Questionnaires or screening orders. </p>\n<p>Would love any and all advice, thoughts, feelings, ideas...!</p>",
        "id": 195901295,
        "sender_full_name": "Mike C.",
        "timestamp": 1588280707
    },
    {
        "content": "<p>List isn't really for ordering anything.  If you want to order someone to complete a form, you'd use either Task or ServiceRequest.  You might have a managed List of Tasks representing someone's to-do list potentially.</p>",
        "id": 195910506,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588285901
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Utilizing.20.22List.22.20Resource.20as.20a.20way.20to.20order.20Questionnaire/near/195910506\" title=\"#narrow/stream/179166-implementers/topic/Utilizing.20.22List.22.20Resource.20as.20a.20way.20to.20order.20Questionnaire/near/195910506\">said</a>:</p>\n<blockquote>\n<p>List isn't really for ordering anything.  If you want to order someone to complete a form, you'd use either Task or ServiceRequest.  You might have a managed List of Tasks representing someone's to-do list potentially.</p>\n</blockquote>\n<p>Thank you Llyod. I will discuss this with our leadership, I appreciate your feedback very much.</p>",
        "id": 195964793,
        "sender_full_name": "Mike C.",
        "timestamp": 1588342547
    }
]