[
    {
        "content": "<p>Hi guys, I'm looking for any advice about how to treat text from a HL7 V2 message which needs to be preserved and passed over in FHIR resources. What I have is pathology report display text with tabular information, think 'Liver Functions Test' report or 'Full Blood Count' Report in a HL7 V2 ORU message. Yet, I don't have a display OBX segment with a PDF but rather a series of  HL7 V2 DSP segment which is nothing more than a string of text where each DSP segment is a new line, I do realise this is not standard for  ORU message, a series of txt OBX segments would be much the same problem. I do not have control of the source of the V2 messages.  <br>\nHow do I preserve the white space that represented the tabular information in a text narrative of a FHIR resource? <br>\nOr should I be using a Binary resource and some Mime-Type to achieve this? <br>\nCan I use the PRE tag in the XHTML of the FHIR narrative?<br>\nI can try and use HTML Table or List to try an achieve the same outcome, but it will be very difficult as the content will be dynamic, some times it might not be tabular and other times, it will be difficult and potentially unsafe.<br>\nI feel the easiest and safest if the &lt;pre&gt; tag.<br>\nHave others dealt with this problem?</p>",
        "id": 197368403,
        "sender_full_name": "Angus Millar",
        "timestamp": 1589344622
    },
    {
        "content": "<p>You can convert the whitespace in the DSP into XHTML for the narrative.  It takes a bit of work, but it's possible.  You'd need to use more than just &lt;pre/&gt; unless there's no other FT markup in the text (and you can count on it staying that way).</p>",
        "id": 197368815,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589345370
    },
    {
        "content": "<p>So Lloyd, is the &lt;pre&gt; acceptable in the FHIR Narrative?  The narrative page in the R4 spec is silent on its use: <a href=\"http://hl7.org/fhir/R4/narrative.html#Narrative\">http://hl7.org/fhir/R4/narrative.html#Narrative</a></p>",
        "id": 197370606,
        "sender_full_name": "Angus Millar",
        "timestamp": 1589348121
    },
    {
        "content": "<p>Absolutely.  It's not 'active' and it's part of the XHTML spec</p>",
        "id": 197370651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589348164
    },
    {
        "content": "<p>Yes true, I think its use will solve my issue. There is no other FT markup see so all I worry about it the preservation of whitespace, which &lt;pre&gt; should solve. Thanks</p>",
        "id": 197370743,
        "sender_full_name": "Angus Millar",
        "timestamp": 1589348305
    }
]