[
    {
        "content": "<p><a href=\"http://portal.lighthouse.vaftl.us\" target=\"_blank\" title=\"http://portal.lighthouse.vaftl.us\">http://portal.lighthouse.vaftl.us</a></p>",
        "id": 153970598,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1529434802
    },
    {
        "content": "<p>I do not see where the smart end points are documented, nor can I get the conformance statement to find out what they are...</p>",
        "id": 153970619,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529437726
    },
    {
        "content": "<p>...I asked for details using their form...</p>",
        "id": 153970638,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529440985
    },
    {
        "content": "<p>apparently they have not published a conformance statement... but there's no SMART end point information available anywhere else either</p>",
        "id": 153970656,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529457393
    },
    {
        "content": "<p>Grahame, sorry for the delay. I was talking to some coworkers to make sure I understood the request clearly.</p>\n<p>Our portal in the sandbox is using the following authorize and token endpoint. Actually we are just using authorize currently with an implicit grant.</p>\n<p><a href=\"https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/authorize\" target=\"_blank\" title=\"https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/authorize\">https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/authorize</a></p>\n<p><a href=\"https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/token\" target=\"_blank\" title=\"https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/token\">https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/token</a></p>\n<p>The integration with Okta is a bit of a work in progress. If you select the Register with Okta link available from the portal (select Okta Authentication button) you will create an account and be automatically added to trusted developers group. That will allow you to get tokens from within the portal app.</p>\n<p>When you register for an Okta account you also provide the app type and your app redirect for the application you are developing.  I will need to work more with Okta on how a developer can register their app and get their own assigned client Id for direct calls from their own app.</p>\n<p>Does this help? If you have more questions, can we get together and discuss Thursday morning with some of my coworkers?</p>\n<p>Andy</p>",
        "id": 153970837,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529515319
    },
    {
        "content": "<p>I also have someone adding the conformance statement to our API in the sandbox. It is in our production deployment but was left out by accIdent in the sandbox during our move to deploy to AWS.</p>",
        "id": 153970856,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529519757
    },
    {
        "content": "<p>What would be helpful (needed?) is implementing SMART - so that clients can figure out the OAuth end points from the FHIR conformance, and they can get the patient ID</p>",
        "id": 153970859,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529520447
    },
    {
        "content": "<p>and yes, something is needed to register the apps (and maintain those registrations)</p>",
        "id": 153970861,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529520538
    },
    {
        "content": "<p>..and SMART = code grant, not implicit</p>",
        "id": 153970862,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529520726
    },
    {
        "content": "<p>(SMART specs are at <a href=\"http://docs.smarthealthit.org/authorization/\" target=\"_blank\" title=\"http://docs.smarthealthit.org/authorization/\">http://docs.smarthealthit.org/authorization/</a>)</p>",
        "id": 153970871,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529521909
    },
    {
        "content": "<p>thanks Andy. The the 2 end-points are what I was looking for, but I also need a client id</p>",
        "id": 153970891,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529528023
    },
    {
        "content": "<p>This is the call the portal makes (all scopes specified) so it has the portal client id; but when you execute outside the portal I'm getting a Page Not Found on the redirect; I'm checking on that. I also have an email out to Okta asking about the ability of developers to register their own app and get their own client id after they have created an Okta account. That might be the best approach. I'll update here when I hear back from them.</p>\n<p><a href=\"https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/authorize?response_type=token&amp;client_id=0oaf386le9GqRz4y80h7&amp;redirect_uri=http://portal.lighthouse.vaftl.us/authorization&amp;scope=patient/Patient.read+patient/AllergyIntolerance.read+patient/Medication.read+patient/Immunization.read+patient/Condition.read&amp;state=fjkldahfkaew3295&amp;nonce=12345\" target=\"_blank\" title=\"https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/authorize?response_type=token&amp;client_id=0oaf386le9GqRz4y80h7&amp;redirect_uri=http://portal.lighthouse.vaftl.us/authorization&amp;scope=patient/Patient.read+patient/AllergyIntolerance.read+patient/Medication.read+patient/Immunization.read+patient/Condition.read&amp;state=fjkldahfkaew3295&amp;nonce=12345\">https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/authorize?response_type=token&amp;client_id=0oaf386le9GqRz4y80h7&amp;redirect_uri=http://portal.lighthouse.vaftl.us/authorization&amp;scope=patient/Patient.read+patient/AllergyIntolerance.read+patient/Medication.read+patient/Immunization.read+patient/Condition.read&amp;state=fjkldahfkaew3295&amp;nonce=12345</a></p>",
        "id": 153970892,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529528593
    },
    {
        "content": "<p>I wanted to remind everyone and encourage them to visit the VA API Developer Sandbox (<a href=\"http://portal.lighthouse.vaftl.us\" target=\"_blank\" title=\"http://portal.lighthouse.vaftl.us\">http://portal.lighthouse.vaftl.us</a>) and to register with both the portal and Okta via the Okta Authentication button (via the portal). While the portal will be available beyond this week, the ability to register as an Okta trusted developer so you can request access tokens for use with the API calls to ~7000 synthetic veterans (and growing)  may only be open to all this week. Once you are a registered with Okta, you will be able to request tokens beyond this week. Visit the Getting Started page on the portal for more details. I will be upstairs on the mezzanine from 10-11 today to answer any questions. If you can't find me, you can reach me at 321-272-9516.</p>",
        "id": 153970932,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529580072
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  <span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span>    The conformance statement has been added to the API in the sandbox (<a href=\"https://lighthouse.vaftl.us/metadata\" target=\"_blank\" title=\"https://lighthouse.vaftl.us/metadata\">https://lighthouse.vaftl.us/metadata</a>). I'm verifying with Okta on the client id for each developer and also checking to see if they are supporting more than just implicit grant currently. If not, we will need to change that as well. I will update here as I get those answers.</p>",
        "id": 153971035,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529627402
    },
    {
        "content": "<p>Thanks Andy. Conformance looks good</p>",
        "id": 153971044,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529635358
    },
    {
        "content": "<p>@Grahame Grieve @Michele Mottini @Dave Carlson: To get your Okta client id/secret go to <a href=\"https://va.oktapreview.com\" target=\"_blank\" title=\"https://va.oktapreview.com\">https://va.oktapreview.com</a> and login. Then hit \"Admin\" at upper right. Then \"My Applications\" link at the top right of the next page. Then select \"Manage Your App\". Select the hyperlink for your app (should be \"DEV - &lt;email&gt; -&lt;client id&gt;\"). After that you can go to the \"General\" tab and you should be able to set up grant types, re-direct, and view client secret. Let me know if that works OK for you.</p>",
        "id": 153971078,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529668109
    },
    {
        "content": "<p>Tried with out test Web app (<a href=\"https://demo.careevolution.com/SMARTest/SMARTest.html\" target=\"_blank\" title=\"https://demo.careevolution.com/SMARTest/SMARTest.html\">https://demo.careevolution.com/SMARTest/SMARTest.html</a>) and it does not work because the token end point does not support CORS</p>",
        "id": 153971134,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529675504
    },
    {
        "content": "<p>(Browser console error message: Failed to load <a href=\"https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/token\" target=\"_blank\" title=\"https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/token\">https://va.oktapreview.com/oauth2/ausf3a1z7uI5V3xjU0h7/v1/token</a>: Response to preflight request doesn't pass access control check: No 'Access-Control-Allow-Origin' header is present on the requested resource. Origin '<a href=\"https://demo.careevolution.com\" target=\"_blank\" title=\"https://demo.careevolution.com\">https://demo.careevolution.com</a>' is therefore not allowed access.)</p>",
        "id": 153971137,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529675517
    },
    {
        "content": "<p>Tried with our production app - that has a server and so does not require CORS: I was able to complete the authentication sequence, but there is no support for the launch/patient scope and no patient ID is returned in the token response....how  can an app figure out the FHIR patient ID?</p>",
        "id": 153971158,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529677571
    },
    {
        "content": "<p>Some things about Okta:</p>",
        "id": 153971159,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529677688
    },
    {
        "content": "<p>1) It requires two factor authentication and it offers you to save it for no longer than 30 minutes - that is a bit drastic (I think the 'standard' is more like 30 days)</p>",
        "id": 153971160,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529677734
    },
    {
        "content": "<p>2) Eventually there should be a way to create and manage more than one app</p>",
        "id": 153971161,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529677774
    },
    {
        "content": "<p>3) There should be some test logins corresponding to test patients to use for apps - now I am logging in with my own identity but it would not match any of you test patient data (maybe they already exist but I could not find them)</p>",
        "id": 153971162,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529677847
    },
    {
        "content": "<p>We are working with Okta to embed the patient ICN in the token (and support the launch /patient scope); since we are currently supporting a patient getting his/her own records, we will need Okta to use an API to MVI (Master Veteran's Index) to return a veteran's patient ICN and then they can store that in their universal directory and include in future tokens . In the sandbox right now we are not yet matching the patient ICN from the token to the ICN requested in the API call.  So you can read /search any of the 7000 current patients (some provided in the GettingStarted page). But what you are talking about will be coming  So, agree with your #3 above that we need some test patients (with published login credentials) so that we can pre-populate with the synthetic data patient id so the token id would match.</p>",
        "id": 153971163,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529678189
    },
    {
        "content": "<p>I appreciate you checking this out and your feedback!</p>",
        "id": 153971164,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529678316
    },
    {
        "content": "<p>OK, great, thanks Andy</p>",
        "id": 153971165,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529678925
    },
    {
        "content": "<p>Our app expects the patient ID, so I am sort of stuck testing, but maybe I can patch it to use a hard-coded patient ID to try to import some data</p>",
        "id": 153971166,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529678977
    },
    {
        "content": "<p>I hard-coded one of the test patient ID and I was able to import data (medications and conditions) without problems</p>",
        "id": 153971197,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529681884
    },
    {
        "content": "<p>Two things I noticed:</p>",
        "id": 153971198,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529681927
    },
    {
        "content": "<p>1) Various resources references Encounter, but the Encounter resource is not supported, so those references cannot be resolved</p>",
        "id": 153971199,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529681965
    },
    {
        "content": "<p>2) Searches with _count greater than 20 fail - I think most server just ignore _count values that are out of valid range, defaulting to the closest valid range</p>",
        "id": 153971203,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529682122
    },
    {
        "content": "<p>Thanks for that. I expect the Encounter issue as the DB tables have  been loaded for 7 resources thus far. More coming. I’ll talk to the team on the _count comment. You can get to all the data by using value 20 or less and then specifying the desired page, correct?</p>",
        "id": 153971208,
        "sender_full_name": "Andy Stein",
        "timestamp": 1529682481
    },
    {
        "content": "<p>FHIR doesn't support specifying a desired page - you just navigate the \"next\" link until you get to where you want to be.</p>",
        "id": 153971225,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529685689
    },
    {
        "content": "<p>Yes, I can get all the data following the next links - works fine</p>",
        "id": 153971241,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1529689465
    },
    {
        "content": "<p>I updated the \"Getting Started\" page on the portal with the steps to access the assigned client id and secret from Okta for your application as well as how to access the grant type configuration. With this you should be able to integrate the API into your application (as Michele has done).  </p>\n<p>We will be changing the API behavior (in production and sandbox) to have the behavior that Michele mentioned in regard to bundles, i.e. don't return an error if _count exceeds the server maximum, but instead use the max _count for the server.</p>\n<p>Still need to get with Okta  on the launch/patient scope and including the patient id in the delivered tokens. Also, need to check if we can create a few test patient accounts and publish credentials so developers and use that to simulate a patient logging into the application authorizing access to his/her own information.</p>",
        "id": 153971761,
        "sender_full_name": "Andy Stein",
        "timestamp": 1530014189
    },
    {
        "content": "<p>Thanks Andy</p>",
        "id": 153971772,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1530016940
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196192\">@Andy Stein</span> </p>\n<p>Chris from Verily - my other question regarding OAuth was whether there are plans to support the \"patient/*.read\" scope?</p>\n<p>Thanks! Looking forward to when Okta supports the patient ID in the token, for now we'll hardcode a patient ID too for testing.</p>",
        "id": 153975029,
        "sender_full_name": "Chris Geiersbach",
        "timestamp": 1531442927
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195461\">@Chris Geiersbach</span>  Yes, wildcard scopes was on our to-do list for Okta. Okta is under a separate agreement with the VA (via FTC) so we are presenting them our wish list, but launch/patient, wildcard read, and patient id embedded in the token are all on our list. We have provided them our needs for supporting SMART on FHIR and they are reviewing. We are supposed to get together with them again next week to review.</p>",
        "id": 153975030,
        "sender_full_name": "Andy Stein",
        "timestamp": 1531443134
    },
    {
        "content": "<p>@Chris Geiersbach update for you. Okta has added support for the \"patient/*.read\". We have not put that on our portal yet, but if you are integrating directly from your SMART App, it's there now.  Okta also supports offline_access scope and refresh tokens in the OAuth flow. They are adding support for launch/patient and embedding the patient id in the token. For that, we will add the ability in the portal allowing the developer to set a patient id for his/her own Okta account to that of a synthetic patient in the database. I will publish lists of good synthetic patients for the various resources  as well as diseases/ailments (e.g.. diabetes or lung cancer).</p>",
        "id": 153976873,
        "sender_full_name": "Andy Stein",
        "timestamp": 1532102745
    }
]