[
    {
        "content": "<p>Hello, </p>\n<p>Are there any efforts to identify conditions, observations, or procedures that may increase the likelihood of negative Vaccine side-effects? For example, someone who just had a Covid diagnosis or who has a history of allergies may want to reconsider (guesses at why it may not always be safe/needed). This could be incorporated into a scheduling application. An elderly patient who already had Covid may find it safer to avoid the vaccine, for example.</p>",
        "id": 225433460,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612651047
    },
    {
        "content": "<p>The Immunization status thread covers this question (and the answer is: we are still figuring this out).</p>",
        "id": 225434027,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612652086
    },
    {
        "content": "<p>Typically, this sort of thing would get handled via CDS Hooks decision support.  (Though support for that for appointment scheduling is not widespread - or possibly even existent at all - in production as yet.)</p>",
        "id": 225439386,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612661186
    },
    {
        "content": "<p>This should be a topic that vaccination guidelines care about.</p>",
        "id": 225470264,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1612713338
    },
    {
        "content": "<p>I know a case where someone was given a vaccine against the CDC guidelines and it resulted in an unnecessary death. This stuff is important. Please consider the creed \"Do No Harm\". </p>\n<p>Cdc guidelines are here: <br>\n<a href=\"https://www.cdc.gov/vaccines/covid-19/info-by-product/clinical-considerations.html\">https://www.cdc.gov/vaccines/covid-19/info-by-product/clinical-considerations.html</a></p>",
        "id": 225476822,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612722676
    },
    {
        "content": "<p>Interoperability is in a read-only mode now (literally and metaphorical). We need a few more things to occur before we can enable meaningful use. But we are moving in the right direction. </p>\n<p>Doctors, with the patients consent and understanding, create healthcare data. So, when we create applications that are consumer facing and we are talking about provisioning care, I think we need a doctor in the loop, always.</p>",
        "id": 225477748,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612723689
    },
    {
        "content": "<p>There are risks with all interventions.  Patients die of cardiac surgery all the time - but a whole lot more would die if it didn't happen.  Without knowing the details of the case, it's difficult to judge if the action was appropriate or not.  What was the risk to the patient if not vaccinated?  Was there informed consent about the risks?  Were appropriate steps taken to manage likely risk factors? </p>\n<p>I don't really know what you're trying to say in the last part.  Certainly a doctor will <em>not</em> be in the loop for a whole lot of decisions.  In fact, one of the objectives of most healthcare systems is to ensure that all participants are practicing at \"top of license\".  Some decisions won't involve any healthcare professionals.  Others will involve healthcare professionals that aren't physicians.  Our objective is that everyone who ought to be involved in a decision can be, has access to the right information, can consume it efficiently and is guided with the best available decision support.  We're a long way from that point and evolving toward it will require incremental change (not just in interoperability, but clinical practice, billing and insurance, stakeholder education, and lots of other things).  Our job is to work with implementers to enable those steps we can at the pace industry is willing to absorb.</p>",
        "id": 225481396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612728890
    },
    {
        "content": "<p>I agree <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and thanks for the insights. </p>\n<p>I am only advocating for technology to follow medical advice not to try and lead the way. Even in the scenarios you listed there is a doctors system in the loop.</p>",
        "id": 225482854,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612730783
    },
    {
        "content": "<p>I am also trying to point out that just throwing all data into a bucket is not useful for provisioning care. Even if we understand the FHIR profiles we have to know how data was created and what it was created for too. The moral framework around healthcare technology will continously evolve (kind of like Star Trek).</p>",
        "id": 225482952,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612730916
    },
    {
        "content": "<p>It's not true that we <em>have</em> to understand how it was created and what it was created for.  There are <em>some</em> situations where that's helpful and occasional situations where it's essential.  If it was critical all the time, clinicians would be demanding it more, and systems would be supporting it more.  I'm not arguing that it shouldn't be supported or that it's not important, just saying be careful making stronger statements than the facts support.  </p>\n<p>Even if Provenance information flows freely (as US Core and USCDI now require), that doesn't mean it's going to be easy for systems to expose it in a meaningful/efficiently consumed manner.</p>\n<p>Physicians are often <em>not</em> in the loop of determining who gets immunized.  Lists of potentially elligible people are extracted from EHRs on the basis of criteria inherited from the CDC and elsewhere as well as organizational policies and perhaps a little favoratism.  The appointments get booked with front-line staff and the informed consents are handled by the same, or sometimes by a nurse.  The immunizations themselves are typically handled by a nurse or pharmacist.  That's not to say physicians are never involved, but they aren't typically - and arguing that they should be isn't terribly appropriate.  In general, I'd trust a public health nurse who's been doing immunizations for years and whose full-time job at the moment is correctly guiding Covid immunizations over that of most (not all) physicians.</p>\n<p>In any case - this is a side tangent and really has nothing to do with the question of standards development, so I'm going to stop my part of the discussion.</p>",
        "id": 225492520,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612743898
    },
    {
        "content": "<p>Sorry I should avoid blanket statements. Data used to provision care is treated differently than population health or business operations data.</p>\n<p>In the case of payer captured clinical data, the clinical concepts contained within a historical V2 feed or a CCDA document represents a subset of data that is created for a business need. These two data types are the most common clinical artifacts for payers. I cannot think of a scenario where it is preferable to use downstream data when real-time information is available.</p>",
        "id": 225492804,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612744299
    },
    {
        "content": "<p>I do feel it is important for all clinical data to be available to a provider at the point of care, even for patients without a device (regardless of EHR used).  I am primarily focused on this need and once this is solved we can work toward meaningful use.</p>",
        "id": 225492898,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612744436
    },
    {
        "content": "<p>I am not clear on who grants permission to allow someone else to make a care decision based upon a vaccine card. I thought a patient had to sign a consent form in order to be held for medical reasons. Sorry if this is abstract, but it seems the same rules apply as in other scenarios. A patient can choose a doctor and device and the doctor and patient together can determine how care is provisioned. The vaccine card seems to be missing the doctor and patient collaboration.</p>",
        "id": 225493041,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612744599
    },
    {
        "content": "<p>well, those are indeed important policy decisions.. HL7 is a Interoperability Standard Org, so we are here to provide the means for interop given the case where policy decision to do something is made. We are not here to mandate any specific policy or clinical practice. So I am not sure what more we can do, or even should entertain discussion about.</p>",
        "id": 225551125,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612794450
    }
]