[
    {
        "content": "<p>Many properties in FHIR resources are either literal, relative, internal or absolute references to other resources, and usually they type of resource being reference is constrained based on the source of the reference.  For example the MessageHeader.destation.reciever is a reference to a Practitioner or PractitionerRole or Organization, but not other types.  In this example, if MessageHeader.destation.reciever references a resource within the same bundle, schema validation can not ensure that the reference is to an allowed resource type.  What is the typical mechanism for that level of validation?  Are there published schematron rules or other approaches that can validate these constraints?</p>",
        "id": 175541777,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1568303094
    },
    {
        "content": "<p>there's a mode where you can ask the java validator to validate the type of the target reference</p>",
        "id": 175541849,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568303151
    },
    {
        "content": "<p>What does it use to validate, under the hood? is it schematron?</p>",
        "id": 175543686,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1568304362
    },
    {
        "content": "<p>no it's java code.</p>",
        "id": 175543829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568304479
    },
    {
        "content": "<p>but it will only work if the validator can actually resolve the reference. Which it can't, for instance, on a production secure interface</p>",
        "id": 175543907,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568304516
    },
    {
        "content": "<p>There's lots of validation that can't be done by schema and a fair bit that can't be done by schematron.  The HL7 java validator is the most complete code we have for checking instances.</p>",
        "id": 175553479,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568310802
    },
    {
        "content": "<p>I don't have a lot of schematron experience, but I do know that it provides a re-usable and componentized set of rules, which can be consumed in a number of environments.  I suspect the instance checking is something that schematron just can't do, which is a shame.  We're building in a .net environment.  is there anything readily available?</p>",
        "id": 175556279,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1568312549
    },
    {
        "content": "<p>Yes, the fhir dotnet client has a vidator too.<br>\nIt's in the NuGet package HL7.FHIR.SPECIFICATION.R4 or whichever version you need.</p>",
        "id": 175576503,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1568326761
    }
]