[
    {
        "content": "<p>Hi,</p>\n<p>I see that one of the intents of <a href=\"https://www.hl7.org/fhir/graphdefinition.html\">GraphDefinition</a> is to \"Document rules about the relationship between a set of resources\". Lower in the documentation near the discussion about compartments, there is a note, \"Todo: how would this be validated? - where is the graph referred to?\".</p>\n<p>This idea was noted <a href=\"#narrow/stream/179166-implementers/topic/GraphDefinition.2C.20use.20of.20compartments/near/170435710\">here</a> as well:</p>\n<blockquote>\n<p>One of the usecases that came up was that we'd like GraphDefinition to be able to validate a tree of data, especially the linkage, since that's pretty hard to do otherwise.</p>\n</blockquote>\n<p>Is this documentation up to date? Has there been any thought put into where you might invoke this kind of validation?</p>\n<p>My use case is, roughly, that I have an application that creates/modifies FHIR resources for a user workflow. At the end of that workflow, the user clicks a button to generate a report based on the data in a graph of FHIR resources. Prior to producing this report, I want to validate that the graph of FHIR resources is in the expected state: starting at an Encounter that adheres to profile X, there exists a Patient with profile Y, an Account with profile Z, etc. I want to validate the cardinality and attached profiles of each of these linkages.</p>\n<p>Does this use case make sense? It seems like I can effectively encode the information needed for my use case in GraphDefinitions. Is there an existing operation definition of some kind that does this kind of linkage traversal validation given a GraphDefinition, or am I on my own in implementing a usage of GraphDefinition in this manner?</p>\n<p>Thanks!</p>",
        "id": 219526842,
        "sender_full_name": "Tadas Antanavicius",
        "timestamp": 1607630838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 219527057,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607630942
    },
    {
        "content": "<p>I see in <a href=\"https://www.devdays.com/wp-content/uploads/2019/12/Rene-Spronk-GraphDefinition-_-DevDays-2019-Amsterdam.pdf\">this presentation</a> that it seems to suggest placing a reference to a GraphDefinition in <code>Resource.meta.profile</code>, which seems potentially in the direction of what I'm looking for. But <a href=\"https://www.hl7.org/fhir/resource-definitions.html#Meta.profile\">Resource.meta.profile docs</a> suggests that the value needs to be a StructureDefinition, not GraphDefinition.</p>",
        "id": 219545790,
        "sender_full_name": "Tadas Antanavicius",
        "timestamp": 1607641058
    },
    {
        "content": "<p>GraphDefinition is still subject to discussion. During the last HL7 WGM a session was held to discuss how to move forward with it - but I haven't attended that session, so I'm unaware as to it outcome. Meta.profile is intended to also allow a reference to a GraphDefinition.</p>",
        "id": 219573980,
        "sender_full_name": "René Spronk",
        "timestamp": 1607673536
    },
    {
        "content": "<p>catching up on this.</p>",
        "id": 220323124,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1608251599
    },
    {
        "content": "<p>I don't believe that this is true:</p>\n<blockquote>\n<p>Meta.profile is intended to also allow a reference to a GraphDefinition.</p>\n</blockquote>",
        "id": 220323138,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1608251610
    },
    {
        "content": "<p>it would be good to fix the todo:</p>\n<blockquote>\n<p>Todo: how would this be validated?</p>\n</blockquote>",
        "id": 220323157,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1608251627
    },
    {
        "content": "<p>and I think that the most logical way to do it would be</p>",
        "id": 220323166,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1608251634
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>GET [base]/Patient/example/$validate?graph=[graph]\n</code></pre></div>",
        "id": 220323250,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1608251695
    },
    {
        "content": "<p>e.g start at the patient <code>example</code> and check that all the rules in the graph are met</p>",
        "id": 220323275,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1608251724
    },
    {
        "content": "<p>During earlier discussions (in a different stream, probably a year ago) we concluded that profile could be used to reference a graphDefinition.</p>",
        "id": 220347380,
        "sender_full_name": "René Spronk",
        "timestamp": 1608281032
    },
    {
        "content": "<p>So what has been decided at the WGM re: the future of GraphDefinition ?</p>",
        "id": 220347434,
        "sender_full_name": "René Spronk",
        "timestamp": 1608281059
    }
]