[
    {
        "content": "<p>I have a use case where I want to validate a transaction bundle by doing a <strong>POST baseDstu3/Bundle/$validate</strong>. The bundle includes some resources that should be created. One of the validation errors i'm getting as a response is:<br>\n{<br>\n    \"severity\": \"error\",<br>\n    \"code\": \"processing\",<br>\n    \"diagnostics\": \"Bundle entry missing fullUrl\",<br>\n    \"location\": [ \"Bundle.entry[0]\", \"Line 1, Col 36\" ]<br>\n  }</p>\n<p>The STU3 spec says that the fullUrl of a Bundle entry must contain the \"<em>Absolute URL for resource (server address, or UUID/OID)</em>\". However, in this case some of the entries in the transaction bundle don't exist yet (they are of request type POST), and as I cannot tell the server what ID to use, there is no way for me to predict what the fullUrl should be.</p>\n<p>Feels like this is a chicken/egg problem, where I want to validate my transaction before creating a set of (possible invalid) resources, but I can't validate the resources because they have not been created yet. Is there a way around this? Any help would be very much appreciated :)</p>",
        "id": 197130302,
        "sender_full_name": "Job Schipper",
        "timestamp": 1589195834
    },
    {
        "content": "<p>You are right but that is specifically what the urn:uuid version of the reference is for. You just generate a random one, and put that in fullUrl and it whatever references that fullUrl. They act as placeholders, and get replaced by the actual server assigned ids.</p>",
        "id": 197132049,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1589196915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> thanks, i will give that a try!</p>",
        "id": 197134310,
        "sender_full_name": "Job Schipper",
        "timestamp": 1589198215
    },
    {
        "content": "<p>works nicely! great</p>",
        "id": 197136241,
        "sender_full_name": "Job Schipper",
        "timestamp": 1589199347
    }
]