[
    {
        "content": "<p>A ServiceRequest would typically be valid until a certain date.  What would be exact meaning behind ServiceRequest.occurence - that is defined as \"When service <em>should</em> occur\"? - what if a ServiceRequest would be fulfilled after the date set in .occurence, should that be a problem? How to define a ServiceRequest <em>shall</em> be fulfilled by a certain date after which date is it no longer supposed to be used?</p>",
        "id": 198914551,
        "sender_full_name": "Robin Bosman",
        "timestamp": 1590595829
    },
    {
        "content": "<p>A ServiceRequest represents an authorization.  If something is done that's outside what's described by the ServiceRequest, then it technically doesn't fall within the scope of the authorization.  In practice, there tend to be business rules and some degree of professional discretion around variation - and how much variation is permitted before you get in trouble for doing something without appropriate authorization.</p>",
        "id": 198914809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590595969
    },
    {
        "content": "<p>Tx! On a related note: if I want to know when the thing that was authorized by the ServiceRequest was actually done I would look for the .basedOn in the Procedure/Observation/... that refers to that ServiceRequest , right?</p>",
        "id": 198988948,
        "sender_full_name": "Robin Bosman",
        "timestamp": 1590649389
    },
    {
        "content": "<p>If both the ServiceRequest and the thing that was authorized are recorded in the same system, then most likely the .basedOn will refer directly to the original ServiceRequest. If the observation/procedure was performed in a different system, the .basedOn may be referencing a local copy or modified instance of the ServiceRequest, which in turn will have .basedOn referencing the original.</p>",
        "id": 199018353,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1590670787
    },
    {
        "content": "<p>That is very clear - tx for the extra details you provided in your answer!</p>",
        "id": 199028015,
        "sender_full_name": "Robin Bosman",
        "timestamp": 1590675488
    }
]