[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> A broad question: I appreciate the point you make, for example at the Sydney WGM, that servers should not rely on <code>meta.profile</code> conformance claims for their validation. A Dutch hospital system should not refuse a patient instance just because it claims to conform to the German Patient profile, it should test whether it conforms to the Dutch Patient profile to see if it has everything it needs to work with it.</p>\n<p>However, is there any way around <code>meta.profile</code> conformance claims for the resources that are more likely to have a large number of profiles, like Observation or DiagnosticReport? How would a server know that this Observation instance is meant by the sender as a BP Observation without the conformance claim? How can a Dutch hospital accept a BP observation that only claims conformance to a German BP Observation profile or no profile at all?</p>\n<p>Some imperfect ideas:</p>\n<ol>\n<li>Test it against any Observation profile and see what validates. This might lead to multiple matches though, besides being costly.</li>\n<li>Build a set of rules in the server that will guide instances based on base resource and codes in the instance to the right profile to validate against.</li>\n<li>Perhaps IF it has a claim to the German BP profile you could do some 'most recent common ancestor' search to find the best matching profile in my server...</li>\n</ol>",
        "id": 203370639,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1594290212
    },
    {
        "content": "<p>we talked about this an agree that we're going to define an extension for a CapabilityStatement so that a server can declare what properties of a resource map to which profiles</p>",
        "id": 203371636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594291234
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> did you ever write that blog post that stated the issues that you believe exists when declaring profiles?</p>",
        "id": 203372815,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1594292502
    },
    {
        "content": "<p>no it's still on my todo list. Don't worry. It's getting shorter by the day</p>",
        "id": 203375051,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594294472
    },
    {
        "content": "<p>by a negative number</p>",
        "id": 203375053,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594294478
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Interesting, thanks. So the server is going to declare those rules (with FHIR Path?) I mentioned as 2., like: \"If your base resource is Observation and your code is this SNOMED code I'm going to treat you as a BP Observation\"?</p>",
        "id": 203397978,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1594307362
    },
    {
        "content": "<p>But even if you have some properties that help a server in determining which profile, or which set of profiles, is likely to apply, one would still have to do Ward's step 1. So that's kind of creating an index to make step 1 less costly.</p>",
        "id": 203398561,
        "sender_full_name": "René Spronk",
        "timestamp": 1594307643
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> yes<br>\n<span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> yes, but it's <em>very much</em> less costly</p>",
        "id": 203437729,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594327376
    },
    {
        "content": "<p>if people have better ideas, we're all ears</p>",
        "id": 203437767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594327397
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"203235\">Ward Weistra</span> <a href=\"#narrow/stream/179166-implementers/topic/Validating.20without.20conformance.20claims/near/203370639\">said</a>:</p>\n<blockquote>\n<p>How would a server know that this Observation instance is meant by the sender as a BP Observation without the conformance claim? </p>\n</blockquote>\n<p>It has to recognise one of the values of Observation.code as a code for BP, if it does not recognise code, it can do little.</p>\n<blockquote>\n<p>How can a Dutch hospital accept a BP observation that only claims conformance to a German BP Observation profile or no profile at all?</p>\n</blockquote>\n<p>It tests every observation with a code that it recognises as being a code for BP against its own BP profile</p>",
        "id": 204050432,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1594881732
    }
]