[
    {
        "content": "<p>Hello,</p>\n<p>I have tried running a searchset Bundle through the <a href=\"https://inferno.healthit.gov/validator/\">FHIR validator</a> and have been running into issues around OperationOutcomes in the \"entry.resource\" section flagging some errors around not having a resource ID or resource fullURL. Are these fields required for OperationOutcome's? If so, what should go here if these are not persisted resources?</p>\n<div class=\"codehilite\"><pre><span></span><code>Bundle.entry[0]: Except for transactions and batches, each entry in a Bundle must have a fullUrl which is the identity of the resource in the entry on line 4.\nBundle.entry[0].resource.ofType(OperationOutcome): Resource requires an id, but none is present on line 6.\n</code></pre></div>\n<div class=\"codehilite\"><pre><span></span><code>{\n  &quot;resourceType&quot;: &quot;Bundle&quot;,\n  &quot;entry&quot;: [\n    {\n      &quot;resource&quot;: {\n        &quot;resourceType&quot;: &quot;OperationOutcome&quot;,\n        &quot;issue&quot;: [\n          {\n            &quot;severity&quot;: &quot;error&quot;,\n            &quot;code&quot;: &quot;code-invalid&quot;\n          }\n        ]\n      }\n    }\n  ],\n  &quot;total&quot;: 1,\n  &quot;type&quot;: &quot;searchset&quot;\n}\n</code></pre></div>",
        "id": 234244684,
        "sender_full_name": "Brian Forbis",
        "timestamp": 1618269494
    },
    {
        "content": "<p>For clarity, the assumption here that fatal errors would return just an operation outcome, where as search warnings would return OperationOutcomes inside of the Bundle along side any applicable search results, if any exist.</p>",
        "id": 234748679,
        "sender_full_name": "Brian Forbis",
        "timestamp": 1618519093
    },
    {
        "content": "<p>We don't have any exceptions around requirements for ids and URLs on OperationOutcomes vs. other resources in the Bundle, though it might be reasonable for us to do so.  (Whether we can get away with doing that given that Bundle is normative, I'm not clear on).  Feel free to submit a change request.</p>",
        "id": 234883790,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618590571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> where might I submit that request?</p>",
        "id": 234885577,
        "sender_full_name": "Brian Forbis",
        "timestamp": 1618591282
    },
    {
        "content": "<p>Use the \"propose a change\" link at the bottom of any page in the spec.  (There's a one-time registration required and someone will manually confirm you look like a real human, but after that, you should be able to submit requests at will.)</p>",
        "id": 234885843,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618591409
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I don't see anything in the fhir spec that documents those two rules, that each entry in a bundle must have a <a href=\"http://resource.id\">resource.id</a> and a fullUrl. Am I missing it? Do you have a link to docs that define those rules? the two fields are 0..1 in the spec so it seems to me that we shouldn't have to provide them</p>",
        "id": 235576913,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1619037388
    },
    {
        "content": "<p>For fullURL, there is this stataement:<br>\n<a href=\"http://hl7.org/fhir/bundle.html#bundle-unique\">http://hl7.org/fhir/bundle.html#bundle-unique</a></p>\n<blockquote>\n<p>Except for transactions and batches, each entry in a Bundle must have a fullUrl which is the identity of the resource in the entry.</p>\n</blockquote>\n<p>I couldn't find anything around <a href=\"http://resource.id\">resource.id</a>.</p>",
        "id": 235577853,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1619037875
    },
    {
        "content": "<p>The requirement around id depends on what you're doing - if you're submitting a batch or a transaction, the resource in the entry must match the rules for what you'd need if you were submitting the resource directly.  So, for example, the language in \"update\" is \"The request body SHALL be a Resource with an id element that has an identical value to the [id] in the URL\".  We probably don't actually need to say anything about id from the perspective of OperationOutcome though because there's no rules anywhere requiring it to have an id.</p>",
        "id": 235589936,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619042764
    }
]