[
    {
        "content": "<p>I am still not clear on how and when to use all the artifacts produced by the ig publisher.   As discussed <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/NHS.20FHIR.20Publisher\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/NHS.20FHIR.20Publisher\">here</a> and other places there is a <code>validation.pack</code>  and I have used that to validate individual resources  like this. ( using bash script variables )</p>\n<div class=\"codehilite\"><pre> java -jar /Users/ehaas/Downloads/validator/org.hl7.fhir.validator.jar ${fs} -defn /Users/ehaas/Downloads/igpack.zip -ig &quot;${path}&quot;/output/validator.pack\n</pre></div>\n\n\n<p>There are also definition files: <code>definitions.xml.zip</code> and <code>definitions.json.zip</code>  are they used for resource validation or only  when your guide depends on another IG?  Is validator.pack needed for this as well?</p>\n<p>Also the IG publisher can be used in \"validation mode\"  (my words)  If I add instances to the IG and run it, 0 will do the same validation on those instances as the jar file above?   For some reason the CLI tool takes longer than running the IG publlsher so  I am considering this as another validation option.</p>",
        "id": 153866044,
        "sender_full_name": "Eric Haas",
        "timestamp": 1483919538
    },
    {
        "content": "<p>the validator produces (or may produce) several different zip files. The most significant is \"validator.pack\". This is a zip file that contains all the conformance &amp; example resources, a version marker, and a json file that lists all the pages and urls in the ig itself. This file is used:<br>\n- by the vaidator if you refer to the IG directly by it's canonical URL<br>\n- by the IG publisher if you declare that one IG depends on another<br>\n- by my server, if you add the IG to server load list</p>",
        "id": 153866046,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483922458
    },
    {
        "content": "<p>in addition, the IG publisher will generate definitions.[fmt].zip (unless instructed not to) - these may be useful for other tools that have format specific requirements, and must have json, xml., or ttl inputs. None of the tools that I work on will use them </p>",
        "id": 153866047,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483922544
    },
    {
        "content": "<p>Thanks for that clarification.  mind if I add that to the IG publisher documentation?</p>",
        "id": 153866050,
        "sender_full_name": "Eric Haas",
        "timestamp": 1483926680
    },
    {
        "content": "<p>sure, good idea</p>",
        "id": 153866051,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483927225
    },
    {
        "content": "<p>Any ideas on approaches to Testing IG's - or testing implementations and there after information exchanges against published IG's?  Is it fair to comment that the validator can not assure the IG / Profile is/are being adhered to during normal workflow operations (beyond the basic structure/schematron) - would we improve the efforts by having an initial base level of associated test(s)?  With advanced testing as a follow on later? Thoughts and feedback welcomed - </p>",
        "id": 153866122,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1483992515
    }
]