[
    {
        "content": "<p>Is it possible to extend an existing ValueSet defined in a resource with binding strength of required to include new values? The Publisher tool is not finding my new ValueSet values for a field when trying to constrain the field to my new ValueSet. I've tried explicitly including all valid values from the parent ValueSet in my ValueSet. Is it possible to extend a required binding strength ValueSet in this manner or is this a bug in the publisher tool?</p>",
        "id": 246753145,
        "sender_full_name": "Mike Lohmeier",
        "timestamp": 1626888992
    },
    {
        "content": "<p>no.  if a binding is required and points to an existing value set, the only thing that can introduce new values is to have the existing value set expanded to include the values.  you can't override it with a different value set.  From the spec 4.1.5.1:</p>\n<blockquote>\n<p>When an element is bound to a required value set, derived profiles may state rules on which codes can be used, including removing codes from allowed use, but cannot specify new or additional codes for these elements.</p>\n</blockquote>\n<p>You could slice the element if it is a CodeableConcept to add a new slice that used your value set, but you're stuck with the required binding to have to send one of the existing codes.</p>",
        "id": 246754487,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1626889677
    },
    {
        "content": "<p>If you think that a required binding valueset doesn't have all the values needed to describe the concept, petition the owner of the valueset to add more values. Just for fun, I'd be interested in what value set you think needs new value (and what they are). Perhaps you are trying to put the wrong concept into that attribute?</p>",
        "id": 246756708,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626890586
    },
    {
        "content": "<p>Thanks, in this particular case we inadvertently referenced the wrong code in our fsh files.</p>",
        "id": 246867287,
        "sender_full_name": "Mike Lohmeier",
        "timestamp": 1626969620
    }
]