[
    {
        "content": "<p>The ValueSet resource expansion/contains only has code and display elements. Can I represent synonyms using the contains element by having multiple elements with the same code and the synonym term in display or is display reserved for preferred terms only?</p>",
        "id": 153824088,
        "sender_full_name": "Heath Frankel",
        "timestamp": 1462148571
    },
    {
        "content": "<p>you could have multiple elements with the same code, yes. that's certainly the intent</p>",
        "id": 153824092,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462155984
    },
    {
        "content": "<p>OK, great. However, there is no means to determine if this ValueSet.expansion.contains.display value is a synonym or preferred term in which case it is not possible to determine if the display value can be used in the Coding.display element or if it should be provided in the Codable.text. </p>",
        "id": 153824113,
        "sender_full_name": "Heath Frankel",
        "timestamp": 1462160058
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191424\">@Heath Frankel</span> ValueSet.compose.include.concept.designation.use enables you to indicate whether a concept contains a fully specified name, preferred term or synonym... <a href=\"http://hl7.org/fhir/2016May/valueset-designation-use.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2016May/valueset-designation-use.html\">http://hl7.org/fhir/2016May/valueset-designation-use.html</a>.  However, there does not appear to be an equivalent property in ValueSet.expansion.contains...but, of course, I may be missing something.</p>",
        "id": 153824116,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1462161359
    },
    {
        "content": "<p>I don't think there's any rule about what display label has to appear in Coding.display.  It isn't required to be the preferred term, though it might often be.</p>",
        "id": 153824119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1462161688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , the rules in the NEHTA CDA Validator Rules regarding the mandatory use of Preferred terms in CD displayName is a localised rule rather than something recommended/enforced by HL7?</p>",
        "id": 153824122,
        "sender_full_name": "Heath Frankel",
        "timestamp": 1462165888
    },
    {
        "content": "<p>yes it is. specifically, HL7 says you can use any valid display there</p>",
        "id": 153824124,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462171180
    },
    {
        "content": "<p>there's the $lookup operation to get it if you need it.</p>",
        "id": 153824125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462171192
    },
    {
        "content": "<p>Doesn't NEHTA have a partner rule that you must show the preferred term in an expansion? </p>",
        "id": 153824126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462171219
    },
    {
        "content": "<p>Please advise what are the best practices for presenting SNOMED terms?<br>\nFor example, Pulmonologist is listed in SNOMED as <code>Respiratory disease specialist (occupation)</code>:<br>\n41672002 | Respiratory disease specialist (occupation) |<br>\n   Respiratory disease specialist<br>\n   Respiratory disease specialist (occupation)<br>\n   Respiratory physician<br>\n   Pulmonologist<br>\nWhich display value we are allowed to use in a drop down list in an application? <br>\nCan we have several values (synonyms) displayed in the drop down list e.g. both Pulmonologist and Respiratory disease specialist? <br>\nOr can we edit the display value to be <code>Respiratory disease specialist (Pulmonologist)</code> in our drop down?</p>",
        "id": 153855087,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1478093334
    },
    {
        "content": "<p>From a FHIR point of view, you can use any of the SNOMED CT displays. You can specify your own display too, using ValueSet.compose.include.concept.display. </p>",
        "id": 153855101,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478112381
    },
    {
        "content": "<p>I'm not sure about including the same concept twice with different displays. Moved to the terminology stream for discussion</p>",
        "id": 153855102,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478112414
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191329\">@Aleksandra Pavlyshina</span> The IHTSDO provides guidance on this.  There best practice is to use the synonym defined as the \"preferred term\" - there is a Language Reference Set that does this in thr RF2 release data.  You should not use the \"Fully Specified Name\" (the one with '(occupation)' on the end) in most cases.<br>\nFurthermore, you shoud normally only ever display a concept once in a selection list since displaying it several times with different labels can suggest (incorrectly) that they mean different things.<br>\nNote, technically, it is also allowed to display any of the synonyms that are tagged as \"Acceptable\", but better to avoid doing this unless you have very good reasons and understand the implications.</p>",
        "id": 153857612,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479433436
    },
    {
        "content": "<p>it's kind of weird advice to say \"you shoud normally only ever display a concept once in a selection list since displaying it several times with different labels can suggest (incorrectly) that they mean different things\" - if the different labels aren't actually different, why are they present? if they are actually different, why would a user not need to have them as an option?</p>",
        "id": 153857643,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479449906
    },
    {
        "content": "<p>There are multiple synonyms for a range of reasons including:</p>\n<ul>\n<li>aids in searching</li>\n<li>different spellings</li>\n<li>different preferences in different contexts</li>\n<li>historical reasons</li>\n<li>other<br>\nUltimately, it's a reference terminology, so the base content includes multiple ways to say the same thing.  But depending on how the content is displayed in a UI (and whether that UI is for data capture or back-office analytics or ...), it may/may not be appropriate to expose all the associated labels.<br>\nBest practice for a data capture/entry scenario (ie where you need an interface terminology) is to only display a concept once, major EMR vendors notwithstanding.<br>\nIHTSDO guidance on this is here <a href=\"https://confluence.ihtsdotools.org/display/DOCSEARCH/5.1.3+Avoid+Multiple+Hits+on+the+Same+Concept\" target=\"_blank\" title=\"https://confluence.ihtsdotools.org/display/DOCSEARCH/5.1.3+Avoid+Multiple+Hits+on+the+Same+Concept\">https://confluence.ihtsdotools.org/display/DOCSEARCH/5.1.3+Avoid+Multiple+Hits+on+the+Same+Concept</a> although I think they could/should say this a lot more strongly.</li>\n</ul>",
        "id": 153857647,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479450983
    },
    {
        "content": "<p>Are synonyms a thing that works now? Based on the Fhir spec it seems like I should be able to add designations and use <code>includeDesignations=true</code>on a ValueSet expand to include synonyms. But I think I may be confused by that param, is it supposed to override or add in copies of the same concept but with a different display in the expanded set. I want something like $expand?includeDesignations=true -&gt; [ sex|male,  sex|maleSynonym,  sex|female ]</p>\n<p>Regardless of what I try it always just returns [ sex|male,  sex|female ] with no synonyms</p>",
        "id": 153927536,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1514998678
    },
    {
        "content": "<p>it's not clear what you mean my synonyms - alternate displays, or alternative codes.</p>",
        "id": 153927566,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515014269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Alternate displays. I'd like to be able to have an expanded list for a dropdown that has multiple displays that map to the same concept.</p>",
        "id": 153927576,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1515020205
    },
    {
        "content": "<p>great - so there's a question here. I think that include designations means to add additional designations on the contains in the expansions, not to add additional contains. But that's purely arbitrary - suggest we take this up on the terminology stream</p>",
        "id": 153927594,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515059021
    }
]