[
    {
        "content": "<p>One more (hopefully) question -- does FHIR specify a conformance for \"FHIR-official\" value set contents?  In other words, can anyone use any values for any value set?  Or are the contents of some value sets mandatory (or \"highly recommended\") and defined as part of FHIR?  If there is a conformance definition for value sets, where is it?  I did not yet find such a property on any of the value sets.</p>\n<p>Thanks,</p>\n<p>Jon</p>",
        "id": 206616364,
        "sender_full_name": "Jon Handler",
        "timestamp": 1597172293
    },
    {
        "content": "<p>I don't understand your question. The conformance is associated with the bindings in the element definitions in resources and profiles</p>",
        "id": 206651713,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597196499
    },
    {
        "content": "<p>My apologies -- I probably used the wrong term when I wrote \"conformance.\"  Perhaps the proper term was \"Binding Strength\"?  In any event, I just want to understand whether FHIR ever mandates or recommends the use of a specific value set, or can anyone use anything for any value set?  Purely for example, consider Account Status (<a href=\"https://www.hl7.org/fhir/valueset-account-status.html\">https://www.hl7.org/fhir/valueset-account-status.html</a>).  Does FHIR mandate the use of these values?  Are these recommended values?  Can alternative values be used?  If these are mandated or recommended values, what metadata lets us know whether a Value Set on the FHIR website is mandatory, recommended, or purely provided as example? </p>\n<p>Thanks so much!</p>\n<p>Jon</p>",
        "id": 206655903,
        "sender_full_name": "Jon Handler",
        "timestamp": 1597201725
    },
    {
        "content": "<p>well, if you look at this page, there's this:</p>",
        "id": 206656072,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597201932
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/D2TW2UPWAGblZ5gDll18mwWl/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/D2TW2UPWAGblZ5gDll18mwWl/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/D2TW2UPWAGblZ5gDll18mwWl/image.png\"></a></div>",
        "id": 206656078,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597201956
    },
    {
        "content": "<p>the last line tells you that this value set is used in Account.status, and when it is, it's the required value set - the status code must be from the value set</p>",
        "id": 206656085,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597201993
    },
    {
        "content": "<p>Grahame -- you are awesome!!!  Thank you!  I've been looking for that everywhere, and it's been in front of my face the whole time.  :)  </p>\n<p>Thank you.</p>\n<p>Jon</p>",
        "id": 206656380,
        "sender_full_name": "Jon Handler",
        "timestamp": 1597202411
    }
]