[
    {
        "content": "<p>Hello,<br>\nWe have to model some devices that have a  characteristic called \"focal length\".  Should we use a DeviceMetric resource for the characteristic, or should we use a DeviceComponent. If we use a DeviceMetric with category=setting, where should we keep the value of the characteristic?</p>",
        "id": 153976038,
        "sender_full_name": "Grigoreta Cojocar",
        "timestamp": 1531912490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ?</p>",
        "id": 153976072,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531925571
    },
    {
        "content": "<p>Device metric decsribe the setting <em>capability</em>  not sure if an  how it handles the settings actual value.  <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> ?</p>",
        "id": 153976085,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531929687
    },
    {
        "content": "<p>You need an observation to convey the value. Observation.device refers to the DeviceMetric, and DeviceMetric.category indicates that this is a setting.</p>",
        "id": 153976112,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1531936799
    },
    {
        "content": "<p>Device and DeviceComponent are being merged.  So you should soon have the ability to specify Device.property directly.  There are actually two different types of device properties.  There are some that are innate to the device that are determined during manufacturing/production and are unchangeable.  (You can't take a 5cc syringe and convert it to a 10cc syringe.)  There are other properties that are changeable and time-bound - for example the seat height of an adjustable wheelchair, the configuration parameters of a pacemaker, etc.  I believe the intention is that Device.property is going to be used for the former and Observation for the latter?</p>",
        "id": 153976118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531938582
    },
    {
        "content": "<p>Yes, that's my understanding. Device(Component).property is used for static properties, mainly for PHD devices.</p>",
        "id": 153976120,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1531938881
    },
    {
        "content": "<p>So if the focal length is a fixed property, use Device(Component).property.  If it's a configuration setting, use Observation.</p>",
        "id": 153976121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531939409
    },
    {
        "content": "<p>Why can't DeviceMetric have variables?  It seems like DeviceMetric would a natural place to define device settings using a name value pair - sounds more logical to me instead of overloading Observation even more.?  Just asking...</p>",
        "id": 153976143,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531943691
    },
    {
        "content": "<blockquote>\n<p>Device metric decsribe the setting <em>capability</em>  not sure if an  how it handles the settings actual value.  <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> ?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Not really my specialty. DeviceMetric is not used by PHD. To be honest I am not sure how the DeviceMetric fits in given the Observation (I am not sure what it represents). I have an inkling it describes the measurement capabilities of the device or things about the measurements it has. In PHD settings are reported as Observations. For example, in a BCA the height may be a setting in the sense it is input as a parameter for the device and not actually measured by the device. Other observations from such devices where measurements are based upon the setting are typically referenced by source handle references.</p>\n<p>I have a feeling this does not help much!</p>",
        "id": 153976156,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1531946987
    },
    {
        "content": "<p>thanks Brian, I thought you were the expert!</p>",
        "id": 153976170,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531949225
    },
    {
        "content": "<blockquote>\n<p>thanks Brian, I thought you were the expert!</p>\n</blockquote>\n<p>Eric, You might want to ask @John Rhoads or @Stefan Karl. They are PoCD guys and use the DeviceMetric</p>",
        "id": 153976171,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1531949363
    }
]