[
    {
        "content": "<p>What is the right way to bring translations to the value sets defined as part of the FHIR specification? Is there process for this or some kind of rules? If you look some value sets defined in FHIR there are now english, deutsch, nederlands...</p>\n<p>Our need is to bring finnish and swedish translations to some of the value sets (Finland is bilingual country). </p>\n<p>If the FHIR spec value sets contain their own inline code system definitions, how we can bring translations to these? Can anyone do this, espcially in our case we think swedish translations, is that ok if we in Finland translate also the swedish ;-)</p>\n<p>If the FHIR spec value sets include codes defined elsewhere, do the translations have come from the source of codes. Or is that ok to translate codes only in value set?</p>\n<p>In general, the target of the translation can only be concept.designation.value, not other elements of the concept?</p>",
        "id": 153863427,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1481723807
    },
    {
        "content": "<p>if you look at the <a href=\"http://build.fhir.org/valueset.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset.html\">Value set definition</a>  you will see <code>ValueSet.compose.include.concept.designation</code> is useful for this when you enumerate the codes.  </p>",
        "id": 153863453,
        "sender_full_name": "Eric Haas",
        "timestamp": 1481741070
    },
    {
        "content": "<p>I think this was a process question</p>",
        "id": 153863461,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481746208
    },
    {
        "content": "<p>you can provide translations either in code systems or value sets. we prefer them to be provided in code systems, particularly for the FHIR build</p>",
        "id": 153863462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481746257
    },
    {
        "content": "<p>you can provide translations for v2 code systems, v3 code systems, or FHIR code systems. The process differs for each </p>",
        "id": 153863463,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481746293
    },
    {
        "content": "<p>I guess you mean the FHIR code systems?</p>",
        "id": 153863464,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481746305
    },
    {
        "content": "<p>I meant internal FHIR value sets like <a href=\"http://hl7.org/fhir/ValueSet/medication-statement-status\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/medication-statement-status\">http://hl7.org/fhir/ValueSet/medication-statement-status</a> and  <a href=\"http://hl7.org/fhir/ValueSet/reason-medication-given-codes\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/reason-medication-given-codes\">http://hl7.org/fhir/ValueSet/reason-medication-given-codes</a>. The first one is required by resource it is used. Can we produce and bring language translations (finnish) to those value sets in FHIR specification?.</p>",
        "id": 153863690,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1481877081
    },
    {
        "content": "<p>yes. You can. I'm not exactly sure what the process should be long term. What we've done to this point is that you simply send me the translations you want, and I add them. That's not really scalable, and it doesn't deal with decay either. But we can satrt there</p>",
        "id": 153863772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481919109
    }
]