[
    {
        "content": "<p>I am constructing a ValueSet which consists  of a subset of values from the <a href=\"http://hl7.org/fhir/v2/0335/\" target=\"_blank\" title=\"http://hl7.org/fhir/v2/0335/\">HL7 v2 Table 0335</a> (timing repeat patterns) CodeSystem. As far as I can tell, this CodeSystem does not define any display values (makes sense since it define several \"template codes\" that allows different codes to be constructed). </p>\n<p>Now, I would like to give the implementers a display value for each code; in particular, since this will be used in Germany, I would like to have German labels. As far as I can tell, there seems to be two options (which may not be mutually exclusive):</p>\n<p>1. Put the German label in <code>ValueSet.compose.include.concept.display</code><br>\n2. Put the German label in <code>ValueSet.compose.include.concept.designation</code>(with appropriate language designation)</p>\n<p>Option 1 seems the easiest, but I am unsure whether it is allowed to write smt. else than the display value from the corresponding CodeSystem  (in this case absent) in this field - especially given that the CodeSystem itself is not German. Is there some guidance on this available? Specifically, is there a fixed priority in which the following field are supposed to be searched for a display value for a given ValueSet  concept?</p>\n<p>1. ValueSet concept display<br>\n2. ValueSet concept designation<br>\n3. Underlying CodeSystem concept display<br>\n4. Underlying CodeSystem concept designation</p>",
        "id": 155169217,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1547559407
    },
    {
        "content": "<p>Put the German label in ValueSet.compose.include.concept.display - if, that is, the resource.language is de</p>",
        "id": 155170080,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547560152
    },
    {
        "content": "<p>when expanding a value set, the expansion process would use the value set concept display, or if one is not specified, it will fall back to the code system. Designations would be used if the expansion parameter indicates a specific language or use. (and same applies - value set overrides code system)</p>",
        "id": 155170233,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547560310
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> !</p>",
        "id": 155172365,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1547562152
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> After migrating to R4 we will be able to use CodeSystem supplements to inject German display values into existing CodeSystems. Our aim is to provide these supplements through the German base profiles.<br>\nWe should chat about pooling our efforts...</p>",
        "id": 155186918,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1547572716
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Sounds interesting. We are still STU3 for now, but let me know when this effort ramps up.</p>",
        "id": 155233912,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1547623253
    }
]