[
    {
        "content": "<p>HI,</p>\n<p>We need a Value Set where each code has alternatives, where each alternative is a kind of specialisation of the concept. Each alternative should be tagged with the \"specialisation type\". An example to make it easier to understand: In a value set of units, one unit (the  concept) would be \"ampoule\" with the alternatives \"pcs\" tagged as abbreviation and \"ampoules\" tagged as plural.</p>\n<p>The obvious solution seams to be using ValueSet.compose.include.concept.designation and use designation.use to specify the type. However designation.use is marked as Extensible. How should the rules regarding extensible be interpreted in this case? Can we add Abbreviation and Plural as codes for designation.use without breaking the spec or is there a better option than using designation?</p>\n<p>If the answer is to use designation, the next question is, the value set designation-use has a note saying \"are for use with SNOMED-CT, and not expected to be used with other code systems\". However the FHIR spec says about Extensible \"To be conformant, codes in this element SHALL be from the specified value set if any of the codes within the value set can apply to the concept being communicated\". Lets say that we add a 3rd alternative to \"ampoule\" and use the designation-use code \"Synonym\" to map it to a code in another code systems. The rules regarding Extensible ad the note about only use the designation-use codes for SNOMED codes are in conflict, or how should the spec be interpreted in this case? Shall we create our own \"Synonym\"-code (wouldn't that break interoperability) or use the SNOMED code in the designation-use value set?</p>",
        "id": 222590046,
        "sender_full_name": "Robert Bjervås",
        "timestamp": 1610549333
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"365348\">@Robert Bjervås</span> Please move to <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a> stream. You could get better help there.</p>",
        "id": 222594707,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1610550901
    },
    {
        "content": "<p>Done, thanks</p>",
        "id": 222598829,
        "sender_full_name": "Robert Bjervås",
        "timestamp": 1610552273
    }
]