[
    {
        "content": "<p>How can we provide some \"sort by preferred\" functionality to a valueset? Is there an attribute in valueSet.include.code.concept that i can use like a \"sequenceNumber\" to sort on?<br>\nScenario: Physician 1 wants to select an ICD code from a list, using a search or type-ahead box, and the codes displayed should be sorted by any sort order we want, e.g. their \"preferred codes\" displayed first, not by default ICD  order.</p>",
        "id": 153930673,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516863465
    },
    {
        "content": "<p>how do you define what a 'preferred code' is?</p>",
        "id": 153930679,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516876935
    },
    {
        "content": "<p>this would probably be like a \"most recent files\" thing. When we select a code, it gets +1.</p>",
        "id": 153930680,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516877004
    },
    {
        "content": "<p>so, the system will know for each code, a score or a sequence number.</p>",
        "id": 153930681,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516877059
    },
    {
        "content": "<p>for that physician, or for that physician group.</p>",
        "id": 153930682,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516877071
    },
    {
        "content": "<p>the definition of \"preferred codes\" can be also provided as reference data by the hospital, <br>\ne.g. \"for surgeons, when they search for \"accident\", \"CV accident\" comes before \"car accident\", but for GPs, it is the other way around\".<br>\nWhat i want to convey is the information that supports this.</p>",
        "id": 153930683,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516877236
    },
    {
        "content": "<p>i don't see anything, so I could have an extension, say \"score\"..?<br>\nunless there is something already</p>",
        "id": 153930684,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516877278
    },
    {
        "content": "<p>This is yet another example where code system supplement would be used and then applied via an expansion profile. Keep in mind that a code system supplement is simply something that has information about code system concepts, such as \"choice frequency\" linked to the concept identifier. You can make these very specific so that it is applied for only one value set.</p>",
        "id": 153930692,
        "sender_full_name": "Robert McClure",
        "timestamp": 1516888648
    },
    {
        "content": "<p>This would definitely be extension territory.  I don't think it would be captured with a code-system suppment because it's valueset-specific.  There'd be no such thing as a \"preferred SNOMED code\", but there might be a \"preferred code from this list of SNOMED diagnoses\" and a different \"preffered code from this list of SNOMED procedures\"</p>",
        "id": 153930701,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516891458
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Ok, I guess that makes sense with the focus on one specific value set. But if this was applied for any value set that listed ICD codes, then would a supplement be the choice then?</p>",
        "id": 153930706,
        "sender_full_name": "Robert McClure",
        "timestamp": 1516893175
    },
    {
        "content": "<p>I can't think of a use-case that would be valueset-independent...</p>",
        "id": 153930711,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516896675
    },
    {
        "content": "<p>If you're going to explicitly order the codes, then do it in the ValueSet and just use the definition (ie do it all client-side, since this is a UI/UX issue).  Otherwise, you could use a terminology server that returns results from $expand with a filter parameter in \"best match\" order.<br>\nOur terminology server allows you to include an extension to adjust the weights on codes, so for your use case the GP ValueSet would increase the weight for \"car accident\" and the surgeon's ValueSet would do the same for \"CV accident\"</p>",
        "id": 153933151,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1517268529
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   So... what is the conclusion?  Sort is value-set specific, is that a good use case for an extensions? how to go about it?</p>",
        "id": 153964855,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1527267475
    },
    {
        "content": "<p>Define an extension on ValueSet.compose.include.concept that indicates relative popularity and define an operation that allows you to generate an expansion sorted in that order</p>",
        "id": 153964952,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527278950
    },
    {
        "content": "<p>a parameter to the expansion operation, not a new operation</p>",
        "id": 153964963,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527279432
    },
    {
        "content": "<p>Is there a need for the parameter?  If the ValueSet contains the extension elements, then presumably that's indication enough that they should be used to influence the sort order.  Ontoserver supports such an extension (documented here <a href=\"http://ontoserver.csiro.au/docs/5.1/api-fhir-extensions.html\" target=\"_blank\" title=\"http://ontoserver.csiro.au/docs/5.1/api-fhir-extensions.html\">http://ontoserver.csiro.au/docs/5.1/api-fhir-extensions.html</a>) at the <code>compose.include</code> level</p>",
        "id": 153965104,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1527504129
    },
    {
        "content": "<p>Once a sort value is defined for the valueset via an extension, wouldn't we just expect $expand to bring back the sort value as another concept attribute, and the client can use that to order the list?</p>",
        "id": 153965521,
        "sender_full_name": "Robert McClure",
        "timestamp": 1527686989
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> That is an interesting extension. Just to clarify, when you say \"adjust the ranking ... of codes when performing an $expand with filter\", you mean the codes expanded from he include section. Is that right? Because my first thought was that ranking applies to $expand?filter=xxxx operation.</p>",
        "id": 153965530,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1527687730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> Yes, I think that's a good way to manage it.  However, for large expansions it might be nice if the results could be returned sorted on that field so that 'give me the first n results' was actually useful.</p>",
        "id": 153965957,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1527719548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> Yes, after performing the $expand, then applying the <code>filter=xxx</code> to match and rank the codes, we adjust the scores of the codes that were contributed by <strong>that</strong> include.</p>",
        "id": 153965964,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1527720033
    },
    {
        "content": "<p>Can you give me an example how the filter works with scores?<br>\nThanks.</p>",
        "id": 153966076,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1527774685
    },
    {
        "content": "<p>Lets assume there are two include criteria (an OR) - one is \"all active SNOMED codes\" and the other is \"all inactive SNOMED codes\". Further assume that the first criteria has a boost of 1.5 and the second of 0.5.  Next, assume that there are two codes for 'cataract', one of which is inactive.  Then you do a <code>$expand?filter=catarac</code> (note the substring), both codes get the same raw score (say, 0.875) but because of the weighting the active concept ends up with a score of 1.3125 and the inactive concept gets a score of 0.4375.</p>",
        "id": 153968812,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1528850049
    }
]