[
    {
        "content": "<p>When implementing multiple choice questions in a Questionnaire resource, it would be practical to have the possibility to use item.option.valueCodeableConcept for making answer choices with a code attached to them. Right now only valueCode is permitted, but if one were to use valueCodeableConcept instead, the displayed text would be in valueCodeableConcept.text, and the code (with system, code and display fields) would be totally separate from the \"UI element\", i.e. valueCodeableConcept.text. We will probably do this using an extension, but I think it would be a good thing to have in STU4 also (makes a lot more sense than valueCode). Where can these suggestions be made?</p>",
        "id": 153892448,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496754574
    },
    {
        "content": "<p>You can make a change proposal using the \"propose a change\" link at the bottom of every page in the spec.  This possibility has been talked about before.  There are two challenges - CodeableConcept also allows for multiple codings and when there's the ability to have code or text, there's usually carefully controlled behavior about whether the text is instead of or in addition to a code - and which codes can be accompanied by text and which can't.  As a result, the current recommendation is to use a nested question for the text value.  That gives you full control over when it gets captured.</p>",
        "id": 153892449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496755150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Is there someplace i can see an example of the suggested approach?</p>",
        "id": 153892461,
        "sender_full_name": "Robert McClure",
        "timestamp": 1496761173
    },
    {
        "content": "<p>There are several examples of nested questions with enableWhen controlling their appearance.  There aren't currently any with a string value for a code though.</p>",
        "id": 153892476,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496764596
    },
    {
        "content": "<p>Alright, thanks! I think we'll go with an extension, nested questions seem like an unnecessarily complex way of doing something that I would think is quite a popular use case. You're right that CodeableConcept has problems, I'll try to think of a good suggestion now that I found the suggestion link ;)</p>",
        "id": 153892483,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496766262
    },
    {
        "content": "<p>Extensions won't be recognized by most systems.  Note that there is an open-choice data type to use if you want to capture either a Coding <em>or</em> a string.</p>",
        "id": 153892484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496766815
    },
    {
        "content": "<p>I want to capture a coding, always, but I want to display something else to the user than just the code (or its 'display' value).</p>",
        "id": 153892485,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496767002
    },
    {
        "content": "<p>So if the choice strings are \"A\" and \"B\" I want to associate a code to each choice and send that back in the QuestionnaireResponse.</p>",
        "id": 153892486,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496767049
    },
    {
        "content": "<p>choice as in, option, to use FHIR terms :)</p>",
        "id": 153892487,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496767180
    },
    {
        "content": "<p>What are you wanting to display other than the code or its display value?</p>",
        "id": 153892488,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496767194
    },
    {
        "content": "<p>You mean the label?  I.e. the \"(a)\" in \"(a) blue\"?</p>",
        "id": 153892489,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496767227
    },
    {
        "content": "<p>Just some more human readable string than what the code itself provides.</p>",
        "id": 153892490,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496767259
    },
    {
        "content": "<p>And depending on the user settings, in different languages</p>",
        "id": 153892491,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496767270
    },
    {
        "content": "<p>We used to put that string in valueCode.display, but now we need to use it for other things, and it didn't feel right to do in the first place :)</p>",
        "id": 153892492,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496767311
    },
    {
        "content": "<p>Well, the intention is that you use valueCode.display.  There's an extension on 'string' to convey translations</p>",
        "id": 153892493,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496767710
    },
    {
        "content": "<p>Alright, maybe I have to rethink our whole structure there. Thanks for the tips!</p>",
        "id": 153892495,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496767876
    },
    {
        "content": "<p>Or you can use an OpenChoice type, which permits either a coded value, or a valueString.</p>",
        "id": 153896001,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499146813
    }
]