[
    {
        "content": "<p>Hello all, I am wondering if there is a way, when creating my Lab ValueSets to not just include the LOINC codes that I need, but also their corresponding units, as there are some Concepts in LOINC with 2 different possible units.</p>",
        "id": 243628889,
        "sender_full_name": "Diana_Ovelgoenne",
        "timestamp": 1624441918
    },
    {
        "content": "<p>the units are indicated in the value. See Value Quantity <a href=\"http://hl7.org/fhir/datatypes.html#Quantity\">http://hl7.org/fhir/datatypes.html#Quantity</a></p>",
        "id": 243648354,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624453628
    },
    {
        "content": "<p>yes, that i know. But that means that for a catalog of n lab elements I need to define n Observations to ensure I define the unit in the Quantity, rather than having a general Observation with a cardinality n to use the valueSets I have inside the lab catalog.</p>",
        "id": 243878817,
        "sender_full_name": "Diana_Ovelgoenne",
        "timestamp": 1624601102
    },
    {
        "content": "<p>To test my understanding, you have n pairs of LOINC code and corresponding units. You <em>could</em> create an Obs profile for each pair, constraining the code and the units of the valueQuantity but you'd rather write those pairs directly and have validation or classification use those pairs (i.e. not create n Obs profiles).</p>",
        "id": 243884401,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1624606735
    },
    {
        "content": "<p>the answer is that this is open business for us, I'm afraid</p>",
        "id": 243884491,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624606812
    },
    {
        "content": "<p>but the answer I want to have is to bind a profile to a set of ObservationDefinitions</p>",
        "id": 243884510,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624606833
    },
    {
        "content": "<p>i think that means you're in favor of keeping it so that you have to define the n Observations, but that you'd also like a profile to define multiple Observations</p>",
        "id": 243885099,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1624607303
    },
    {
        "content": "<p>Yes <span class=\"user-mention\" data-user-id=\"191452\">@Eric Prud'hommeaux</span>  you understood my dilema. It would be nice from the semantic side of the world, just to have a complete definition on the valueSet rather than having n Observations, as when I need a new lab value, i could just update my valueSet and would be ready rather than doing yet another Observation. <br>\nI will continue doing my n Observations per Profile.</p>",
        "id": 243886365,
        "sender_full_name": "Diana_Ovelgoenne",
        "timestamp": 1624608194
    },
    {
        "content": "<p>I thought this is what observationdefinition is addressing</p>",
        "id": 243941691,
        "sender_full_name": "Eric Haas",
        "timestamp": 1624639850
    }
]