[
    {
        "content": "<p>The ValueSet spec for search parameters (<a href=\"http://hl7.org/fhir/5.0.0-snapshot1/valueset.html#search\">http://hl7.org/fhir/5.0.0-snapshot1/valueset.html#search</a>) defines:</p>\n<p><em>reference  uri A code system included or excluded in the value set or an imported value set    ValueSet.compose.include.system</em></p>\n<p>The description says that the reference can be to a code system or an imported value set, but the path is only concerned with code system.</p>\n<p>I think the path should be: \"ValueSet.compose.include.system | ValueSet.compose.include.valueSet\"</p>\n<p>This will allow me to search value sets depending on other value sets.</p>",
        "id": 271794147,
        "sender_full_name": "Tyge Folke Nielsen",
        "timestamp": 1644826070
    },
    {
        "content": "<p>My reading is that it means any code system directly referenced or referenced within included value sets.  It's not talking about ValueSet URLs at all.  If you want to search by referenced valueset, that'd be a distinct search criteria.  Feel free to submit a change request proposing one.</p>",
        "id": 271841648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644852479
    },
    {
        "content": "<p>OK, I see that I may have misread the description. <br>\nHowever I doubt that the definition \"ValueSet.compose.include.system\" is recursive, so it will not find value sets dependent on a code system through another value set.<br>\nAnd I need to add another search parameter to allow searching for value sets dependent on other value set.</p>",
        "id": 272656519,
        "sender_full_name": "Tyge Folke Nielsen",
        "timestamp": 1645432670
    },
    {
        "content": "<p>Agree that the search parameter, as defined, should be flagged as 'special' rather than 'normal' to handle the recursive aspect.  So please submit a change request for that to be fixed.  Also, if you want a new search parameter, you could submit a request for a standard one to be defined - though you have the ability to create your own too.</p>",
        "id": 272712536,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645462351
    }
]