[
    {
        "content": "<p>In FHIR DSTU2 ValueSets contained inline CodeSystems, however in FHIR STU3 ValueSets and CodeSystems have their own separate resource instances.  There doesn’t appear to be a clear way of differentiating which FHIR standard each conforms with.</p>\n<p>In DSTU2 we used a resolvable ValueSet URL, much like the FHIR standard.  In the move to adopt STU3 if we use the same ValueSet URL we wouldn’t be able to differentiate which version of FHIR the ValueSet conforms to.</p>\n<p>The FHIR standard has retrospectively applied DSTU2 to the resolvable URL, however the defining URL (canonical URL) for the ValueSet remains the same between versions. E.g. <a href=\"https://www.hl7.org/fhir/DSTU2/valueset-administrative-gender.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/DSTU2/valueset-administrative-gender.html\">https://www.hl7.org/fhir/DSTU2/valueset-administrative-gender.html</a> and <a href=\"http://hl7.org/fhir/valueset-administrative-gender.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-administrative-gender.html\">http://hl7.org/fhir/valueset-administrative-gender.html</a>. </p>\n<p>Do you have any advice on how we should manage this?</p>",
        "id": 153900129,
        "sender_full_name": "Jennifer Ellison",
        "timestamp": 1501678475
    },
    {
        "content": "<p>Deleted</p>",
        "id": 153900130,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1501679353
    },
    {
        "content": "<p>Deleted</p>",
        "id": 153900131,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1501679539
    },
    {
        "content": "<p>the advice depends on context. I don't know how to offer any more useful advice unless you can describe your context more</p>",
        "id": 153900203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501707363
    },
    {
        "content": "<p>Second try. <br>\n<span class=\"user-mention\" data-user-id=\"192396\">@Jennifer Ellison</span> <br>\nIs this an example of the issue: we have a dstu2 profile for Patient and the ValueSet for administrative gender points to  <a href=\"http://hl7.org/fhir/valueset-administrative-gender\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-administrative-gender\">http://hl7.org/fhir/valueset-administrative-gender</a> which is a STU3 ValueSet, should this point to <a href=\"http://hl7.org/fhir/DSTU2/valueset-administrative-gender\" target=\"_blank\" title=\"http://hl7.org/fhir/DSTU2/valueset-administrative-gender\">http://hl7.org/fhir/DSTU2/valueset-administrative-gender</a></p>\n<p>In our profile renderer we change the link URL's to the correct version but display the canonical url.</p>",
        "id": 153900314,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1501745736
    },
    {
        "content": "<p>i.e. The link to <a href=\"http://hl7.org/fhir/valueset-administrative-gender\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-administrative-gender\">http://hl7.org/fhir/valueset-administrative-gender</a> (this is displayed in the profile) is <a href=\"http://hl7.org/fhir/DSTU2/valueset-administrative-gender.html\" target=\"_blank\" title=\"http://hl7.org/fhir/DSTU2/valueset-administrative-gender.html\">http://hl7.org/fhir/DSTU2/valueset-administrative-gender.html</a> and this is the page you go to when you follow the links.</p>",
        "id": 153900315,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1501745880
    },
    {
        "content": "<p>Yes, there are almost 2 problems that we have, one is that the ValueSet URLs in the XML for DSTU2 profiles now go to STU3 ValueSets.</p>\n<p>However, the problem we are facing is in how we handle our own ValueSets going forward.  We host the ValueSets on a server and when we created the DSTU2 ValueSets, we made the ValueSet URL is the same as the resolvable URL, like the FHIR standard originally was.  But, as we move forward to recreate some of our profiles in STU3, if we recreate these ValueSets with the same ValueSet  URL in STU3, you cannot have the same resolvable URL as the structure of the ValueSet resource has changed and there doesn't appear to be a way to distinguish which version of FHIR they belong to.</p>\n<p>The FHIR standard has handled this by retrospectively changing the resolvable URL for DSTU2 ValueSets.  The question is around what would be the best way for us to handle ValueSet URLs between versions of FHIR, as the FHIR standard states that \"Ideally, the URL should also be the location of the master version of the value set\" (<a href=\"http://hl7.org/fhir/valueset.html#4.8.3.1\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset.html#4.8.3.1\">http://hl7.org/fhir/valueset.html#4.8.3.1</a>)</p>",
        "id": 153900318,
        "sender_full_name": "Jennifer Ellison",
        "timestamp": 1501746712
    },
    {
        "content": "<p>The real challenge is that canonical URLs resolve to \"current official\" with no way to navigate to other versions (like the yellow box we have at the top of the page you get to when you use the canoncial URL for the spec itself).</p>",
        "id": 153900381,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501773073
    },
    {
        "content": "<p>Doing that would mean a fair bit of work for each release.  (And even more work if we wanted to account for the times we rename things)</p>",
        "id": 153900382,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501773166
    }
]