[
    {
        "content": "<p>Hi! I need to store value and percentage for several different spirometry variables (PEF, FEV1, FEV6 etc.). I need to store things like average pre bronhodilatation, daily variation and bronchodilatation response and percentage for them all.  I'm going to use component codable concept. Is there some easier way to store several values? Or do I have to make two separate components for each? This could be one way? I'm most wondering if there is some way to put 2 values (variable value itself and percentage) in same component. example of value and percentage in different components:<br>\n<code>\"component\": [\n    {\n    \"code\": {\n        \"coding\": [\n            {\n                \"code\": \"405177001\",\n                \"display\": \"Medication response (observable entity)\",\n                \"system\": \"http://snomed.info/sct\"\n            },\n            {\n                \"code\": \"20150-9\",\n                \"display\": \"FEV1\",\n                \"system\": \"http://loinc.org\"\n            }\n        ]\n    },\n      \"valueQuantity\": {\n        \"value\": 27.2,\n        \"unit\": \"%{response}\"\n      }\n    },\n    {\n    \"code\": {\n        \"coding\": [\n            {\n                \"code\": \"405177001\",\n                \"display\": \"Medication response (observable entity)\",\n                \"system\": \"http://snomed.info/sct\"\n            },\n            {\n                \"code\": \"20150-9\",\n                \"display\": \"FEV1\",\n                \"system\": \"http://loinc.org\"\n            }\n        ]\n    },\n    \"valueQuantity\": {\n                    \"code\": \"l\",\n                    \"system\": \"http://unitsofmeasure.org\",\n                    \"unit\": \"l\",\n                    \"value\": 2.25\n                }\n    },\n]</code></p>",
        "id": 154230469,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1546509634
    },
    {
        "content": "<p>Each value will, at best, need to be a separate component.  In some cases, they may need to be completely separate  Observations.  When you're capturing observation data, your objective is not to minimize the number (or size) of the recorded record, it's to enable subsequent search and retrieval (and if your system doesn't allow search/retrieval, to at least be consistent with other systems that do).  That means that we use separate Observations for all information that might reasonably be analyzed on its own.  Component is really intended for information that must be considered together to be understood/useful.  As an example, in microbiology, there's a need to capture both \"was the organism susceptable\" and \"what was agent was it tested with?\".  Capturing those as separate observations is useless because knowing the answer to only one of those questions doesn't tell you anything .  They must be sent in a single Observation as components.  A more complex example might be in the genomics space where there's a need to know the chromosome, the start position, the end position and the specific change in order to fully describe an invariant (and in practice, you may need a few more pieces of information too).  On their own, they don't tell anything useful.  You need them together to tell any sort of story.</p>\n<p>On the other hand, for something like a complete blood count, there's no need to know the red blood cell count or the hemoglobin to understand the white blood cell count.  As a result, each value in the CBC would be sent as a separate Observation.  (Though you might also choose to capture a Panel Observation that points to all of the CBC observation instances as \"members\" of the panel.)</p>\n<p>The borderline example is blood pressure.  While in theory the systolic and diastolic values can be considered and reported independently, the community has decided that that's a significant edge case and that almost all systems capture and report them as a group.  We therefore require those values to be captured as a component.</p>\n<p>Hope that helps your assessment of how best to represent these measurements.</p>",
        "id": 154246708,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546530037
    }
]