[
    {
        "content": "<p>I understand that MedicationRequest.authoredOn is defined as \"When request was initially authored\". My question is how to address a verbal order. I recall efforts to eliminate verbal orders or to at least require them to be signed in a defined number of hours. However, they do exist. My thought is that MedicationRequest.authoredOn would apply to whenever the request originates, whether or not it is signed by an authorized individual that enables the pharmacy to proceed with dispensing the request. And, that a verbal order requiring an authorized signature would be represented with \"MedicationRequest.intent = plan\" (I.e., the pharmacy shouldn't fill the order), and changes to  \"MedicationRequest.intent = order\" when signed by an authorized individual.  I also suspect the individual organization defines whom (or what role) it chooses to authorize and it is that authorized individual can make the order \"dispensable\". I look for feedback to determine if my assumption is correct. Thank you, in advance, for your suggestions.</p>",
        "id": 276484380,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1648132611
    },
    {
        "content": "<p>What you're describing seems like a reasonable representation, certainly. Given that we don't define any explicit expectations here, I wouldn't necessarily expect every implementation to arrive at identical conclusions. (And that is probably okay, for now.)</p>",
        "id": 276488969,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1648134359
    },
    {
        "content": "<p>Initially authored doesn't mean \"when written into the system\".  If you ordered it verbally 3 hours ago and it just hits the system now, I'd expect \"authoredOn\" to be 3 hours ago.  Feel free to submit a change request for this to be clarified.</p>",
        "id": 276501735,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648139272
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> To clarify, a verbal order is \"written into the system\" and signed by the person receiving the verbal order. That person may be a clerk who notifies a nurse to \"sign\" the order so it can be processed, or a nurse who \"signs\" to allow it to be processed and dispensed, but ultimately, the physician must \"sign\" to finalize agreement that the verbal order was given.  So, we might be able to provide guidance for clarification if you think that is reasonable.  I appreciate the response from <strong>Josh Mandel</strong> that implementations may vary with respect to conclusions.</p>",
        "id": 276505336,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1648140561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> and <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> - I will appreciate your comments on managing verbal prescriptions with the pharmacy perspective.</p>",
        "id": 276505848,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1648140756
    }
]