[
    {
        "content": "<p>Hi!</p>\n<p>What are the current ways of verifying a resource? I'm not sure of the non-Norwegian term for this. Our use case is that you register some critical information then some health personell will verify the status of the CI. This must be done without making an actual change to the resource except for the verificationStatus. Thanks for any input!</p>\n<p>// Thomas</p>",
        "id": 153960057,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1526289465
    },
    {
        "content": "<p>Provenance could be used to capture that any arbitrary resource has been verified.  For some resources it's part of their workflow status as well - for example, an Observation might not be changed from \"preliminary\" to \"complete\" until it's been verified</p>",
        "id": 153960092,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526290246
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>. Are you talking about this: <a href=\"https://www.hl7.org/fhir/valueset-provenance-activity-type.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-provenance-activity-type.html\">https://www.hl7.org/fhir/valueset-provenance-activity-type.html</a> ? I'm not seeing how to confirm or deny the status of some resource, without the extendible fields like active or cancelled. Not quite right with cancelled I think. </p>\n<p>Am I understanding this correctly that updating only the verification field on a resource is not \"normal\" FHIR behaviour? What's important is that the resource don't get updated along with the status, if that makes sense.</p>",
        "id": 153960769,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1526359424
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195227\">@Thomas Johansen</span> Please submit a CR with your recommendations. I know we have discussed this as Lloyd has described. However it is possible that the formal use-case analysis and change requests have not been done. I am very happy to receive improvements</p>",
        "id": 153960780,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526366554
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>!</p>\n<p>I'd by happy to. I'm not quite sure what CR is and where I can do this. Could you point me in the right direction? :)</p>\n<p>// Thomas</p>",
        "id": 153960781,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1526366719
    },
    {
        "content": "<p>at the bottom of every page of the FHIR specification (regardless of version) is a clickable link \"Propose a change\".</p>",
        "id": 153960782,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526366834
    },
    {
        "content": "<p>Ok, thanks! Will do as soon as my account is approved. Thanks :)</p>",
        "id": 153960921,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1526379866
    },
    {
        "content": "<p>Should now be approved :)</p>",
        "id": 153961133,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526392635
    },
    {
        "content": "<p>Indeed, thanks :)</p>",
        "id": 153961418,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1526445292
    }
]