[
    {
        "content": "<p>What the standard practice for versioning extensions should be? Should versions of extensions be incremented along with the profiles that refer them? Or should they be versioned independently? <br>\nCurrently we are adding version info to the StructureDefinition files for extensions manually, but I was not sure how to deal with this.<br>\nThanks for any feedback.</p>",
        "id": 153873134,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1487859408
    },
    {
        "content": "<p>The IGPublisher now has an option that lets you version *everything* in the IG to a specific business version - so extensions, profiles, value sets, capability statements, etc.   That's significantly less maintenance effort and may be easier for your implementers to wrap their heads around too.</p>",
        "id": 153873138,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487860824
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . We discussed this internally and were debating about whether versions should be incremented for all the fragements of the IG simultaneously. <br>\nIn our view the only challenge with this is that when exchanging an updated IG with another party, it would help to know which fragments have changed and which are the same as this would allow them to know what needs to be updated on their end to comply with the new IG.</p>",
        "id": 153873155,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1487867965
    },
    {
        "content": "<p>Business versions don't necessarily change just because an artifact has been updated, so even if the version is the same, that doesn't mean a comparison isn't necessary</p>",
        "id": 153873159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487870264
    },
    {
        "content": "<p>Could you clarify on that statement? What would prompt a business version to change that is unrelated to changes in the underlying artifacts? Just so I am sure I understand properly.</p>",
        "id": 153873166,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1487874275
    },
    {
        "content": "<p>Multiple changes could happen before a business version changes.  And you could release a new business version even if the artifact hasn't changed.  E.g. Publishing the 2015 version of a code system which happens to be identical to the 2016 version of the code system.</p>",
        "id": 153873168,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487876600
    },
    {
        "content": "<p>So from what I understand, the reasoning is that with a business version increment, the receiving system can not assume that any of the artifacts are the same and thus is required to verify the integrity of each artifact individually?<br>\nThis is the understanding that we came to as well, which was why we thought to version each artifact individually to take some of the burden away from the receiving system: i.e. for the receiving system, if the version of the artifact is the same you can assume no changes. If there is a versoin change you should identify the discrepancies.</p>",
        "id": 153873170,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1487879359
    },
    {
        "content": "<p>Well, if the business version is the same and the artifact is marked as \"active\" then there shouldn't be any substantive changes, but right now that's a \"should\", not a \"shall\"</p>",
        "id": 153873171,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487879605
    },
    {
        "content": "<p>Ah I see. So therefore if I go from version 1 to 2 of a business version, all resources should be marked as \"draft\" status to be changeable, and it is only when everything is maked as \"active\" that the IG is considered a complete version and frozen. Is this correct?</p>",
        "id": 153873181,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1487889460
    },
    {
        "content": "<p>Right.  If you're using version control, the typical process would be you'd have an IG in version control and once you're ready to take it from \"draft\" to \"active\", you'd create a branch for that version and then make the change to \"active\" on that branch.  The mainline could continue to evolve until you're ready to do your next IG release and you could make technical corrections or other tweaks to the \"released\" IG version by updating the branch if need-be.</p>",
        "id": 153873185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487891584
    },
    {
        "content": "<p>Hi - I'm using FSH to create a codesystem. I explicitly set the version with * ^version = \"2.7\".<br>\nWhen I run sushi, the fsh-gnerated json has the correct version.<br>\nHowever when I run the IG Publisher, the xml and json it generates revert to the version specified in sushiConfig.yaml</p>\n<p>-- here is my FSH file</p>\n<p>CodeSystem: Hpi_address_use<br>\nId: Hpi_address_use_2_0<br>\nTitle: \"OrgFac Address Use\"<br>\nDescription: \"A coded type for organisation/facility address purpose (qualifier).\"</p>\n<ul>\n<li>^meta.profile = \"<a href=\"http://hl7.org/fhir/StructureDefinition/shareablecodesystem\">http://hl7.org/fhir/StructureDefinition/shareablecodesystem</a>\"</li>\n<li>^url = \"<a href=\"https://standards.digital.health.nz/ns/hpi-address-use\">https://standards.digital.health.nz/ns/hpi-address-use</a>\"</li>\n<li>^version = \"2.7\"</li>\n<li>^status = #active</li>\n<li>^experimental = false</li>\n<li>^date = \"2020-04-20T00:00:00+13:00\"</li>\n<li>^publisher = \"New Zealand Ministry of Health\"</li>\n<li>^purpose = \"A coded type for organisation/facility address purpose (qualifier).\"</li>\n<li>^caseSensitive = false</li>\n<li>^versionNeeded = true</li>\n<li>^content = #complete</li>\n<li>^count = 3</li>\n<li>#legal \"Legal Address\" \"An address of the legal registered office (active).\"</li>\n<li>#work \"Work Address\" \"An office address. First choice for business related contacts during business hours.\"</li>\n<li>#old \"This address is no longer in use (or was never correct but retained for records).\"</li>\n</ul>",
        "id": 271908695,
        "sender_full_name": "Patrick Ryan",
        "timestamp": 1644884064
    },
    {
        "content": "<p>There is an IG parameter \"apply-version\" that is supposedly <em>usually</em> helpful, but gets in the way from time to time. See <a href=\"https://confluence.hl7.org/display/FHIR/Implementation+Guide+Parameters\">https://confluence.hl7.org/display/FHIR/Implementation+Guide+Parameters</a>. You'll want to specify it as false or use the new default-version parameter in your sushi-config.yaml.</p>",
        "id": 271909653,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1644884755
    },
    {
        "content": "<p>thanks</p>\n<ul>\n<li>do I need to create a custom template to apply these parameters?</li>\n</ul>",
        "id": 272042261,
        "sender_full_name": "Patrick Ryan",
        "timestamp": 1644961248
    },
    {
        "content": "<p>I tried putting the parameter in sushi-config.yaml:</p>\n<div class=\"codehilite\"><pre><span></span><code>parameters:\n.\n.\n.\n  apply-version: false\n</code></pre></div>\n<p>but it had no impact-<br>\nI needed to edit the generated file <br>\n<code>fsh-generated\\resources\\ImplementationGuide&lt;xxx&gt;.json</code><br>\nand that had the desired effect</p>",
        "id": 272056871,
        "sender_full_name": "Patrick Ryan",
        "timestamp": 1644970087
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"474688\">@Patrick Ryan</span> -- if you put parameters into the <code>sushi-config.yaml</code> file, they should be properly reflected in the <code>fsh-generate\\resources\\ImplementationGuide&lt;xxx&gt;.json</code> file.  If they're not, then it sounds like the formatting in <code>sushi-config.yaml</code> is probably not quite right.</p>",
        "id": 272057104,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1644970239
    },
    {
        "content": "<p>thanks - yes I was missing an indent</p>",
        "id": 272059674,
        "sender_full_name": "Patrick Ryan",
        "timestamp": 1644972041
    }
]