[
    {
        "content": "<p>I think, we have to exercise versionless FHIR as soon as possible. Some part of FHIR and libs are designed with \"closed world assumption\", which is not very compatible with  <em>backward compatability</em>. Just a simple question: how FHIR will handle new elements addition without breaking existing systems and tools? </p>",
        "id": 153888191,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494238406
    },
    {
        "content": "<p>Let's define - \"what means backward compatible\"  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  - \"old client could work with new servers?\", \"new clients will work with old servers\"?</p>",
        "id": 153888193,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494238939
    },
    {
        "content": "<p>read the spec first. See <a href=\"http://build.fhir.org/versions.html\" target=\"_blank\" title=\"http://build.fhir.org/versions.html\">http://build.fhir.org/versions.html</a></p>",
        "id": 153888195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494239079
    },
    {
        "content": "<p>May be we have to talk not about versionless, but about multi-version FHIR eco-system - how multiple version would coexist?</p>",
        "id": 153888197,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494239832
    },
    {
        "content": "<p>Agree that the reference implementations definitely need to be adjusted (and tested) to work with our planned forward/backward compatibility rules</p>",
        "id": 153888198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494239885
    },
    {
        "content": "<p>Discussion about <em>where to add fhirVersion info</em> - is a good example, that current design of FHIR is not enough flexible to do back-porting and backward compatibility. I have idea how it could be done: just by extracting Element into separate resource from StructureDefinition, potentially it would be easy to back-port new Elements to previous releases. I understand, this require redesign most of libraries &amp; tools, but may be better to do it now, before versions hell :)</p>",
        "id": 153889028,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494423563
    },
    {
        "content": "<p>you;re just moving the deck chairs around</p>",
        "id": 153889033,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494424068
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> do you mean Elements and Extensions?</p>",
        "id": 153889038,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494424605
    },
    {
        "content": "<p>What nice property, i see, about this - you could publish <em>new domain releases</em> just as a package of   extensions of previous version - does not this look like versionless?</p>",
        "id": 153889046,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494424956
    },
    {
        "content": "<p>I think it's going to be hard enough to do forward and backward compatibility when we hit normative (and we have some lead time).</p>",
        "id": 153889049,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494427371
    },
    {
        "content": "<p>I agree with Grahame - this backport doesn't solve the core issue behind this. It could actually make some things harder</p>",
        "id": 153889050,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494427406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> the reality will be multi-version eco-system for FHIR - so what i fill - FHIR should be designed as <em>an open system</em>, which means, for example, you should be able to add new elements or ignore unknown without breaking working software</p>",
        "id": 153889052,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494428488
    },
    {
        "content": "<p>That's great in theory, but very hard in implementation.</p>",
        "id": 153889053,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494428535
    },
    {
        "content": "<p>eg: Even if FHIR spells out what is considered forward and backward compatible (and it will need to be very specific about this)</p>",
        "id": 153889054,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494428561
    },
    {
        "content": "<p>It also needs to tell clients what they need to do to handle this</p>",
        "id": 153889055,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494428576
    },
    {
        "content": "<p>For example, some JSON libraries default to blowing up when a new element is found</p>",
        "id": 153889056,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494428592
    },
    {
        "content": "<p>Yes, this is challenge - tools &amp; libs should be designed for it</p>",
        "id": 153889057,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494428627
    },
    {
        "content": "<p>My guess is that there will be enough work to do in the community to get to this on \"normative\" for both acting clients and servers... and that then trying to redefine this on an existing deployment...</p>",
        "id": 153889058,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494428639
    },
    {
        "content": "<p>That is guaranteed to cause issues - you never told those apps or servers this was ok. And they're already running in prod</p>",
        "id": 153889059,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494428661
    },
    {
        "content": "<p>keep in mind that the tools and libraries are equivalent to \"all XML, JSON, HTTP libraries in all languages that someone may choose to use\"</p>",
        "id": 153889061,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494428723
    },
    {
        "content": "<p>updating reference implementations is one thing, but that won't cover all apps nor servers</p>",
        "id": 153889063,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494428737
    },
    {
        "content": "<p>This issue was somehow solved for ORMs - which works with changing schema - so there are some strategies to hack it</p>",
        "id": 153889065,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494428850
    },
    {
        "content": "<p>Isn't FHIR like database schema?</p>",
        "id": 153889066,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494428865
    },
    {
        "content": "<p>In the near term, we can change names, change scope, change cardinalities, change constraints and do all sorts of breaking changes between releases - and we're not going to give up the right to make those sorts of breaking changes until a resource becomes normative - which could be 8+ years from now for some resources</p>",
        "id": 153889068,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494429122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Agree</p>",
        "id": 153889069,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494429215
    },
    {
        "content": "<p>@<strong>nicola (RIO)</strong> Yes, you have very similar constructs for JSON and XML to object models (assuming that there's an OO language behind the scenes). I'm not sure I would say ORMs are \"solved\" - there are a lot of issues still with it, and they vary by language. And sometimes your database gets to be garbage from a good relational design perspective if you start with OO and go to DB</p>",
        "id": 153889073,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494429343
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> every such breaking change will be tears &amp; blood of engineers :(</p>",
        "id": 153889074,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494429387
    },
    {
        "content": "<p>I personally would rather pay that price than have a spec that's hard to implement/understand, knowing how many challenges we face implementing some of the more draft resources today</p>",
        "id": 153889075,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494429442
    },
    {
        "content": "<p>Once we hit normative, we'll have enough challenge making sure we don't break people with backwards compatible changes :)</p>",
        "id": 153889076,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1494429475
    },
    {
        "content": "<p>There were suggestions to use existing structures (extensions, tags) to convey version information and wouldn't introduce breaking changes. Am I missing something since everyone's locked on adding a new element?</p>",
        "id": 153889077,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1494429611
    },
    {
        "content": "<p>Back-porting FHIR version is just an show case of compatibility between releases - yes, tags &amp; extensions are compatible, but my question was, why do not make elements also portable?</p>",
        "id": 153889081,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494429850
    },
    {
        "content": "<p>We're in the same boat as <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> - we have production environments and we'd really prefer finding something valid we can do without significant re-engineering, at least not for something as superficial as this.</p>",
        "id": 153889085,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1494430162
    },
    {
        "content": "<p>@<strong>nicola (RIO)</strong> Yes, but that's what \"trial use\" means.  If an engineer signs on at this point, they accept that blood and tears are the price of early access/use and ability to influence.  The alternative is the worse blood and tears of working around something that doesn't work - and often working around issues in inconsistent and non-interoperable ways.</p>",
        "id": 153889086,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494430197
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> We're absolutely <em>not</em> locked on adding a new agreement.  There's been no decision.  Merely an exploration of issues and potential options.</p>",
        "id": 153889087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494430228
    },
    {
        "content": "<p>I'm mostly talking about future - after first normative release, there will be more other normative releases - and ability to be backward/forward compatible on elements level will give engineers more options to plan and implement migrations and integrations </p>",
        "id": 153889089,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494430323
    },
    {
        "content": "<p><em>interoperability between FHIR versions</em> :)</p>",
        "id": 153889090,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1494430397
    },
    {
        "content": "<p>@<strong>nicola (RIO)</strong> After the first normative release, only a small set of resources will be locked.  Most/all of the clinical resources will still be subject to change for at least another 18 months (and for some, maybe 5+ years - some resources needed for public health and other edge spaces may not show up for the first time until R5 or R6).  Certainly the intension is that for a \"locked down\" resource, there will be a mechanism to add new elements in a backward compatible way (for those systems that are designed to support that).  But we'll still be adhering to the 80% rules.  Local needs will still need to be met by extensions.</p>",
        "id": 153889094,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494431456
    },
    {
        "content": "<p>Just want to say I find this to be a really interesting discussion. I'm currently evaluating the use of FHIR as the data model and API for a central integration hub, through which multiple systems can be reached. With 300+ connected systems it is obvious that not all of them can be communicating using the same FHIR version. I have yet to come up with a plan for handling portability between versions.</p>",
        "id": 153889182,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1494482442
    },
    {
        "content": "<p>probably it will be the responsibility of the hub to backport v2 resources for v1 clients. May be harder if a v1 client pushes a resource that has additional required attributes in v2</p>",
        "id": 153889184,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1494483017
    },
    {
        "content": "<p>right now, that will be very difficult because there are really incompatible changes between FHIR releases. Over time, this will reduce - it already has for many resources (e. g. 2  minor changes in patient between R2 and R3) , and once we call the content normative, there won't be any. </p>",
        "id": 153889190,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494485158
    },
    {
        "content": "<p>but we have scripts for R2 &lt;-&gt; R3 conversion, and will maintain those going forward - so I would solve this problem by doing version conversions on the portal</p>",
        "id": 153889191,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494485187
    }
]