[
    {
        "content": "<p>We are making major changes in a profile and therefore making a new version of the profile available in production. For an unidentified time, both versions will be in production. The profile is called ClinicalImpressionTriageRetts and the base URL has a suffix with the main version numbe, e.g. <a href=\"https://fhir/.../clinicalimpressiontriageretts/**v1**\">https://fhir/.../clinicalimpressiontriageretts/**v1**</a>.</p>\n<p>When we create our second major version, we want to change the version in the url suffix. But when we upload it to simplifier, we think it would be a good idea to also include the version in the name/title of the profile to make it easier for an external guest to find the latest version / profile and easily understand that there are several versions of the profile.</p>\n<p>Do you have any input or best practice/naming conventions on how to publish multiple versions of a profile?</p>",
        "id": 225663610,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1612863451
    },
    {
        "content": "<p>There are two pieces here - what is the StructureDefinition.url and what is the <a href=\"http://StructureDefinition.id\">StructureDefinition.id</a>.  Both versions of your profile would have the same <code>url</code> and different <code>version</code> elements.  They'd also have to have unique ids - which might not have any correspondence with the <code>url</code> at all.  If doing a GET from a FHIR endpoint, you're not allowed to do a search on <code>[base]/StructureDefinition/id/[somebusinessversion]</code></p>",
        "id": 225701770,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612882764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"261302\">@Ludvig Eek Hofmann</span> In addition to Lloyd:</p>\n<ul>\n<li>Once you have those two profiles with same canonical <code>url</code> (and most other values) and a different version, the <a href=\"http://Simplifier.net\">Simplifier.net</a> metadata expressions that extract a nice readable title and description for any FHIR resource will likely still give them both the same title. You can either choose to edit those for (one of) the files by hand (Resource page &gt; Settings &gt; Properties) or <a href=\"https://docs.fire.ly/simplifier/simplifierResources.html#metadata-expressions\">change the metadata expressions for your project</a> (Project page &gt; Manage &gt; Metadata expressions).</li>\n<li>If you don't need the older resource in the latest version of the project, but just want to keep it around so people can access it, you can still refer to an older FHIR Package version in which the old version was included. Each package version will remain available forever, so just to keep them available to consumers you don't necessarily need to include them in the latest version of the specification.</li>\n</ul>\n<p><a href=\"http://Simplifier.net\">Simplifier.net</a> and Forge currently don't take profile versions into account when resolving, so wherever possible we'd recommend to rely on FHIR package versioning over profile versioning.</p>",
        "id": 225833096,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1612962683
    },
    {
        "content": "<p>Thank you for your input. <br>\nWe are using the version element to state the new version. However we have followed the example on <a href=\"https://www.hl7.org/fhir/resource.html#versions\">hl7.org</a> where the following is stated: <em>For the kind of resources that have canonical URLs, this specification recommends that implementers follow the Semantic Versioning principles, but does not require this. Implementers should consider, however, making the MAJOR version part of the canonical URL rather than putting it in [Resource].version.</em><br>\nDo you see a problem to also include the major version in the canonical <code>url</code>?</p>\n<p>We will change the title of the versions in simplifier to different them! We need both to be available in the project.</p>",
        "id": 225972041,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1613039576
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"261302\">@Ludvig Eek Hofmann</span> Using different canonicals for them will make your life easier in Forge and <a href=\"http://Simplifier.net\">Simplifier.net</a>, since we currently don't resolve based on the profile version. Having different canonicals guarantees correct resolving there.</p>\n<p>The FHIR spec itself has kept the same canonicals over the different FHIR versions (eg. for Patient). Since the <code>url</code> is basically just an identifier only a human would easily see that canonical/v2 is the newer version from canonical/v1.</p>",
        "id": 225995817,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1613052811
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> Ok, thank you for claryfiying!</p>",
        "id": 226112832,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1613121224
    }
]