[
    {
        "content": "<p><a href=\"http://stackoverflow.com/questions/36854693/hl7-fhir-implementation-of-animal-owners\" target=\"_blank\" title=\"http://stackoverflow.com/questions/36854693/hl7-fhir-implementation-of-animal-owners\">http://stackoverflow.com/questions/36854693/hl7-fhir-implementation-of-animal-owners</a></p>",
        "id": 153823091,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461648451
    },
    {
        "content": "<p>it seems to me that person is for reconcilation records of a single individual. </p>",
        "id": 153823092,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461648490
    },
    {
        "content": "<p>there's really nothing for managing the relationships between individuals - and the question at the heart the stack overflow is about tracking relationships</p>",
        "id": 153823093,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461648533
    },
    {
        "content": "<p>Currently in several resources where there are two 'person' elements which need to be related a code is used to capture the relationship and the codes used have the granularity required at the point of use.</p>",
        "id": 153823095,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461649112
    },
    {
        "content": "<p>you mean patient, then? but th patient.contact is strictly observational/relative - there's no way to set up a formal web of relationships between identified parties</p>",
        "id": 153823096,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461666682
    },
    {
        "content": "<p>Usually they use Patient for the 'person' but they may use a choice of Patient or RelatedPerson. You are correct there is no independent 'relationship' resource - the only way to work our the 'web of relations' would be to analyse the codes and they aren't designed to support that level of discovery. For example, you could discover that a child is the dependant of four people but have no idea which is the Birth Father and Birth Mother.</p>",
        "id": 153823099,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461676900
    },
    {
        "content": "<p>Is this an observation on your part or a desire/need to actually map the relationships?</p>",
        "id": 153823100,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461676981
    },
    {
        "content": "<p>an observation on my part, but the idea that the relationships should be represented formally arises as an FAQ</p>",
        "id": 153823103,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461678414
    },
    {
        "content": "<p>Doesn't this same scenario happen for humans as well as animals?  For example, patients (e.g. two siblings) can have the same relative (e.g. mother) - in which case there would need to be 2 RelatedPersons for the relationship between mom and each child  -- meaning that a Person would need to be used to link the 2 RelatedPersons for the single person (mother).  It does feel awkward to me that the RelatedPerson resource is named as if it represents a person whereas the elements imply it is actually more like a relationship.  Thus, the Person.link.target (of type RelatedPerson) is actually linking relationships.</p>",
        "id": 153823139,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1461681526
    },
    {
        "content": "<p>Michelle, I made the same mistake in regard to RelatedPerson - that's not what it does </p>",
        "id": 153823143,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461683777
    },
    {
        "content": "<p>RelatedPerson is part of the Patient's record.  My leaning on this question is that Owner, if you want to search on it, is a potential actor (information recipient, informer, performer, etc.) so RelatedPerson is appropriate.  You would link all the animal-specific RelatedPerson instances to Person if you wanted to show that they're the same human being.  Where this gets more dicey is that some animals aren't owned by people.  They're owned by organizations.  And we don't support that at all right now.</p>",
        "id": 153823170,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461687952
    },
    {
        "content": "<p>a related person is specific toa a patient. If I'm involved in my families care, there'll be a related person for me for each person in my family</p>",
        "id": 153823175,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461688107
    },
    {
        "content": "<p>there's no link between the different RelatedPerson records for me </p>",
        "id": 153823176,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461688120
    },
    {
        "content": "<p>Person allows linking multiple RelatedPerson instances</p>",
        "id": 153823179,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461688172
    },
    {
        "content": "<p>it's a little indirect...</p>",
        "id": 153823181,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461688215
    },
    {
        "content": "<p>It is.  But it's also nice and tidy.  It keeps records nicely separated except for the resource whose explicit purpose is linking.  If we introduce something else, that gives us two different ways of saying the same thing and I'm not sure we could provide sufficient guidance to minimize the likelihood of people having to support both approaches.</p>",
        "id": 153823197,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461692581
    },
    {
        "content": "<p>Wouldn't this be dramtically simplified by having on the focal resource a subclass of related where the content was:</p>\n<p>related 0..* Related parties<br>\n       related.party 1..1 reference(patient|organization)<br>\n      related.relationship 1..1 coding (detailed relationship codeset/valueset)<br>\n      maybe additional elements...</p>\n<p>This way: <br>\nA) you would have organizations and animals as well as people; <br>\nB) the relationship: birthmother; caregiver; owner, guardian, frend, etc. could be explicit; and, <br>\nC) none of: the relatedPerson; its duplications; and,  the Person to gather the duplicates back up would be required.</p>\n<p>Be really nice if we renamed Person to PersonLink and Patient to Person (or Party or Subject). It would be less surprising for people who use FHIR,  and as for animals - well if we won't give them their own resource then they are people (Person) too.</p>",
        "id": 153823589,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461839598
    },
    {
        "content": "<p>OR, have a Relationship resource designed to relate resource X with relatedparties Y, Z etc. - but make it a relationship recording resource not a pseudo person resource.</p>",
        "id": 153823590,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461841695
    },
    {
        "content": "<p>It would mean that you have to create a Patient relationship for every friend, guardian, etc. - which would create a very high (and misleading) set of Patients.  Patient and RelatedPerson have very distinct purposes.  A Patient is a Person/Animal who is (or is at least a potential) recipient of care.  A RelatedPerson is a Person/Animal who is associated with a Patient who can act (or be acted upon) as a result of the personal relationship with the Patient.  The notion of having a single record for a Person that links multiple Patient or RelatedPerson or Practitioner records is more advanced functionality.  I think it's fine that things are more complicated when you want to do that.</p>",
        "id": 153823593,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461845120
    },
    {
        "content": "<p>Lloyd: I don't think you understood what I'd suggested. It would not create more things - it would eliminate the duplication within RelatedPerson and eliminate duplications between Patient and Related Person; and remove the need for Person to mop up the duplicates. It would reduce complexity as you would have few or one place to look for the relationships depending upon whether the relationship was recorded within or outside (as a resource) of the focal resources, and it would mean there was one model not two for people (and animals).</p>\n<p>Patient is a role and I think it would be less surprizing to have resources be the things and the elements be in the roles. If everyone doesn't want that then fine, but having one resource which represents people and a different resource which represents the relationships between people is IMHO a better, less redundant and more robust design.</p>",
        "id": 153823595,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461845760
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> - What I understood you to say is that you'd use Patient for related persons instead of a RelatedPerson.  And I'm saying that's problematic.  We need to reflect how existing systems work, and very few systems would want \"patient's mother\" to show up as a Patient record - nor would they support knowing that \"Patient's mother\" is the same person as \"Patient's wife\".  There's a whole lot of sophistication involved in managing that sort of linkage, including handling the privacy aspects.  Our existing approach only feels unnatural in the veterinary space, both because the privacy impact doesn't generally manifest with animals and because the notion of \"owner\" is often quite important</p>",
        "id": 153823597,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461850218
    },
    {
        "content": "<p>Redundancy is actually common in actual implementations, so we need to support and reflect that.</p>",
        "id": 153823598,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461850259
    },
    {
        "content": "<p>Yes veterinary practice management is centered around the client and the animal patients are linked to the client. </p>",
        "id": 153823622,
        "sender_full_name": "Eric Haas",
        "timestamp": 1461886506
    },
    {
        "content": "<p>That would suggest that someone with multiple pets would be modelled as one Client and multiple patients, not the multiple patients (Patient) with multiple Clients (RelatedPerson) espoused above.</p>",
        "id": 153823740,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461921589
    },
    {
        "content": "<p>Yes, we have a challenge in the veterinary space.  This is one place where the requirements don't line up terribly well between human and veterinary medicine.  The question is whether the human-centric solution is sufficiently painful in the veterinary space that we'd need to introduce a new \"owner\" resource specifically for them.</p>",
        "id": 153823906,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461977617
    },
    {
        "content": "<p>This issue also comes up in mental health and disability where there is a lot of software that deals with the carer, especially with funding. In these cases the RelatedPerson is the focus of much of the system, as it is supporting them (to care for the Patient)</p>",
        "id": 153823914,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461978680
    },
    {
        "content": "<p>Brian, perhaps PA should discuss this in Montreal? </p>",
        "id": 153823916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461978728
    },
    {
        "content": "<p>Could add to the list.</p>",
        "id": 153823919,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461978852
    },
    {
        "content": "<p>(Is now on my list of topics)</p>",
        "id": 153823920,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461978863
    },
    {
        "content": "<p>thx</p>",
        "id": 153823923,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461984550
    },
    {
        "content": "<p>I would strongly prefer a \"Client\" resource.   I would be happy to discuss if we are talking vet med.  In addition all the practice management gurus tell us dentistry is closest to veterinary practice.   A a large chunk of their business is typically client pay as well.   I have never set eyes upon a  dentistry system so I don't know if that applies to this situation.</p>",
        "id": 153824077,
        "sender_full_name": "Eric Haas",
        "timestamp": 1462136576
    },
    {
        "content": "<p>Well, for human dentistry, client = patient.  (And I really don't like the name \"client\" because it's a common alias for Patient, so it's going to trigger lots of confusion.)</p>",
        "id": 153824090,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1462149532
    },
    {
        "content": "<p>Dentistry, unless accident related, usually doesn't get paid much under public or social programs, to in that regard it is mostly Patient paid, and most of that patient payment comes from private insurance.<br>\nBut that doesn't change that there is an account, for a single person or family unit, where there are patients and coverages with subscribers (the policy owner for the coverage).</p>\n<p>The profound similarity between Vet and Dental practise is the completeness of the practise - both professions are like islands of healthcare where the practioner does it all: imaging, diagnostics, surgery, pharmaceuticals etc. You both tend to have significant technology and machinery to deliver the whole service. The skills required are very broad and extend beyond the purely medical into mechanics, prosthetics, forensics, materials science, other levels of problem solving etc.. You provide for yourself many of the support services which are external services and knowledge for others.</p>",
        "id": 153824326,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1462268150
    },
    {
        "content": "<p>We have an issue where we need to represent primary patients and their dependents. I think what I'm going to do is use an extension to Patient to identify the patient's \"parent\" Patient resource, if any, and any meta data along with that relationship. Make sense?</p>",
        "id": 153824372,
        "sender_full_name": "Kenneth Chapple",
        "timestamp": 1462299106
    },
    {
        "content": "<p>Primary as in for insurance coverage?  Would think that would be a link from Coverage.</p>",
        "id": 153824403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1462324508
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'll look into Coverage resource.</p>",
        "id": 153824447,
        "sender_full_name": "Kenneth Chapple",
        "timestamp": 1462368813
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> When is this topic being discussed in Montreal?</p>",
        "id": 153824760,
        "sender_full_name": "Eric Haas",
        "timestamp": 1462513332
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\">@Lloyd McKenzie</span>: I don't know what you mean by 'Primary Patient' in relation to Insurance, but I do know what is meant by 'Primary Insurance' for a Patient. The Coverage has two people of interest: the party who is the beneficiary and the party who owns the Coverage. The relationship is expressed there at the level of granularity which is approprriate for that purpose but probably/possibly not at the level required by Kenneth.<br>\n@Kenneth: Are you trying to describe the familial or responsibility or other relations between Patients (Mother, Father, sibling, child, etc.)? If this isn't specifically insurance related otherwise you shouldn't rely on Coverage at all.</p>",
        "id": 153824956,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1462623390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> It wasn't my term, but I'm interpreting it to mean what used to be \"Head of Household\" in Alberta - I.e. the primary person associated with coverage that may apply to multiple covered parties.  I'll let <span class=\"user-mention\" data-user-id=\"191891\">@Kenneth Chapple</span> clarify whether that's actually his meaning or not</p>",
        "id": 153825070,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1462631180
    },
    {
        "content": "<p>Sorry this didn't get handled in Montreal. Can someone log the issue in a tracker item?</p>",
        "id": 153827621,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1463094380
    }
]