[
    {
        "content": "<p>Hi!<br>\nWe are looking into how to expose information about what pvcs and cvcs the patient currently has inserted. Eg to display in a list or plotted onto a body image.</p>\n<p>PCV - Peripheral venous catheter (or PICC line), commonly used to give patient medications, fluids etc via a catheter inserted into the arm. <br>\nCVC - Central venous catheter (or central line), inserted into a central vein close to the heart, to give drugs, transfusions etc. </p>\n<p>There are several business needs in this area like:<br>\n-See which ones the patient has now <br>\n-Manage them, clean skin, replace the catheters<br>\n-Ensure the patient doesn’t go home with one still inserted </p>\n<p>Assumption</p>\n<ul>\n<li>Insertion and removal of PVC/CVC are procedures; hence exposed using the Procedure resource</li>\n</ul>\n<p>Question</p>\n<ul>\n<li>How would we represent currently inserted PCV/CVCs?</li>\n</ul>\n<p>We can’t just returned insertion Procedures, they might me removed. We could return both insertion and removal Procedures and let the client compare which Procedures lack a removal. Maybe this is the right way, but something doesn’t feel right about that approach. The client has to do that comparison themselves, introducing business logic on the client. </p>\n<p>This question would apply to things like implants as well. </p>\n<p>Thanks!</p>",
        "id": 257481825,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1634189344
    },
    {
        "content": "<p>Current guidance is to use Device, which allows association to the Patient they're inserted/implanted/otherwise associated with</p>",
        "id": 257524615,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634213920
    },
    {
        "content": "<p>Thanks Lloyd! <br>\nSounds reasonable. For this use case (and any patient related device use case?) I think we would need to know <em>where</em> the device is located on the body of the patient. </p>\n<p>Hence I think it would be good to adjust the Patient element and make it into a BackboneElement including both Patient (reference) and AnatomicalLocation (codedConcept).</p>\n<p>As tracking devices that have been inserted in one way or the other into the patient is a critical use case (e.g. implants for MRI examinations). Maybe it can be worth updating the documentation with this?</p>\n<p>I reported a jira ticket regarding the anatomical location and improved documentation: <a href=\"https://jira.hl7.org/browse/FHIR-34134\">https://jira.hl7.org/browse/FHIR-34134</a></p>",
        "id": 257657766,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1634283395
    }
]