[
    {
        "content": "<p>Hospitals, departments and wards often have different addresses. It is important to be able to distinguish e.g. postal address, visiting address (where should the patient go) etc. I was looking into how to support that use case, and it wasnt clear to me.</p>\n<p>First of all, the idea is to use Location for the place where the patient should go for their Appointment (as opposed to Organization). </p>\n<p>Location has the following element:<br>\naddress     0..1    Address Physical location  </p>\n<p>This has data type <em>Address</em> which among other things have these elements:</p>\n<p>use 0..1    code    home | work | temp | old | billing - purpose of this address <br>\ntype    0..1    code    postal | physical | both</p>\n<p><strong>Question</strong><br>\nHow should you correctly point out the \"visiting address\" for a Location?</p>\n<p>Neither of the <em>Use</em> codes seem to be applicable, they seem more suited for patient/person addresses. <em>Type</em> would of course be physical (or both), but that doesnt seem to be enough to say that this is the address to be used for visitors? Or is it? I can see there being multiple physical addresses with different <em>Use</em>. But there is no <em>visiting</em> code for <em>Use</em>.</p>\n<p>Thanks!</p>",
        "id": 169047854,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1561567146
    },
    {
        "content": "<p>The Location's address is always the visiting address and would always be expected to be a 'physical' address.  A mailing address would be tied to the Organization (either the hospital as a whole, or more typically a department).</p>",
        "id": 169049172,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561568181
    },
    {
        "content": "<p>Would you then recommend to set these to elements to 0..0 when profiling as Use is not applicable for Location, and postal should go to the organization (and also the Location.address explicitly states physical address)?</p>",
        "id": 169052689,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1561570740
    },
    {
        "content": "<p>I almost <em>never</em> recommend setting elements to 0..0.  'use' is certainly applicable.  'temp' and 'bad' are both potential values for locations.  You could constrain the value set if you like.  Or just don't mark it as mustSupport=true, meaning that you don't pay any attention to it.  For address type, constraining it to have to be physical is reasonable.</p>",
        "id": 169062057,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561571263
    },
    {
        "content": "<p>Good input! Thx <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 169104150,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1561611610
    }
]