[
    {
        "content": "<p>What is the most common resource to search for encounter visit reason? What would this expression look like when calling the Epic API? We thought CPT codes would be appropriate within the Procedure resource but this is coming up empty. Encounter.type.coding[*].code</p>",
        "id": 278203708,
        "sender_full_name": "Jim Borda",
        "timestamp": 1649354643
    },
    {
        "content": "<p>See <a href=\"http://hl7.org/fhir/R4/encounter-definitions.html#Encounter.reasonCode\">Encounter.reasonCode/Reference</a> and its SP. <code>reason-code</code> or <code>reason-reference</code></p>",
        "id": 278204200,
        "sender_full_name": "Eric Haas",
        "timestamp": 1649354877
    },
    {
        "content": "<p>Thanks Eric! this is helpful, so, it will look for the encounter reason in the Encounter resource, but it is not required to be in the Encounter resource?</p>",
        "id": 278205547,
        "sender_full_name": "Jim Borda",
        "timestamp": 1649355571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"314445\">@Jim Borda</span>  - The Epic R4 API for <a href=\"https://fhir.epic.com/Specifications?api=909\">Encounter.Search (R4)</a> doesn't support reasonReference only reasonCode.   The API documentation also says this about the reasonCode (i.e it's NOT going to be a CPT code -- CPT codes are about charges and billing)</p>\n<p>\"The reason for visit. The reason parameter may not always be populated. Unlike the Condition resource which documents diagnoses such as the flu, the reason parameter corresponds to the reason a patient gave for having that encounter such as a fever.\"</p>",
        "id": 278223297,
        "sender_full_name": "John Silva",
        "timestamp": 1649364005
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span> Thanks, buddy! I did not see that it was not supported in (R4). I will continue to search for what the most likely resource for populating CPT codes, pertaining to a \"visit type\".</p>",
        "id": 278328110,
        "sender_full_name": "Jim Borda",
        "timestamp": 1649435027
    }
]