[
    {
        "content": "<p>I think I previously mentioned on here my disappointment on the mandatory use of LOINC codes in Vital Signs  observations. It seems to have fallen on deaf ears.</p>\n<p>Today I notice that there is also a mandatory requirement to expose a number of VitalSign related searches - why?</p>",
        "id": 153867896,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1484690852
    },
    {
        "content": "<p>yes you did</p>",
        "id": 153867898,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484690926
    },
    {
        "content": "<p>If we are using Vital Signs in a document or messaging based solution , how does that work?</p>",
        "id": 153867903,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1484691035
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> They weren't deaf ears, but they were somewhat unsympathetic to the arguments as presented.  The benefits of requiring everyone to support LOINC outweigh the incremental cost of mapping from existing code systems to meet the requirement.</p>\n<p>I agree that the wording on the search parameter requirements should make clear they only apply to RESTful services - please submit a change request.   And I'm somewhat more sympathetic to concerns about mandatory search behavior.  There may be some services that only support a single type of vital sign and aren't capable of more than \"what's happened since some date-stamp\" or something - those would still be valid and useful services.  The criteria here seem to only make sense for EHRs or other general repositories of vital sign information.  While that might be the primary focus of attention right now, it's far from the only type of vital signs server that could exist.  So I'd be in favor of tightening the scope this applies to for servers.  And I'd be in favor of eliminating requirements for clients entirely.  Clients shouldn't be required to support a query unless their user interface or requirements drive them to need such a query.</p>",
        "id": 153867914,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484691761
    },
    {
        "content": "<p>where do we say these requirements?</p>",
        "id": 153867919,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484691937
    },
    {
        "content": "<p>Well that's unfortunate. Whether RESTful or not we will not be supporting this in the NHS. We are just going to have to be knowingly non conformant in this area. I absolutely do not see how HL7 can mandate terminology and functionality. This is a worrying precedent with FHIR and seems show little regard to affiliate requirements.</p>",
        "id": 153867925,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1484692012
    },
    {
        "content": "<p>I feel that mandating a free, recognized and international system actually helps global interoperability on a very typical use case. We intend to use the profile as-is. What's the alternative? Local stuff? SNOMED CT?</p>",
        "id": 153867931,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1484692269
    },
    {
        "content": "<p>Well within England we by policy mandate the use of SNOMED CT and as such would expect to use that as our query terminology. Having the requirement to support LOINC introduces confusion in to our national systems as LOINC is not used nationally. Additionally when using vital signs profiles in a messaging or document scenario (which will have no RESTful capability) also does not appear to make sense. Additionally we have the issue of the definition of what a vital sign is, we may have different observation which we deem to be vital signs and then they would have different characteristics than the ones defined by the US Argonaut project.</p>",
        "id": 153867934,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1484692656
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> You're free to mandate SNOMED CT.  That's not in conflict with HL7 mandating LOINC - systems can support both.  And in doing so can ensure interoperability of essential information outside the UK environment.  Certainly I'd hope that the NHS wouldn't prohibit implementations from choosing to be FHIR compliant while still meeting NHS's requirements if they want to send both.</p>",
        "id": 153867937,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484692835
    },
    {
        "content": "<p>Based on the discussion thread above, if I need to record vital signs using a code system other than LOINC e.g. CPT CAT II 3074F then I am not going to be able to use the Observation vital signs profile and instead create my own profile? is my understanding correct?</p>",
        "id": 153868146,
        "sender_full_name": "Angelica Garcia Gutierrez",
        "timestamp": 1484763198
    },
    {
        "content": "<p>You can create another profile, but you could comply with both - i.e. send codes from both code systems.  That would be FHIR's expectation</p>",
        "id": 153868148,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484763469
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> If I create another profile, can I then record vital signs using LOINCs, SNOMEDs, CPTs? or for the case of LOINCs these MUST be recorded in the HL7 vital signs profile?</p>",
        "id": 153868152,
        "sender_full_name": "Angelica Garcia Gutierrez",
        "timestamp": 1484763972
    },
    {
        "content": "<p>we expect that you'll use additional codings to refine/clarify the meaning of observation, or to provide additional translations. But whatever you do, you carry the base LOINC code so that everyone can search for and correctly recognise all the vital signs</p>",
        "id": 153868159,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484764517
    },
    {
        "content": "<p>So all Observation instances that contain vital signs covered by the HL7 must be compliant against the vital signs profile.  However, that doesn't keep you from sending any *additional* codes or elements you wish.</p>",
        "id": 153868175,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484767461
    },
    {
        "content": "<p>I don't see how mandating LOINC, or any other coding system, eliminates the need for handling multiple code definitions and code mapping, given that code systems (including LOINC) are regularly, and extensively, revised. If systems have to handle data using multiple coding systems, does it really matter whether they are called LOINC-xx and LOINC-yy or SNOMED-zz? Yes, the data is different, and the fewer the coding systems that need to be supported, the better. And yes, often the versions in some coding systems are close, but consider the history of the ICD and DSM codes, where different versions might as well be different systems. Also, if a realm wants to mandate use of a coding system, there is a mechanism for that, but does it belong in the standard?</p>",
        "id": 153868218,
        "sender_full_name": "Jonathan Shultlis",
        "timestamp": 1484770726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193295\">@Jonathan Shultlis</span> I agree. There seems to be a general misconception that if a system receives a resource with a coding that is alien to the code-system that it is designed to use, then it will not only store it for further use but will then also make a RESTFul api available for systems to access that data by. I know that for some systems that might be OK but in my jurisdiction all that would happen is that the receiving system would throw it away. Given that mappings between LOINC and the systems native code-system can be created then if required a system can expose an interface based on LOINC in any case.</p>",
        "id": 153868228,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1484771690
    },
    {
        "content": "<p>there is no such misconception. This has nothing to do with what happens inside a system. Nor is there any belief that mandating a single LOINC code will mean that there a no other codes, even no other LOINC codes. </p>",
        "id": 153868248,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484775487
    },
    {
        "content": "<p>All this is is a statement that theose LOINC codes are used to identify those vital signs on the API, irrespective of where you are (since we expect that vital signs will be shared widely across jurisdictional boundaries in patient repositories), and that also, should you wish to access those vital signs, you can query using those LOINC values. </p>",
        "id": 153868253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484775591
    },
    {
        "content": "<p>systems that don't use LOINC internally don't need to store LOINC internally; they are simply required to be able to identify these vital signs, and mark them accordingly if they expose them</p>",
        "id": 153868256,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484775660
    },
    {
        "content": "<p>in practice, we expect vital signs observations to be coded twice - once with the base loinc code, and once with a more specific code (which ever code system it comes from).</p>",
        "id": 153868260,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484775698
    },
    {
        "content": "<p>in practice, we could have chosen FHIR assigned magic values, or SNOMED magic codes, or LOINC magic codes. We chose LOINC because this aligns with the most countries. But they are simply magic values and it's fine to treat them as such. </p>",
        "id": 153868263,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484775834
    },
    {
        "content": "<p>I was just wondering about the construction of the webpage for the vital signs profile as it seems to be quite distinct from the standard pages generated for profiles by the build tool.</p>\n<p>Is there a way to generate a similar page for grouping profiles of a disease for example (e.g. cancer specific profiles which have a similar overall structure but would have differing codes and constraints)?</p>\n<p>Thanks in advance,</p>",
        "id": 153868451,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1484860798
    },
    {
        "content": "<p>That page is not an autogenerated page but all hand edited as it is a one-off page.   For a view of a Profile page being generated by the IG-publisher tool see the <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-allergyintolerance.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-allergyintolerance.html\">US-Core</a>  This is a combination of autogenerated and hand generated narrative including tables.</p>",
        "id": 153868461,
        "sender_full_name": "Eric Haas",
        "timestamp": 1484863206
    },
    {
        "content": "<p>Thanks for the response <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> </p>",
        "id": 153868472,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1484865828
    },
    {
        "content": "<p>Grahame mentioned that \"in practice, we could have chosen FHIR assigned magic values ...\".  From discussions I've had it appears that would be preferable for the UK.  FHIR codes are supported (generally) by everyone using FHIR, whereas LOINC codes, even though broadly supported, still aren't universal.  And since in practice we're treating them as \"magic values\", might it not be best to use FHIR-defined codes for anything that we mandate, and then map to LOINC (or SNOMED CT, or anything else)?</p>",
        "id": 153868474,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1484866030
    },
    {
        "content": "<p>I think that equates to 'make it harder for everyone else who uses LOINC' because a few countries would have a cosmetic preference agnainst LOINC. </p>",
        "id": 153868478,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484867228
    },
    {
        "content": "<p>but as soon as we have enough specific things to say about particular use cases, we should consider having a page. <span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> have you seen <a href=\"http://build.fhir.org/resourceguide.html\" target=\"_blank\" title=\"http://build.fhir.org/resourceguide.html\">http://build.fhir.org/resourceguide.html</a> ?</p>",
        "id": 153868479,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484867344
    },
    {
        "content": "<p>That means no  ( Says Captain Barbosa) :-)</p>",
        "id": 153868480,
        "sender_full_name": "Eric Haas",
        "timestamp": 1484867372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  thanks for directing me this to the page, it definitely clarified some things I did not know before, especially w.r.t. the timing association of the resources. However it does not quite answer my use case, or maybe I am missing something?<br>\nWe are basically trying to make condition profiles similar to the diagnosticrequest profiles you had shared previously (<a href=\"http://fhir.hl7.org.au/fhir/rcpa/prostate.html\" target=\"_blank\" title=\"http://fhir.hl7.org.au/fhir/rcpa/prostate.html\">http://fhir.hl7.org.au/fhir/rcpa/prostate.html</a>) where there is a common theme to the profiles with nuances specific to each cancer type and trying to figure out the best way to do so.</p>",
        "id": 153868483,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1484867945
    },
    {
        "content": "<p>it doesn't deal with your use case, but it's similar. There's an Australia IG around strutured reporting for Prostate Cancer - see <a href=\"http://fhir.hl7.org.au/fhir/rcpa/index.html\" target=\"_blank\" title=\"http://fhir.hl7.org.au/fhir/rcpa/index.html\">http://fhir.hl7.org.au/fhir/rcpa/index.html</a> - but that's also not quite the same. In practice, Clinical Modeling like this is running a long way behind the FHIR platform, partly because people interested in 'clinical modelling' are mainly pursuing a perfect methodology rather than focusing on getting clinical profiles into FHIR. But also for many other reasons - lack of consensus engagement, the size of the task, the difficulty of the domain....</p>",
        "id": 153868485,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484868372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> How much do we know about what percentage of vital signs instance data that is actually being exchanged is using the particular LOINC codes specified in the VS profile (assuming that LOINC codes are being used at all at present)?  If an instance has chosen a different LOINC code, then it will have to be mapped to the profile-specified code, so in that case it wouldn't be any more difficult to map to a FHIR code than to another LOINC code.</p>",
        "id": 153868495,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1484870450
    },
    {
        "content": "<p>right, it's probably about the same to use a FHIR code instead of a LOINC code for writing. But if you know how to interpret LOINC codes - most do - then LOINC would be preferable, no?</p>",
        "id": 153868509,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484880095
    },
    {
        "content": "<p>It may be preferable, but probably not strongly so.  It would be good to get some implementer input (from those who use LOINC, and those who don't).</p>",
        "id": 153868564,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1484916809
    },
    {
        "content": "<p>This issue was supposedly put to bed at the last  (Baltimore) WGM.   With the deadline for getting STU3 out the door.  I feel it is an untimely and unnecessary distraction. </p>",
        "id": 153868715,
        "sender_full_name": "Eric Haas",
        "timestamp": 1484976184
    },
    {
        "content": "<p>I'm looking at <a href=\"http://hl7.org/fhir/vitalsigns.html\" target=\"_blank\" title=\"http://hl7.org/fhir/vitalsigns.html\">http://hl7.org/fhir/vitalsigns.html</a> and it seems to be a profile for a single vital sign (a heart rate, or a respiratory rate, or a BP). Someday I'm hoping we might define a profile for a set of vitals altogether.  I'm planning to suggest that we rename the existing material to \"Vital Sign\" unless somebody thinks this is a bad idea...</p>",
        "id": 153889442,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494521972
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/vitalspanel.html\" target=\"_blank\" title=\"http://build.fhir.org/vitalspanel.html\">http://build.fhir.org/vitalspanel.html</a></p>",
        "id": 153889446,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494522537
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>!  (For anyone following along, clicking \"Profiles\" at the top of the spec --&gt; <a href=\"https://www.hl7.org/fhir/profilelist.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/profilelist.html\">https://www.hl7.org/fhir/profilelist.html</a> --&gt; \"Vital Signs Profile\". Which in turn links out to a bunch of individual structure definitions.)</p>",
        "id": 153889449,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1494522950
    },
    {
        "content": "<p>I thought it would be handy to profile each vital sign including the panel and present it all in a single table, but if the layout is confusing or misleading any suggestions to make it clearer are appreciated.   also to gather a bunch of heart rates, for example,  look at the <code>LastN</code> operation</p>",
        "id": 153889617,
        "sender_full_name": "Eric Haas",
        "timestamp": 1494567359
    },
    {
        "content": "<p>....Suggestions via gforge trackers</p>",
        "id": 153889618,
        "sender_full_name": "Eric Haas",
        "timestamp": 1494567409
    },
    {
        "content": "<p>Hi all, while creating profiles for some of the vital signs namely fluid intake and output, girth etc, am using the observation resource. Do I have to use the vital-signs profile instead of observation resource? Please let me know. Thank you</p>",
        "id": 153901420,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1502341924
    },
    {
        "content": "<p>profile are for the observations listed in profile documentation</p>",
        "id": 153901615,
        "sender_full_name": "Eric Haas",
        "timestamp": 1502376858
    },
    {
        "content": "<p>Should the profiles based on <a href=\"http://build.fhir.org/vitalsigns.html\" target=\"_blank\" title=\"http://build.fhir.org/vitalsigns.html\">VitalSigns</a> have the same name and title as VitalSigns? For example <a href=\"http://build.fhir.org/bodyweight.html\" target=\"_blank\" title=\"http://build.fhir.org/bodyweight.html\">BodyWeight</a>.</p>",
        "id": 153979290,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1532926263
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> - No. The name and title should be specific to the derived profile. Take for example: <a href=\"https://simplifier.net/FinnishPHR/fiphr-bodyweight-stu3/~xml\" target=\"_blank\" title=\"https://simplifier.net/FinnishPHR/fiphr-bodyweight-stu3/~xml\">https://simplifier.net/FinnishPHR/fiphr-bodyweight-stu3/~xml</a>. I think the bodyweight from the spec is wrong.</p>",
        "id": 153979391,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1532959277
    },
    {
        "content": "<p>Jira issue <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17571\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17571\">#17571</a> created</p>",
        "id": 153979596,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1532995638
    },
    {
        "content": "<p>You had me panicking for a second.  We're not on Jira yet... :)</p>",
        "id": 153979605,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532997932
    },
    {
        "content": "<p><span class=\"emoji emoji-1f633\" title=\"flushed\">:flushed:</span> <br>\nGForge issue <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17571\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17571\">#17571</a> created</p>",
        "id": 153979610,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1532998812
    },
    {
        "content": "<p>Ok got it.</p>",
        "id": 153979615,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533006528
    },
    {
        "content": "<p>STU3 has a profile of Observations called <a href=\"http://hl7.org/fhir/STU3/vitalsigns.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/vitalsigns.html\">VitalSigns</a>. There are many profiles based on VitalSIgns, including <a href=\"http://hl7.org/fhir/STU3/bodyheight.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/bodyheight.html\">BodyHeight</a>. These profiles slice Observation.code.coding by code, but the slices leave Observation.code.coding.code optional. In <a href=\"http://build.fhir.org/bodyheight.html\" target=\"_blank\" title=\"http://build.fhir.org/bodyheight.html\">R4 BodyHeight</a> Observation.code.coding.code is 1..1. This is what I expected. <br>\nI think that the STU3 slicing is inadequate, as an instance without  a value for Observation.code.coding.code would satisify the discriminator. So an instance could satisify both BodyHeight and BodyLength profiles.<br>\nThis means that references to STU3 VitalSigns cannot be sliced on profile.</p>\n<p>I'm using STU3 and want to slice <a href=\"http://hl7.org/fhir/STU3/medicationrequest.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/medicationrequest.html\">MedicationRequest</a>.supportingInformation to create one slice for body height and another for body weight. I intended to slice by profile (Slice: Unordered, Open by profile:reference.resolve()), but ran into the problem I've just described.</p>\n<p>Have others discovered this problem? <br>\nAre there widely adopted profiles without this problem?</p>\n<p>What is the best way forward?<br>\n1/ creating profiles of R3 <a href=\"http://hl7.org/fhir/STU3/bodyheight.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/bodyheight.html\">BodyHeight</a> and BodyWeight which follow the slicing used in <a href=\"http://build.fhir.org/bodyheight.html\" target=\"_blank\" title=\"http://build.fhir.org/bodyheight.html\">R4 BodyHeight</a> with coding, system and code 1..1<br>\n2/ slicing on MedicationRequest.supportingInformation by coding (Slice: Unordered, Open by value:reference.resolve().code.coding)</p>",
        "id": 153979629,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1533012219
    },
    {
        "content": "<p>I think that we should seriously consider deriving new profiles from the STU3 profiles and just tightening up to match with R4.</p>",
        "id": 153981353,
        "sender_full_name": "Danielle Tavares",
        "timestamp": 1533256089
    },
    {
        "content": "<p>It's not possible to derive profiles for one version from profiles from another version.  The resources aren't compatible and the snapshots for the two versions can't align.</p>",
        "id": 153981370,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533257434
    },
    {
        "content": "<p>That doesn't mean the profiles won't be retained largely the same.  They'll only resolve as necessary to reflect changes to Observation (not sure there's anything relevant) and feedback from implementers (a couple of terminology changes at least).</p>",
        "id": 153981372,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533257499
    },
    {
        "content": "<p>Lloyd, by \"follow the slicing used in R4 Body Height\" I mean to create a profile on the <a href=\"http://hl7.org/fhir/STU3/bodyheight.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/bodyheight.html\">STU3 BodyHeight</a> profile with Observation.code.coding 1..1 instead of 0..*</p>",
        "id": 153981438,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1533268246
    },
    {
        "content": "<p>Sorry.  Didn't read enough of the the thread before responding.</p>\n<p>In general we don't make fixes to prior releases.  It's difficult for both technical and process reasons</p>",
        "id": 153981443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533268775
    },
    {
        "content": "<p>Thanks.</p>",
        "id": 153981448,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1533269318
    }
]