[
    {
        "content": "<p>I'm moving this thread here  from the committers chat ...</p>",
        "id": 153818504,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459201141
    },
    {
        "content": "<p>background to the dsicussion:</p>",
        "id": 153818506,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459201184
    },
    {
        "content": "<p>in the freeze due imminently, we are defining a vital signs profile</p>",
        "id": 153818508,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459201199
    },
    {
        "content": "<p>the intent will be that all vital signs use the profile</p>",
        "id": 153818509,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459201211
    },
    {
        "content": "<p>and the freeze version will say that this is mandatory</p>",
        "id": 153818510,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459201228
    },
    {
        "content": "<p>here is the beginning of the thread FYI</p>",
        "id": 153818511,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459201249
    },
    {
        "content": "<p><a href=\"https://chat.fhir.org/#narrow/near/7801/stream/committers/topic/vital.20signs\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/near/7801/stream/committers/topic/vital.20signs\">https://chat.fhir.org/#narrow/near/7801/stream/committers/topic/vital.20signs</a></p>",
        "id": 153818512,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459201252
    },
    {
        "content": "<p>this is to stimulate discussion - to push as far as we can to general interop for vital signs</p>",
        "id": 153818513,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459201259
    },
    {
        "content": "<p>the profile is here: <a href=\"http://hl7-fhir.github.io/observation-vitalsigns.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/observation-vitalsigns.html\">http://hl7-fhir.github.io/observation-vitalsigns.html</a></p>",
        "id": 153818514,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459201277
    },
    {
        "content": "<p>obviously, there will be lots of dsicussion about the profile, and about the rule about the profile</p>",
        "id": 153818515,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459201291
    },
    {
        "content": "<p>Do we have a set of codes for other observations that can be gathered from wearables / apps / devices - captured anywhere?<br>\nFor eg.:<br>\nFitness activities :walk, run, bicycling, etc.. <br>\nsteps, calories burned, elevation etc.<br>\nSleep: awake, deep, light rem etc..<br>\nDiabetes specific: hba1c, blood glucose, triglyceride, insulin..<br>\nBiometric: calcium, chromium, folic acid, magnesium etc...<br>\nNutrition: calories, carbohydrates, fat, protein etc...</p>",
        "id": 153823287,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1461718424
    },
    {
        "content": "<p>I don't think we've tried to standardize these yet.  Feel free to submit a change request to have the ones you feel are important added to the vital signs profile (though I suspect some of them will be added to a separate profile as these aren't really vitals)</p>",
        "id": 153823289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461719743
    },
    {
        "content": "<p>there's this:</p>",
        "id": 153823298,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461721590
    },
    {
        "content": "<p><a href=\"http://www.healthintersections.com.au/?p=2487\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2487\">http://www.healthintersections.com.au/?p=2487</a></p>",
        "id": 153823299,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461721641
    },
    {
        "content": "<p>Thanks Grahame!  On the Observation.category, can a particular observation be in more than one category. I see that VitalSigns here is a Observation Category <a href=\"https://hl7-fhir.github.io/valueset-observation-category.html\" target=\"_blank\" title=\"https://hl7-fhir.github.io/valueset-observation-category.html\">https://hl7-fhir.github.io/valueset-observation-category.html</a>. So going by that, can Blood Pressure have a Observation.category as both \"Fitness Data\" and \"Vital Signs”? Or this is managed as separate profiles - one for each?</p>",
        "id": 153823522,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1461806487
    },
    {
        "content": "<p>well, category is 0..1, so can't repeat. Why would you want to mark it as both? </p>",
        "id": 153823552,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461824447
    },
    {
        "content": "<p>The reason I asked was because I saw a bunch of observations that are already under vital-signs here <a href=\"http://www.healthintersections.com.au/?p=2487\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2487\">http://www.healthintersections.com.au/?p=2487</a> under code fitness. So it seems like there will be some discussions on under which category do each of these observations belong..</p>",
        "id": 153823566,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1461824878
    },
    {
        "content": "<p>I should update that post, I guess. But blood pressure is an interesting case - maybe it differs depending on where you get it from?</p>",
        "id": 153823567,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461824954
    },
    {
        "content": "<p>I think a Blood Pressure is always a vital sign, as is a heart rate, etc.  Most (all) vitals are relevant to fitness.  (So perhaps the vital signs category is a specialization of the fitness category?)</p>",
        "id": 153823592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461844790
    },
    {
        "content": "<p>I'll try to think about it further, but I don't believe that vital signs is likely a proper specialization of \"fitness\".  If there is a legitimate subsumption relationship, it's much more likely to be the reverse.  After all, it is necessarily true that in order to be \"fit\" you must first be alive. :)</p>",
        "id": 153823594,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1461845611
    },
    {
        "content": "<p>Hi Gana,  we have a tracker to increase the cardinality of Category from 0..1 to 0..* and will be discussing a the WGM in Montreal.  I really want to explore the downside of this change request before deciiding on it.  Another tracker ( mine) to make the existing categories requierd - otherwise the vitals profile can't really work in core.  Also why would a vital sign from a fitbit vs from a cuff be a separate category?   They are both BPs  the method and context are different.  category is at on end of the spectrum and code at the other.   we need to be careful we don't start meeting in the middle.  </p>",
        "id": 153823623,
        "sender_full_name": "Eric Haas",
        "timestamp": 1461886878
    },
    {
        "content": "<p>Hi Eric, I wasnt suggesting that we should have separate categories for data from different sources. I was trying to figure out what all observation categories are out there, and during the process came across the above blog post from Grahame. So it seems like this is a WIP where we have to figure out which categories do each of the readings fall under. For eg. \"Calories Burned\" can't be a vital sign right? Similarly calcium, fat etc...</p>",
        "id": 153823624,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1461887331
    },
    {
        "content": "<p>Yes you are right category is rather broad so many orthogonal classification schemes <br>\nare possible I guess.  non-clinical vs clinical  Fitness vs Sick vs Recovery  </p>",
        "id": 153823625,
        "sender_full_name": "Eric Haas",
        "timestamp": 1461887392
    },
    {
        "content": "<p>FYI - here is the tracker that is requesting multiple observation categories in case you want to monitor it:  <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9543\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9543\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9543</a></p>\n<p>In addition to using categories for all fitness/wellness observations, I'm curious to learn if others plan to use Observation.related for linking subsets of these observations, such as:</p>\n<ul>\n<li>For a given meal, linking the intake of potassium, iron, calcium, calories, fat, protein, etc</li>\n<li>For a given activity summary (for the period of a day), linking the duration, distance, steps, calories burned, floors, etc</li>\n<li>For a given sleep summary (for a period of time), linking time awake/asleep, time to fall asleep or wakeup </li>\n</ul>\n<p>I'm also interested in feedback around how best to communicate veracity of these observations (e.g. clinically provisioned home device vs consumer grade device bought off the shelf vs patient manually entered the data into a third party app, like Apple HealthKit).  While Provenance, Observation.performer = patient, and Observation.device are all options, the biggest challenge is that the aggregator third party consumer apps don't always differentiate between patient manually entered data (least trustworthy) or device-interfaced data (better), meaning we don't know the specific provenance for each observation.  Anyone else wrestling with how best to represent veracity when the source data doesn't expose the specific provenance of each observation? </p>",
        "id": 153823810,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1461944560
    },
    {
        "content": "<p>I think this is a great topic for discussion in OO.  Maybe for this WGM?  Using  device, method and performer we should be able to capture this.   I would think if  you are unable document the source it all gos in the same bucket as any other \"reported but not verified observation\" </p>",
        "id": 153824080,
        "sender_full_name": "Eric Haas",
        "timestamp": 1462138613
    },
    {
        "content": "<p>+1 for OO discussion/examples/guidance.</p>",
        "id": 153824151,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1462193102
    },
    {
        "content": "<p>Hi all, what is the difference between the 'Vital Signs Profile' and 'Vital Signs Panel Profile' ?</p>",
        "id": 153906070,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1505120527
    },
    {
        "content": "<p>a  panel is wrapper around several vital measurements. see the examples</p>",
        "id": 153906471,
        "sender_full_name": "Eric Haas",
        "timestamp": 1505166630
    },
    {
        "content": "<p>Has anyone done an example Questionnaire to capture the vital signs?</p>",
        "id": 153919098,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1510445183
    },
    {
        "content": "<p>Can I seek a clarification on the use of Observations that are part of the HL7 defined vital signs<br>\n- are all Observations that are in the Vital Signs set to follow the vital signs structure definition (e.g. all Height measurements have a category fixed to vital-sign &amp; use the magic LOINC code)? - even if the height measurement is just part of a routine child examination for example?</p>",
        "id": 153972082,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1530108288
    },
    {
        "content": "<p>yes</p>",
        "id": 153972201,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530129568
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  can we use SNOMED CT codes for vital signs?</p>",
        "id": 153997643,
        "sender_full_name": "Munish Jokhani",
        "timestamp": 1537286734
    },
    {
        "content": "<p>yes as an additional Coding element.</p>",
        "id": 153997651,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537288344
    },
    {
        "content": "<p>I.e. you must send the mandatory LOINC code, but you're free to <em>also</em> send a SNOMED code (and codes from any other code systems that are known/helpful)</p>",
        "id": 153997661,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537290261
    },
    {
        "content": "<p>In order to achieve vital signs conformance would a project need to have a separate profile for each Vital sign or could we just use 1 vital sign profile and specify how that profile was populated to be in line with each of the individual profiles within the specification?</p>",
        "id": 174892100,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1567610347
    },
    {
        "content": "<p>FHIR has defined specific profiles for 10 vital signs.  You could create a generic profile that tried to span a bunch of them if you wanted to, but you'd be limited in what interoperability you could get if you don't specify which ones have components, which have values, what the units of measure are, etc.</p>",
        "id": 174893521,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567611237
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193998\">@Pete Salisbury</span> sounds like a discussion from some time ago - the trade-off between many profiles and more interoperability or fewer profiles and less interoperability.</p>",
        "id": 174952819,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1567670329
    },
    {
        "content": "<p>I get the interoperability issue with generic profiles but i think <span class=\"user-mention\" data-user-id=\"193998\">@Pete Salisbury</span> is asking about conformance. Do we have to create equivalent 10 UK vital signs profiles to conform to FHIR international or we could use a generic observation or vital signs profile and issue implementation guidance on which SNOMED CT codes and units to use for specific vitals e.g. temperature.</p>",
        "id": 175048827,
        "sender_full_name": "Munish Jokhani",
        "timestamp": 1567762453
    },
    {
        "content": "<p>depends how much tooling support you want. e.g. Defining the profiles will allow the validator to check conformance to your profiles</p>",
        "id": 175057354,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567771275
    },
    {
        "content": "<p>Having a 1 for 1 profile that enforces the FHIR core constraints as well as your SNOMED codes would make your profiles a one-stop shop for your implementers, which would be easier.  Creating a single generic profile + guidance means implementers would have to look at the UV profiles + your generic profile + the guidance in order to know what to do.  (Which would both be harder and more likely for them to miss at least one of the things they need to align with.</p>",
        "id": 175067577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567778743
    },
    {
        "content": "<p>If your terminology server is good enough <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> , you could create a simple profile that just says \"Observation.code has an extensible binding to a appropriate value set based on SNOMED CT\". Then your IG can require vital signs instances to conform to both the FHIR profile and your \"use SCT\" profile, and rely on a validator with the good enough (magical) terminology server that complains if you use both LOINC for temperature and SNOMED  CT for body height as alternate codes in Observation.code.coding.</p>\n<p>That would give you validation with a simple profile, and offload the hard work to the terminology server. It would not have detailed guidance for implementers.</p>",
        "id": 175215351,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1568006165
    },
    {
        "content": "<p>Maybe.</p>",
        "id": 175215411,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1568006294
    },
    {
        "content": "<p>Forcing use of terminology servers would hinder adoption, especially on basic obs systems where the Vital Signs profiles are most suited. Advanced Obs systems should follow the same Vital Signs profiles but also carry the actual codes used. Advanced Obs systems are more likely to understand coding issues and more likely to make use of a Terminology server.</p>\n<p>Possibly this can be done by having use added to the Coding (similar to identifier.use)</p>",
        "id": 175220338,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1568014103
    },
    {
        "content": "<p>So standing BP would have use=actual and also use=official code=LOINC+SNOMED BP.</p>",
        "id": 175220457,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1568014295
    },
    {
        "content": "<p>what makes it actual vs official?</p>",
        "id": 175220461,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568014318
    },
    {
        "content": "<p>official also the magic code</p>",
        "id": 175220506,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1568014333
    },
    {
        "content": "<p>what it is a is a matter of perspective</p>",
        "id": 175220511,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568014349
    },
    {
        "content": "<p>situation is clearer with identifiers but even then it creates challenges</p>",
        "id": 175220516,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568014363
    },
    {
        "content": "<p>Agree.</p>",
        "id": 175220755,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1568014752
    },
    {
        "content": "<p>you could raise this on the terminology channel. it won't be an easy discussion but 'prupose of use' has come up on multiple different contexts, and there's a few extensions out there</p>",
        "id": 175220768,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568014797
    },
    {
        "content": "<p>let me look....</p>",
        "id": 175220771,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568014800
    },
    {
        "content": "<p>We could develop validation in the tooling ; does it mean the validator will still need to check conformance to the rules below:</p>\n<p>*\"Each Observation must have:<br>\na status<br>\na category code of 'vital-signs'<br>\na \"magic value\"  LOINC code which tells you what is being measured<br>\na patient<br>\na time indicating when the measurement was taken<br>\na numeric result value and standard UCUM unit which is taken from the Unit Code column in the table below.\"*</p>",
        "id": 175256041,
        "sender_full_name": "Munish Jokhani",
        "timestamp": 1568044893
    },
    {
        "content": "<p>Yes , using the StructureDefinition,  that is simple summary of the requirements</p>",
        "id": 175264951,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568050939
    },
    {
        "content": "<p>what the validator can't do is know when the magic code is needed based on ... context....</p>",
        "id": 175277523,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568059313
    },
    {
        "content": "<p>Based on the requirements above, doesn't it mean that magic code is a \"must\" requirement, so always needed to conform to the requirements? When do you think magic code is not needed?</p>",
        "id": 175332705,
        "sender_full_name": "Munish Jokhani",
        "timestamp": 1568120385
    },
    {
        "content": "<p>If the profile is mandatory for the context, then the magic code for that context will be mandatory.  In some contexts, multiple profiles could be mandatory and in some cases each could have a distinct magic code.  (Uncommon, but could be valid use cases.)</p>",
        "id": 175335014,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568121939
    },
    {
        "content": "<p>This question is more towards informatics side. In my project we are dealing with many parameters like 'Pregnancy length', 'Arm span', Waist circumference, Bone age, Pubic hair stage, Genital stage , Body height, Body weight, Father height, Mother height, Sit height, Head circumference  etc. Initially we thought to use the Observation resource to derive the profiles for above parameters. But later found the standard profile 'Vital signs' <a href=\"https://www.hl7.org/fhir/observation-vitalsigns.html\">https://www.hl7.org/fhir/observation-vitalsigns.html</a> and deiced to derive the profiles for body weight, body height, head circumference using that standard Vital sign profile. <br>\n Can I use the Vital sign standard profile to derive all the parameters I have mentioned above ? Are those actually vital signs ?  Or should I derive those from the Observation resource ?</p>",
        "id": 205221257,
        "sender_full_name": "Dharani Ranasinghe",
        "timestamp": 1595933190
    },
    {
        "content": "<p>I would use the Vital Signs profile for all of the data elements (e.g. body height, etc.) that match with it (which is what is required to be conformant with FHIR) and use Observation (presumably creating additional profiles on it) for the others.</p>",
        "id": 205222324,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595934157
    },
    {
        "content": "<p>Hello everyone, </p>\n<p>I'm new to FHIR and I want to implement a component in a WebApp where one can enter his/her vital signs. I just found out about the vital signs profile for the Observation Resource. But I don't understand the table on Point \"10.1.19 Formal View of Profile Content \" on <a href=\"http://hl7.org/fhir/observation-vitalsigns.html\">http://hl7.org/fhir/observation-vitalsigns.html</a> . I thought vital-signs is 1 profile, why is the table showing multiple profiles then?</p>",
        "id": 205243495,
        "sender_full_name": "Volker Sedlmair",
        "timestamp": 1595947030
    },
    {
        "content": "<p>There are distinct profiles for each of a set of specific vital signs.  The 'vitalsigns' profile is an ancestor to those.</p>",
        "id": 205248189,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595949101
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Vital.20signs/near/205248189\">said</a>:</p>\n<blockquote>\n<p>There are distinct profiles for each of a set of specific vital signs.  The 'vitalsigns' profile is an ancestor to those.</p>\n</blockquote>\n<p>All right, thank you! :)</p>",
        "id": 205339075,
        "sender_full_name": "Volker Sedlmair",
        "timestamp": 1596018350
    },
    {
        "content": "<p>So I'm wondering:</p>\n<p>If I use Vital Signs Panel profile for vital signs (<a href=\"http://hl7.org/fhir/vitalspanel.html\">http://hl7.org/fhir/vitalspanel.html</a>), is it meant to work like that you send an HTTP request to every member the Vital Signs Panel has? <br>\nBecause I've also seen that the Resource GraphDefinition is meant to define a set of resources to query for. So which should be used, Vital Signs Panel or GraphDefinition - has anyone experience with that?<br>\nBecause I imagine that it can be quite slow to query for every member in the Vital Signs Profile.</p>",
        "id": 205693907,
        "sender_full_name": "Volker Sedlmair",
        "timestamp": 1596308283
    },
    {
        "content": "<p>You can use _include to bring them all back at once.  When you submit, you can submit one at a time or use a batch or transaction</p>",
        "id": 205697317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596314354
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Vital.20signs/near/205697317\">said</a>:</p>\n<blockquote>\n<p>You can use _include to bring them all back at once.  When you submit, you can submit one at a time or use a batch or transaction</p>\n</blockquote>\n<p>Initial post: What do you mean with _include?</p>\n<p>Edit: Ah, you mean the _include query paramter of FHIR search operations right?</p>",
        "id": 205724087,
        "sender_full_name": "Volker Sedlmair",
        "timestamp": 1596368690
    },
    {
        "content": "<p>Yes</p>",
        "id": 205729201,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596377766
    },
    {
        "content": "<p>We want to build a set of profiles for perinatal care - weight, head circumf, LMP, etc. This will expectably be a lot of profiles.</p>",
        "id": 206951189,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597424028
    },
    {
        "content": "<p>Any best practices to handle this amount of profiles?</p>",
        "id": 206951253,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597424045
    },
    {
        "content": "<p>some thoughts:</p>\n<ol>\n<li>make it layered with the common stuff like national constraints in one profile, and actual meaurement profiles (HC, LMP, BP, ..)  as very small profiles on top of that..?</li>\n<li>any clever way to display this guidance? If an IG has many profiles, users will not know where to start. The expectation is that this IG will also contain our allergy, addiction, vaccination, etc</li>\n</ol>",
        "id": 206951607,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597424208
    },
    {
        "content": "<p>Public Health is working on a set of FHIR IGs which may be of interest to you as they include a lot of observations about pregnancy and delivery. If your observations overlap with these, we should definitely talk. I've struggled too with the number of profiles. As it turns out when you split it over 3 IGs, each one becomes a more manageable list <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span><br>\nPH common profile library - <a href=\"http://build.fhir.org/ig/HL7/fhir-vr-common-ig/branches/master/artifacts.html\">http://build.fhir.org/ig/HL7/fhir-vr-common-ig/branches/master/artifacts.html</a><br>\nbirth defect reporting - <a href=\"https://build.fhir.org/ig/HL7/fhir-birthdefectsreporting-ig/artifacts.html\">https://build.fhir.org/ig/HL7/fhir-birthdefectsreporting-ig/artifacts.html</a><br>\nbirth and fetal death reporting - <a href=\"http://build.fhir.org/ig/HL7/fhir-bfdr/artifacts.html\">http://build.fhir.org/ig/HL7/fhir-bfdr/artifacts.html</a></p>",
        "id": 207148896,
        "sender_full_name": "Craig Newman",
        "timestamp": 1597673744
    },
    {
        "content": "<p>Though I am thinking we need to move some of the pregnancy ones that are currently in BFDR into the common IG. We can work through those over the next couple of months.</p>",
        "id": 207478492,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1597884450
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Vital.20signs/near/205729201\">said</a>:</p>\n<blockquote>\n<p>Yes</p>\n</blockquote>\n<p>So I just tried the include paramter, but it seems not to work because hasMember is an Array, not a single reference object. Is it even possible to use _include with an Array of references?</p>",
        "id": 208501933,
        "sender_full_name": "Volker Sedlmair",
        "timestamp": 1598818012
    },
    {
        "content": "<p>Hello, <br>\nI'm including some Vitalsigns in my Implementation guide, and it looks for me strange that dataAbsentReason or component subelement has<br>\nmustSupport = true.</p>\n<p>DataAbsentReason example : my profile includes <a href=\"http://hl7.org/fhir/StructureDefinition/bodyweight\">http://hl7.org/fhir/StructureDefinition/bodyweight</a>.<br>\nBut my system don't need the information dataAbsentReason, if the bodyweight is not specified, it is simply missing.<br>\nThis is valid for observation-bodyweight, observation-bodyheight, observation-bmi, observation-bp etc ...<br>\nI have actually two solutions, or copy those profiles and create my owns or the \"not so clean one\" : force mustSupport=false on those profiles.<br>\nWould it not be better not to set mustSupport for the element DataAbsentReason ?</p>\n<p>Component example: this element is usefull for Blood pressure, since blood pressure need two values.<br>\nBut what about observation-bodyweight, observation-bodyheight or observation-bmi ? <br>\nIf my system needs those profiles, it should support the component object. That in my opinion doesn't really make sense for those profiles.<br>\nWould it  not be better not to set mustSupport for the element component ? <br>\nAnd only set must support on the Blood Pressure profile ?</p>\n<p>Best regards,<br>\nDavid</p>",
        "id": 209304095,
        "sender_full_name": "David Gutknecht",
        "timestamp": 1599490501
    },
    {
        "content": "<p>The expectation is that if you're going to have an Observation instance that doesn't have a value, you should explain why - otherwise you're not sharing anything useful and there's no need to have an instance at all.  If you think it's unreasonable to have to support that, feel free to provide feedback using the \"propose a change\" link</p>\n<p>I was surprised to find component marked as mustSupport for body weight.  Suggest submitting a change request for those too.</p>",
        "id": 209310138,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599494654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"460371\">@Sreenivas Dunna</span>, I've changed the topic heading to be one relevant to your question.  (Always post under a topic name related to what you're asking so it doesn't confuse readers of the original thread.)</p>\n<p>Have you looked at the ObservationDefinition resource and at the vital signs profiles off Observation?</p>",
        "id": 277811945,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649118314
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thank you for the quick response.<br>\nThere is no no vital profile for observations. But I found this after some searches <a href=\"http://hl7.org/fhir/observation-vitalsigns.html\">http://hl7.org/fhir/observation-vitalsigns.html</a>, but in this page there is no reference range defined, where can I find this normal range for the vitals?</p>",
        "id": 277827297,
        "sender_full_name": "Sreenivas Dunna",
        "timestamp": 1649134191
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"460371\">@Sreenivas Dunna</span> <br>\nI expect that different reference range values for vital signs are determined by different groups of clinicians. Probably more than one in some countries. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> You might have to see if anyone has located and coded the reference ranges relevant to you.</p>",
        "id": 277831570,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1649138576
    },
    {
        "content": "<p>That's a clinical decision, which may vary based on your context (country, clinical setting, medications taken) and as such HL7 won't be the best source for guidance on the values for reference ranges.</p>",
        "id": 277831608,
        "sender_full_name": "René Spronk",
        "timestamp": 1649138586
    },
    {
        "content": "<p>If reference ranges were a fixed value for a given observation (code) then there wouldn't be a need for a reference range attribute on an observation, you'd just go to the dictionary. The idea of a reference range on an observation is so it can be annotated, \"At this time, under these conditions, for this patient, on these meds I state that this value is in the patients normal range.\" Regardless of whether that value would be considered high or abnormal high or... for another patient in a different situation.</p>",
        "id": 277867128,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1649160550
    }
]