[
    {
        "content": "<p>I posted this in the Terminology stream as well, so apologies if you're seeing this twice (wasn't sure where it belonged)</p>\n<p>I'm creating some Vital Signs profiles. We are following the HL7 base standard and implementing the \"magic codes\", however, we use SNOMED CT as our terminology rather than LOINC. The plan is to have a SNOMED equivalent to the LOINC \"magic code\", as well as allow a more details SNOMED expression. So, for example, a <br>\nBody weight vital sign <br>\nWILL HAVE a LOINC code 29463-7 , <br>\nWILL HAVE a SNOMED equivalent of 27113001, <br>\nand MAY HAVE a more specific SNOMED concept of 424927000 | Body weight with shoes. <br>\nOn the profile I want to make it as obvious as possible that you MUST have the LOINC code and the SNOMED equivalent - what's the best method to achieve this? For example by introducing mandated slices for LOINC &amp; SNOMED? Having the code bound to LOINC for the \"magic value\" as Extensible &amp; having a SNOMED slice? Just have some guidance against the code?<br>\nWhat I would really like is for instances to be computably checkable against the profile definition.</p>",
        "id": 154008544,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1539356622
    },
    {
        "content": "<p>To enforce it with the validator, you'll want to slice coding by system and code and then have slices with the fixed values of the codes that must be present.  The overall binding you can leave at the value set that covers the possible more granular codes.</p>",
        "id": 154008560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539362801
    },
    {
        "content": "<p>Also, it's generally best to only post a question in one stream at a time.  Though if you want to include a pointer in another stream to draw people's attention to the question, that's fine.</p>",
        "id": 154008570,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539363726
    }
]