[
    {
        "content": "<p>There are two loinc codes in use for Body height in the vital signs profile, namely: 8302-2 - body height and 8306-3 - body height --lying. Suppose I want to explicitly convey body height standing, what do I do? Do I use the profile with loinc code 8302-2 with a supporting observation for \"standing\"? Or do I use Loinc code 8308-9 - body height --standing?</p>",
        "id": 153904644,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1504707073
    },
    {
        "content": "<p>...or assume is standing unless otherwise specified...  or add a translation for the standing code</p>",
        "id": 153904659,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504714162
    },
    {
        "content": "<p>I'd agree that Body height - standing is the usual way for anyone &gt;1yr or so, but inferring semantics like that does not seem right to me.</p>\n<p>What do you mean by adding a \"translation\"? Is that adding a second code 8306-9 next to 8302-2? If that is a valid solution than we might as well be consistent and do the same for 8302-2 + 8306-3 Body height - lying and skip that separate profile altogether. That sounds doable to me.</p>",
        "id": 153904680,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1504722660
    },
    {
        "content": "<p>I agree, Alexander.  I think they are analogous, and it's probably not necessary or helpful to call out body length separately - it could all be 8302-2 (Body height), since it can cover both standing and lying, with the more specific translation codes in addition if they are felt to be needed.  I don't recall the details of our previous discussions on this (I'm sure that <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> probably does) and why it ended up this way, but it seems like this change would make sense.</p>",
        "id": 153904697,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1504724891
    },
    {
        "content": "<p>+1 -  I believe that is what is conveyed in the profile when it says:</p>\n<blockquote>\n<p>If a more specific code or another code system is recorded or required, implementers must support both the values (LOINC) listed below and the translated code - e.g. method specific LOINC codes, SNOMED CT concepts, system specific (local) codes</p>\n</blockquote>\n<p>Thus, it would manifest as two Observation.code.codings in our implementation.</p>",
        "id": 153904701,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1504725939
    },
    {
        "content": "<p>+1 We can work with that. <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> can you open a tracker for this, so the international Vital Sign for Body height  - lying could be deprecated, and wording on Vital Sign for Body height could be extended to make clear that \"translations\" are the way to go for lying/standing?</p>",
        "id": 153904959,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1504860339
    },
    {
        "content": "<p>Created <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13801\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13801\">GF#13801</a></p>",
        "id": 153904985,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1504864627
    },
    {
        "content": "<blockquote>\n<p>wording on Vital Sign for Body height could be extended to make clear that \"translations\" are the way to go for lying/standing?</p>\n</blockquote>\n<p>As the primary editor of this artifact That  suggestion is a slippery slope -  We already state this generally... and provide several example that demonstrate it.    One could state something similar for every other profile in vitals.</p>",
        "id": 153905062,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504915983
    },
    {
        "content": "<p>Maybe, but then you also created a separate profile for Body height lying in the Vital Signs panel that does not work like that, and thus created confusion about that mechanism. If the translations thing really works that way naturally for everyone, then the Body height - lying thing would not have existed.</p>\n<p>So now that this separate profile exists you can:<br>\n1. Obsolete that separate profile and add wording to the general profile Body height to say that translations are the way to go for lying/standing</p>\n<p>2. Create a new Body height profile for standing and leave the initial two as-is</p>\n<p>If translations are the right direction generally, and that sounds right to me, then 1. is the only right solution. If translations are only sometimes the right solution, then 2. is an option, but it invites people around the world to profile similarly thus creating a zillion profiles based on more specific versions of existing profiles.</p>",
        "id": 153906053,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1505104558
    },
    {
        "content": "<p>I believe a tracker is already in the docket.   Will run by OO and  US Realm (for US Core profiles)</p>",
        "id": 153906501,
        "sender_full_name": "Eric Haas",
        "timestamp": 1505167416
    }
]