[
    {
        "content": "<p>Hi Implementers</p>\n<p>The Vocabulary WG is interested in how implementers of the FHIR core specification and FHIR implementation guides have interpreted and implemented the FHIR extensible binding strength (see here — <a href=\"https://www.hl7.org/fhir/terminologies.html#strength\">https://www.hl7.org/fhir/terminologies.html#strength</a> — for R4).<br>\nTo assist us, we would like you to consider the following example scenario and answer the questions which follow.</p>\n<hr>\n<p><strong>Scenario</strong></p>\n<ul>\n<li>Code system CS1 is defined as follows:</li>\n</ul>\n<table>\n<thead>\n<tr>\n<th>Code</th>\n<th>Description</th>\n<th>Subsumed By</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>A</td>\n<td>Carbuncle on the knee</td>\n<td></td>\n</tr>\n<tr>\n<td>B</td>\n<td>Carbuncle on the thigh</td>\n<td></td>\n</tr>\n<tr>\n<td>B1</td>\n<td>Carbuncle on the left thigh</td>\n<td>B</td>\n</tr>\n<tr>\n<td>C</td>\n<td>Carbuncle on the calf</td>\n<td></td>\n</tr>\n<tr>\n<td>D</td>\n<td>Carbuncle on the neck</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<ul>\n<li>All concepts in code system CS1 have unique meanings.</li>\n<li>A profile of the Condition resource extensibly binds the Condition.code CodeableConcept data element (<a href=\"https://www.hl7.org/fhir/condition-definitions.html#Condition.code\">https://www.hl7.org/fhir/condition-definitions.html#Condition.code</a>) to value set VS1 which is defined as a composition of only codes A, B and C from code system CS1.</li>\n</ul>\n<hr>\n<p><strong>Questions</strong></p>\n<ul>\n<li>\n<p><strong>Question 1:</strong> Assuming you wish to populate Condition.code with value B1 (Carbuncle on the left thigh) which is <em>not</em> in the expansion of extensibly bound value set VS1.</p>\n<p><strong>(a)</strong> are your implementations such that the Condition.code data element will contain two Coding elements – specifically, one for B1 and one for B (Carbuncle on the thigh) ? </p>\n<p><strong>(b)</strong> If your answer to Question 1(a) is <em>yes</em>, how do you make clear to receiving systems (which may not be able to determine that B1 is subsumed by B) that B1 is the more specific and intended value?</p>\n<p><strong>(c)</strong> If your answer to Question 1(a) is <em>no</em>, do your implementations have only a single Coding element (with value B1) for Condition.code?</p>\n</li>\n<li>\n<p><strong>Question 2:</strong> Assuming you wish to populate Condition.code with value D (Carbuncle on the neck) which is also <em>not</em> in the expansion of extensibly bound value set VS1.</p>\n<p><strong>(a)</strong> are your implementations such that the Condition.code data element will contain only one Coding element - specifically value D ? </p>\n<p><strong>(b)</strong> are your implementations such that the Condition.code data element will contain two or more Coding elements – specifically D and one or more from A, B and C ?</p>\n<p><strong>(c)</strong>  if your answer to Question 2(b) is <em>yes</em>, how are those values determined ?</p>\n</li>\n</ul>\n<hr>\n<p>For those who wish to participate in this survey, please provide your answers to the questions by <time datetime=\"2022-02-16T20:00:00Z\">2022-02-17T06:00:00+10:00</time>  in this Zulip channel or directly to the Vocabulary WG co-chairs via listserv email to <a href=\"mailto:vocab-cc@lists.hl7.org\">vocab-cc@lists.hl7.org</a> .  </p>\n<p>Your participation is appreciated.</p>\n<p>Thank you,<br>\nReuben (on behalf of the Vocabulary WG co-chairs)</p>",
        "id": 270363414,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1643798127
    },
    {
        "content": "<ol>\n<li>a) This is the only way to be compliant (and that can't change)<br>\nb) There's no mechanism to communicate which codes are more specific than other codes.  You can indicate which was the selected code, but that's it<br>\nc) Doing this would be non-conformant (and that can't change)</li>\n</ol>\n<p>2 a) You could have more than one, but A, B and C wouldn't make sense<br>\nb) This would be nonsensical unless the patient has really interesting anatomy or someone is conveying two problems with one element</p>",
        "id": 270428139,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643824113
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191333\">Reuben Daniels</span> <a href=\"#narrow/stream/179166-implementers/topic/Vocabulary.20WG.20survey.20on.20FHIR.20extensible.20binding.20strength/near/270363414\">said</a>:</p>\n<blockquote>\n<p><strong>(a)</strong> are your implementations such that the Condition.code data element will contain two Coding elements – specifically, one for B1 and one for B (Carbuncle on the thigh) ? </p>\n</blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Vocabulary.20WG.20survey.20on.20FHIR.20extensible.20binding.20strength/near/270428139\">said</a>:</p>\n<blockquote>\n<ol>\n<li>a) This is the only way to be compliant (and that can't change)</li>\n</ol>\n</blockquote>\n<p>That means all the IGs and profiles that have an extensible valueset, and have the common slicing pattern of restricting to one value from the corresponding code system will be unable to represent the more specific B1.</p>",
        "id": 270434412,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643826373
    },
    {
        "content": "<p>No.  They're free to send B1.  They just have to send B too.  What they <em>can't</em> do is send B1 by itself.</p>",
        "id": 270443386,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643830049
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> Do you have examples of the \"common slicing pattern of restricting to one value from the corresponding code system\" in mind?  I think that pattern is <strong>not</strong> one that normally should be expected or desired.  As Lloyd said, normally they should be free to include multiple Codings in a CodableConcept data type with different codes from the same code system, as there are certainly situations (particularly  with extensible bindings) where that is useful and necessary.</p>",
        "id": 270444047,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1643830312
    },
    {
        "content": "<p>Maybe I'm misreading it--I was specifically thinking of slicing like in IPS Immunization.vaccinationCode. I recognize that this isn't extensible, but the slicing I was thinking about is there.</p>\n<p>... Now I'm pretty sure I was misunderstanding it -- Iet's continue on a separate thread.</p>",
        "id": 270445241,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643830749
    },
    {
        "content": "<p>I agree with Lloyd in principle, and have advised IG authors about this many times. But there's a clear interpretational issue around subsumption. B1 might be subsumed by B, and therefore using B and not B1 is the intention of the author of the profile + value set, but users sometimes use concepts orthogonally, and would not regard B as an acceptable substitute at all for B1 (though it sounds unlikely in this case).</p>\n<p>I will be interested to see if there's specific answers from system vendors.</p>",
        "id": 270451430,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643833357
    },
    {
        "content": "<p>\"acceptable substitute\" isn't the question.  The question is \"does a code from the value set apply?\".  If it applies, it must be used.  If it's not an acceptable substitute, then send your code too.</p>",
        "id": 270476916,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643845224
    },
    {
        "content": "<p>Nothing stops you from conveying whatever precision you wish, but you <em>must</em> convey the level of precision in the extensible value set if you can.  Interoperability depends on being able to ask \"did they send any of the codes from the valueset?\"  and, if the answer is \"no\", being able to infer \"then the concept is definitely NOT in the space covered by the value set\".</p>",
        "id": 270477032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643845317
    },
    {
        "content": "<p>As I see it there's a couple of issues here -- if, as in the example, you have a CodeableConcept and thus the ability to send multiple codes then things are relatively simple.  What's harder (or forces more thought) is when you have an extensible binding to a code or Coding so you can only provide a single value.</p>\n<p>In terms of subsumption and the constraint \"...if any of the codes within the value set can apply to the concept being communicated\", it's pretty straightforward for the B and B1 codes here.  But, it may be that the semantic distance between B1 and B is much greater than just laterality. In this case I would expect that a subsumed code could (and perhaps should) be used on its own.  Additionally, whether the difference between B1 and B is significant or not is going to depend on context of usage; it's going to need a human to make the call.</p>",
        "id": 270503466,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1643866835
    },
    {
        "content": "<p>You <em>cannot</em> have an extensible binding for 'code'.  All code elements must have a required binding.<br>\nExtensible bindings for Coding elements would need to be used with extreme caution.  However, they're also extremely rare.  They're used for things like ElementDefinition.code or Questionnaire.item.code where multiple repetitions are essentially already translations, so the logic works the same.</p>",
        "id": 270504489,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643867905
    },
    {
        "content": "<p>Extensible pretty much <em>always</em> requires a human to make the call unless there's an explicit subsumption relationship between the transmitted code and one of the codes in the value set.</p>",
        "id": 270504513,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643867949
    },
    {
        "content": "<p>In some cases, this many not be a question for implementers of the FHIR spec.  Implementers of the FHIR spec don't always have control over what codes are available for a record.  </p>\n<p>Based on the specific data, the person making the decision about codes could be:<br>\n1) the implementer of the FHIR spec (e.g. an EHR)<br>\n2) the administrators of the EHR (e.g. the IT staff at a healthcare organization)<br>\n3) the end users entering data in the system (e.g. a nurse)</p>\n<p>Very often, when it comes to mappings codes like in your example, either end users or IT admins are the decision makers.   You could argue that the EHRs or other FHIR implementers should <em>force</em> health system administrators and end users to only be able to enter FHIR-compliant data (according to Lloyd's interpretation of extensible).  But that going to be is a non-starter (and you have the legacy data challenge that I'm sure folks are tired of me bringing up).  There might be levers out there to drive data quality improvements, but the FHIR spec is not one of those levers.</p>\n<p>In my experience, neither end users nor IT admins at health systems have the time or inclination to understand the intricacies of value set subsumption and the nuance of extensible binding strength, so the answer to your question is probably \"you'll get what you get\", and it can vary widely, even within a single implementation.</p>",
        "id": 270562461,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1643900479
    },
    {
        "content": "<p>That's a slightly different issue.  It's a problem with enforcing vocabulary constraints at all - be they required bindings or extensible bindings.  If you don't have control over the data you've got, then you can't really comply with profiles that demand that data be coded in specific ways - and the data therefore has limitations in how well decision support, search, etc. can rely on it.  </p>\n<p>If you've got an extensible binding with a specific code for hypertension, the expectation is that if you do a search using that code and you get no hits, you can safely presume that \"there are no matching records that have hypertension\".  If the system can't reliably promise that, then it can't claim to adhere to the binding.</p>\n<p>So the real challenge is \"Some systems want there to be tight control over terminology to support reliable search/decision support/etc.  However, real-world systems often have minimal control over terminology.\"  The issue isn't \"Extensible is too firm\".  The issue is \"profiles are asserting 'extensible' (for good reason), we can't meet that requirement, and we're being told we have to.</p>\n<p>It's certainly <em>possible</em> for implementers, administrators and even end users who are given a profile and need to 'extend' the value set to adhere to the rules if the rules are explained to them and they understand the ramifications of getting it wrong.  But it's exponentially harder the larger the value set and the larger the set of folks who have authority to introduce net new codes to do it 'right' - which means the reliability that search and decision support count on isn't always achievable.</p>\n<p>If regulation is saying \"thou shalt\" and the implementation community is saying \"but, practically, we can't\", then something needs to budge.  You could make it \"thou should\".  You could make it \"thou shall differentiate 'compliant' from 'non-compliant'\" and tag the data that's search/CDS-safe.  But we don't want to soften the definition for 'extensible' - because \"can we safely search/use decision support\" depends on it meaning what it means.</p>",
        "id": 270576231,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643905629
    },
    {
        "content": "<p>The IETF published an RFC-6919 (on April 1st 2018) that has the normative word for that<br>\n   The key words \"MUST (BUT WE KNOW YOU WON'T)\", \"SHOULD CONSIDER\",<br>\n   \"REALLY SHOULD NOT\", \"OUGHT TO\", \"WOULD PROBABLY\", \"MAY WISH TO\",<br>\n   \"COULD\", \"POSSIBLE\", and \"MIGHT\"<br>\n;-D</p>",
        "id": 270577170,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643905961
    },
    {
        "content": "<blockquote>\n<p>You cannot have an extensible binding for 'code'</p>\n</blockquote>\n<p>Not true. We have a few cases where we do that.</p>",
        "id": 270615409,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643921339
    },
    {
        "content": "<p>in general, though, this makes it clear that extensible bindings should only be used for workflow related categorization, or where the semantic space is fairly clean with little subsumption, or the value sets are anchored clearly in regulation and bounded by e.g. code system</p>\n<p>I know that we've had places where extensible bindings are used to set 'expectations' of correct behavior. <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> is squarely addressing these. I don't think that's appropriate. I've been meaning to define a different way to do this - I really should get to and do it. so....</p>",
        "id": 270615662,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643921480
    },
    {
        "content": "<p>Where do we have an extensible binding for code?  We have code bindings that aren't expandable value sets, but they're still fixed bindings...</p>",
        "id": 270616755,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643922016
    },
    {
        "content": "<p>see <a href=\"#narrow/stream/179202-terminology/topic/Extension.20for.20additional.20bindings\">https://chat.fhir.org/#narrow/stream/179202-terminology/topic/Extension.20for.20additional.20bindings</a> for doing something about this</p>",
        "id": 270617493,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643922312
    },
    {
        "content": "<blockquote>\n<p>Where do we have an extensible binding for code? </p>\n</blockquote>\n<p>Where the code itself contains a grammar specified by an external authority e.g. language, media type</p>",
        "id": 270617565,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643922349
    },
    {
        "content": "<p>That's still a required binding</p>",
        "id": 270618484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643922790
    },
    {
        "content": "<p>The grammar is part of the code system the value set draws from.  You can't make up your own local codes in some other code system if the code system doesn't cover what you need.</p>",
        "id": 270618617,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643922847
    },
    {
        "content": "<ul>\n<li><a href=\"http://hl7.org/fhir/resource-definitions.html#Resource.language\">http://hl7.org/fhir/resource-definitions.html#Resource.language</a> - though this has been changed from extensible to preferred</li>\n<li>also <a href=\"http://hl7.org/fhir/datatypes-definitions.html#Attachment.language\">http://hl7.org/fhir/datatypes-definitions.html#Attachment.language</a></li>\n<li><a href=\"http://hl7.org/fhir/elementdefinition-definitions.html#ElementDefinition.type.code\">http://hl7.org/fhir/elementdefinition-definitions.html#ElementDefinition.type.code</a></li>\n</ul>",
        "id": 270619264,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643923161
    },
    {
        "content": "<p>Yes, but the first two have a max value set, so that's the real binding.  type.code actually needs fixing.  I believe the intention is that there's a required binding to a union of the HL7 type code system and the \"any URI\" 'code system'.  If you send something that's not a URI and not a defined HL7 type, that's an error.  (And if we were to allow it, it would be unsafe.)</p>",
        "id": 270619730,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643923394
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> said:</p>\n<blockquote>\n<p>I know that we've had places where extensible bindings are used to set 'expectations' of correct behavior. @Cooper Thompson is squarely addressing these. I don't think that's appropriate. I've been meaning to define a different way to do this - I really should get to and do it. so....</p>\n</blockquote>\n<p>If by this you mean we need another binding type, I think I agree. We could then work to limit the existing extensible bindings to those that actually work the way we want - very few should remain. Meaning the rest are something else. Perhaps a binding that combines a small required set and either a max, or a preferred?</p>",
        "id": 271006202,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644252168
    },
    {
        "content": "<p>This wouldn't be a new binding type.  This would be supplemental extensions that define other things.  <br>\nI disagree that very few extensible binding would remain.  They'll exist in spades for IGs focused on decision support and reasoning where you're defining the rules for \"what data can this logic be used against?\"  You <em>won't</em> see extensible bindings in specs defining expectations for real systems that don't have control over their own codes.</p>",
        "id": 271020594,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644258048
    },
    {
        "content": "<p>it will reduce the number of extensible bindings but it probably won't be very few</p>",
        "id": 271024700,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644259854
    },
    {
        "content": "<p>This is a brief reminder to those who still wish to respond that the survey closes in just under 1 week ( <time datetime=\"2022-02-16T20:00:00Z\">2022-02-17T06:00:00+10:00</time> ).</p>",
        "id": 271363332,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1644449305
    },
    {
        "content": "<p>What is the objective of the survey <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span>?  The definition of 'extensible' is normative and can't be changed.</p>",
        "id": 271366188,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644451134
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Vocabulary.20WG.20survey.20on.20FHIR.20extensible.20binding.20strength/near/271366188\">said</a>:</p>\n<blockquote>\n<p>What is the objective of the survey <span class=\"user-mention silent\" data-user-id=\"191333\">Reuben Daniels</span>?  The definition of 'extensible' is normative and can't be changed.</p>\n</blockquote>\n<p>Thanks for the question Lloyd. The objective is not to change the definition. Two of the objectives are:</p>\n<ol>\n<li>\n<p>To get an idea of how the community of implementers have interpreted the definition and have implemented extensible bindings.</p>\n</li>\n<li>\n<p>Based on 1, and if necessary (and I suggest that it might be) and helpful, propose additional text and examples for inclusion in the specification to clarify the definition and correct usage.</p>\n</li>\n</ol>",
        "id": 271370226,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1644453237
    },
    {
        "content": "<p>This is my last reminder for anyone still wishing to provide a response or comment on this survey. The deadline is:  <time datetime=\"2022-02-16T20:00:00Z\">2022-02-17T06:00:00+10:00</time> . Thank you.</p>",
        "id": 272113649,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1645017353
    }
]