[
    {
        "content": "<p>The next block vote for vocab can be found here:  <a href=\"https://jira.hl7.org/issues/?filter=16545\">https://jira.hl7.org/issues/?filter=16545</a></p>\n<p>This will be voted on the Jan 31, 2022 Vocab Tracker Call, 5 pm ET. <br>\n<span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> <span class=\"user-mention\" data-user-id=\"191406\">@Russell McDonell</span></p>",
        "id": 269186979,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1643066407
    },
    {
        "content": "<p>Please note that the proposed resolution has been entered in the comment field. In some cases the ticket has been updated as Resolved Change Required, however Vocab is proposing that be changed.</p>",
        "id": 269187038,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1643066457
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 269187853,
        "sender_full_name": "Michael Thuo",
        "timestamp": 1643067083
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span> Several of these have no resolution specified in the resolution column.  And the proposed resolution needs to appear in the resolution description column.  Sending people to wade through comments is unreasonable.  Please update the tracker items to have resolutions and resolution descriptions, then re-post here.</p>",
        "id": 269193314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643071239
    },
    {
        "content": "<p>I'd like <a href=\"http://jira.hl7.org/browse/FHIR-9047\">J#9047</a> and <a href=\"http://jira.hl7.org/browse/FHIR-11449\">J#11449</a> pulled for discussion. I'm uncomfortable with sitting on tickets for <em>5 years</em> then rejecting them in a block vote, and telling the submitter to go file a new ticket  if they want anything done. I don't know that the decision to reject is wrong, but if we're going to tell submitters that, after all that time, we don't care about their tickets, the least we can do is vote on it individually.</p>",
        "id": 269203883,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643080172
    },
    {
        "content": "<p>I'm confused.  The resolution for vote on 9047 says \"persuasive\".  Anyone reviewing the block vote would expect that was the resolution.  Listing a resolution in the comment is NOT acceptable.</p>",
        "id": 269204226,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643080447
    },
    {
        "content": "<p>I created a query for the tickets - some of the tickets were at some point updated to be \"resolved change required\" but unfortunately a change was not applied, and things have changed. Not sure <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> what you mean by the \"resolution column\". The notes for the proposed resolution are in the comment field. Sometimes we cannot change the ticket status without a vote. <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  I hear you - we can vote individually if that is what most people would like.</p>",
        "id": 269310602,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1643139004
    },
    {
        "content": "<p>You can propose a resolution without a vote.  Which is what you should do if you're proposing a resolution.  The resolution and resolution description reflect what is being voted on by the block vote.</p>",
        "id": 269311891,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643139539
    },
    {
        "content": "<p>The fact process has changed isn't, itself, a reason to reject an issue.  You can transfer the issue to a different group.  You can find it not persuasive because the point is now moot.  But you can't reject and say \"resubmit if you still care\".</p>",
        "id": 269311984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643139597
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192130\">Carmela Couderc</span> <a href=\"#narrow/stream/179166-implementers/topic/Vocab.20Block.20Vote/near/269310602\">said</a>:</p>\n<blockquote>\n<p>we can vote individually if that is what most people would like.</p>\n</blockquote>\n<p>Isn't asking for it to be pulled from the block sufficient? Do we need a vote on whether we need a vote?</p>",
        "id": 269312346,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643139749
    },
    {
        "content": "<p>There are two issues with the current proposed block vote:</p>\n<ol>\n<li>The content hasn't been updated to specify the proposed resolution.  This must be done in Jira before a block vote can proceed.  Putting proposed resolutions in comments isn't acceptable.</li>\n<li>Voting to reject issues simply because they've been around a long time and processes have evolved isn't kosher.  Appropriate options are: decide the change isn't necessary and put in a resolution rejecting it, transfer the issue to whoever is now responsible for handling it, or resolve to make the change using whatever the new process is</li>\n</ol>",
        "id": 269318021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643142022
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span> Just seeking a confirmation that you're going to correct the Jira issues and re-send out the block vote notification.</p>",
        "id": 269597325,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643300584
    },
    {
        "content": "<p>Actually there's a 3rd issue.  The majority of the issues are already resolved - so there's nothing to vote on...</p>",
        "id": 269659534,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643327502
    },
    {
        "content": "<p>Thanks for your attention <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   We need to vote to reopen tickets and change the resolution. The specific information has been documented in each ticket. Vocab will vote on each individually to get these tickets off our list.</p>",
        "id": 270031662,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1643636268
    },
    {
        "content": "<p>If you're wanting to re-open and then re-vote, those are two separate steps.  You can't block vote to do both.  As well, it's not appropriate to reject an issue because process has changed.</p>",
        "id": 270048698,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643642776
    },
    {
        "content": "<p>I agree with Lloyd</p>",
        "id": 270071557,
        "sender_full_name": "Eric Haas",
        "timestamp": 1643650554
    }
]