[
    {
        "content": "<p>From what I understand, the ONC rule does not require actors to use certified IT.  How will non certified healthcare IT fit into the future in regard to the ONC rule. Will there be EMR’s not certified that will remain in regulation that can bypass the requirement to establish FHIR based API’s ?</p>",
        "id": 228420529,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1614696129
    },
    {
        "content": "<p>I believe there are incentive programs coming down the pipes that will provide financial incentives (via Medicare payments I think) for health systems to use certified EHRs.  However, if there are clinics that only provide care to self-pay patients (for example), those clinics might continue to use non-certified EHRs.</p>\n<p>In the MU3 era, which also had incentive payments for using certified EHRs, we saw many pediatric hospitals prioritize their other projects over FHIR, since they didn't have a sufficient Medicare patient population to really be impacted by the  Medicare incentive payments.</p>\n<p>So on its own, the ONC rule doesn't really do anything to drive adoption of certified HIT.  However, HHS overall does have levers to drive that adoption, and I expect we'll see those levers being pulled :).</p>",
        "id": 228421569,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614696510
    },
    {
        "content": "<p>Excellent info, thanks for clarifying this.</p>",
        "id": 228421913,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1614696652
    },
    {
        "content": "<p>The more certified IT the better</p>",
        "id": 228422024,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1614696698
    },
    {
        "content": "<p>Essentially if you are a provider and bill CMS over the volume limits, you either need to use certified EHR or be in one of the exceptions here<br>\n<a href=\"https://qpp.cms.gov/mips/special-statuses\">https://qpp.cms.gov/mips/special-statuses</a></p>",
        "id": 228724410,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1614839473
    }
]