[
    {
        "content": "<p>I am exploring the ways to return additional resources in a search result bundle when parameter '_include' is used in the search query.</p>\n<p>HAPI documentation states the below---</p>\n<hr>\n<p>FHIR allows clients to request that specific linked resources be included as contained resources, which means that they will be \"embedded\" in a special container called \"contained\" within the parent resource.</p>\n<hr>\n<p>Also in the documentation on resource references its mentioned as below---</p>\n<hr>\n<p>Handling Includes (_include) in a Bundle<br>\nYour server code may also wish to add additional resource to a bundle being returned (e.g. because of an _include directive in the client's request).</p>\n<hr>\n<p>Want to know if returning the additional resources as \"contained\" resources to searched parent resource is correct way to do.</p>",
        "id": 221736237,
        "sender_full_name": "Vijay Chandra",
        "timestamp": 1609912239
    },
    {
        "content": "<p>it's certainly not something described in the specification, and our strong recommendation is that you should never use contained resources unless you have no choice</p>",
        "id": 221738201,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609914928
    },
    {
        "content": "<p>If 'contained' is used, it's used because the data source doesn't treat the resource as stand-alone.  I.e. it's never independently retrievable and is always provided only within that specific containing resource.  There's also an expectation (though not a requirement) that the data consumer will store the data the same way.  Contained is <em>not</em> a handy packaging mechanism for transport.  If your objective is to package multiple resources as part of a single mechanism, the solution is Bundle.</p>",
        "id": 221786966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609949928
    },
    {
        "content": "<p>I think the main point here is that the following is incorrect:</p>\n<blockquote>\n<p>FHIR allows clients to request that specific linked resources be included as contained resources, which means that they will be \"embedded\" in a special container called \"contained\" within the parent resource.</p>\n</blockquote>\n<p>And by incorrect, I mean that a compliant FHIR server <strong>shall not</strong> allow \"clients to request that specific linked resources be included as contained resources\". My guess is that the above is left-over from a much earlier version of HAPI...</p>",
        "id": 221806247,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1609959006
    },
    {
        "content": "<p>I don't know that it's strictly non-compliant, but it's certainly extremely bad practice.</p>",
        "id": 221851580,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609988180
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> ?</p>",
        "id": 221851585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609988187
    },
    {
        "content": "<p>That documentation is definitely incorrect. Looks like a copy and paste mistake, or possibly just something carried over from an earlier time as Vassil suggests.</p>\n<p><span class=\"user-mention\" data-user-id=\"376538\">@Vijay Chandra</span> HAPI's <code>_include</code> functionality works as the FHIR spec describes - it allows additional resources to be included in the returned bundle if the search target links to them, and has nothing to do with what FHIR calls \"contained resources\".</p>",
        "id": 221945547,
        "sender_full_name": "James Agnew",
        "timestamp": 1610028764
    },
    {
        "content": "<p>Thanks all for the responses and clarifying the point.  Thanks, Vijay</p>",
        "id": 222063538,
        "sender_full_name": "Vijay Chandra",
        "timestamp": 1610106684
    }
]