[
    {
        "content": "<p>I am looking at developing a machine readable standard for recording wearable device data for health care in a useable form. I figure I am not the first and wondered if anyone in the FHIR community were aware of any efforts in this direction? It seems that the use of this type of data in healthcare provision will be increasing and thought it would be good to get ahead of the game a little.</p>",
        "id": 168863111,
        "sender_full_name": "Sheldon Hall",
        "timestamp": 1561392909
    },
    {
        "content": "<p>Are you looking for a specific wearable device type with a specific type of data (e.g. heart rate , temperature...)? AFAIK we do support \"wearable device data\" because it does not matter whether the device is wearable or not as long as it gives a heart rate.<br>\nOr something else? Any specific requirements?</p>",
        "id": 168864281,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561394068
    },
    {
        "content": "<p>I know of  FHIR, <a href=\"http://www.openmhealth.org/\" target=\"_blank\" title=\"http://www.openmhealth.org/\">Open mHealth</a> and Continua/IEEE standard 137</p>",
        "id": 168867692,
        "sender_full_name": "Eric Haas",
        "timestamp": 1561397033
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  Right now I am just scoping out what is there. I am looking for a device agnostic representation (if possible) which I guessed could be created by combining FHIR resources. The main reason is to share healthcare data for research. For that reason I was thinking about whether the device definition should include maybe some kind of uncertainty and register the types of vital signs they can log. Further, whether there should be a way to encode the raw data and if heart rates from different devices could be used seamlessly or whether there are practical reasons this is not a good idea.</p>",
        "id": 168872502,
        "sender_full_name": "Sheldon Hall",
        "timestamp": 1561400397
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> thanks I will check them out</p>",
        "id": 168872559,
        "sender_full_name": "Sheldon Hall",
        "timestamp": 1561400409
    },
    {
        "content": "<blockquote>\n<p>whether the device definition should include maybe some kind of uncertainty and register the types of vital signs they can log. </p>\n</blockquote>\n<p>I read this as \"a catalog of DeviceDefinitions and the corresponding ObservationDefinitions\". Could be.</p>",
        "id": 168874729,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561401875
    },
    {
        "content": "<p>\"the raw data\" sounds like observation.value. Not sure what you mean by encoding. perhaps a higher-level encoding..?</p>",
        "id": 168874811,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561401943
    },
    {
        "content": "<p>Yes re-use of existing fields will cover a lot of use cases I suspect. Next I will probably aim to approach some vendors and users of the data to see if the fields provided cover everything they need. Thanks for the interest.</p>",
        "id": 168884205,
        "sender_full_name": "Sheldon Hall",
        "timestamp": 1561409526
    }
]