[
    {
        "content": "<p>From: Olga Vovk &lt;<a href=\"mailto:ovovk@samvit-solutions.com\">ovovk@samvit-solutions.com</a>&gt;<br>\nDear all,<br>\nI have a research use case, where I need to be able to somehow connect the answers provided to a certain Questionnaire to the FHIR resource.<br>\nFor example,<br>\nI have questionnaire which asks questions related to the imaging study which done to the patient.<br>\nThe questions like:</p>\n<p>*   Is the participant eligible for inclusion on this study? – Yes, No<br>\n  *   Was imaging agent administered? – Yes, No<br>\n  *   Was imaging completed? – Yes, No</p>\n<p>All the above questions are part of a certain research questionnaire, and I need to connect the answers collected in the corresponding QuestionnaireResponse to<br>\nthe related ImagingStudy resource.</p>\n<p>I already asked a similar question in “ImagingStudy related questions” thread, and I am very grateful to Lloyd and Elliot for answering and providing a very valuable advice.<br>\nI did my research on FHIR Questionnaire and QuestionnaireResponse resources and I was thinking a lot, but I still have no idea what would be the best way to do it ☹</p>\n<p>Thank you!!!</p>\n<p>Olga Vovk<br>\n&lt;:3)))~~~~</p>",
        "id": 248982923,
        "sender_full_name": "Email Gateway",
        "timestamp": 1628604159
    },
    {
        "content": "<p>The simplest way is to have a question in your Questionnaire whose answer is a Reference to the ImagingStudy.  Without a user actually picking the study from a user interface, I can't imagine how else you'd figure out the linkage.  The SDC IG has a number of extensions that allow you to filter what types of References are allowed for a particular answer.</p>",
        "id": 248991997,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628608101
    },
    {
        "content": "<p>HI Lloyd, thank you very much.<br>\nHaving a question in the Questionnaire   which answer is a Reference to the ImagingStudy or any other resource  is a very good idea. Thank you!<br>\nOlga</p>",
        "id": 249020257,
        "sender_full_name": "Olga Vovk",
        "timestamp": 1628621654
    }
]