[
    {
        "content": "<p>A Patient resource has the following in Patient.identifier:</p>\n<p>{<br>\n  \"type\": {<br>\n    \"coding\": [<br>\n      {<br>\n        \"system\": \"<a href=\"http://hl7.org/fhir/v2/0203\">http://hl7.org/fhir/v2/0203</a>\",<br>\n        \"code\": \"MR\"<br>\n    }<br>\n    ],<br>\n    \"text\": \"MRN\"<br>\n  },<br>\n  \"value\": \"1111111\",<br>\n  \"assigner\": {<br>\n    \"reference\": \"Organization/2a\",<br>\n    \"display\": \"HUISARTS\"<br>\n  }<br>\n}</p>\n<p>Should the referenced Organization be included in a Patient/&lt;id&gt;/$everything request?<br>\nBased on everything that's in the specifications of FHIR, I would think the only referenced resources that are needed to support the medical records should be retrieved. (which a assigners organization really isn't).</p>\n<p>Is there anywhere other than <a href=\"https://www.hl7.org/fhir/patient-operation-everything.html\">https://www.hl7.org/fhir/patient-operation-everything.html</a> where more is described about what should be retrieved? Because it's pretty ambiguous in my opinion, very much subject to interpretation.</p>",
        "id": 229489533,
        "sender_full_name": "Marc Sandberg",
        "timestamp": 1615301849
    },
    {
        "content": "<p>It is ambiguous by design.  $everything invoked against a horse or in India or in a Chiropractic system may all look somewhat different.  Implementation guides (e.g. US-Core) can set tighter expectations.</p>",
        "id": 229493219,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615303231
    },
    {
        "content": "<p>From our practice of using $everything, I can say that I expect a bundle that includes all resources pointing to the patient <strong>and</strong> all references resolved. This would include assigning organizations. The idea is that the bundle can completely stand for itself, i. e. it includes all necessary information so that no further access to the data source (FHIR server) is required. Whether that is what the FHIR standards intends – I don't know – but that is how we use it.</p>",
        "id": 229498760,
        "sender_full_name": "Marcus Wurlitzer",
        "timestamp": 1615305395
    }
]