[
    {
        "content": "<p>When sending a ServiceRequest to a target, what is the best way for the sender to tell the receiver where (what endpoint) to send updates to, such as an appointment has been added? <br>\n(assume that the sender is not registered with the receiving system, but is trusted by the receiving system).</p>\n<p>My top thoughts so far are:<br>\n1) create an extension called .updatesEndpoint in the ServiceRequest where the sender specifies what endpoints the receiver should send updates to<br>\n2) create an extension called .updatesSubscription in the ServiceRequest where the sender specifies endpoints via subscriptions to the ServiceRequest to send updates to.<br>\n3) &amp; 4), same as 1) and 2) but using ServiceRequest.supportingInfo instead of an extension to hold the data.</p>\n<p>Which might be best and are there other approaches i'm not aware of?</p>",
        "id": 153978361,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1532617875
    },
    {
        "content": "<p>have you checked this page out?  <a href=\"http://build.fhir.org/workflow-communications.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow-communications.html\">http://build.fhir.org/workflow-communications.html</a></p>",
        "id": 153978362,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532618654
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>, this page is really good. However, it seems to assume that the sending  and receiving systems have pre-negotiated their technical endpoints to send information back and forth. I'm trying to figure out how to specify at the point of sending the ReferralRequest, where later updates should be sent to.</p>",
        "id": 153978368,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1532619551
    },
    {
        "content": "<p>I think our default assumption is that updates go to the same location as the original request.  The second most likely is that the systems are explicitly configured with where to send updates after the initial request.  Having that change dynamicly would probably be best handled as an extension</p>",
        "id": 153978428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532630049
    },
    {
        "content": "<p>In the Australian context we lookup the organizations endpoint of the appropriate type a the time of wanting to send the followup data.<br>\nSo if it changes, messages still go through.<br>\n(the messaging part however isn't done in FHIR, nor is the content, just the directory part is now FHIR)</p>",
        "id": 153978480,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1532640527
    },
    {
        "content": "<p>Interesting <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> by \"endpoint of the appropriate type\" you might have different endpoints at an organization for say ... referral updates, lab results, messages etc...? And for the organization, I presume it's the organization of the requester in the serviceRequest you would look up?</p>",
        "id": 153978654,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1532694601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> I suggest you look at FHIR messaging, it's designed to deal with routing through intermediates.</p>",
        "id": 203891870,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1594762791
    }
]