[
    {
        "content": "<p>I'm trying to figure out where to expose benefit information that relates to a specific Coverage, e.g. specifically where to say \"this policy includes coverage for medical benefits from X to Y date, and vision benefits from Z to Q dates. Benefit information seems to be exposed on both the ExplanationOfBenefits and EligibilityResponse. If <a href=\"https://www.hl7.org/fhir/eligibilityresponse-definitions.html#EligibilityResponse.insurance.benefitBalance\" target=\"_blank\" title=\"https://www.hl7.org/fhir/eligibilityresponse-definitions.html#EligibilityResponse.insurance.benefitBalance\">https://www.hl7.org/fhir/eligibilityresponse-definitions.html#EligibilityResponse.insurance.benefitBalance</a> also included a period that would look like a good fit. Am I heading in the right direction here?</p>",
        "id": 153930676,
        "sender_full_name": "David Teirney",
        "timestamp": 1516873520
    },
    {
        "content": "<p>Actually, just noticed that EligibilityReponse doesn't contain a patient reference. Seems I'm not really all that clear yet on how parts of this Financial section are supposed to work with each other. For some HEDIS measure calculations that we're working on, we need benefit information for the coverage for a member to determine if they are part of the eligible population. If the <a href=\"https://www.hl7.org/fhir/eligibilityresponse-definitions.html#EligibilityResponse.insurance.benefitBalance\" target=\"_blank\" title=\"https://www.hl7.org/fhir/eligibilityresponse-definitions.html#EligibilityResponse.insurance.benefitBalance\">https://www.hl7.org/fhir/eligibilityresponse-definitions.html#EligibilityResponse.insurance.benefitBalance</a> data model was hung directly off Coverage that looks like it would fit better with the domain model we are currently working with.</p>",
        "id": 153930677,
        "sender_full_name": "David Teirney",
        "timestamp": 1516874148
    },
    {
        "content": "<p>There's a bit of a challenge with a few of the financial \"Response\" resources not being fully stand-alone and interpretable without sending along a copy of the request (or for use-cases where an eligibility determination might have been triggered by something other than a request).  Feel free to submit a change request using the \"propose a change\" link.  <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>, what's the mechanism to allow exposure to downstream clinicians exactly what's covered by a patient's coverage?</p>",
        "id": 153930698,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516891164
    }
]