[
    {
        "content": "<p>I've been trying to understand the mechanisms with which one could build FHIR implementations that are aware of FHIR resources and types. </p>\n<p>Structure definitions look like a good way of defining FHIR and the documentation itself says : \"Note that as part of the specification itself, a full set of structure definitions for all resources and data types is published.\". </p>\n<p>However, it is not clear to me which particular download in the download page corresponds to the structure definitions mentioned above. Looking into available files, I ended up with profile xml files but there are also validation and code generation schemas on the same page. Moreover, different schemas appear to follow different approaches: the code generation schema defines the Observation.Component type I was asking here a few days back, but another artefact (forgot which one) defines that type as BackboneElement. </p>\n<p>Hapi's FHIR implementation seems to use an Excel sheet (could not find that one) to generate models as far as I can understand from the message archives of that group.</p>\n<p>So what should I use if I want to process the FHIR metadata, that is, types, resources, their structure, constraints etc. Is this metadata distributed across different artefacts for different purposes? As you can see, I'm spectacularly confused, so some guidance would be great. </p>",
        "id": 153824548,
        "sender_full_name": "Seref Arikan",
        "timestamp": 1462383830
    },
    {
        "content": "<p>Right now, I'm using</p>\n<ul>\n<li>extension-definitions.json</li>\n<li>profiles-others.json</li>\n<li>profiles-resources.json</li>\n<li>profiles-types.json</li>\n<li>search-parameters.json</li>\n<li>expansions.json</li>\n<li>v2-tables.json</li>\n<li>v3-codesystems.json</li>\n<li>valuesets.json</li>\n</ul>\n<p>Plus the schema files. All of this is available once you run the <code>publish.bat</code> or <code>publish.sh</code> in the build. Not sure where it can be downloaded from.</p>",
        "id": 153824555,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1462384386
    },
    {
        "content": "<p>I use most of the same files listed by Jason, except the .xml versions.  I would not recommend building, instead download from here: <a href=\"http://hl7.org/fhir/downloads.html\" target=\"_blank\" title=\"http://hl7.org/fhir/downloads.html\">http://hl7.org/fhir/downloads.html</a>  Get the FHIR Definitions download from first group, either JSON or XML, with or without text, depending on your needs.</p>",
        "id": 153824557,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1462384948
    },
    {
        "content": "<p>the file validation.xml.zip (or the json equivalent) has the master files</p>",
        "id": 153824564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462387130
    },
    {
        "content": "<p>HAPI latest code is generated by the build process from internal unpublished material. At some stage I'll be updating it to also use validation.xml.zip</p>",
        "id": 153824565,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462387183
    },
    {
        "content": "<p>validation.xml.zip is the file Dave referred to, the FHIR definitions download</p>",
        "id": 153824566,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462387211
    },
    {
        "content": "<p>thanks. validation.xml.zip it is then.</p>",
        "id": 153824609,
        "sender_full_name": "Seref Arikan",
        "timestamp": 1462429479
    },
    {
        "content": "<p>Grahame: could you possibly comment on the intended use for files or groups of files in the FHIR downloads, from an implementer perspective? This information appears to be distributed across the whole FHIR documentation and I'm having difficulty putting the pieces together. Even a brief wiki page would be a great help. </p>\n<p>I can think of uses for the files when I look at them, but I'm never sure, so I don't know if I'm supposed to stitch together information from multiple files or use a specific one. </p>\n<p>I am coming from an \"engine designer/implementer\" perspective, with scenarios similar to what Hapi does for FHIR and well beyond, mostly drawing on my PhD work at UCL. I realize you're probably very short on time and my kind of interest may not be what FHIR is focusing on at the moment but a little effort into it could open a  lot of doors. </p>\n<p>I'd be more than happy to write down what I'm looking for if that helps?</p>",
        "id": 153824612,
        "sender_full_name": "Seref Arikan",
        "timestamp": 1462435362
    },
    {
        "content": "<p>well... we always want the documentation to be clear, but we also have to bridge the gap between lots of different perspectives and a single document - sometimes, adding more narrative isn't the solution, since most people have an upper limit (tl;dr)</p>",
        "id": 153824613,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462445740
    },
    {
        "content": "<p>I look at the downloads page and think that it seems self-explanatory to me, but otoh I live and breath this</p>",
        "id": 153824614,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462445858
    },
    {
        "content": "<p>so perhaps you could write it down</p>",
        "id": 153824615,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462445867
    },
    {
        "content": "<p>thanks, will do</p>",
        "id": 153824660,
        "sender_full_name": "Seref Arikan",
        "timestamp": 1462460826
    }
]