[
    {
        "content": "<p>Hi, I'm new to FHIR and I had a two part question about the proper use of certain resource types.  We are creating a directory application to search for practitioners, speciality groups and physical sites.   These physical sites are important as they may have specialized equipment.  </p>\n<p>1.  In FHIR, practitioners would use the practitioner resource, specialty groups will use the organization resource, but for the physical site... can I use the healthservices resources or should I extend the organization resource, or use the location resource?   While multiple practitioners can belong to a speciality group, they may also belong to multiple sites.  We want to be able to search by \"physical site\" which may have more than one organization/speciality group.  </p>\n<p>2. How does one link these resources together?  For example, a Practitioner can belong to one or more organizations and sites. In the practitioner resource, I can use the reference methods to link to array of organizations and healthcareservices, etc.</p>\n<p>thanks!</p>",
        "id": 153875756,
        "sender_full_name": "ken masters",
        "timestamp": 1489070677
    },
    {
        "content": "<p>Welcome to FHIR :-)<br>\nRegarding your questions:<br>\n1) Location vs. Organization depends on what exactly \"physical site\" means in your case. But since you want to assign the practitioners to both specialty groups as well as physical sites, I'd suggest to use the Organization resource for physical site, eventually binding one or more locations to that organization if necessary.<br>\n2) a practitioner in an organization is represented by PractitionerRole, one PractitionerRole for each reference. A location within an organization is Location.managingOrganization.</p>",
        "id": 153875758,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489071308
    },
    {
        "content": "<p>For clarification: I'm talking STU3 ( <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">http://build.fhir.org</a> ) which will reach release status by the end of the month</p>",
        "id": 153875759,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489071529
    },
    {
        "content": "<p>Ken, You might want to check with Argonaut and IHE. Both are collaborating on an Implementation Guide for just such things. Argonaut has a working model, IHE will be making that international and providing Profiling governance.</p>",
        "id": 153875764,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489073599
    },
    {
        "content": "<p>Thank you for responses and guidance.  I took a quick look at Argonaut and IHE and I think there is a gap in the use case...  the directory that we are building is for telemedicine.  Practitioners may offer some telemedicine services some may not.  Sites may offer telemedicine services some may not.   Would correlating the type of services offered be a good use of the \"healthcareService\" resource?  or would this be an example where custom extensions can be used.   Thank you.</p>",
        "id": 153875836,
        "sender_full_name": "ken masters",
        "timestamp": 1489087895
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193528\">@ken masters</span>, this seems very much aligned with the IHE ITI work item to profile care services and provider directories in FHIR. I suggest that you <a href=\"http://groups.google.com/group/ititech\" target=\"_blank\" title=\"http://groups.google.com/group/ititech\">join</a> the ITI technical committee mailing list to raise the issue, or contact <span class=\"user-mention\" data-user-id=\"193299\">@Luke Duncan</span>. </p>",
        "id": 153875837,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1489088715
    },
    {
        "content": "<p>Thanks I've put in the request to join. </p>",
        "id": 153875838,
        "sender_full_name": "ken masters",
        "timestamp": 1489089050
    }
]