[
    {
        "content": "<p>This question has come up a few times on the Da Vinci Risk Adjustment Workgroup and I wanted to reach out to the community for advice.  Condition Category is a grouping used in Risk Adjustment.  The most commonly used among Condition Categories is CMS's HCC (Hierarchical Condition Codes) (More details here <a href=\"https://www.cms.gov/medicare/health-plans/medicareadvtgspecratestats/risk-adjustors\">https://www.cms.gov/medicare/health-plans/medicareadvtgspecratestats/risk-adjustors</a>)</p>\n<p>Conceptually these codes are used so insurers and providers can be more appropriately reimbursed for patient's with conditions that require a higher level of care.  In HCC, the predominant measure that puts them in an HCC code is an ICD10 Diagnosis Code.  </p>\n<p>It would be useful for the code(s) that apply to a specific patient to be represented in a way that they could be shared between payers and/or providers.</p>\n<p>Does it belong in Condition?  Is there another more appropriate Resource for this type of information? <br>\n<span class=\"user-mention\" data-user-id=\"217210\">@Rob Reynolds</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"192119\">@Yan Heras</span></p>",
        "id": 257765661,
        "sender_full_name": "Linda",
        "timestamp": 1634332312
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 257773080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634335991
    },
    {
        "content": "<p>Any suggestions?  We had a long discussion Friday on CQI and it was suggested I post here.</p>",
        "id": 258081287,
        "sender_full_name": "Linda",
        "timestamp": 1634583584
    },
    {
        "content": "<p>We had a long discussion on CQI last Friday and it was suggested I post here for input.</p>",
        "id": 258081539,
        "sender_full_name": "Linda",
        "timestamp": 1634583653
    },
    {
        "content": "<p>There could certainly be a 'category' on the Condition to allow it to be disambiguated.  Key question is \"do clinicians want to see this alongside other Conditions?\"</p>",
        "id": 258095780,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634589367
    },
    {
        "content": "<p>Lloyd - I like the thought here.  I worry if we make it an additional resource/Condition Resource it will cause the issue you mentioned.  If we could make it an additional Category for classification or use when it is needed, this makes sense to me.  <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  - you seemed concerned with that approach but we didn't explore further.  Thoughts?</p>",
        "id": 258207889,
        "sender_full_name": "Linda",
        "timestamp": 1634654920
    },
    {
        "content": "<p>Is it always the case that the HCC can be applied to an existing Condition? Or would modeling it as a category sometimes force the creation of a Condition just to carry the category? Maybe that's appropriate, as in suspected condition or something like that?</p>",
        "id": 258235388,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1634663631
    },
    {
        "content": "<p>From a patient perspective, they would always have the Condition that could be \"Categorized\" as a specific HCC.  </p>\n<p>In our MeasureReport (RA Gaps) process, we might be \"suspecting\" a condition and not have that resource on file.  Simplistic example, the payer has an A1C of 9.2.  They may \"suspect\" an HCC for Diabetes (HCC code) but don't yet have a Condition/Diagnosis on file.  Did that help?</p>",
        "id": 258250710,
        "sender_full_name": "Linda",
        "timestamp": 1634668995
    },
    {
        "content": "<p>I think that is why in <a href=\"http://MeasureReport.group\">MeasureReport.group</a>, we will continue to use the .code to show the Condition Category Code, i.e. not point to a Condition Resource.</p>",
        "id": 258250908,
        "sender_full_name": "Linda",
        "timestamp": 1634669070
    },
    {
        "content": "<p>My concern is that the condition resource can only describe one \"condition\" of the patient, yet an HCC is the summary categorization of likely multiple conditions. So how do you intend to properly enter an HCC into a single condition instance? And is it possible that a single condition would be used to justify multiple HCC categories? <span class=\"user-mention\" data-user-id=\"191924\">@Linda</span></p>",
        "id": 258565567,
        "sender_full_name": "Robert McClure",
        "timestamp": 1634829768
    },
    {
        "content": "<p>My understanding is that a single ICD10 maps to a single Condition Category Code like HCC.  One Condition Category (HCC) maps to multiple conditions or can.  And I have not seen requirements like you must have Condition A and Condition B to be in Condition Category xyz.</p>",
        "id": 258571519,
        "sender_full_name": "Linda",
        "timestamp": 1634831985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191924\">@Linda</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> No. An ICD code can map to more than one HCC in the same model. For example, in the Initial Run for Medicare Advantage Payment Year 2022, ICD code E11.42 maps to HCC 18 <em>and</em> HCC 75 in the CMS-HCC V21 model, HCC 18 in the CMS-HCC V22 model, HCC 18 in the CMS-HCC V24 model, and RxHCC 30 in the CMS-RxHCC V05 model.</p>",
        "id": 258596809,
        "sender_full_name": "Brent Zenobia",
        "timestamp": 1634841669
    },
    {
        "content": "<p>I can add this to the HL7 Patient Care FHIR agenda this afternoon for Patient Care input.</p>\n<p>From an implementer perspective, though, we haven't treated the HCC data as a Condition for a few reasons:</p>\n<ul>\n<li>the hierarchical categorization of a patient can be based on more than just ICD-10 conditions (e.g. age, gender)</li>\n<li>some attributes of the HCC don't align with conditions (like data year, did the HCC get paid or not)</li>\n<li>While we don't support showing HCC on its own within a condition list, we do support showing HCC information (as a descriptive attribute) for a condition entry</li>\n<li>there are many \"grouper\" methods - so it does warrant more discussion on how best to represent \"groupers\" using FHIR (e.g. HHS-HCC risk model does include medication-based groupers/categories that are used for risk adjustment, CMS RxHCC model that uses diagnosis-based groupers to help cover the cost of medications for MCR Part D plans, AHRQ/HCUP’s Clinical Classification Software Refined (CCSR) )</li>\n</ul>\n<p>FWIW, I did find an older Zulip discussion on this topic:  <a href=\"#narrow/stream/implementers/topic/Recording.20CMS.20HCC.20Data\">https://chat.fhir.org/#narrow/stream/implementers/topic/Recording.20CMS.20HCC.20Data</a></p>",
        "id": 258596843,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1634841690
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191924\">@Linda</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> There are risk adjustment models that are mutually exclusive and collectively exhaustive - DxCG is one of them - but the Medicare Advantage models are not. I haven't checked the Commercial or Medicaid risk adjustment models but they probably aren't either. It gets even wonkier once you start including the hierarchies.</p>",
        "id": 258597281,
        "sender_full_name": "Brent Zenobia",
        "timestamp": 1634841871
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/-5z1dO_znyOZ7wUJxMtkVI5N/hierarchy-vs-category.PNG\">hierarchy-vs-category.PNG</a> <br>\nDoes this help?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/-5z1dO_znyOZ7wUJxMtkVI5N/hierarchy-vs-category.PNG\" title=\"hierarchy-vs-category.PNG\"><img src=\"/user_uploads/10155/-5z1dO_znyOZ7wUJxMtkVI5N/hierarchy-vs-category.PNG\"></a></div>",
        "id": 258598481,
        "sender_full_name": "Brent Zenobia",
        "timestamp": 1634842453
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  ThanQ - Yan will be reaching out to get this topic on your agenda.  The work we have done in Risk Adjustment might fulfill this need with perhaps some additional work.  We welcome Patient's Care input and perspective.</p>",
        "id": 258615529,
        "sender_full_name": "Linda",
        "timestamp": 1634849614
    },
    {
        "content": "<p>We ran out of time today, but will have it first on the agenda next Thurs, Oct 28 at 5pm Eastern.<br>\n<a href=\"https://zoom.us/j/5328571160\">https://zoom.us/j/5328571160</a></p>",
        "id": 258628077,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1634855688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> and <span class=\"user-mention\" data-user-id=\"191924\">@Linda</span>  : I just wanted to throw a couple thoughts here -- I'll plan on hopping on the upcoming Patient Care and Risk Adjustment calls.</p>\n<p>My organization also needs to document HCC codes for Medicare Direct Contracting. One of the most interesting things is that we have to redocument every year -- in effect the patient's status basically \"resets\" and you have to document appropriately each year to qualify for risk adjustment.</p>\n<p>Couple thoughts I have -- would be curious what others think:</p>\n<p>1) Perhaps HCC's are a claims item -- maybe they belong in a claims resource, rather than the condition resource?</p>\n<p>2) I am very tempted to see if HCC's will fit into a Condition Resource -- this feels like the right way -- I've wondered whether a separate Condition resource should be created for the HCC code, even if this might mean multiple Condition resources for the same condition. But this would allow us to \"reset\" the status of that HCC code every year, and flag it for needing re-documentation.</p>\n<p>2) Or, we could also consider nesting the HCC code under the existing Condition.code element, and allowing people to include multiple codes and code systems there (just like how Procedure resources can include multiple code and code systems for the same procedure resource) Example:</p>\n<p>\"code\" : {<br>\n    \"coding\" : [<br>\n      {<br>\n        \"system\" : \"<a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>\",<br>\n        \"code\" : \"73211009\",<br>\n        \"display\" : \"Diabetes\"<br>\n      }<br>\n      {<br>\n        \"system\" : \"<a href=\"http://cms.gov/hcc\">http://cms.gov/hcc</a>\",<br>\n        \"code\" : \"HCC 18\",<br>\n        \"display\" : \"Diabetes with chronic complications \"<br>\n      }<br>\n]<br>\n}</p>",
        "id": 259282930,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1635358592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  I don't see it on <a href=\"https://confluence.hl7.org/display/PC/2021-10-28+Patient+Care+FHIR+Conference+Call\">https://confluence.hl7.org/display/PC/2021-10-28+Patient+Care+FHIR+Conference+Call</a>. Could you please confirm this will be discussed today?</p>",
        "id": 259414485,
        "sender_full_name": "Yan Heras",
        "timestamp": 1635438372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"408229\">@Daniel Tam</span> this topic was discussed during last week's DaVinci Risk Adjustment call. From the discussion, we think that the Risk Adjustment MeasureReport profile developed for the RA IG could fulfill the need to document HCC codes (<a href=\"https://build.fhir.org/ig/HL7/davinci-ra/StructureDefinition-ra-measurereport.html\">https://build.fhir.org/ig/HL7/davinci-ra/StructureDefinition-ra-measurereport.html</a>). As Linda mentioned, we would like to go over this and get input and perspective from PC.</p>",
        "id": 259417030,
        "sender_full_name": "Yan Heras",
        "timestamp": 1635439354
    },
    {
        "content": "<p>Yes, I will have it on the agenda today (under Zulip topic - will add a link to this discussion)</p>",
        "id": 259429611,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1635444522
    },
    {
        "content": "<p>great, thank you</p>",
        "id": 259430257,
        "sender_full_name": "Yan Heras",
        "timestamp": 1635444890
    }
]