[
    {
        "content": "<p>Does anyone have any background about <em>why</em> we have this requirement in the definition of the <a href=\"https://www.hl7.org/fhir/datatypes.html#primitive\" target=\"_blank\" title=\"https://www.hl7.org/fhir/datatypes.html#primitive\">code data type</a>: </p>\n<div class=\"codehilite\"><pre><span></span>Technically, a code is restricted to a string which has at least one character\nand no leading or trailing whitespace, and where there is no whitespace\nother than single spaces in the contents.\n</pre></div>\n\n\n<p>What is so bad about having multiple spaces in a code?  I mean I wouldn't personally create codes with double spaces, but are there real reasons we need to prohibit it?</p>",
        "id": 189823800,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1583434158
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-18441\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-18441\">J#18441</a> and <a href=\"http://jira.hl7.org/browse/FHIR-5573\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-5573\">J#5573</a> have some related notes, but nothing that really jumps out as causing a problem with codes with multiple spaces.</p>",
        "id": 189824147,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1583434424
    },
    {
        "content": "<p>Applying a digital signature will normalize the white space. Code comparisons/lookup are done using exact match. Things will break. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 189824165,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1583434434
    },
    {
        "content": "<p>If you are doing code comparisons for a locally defined code set with multiple spaces, then you would get exact matches.  It seems really odd that a digital signature normalization would control what content can be expressed.</p>",
        "id": 189824411,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1583434568
    },
    {
        "content": "<p>If someone is authoring codes where the meaning is dependent on the number of consecutive white-space characters, I'd like to meet that individual in a dark alley somewhere...</p>",
        "id": 189825389,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583435240
    },
    {
        "content": "<p>But, think of the security / privacy benefits!  <span aria-label=\"stuck out tongue wink\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span></p>",
        "id": 189827436,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1583436599
    },
    {
        "content": "<p>it's because of tricky issues around whitespace normalization in xml when using schema</p>",
        "id": 189834542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583441167
    },
    {
        "content": "<p>but I agree with Lloyd about multiple spaces in a code. Have you get a practical example?</p>",
        "id": 189834632,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583441249
    },
    {
        "content": "<p>We have a framework where organizations can define their own local codes, typically for communication within the hospital system.  We ran into a case where it was a typo that triggered our FHIR validation, but it got me looking at the rules for the  code data type.</p>",
        "id": 189920976,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1583519516
    },
    {
        "content": "<p>That's one of the benefits of the rules :)</p>",
        "id": 189928058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583524366
    },
    {
        "content": "<p>The V3 data types schema contains a Regex check that prevents the use of spaces in codes. In NZ, we ran into this problem in the early days of our national GP2GP system due to one vendor's legacy use of user-defined codes (which, by their very nature, are not interoperable). Fortunately, the CDA payload in this system is generated from a single common component, so we were able to implement a quick fix. I'm guessing that plenty of other countries will encounter this problem when attempting to exchange legacy data at a national level.</p>",
        "id": 189935266,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1583529373
    }
]