[
    {
        "content": "<p>Today in the International Patient Access IG Call, it was asked whether to add the  <a href=\"http://hl7.org/fhir/patient-operation-everything.html\">Patient/[id]/$everything operation</a>.  Before any further discussion, we would like to know whether it or <code>/Patient/[id]/$export</code> alternative has been implemented or if is planned to be implemented 1-2 years.  </p>\n<ol>\n<li>\n<p><code>Patient/[id]/$everything</code> returns: \"In the US Realm, at a minimum, the resources returned SHALL include all the data covered by the meaningful use common data elements as defined in the US Core Implementation Guide. Other applicable implementation guides may make additional rules about how much information that is returned.\" async or sync</p>\n</li>\n<li>\n<p>vs in Bulk Data <code>/Patient/[id]/$export</code> operation export data on a patient in a server; it works async.</p>\n</li>\n</ol>\n<p>(note there is also an EHI Export which is an US federal ONC requirement to be able to export all data about an individual regardless of whether it's in the USCDI and regardless of whether it has been modeled in FHIR.)</p>",
        "id": 255437394,
        "sender_full_name": "Eric Haas",
        "timestamp": 1632935688
    },
    {
        "content": "<p>We do not implement either, nor we have plans to implement them (we do implement normal bulk export and Patient/[id]/$everything)</p>",
        "id": 255462000,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632944713
    },
    {
        "content": "<p>My mistake above, I meant <code>Patient/[id]/$everything</code></p>",
        "id": 255473239,
        "sender_full_name": "Eric Haas",
        "timestamp": 1632949131
    },
    {
        "content": "<p>We _do_ implement that then . . . but it is not very useful because it tends to return way too much stuff in one go</p>",
        "id": 255476339,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632950236
    },
    {
        "content": "<p>We have implemented it in Firely Server, it’s also actively being used.</p>",
        "id": 255476713,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1632950397
    },
    {
        "content": "<p>We don't implement either, and have no plans.  We do support Bulk Group/id/$export.  We also support CCDA based exchange for sending \"chart summary\" style info.  We prefer not to have multiple methods to do the same thing, as we have to maintain everything, which gets expensive.  </p>\n<p>I agree that neither Patient/id/$everything nor Patient/id/$export would cover the data required by EHI export.  EHI export is much broader than FHIR can support  currently.</p>",
        "id": 255590379,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1633014429
    }
]