[
    {
        "content": "<p>Hi All,</p>\n<p>I just wanted to stop by and ask for some advice related to the Azure API for FHIR service, specifically related to sending a POST to the Base URL of the server with a Bundle resource in the body...</p>\n<p>Even more specifically, this question is related to the processing of the \"request\" fields for each item in \"entry[]\"</p>\n<p>When I send a Bundle resource with the Bundle.type value == \"transaction\", the queries detailed to be completed by the server do not seem to be actually fire that query. BUT, when I send a POST with the same Bundle resource albeit with Bundle.type == \"batch\", to the same Base URL, it DOES indeed send the respective queries in each entry[] item's request field.</p>\n<p>Any idea why this is? I am under the impression that the transaction field would also have those requests completed however as one \"atomic\" command. So says the documentation here, as I am understanding it: <a href=\"https://www.hl7.org/fhir/valueset-bundle-type.html#expansion\">https://www.hl7.org/fhir/valueset-bundle-type.html#expansion</a></p>\n<p>I would love to know what I am missing or why this discrepancy may occur. Thanks as always for everyone's guidance.</p>",
        "id": 200542491,
        "sender_full_name": "Michael Cox",
        "timestamp": 1591881540
    },
    {
        "content": "<p>Maybe transactions are not implemented? (The fact that are in the specs does not mean that all server implement them) <span class=\"user-mention\" data-user-id=\"195775\">@Michael Hansen</span></p>",
        "id": 200545142,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591882811
    },
    {
        "content": "<p>In the managed service and in the OSS version based on Cosmos DB, only “batch” is supported. The OSS version based on SQL supports transaction as well. And transaction will be coming to the managed service, but I don’t have a date at the moment.</p>",
        "id": 200551701,
        "sender_full_name": "Michael Hansen",
        "timestamp": 1591885754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> Yeah, thanks for mentioning this, I checked the Azure documentation for it and it does not offer transaction bundles on the \"PaaS\" version .<br>\n<span class=\"user-mention\" data-user-id=\"195775\">@Michael Hansen</span> Thanks a lot for the helpful feedback.</p>",
        "id": 200552294,
        "sender_full_name": "Michael Cox",
        "timestamp": 1591886035
    }
]