[
    {
        "content": "<p>Questionnaire has answerInstant of type instance. 'instance' says:  \"This is intended for precisely observed times (typically system logs etc.), and not human-reported times - for them, use date and dateTime. \" and Questionnaire says: \"...intended to solicit information from patients, providers or other individuals \". So why answerInstant? Seems it never should be used. </p>",
        "id": 153861212,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1481035358
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span> Good question.  I know we looked carefully at all the data types and had a use-case for each one we retained, but I can't recall why we included this one - particularly that you can accomplish the same thing using dateTime with a constraint on length.  Feel free to submit a change request.</p>",
        "id": 153861242,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481039600
    },
    {
        "content": "<p>I can see a use-case when your system precisely reports when you tap the screen to answer a question (this would be a sister element to the question you want to measure – yes, quite the hack).</p>",
        "id": 153861263,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1481049910
    },
    {
        "content": "<p>agree. no need for instant; it's only real function is to force an answer to be the a fully specified time. </p>",
        "id": 153861270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481052601
    },
    {
        "content": "<p>Added item <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12434\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12434\">GF12434</a></p>",
        "id": 153861300,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1481056521
    },
    {
        "content": "<p>Although I'm not using the instant as the moment some questionnaires where may have fields are person entered, and others software entered (through the pre-population actions)<br>\nWithout this will need to add additional validation to ensure all the values are included, and particularly if collecting content and then converting into other resources like that have an instant type property.<br>\nBut yes, we can just use the dateTime type and convert if needed</p>",
        "id": 153861309,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481060318
    },
    {
        "content": "<p>Prepopulation of fields which are then revivsed and submitted by humans does not justify answerInstant, I think. If there is a proper use case for system-prepopulated time fields which are NOT reviewed by humans, answerInstant is the right choice, but then the goal of Questionnaire should become: \"... solicit information from patients, providers or other individuals OR SYSTEMS involved in the healthcare domain\". Note: I'm not against answerInstant, I just noted an inconsistency in definitions.</p>",
        "id": 153861456,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1481098664
    },
    {
        "content": "<p>Agree with that assessment, but my vote would be to change the definition as you suggest to allow Questionnaires to be used to capture content from both humans and systems.</p>",
        "id": 153861937,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1481137387
    },
    {
        "content": "<p>Questionnaires are focused on capturing information from humans.  That doesn't mean they can't be used for capturing data solely from systems, but this use is well outside the 80% in terms of the design.</p>",
        "id": 153862048,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481150108
    },
    {
        "content": "<p>I wasn't suggesting one or other, but a mix. some content is prefilled (prepopulate) then the user finish the rest (and potentially edit some of it)</p>",
        "id": 153862874,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481352989
    },
    {
        "content": "<p>Prefilled content is focused on simplifying the user-entry experience.  Questionnaires are still designed on the basis the user would have to fill in all of the information.  The usecase of passing a questionnaire to share an arbitrary set of information between two systems is not a primary focus of the resource (and from an interoperability perspective is essentially passing around custom XML)</p>",
        "id": 153862883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481383099
    },
    {
        "content": "<p>I was getting ready to apply <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12434\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12434\">GF#12434</a>, but I think the tracker (and approved resolution) is a little vague in hind sight, so I wanted to double check the expected impact / stuff to be removed:<br>\n1) Questionnaire.item.enableWhen.answerInstant (remove instant data type choice)<br>\n2) Questionnaire.item.initialInstant (remove instant data type choice)<br>\n3) valueset-item-type - remove instant code from the value set<br>\n4) QuestionnaireResponse.item.answer.valueInstant (remove instant data type choice)</p>\n<p>Does that match everyone's understanding?</p>",
        "id": 153866521,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1484316960
    },
    {
        "content": "<p>That matches with my understanding . . .</p>",
        "id": 153866527,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484322514
    }
]