[
    {
        "content": "<p><a href=\"http://hl7.org/fhir/structuredefinition.html#invs\">FHIR R4 StructureDefinition invariant sdf-9</a> says \"In any snapshot or differential, no label, code or requirements on an element without a \".\" in the path (e.g. the first element)\"</p>\n<p>What's the rationale behind this? I'm constructing a logical model of a functional concept that has a SNOMED CT concept representing it. So why can I not state the SNOMED CT concept on the base?</p>",
        "id": 221923895,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1610013903
    },
    {
        "content": "<p>Metadata about the resource/model as a whole should go on the StructureDefinition, not on the root element.</p>",
        "id": 221957553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610034318
    },
    {
        "content": "<p>I could agree for label and requirements, but code constitutes a binding suitable on the root element, not as metadata on the structuredefinition? In any case there does not seem to be a true counterpart for code in the StructureDefinition, other than element itself.</p>",
        "id": 222064971,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1610107637
    },
    {
        "content": "<p>The constraint came from <a href=\"https://jira.hl7.org/browse/FHIR-6040\">https://jira.hl7.org/browse/FHIR-6040</a>.  At that point, StructureDefinition.keyword used to be called StructureDefinition.code.  I agree that with the evolved name and definition of that element, it doesn't overlap with ElementDefinition.code.  However, at this point, I don't think we can relax the constraint.  What we <em>could</em> do is add a StructureDefinition.code - likely as an extension - that mirrors what's in Questionnaire.</p>",
        "id": 222077449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610115866
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> Did you file an issue on this? Not being able to add a code on the root of a datatype profile means there's no way to for a type profile to apply a code to an SD element in a reusable way. Using SD.keyword (or an extension) means the code doesn't naturally inherit onto the profiled element.</p>\n<p>Does \"normative\" mean we can't relax a constraint?</p>",
        "id": 231155886,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1616257666
    },
    {
        "content": "<p>We can relax a constraint conditionally based on a new element, but I don't think we can relax the constraint overall.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 231164059,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616266144
    },
    {
        "content": "<p>Looking back in the issues <span class=\"user-mention\" data-user-id=\"191351\">@Chris Grenz</span> I don’t believe I did. It’s still bothering me though so I hope we don’t have to be backward compatible with something that does not really work as intended</p>",
        "id": 231235960,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616354860
    },
    {
        "content": "<p>Just realized there's an internal conflict in the spec. In <a href=\"http://hl7.org/fhir/R4/elementdefinition.html#interpretation\">http://hl7.org/fhir/R4/elementdefinition.html#interpretation</a> code is \"optional\" on the first element. Label (another sdf-9 restriction) is even recommended!</p>",
        "id": 260853962,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1636488783
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  - any comment on the normative change question from Lloyd? Can we remove a constraint from StructureDefinition?</p>",
        "id": 260854229,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1636488904
    }
]