[
    {
        "content": "<p>Is there a reason that US-core does not support bundle for clinical documents? It seems that bundle is a better approach to support documents with discrete data.</p>",
        "id": 249107318,
        "sender_full_name": "frank cao",
        "timestamp": 1628688741
    },
    {
        "content": "<p>US-core is focused on what most EHRs in the U.S. are capable of doing.  And converting CDA documents to FHIR documents isn't (yet?) one of those things.</p>",
        "id": 249109257,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628689648
    },
    {
        "content": "<p>Thanks Lloyd. If we were to implement a non-US document repository that includes diagnostic reports, clinical notes such as discharge summaries, would you recommend to stick to US-core or also support document bundles? We may not have a need for CDA but the idea of document bundles is to support discrete data, which US-core doesn't support, correct?</p>",
        "id": 249112939,
        "sender_full_name": "frank cao",
        "timestamp": 1628691009
    },
    {
        "content": "<p>The DocumentReference resource is supported in US-Core. Not clear to me why this could not be describing a FHIR-Document (bundle).  US-Core does not provide guidance on how to specify other kinds of documents, but does not (as far as I can tell) forbid others.</p>",
        "id": 249113349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628691205
    },
    {
        "content": "<p>a more general and international  implementation guide on the use of DocumentReference is the IHE-MHD -- <a href=\"https://profiles.ihe.net/ITI/MHD/\">https://profiles.ihe.net/ITI/MHD/</a></p>",
        "id": 249113998,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628691426
    },
    {
        "content": "<p>The IHE also has an Implementation Guide showing how to convey the IPS (FHIR-Document) using Document Sharing, including MHD. (nothing too special, Composition maps to DcumentReference (just like found in FHIR core) and the FHIR-Document (Bundle holding the Composition and stuff) is pointed to by the attachment.url</p>",
        "id": 249114633,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628691675
    },
    {
        "content": "<p>Thanks a lot. I will take a look. For diagnostic related reports, should I use document bundle or DiagnosticReport? Both can support discrete data and I like that DiagnosticReport instance is smaller than a bundle.</p>",
        "id": 249116873,
        "sender_full_name": "frank cao",
        "timestamp": 1628692612
    },
    {
        "content": "<p>should start a new stream for a new topic.</p>",
        "id": 249120406,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628694148
    },
    {
        "content": "<p>You can take a look at International Patient Summary IG <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/\">https://build.fhir.org/ig/HL7/fhir-ips/</a> which is document based. <span class=\"user-mention\" data-user-id=\"192869\">@frank cao</span></p>",
        "id": 249121068,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1628694387
    },
    {
        "content": "<p>Isn't composition the right resource here</p>",
        "id": 249144748,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1628704696
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191506\">Yunwei Wang</span> <a href=\"#narrow/stream/179166-implementers/topic/why.20US-core.20doesn't.20support.20bundle.20for.20documents/near/249121068\">said</a>:</p>\n<blockquote>\n<p>You can take a look at International Patient Summary IG <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/\">https://build.fhir.org/ig/HL7/fhir-ips/</a> which is document based. <span class=\"user-mention silent\" data-user-id=\"192869\">frank cao</span></p>\n</blockquote>\n<p>I'm aware of the IPS. If I need to support discharge summary that may contain discrete data, I think IPS or bundle is a better fit. However if US-core IG doesn't support it, does that mean most vendors cannot support the discrete data format? I also looked at MHD and I think it could be the long term solution for document exchange with FHIR.</p>",
        "id": 249145531,
        "sender_full_name": "frank cao",
        "timestamp": 1628704988
    },
    {
        "content": "<p>Note that the definition of 'document' in the context of DocumentReference (and IHE-MHD) is the broad definition used for document in http. It does not need to meet the principles of a Document popularized by CDA. These principles are best-case, but not minimally important. Thus a DocumentReference (and IHE-MHD) can be used for anything that can be described with the metadata elements in the DocumentReferenence resource, and has a stream of bytes.</p>",
        "id": 249161222,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628711807
    },
    {
        "content": "<p>The US core way to support discrete data is to make it available in the server - as separate resources, and then the client can get them if it wants them</p>",
        "id": 249161689,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628712027
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179166-implementers/topic/why.20US-core.20doesn't.20support.20bundle.20for.20documents/near/249161689\">said</a>:</p>\n<blockquote>\n<p>The US core way to support discrete data is to make it available in the server - as separate resources, and then the client can get them if it wants them</p>\n</blockquote>\n<p>Im unclear what your point is... US-Core does include DocumentReference</p>",
        "id": 249161872,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628712109
    },
    {
        "content": "<p>That if as a client I want to find out things about a patient that has been discharged I use searches like ../AllergyIntolerance?patient=xxxx, ../Observation?patient=xxxx  etc</p>",
        "id": 249163108,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628712782
    },
    {
        "content": "<p>Servers might return documents via DocumentReference resource, but they are usually C-CDAs - that a FHIR client cannot really interpret</p>",
        "id": 249163263,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628712869
    },
    {
        "content": "<p>But if we look at discrete data as part of a document, current US-core does not support it. I understand that from a minimum requirement perspective, but I think it does hinder interoperability to a certain degree if vendors just take the easy way by sending document without any discrete data even if they can.</p>",
        "id": 249239140,
        "sender_full_name": "frank cao",
        "timestamp": 1628777335
    },
    {
        "content": "<p>For a lab report, if you want to limit yourself to US Core and you actually <em>have</em> a FHIR document (congrats!), then post the document as a DocumentReference and also post the DiagnosticReport and individual Observations as distinct resources without the Composition wrapper.</p>",
        "id": 249239714,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628777608
    },
    {
        "content": "<p>US Core is not based on 'sending' - it makes the data available and the client query it, and so all discrete data is available</p>",
        "id": 249240396,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628777919
    }
]