[
    {
        "content": "<p>What is the rationale for excluding Person as a Group member?<br>\n<a href=\"http://hl7.org/fhir/group-definitions.html#Group.member.entity\">http://hl7.org/fhir/group-definitions.html#Group.member.entity</a></p>",
        "id": 202520022,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1593564990
    },
    {
        "content": "<p>The rationale is that groups can only include <a href=\"https://build.fhir.org/participant.html\">\"participant\" type actors</a>, and Person isn't one. That's the party line (I believe).</p>",
        "id": 202520422,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1593565376
    },
    {
        "content": "<p>correct. person is mostly just for linking, not for agency</p>",
        "id": 202520721,
        "sender_full_name": "John Moehrke",
        "timestamp": 1593565757
    },
    {
        "content": "<p>Doesn't anyone who might use a FHIR API have agency?<br>\nUse case one refers to \"healthcare-related activities\" which seems pretty broad and covers \"tracked, examined or otherwise referenced\" which is also pretty broad and beyond the \"provision of healthcare\" that participant constrains to.</p>",
        "id": 202562132,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1593606562
    },
    {
        "content": "<p>yes I think anyone who uses an API has agency; let's talk about specific examples to see whether they are covered by the more specific participant types.</p>",
        "id": 202566385,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1593609048
    },
    {
        "content": "<p>a user is a user. They might be acting in a persona of Patient, in a persona as Practitioner, in a persona as etc... One must set their persona first. Person is a persona -less container.   --- NOTE also that Practitioner is not specific to licensed healthcare clinicians, Practitioner is the generic resource for a user (other than Patient persona, or the other agent based resources). <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  has pointed this out elsewhere that the janitor would be represented as a Practitioner persona. So the Resource you are likely looking for is Practitioner</p>",
        "id": 202570542,
        "sender_full_name": "John Moehrke",
        "timestamp": 1593611239
    },
    {
        "content": "<p>My people are mostly terminology resource authors - what is the appropriate persona?  But AFAICT, Practitioner is about \"provision of healthcare\" -- that does not seem (to me) to apply (nor to a hospital janitor).  If it really does, then these sorts of broad cases should be included in the list of examples (which are currently all, except the strangely specific IT one, about healthcare to the patient).  Other useful examples, if they count, would be secondary users of data.</p>",
        "id": 202644714,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1593657103
    },
    {
        "content": "<p>SCIM user is the appropriate resource at this time</p>",
        "id": 202644757,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593657131
    },
    {
        "content": "<p>I was surprised too when I heard that Practitioner was intended for everyone doing any job. I think the narrative text you are seeing is based on the simple fact that the early modeling of FHIR came mostly (99%) from clinical care perspective; where as now we have other perspectives such as research, public-health, etc.. in scope.</p>",
        "id": 202679365,
        "sender_full_name": "John Moehrke",
        "timestamp": 1593692107
    },
    {
        "content": "<p>write a good and persuasive change request</p>",
        "id": 202679384,
        "sender_full_name": "John Moehrke",
        "timestamp": 1593692124
    },
    {
        "content": "<blockquote>\n<p>SCIM user is the appropriate resource at this time</p>\n</blockquote>\n<p>Wait, is this a resource and can it belong to a Group? Or is your intention to tell <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  that what he is doing is out of scope for FHIR, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 203107526,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594131201
    },
    {
        "content": "<p>SCIM user is a resource, but not a FHIR resource.<br>\nSCIM also has a group resource. </p>\n<p>yes, what he is trying to do is something that we have repeatedly ruled out of scope for FHIR</p>",
        "id": 203210372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594160313
    },
    {
        "content": "<p>Ok, I came to this issue from the perspective of trying to solve a authZ problem, but there does seem to be ambiguity / lack of clarity and consensus around scope here -- e.g., the janitor example above.</p>",
        "id": 203350561,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1594269979
    },
    {
        "content": "<p>Agreed. I wonder if it's possible to take a stab and defining when FHIR Groups should be used and when they shouldn't be used, in scenarios related to access control and authorization.</p>\n<p>Like, if I wanted to use a Group to define patients associated with a given clinic... and then grant permissions based on that Group, I assume that's OK? But if I wanted to use a Group to define a list of practitioners at that clinic, and then grant permissions based on <em>that</em> group... this wouldn't be OK?</p>",
        "id": 203391227,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594304471
    },
    {
        "content": "<p>If the group of practitioners can't take collective action or responsibility and is defined by a set of criteria, no issue using Group.  As a Group, they can be subject of actions, but can't be author/performer.</p>",
        "id": 203391436,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594304579
    }
]