[
    {
        "content": "<p>Hi,</p>\n<p>Why is the search parameter CodeSystem.version of type token, and how should i use this?</p>\n<p>CodeSystem.version attribute is of type string and has the description \"Business version of the code system (Coding.version)\". Im reading on the CodeSystem page that \"a code system MAY provide a version identifier which can be specified in CodeSystem.version\", but cant really grasp the concept of this identifier. Since version is of type string, shouldnt the only data on this field be for example \"1.1\"?</p>\n<p>If anyone could explain the concept behind this it would be highly appriciated.</p>\n<p>Thanks</p>",
        "id": 164436795,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1556529466
    },
    {
        "content": "<p>Different code systems have different approaches to labeling their versions.  Some might use numbers, others letters, some will use a mixture.  We use the 'token' type for search because we want exact match and case-sensitive behavior, which the string search type doesn't provide.</p>",
        "id": 164450142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556543186
    },
    {
        "content": "<blockquote>\n<p>Different code systems have different approaches to labeling their versions.  Some might use numbers, others letters, some will use a mixture.  We use the 'token' type for search because we want exact match and case-sensitive behavior, which the string search type doesn't provide.</p>\n</blockquote>\n<p>Ok thank you. So what would the correct query be if i just want to search for a version like 1.1? Is this correct? : {baseUrl}/CodeSystem?Version=1.1</p>",
        "id": 164455677,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1556547162
    },
    {
        "content": "<p>'version' should be lower-case, but otherwise yes.  That search will only match on \"1.1\" rather than also matching \"1.1.2\" or \"1.1b\" which a string search type would have allowed</p>",
        "id": 164459395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556549887
    },
    {
        "content": "<blockquote>\n<p>'version' should be lower-case, but otherwise yes.  That search will only match on \"1.1\" rather than also matching \"1.1.2\" or \"1.1b\" which a string search type would have allowed</p>\n</blockquote>\n<p>Ok, make sense. Thank you!</p>",
        "id": 164703181,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1556800149
    },
    {
        "content": "<p>I think it would have been clearer to then also make version of type id instead of string. But with CodeSystem being normative that route is closed.<br>\nActually the better option would be to make the searchparameter of type string. So you can also search for an implicit range of versions (starts with '3.5' will give you anything in the range 3.5.x). Although that may not be applicable for some of the versioning mechanisms in use, with a token parameter you eliminate the possibility of this use altogether, also for versioning mechanisms for which it would make sense (e.g. semver).</p>",
        "id": 165248981,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1557406286
    },
    {
        "content": "<p>id limits certain punctuation that code systems might choose to use.  I believe we use 'token' as the search type</p>",
        "id": 165275491,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557425417
    }
]