[
    {
        "content": "<p>When a resource is profiled, and you would like to decode that resource into a custom class, the current wire format makes this hard. When you encouner a resource e.g. &lt;MedicationOrder&gt;, you need to wait untill &lt;meta&gt;&lt;profile&gt; is read, before you can decide which type of profile the MedicationOrder belongs to. Would it be possible as part of STU3 to change the wire format a bit, in order to expose the profile sooner. E.g as part of &lt;MedicationOrder profile=\"the main profile\"&gt;.</p>",
        "id": 153836177,
        "sender_full_name": "Thomas Andersen",
        "timestamp": 1467489560
    },
    {
        "content": "<p>That would require identifying one of the profiles as \"the main profile\" - and multiple profiles could exist and could be considered \"main\" for different consumers.  We *could* list them all in an attribute with space-separations, but you'd still have the same issue when parsing JSON.  As well, unless you have a special arrangement with the sender, you can't count on the profile(s) you care about even being declared.  Finally, having the data in meta makes it easier to exclude it from being included in digital signatures.  You're free to submit a change request, but it might be a tough sell.</p>",
        "id": 153836181,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1467494834
    },
    {
        "content": "<p>Could you please explain what is the  wire format?  Because  it is hard to find a formal definition of the term, eps. for newbies.  Thanks.</p>",
        "id": 153860085,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1480764791
    },
    {
        "content": "<p>In an exchange there can only be one 'main' profile, it is only from a persistance perspective that more profiles could be asserted.</p>",
        "id": 153860092,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1480767873
    },
    {
        "content": "<p>Sorry for duplicate posts due to the status remained \"Sending\".</p>",
        "id": 153860130,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1480807622
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192103\">@Lin Zhang</span> , the <strong>wire format</strong> simply means the format the resource is transported (“sent over the wire”). That is XML or JSON (or RDF).<br>\n(ah, ignore, just saw the other stream)</p>",
        "id": 153860674,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1480949737
    },
    {
        "content": "<p>Thanks, Pascal :)</p>",
        "id": 153860707,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1480952206
    }
]