[
    {
        "content": "<p>Hi guys, I want to implement FHIR APIs in my website which is going to be develop in PHP platform. I came to know that there is no library available in this platform. If anyone did the same, please provide me some details. Thanks!</p>",
        "id": 175516993,
        "sender_full_name": "technodeviser",
        "timestamp": 1568284860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194077\">@Matthew Koch</span></p>",
        "id": 175517131,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568285042
    },
    {
        "content": "<p>You have some choices here but there are no full fledged solutions for a FHIR server/client written in PHP that I am aware of. To begin, what are you looking to achieve? Is your website going to consume FHIR data or expose it?</p>",
        "id": 175519363,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1568287430
    },
    {
        "content": "<p>Thanks for your response :) Okay so as we don't have any library for PHP, so how can we use get the data from it ? Basically I wanted to develop an website where doctor/patient records will be stored &amp; retrieved on the basis of any unique ids &amp; I will perform further operations.</p>",
        "id": 175519840,
        "sender_full_name": "technodeviser",
        "timestamp": 1568287919
    },
    {
        "content": "<p>There are many use cases where a FHIR transformational layer sits between an interface (UI, Web service, etc) and a relational data store - in your case, you might look at using PHP to build your web app and then use some FHIR tooling to transform your PHP classes according to your needs. </p>\n<p>At the FHIR dev days conferences there were several people that designed their databases as a normal relational data store and then tacked on a json/blob column to hold the FHIR representation of the resource.</p>",
        "id": 175522054,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1568289951
    },
    {
        "content": "<p>For PHP, we have used the open source FHIR libraries created and maintained by Daniel Carbone: <a href=\"https://github.com/dcarbone/php-fhir\" target=\"_blank\" title=\"https://github.com/dcarbone/php-fhir\">https://github.com/dcarbone/php-fhir</a></p>",
        "id": 175522124,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1568289996
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197406\">@Sebastiaan Knijnenburg</span></p>",
        "id": 175920851,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568735968
    }
]