[
    {
        "content": "<p>Hi all,</p>\n<p>It might be that the partly open nature of how FHIR can be used is a reason for my confusion, but I wanted to clarify something with you. We are developing a tool to schedule surgeries on a patient. So far my understanding is the following workflow:</p>\n<ol>\n<li>A patient has an accident of something else and visits the hospital: An encounter is created to document the patient visit. An Observation and/or Condition might be created</li>\n<li>A ServiceRequest is created to indicate that something should be done on the patient</li>\n<li>An appointment is created to fix the date a procedure should take place and which resources (team/location) to use</li>\n<li>When the appointment happens the Procedure documents how everything was carried out</li>\n<li>The encounter is closed when the patient leaves the hospital</li>\n</ol>\n<p>What do you think? Is this understanding correct?</p>",
        "id": 214043130,
        "sender_full_name": "René Störmer",
        "timestamp": 1603283716
    },
    {
        "content": "<p>I think it depends how the surgeries are handled in the underlying system. In some cases the appointment may turn into a surgical encounter (part of the inpatient encounter, or maybe of an episode of care), and that may change how the documentation will be done. There may be additional procedures as well (e.g. Anesthesia).</p>",
        "id": 214047643,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1603286251
    },
    {
        "content": "<p>What's proposed is a 'reasonable' workflow.  Whether appointments exist, whether it's one appointment or many, whether it's one procedure or many (or one procedure with a hierarchy of procedures), whether there's an encounter or multiple encounters or none, whether there's Task to negotiate fulfillment of the ServiceRequest will all vary by type of procedure, who's performing it, technical environment, level of detail to be captured, etc.</p>",
        "id": 214091131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603303682
    },
    {
        "content": "<p>If you want to nail down the specific workflow, you'll need to do that in the context of some specifics in terms of the community (country, discipline), the types of procedures (surgery vs. counselling vs. physio vs. radiation), etc.</p>",
        "id": 214091760,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603303943
    }
]