[
    {
        "content": "<p>Does anyone have a working example of using the validator to validate a QuestionnaireResponse against a Questionnaire? I've tried referencing a contained Questionnaire, one on localhost, one on my server, tweaking the  GCS example, but all I get is:</p>\n<div class=\"codehilite\"><pre>  Information @ QuestionnaireResponse.questionnaire (line 76, col20) : Unable to determine type of target resource\n  Warning @ QuestionnaireResponse (line 76, col20) : The questionnaire could not be resolved, so no validation can be performed against the base questionnaire\n</pre></div>\n\n\n<p>The referenced Questionnaire itself validates. Most likely I'm doing something wrong, but can't find it. (Using current build, though 1.8.0 gives the same results. Using the validator to validate other stuff works fine, so my setup should be right.)</p>",
        "id": 153869472,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1485781838
    },
    {
        "content": "<p>My DSTU2 server now has a fully functional Questionnaire/QuestionnaireResponse validator in it, as far as I know it covers all extensions for validation also.<br>\n(just not profiles)</p>",
        "id": 153869839,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1486079609
    },
    {
        "content": "<p>To use it just post your questionnaire to my server, then use the QR $validate operation to check your data.</p>",
        "id": 153869841,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1486079639
    },
    {
        "content": "<p>Currently the implementation of the validation is internal only, but considering publishing it in the fhir dotnet client.<br>\nIt returns fully coded operationoutcomes for all the issues too.</p>",
        "id": 153869842,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1486079694
    },
    {
        "content": "<p>Has there been work on updating this validator to STU-3, Brian? I just made my ResearchKit bridge preserve the grouping, so am interested in testing the validator, but am on v1.8.</p>",
        "id": 153869889,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1486122833
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> . Unfortunately, like <span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span>  I'm on 1.8.0 and Q/QR has changed substantially. HAPI does validation on Q/QR too, I was just hoping to get the validator to do that too. Nevertheless, glad there is support. I'll certainly use it once anything on the STU3 path is there.</p>",
        "id": 153869895,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1486128480
    },
    {
        "content": "<p>My STU3 server has some support, but its nowhere near my DSTU2 version.</p>",
        "id": 153869940,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1486142491
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span> can you create a task for this - I should get to it sometime this week</p>",
        "id": 153870180,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486362265
    }
]