[
    {
        "content": "<p>Hi, we have a few questions regarding the usage of Tasks in RequestGroup.actions. We instantiate RequestGroups from PlanDefinitions and are copying most of the action attributes, but we also create a Task resource. We are using Tasks in actions to execute the specific actions and reference these in the resource field.<br>\nHowever, we are unsure about a few things:</p>\n<p>When instantiating the RequestGroup from a PlanDefinition, does the Task resource need to be created immediately or is it also allowed to create actions \"at runtime\", when they're ready to be executed?<br>\nHow is the resource field to be used when the timing field includes intervalled execution? We were thinking of creating a new Task resource for every iteration, so we can check on its status. That means we have to use sub-actions to store the Tasks. Is this the intended way?</p>\n<p>Thank you in advance :)</p>",
        "id": 264143837,
        "sender_full_name": "Felix Dommes",
        "timestamp": 1638963975
    },
    {
        "content": "<p>RequestGroup (and the referenced Requests) represents a single monolithic inseparable 'order'.  As with any order, there can be more than one Task to seek fulfillment of the order and the Tasks can be initiated at any time after the order is activated.  The Tasks can qualify 'how much' of the order fulfillment is sought for (e.g. by time or quantity), though qualifying by quantity probably doesn't make sense for a RequestGroup.  Also, you generally wouldn't have Tasks seeking fulfillment of different sub-Requests of the RequestGroup given that it's monolithic and can have only one status.  (i.e. it needs to be active, on-hold or complete as a 'collective').  You're also free to create sub-Tasks beneath your original fulfillment Task if that's useful.</p>",
        "id": 264160812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638973019
    },
    {
        "content": "<p>Thank you for the fast answer, sorry for coming back to it so late!</p>\n<p>So if I understood correctly, Tasks should in general be created at RequestGroup creation. However I am afraid I don't fully understand the answer and should clarify the question:</p>\n<p>If a RequestGroup.action includes intervalled execution via the timingTiming attribute (repeat with frequency), should this result in a new Task resource for every execution or should the Task somehow cover all iterations? I don't see the possibility to define interval-based execution in Tasks, so is it the former?</p>",
        "id": 269231540,
        "sender_full_name": "Felix Dommes",
        "timestamp": 1643103927
    },
    {
        "content": "<p>You create Tasks asking for fulfillment of some sort of Request.  You could point to the overall RequestGroup or you could point to sub-requests referred to by RequestGroup.action.resource.  Within Task, you can also choose to filter to a more limited timeframe.  If there are any repetitions, that's handled either by the base Request or by creating distinct tasks per repetition.</p>",
        "id": 269300996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643135208
    },
    {
        "content": "<blockquote>\n<p>or by creating distinct tasks per repetition.</p>\n</blockquote>\n<p>Thanks for the clarification. Just to be sure: Creating new Tasks per RequestGroup.action.timingTiming repetition and referencing them as sub-action in the existing RequestGroup's respective action.resource would be OK?</p>",
        "id": 269593612,
        "sender_full_name": "Johannes Becker",
        "timestamp": 1643299156
    }
]