[
    {
        "content": "<p>Thanks to all for the input on the prior queries.  Based on that, I'm going to back up a step to a more open question.</p>\n<p>Consider the lightweight (i.e. relatively dumb) data collection devices in the hospital that are either carried from patient to patient, or are in an exam room where patients come through one by one.  The data they collect (a photo of a lesion, a blood sugar reading, etc) needs to be associated with the correct patient/encounter.  Most hospitals put wristbands on patients that have a patient name and/or visit number and/or patient id, etc (encoded as a barcode, QR code, RFID, or just plain text), in part to facilitate this kind of thing.</p>\n<p>What is the current thinking about how such a (dumb) device should proceed?</p>",
        "id": 159553218,
        "sender_full_name": "Kevin O'Donnell",
        "timestamp": 1551302199
    },
    {
        "content": "<p>IHE has a profile for this -- <a href=\"https://wiki.ihe.net/index.php/Uniform_Barcode_Processing\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/Uniform_Barcode_Processing\">https://wiki.ihe.net/index.php/Uniform_Barcode_Processing</a><br>\nIt leverages FHIR and GS1</p>",
        "id": 159554537,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551303164
    },
    {
        "content": "<p>in general, there'll be some gateway device/process that unites the observations they produce with the patient id</p>",
        "id": 159754531,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551478800
    },
    {
        "content": "<p>Agreed. We (IHE Rad) are trying to profile those gateway devices/processes for our use case.  Currently, it is common for photos to only be associated with the patient id which clinicians find very frustrating (the dreaded \"Media tab\" in the EMR), so in addition to associating with the patient id, they've asked us to also associate with details such as the current departmental encounter and the admission encounter to which that belongs, the device, operator, etc.</p>\n<p>So from <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, I get the first part... <br>\nStep 1: Scan patient wristband<br>\nStep 2: Transmit scan-string to Barcode Processor<br>\nStep 3: if it's a patient id, the Barcode Processor will recognize it as such because ...? and return a Resource containing a Patient.identifier<br>\nStep 4: If it's a visit/account number, the Barcode Processor will recognize it as such because ...? and ...?</p>\n<p>Step ...?</p>\n<p>Step N: Store photo with metadata/linkages to the patient id, admission, department encounter,  device, operator, etc.</p>",
        "id": 159770429,
        "sender_full_name": "Kevin O'Donnell",
        "timestamp": 1551490849
    },
    {
        "content": "<p>have you looked at the POC FHIR Igs from the Devices workgroup? I believe that this is something they deal with</p>",
        "id": 159778745,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551503581
    },
    {
        "content": "<p>Barcode processor recognizes codes assuming that the codes are enabled to do that. Some barcoding schemes have their semantics.</p>",
        "id": 162134738,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972750
    },
    {
        "content": "<p>e.g. if a barcode starts with 01, it's a product</p>",
        "id": 162134795,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972811
    },
    {
        "content": "<p>if a barcode has just a uuid, the barcode processor will have a harder time (and so may the patient) - something else is needed e.g. a lookup</p>",
        "id": 162134864,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972919
    }
]