[
    {
        "content": "<p>Hello, when we build custom implementation guide, it is possible to generate directly the resources  xsd schemas? Like those we can found  in the download section?</p>",
        "id": 164513868,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556603963
    },
    {
        "content": "<p>the IG publisher generates schematrons for any profiles in the IG. It's up to the author whether those are linked in the narrative anywhere but they are always inluded in the package for the IG in \\xml</p>",
        "id": 164517674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556609268
    },
    {
        "content": "<p>Ok, thanks a lot for the fast reply. I was looking to the wiki and as explained at FHIR IG Framework page I undeerstand that I can find the generated xsd here: 'src-generated/schemas/fhir-single.xsd'. My IG is a fork of the CH-Core so, maybe, I need to look with <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span>  if it is a problem in my configuration.</p>",
        "id": 164521131,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556613338
    },
    {
        "content": "<p>the IGs don't change the base schema. they are set of rules on top of the schema - hence, the schematron</p>",
        "id": 164521733,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556614020
    },
    {
        "content": "<p>Ok, I think that I didn't understand well how IG work. Actually we defined some extensions for our purpose and we want to provide web interfaces on BizTalk that permit the distribution across our system of our FHIR definitions. Did you know if someone did something like that?</p>",
        "id": 164523309,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556615588
    },
    {
        "content": "<p>defining extensions is a common thing to do. but that doesn't change the schema.</p>",
        "id": 164523674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556615908
    },
    {
        "content": "<p>I can't talk about the Biztalk part, or what it means 'permit the distribution across your system'</p>",
        "id": 164523711,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556615944
    },
    {
        "content": "<p>In our ecosystem the ERP produce V2 files, and new patient information system core is based on fhir, so the idea was to profit of microsoft .NET fhir implementation to convert and get the data from our ERP</p>",
        "id": 164529502,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556622380
    },
    {
        "content": "<p>so that much makes sense, but it doesn't explain where you would like the schema to get involved</p>",
        "id": 164529622,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556622554
    },
    {
        "content": "<p>The schema is used to declare the interface inside BizTalk to map  the V2 file. Actually we are moving our patient information system on FHIR but we still have more than 200 apps on ours hospitals and BizTalk is at the core of distributing ERP patient data to others apps. For some apps we had good discussion with the vendors and they start to build RESTful FHIR interfaces with our help.  For other app we need to map the new fhir resources to V2 or proprietary formats.</p>",
        "id": 164530481,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556623577
    },
    {
        "content": "<p>so you use the base fhir schemas. the IGs are a set of information about how to use the structures described by the schemas</p>",
        "id": 164530505,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556623629
    },
    {
        "content": "<p>BizTalk can use the xsd as mapping interface definition so our idea was to generate a schema with our rules to limit the interface mapping. This can simplify the read of the map and avoid some implementation error because it represent our internal guide.</p>",
        "id": 164530595,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556623739
    },
    {
        "content": "<p>In the case that a vendor provide directly the fhir interface, we don't use BizTalk because it make no sense with RESTful endpoint.</p>",
        "id": 164530621,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556623796
    },
    {
        "content": "<p>And we can use websocket to provide real time informations</p>",
        "id": 164530687,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556623836
    },
    {
        "content": "<blockquote>\n<p>generate a schema with our rules to limit the interface mapping</p>\n</blockquote>\n<p>So the problem here is that some of the facilities that the profiles do - and they are things that happen a lot - are not things that schema can describe - bindings, slicing, constraints</p>",
        "id": 164530722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556623881
    },
    {
        "content": "<p>the IG publisher does generate some schema that tries to do what it can to represent the profiles but they are not much used</p>",
        "id": 164530752,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556623922
    },
    {
        "content": "<p>Maybe I have to seen if we can integrate validators into BizTalk to use our rules</p>",
        "id": 164531152,
        "sender_full_name": "Michele Korell",
        "timestamp": 1556624329
    }
]