[
    {
        "content": "<p>Has anyone in this group built an xslt transform from xsd's or xmi into FHIR xml?   Looking to potentially fast track an Enterprise Architect model into a FHIR IG.</p>",
        "id": 190387990,
        "sender_full_name": "Scott Bauer",
        "timestamp": 1584019189
    },
    {
        "content": "<p>To clarify, you're looking at generating FHIR logical models from Enterprise Architect class models?</p>",
        "id": 190392977,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584022052
    },
    {
        "content": "<p>Our expectation is that we would be transforming Enterprise Architect class models to logical models that would be limited in the use of FHIR conformance structures.  The result would be a FHIR resource that would have some attributes mapped to the more obvious matches in those conformance structures.   We could do this starting from either the XMI or generated XSDs depending on the tools available.</p>",
        "id": 190427614,
        "sender_full_name": "Scott Bauer",
        "timestamp": 1584038171
    },
    {
        "content": "<p>I know here EA XMI's are being converted to ART-DECOR datamodels which can be exported as FHIR Logical Models. So it's doable - I don't expect this to work out of the box for other environments. <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span></p>",
        "id": 191582001,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1585041131
    },
    {
        "content": "<p>Those XMIs conform to very specific rules enforced by DCM-like modeling. The DCM plugin from Results4Care is used in EA, and a couple of additional rules have been applied. <span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span> would be in the know of the EA side. The import scripting aims to transform into ART-DECOR only. ART-DECOR can then export into logical models. Michael has also been working exporting Loigcal Models from EA directly. Not sure where he landed with that.</p>",
        "id": 191582736,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1585041558
    }
]