[
    {
        "content": "<p>I would like to mark the start of a Goal being worked on using a dateTime stamp. It seems like the only two options at the moment are to use a date stamp or a CodeableConcept. Is there an established pattern for capturing the Goal start as a dateTime?</p>",
        "id": 266854129,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1641325710
    },
    {
        "content": "<p>I think the belief is that the 'time' component is not relevant.  If you started pursuing the goal on January 3, whether you did so at 9:15 or 13:23 doesn't much matter.  Do you have a use-case where the time is actually important/relevant?</p>",
        "id": 266876647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641337511
    },
    {
        "content": "<p>Great question. </p>\n<p>At first I was confused because I thought Goals were meant to describe <em>objectives</em> and I was thinking of using them to capture objectives like \"walking 4 km in the morning\" and specifying a Task to do this. The idea was to split out the activity (using a Task) from the objective (using a Goal). </p>\n<p>Upon re-reading the documentation on FHIR Goals, it says that generally, Goals are meant to capture desired health <em>states</em>, which my example is not. I think the mistake I'm making is thinking that Tasks should not be used to capture an objective, which when stated like this seems wrong. Clearly the objective of the Task is to complete the Task.</p>\n<p>If Goals are meant to express a desired health state we want the patient to attain, then I have been thinking about them incorrectly and I cannot think of a good example where the specific start/end time of a Goal is important/relevant.</p>",
        "id": 266952183,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1641398022
    },
    {
        "content": "<p>A goal might be \"is able to walk 4km each morning\" or \"has reached the point where they walk 4km most mornings\".  However it's definitely not a \"do x\" statement.  If you want to say \"do x\", then you're looking at a Request resource (of which Task is one).</p>",
        "id": 266979287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641410826
    },
    {
        "content": "<p>Yeah, that makes a lot of sense. I see how I've been thinking about Goals incorrectly.</p>",
        "id": 266992796,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1641417711
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"401577\">Kyle Thompson</span> has marked this topic as resolved.</p>",
        "id": 266992878,
        "sender_full_name": "Notification Bot",
        "timestamp": 1641417734
    }
]