[
    {
        "content": "<p>In the current AE resource, I have the following questions:</p>\n<ol>\n<li>AdverseEvent for Oncology contains toxicity grades not severity. Please include toxicity grade attribute to AE?</li>\n<li>AE outcome code contains ONGOING as one of the choices. What exactly does ONGOING mean? does it mean NOT RECOVERED/NOT RESOLVED? </li>\n<li>There are not anatomical location of AE attribute available. Please add anatomical location of AE.</li>\n<li>An AE event could have an end date or might be ongoing. Can we have another end date time attribute and ongoing attribute as well?</li>\n</ol>",
        "id": 261845185,
        "sender_full_name": "Priya Gopal",
        "timestamp": 1637181479
    },
    {
        "content": "<p>Patient Care discussed this today (meeting minutes: <a href=\"https://confluence.hl7.org/display/PC/2021-11-18+Patient+Care+FHIR+Conference+Call\">https://confluence.hl7.org/display/PC/2021-11-18+Patient+Care+FHIR+Conference+Call</a>)</p>\n<ol>\n<li>Log a change request - PC questioned if toxicity is an attribute of the AdverseEvent or medication/substance itself or observed effects of the toxicity?</li>\n<li>Changed to an example binding to a new value set with SNOMED codes, Valueset-adverse-event-outcome - FHIR v4.6.0, but in R4, it was required binding.  ONGOING means symptom has not resolved yet, nor is it recovering.  ONGOING could mean worsening.</li>\n<li>AdverseEvent.resultingCondition has a bodySite for anatomical location.  If AdverseEvent.resultingCondition is extended to also support Observation (when symptom doesn't rise to the level of concern to have a Condition), then Observation also has bodySite. If the location isn't specific to the condition or observation, then log a change request with a specific example</li>\n<li>Similar to above - use the Condition dates or else log a change request with a specific use case / example where those dates are needed at the event level</li>\n</ol>",
        "id": 262003733,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1637276226
    }
]