[
    {
        "content": "<p>We are mapping CCDA Allergy into FHIR. The CCDA specification includes guidance that effectiveTime.high is the \"definitive\" criterion for a clinical status of resolved. Implementers tell us that will not populated, but since it's in the spec, it might, and we think the map should support it. </p>\n<p>We are discussing whether effectiveTime.high would require a FHIR extension or be equivalent to onsetPeriod.end. Either way, onsetPeriod might benefit from clarification: either \"this period represents the time range in which the onset was detected, not the active period of the sensitivity\" or \"this period represents the active period of the sensitivity\".</p>",
        "id": 253320228,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1631651927
    },
    {
        "content": "<p>OnsetPeriod indicates uncertainty about when something started.  E.g. \"Started sometime between 1980 and 1982\".  It does not reflect when the allergy abated.  That's not currently tracked - and is generally not knowable.  You might be able to know that someone was exposed and didn't have a reaction, but is that the abatement date?</p>",
        "id": 253326840,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631654811
    },
    {
        "content": "<p>If you think that's not sufficiently clear, feel free to submit a change request :)</p>",
        "id": 253326941,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631654864
    },
    {
        "content": "<p>If I change the word \"abated\" to \"resolved\", does that change the answer? The use case is the clinical status in Allergy changes for \"active\" to \"resolved\".  How do we / should we capture the time period or dates when  the status was set to resolved?</p>",
        "id": 253737423,
        "sender_full_name": "Ken Lord",
        "timestamp": 1631883435
    },
    {
        "content": "<p>It would be captured in Provenance.  Is this something you feel is commonly captured or used for allergy/intolerance records?</p>",
        "id": 253743074,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631885922
    },
    {
        "content": "<p>You could submit a change request for a candidate core element or extension</p>",
        "id": 253743118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631885943
    }
]