[
    {
        "content": "<p>Dear Patient Care WG<br>\nI have been modelling Conditions for some time now, in different contexts in Denmark. Some of the issues I have solved with the help på this great community.</p>\n<p>However, we have done some evaluations with users of the condition profiles developed.  Users tell us that they cannot use information about a condition without a date, that signifies the last day that the condition (as documented) was last considered  true. For long patient pathways, elderly care, and chronic conditions, this is especially important, because the recorded date or onset might be months or years ago.</p>\n<p>In our earlier discussions with the FHIR community, we were mostly focused on feedback on how to document changes that occured over time.  <a href=\"#narrow/stream/179166-implementers/topic/Condition.20that.20change.20over.20time\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Condition.20that.20change.20over.20time</a> - But, as I remarked, our user evaluation showed that the last asserted date was important regardless of whether the condition changed or not.</p>\n<p>Now, we have progressed to working towards a Condition-profile in dk-core, in context of the Danish HL7 affiliate. We plan to include ConditionLastAssertedDate as an extension. You may see our (unfinished) work her: <a href=\"https://build.fhir.org/ig/hl7dk/dk-core/branches/1.2.0/StructureDefinition-dk-core-condition.html\">https://build.fhir.org/ig/hl7dk/dk-core/branches/1.2.0/StructureDefinition-dk-core-condition.html</a></p>\n<p>I have two questions for the Patient Care WG:</p>\n<ul>\n<li>Is there a more FHIR-compliant alternative to implementing a ConditionLastAsseretedDate extension?</li>\n<li>If not, what is the process if we would like to suggest ConditionLastAsseretedDate as part of the condition ressource or as a standard extension?</li>\n</ul>\n<p>I would like to explain further in one of your conference calls if needed.</p>\n<p>Best regards,<br>\nKirstine</p>",
        "id": 277136749,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1648643663
    },
    {
        "content": "<p>See <a href=\"http://jira.hl7.org/browse/FHIR-31417\">FHIR#31417</a>.  Looks like this concept is coming to R5.  Once it's applied in the R5 model, you could pre-adopt it using the <a href=\"http://build.fhir.org/versions.html#extensions\">inter-version extension mechanism</a>.  If you want to make the relevant pull request against the core specification, that might accelerate the change being made... :)</p>",
        "id": 277170864,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648657818
    }
]