[
    {
        "content": "<p>We need clearer guidance on the boundary between allergy &amp; intolerance. From a lay perspective, \"intolerance\" means that a substance is not tolerated, it does not specify a mechanism, and it is broader than (and encompasses) \"allergy\". It seems that in clinical practice, \"intolerance\" is used specifically for intolerances that are not an allergies, which (in a clinical setting) tend to be co-extensive with \"pharmacologic\" intolerances. I know Russ was interested in expanding that list to specify kinds of intolerances, which would be very useful for an immunologist (though not necessary for general practice, where the Allergy resource is not a specialist tool but a safety flag).</p>\n<p>My current issue: if we have a CDA-based SNOMED code for that does not constrain mechanism (\"propensity to adverse reaction\"), is that the same as the lay meaning of FHIR \"intolerance,\" or, if \"intolerance\" specifically means non-allergic propensity, do we decline to provide a map?</p>",
        "id": 250613627,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629895219
    },
    {
        "content": "<p>AllergyIntolerance.type is optional.  If you don't know which it is, omit that element.</p>",
        "id": 250624526,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629900164
    },
    {
        "content": "<p>Yes.</p>",
        "id": 250643990,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1629908960
    },
    {
        "content": "<p>The underlying assumption I'm hearing is that \"intolerance\" means \"non-allergy intolerance,\" not \"intolerance not otherwise specified.\" True?</p>",
        "id": 250796079,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629993690
    },
    {
        "content": "<p>As per the definitions <a href=\"http://build.fhir.org/valueset-allergy-intolerance-type.html\">here</a>, yes.</p>",
        "id": 250800855,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629995519
    },
    {
        "content": "<p>I don't think \"not judged to be allergic\" means \"judged not to be allergic\"</p>",
        "id": 250801029,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629995574
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span></p>",
        "id": 250801195,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629995638
    },
    {
        "content": "<p>The definitions are clearly intended to be orthogonal.  There's no specialization relationship.  One includes allergic and allergy-like and the other excludes allergic and allergy-like.  The reality is that the determination isn't precise, so something judged to not be allergic may turn out to be and vice versa.</p>",
        "id": 250802585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629996132
    },
    {
        "content": "<p>To close this out, per <a href=\"http://jira.hl7.org/browse/FHIR-33255\">J#33255</a>, PC agreed to clarify the definition of intolerance as follows:<br>\nA propensity for adverse reactions to a substance that <strong>is judged to be not allergic or \"allergy-like\".</strong> These reactions are typically (but not necessarily) non-immune. They are to some degree idiosyncratic and/or patient-specific (i.e. are not a reaction that is expected to occur with most or all patients given similar circumstances).</p>",
        "id": 250851096,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1630017131
    },
    {
        "content": "<p>In the HL7 Allergy DAM the definition of intolerance must mean all reactions that are not an allergic reaction, because there are only two choices.  That is a forced definition which does not correspond to vernacular use.</p>\n<p>To the patient, the one who usually answers the question, \"Are you allergic to anything ?\" The definition of allergy is: something bad happened the last time I was exposed to that substance and I think it is going to happen again if I am exposed again.   To most clinicians who don't really remember many details from the week in school when they studied \"allergic reactions to drugs\", the patient's definition sounds about right.</p>\n<p>The word \"allergy\" was coined in 1904 by Clemons von Pirquet, an Austrian pediatrician, who created the word to describe the reaction (very common at the time) which patients had to injections of horse serum.  Those reactions are now called serum sickness and have very little relationship to any of the \"allergic\" reactions documented in medical records today.</p>\n<p>When penicillins and cephalosporins came into existence in the 1950's and 1960's the type of reaction that was by far the most common was a type of immunologic reaction called a Type I immediate hypersensitivity reaction. The same mechanism that makes some people sneeze from grass or ragweed pollen, have itchy eyes and wheezing around cats, etc.   Some people call that a \"true allergy\", but that concept is meaningless today since it is unrelated to the reaction that Dr Pirquet defined as an allergy and no relationship to the vast majority of reaction types that occur a century later.</p>\n<p>So, outside an allergy textbook and the practice of a physician board certified in allergy and immunology (of which I am one), the definition of allergy is about as precise as that of a patient answering the question \"Are you allergic to anything?\" And intolerance can mean whatever else you want it to.</p>\n<p>Russ Leftwich</p>\n<p>Sent from my iPad</p>",
        "id": 250864005,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1630026584
    },
    {
        "content": "<p>The tactical question I was trying to answer was this: if I translate CDA/SCT \"allergy\" category as FHIR allergy, and SCT \"intolerance\" as FHIR intolerance, what do I do with SCT 'disposition to adverse reaction' (which semantically, in SCT, includes both)? Is it synonymous with \"intolerance\" broadly interpreted, or is \"intolerance,\" as most providers use it, a non-allergy sensitivity, making it narrower than the general SCT \"disposition\" term?</p>\n<p>I.e., A<br>\nAllergy -&gt; allergy<br>\nIntolerane -&gt; intolerance<br>\nDisposition -&gt; intolerance<br>\nor B<br>\nAllergy -&gt; allergy<br>\nIntolerane -&gt; intolerance<br>\nDisposition -&gt; &lt;don't send anything&gt;</p>\n<p>Without trying to solve the immunological or educational issues Russ raises, the solution we voted on (B) matches a perceived and commonly practiced distinction between sensitivities stemming from immune response (and therefore potentially critical) and those stemming from other mechanisms (and usually though not always less critical). This information may or may not be useful, but a lot of people seem to want to record it.</p>\n<p>Is this useful? optimal? tolerable? Is there a better solution?</p>",
        "id": 250963508,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1630084492
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span></p>",
        "id": 251637791,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1630534537
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span>   <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  The problem is per my chat entry above from last week; there is no clear definition of what allergy is and reality is it means a different concept to different people.  Based on that allergy-like is totally undefinable OR everything is allergy-like.  The assumption that clinicians know what is an \"immunologic\" reaction is is an absurdly false assumption.  The reason allergy and intolerance were combined is that 99% of the time the asserter does not know whether it is an allergy or not to someone else, even though it may be to them.   What the ccmbined concept allergy/intolerance means is that it is a propensity to an adverse reaction that is inherent to the individual (patient) and does not occur to most given the same dose.  So, as an example, certain chemotherapy drugs my cause nausea in most patients who receive them.  They do not tolerate that chemotherapy drug well.  We would not call that an allergy/intolerance, because it is true for most patients.  There are certainly drugs that fall into a gray area because it is not unusual for someone to not tolerate a common side effect well.  Nausea from sulfa drugs, as an example.  People who always get nauseated from any sulfa drug are going to insist they are allergic to it and few clinicians are going to take time to argue with them.  It is not immunologic reaction.  It is the reason we added the 'criticality\" element to the Allergy/Intolerance model.  It is low criticality.   Clinically the use of \"allergy-like\" or \"pseudo allergy\" is a significant patient safety risk, as well as having no clear meaning other than to somebody it reminded them of an allergy.  The reason it is a patient safety risk is that it suggests you might treat the reaction LIKE you would treat an allergic reaction and that is not an appropriate way to treat many of these reactions.</p>",
        "id": 251723908,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1630592818
    },
    {
        "content": "<p>Are you suggesting removing the type property from AllergyIntolerance?</p>",
        "id": 251728707,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1630594563
    },
    {
        "content": "<p>FHIR can allow capture of \"this is an allergy\" or \"this isn't an allergy\".  Russ is saying that you can't trust people to fill that in correctly, so be cautious in acting on it.  But given that making the distinction is common practice (and useful), I don't think we can remove the element.</p>",
        "id": 251751039,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630602981
    }
]