[
    {
        "content": "<p>I received a question about how FHIR tracks various 'ports' that have been installed into a patient - drains, catheters, IV lines, arterial lines, etc.  In v3, we would have used 'Access' for these, but I don't think there's an equivalent resource in FHIR (at least not yet).  The specific question is how you track these when transferring a patient, but presumably you'd also want to be able to reference them for things like recording where a particular IV drip should enter, where a specimen came from, etc.  (so <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>, this may also be of interest to Pharmacy).</p>\n<p>The closest we seem to have is Device, but Device doesn't seem to have an ability to indicate where in the patient it's installed. </p>\n<p>Is anyone doing this?  If not, how would you expect to do it if/when you get around to it?</p>",
        "id": 246453123,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626700683
    },
    {
        "content": "<p>On a related note, how do you indicate where an implant or stent has been placed without something like your body site element on Device?</p>",
        "id": 246454525,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626701319
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  I can add these questions to the upcoming PC FHIR conference call on Thursday, but I wonder if DeviceUsage is a possibility since it references both the Device and the BodySite/BodyStructure.  That said, it probably depends on the use case (e.g. request, procedure, or usage).</p>",
        "id": 247278011,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1627343441
    },
    {
        "content": "<p>Patient Care Work Group briefly discussed this topic at the end of our last call and came to the same conclusion that it depends on your use case:</p>\n<ul>\n<li><strong>DeviceUsage </strong>(OO owns) -  use when there is an assertion about an existing device </li>\n<li><strong>ServiceRequest </strong>(OO owns) - use when requesting/ordering a procedure to insert a device</li>\n<li><strong>Procedure </strong>(PC owns) - use when documenting the procedure to insert/implant a device</li>\n</ul>",
        "id": 247921272,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1627911936
    },
    {
        "content": "<p>How would you indicate that a particular port was to be used for a drug administration - or that it was used when extracting a specimen?</p>",
        "id": 247929627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627916415
    },
    {
        "content": "<p>Patient Care had a lengthy discussion about ports yesterday, per <a href=\"https://confluence.hl7.org/display/PC/2021-08-05+Patient+Care+FHIR+Conference+Call\">https://confluence.hl7.org/display/PC/2021-08-05+Patient+Care+FHIR+Conference+Call</a>.  Key takeaways:</p>\n<ul>\n<li>Using a Triple-Lumen Catheter example, we would expect there to be a Device for each of the ports (e.g. proximal, distal, and medial), and those component Devices are part of the overall triple-lumen device.  (OO <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>  should confirm PC's recommendation)</li>\n<li>When ordering a med admin, the order MAY occasionally specify the port by name (e.g. proximal port) -- but this seemed to PC as a potential gap in MedicationRequest since we couldn't locate a Device reference (need Pharmacy <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  to weigh in).  In many cases, the MedRequest doesn't need to specify the port due to policy or clinical knowledge about where to administer (e.g. TPN)</li>\n<li>For MedAdmin documentation, there is a MedicationAdministration.device, <a href=\"http://dosage.site\">dosage.site</a>, and/or bodySite (BodyStructure) extension available.</li>\n<li>For specimen requests, ServiceRequest.supportingInfo can reference the port-specific Device.</li>\n<li>For specimen documentation (e.g. blood draw), Specimen has bodySite, but PC saw a potential gap since we couldn't locate a reference to Device. (need OO <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> <span class=\"user-mention\" data-user-id=\"191969\">@John David Larkin Nolen</span>  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> to weigh in)<br>\nCC: <span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span> <span class=\"user-mention\" data-user-id=\"192135\">@Stephen Chu</span></li>\n</ul>",
        "id": 248648557,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1628273945
    },
    {
        "content": "<p>Good timing! We are chatting about BodyStructure on next Tuesday's OO on FHIR call, including to-from locations that are needed for procedures. <a href=\"https://confluence.hl7.org/display/OO/2021-08-10+FHIR\">https://confluence.hl7.org/display/OO/2021-08-10+FHIR</a> Looping <span class=\"user-mention\" data-user-id=\"297821\">@Marti Velezis</span></p>",
        "id": 248657075,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1628277902
    },
    {
        "content": "<p>Right now the specimen type gets concatenated to describe what was collected with which method from which body site - and even using what approach site (if that is different from the source site) - I think we had discussed adding a reference to procedure to the specimen.collection backbone, but that woudl be to a procedure instance - so sounds like we shoudl consider maybe adding a specimen.collection.deviceType or something like that (I assume you don't need the serial / lot number, but rather need to know what kind of catheter, correct? - and a specimen can be the device itself (not this use case, I know)</p>",
        "id": 248663972,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1628281538
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span>  The picture below might help, but Patient Care was wanting to document which port was used.  A single device (e.g. triple lumen catheter) can have multiple ports.  We were thinking that each port could be represented as a Device component, which share the same parent device per Device guidance.  If OO agrees, then Specimen would ideally reference the component Device (port).</p>\n<blockquote>\n<p>In FHIR, the Device represents either the device in total, or a component of a larger device when there is a need for individual tracking of a component. A Device as a component then points to the parent device it is part of. </p>\n</blockquote>\n<p><a href=\"/user_uploads/10155/lTdUDkk3aSS7rrevR1l2B4ww/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/lTdUDkk3aSS7rrevR1l2B4ww/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/lTdUDkk3aSS7rrevR1l2B4ww/image.png\"></a></div>",
        "id": 248685727,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1628298149
    },
    {
        "content": "<p>We talked about this on the 8/9 Specimen call. OO will add specimen.collection.device to help with this. <a href=\"https://confluence.hl7.org/display/OO/2021-08-09+Specimen\">https://confluence.hl7.org/display/OO/2021-08-09+Specimen</a></p>",
        "id": 248896239,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1628537550
    },
    {
        "content": "<p>And we've already agreed to add a Specimen.collection.procedure element (tracker? - in the queue to be applied).</p>",
        "id": 248898128,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1628538535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> I've added to the Pharmacy agenda for next week.</p>",
        "id": 248907390,
        "sender_full_name": "Melva Peters",
        "timestamp": 1628542871
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  I thought at first you were talking about subcutaneous ports.   I  have been working on a class diagram for central venous  catheters in VANGUARD that I can share with the group when it is complete -- and we do have characteristics including the different parts of the catheter (e.g., tip, cuff, lumen).  If I understand your request - you want to identify which hub/lumen is used  (either for delivery or collection), is that correct?  Do you want to describe it as \"proximal\", \"medial\" or \"distal\"  or are you looking for something more descriptive -- e.g., lumen size, volume , flow rate, etc.)?  </p>\n<p><span class=\"user-mention\" data-user-id=\"191969\">@John David Larkin Nolen</span>  - can you add this to our OO on FHIR agenda?</p>",
        "id": 248920930,
        "sender_full_name": "Marti Velezis",
        "timestamp": 1628550528
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297821\">@Marti Velezis</span> absolutely!</p>",
        "id": 248991012,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1628607697
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297821\">@Marti Velezis</span>   Patient Care was responding to Lloyd's earlier question, so perhaps <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  can elaborate if additional details were needed for his use case (e.g. lumen size, volume, flow rate etc).  When PC discussed his question last week, PC was thinking more along the lines of the port name (e.g. proximal, medial, distal)</p>",
        "id": 249001875,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1628612839
    },
    {
        "content": "<p>I didn't have specific requirements beyond \"where is this sort of thing captured\".  I presume that device properties should be able to handle most of the properties we might be interested in seeing as the solution landed on is Device.</p>",
        "id": 249009599,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628616455
    },
    {
        "content": "<p>Discussed on OO on FHIR call. We can see multiple ways of doing this. One way (like <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  describes) using device properties where you just need to be able to describe the attributes of the device. To address the  scenario when you need to identify a specific part of the device for delivery or collection (such as the brown port), you can use the existing parent-child relationship in the Device resource -- or we could resurrect the DeviceComponent resource.   <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"297821\">@Marti Velezis</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span></p>",
        "id": 249020552,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1628621813
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> can you tell me what the status is on this issue?  Is there a thought that the information needed can be represented in Device?  We don't have this in MedicationRequest, but can add an attribute that references Device (if that is the direction).  We have an attribute that references device in MedicationAdministration (0..*).  We don't believe that that bodysite attribute in MedicationAdministration is the correct place for this information.</p>",
        "id": 254365176,
        "sender_full_name": "Melva Peters",
        "timestamp": 1632316739
    },
    {
        "content": "<p>I think we landed on using a child Device.</p>",
        "id": 254872227,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632605711
    }
]