[
    {
        "content": "<p>What are the plans for an updated IG? There is a lot of interest in this space for limited data set exchanged for the purposes of a referral.</p>",
        "id": 155097608,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1547484767
    },
    {
        "content": "<p>The BSeR IG is being prepared for inclusion in the May 2019 ballot cycle. We have managed to overcome the obstacles associated with integrating the export from Simplifiers into the FHIR continuous build process.  We have until March 10 to resolve the ~32 identified publication errors. At the same time, we are still working to finalize content. We intend to present the final content as a preview to the PHWG on March 14 and final approval on March 21. </p>\n<p>One of the biggest issues left over from the prior ballot cycle was the resolution of a ballot comment from <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> who noted that we were completely silent with regard to any information about workflow and which of the FHIR information exchange frameworks were intended for use. To address that defect we have adopted the FHIR messaging framework for this iteration of the ballot. The messaging framework was successfully implemented in the January 2019 HL7 and IHE connect-a-thons and demonstrated in the HIMSS Interoperability Showcase. </p>\n<p>The following page (<a href=\"http://bit.ly/2tMX3s8\" target=\"_blank\" title=\"http://bit.ly/2tMX3s8\">http://bit.ly/2tMX3s8</a>) has been added to the BSeR FHIR IG to provide the rationale behind the choice of FHIR messaging for BSeR and to outline the trigger events, state transitions, and state machines that govern the values used as event, reason, and response codes in the message header.  The instance examples used in the HIMSS interoperability showcase will be used a reference implementation accessible from the newly added Notice to Implementers page.</p>",
        "id": 159833177,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1551591825
    }
]