[
    {
        "content": "<p>If a server supports more than one version of FHIR I think the expectation is that a resource should be representable in any supported version so long as that resource type existed in the requested version.</p>",
        "id": 153958446,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1526131557
    },
    {
        "content": "<p>If a server stores data in a FHIR agnostic format and always converts to the requested format, then this is simple to achieve, but it may be difficult if the server stores data in a FHIR-specific format (this would require conversion from one version to another), perhaps using FML.</p>",
        "id": 153958447,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1526131656
    },
    {
        "content": "<p>If a server cannot represent a resource in a particular version, perhaps the server should return an operation outcome with an error message that indicates this.</p>",
        "id": 153958448,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1526131751
    },
    {
        "content": "<p>That expectation can only hold if the resource is convertable between versions - which is usually the case, but not always for STU resources</p>",
        "id": 153958475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526134054
    },
    {
        "content": "<p>Do you have any examples of cases where the resource exists in two versions but can't reasonably be converted between them?</p>",
        "id": 153958477,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1526134127
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> can speak to that better than I as he's had to worry about transforms.  I know there were some cases with R2-&gt;R3.</p>",
        "id": 153958492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526134661
    },
    {
        "content": "<p>lots of cases. elements that the committee's ideas just changed, and I couldn't think that there was any way to transform between them</p>",
        "id": 153958500,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526135089
    },
    {
        "content": "<p>Perhaps we can tag resources where the representation is suspect with 'SUBSETTED', but rules around when to apply that aren't immediately obvious to me.</p>",
        "id": 153958992,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1526160865
    },
    {
        "content": "<p>no agree</p>",
        "id": 153959300,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526192839
    },
    {
        "content": "<p>From 2=&gt;3 Practitioner resource was split into Practitioner and PractitionerRole resources, but the data is able to be converted bi-directionally ok, however they look different. So don't think Subsetted would apply here.</p>",
        "id": 153959548,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1526205248
    },
    {
        "content": "<p>Valueset had CodeSystem split out in a similar way too.</p>",
        "id": 153959549,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1526205273
    }
]