[
    {
        "content": "<p>TSC has pushed review and improvement of a precept to clarify governance of <a href=\"https://confluence.hl7.org/display/SGB/Change+in+Static+Bound+Value+Sets\">any change in a static bound valueset</a>. This was initially discussed on the <a href=\"https://confluence.hl7.org/display/TSC/TSC+e-Vote+2021-10-11\">SC e-Vote 2021-10-11</a> and you can tell by the comments that it would be best if TSMG took this on. TSC has requested TSMG define a precept for this and send it back to TSC. Note there are comments on the precept proposal page also.</p>",
        "id": 258988087,
        "sender_full_name": "Robert McClure",
        "timestamp": 1635180948
    },
    {
        "content": "<p>What do you mean by \"static bound valueset\"?  That's not a terminology we use in FHIR.  If you mean a version-specific valueset binding, then I guess I agree, though there are some subtleties here.  When in edit mode, I can change the contents of an extensional valueset 50 times.  It only gets a new 'version' when I officially publish it as a release.  I.e. we don't version stuff in the CI-build.</p>",
        "id": 259003725,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635187902
    },
    {
        "content": "<p>Also, if the value set reference is not version-specific, then there's no need to re-version the referencing resource when the referenced valueset changes.</p>",
        "id": 259003826,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635187945
    },
    {
        "content": "<p>I agree it does not make much sense. Look at the link I included above. This came from old SGB work that we need to clean up.</p>",
        "id": 259137707,
        "sender_full_name": "Robert McClure",
        "timestamp": 1635271736
    },
    {
        "content": "<p>I did look at the link.  My concern is that the terminology used in the precept doesn't reflect the language we use in our standards</p>",
        "id": 259150959,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635277613
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Again we agree. I added a comment to that effect. Please provide the text for the precept that we can propose back to TSC. I'm hoping we can make that text apply to any product family. Can you help?</p>",
        "id": 259250046,
        "sender_full_name": "Robert McClure",
        "timestamp": 1635345838
    },
    {
        "content": "<p>What is your objective with the precept?</p>",
        "id": 259253282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635347010
    },
    {
        "content": "<p>To be clear, this is not \"my precept\" it is something old from SGB. My understanding is that the concern is that if a standard changes a Static (or required for FHIR) binding, the standard should have a version change to help identify the breaking change that occurred. I sense you would not define something this specific and reply upon version change for breaking change and just note that this is an example of a breaking change?</p>",
        "id": 259259932,
        "sender_full_name": "Robert McClure",
        "timestamp": 1635349520
    }
]