[
    {
        "content": "<p>Unless there is objection (+ another suggestion)  I would like to propose use of this stream to support the Terminology Services Connectathon track.  Is this a bad idea?  I do not anticipate this would be a high-volume set of messages.  Thoughts, anyone?</p>",
        "id": 260265452,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1636030784
    },
    {
        "content": "<p>Previously we've done this in the terminology stream, <span class=\"user-mention\" data-user-id=\"340004\">@Davera Gabriel</span>  And I think that's still going to be a better place for it overall.  TSMG is too specific to this governance group - <a href=\"#narrow/stream/179202-terminology\">terminology</a> stream covers \"all things terminology\", including the terminology services Connectathon track.  I think it would make sense to create a new topic specifically for the Terminology Services Connectathon track that will be ongoing and not specific to a particular Connectathon (like Connectathon 29 in Jan 2022).  We've done that in some of the other tracks.</p>",
        "id": 260280938,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1636037643
    },
    {
        "content": "<p>ok:  that's good input <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  I wasn't thinking it should have its own stream, as this would mean folks would have to subscribe to it, but you are suggesting a dedicated topic within the Terminology stream would hit the right balance?</p>",
        "id": 260315439,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1636051094
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"340004\">@Davera Gabriel</span>  Yes, that's what I was suggesting.  But of course that isn't the only possible way we can do it.</p>",
        "id": 260316814,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1636051749
    },
    {
        "content": "<p>Typically, management groups are responsible for oversight, not for development of content nor for implementation testing.  So agree that a stream under <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a> would be better.</p>",
        "id": 260349441,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636069158
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> In general not disagree with where the material is normally developed, but CMG is in charge of IAT, FMG is in charge of Connectathon, and we're figuring out what aligns for TSMG WRT to education and outreach. So for now, this lives with TSMG.</p>",
        "id": 260441602,
        "sender_full_name": "Robert McClure",
        "timestamp": 1636135088
    },
    {
        "content": "<p>This seems like a great agenda item for a TSMG meeting.  Meanwhile, a little heads-up... an additional track activity bubbled-up today in the TINKAR call.  There's an interest in testing out utilization of the SSSOM specification (<a href=\"https://github.com/mapping-commons/sssom\">https://github.com/mapping-commons/sssom</a>) as a TINKAR template.  This rather focused activity may well result in attracting some significant individuals from the computational / OWL / OBO ontology community.  Could be a nice intro for them with a focused, achievable outcome. I'll add it to the track proposal and answer any questions here and the stream where we end up with these topics.</p>",
        "id": 260471030,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1636150351
    }
]