[
    {
        "content": "<p>Wondering if it is possible to associate a MedicationAdministration with a specific MedicationStatement, i.e. associating recently administered doses with a medication list stored as a series of MedicationStatements? Thanks</p>",
        "id": 194861311,
        "sender_full_name": "Tim Blake",
        "timestamp": 1587503043
    },
    {
        "content": "<p>It's not possible right now other than as an extension (probably on the request attribute).  We have had others ask about that requirement, so we should create a change request to look into it.</p>",
        "id": 194871726,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1587509552
    },
    {
        "content": "<p>If the list of medications is not any sort of authority or plan to take the medication, just a report of activity or intent, putting the extension on MedicationAdministration.request seems quite wrong.</p>",
        "id": 194890159,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1587533999
    },
    {
        "content": "<p>I think in that case it should be on MedicationAdministration.</p>",
        "id": 194890284,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1587534148
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> I have a medication list, where I'd like to also record the most recent administration alongside each MedicationStatement in the list.  Do you think I should reference from MedicationStatement to the MedicationAdministration or the other way round?</p>",
        "id": 195000025,
        "sender_full_name": "Tim Blake",
        "timestamp": 1587595291
    },
    {
        "content": "<p>It's somewhat odd to link from an administration to a statement rather than to a MedicationRequest.  MedicationRequest is the order.  MedicationStatement is just a summary statement of what the patient is believed to be taking (or in some cases not taking).  Having to update the MedicationStatement every time there's an administration seems painful.  You could link each MedicationAdministration to the MedicationStatement with an extension and then query to find the most recent one, though that's not super pleasant either.</p>",
        "id": 195005918,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587600338
    }
]