[
    {
        "content": "<p>This is on the Vulcan/RWD stream but I wanted it to have a wider audience:</p>\n<p>*US Core recommends that an “active” medication list can be obtained using only the MedicationRequest resource. However the reference implementation for this RWD track is looking at various test servers and we can see that different approaches have been followed on different servers. Some indeed follow US core while others make much greater use of MedicationStatement. It would be very helpful to have Vendor opinions on the adequacy of US Core recommendations for collecting concomitant medication information for subjects on a clinical trial.<br>\nThanks - Hugh*</p>",
        "id": 221701401,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1609880666
    },
    {
        "content": "<p>We have an ongoing national project in Belgium around this. With input so far, I am still of the opinion that we should NOT use only medicationrequest to capture a patient's \"active\" \"medication\" \"list\".</p>",
        "id": 221703263,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609881654
    },
    {
        "content": "<p>IHE Pharmacy has an ongoing work item, for a more standardized approach to this, and also there I don't see why we'd stick to MedicationRequest</p>",
        "id": 221703667,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609881899
    },
    {
        "content": "<p>Fully agree with you.  What I'm trying to establish is what <strong>vendor </strong>systems <strong>actually</strong> do.</p>",
        "id": 221704168,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1609882167
    },
    {
        "content": "<p>We don't have vendors in Belgium using FHIR medication lists in prodution (is there any?). We have a local standard, and that standard is closerto MedicationUsage than MedicationRequest. When we move to FHIR, vendors will adopt what the standard advises, I guess. But what I heard is pretty consistent</p>",
        "id": 221704544,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609882342
    },
    {
        "content": "<p>The Pharmacy Work Group has an active project to develop best practices and implementation guidance on creating Medication Lists for different contexts or use cases.  We include all resources that may be appropriate for the use case - MedicationRequest, MedicationDispense, MedicationUsage (aka MedicationStatement) and MedicationAdministration.  We have recommended to US Core that they consider including MedicationUsage back in in a future release and support both resources.</p>",
        "id": 221719259,
        "sender_full_name": "Melva Peters",
        "timestamp": 1609891586
    }
]