[
    {
        "content": "<p>I am interested in inpatient medication dispense.<br>\nHow to express a dispensation which would be the accumulation of individual dispensations corresponding for example to such a drug for the patients of such a ward unit for the next 2 days?<br>\nI would expect to have a MedicationDispense resource that refers to the K individual MedicationDispense (K being the number of patients present in the ward unit). I can't find the MedicationDispense element that would carry the reference to K individual MedicationDispense.</p>",
        "id": 264022081,
        "sender_full_name": "Olivier Boux",
        "timestamp": 1638893048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 264022879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638893318
    },
    {
        "content": "<p>If you are dispensing drugs for many patients, that is not a Dispense,  that is a SupplyDelivery</p>",
        "id": 264036760,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1638897938
    },
    {
        "content": "<p>A SupplyDelivery cannot reference some authorizingPrescription and yet, this is the case. Shall I build a SupplyRequest from those MedicationRequest and dispensing rules to address this thread? Which is not possible either.<br>\nIt is mentionned in 12.21.2 Boundaries and Relationships </p>\n<ul>\n<li>The SupplyRequest resource is used for inventory management. When requesting medication, substances and devices when there is a patient focus or instructions regarding their use, DeviceRequest or MedicationRequest should be used instead.</li>\n</ul>\n<p>That's the reason why I'm investigating dispense instead of supply in the use case 'medication dispense with global delivery'</p>",
        "id": 264044419,
        "sender_full_name": "Olivier Boux",
        "timestamp": 1638900073
    },
    {
        "content": "<p>If you've got a prescription for many patients, then handle that as a prescription for a Group, and you could have a single dispense for the group.</p>",
        "id": 264069576,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638910249
    },
    {
        "content": "<p>I don't agree with using a Dispense with a Group, because this is not the dispense.  This is an activity prior to dispense</p>",
        "id": 264220242,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1638997525
    },
    {
        "content": "<p>Ward stock preparations can be for <br>\na) \"patients A, B, C\" or <br>\nb) \"whoever is in ward B tomorrow\" .</p>",
        "id": 264220425,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1638997627
    },
    {
        "content": "<p>Concretely: If you prepare 45 tablets for 15 patients, this is not a dispense</p>",
        "id": 264220478,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1638997656
    },
    {
        "content": "<p>The dispense is when the ward nurse takes 2 tablets and assigns it to Patient 1.</p>",
        "id": 264220648,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1638997733
    },
    {
        "content": "<p>This definition of Dispense was provided by a colleague and is used in IHE and ISO 19293. Of course <span class=\"user-mention\" data-user-id=\"212052\">@Olivier Boux</span> you can follow this definition or not but I wouldn't want to end up with two separate flows - one for \"nominal dispenses\", and one for \"global distribution\". I know it's what you have in SIPh, but not having a standard workflow complicates matters (traceability, inventory) quite a bit.</p>",
        "id": 264220963,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1638997920
    },
    {
        "content": "<p>Thank you very much for ISO definition of  Dispense. I missed it.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179249-Medication/topic/batched.20inpatient.20medication.20dispense/near/264220963\">said</a>:</p>\n<blockquote>\n<p>but not having a standard workflow complicates matters (traceability, inventory) quite a bit.</p>\n</blockquote>\n<p>I agree with you. That's the reason why I'm looking at a FHIR solution to the french medication inpatient workflow.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179249-Medication/topic/batched.20inpatient.20medication.20dispense/near/264220478\">said</a>:</p>\n<blockquote>\n<p>Concretely: If you prepare 45 tablets for 15 patients, this is not a dispense</p>\n</blockquote>\n<p>I agree too. But in order to prepare those 45 pills, I have to take care of those 15 patients and those 45 pills delivered-not-dispensed are indeed in relation to the 15 prescriptions.</p>\n<p>So I do have</p>\n<ul>\n<li>a material flow of 45 tablets: <strong>what FHIR resource to track this material flow?</strong> and</li>\n<li>a stream of 15 pieces of information to tell what was actually delivered to meet those 15 requirements over a given period of time.</li>\n</ul>\n<p>I don't care if I have a FHIR resource that wraps these two streams or two totally separate streams (but not really independent at the source level). This is the FHIR specifications. The French will deal with it.</p>",
        "id": 272149089,
        "sender_full_name": "Olivier Boux",
        "timestamp": 1645032668
    },
    {
        "content": "<p>Ravi de se retrouver, <span class=\"user-mention\" data-user-id=\"212052\">@Olivier Boux</span> :)</p>\n<blockquote>\n<p>ISO definition of Dispense</p>\n</blockquote>\n<p>Courtesy of Ann Slee in 2010 :)</p>\n<blockquote>\n<ul>\n<li>a material flow of 45 tablets: <strong>what FHIR resource to track this material flow?</strong> </li>\n<li>a stream of 15 pieces of information to tell what was actually delivered to meet those 15 requirements over a given period of time.</li>\n</ul>\n</blockquote>\n<p>We have SupplyRequest and SupplyDelivery. As you'll see, SupplyDelivery tracks the expected flow and/or delivery. With the appearance of the Transport resource, we may resolve any ambiguity.</p>",
        "id": 272165953,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645039694
    },
    {
        "content": "<p>One thing missing (until r5) was the notion of Consumption. We can handle that now with InventoryReport (with countType=differential)</p>",
        "id": 272166157,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645039775
    },
    {
        "content": "<blockquote>\n<p>I don't care if I have a FHIR resource that wraps these two streams or two totally separate streams (but not really independent at the source level). This is the FHIR specifications. The French will deal with it.</p>\n</blockquote>\n<p>Why not the French with / within IHE? <br>\nWe are going through that as we speak. I've seen your specifications, and as expected, I'm getting inspired by that. We can make sure that IHE's handling of workflow is of use, create robust international guidance and handle the French-specific considerations on the French layer.</p>",
        "id": 272166581,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645039935
    },
    {
        "content": "<p>OK, let's use SupplyDelivery for our delivery of 45 tablets.<br>\nI can't reference the initial 15 MedicationDispense because basedOn is forced to reference a SupplyRequest resource. I would like to reference all 15 MedicationDispense.<br>\nAssuming this is done, this is a split delivery. I need to reference the time period covered by this delivery occurrence. I guess I will use the element occurence[x]:occurencePeriod.</p>\n<p>This seems like a good idea.<br>\nIt just lacks the notions of whenPrepared and whenHandedOver.</p>",
        "id": 272850893,
        "sender_full_name": "Olivier Boux",
        "timestamp": 1645556456
    },
    {
        "content": "<p>If you're conveying drugs that are specific to a patient, you need to use MedicationDispense, not SupplyDelivery.  For meds, SupplyDelivery is <em>only</em> for managing transport of drugs that aren't patient-specific.  E.g. replenishing ward stock.</p>",
        "id": 272864207,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645562868
    },
    {
        "content": "<p>the case is for a batch of medication for 15 patients</p>",
        "id": 272907820,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645595637
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"212052\">@Olivier Boux</span> we could <br>\na) add whenPrepared and whenHandedOver,<br>\nb) add an event code above occurrence[x] so that we can say 1. what happened and 2. when did it happen</p>",
        "id": 272907926,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645595750
    },
    {
        "content": "<p>i'd like b) more because I don't know if there's a clear-cut definition of whenPrepared (for example).</p>",
        "id": 272907986,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645595795
    },
    {
        "content": "<p>\"preparing\" can be breaking tablets or preparing the batch. perhaps others</p>",
        "id": 272908019,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645595851
    },
    {
        "content": "<p>Is the medication targeted to specific patients to satisfy an order, or is it being supplied to an organization who cares for 15 patients, some of whom might need the medication at some point.  In the first case, I'd expect that to be a MedicationDispense for the group or a set of MedicationDispenses for the individuals.</p>",
        "id": 272955721,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645626587
    },
    {
        "content": "<p>it is to satisfy 15 orders: the system knows that there are 15 orders with that drug, so anticipates the stock, referring to the 15 orders.</p>",
        "id": 272964632,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645630388
    },
    {
        "content": "<p>Perhaps the assumption \"if it has the patient name on it, it is a Dispense\" should be further clarified. <br>\nI'm relying on the fact that Dispense is when a drug is assigned to a Patient. Before and after that there is maybe transport, supply, but no dispense.<br>\n(we could still use a MedicationDispense resource to track everything after the Dispense act, but that is another question)</p>",
        "id": 272966401,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645631113
    },
    {
        "content": "<p>From pharmacy to ward is still a dispense if it's for a specific patient.  Dispense isn't only \"to the patient's hands\".  Feel free to submit a change request if the current language isn't clear enough.</p>",
        "id": 272966618,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645631195
    },
    {
        "content": "<p>yes, I think the point here is that this one bulk sending is for 15 patients</p>",
        "id": 272973549,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645634004
    },
    {
        "content": "<p>or better, it is because of 15 patients</p>",
        "id": 272973577,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645634016
    },
    {
        "content": "<p>to clarify the above, dispense is indeed not  only to the patient's hands. Dispense is first point of assignment to a specific patient - e.g. packing multidose in named bags (even it later it will be transported and given to patient caregiver), picking from ward stock to patient (even if before it was transported but it was bulk), setting aside ingredients to make a patient's compound medication (even if the ingredients will not be delivered as is).</p>",
        "id": 272974115,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645634252
    },
    {
        "content": "<p>I'll let the pharmacy folks argue more :)</p>",
        "id": 272974466,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645634397
    },
    {
        "content": "<p>Right, I was expressing the underlying definition to the point above. It's the only solid definition of Dispense I've seen. If definition of Dispense is changing needed, then there's no technical solution possible.</p>",
        "id": 272975533,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645634850
    },
    {
        "content": "<p>@pharmacy folks, please consider this for input: <br>\nfrom IHE where we've exhausted lots of workflows until a proper definition arrived, from ISO where this was an issue as well, the definition of Dispense may cause issues - depends if Pharmacy looks at workflows and supply matters. If so, please consider capturing this or another single definition of a \"dispense\"</p>",
        "id": 272976168,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645635128
    },
    {
        "content": "<p>I'm not sure I understand the use case.  If I go back to Oliver's first question it sounds like you want to group a bunch of dispenses for 15 patients together.  Is that true?  You are doing 15 individuals dispenses  for 15 patients and sending them to the ward and then you want to group them together somehow?</p>",
        "id": 273024085,
        "sender_full_name": "Melva Peters",
        "timestamp": 1645657215
    },
    {
        "content": "<p>Before we start discussing changes or other options, I want to make sure the use case is clear</p>",
        "id": 273024172,
        "sender_full_name": "Melva Peters",
        "timestamp": 1645657249
    },
    {
        "content": "<p>There would be 2 cases. </p>\n<ol>\n<li>We make individual dispenses for 15 patients fir 2 days, in 15, 30 or 90 sachets, and we want to send that bunch of sachets to the ward</li>\n<li>We know that those 15 patients require 45 medications, so we send 45 tablets in a box and we send the box</li>\n</ol>",
        "id": 273055928,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645688153
    },
    {
        "content": "<p>I think Olivier's use case is #1</p>",
        "id": 273055976,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645688173
    },
    {
        "content": "<p>as for the link to the prescription: in an implementation we were blocked by that until we realized that prescription is not the same as dispense request. A prescription says \"drugs for 2 weeks\", a dispense request says \"dispense only for 2 days\".</p>",
        "id": 273056131,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645688361
    },
    {
        "content": "<p>I don't know if FHIR wants to address that or if we'd need to use SupplyRequest to cover the gap.</p>",
        "id": 273056184,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645688406
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191759\">Melva Peters</span> <a href=\"#narrow/stream/179249-Medication/topic/batched.20inpatient.20medication.20dispense/near/273024085\">said</a>:</p>\n<blockquote>\n<p>it sounds like you want to group a bunch of dispenses for 15 patients together.  Is that true?  You are doing 15 individuals dispenses  for 15 patients and sending them to the ward and then you want to group them together somehow?</p>\n</blockquote>\n<p>That's exactly it.<br>\nThe 15 prescriptions do not have the same dosages. It is not a grouped prescription for 15 people (the same prescription x 15).</p>",
        "id": 273061057,
        "sender_full_name": "Olivier Boux",
        "timestamp": 1645692422
    },
    {
        "content": "<p>What is the reason you need to group the dispenses.  They would be individual MedicationDispenses done against individual MedicationRequests.  Each dispense would be labelled for a specific patient, correct?</p>",
        "id": 273175846,
        "sender_full_name": "Melva Peters",
        "timestamp": 1645754746
    }
]