[
    {
        "content": "<p>We were loocking to <a href=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/\">https://build.fhir.org/ig/HL7/fhir-order-catalog/</a> for creating a medication catalog model and we noticed that in model the item (catalogentry) is referecing to a medicationKnowledge, in case of we use this model, how we can link a Medication Request to these medicationKnowledge that we obtain from the catalog?</p>",
        "id": 189722237,
        "sender_full_name": "Patricia Almeyda Polanco",
        "timestamp": 1583347799
    },
    {
        "content": "<ol>\n<li>Currently medicationrequest mentions a Medication resource, which shares a code with the medicationKnowledge. So you indicate the code, and this code is available in your catalog</li>\n</ol>",
        "id": 189724449,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583349185
    },
    {
        "content": "<p>(personally I think that we should link by code and/or reference, but the code should always be one of the link between Medication and the catalog entry which is a MedicationKnowledge)</p>",
        "id": 189724619,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583349308
    },
    {
        "content": "<ol start=\"2\">\n<li>I think the CatalogEntry is being removed, but <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> or others can advise?</li>\n</ol>",
        "id": 189724626,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583349312
    },
    {
        "content": "<p>ping <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> for additional insight</p>",
        "id": 189724645,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583349326
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , but in our case we are not using the code to link medication and medicationknowledge,  we are using the medication reference in asociated medication field of medicationknowlege, so we are not sure how to use this  medication catalog  model</p>",
        "id": 189727038,
        "sender_full_name": "Patricia Almeyda Polanco",
        "timestamp": 1583350843
    },
    {
        "content": "<p>I think that is not complete. If associatedMedication is supposed to establish the relation to medications, it should clarify what type of relation. Saying \", if the medication is a branded product (e.g. Crestor), this is the Therapeutic Moeity (e.g. Rosuvastatin)\" seems insufficient.</p>",
        "id": 189727463,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583351117
    },
    {
        "content": "<p>there is not just 2 or 3 \"levels\" of medication and the relations are not simple.</p>",
        "id": 189727612,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583351196
    },
    {
        "content": "<p>but on your question: \"how we can link a Medication Request to these medicationKnowledge\":<br>\nI think the answer remains: The medication catalog will contain medicationKnowledge resources. A medicationRequest will contain a medication code (which you can then lookup in the list of MedicationKnowledge) or it can refer to a Medication resource which has a code (which you can then lookup in the list of MedicationKnowledge)</p>",
        "id": 189727893,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583351377
    },
    {
        "content": "<p>I think that Medication resource should have a property which is \"the definitional resource where this medicine is formally defined\".</p>",
        "id": 189728032,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583351436
    },
    {
        "content": "<p>The Catalog model is just an aggregation model, it provides a way to \"compose\" a catalog out of the definitional resources. If the question is about referring to a definitional resource from a MedRequest, the answer is the same whether you are using a formal \"catalog\" or just a bunch of MedicationKnowledge resource on the server</p>",
        "id": 189728207,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583351528
    },
    {
        "content": "<p>I agree with almost everything Jose says (except for the back reference from Medication to MedicationKnowledge <em>grin</em>).  MedicationRequest uses either the code or a reference to a Medication resource that will contain the code.  That code can be used to lookup the medicationKnowledge associated with the MedicationRequest.<br>\nIf you are going to other way, then you would start with a MedicationRequest, you could use the associatedMedication to find a specific Medication resource and then use that in the MedicationRequest.  Or you could just grab the specific code from the MedKnowledge and use that in the MedRequest.</p>",
        "id": 189735473,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1583356386
    },
    {
        "content": "<p>:) you mean the suggestion to have a property to the definitional resource? <br>\nThat is a generic remark for having things easier to govern. It's not a \"must\", rather a \"why not\". But not blocking for this.</p>",
        "id": 189739814,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583358848
    },
    {
        "content": "<blockquote>\n<p>you could use the associatedMedication to find a specific Medication resource</p>\n</blockquote>\n<p>I don't read that from what the spec says. What I read from the spec is more: if MedKnowledge defines Advil, the associatedMedication points to ibuprofen (and vice-versa) &lt;-- this does not feel right</p>",
        "id": 189740130,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583359063
    }
]