[
    {
        "content": "<p>I'm pondering how to model an IV solution order in FHIR.</p>\n<p>In v2, we would have orders like the following:</p>\n<div class=\"codehilite\"><pre><span></span>RXE|^Continuous^^20180731170000^^STAT^^|^PANTOPRAZOLE INFUSION^ADS^^^^^^pantoprazole (use for PROTONIX) 80 mg in sodium chloride 0.9 % 100 mL (0.8 mg/mL) infusion|8||43^mg/hr|||||2|Each||AA000001^TESTDOCTOR^JOHN^Q^||||||||||10|mL/hr|0.8|3^mg||||STANDARD|^use for PROTONIX||1|1^mL||||||main^CENTRAL PHARMACY\nRXR|IV^Intravenous\nRXC|A|05613^PANTOPRAZOLE 40 MG INTRAVENOUS SOLUTION^ADS|80|mg|2|Each|^use for PROTONIX\nRXC|B|00407^100 ML BAG : SODIUM CHLORIDE 0.9 % INTRAVENOUS SOLUTION^ADS|80|mL|1|FCzZ\n</pre></div>\n\n\n<p>In this example (assuming I'm understanding it correctly), we have an order for an uncoded medication (PANTOPRAZOLE INFUSION) that consists of two order-specific amounts of things. In this case it's 2x40mg bags of pantoprazole, and 0.8x100mL bag of saline.</p>\n<p>I may be missing something, but the medication model seems too simplistic to model this. We have MedicationRequest.medication[x] which is 1..1 and probably has to be just the text of \"PANTOPRAZOLE INFUSION\". We then have the two components, each of which are coded and have different amounts. My initial gut feeling (pardon the pantoprazole pun!) was to put them into MedicationRequest.dosageInstruction but there is no spot of a medication code in there.</p>\n<p>This problem gets seems to only get worse for orders where there are two medicinal components and not just medicine+saline.</p>",
        "id": 157631807,
        "sender_full_name": "James Agnew",
        "timestamp": 1549393915
    },
    {
        "content": "<p>in the above order, you have a MedicationRequest with one medication, which is Pantoprazole Infusion.</p>",
        "id": 157632310,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549394228
    },
    {
        "content": "<p>if \"Pantoprazole infusion\" is a well-known product or preparation in your site, you could stop at that.</p>",
        "id": 157632365,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549394279
    },
    {
        "content": "<p>if, from what I read, you want to capture the composition, you would point to a Medication resource (contained or not, depends if your formulation is in a catalog or not)</p>",
        "id": 157632472,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549394342
    },
    {
        "content": "<p>and that Medication called Pantoprazole Infusion has 2 ingredients, pantoprazole and saline.</p>",
        "id": 157632516,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549394377
    },
    {
        "content": "<p>of course saline has also several ingredients as well as the pantoprazole you are using, but I believe the idea is to stop at whatever level you know that the other party will recognize that medicinal product</p>",
        "id": 157632668,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549394458
    },
    {
        "content": "<p>possible the name medication.ingredient is not the best for this use. and also not \"strength\" which for this case should be amount or something.</p>",
        "id": 157632794,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549394533
    },
    {
        "content": "<p>But my suggestion above is what I recall being told by <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> in a recent WGM, after having the same question in IHE.</p>",
        "id": 157632846,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549394585
    },
    {
        "content": "<p>perhaps things have changed, in which case <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> can bring some insight. I would say technically the requirement can be met - but perhaps we could review the naming of the elements, leaving the medication ingredient to express formulations, and putting medication chemical composition to medicationKnowledge.</p>",
        "id": 157632983,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549394688
    },
    {
        "content": "<p>The contained resource is actually the exact solution we arrived at, but I have to say that this feels like a bit of a hack. Ultimately we have two well-known and coded items being delivered as a single order (without a \"master code<br>\n\" to convey the overall product and we can't convey any of this without resorting to contained. My gut feeling is that the amounts of the two ingredients are properties of the order and not properties of the medication, so shoehorning them into the medication feels like the wrong spot.</p>\n<p>I should probably qualify this with a disclaimer that I'm a techie and certainly have no pharmacy training so maybe this is just the way things are done. The use case here incidentally is creating a multi-organization research database, so locking valuable information up in contained resources also dramatically decreases its utility.</p>",
        "id": 157657682,
        "sender_full_name": "James Agnew",
        "timestamp": 1549417534
    },
    {
        "content": "<p>It's not a hack.  You're defining an on-the-fly medication compound.  You represent it the same way whether it's a standard product or something specific to a particular order or dispense - as a Medication.  You have a form, you have ingredients, you might have mixing instructions, etc.</p>",
        "id": 157662393,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549424354
    },
    {
        "content": "<p>If the medication is defined \"on the fly\" then it'll be contained.  If it's a standard recipe sitting in a formulary, it'll be by reference.  The structure and processing will be identical.</p>",
        "id": 157662460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549424423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> Medication can handle your use case easily as well as more complex compounds.  Within Medication there are 0..* ingredients that are used to include the different ingredients within the compound solution.  There are a series of examples on how to represent including this one <a href=\"http://build.fhir.org/medicationexample0317.xml.html\" target=\"_blank\" title=\"http://build.fhir.org/medicationexample0317.xml.html\">http://build.fhir.org/medicationexample0317.xml.html</a>.  There may be situations where a compounded product is given an identifier as it is prepared often, but in many cases it is defined on the fly as <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> says based on the order at the time.<br>\nCheck out the examples and see if they work.  Also check out the medicationRequest examples that include contained medications.</p>",
        "id": 157700340,
        "sender_full_name": "Melva Peters",
        "timestamp": 1549468552
    },
    {
        "content": "<p>Thanks for the input all. Perhaps I need to get over my hangup about contained resources. I've seen them misused so many times that I have a gut reaction of \"you're doing this wrong\" when I need to use one.</p>",
        "id": 157715282,
        "sender_full_name": "James Agnew",
        "timestamp": 1549479385
    },
    {
        "content": "<p>It's not a bad gut reaction. :)  In this case, the medication description really does live in the prescription or dispense and isn't independently searchable.</p>",
        "id": 157718482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549481600
    }
]