[
    {
        "content": "<p>What's the best way to include this information in FHIR? Would love to put it on Medication, but it seems like MedicationKnowledge is the \"right\" place.</p>",
        "id": 275662802,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647528065
    },
    {
        "content": "<p>MedicationKnowledge is pretty non-normative (why isn't all that info just in Medication)?</p>",
        "id": 275662857,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647528088
    },
    {
        "content": "<p>Medication reflects the set of information typically passed around (and stored) when prescribing/dispensing/administering.  \"Registry\" type information lives in MedicationKnowledge.</p>",
        "id": 275672878,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647531624
    },
    {
        "content": "<p>This information would go in MedicationKnowledge.regulatory.schedule</p>",
        "id": 275722514,
        "sender_full_name": "Melva Peters",
        "timestamp": 1647549486
    },
    {
        "content": "<p>Isn't the schedule of the drug an important aspect of prescribing?</p>",
        "id": 275736545,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647556107
    },
    {
        "content": "<p>I'm still confused on why MedicationKnowledge is a separate thing. Is it just that Medication is MedicationKnowledge lite? Keep Medication nice and fit and sleek and offload the rest to the meatier resource?</p>",
        "id": 275737184,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647556496
    },
    {
        "content": "<p>All the things in MedicationKnowledge seem like characteristics of a Medication so I can't think of another reason</p>",
        "id": 275737228,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647556524
    },
    {
        "content": "<p>The reason I ask - we are parsing NCPDP into FHIR. We have the DEA Schedule as a data element in NCPDP. We don't want to generate a whole MedicationKnowledge just to store this info.</p>",
        "id": 275737316,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647556582
    },
    {
        "content": "<p>The scope of the Medication resource is to identify a particular Medication for the purposes of prescribing, dispensing, or administering.  Although you may need to know the DEA schedule when you are prescribing, you do not need to convey that information when you are sending the prescription/dispense/administration details from one system to the other.  That is why it is not included in Medication.</p>",
        "id": 275737367,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1647556626
    },
    {
        "content": "<p>It's odd that the NCPDP does just that, then</p>",
        "id": 275737799,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647556900
    },
    {
        "content": "<p>you are the first to bring it up as an implementation need when identifying a medication.</p>",
        "id": 275738813,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1647557543
    },
    {
        "content": "<p>In Canada we also had a requirement to flag a prescription as a \"triplicate\" prescription.  I think the resolution was to use MedicationRequest.category?</p>",
        "id": 275740871,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647558813
    },
    {
        "content": "<p>yes, that would be a good use of category in identifying the prescription.  We have a Jira issue to add some more example codes to the current med request category value set to give more ideas of what the category could be used for.</p>",
        "id": 275741316,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1647559119
    },
    {
        "content": "<p>We also have this requirement in Europe. Drug classification (of which schedule is an example) is an element that is needed in prescriptions.</p>",
        "id": 276432054,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1648097055
    },
    {
        "content": "<p>There was already some discussion on adding classification on Medication. The requirement remains open.</p>",
        "id": 276432069,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1648097096
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> triplicate prescription seems a category of the request, while this seems about category of the drug itself. Most pressing example is ATC code</p>",
        "id": 276432129,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1648097176
    },
    {
        "content": "<p><a href=\"#narrow/stream/179249-Medication/topic/Controlled.20Substance.20Schedule\">https://chat.fhir.org/#narrow/stream/179249-Medication/topic/Controlled.20Substance.20Schedule</a></p>",
        "id": 276432466,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1648097716
    }
]