[
    {
        "content": "<p>Hi,</p>\n<p>I'm trying to model / profile diluent data elements within MedicationAdministration resource. The business context is that an Medication Order of an IV infusion could not have explicitly stated the diluent (i.e.: 100ml Sodium Chloride 0.9%, 100ml Glucose 5%)  as part of the order, but at time of administration, the person who administer it will make note of the diluent used and other data elements (i.e.: 100ml Sodium Chloride 0.9% over at least 30 minutes, 100ml Glucose 5% over at least 30 minutes).</p>\n<p>Even though that the diluent could be considered as an ingredient of the medication, its seems that I need to model it in a more flexible way. So, I have think about the following options and wanted to source perspective, comments about the options or accept other options if they have worked for you.</p>\n<p>1) As an ingredient of the medication <br>\nNote: Diluent might me \"added\" to the \"administration order / task\" at time of administration, so the actual medication administered is \"fabricated\" at time of administration, not at time of ordering<br>\n(this looks as the right way to go, but I'm afraid that the composed/fabricated medication will not exist as a Medication resource)</p>\n<p>2) As another Medication resource </p>\n<p>3) As a domain resource made up several extensions to cater for Diluent values (Medication name → Coding, diluent volume → dosage component as backbone element)</p>\n<p>Hope I'm making sense here.</p>\n<p>Thanks</p>",
        "id": 153977793,
        "sender_full_name": "Jose Veroes",
        "timestamp": 1532482341
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> haven't we talked about this before ?</p>",
        "id": 153977801,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532484755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>   as HL7 AU Medication WG members. Ta</p>",
        "id": 153977823,
        "sender_full_name": "Jose Veroes",
        "timestamp": 1532490484
    },
    {
        "content": "<p>Option 1 looks best to me. <br>\nThe medication adminsitered will often be different to the one requested, e.g. brand and form may be specified on administration.</p>",
        "id": 153977829,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1532496434
    },
    {
        "content": "<blockquote>\n<p>Option 1 looks best to me. <br>\nThe medication adminsitered will often be different to the one requested, e.g. brand and form may be specified on administration.</p>\n</blockquote>\n<p>Thanks Richard. <br>\nGoing with it present a challenge that the medication administered (a compound medication made of main medication + diluent, i.e.: Azithromycin 500 mg + sodium chloride 0.9% 250 mL) exists as a 2 medication resources (as is), hence the challenge of going this way.</p>",
        "id": 153978169,
        "sender_full_name": "Jose Veroes",
        "timestamp": 1532577199
    },
    {
        "content": "<p>You could have three medication resources, one for Azithromycin 500 mg, one for  sodium chloride 0.9% 250 mL and one for the combnation with the other two referenced as ingredients, one active and one inactive.</p>\n<p>That may or may not be useful.</p>",
        "id": 153978176,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1532579340
    },
    {
        "content": "<p>But MedicationAdministration resource is expecting only 1 Medication resource, which align to option 1. I can't assume that the compound medication will exist in the source system to fulfill FHIR as is. The business context is requiring a more flexible way to deal with diluent and the changes that the diluent bring to the Dosage, ie.: 2 rates, a) that represent the vol/time which is the rate of administration, and one that represent the non-vol/time which is commonly refer as the dose rate<br>\nThanks Richard. Appreciate the discussion!</p>",
        "id": 153978225,
        "sender_full_name": "Jose Veroes",
        "timestamp": 1532586631
    },
    {
        "content": "<p>Option 1. you will have one medication that may not be a standalone resource, but could be a contained resource.</p>",
        "id": 153978231,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1532591024
    },
    {
        "content": "<p>and that medication has several ingredients (medications), which are the ingredients you need.</p>",
        "id": 153978232,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1532591052
    }
]