[
    {
        "content": "<p>Your review is requested: Firely's latest training course is a \"IDMP on FHIR\" course for those new to IDMP as well as FHIR. <br>\nAs domain experts I value your personal opinion (good or bad, as long as it is done constructively) with regards to the proposed agenda, as well as the training goals. Given that the EMA has officially stated their position with regards to FHIR, this version of the course is primarily aimed at the European market - a US version would require some changes.<br>\n<a href=\"/user_uploads/10155/7D9SKsF7BQMJS6sQ1PWWB-X6/IDMP_on_FHIR_Course_Review.pdf\">IDMP_on_FHIR_Course_Review.pdf</a></p>",
        "id": 208650782,
        "sender_full_name": "René Spronk",
        "timestamp": 1598943607
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> - I think this is a good outline.  How much of the product data were you planning on representing in IDMP?  That exercise could be very complicated and head-scratching for attendees given the complexity of the underlying v3 model.  It will obviously serve as a wonderful segue into the FHIR Basics and why EMA decided to go with FHIR instead of V3 for product submissions.</p>",
        "id": 208708628,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598975965
    },
    {
        "content": "<p>I suggest a short part on the comparison of requirements to describe a \"Medicinal Product\" in a regulatory context vs in patient care processes. How the 80/20 rule produces rather different FHIR constructs for the two domains. And how MedicationKnowledge connects between the two.</p>",
        "id": 208712848,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1598977687
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> - we've received that comment before (a couple of times). This is part of the material covered, but it would be better if it were to called out as a separate item on the agenda. That would make it clear that the issue is taken seriously and will be covered during the course.</p>",
        "id": 208718320,
        "sender_full_name": "René Spronk",
        "timestamp": 1598980243
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> Exercises during a course like this will mostly be based on the \"here's an example, go and create a cloned version with changes X, Y and Z\". Thus the scope is manageable.</p>",
        "id": 208718763,
        "sender_full_name": "René Spronk",
        "timestamp": 1598980448
    },
    {
        "content": "<p>Note that the course is focused on implementers &amp; \"IDMP as expressed in FHIR\", so the v3 model won't be discussed in a detailed fashion.</p>",
        "id": 208718949,
        "sender_full_name": "René Spronk",
        "timestamp": 1598980534
    },
    {
        "content": "<p>minor point:  you have \"terminologies/how codes work in FHIR\" in the \"SPOR implementation\" section.  wouldn't that be better placed in the \"FHIR basics\" section?  </p>\n<p>Otherwise, it is a good outline.  Time management will be key, you could easily take more than the 2 days / 15 hours planned</p>",
        "id": 208905435,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1599091877
    },
    {
        "content": "<p>Hi Scott - this is one of the things one learns to deal with when one designs a course. Don't get sidetracked during the presentation, focus on the 80% of the 80%, attendees can deal with the rest later. If there are too many details in a course, people won't remember anyway. But yes, the instinctive drive of the expert to include 'as much as possible' has to be resisted - it'always about  'what things to take out' instead of ' what extra things to include'.</p>",
        "id": 208924759,
        "sender_full_name": "René Spronk",
        "timestamp": 1599113794
    }
]