[
    {
        "content": "<p>I am working in the USA Veterans Admin on their Patient Portal. One of the features offered today to a Veteran is that they get to see a picture of the drug that was actually dispensed to them. This picture helps them identify which of the various pills they have is the pill of interest. This picture helps them identify to their clinican the pills they are taking. This picture helps their spouse or other helper understand the pills they need to give when. <br>\nWhen I look at the current FHIR Medications, I don't find a clear way to identify a picture of the drug as it was dispensed. There is MedicationKnowledge that seems useful, but it seems to be closer to what was Ordered. I need linkage to what was Dispensed.</p>",
        "id": 161887047,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553711302
    },
    {
        "content": "<p>MedicationKnowledge is knowledge - it's tied to a drug code and could be at the ordered, dispensed/administered level</p>",
        "id": 161889081,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553712537
    },
    {
        "content": "<p>But that is what is ordered... dispensed seems to not have the ability to be this specific.</p>",
        "id": 161889636,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553712869
    },
    {
        "content": "<p>MedicationKnowledge is agnostic on whether the medication was ordered, dispensed, or administered.  It just describes a medication and the knowledge items around that medication.</p>",
        "id": 161889721,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553712947
    },
    {
        "content": "<p>Dispensed just points to a code.  You look up the code in MedicationKnowledge the same as you would for an ordered med</p>",
        "id": 161891808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553714234
    },
    {
        "content": "<p>MedicationKnowledge contain an image of a drug product</p>",
        "id": 161909089,
        "sender_full_name": "Melva Peters",
        "timestamp": 1553729113
    },
    {
        "content": "<p>If the image needed is a standard catalog picture of the drug, this is the default use of MedicationKnowledge. <br>\nSay the use case is: prescription is for drug A (tablets), but pharmacy dispenses drug B (capsules).</p>",
        "id": 161918484,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553741184
    },
    {
        "content": "<p>if you want a \"catalog\" image of drug B, you use the medicationKnowledge of drug B which should be on the server somewhere.<br>\nif however you want a picture of your drug B (e.g. you want to take a photo of the individual bag or bottle that the drug was dispensed, for proof, or for whatever other reason, then you could use a contained a MedicationKnowledge (or an extension) with that photo.</p>",
        "id": 161918679,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553741441
    },
    {
        "content": "<p>(btw, name \"knowledge\" seems to help confusing here, as it is unclear whether it refers to the definition of the medicine, or to the facts that are known about  a product instance or treatment..)</p>",
        "id": 161918869,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553741658
    },
    {
        "content": "<p>I can't find an element for medication image in <a href=\"http://build.fhir.org/medicationknowledge.html\" target=\"_blank\" title=\"http://build.fhir.org/medicationknowledge.html\">http://build.fhir.org/medicationknowledge.html</a><br>\nI think that Medication is the best place for the image, it is widely used to hold details of the medication that are not available from the coding.  All it needs is an extension.</p>",
        "id": 161920633,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1553744033
    },
    {
        "content": "<p>If you're taking a patient-specific picture, I wouldn't bother with a contained MedicationKnowledge, I'd use an extension.  (You'd need an extension to point to the MedicationKnowledge anyhow because just linking by code isn't enough for contained.)</p>",
        "id": 161922479,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553746339
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> It'd be drugCharacteristic.valueBase64Binary, though I agree it'd be useful for there to be a specific example code for 'image'.   Medication is a weird duck.  Sometimes it's used as the contained resource for custom compounds, IV concoctions, etc. and in those cases, an image is totally incorrect.  In other cases, it's used for a drug masterfile and in those cases, an image is potentially reasonable.  But, realistically, if you're going to capture an image for the drug, you'll probably have most of the other knowledge-base stuff too (indications, contraindications, recommended doses, etc.)  Which means that you're really talking about MedicationKnowledge.</p>",
        "id": 161922581,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553746533
    },
    {
        "content": "<p>we mentioned this last monday call about product: medication resource is both definitional and instance. medicationknowledge is strictly definitional in the sense of all other ...definition resources</p>",
        "id": 161923734,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553748434
    },
    {
        "content": "<p>agree that an extension on medication could do it if it is a patient-specific (or rather instance-specific) picture.</p>",
        "id": 161923791,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553748527
    },
    {
        "content": "<p>The image in the case of the VA is close to a catalog image. It is not an actual picture of the pills given. BUT it is very specific to the look of the pills dispensed at the pharamacy that dispensed that drug. I think the most likely case is where there are various possibilities that could fulfil the ordered medication, so that the image is what actually got dispensed. This might be different manufacture, might be because of pill strength available within that pharmacy, etc....   SImply recognizing that various pharmacy have various stock.</p>",
        "id": 161970131,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553791252
    },
    {
        "content": "<p>so I think MedicationKnowledge might work.. but there needs to be a way to indicate in the MedicationDispense which MedicationKnowledge represents what was dispensec.</p>",
        "id": 161970203,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553791319
    },
    {
        "content": "<p>Yes, currently we have MedicationKnowledge pointing to a Medication, but a Medication does not point to a MedicationKnowledge.  You'll have to use an extension for now, but I'll raise this as a tracker item.  I'm thinking it would go like this:  [Dispense|Request|Administration|Statement].medicationReference -&gt; Medication.associatedMedicationKnowledge -&gt; MedicationKnowledge.</p>",
        "id": 161970471,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553791481
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20624\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20624\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20624</a></p>",
        "id": 161970667,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553791614
    },
    {
        "content": "<p>thanks</p>",
        "id": 161971316,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553792075
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> why not simply add a \"medication.definition\" (as in Device which had the same issue)?</p>",
        "id": 161979722,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553797675
    },
    {
        "content": "<p>That's what the tracker item says.  For medication, there might be multiple knowledge resources that correspond to the same medication, but that will be for the committee to decide.</p>",
        "id": 161979859,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553797747
    },
    {
        "content": "<p>yes, i just looked at the name (to keep it consistent across all products) - medication.associatedMedicationKnowledge --&gt; medication.definition</p>",
        "id": 161980014,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553797853
    },
    {
        "content": "<p>I know medicationKnowledge is a working name, i am not addressing that. Just that the reference should simply be called \".definition\" - seems more straightforward for implementers. should i put these 2 cents in the tracker item comments?</p>",
        "id": 161980339,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553798101
    },
    {
        "content": "<p>You can, but I wouldn't find it persuasive.  Unlike the other definitions, I would expect that multiple associated knowledge resources could be referenced here.</p>",
        "id": 161980670,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553798325
    },
    {
        "content": "<p>The dispensed medication.code SHOULD be the detailed code for the specific manufactured product.  The only time I can see that not being specific to a particular image would be if the manufacturer changed the appearance of the same formulation - some code systems wouldn't change the code if that occurred, but that would be rare.  (And if it did occur, the MedicationKnowledge should have two images..)</p>",
        "id": 161980744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553798395
    },
    {
        "content": "<p>for the use case of sending the image that corresponds to the dispensed drug, i agree that there would be one knowledge resource.  we've discussed in the workgroup where you might have multiple associated knowledge resources corresponding to multiple formularies or knowledgebases.</p>",
        "id": 161981051,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553798603
    },
    {
        "content": "<blockquote>\n<p>if the manufacturer changed the appearance of the same formulation - some code systems wouldn't change the code if that occurred, but that would be rare.  (And if it did occur, the MedicationKnowledge should have two images..)</p>\n</blockquote>\n<p>you would best have two medicationknowledges, or two versions...</p>",
        "id": 161981085,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553798627
    },
    {
        "content": "<blockquote>\n<p>You can, but I wouldn't find it persuasive.  Unlike the other definitions, I would expect that multiple associated knowledge resources could be referenced here.</p>\n</blockquote>\n<p>not sure i understand what is missing, perhaps it stems from the idea of several definitions for one medication. Can one product can have many definitions?</p>",
        "id": 161981176,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553798669
    },
    {
        "content": "<p>i think that a medication can correspond to several definitions (as any other product), but i am not sure a 0..* is the best option. A medication can have not \"some\" definitions, but \"a speciific set of definitions\" Perhaps you have a different model in mind or different requirements, so i am not worried there, i know there will be a solution. <br>\nI just wanted to say that \"associatedMedicationKnowledge is not straightforward, and \"definition\" would be better.  Especially since MedicationKnowledge is a good resource but with an unclear name, and we do not want to spread that to some attributes.</p>",
        "id": 161981575,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553798997
    },
    {
        "content": "<p>MedicationKnowledge is not a definition of a medication in the traditional sense.  It is the knowledge of a product that a formulary or knowledgebase contains.  Thus I can send multiple resources corresponding to different formularies or knowledgebases.  I could also send multiple resources corresponding to different levels of information.  For example, if my Medication was AG-Amoxicillin 500mg Tablet, I could conceivably have the following associated knowledge resources: AG-Amoxicillin, Amoxicillin Trihydrate, and Amoxicillin.  We have seen a knowledgebase where some of the information is inherited from higher levels.  So the Amoxicillin contains knowledge about the interactions and indications, Amoxicillin Trihydrate gives further information about the specific salt and the AG-Amoxicillin gives information such as image, scoring, size, etc.</p>",
        "id": 161981853,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553799179
    },
    {
        "content": "<blockquote>\n<p>It is the knowledge of a product that a formulary or knowledgebase contains. </p>\n</blockquote>\n<p>That is what i mean by definition. And \"knowledgebase\" is what I had to call \"catalog\" (or Formulary, or Livret Therapeutique). Marketeers call it knowledgebase.<br>\nAgree with the multiple links - i had to implement just that (and the \"logistic product definition\" on top of it), so I am happy to see that requirement. Still, <br>\na) we should review the name. MedicationKnowledge is easy to confuse with \"all we know about this patient's medication history\" - hence my adjacent question to differentiate medicine/medication (médicament / médication).<br>\nb) to make that graph, it may b ethat we use 0..*, i just think it is not the only possibility and I would not anchor to a design just yet.<br>\nJust to be clear - there are several options, and I agree a medication can have its definition originating from different sources. How we fix that, is of secondary importance.</p>",
        "id": 161982487,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553799637
    },
    {
        "content": "<p>If the only thing that changed was the appearance and the regulator didn't force a change of 'code', there'd be nothing \"new\" to have a distinct MedicationKnowledge for.  Linkage to MedicationKnowledge in existing systems is exclusively via code.  No systems point to medication knowledge in sources like First Databank by anything other than the medication code.  So we can't reasonably expect systems to change that behavior with FHIR - nor can we expect knowledge sources to change their behavior either.</p>",
        "id": 161982920,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553799952
    },
    {
        "content": "<p>Catalogue is a different thing.  It implies \"what's available\".  That's not a function of the knowledge resource, it's a function of what a particular organization chooses to put in its \"list\".  (And the question of \"what's available\" can be highly dynamic.)</p>",
        "id": 161983040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553800033
    },
    {
        "content": "<p>Yes, I am assuming that when the color of a product changes, there is a new version of the product. Perhaps not necessarily a new code, but AFAIK someone has to update the SPC to say \"this is now pink instead of red\").</p>",
        "id": 161983225,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553800167
    },
    {
        "content": "<blockquote>\n<p>Linkage to MedicationKnowledge in existing systems is exclusively via code.</p>\n</blockquote>\n<p>via code<strong>s</strong>, yes, not sure if one code is sufficient.<br>\n- AG-Amoxicillin 500mg Tablet box 20 has one code (IDMP PackagedProduct ID)<br>\n- AG-Amoxicillin 500mg Tablet has its code (IDMP MedProduct ID)<br>\n- AG-Amoxicillin, another code<br>\n- Amoxicillin 500 mg Tablet, another code (IDMP Pharm Product ID)<br>\n- Amoxicillin Trihydrate, another code (Substance code?)<br>\n- Amoxicillin another</p>",
        "id": 161983639,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553800447
    },
    {
        "content": "<p>Catalogue means \"what is defined for this context of use\". As in \"These are the amoxicillins we are using in this hospital this year\".</p>",
        "id": 161983669,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553800485
    },
    {
        "content": "<p>I would separate \"what is logistically available\" (inventory) from \"catalogue\" (inventory is not only \"in stock\" it is way more dynamic. I had to implement things like \"this tablet is available on your ward until 8pm in that department, after that only via central dispensing from automated dispenser 2)\"</p>",
        "id": 161983706,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553800519
    },
    {
        "content": "<p>(just to show why my implementation experience makes me afraid of mixing those things).</p>",
        "id": 161983960,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553800687
    },
    {
        "content": "<p>If there isn't a new code, then there won't be a new MedicationKnowledge.  There might be a new version of the MedicationKnowledge, but it's extremely unlikely for there to be a new instance.  The whole point is that at you use the code to look up the MedicationKnowledge isntance.  The codes exist at different levels of detail and different codes will apply to products at different levels of granularity.  </p>\n<p>MedicationKnowledge has nothing to do with availability for use.  I'd expect the hospital to have MedicationKnowledge resources for products they do not carry or dispense and have never carried or dispensed because the pharmacist might have a need to look up information about the product based on what an arriving patient has on their person or in their record.</p>",
        "id": 161984706,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553801268
    },
    {
        "content": "<p>The \"catalog\" would be a List that points to the set of codes currently allowed to be dispensed.  There might be a separate list that takes into account what's actually in stock and available.</p>",
        "id": 161984810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553801332
    },
    {
        "content": "<p>You could use the codes on that list to look up MedicationKnowledge resources if you wished.</p>",
        "id": 161984846,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553801354
    },
    {
        "content": "<blockquote>\n<p>If there isn't a new code, then there won't be a new MedicationKnowledge.  There might be a new version of the MedicationKnowledge, but it's extremely unlikely for there to be a new instance.  The whole point is that at you use the code to look up the MedicationKnowledge isntance.  The codes exist at different levels of detail and different codes will apply to products at different levels of granularity.  </p>\n</blockquote>\n<p>i think there may be a difference between what triggers a new instance vs what triggers a new code. the latter is for the regulators to arbitrate, the former is technical. Not sure if it matters for interoperability but I think it's for regulators to chose.</p>",
        "id": 161985054,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553801510
    },
    {
        "content": "<p>I think it does makes sense to use the code as the link.</p>",
        "id": 161985198,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553801627
    },
    {
        "content": "<p>this just made me go back to the matter of 0..* - my starting view is that a medication is one unambiuous entity, with one code, one granularity. If a medication is a unambiguous entry with one granularity, it sounds confusing that it is defined by / linked to several \"knowledges\".</p>",
        "id": 161985441,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553801795
    },
    {
        "content": "<p>i am not too worried about whether it is a link or a code, as long as we do not introduce ambiguity.</p>",
        "id": 161985490,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553801832
    },
    {
        "content": "<blockquote>\n<p>The \"catalog\" would be a List that points to the set of codes currently allowed to be dispensed.  There might be a separate list that takes into account what's actually in stock and available.</p>\n</blockquote>\n<p>Agree. I thought you were putting them together - i misread.</p>",
        "id": 161985570,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553801885
    },
    {
        "content": "<p>The code <em>is</em> the link for all existing software.  It's not going to change just because FHIR might work differently.  If a manufacturer changes the look of a product and the FDA doesn't assign it a different code, FDB is just going to update their software to show the new image (while hopefully retaining the old one).  That's just the reality of what products do.</p>",
        "id": 161986821,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553802867
    },
    {
        "content": "<p>No pharmacy is going to have links into their medication knowledge-base that work by anything other than the codes they use for ordering and dispensing.</p>",
        "id": 161986896,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553802931
    },
    {
        "content": "<p>Same with EMRs and HISs.</p>",
        "id": 161986905,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553802939
    },
    {
        "content": "<p>true, the upstream decision \"does this grant a new code or not\" may not be coherent. European regulators have some discretion to define when a code must change, and of course they differ.</p>",
        "id": 161987985,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553803616
    },
    {
        "content": "<p>as well as medication formulary systems - their links to the outside are also the product / substance /... codes. Decent formularies handle a more or less complex graph of product info, all hopefully based on the many codes.</p>",
        "id": 161988346,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553803872
    },
    {
        "content": "<p>it just seemed taht this somehow clashed with the notion of one medication to N knowledges.</p>",
        "id": 161988490,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553803964
    },
    {
        "content": "<p>back to the image, yes, we should keep history, because for patient Fr. Jacques, I may dispense 10 tablets of the pink batch and 15 of the red batch. (whether they have the same code or not, if you want to look them up, you should have this somethere)</p>",
        "id": 161988625,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553804059
    },
    {
        "content": "<p>A given Medication.code will only resolve to a single MedicationKnowledge (unless you have multiple knowledgebases).  Though if you traverse the code hierarchy, you could potentially get others.</p>",
        "id": 161988714,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553804136
    },
    {
        "content": "<p>Lloyd, are you asserting that for every RxNorm there is only one possible drug look? I thought that there were differences in manufacturing that may produce different looks, different manufactures, different potency, and generics.</p>",
        "id": 161989924,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553805025
    },
    {
        "content": "<p>My understanding is that there are RxNorm codes for those different manufactured forms.  RxNorm is a hierarchical code systems where there are codes for generics like \"Amoxicillin\" (RxNormCUI 723) as well as codes for specific manufactured products \"Biomox 100 MG Oral Tablet\" (RxNormCUI 791942) as well as codes for intermediaries like \"Amoxicillin 100 MG\" (791938) or generic formulations \"Amoxicillin 100 MG Oral Tablet\" (791939).  There could be MedicationKnowledge entries at any of these levels.  However, if Virbac changes the color of the pill and the FDA doesn't choose to issue it a different CUI, then the drug knolwedge bases would still attach the new image to \"Biomox 100 MG Oral Tablet\" (791942) as there isn't a more granular code to tie it to.</p>",
        "id": 161997898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553811487
    },
    {
        "content": "<p>This is especially challenging for generic medications, which get lumped together by RXN.</p>",
        "id": 162003143,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1553816335
    },
    {
        "content": "<p>Hence why I started this thread that there is a need for the image of the \"Dispensed\" drug. I think MedicalKnowledge can be used, but the linkage is not through the RxNorm code, it must be more specific in some cases.</p>",
        "id": 162042358,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553863268
    },
    {
        "content": "<p>How could it be with anything more specific?  In the dispense record, you'll just have a code that reflects the dispensed drug.  Unless the pharmacist takes a picture of the specific drug they're dispensing to each patient at each dispense (which I've never heard of a pharmacist doing), the only thing you can do is look up the code for the dispensed drug  in the knowledgebase.  (Note that the dispensed code is typically different from the prescribed code and is more detailed in terms of manufacturer, formulation, etc.)</p>",
        "id": 162052019,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553870719
    },
    {
        "content": "<p>I think you might be agreeing. I am all for use of MedicalKnowledge as a catalog of actual drugs with a reference image of that specific one. I am simply indicating that this is more refined than RxNorm, as it must also cover manufacturing differences.</p>",
        "id": 162055198,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553872804
    },
    {
        "content": "<p>In theory, there is no difference between theory and practice... but then reality steps in.</p>",
        "id": 162055437,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553872974
    },
    {
        "content": "<p>And what I'm saying is that the only thing you'll have records for with associated pictures is an RxNorm or NDC code.  If there are finer-grained manufacturing differences than that, no-one will have knowledge records or pictures because the systems involved don't track the finer granularity.</p>",
        "id": 162057528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553874469
    },
    {
        "content": "<p>From what you are saying, I need to create an extension... because this is a real world need.</p>",
        "id": 162067181,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553880894
    },
    {
        "content": "<p>Can you explain the real-world need better?  At the time of dispensing the <em>only</em> thing the pharmacy knows is the NDC code for the dispensed product.  They might have a lot number, but there's no data source that provides lot number-specific information about a medication.</p>",
        "id": 162067812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553881316
    },
    {
        "content": "<p>The pharmacy knows the exact drug they dispensed. This is what I am looking to flow back. I have outlined many times, and others have confirmed, that what gets dispensed will be chemically identical to what was ordered; but might look different due to manufacturing differences etc. The LOOK of what was DISPENSED is what I am looking for. A reference library of MedicationKnowledge is fine, as long as it is specific to the variations in the look of what gets dispensed.</p>",
        "id": 162068402,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553881716
    },
    {
        "content": "<p>They know the exact drug they dispensed how?  By what identifier?  Typically in the US, they know it by NDC code.</p>",
        "id": 162068588,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553881855
    },
    {
        "content": "<p>Some newer systems might know it by RxNorm.</p>",
        "id": 162068633,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553881889
    },
    {
        "content": "<p>GUID</p>",
        "id": 162068810,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553881984
    },
    {
        "content": "<p>In the pharmacy systems that I've seen that support images, they have the image of the specific drug that they are dispensing and they reference it by the code.  In FHIR terms, they'd use that code to look up a MedicationKnowledge resource that contained the image of the drug they are dispensing.</p>",
        "id": 162068814,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553881985
    },
    {
        "content": "<blockquote>\n<p>GUID</p>\n</blockquote>\n<p>I highly doubt that.  No system I know of references drugs by GUID.</p>",
        "id": 162068843,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1553882012
    },
    {
        "content": "<p>Who assigns the GUID?</p>",
        "id": 162068950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553882073
    },
    {
        "content": "<p>Jean is right. it is not exactly GUID</p>",
        "id": 162068964,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553882084
    },
    {
        "content": "<p>but there is a similar level of detail to identify manufacture, Lot, etc.</p>",
        "id": 162068993,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553882105
    },
    {
        "content": "<p>yes, it requires tight relationship with Pharmacy.. which VA has, as they are the Pharamacy most of the time</p>",
        "id": 162069036,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553882127
    },
    {
        "content": "<p>It has nothing to do with the pharmacy or the relationship.</p>",
        "id": 162069058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553882152
    },
    {
        "content": "<p>Drugs from the manufacturer come stamped with two codes - an NDC and a UPC code.</p>",
        "id": 162069131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553882173
    },
    {
        "content": "<p>Knowledgebases that have images are pretty-much all driven by the NDC code.</p>",
        "id": 162069157,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553882193
    },
    {
        "content": "<p>And <em>neither</em> will tell you about manufacturing process changes that aren't sufficient for the FDA to force a distinct NDC code.</p>",
        "id": 162069233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553882242
    },
    {
        "content": "<p>but that could be the code used to index MedicationKnolwedge. right? If so, then that might be refined enough (I have homework).</p>",
        "id": 162070134,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553882783
    },
    {
        "content": "<p>But that is not what is Prescribed, which is a much higher granularity. Which was my concern.</p>",
        "id": 162070210,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553882845
    },
    {
        "content": "<p>I got confirmation NDC is sufficiently granular.</p>",
        "id": 162070491,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553883017
    },
    {
        "content": "<p>nice to see things are clear over there.</p>",
        "id": 162075580,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886596
    },
    {
        "content": "<p>FWIW, i think there was an attempt to make the IDMP identifiers GUIDs. that was fun.</p>",
        "id": 162075658,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886625
    },
    {
        "content": "<p>in general, there are N levels of granularity, which are overlapping, not harmonized across countries. Hospital pharmacies prepare their own products and new codes emerge. Some levels of granularity can be in a dispense, others not. Reducing it to RxNorm and NDC serves to demonstrate that we can (normally) retrieve the picture of the dispensed product from a catalog for pre-manufactured products. <br>\nAs long as we conceive other codes, other granularities, the solution will still work.</p>",
        "id": 162075888,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886840
    },
    {
        "content": "<p>a GS1 barcode should be possible..</p>",
        "id": 162076763,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553887548
    },
    {
        "content": "<p>Good point. GS1 barcode is the carrier for the product identifier which is the GTIN. GTIN is at the lowest level of granularity (a package that changes color of the logo may get a new GTIN but may or may not require the regulator to grant a new Medicinal Product Identifier.</p>",
        "id": 162077342,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553888067
    },
    {
        "content": "<p>that is what I meant to say when I said GUID... oops</p>",
        "id": 162077378,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553888103
    },
    {
        "content": "<p>Thus indeed, as long as we have a code, we can look up the medicine picture. But may be on whatever granularity code.</p>",
        "id": 162077381,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553888105
    },
    {
        "content": "<p>Ah ok. then I am glad. (but the GUID idea was in the air somer time ago)</p>",
        "id": 162077417,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553888156
    }
]