[
    {
        "content": "<p>A. We may have two different interfaces for medication requests, with different requirements and (possibly) different profiles. If we serve a resource under one profile, and another application asks for that order under a different profile, is it the same resource? Is there even a way to specify a profile in a request?</p>\n<p>B. A medication order is created a clinical subsystem and transmitted to a pharmacy subsystem. The second record refers to the first. (Revisions sometimes modify the record and sometimes create a new record.) For now, we are concerned with the most current Pharmacy record, but that will eventually change. Is there one order or two?</p>",
        "id": 178371909,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1571311865
    },
    {
        "content": "<p>I would expect the same exact resource be returned. The expectation we often use is that the Resource could be signed with that signature placed into a Provenance.signature. Thus to be returning different values to different clients would break signatures. It would also end up with those two clients thinking they had the same data but clearly not having the same data. This would be bad for business and bad for patient safety. And very confusing for medical-records retention.</p>",
        "id": 178376792,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571316174
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> A resource is a record of the real-world business object.  However, sometimes a resource instance is the <em>only</em> record of that real world business object.  It's possible for one instance to be flagged as authoritative (using a tag) and the others not-so-tagged.  It's certainly possible to retrieve a subsetted view of a resource.  If you choose to store that, you need to store the subsetted tag to reflect that you don't have the whole thing.  (Subsetted instances are, by definition, not authoritative.)</p>",
        "id": 178390336,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571324996
    },
    {
        "content": "<p>Real world systems will be a mixed economy of FHIR and other stuff.  Any record whether a business object or record object is just data and systems will have do do at least a sanity check on it before treating it as information.  The only time you can be clear about the content is when you own every step of the workflow and every part of the systems supporting the workflow.</p>",
        "id": 178641896,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1571652855
    },
    {
        "content": "<p>I don't think you have to own them all, but you have to at least negotiated how workflow will function across the systems involved with all participants</p>",
        "id": 178658289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571666935
    },
    {
        "content": "<p>Many thanks. We have some business analysis to do for B.</p>\n<p>For question A, is there some content-negotiation approach for saying \"I want this order in profile X, not profile Y\"?</p>",
        "id": 178751615,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1571748352
    }
]