[
    {
        "content": "<p>It seems that ClinicalUseIssue is still being drafted. I don't understand the intent, but I can propose a few things:<br>\n1. If/when we have a conditionDefinition, can we not just use that? There was a similar discussion a few years ago, when we started catalog and we needed to define how a product(definition) relates to a condition(definition)<br>\n2. In the scope and usage, it talks about instances, a word I find confusing here. This is a definitional resource, so it should never be an instance of a situation. (personally, I think the word \"instance\" is overloaded, but we should avoid confusion)<br>\n3. This seems custom made for IDMP submissions and therefore lacks breadth of scope. Could we aim but a simpler structure of one entity, another entity and the relation? This is what we procured in the Catalog discussions, so <br>\n- Indication would be a qualification of the relation between the product and the condition<br>\n- contraindication would be a qualification of the (negative) relation between those<br>\n- interaction would be a relation between product and another product</p>",
        "id": 166593572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558907071
    },
    {
        "content": "<p>Not sure how much of this is actually sensible, but implementing catalogs we just stumbled across too many issues, so I hope I can help the discussion. I believe there is a lot of work to do before we have a proper way to define a product (one that follows IDMP but also all other national or regional definitions, one that supports meds and other products, that can interact with other established product catalogs..). I hope my previous lessons and errors can help the group.</p>",
        "id": 166593707,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558907297
    },
    {
        "content": "<p>I just added a first draft of ConditionDefinition. It seems like a really different thing to me</p>",
        "id": 166595154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558909645
    },
    {
        "content": "<p>I saw the commit which reminded me of the need we had for catalog. But there seems some overlap: where do we define the medication that is indicated for a condition? In the regulatory space? In the medication \"knowledge\"? In the condition?</p>",
        "id": 166611804,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558938430
    },
    {
        "content": "<p>MedicationKnowledge I think.  Because you'd be tying the Condition.code to a particular recommended route, dosing scheme, etc.  You could have a PlanDefinition that describes the treatment protocol for a condition (the tests to run, the therapies to try - in sequence or combination, etc.)</p>",
        "id": 166637057,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558963671
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> defining a medication that is indicated for a condition would be MedicationKnowledge.<br>\nThe ClinicalUseIssue is a single resource to define interactions, contraindications, undesirable effects and indications.  Not ideal in my mind, but it was what Clinical Decision Support requested.  It was previously 4 different resources.</p>",
        "id": 166654345,
        "sender_full_name": "Melva Peters",
        "timestamp": 1558979569
    },
    {
        "content": "<p>when we started catalog, we did not have the medicationknowledge, now we have more options to do the same thing</p>",
        "id": 166654823,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558980047
    },
    {
        "content": "<p>IMO this is a contextual definition - a head of department may decide to define an indication or contraindication that is not in the book.</p>",
        "id": 166654831,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558980059
    },
    {
        "content": "<p>how do we define an inication for a device?<br>\nand for a nutrition product?</p>",
        "id": 166654852,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558980091
    },
    {
        "content": "<p>we should either have a single place to to those, or consistency across them.</p>",
        "id": 166654968,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558980217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> understand but i don't think medknowledge is an obvious choice (it would be my top 2 out the 4 options). and that is my point - same concept (link medication-condition) is appearing in many places. It works, but is not good for interoperability</p>",
        "id": 166655292,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558980536
    },
    {
        "content": "<p>Consistency is appropriate - if there's consistency with how existing systems typically handle this sort of information.  Indications for drugs are pretty-much always shared as part of drug knowledge-bases right now.  I'm not sure how (or if) device indications and nutrition indications are commonly shared.</p>",
        "id": 166656786,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558982098
    },
    {
        "content": "<p>knowledge-bases == drug catalogs? or are those different? this is why i said \"top 2\". I would put it in a catalog, because these are contextual definitions, and medicationKnowledge still sounds focused on drug DB information, not on the continuum of data from the chain of regulators and distributors until the hospital's automated distributors that work only at night. I may be wrong.</p>",
        "id": 166665161,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558992578
    },
    {
        "content": "<p>Catalogues can be all sorts of things.  They're collections of \"what's available\" or \"what's allowed\" or \"what exists\".  Drug knowledge bases are the sort of thing published by FDB.  Those aren't catalogues.</p>",
        "id": 166666300,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558994239
    },
    {
        "content": "<p>a national list of drugs , drug clusters, drug combinations, drug indications, and reimbursement for those. Or a list of commercial brands for a given substance. Or list of products available in the market. or a list of devices and their approved and reimbursed indications. That is a catalog (to me).</p>",
        "id": 166670307,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558998286
    },
    {
        "content": "<p>i am still puzzled by words like knowledge. <br>\nFDB has a catalog of drugs which needs to connect upstream and downstream - getting the drug definitions and codes from regulators and passing them along to others. I care about that, and the healthcare data chain depends on that interoperability (there is some additional ISO work on that matter). On top of that, FDB has a load of knowledge (so has Vidal, and Theriaque, and others... but that is not a standard model, and I think we should get something working on the essentials, before sharing the propietary \"knowledge\" part.</p>",
        "id": 166670647,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1558998856
    },
    {
        "content": "<p>The inclusion or exclusion of something from a list makes something a part of a catalogue or not.  The information that's stored may or may not be passed around in catalogue form.</p>",
        "id": 166714120,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559048823
    }
]