[
    {
        "content": "<p>I have a use-case where a picture of the medication that was dispensed is desired. Such as when a Patient is using a portal, and wants to see an image of the pill so that they don't confuse drugs that they have. This would be an image of exactly what was dispensed, so it can't really be at the level of code, right? Or can it?   Would an extension on MedicationDispense be helpful, it could point at Binary?</p>",
        "id": 153981844,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533311207
    },
    {
        "content": "<p>MedicationKnowledge includes the ability to include an image.  This isn't information that would be included in the dispense, but is part of drug information.</p>",
        "id": 153981849,
        "sender_full_name": "Melva Peters",
        "timestamp": 1533312607
    },
    {
        "content": "<p>thanks. Is that specific to the actual drug that was dispensed? I am not an expert, but sometimes they look different... right?</p>",
        "id": 153981855,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533315287
    },
    {
        "content": "<p>I don't see a place in MedicationKnowledge for an image</p>",
        "id": 153981856,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533315523
    },
    {
        "content": "<p>The attribute is drugCharacteristic.value.  This resource is draft so it's possible it isn't clear or we don't have the specific data type right.</p>",
        "id": 153981858,
        "sender_full_name": "Melva Peters",
        "timestamp": 1533315714
    },
    {
        "content": "<p>It is expected that you would query MedicationKnowledge using the exact identifier for the instance of the medication dispensed to get additional drug information such as image or monographs, etc.</p>",
        "id": 153981860,
        "sender_full_name": "Melva Peters",
        "timestamp": 1533315758
    },
    {
        "content": "<p>okay, so MedicationKnowledge.drugCharacteristic.. seems the .type needs a valueset, where one of the codes in there would be something like 'image of drug'? I would then expect .value[x] to have a Resource(Binary|Media).</p>",
        "id": 153981871,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533319189
    },
    {
        "content": "<p>what element in MedicationDispense is the link to MedicationKnowledge?</p>",
        "id": 153981872,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533319261
    },
    {
        "content": "<p>MedicationDispense links to medication which has a medicationKnowledge (the definition) associated with it</p>",
        "id": 153982073,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533379576
    },
    {
        "content": "<p>I expect that the image in MedicationKnowledge would be a standard image. Could the following happen? The medication is dispensed in a bottle with a custom label, and looks nothing like the standard image. If so, an image in MedicationDispense seems best.</p>",
        "id": 153982402,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1533529544
    },
    {
        "content": "<p>right, the use case makes sense. But this is an image of the medication, not of the dispense.</p>",
        "id": 153982423,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533533963
    },
    {
        "content": "<p>i think there was an idea that medication and medicationKnowledge would be somewhat closer (as in: one being a profile of the other) and use cases like this could argue for that</p>",
        "id": 153982424,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533534034
    },
    {
        "content": "<p>Agree, the image is of the medication and not the dispensed product in my experience.</p>",
        "id": 153982577,
        "sender_full_name": "Melva Peters",
        "timestamp": 1533567041
    },
    {
        "content": "<p>In my case (VHA) I think they want the image of what was dispensed. Not what should have been. Would this not be a change in the MedicationDispense to point at a different MedicationKnowledge?</p>",
        "id": 153984966,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533915855
    },
    {
        "content": "<p>MedicationDispense will point to a medication.</p>",
        "id": 153985212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533962776
    },
    {
        "content": "<p>so the example would be:<br>\nPrescription1 &gt; medication1 &gt;MedicationKnowledge1 with its image<br>\nbut<br>\nDispense1 &gt; medication2 (dispensed something that is not what was prescribed) &gt; medicationKnowledge2 with its image.</p>",
        "id": 153985214,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533962880
    },
    {
        "content": "<p>Is it reasonable that a Patient would have access to all the information in MedicationKnowledge? Might there be a different resource for Patient vs Clinician?</p>",
        "id": 153985582,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534105929
    },
    {
        "content": "<p>yes, I can understand an app that has more rights than the Patient (user), where this app is trusted to only expose a subset... I am just wondering if we could examine Resource sizing to better fit expected access control needs. It is far more clean to differentiate access levels at Resource boundaries, than within a Resource.</p>",
        "id": 153985583,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534106144
    },
    {
        "content": "<p>In practice, it is not about access control, app vs person, or patient vs clinician,... <br>\nrather \"defining a product vs mentioning a few characteristics of product\" . This discussion is known and also emerging on Devices. hence my suggestion to look at boundaries between xxxDefinition and xxx resources, where xxx is medication, device...<br>\nfor this example, i am thinking that the boundary between medicationKnowledge and Medication may best be a bit more fluid, but that hasn't been discussed.</p>",
        "id": 153985705,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1534150469
    },
    {
        "content": "<p>Yes, and Resources should also be designed to hold similarly sensitive information. RESTful access control models are at the Resource level. We should not make a bad design decision this early.</p>",
        "id": 153985752,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534163248
    }
]