[
    {
        "content": "<p>Consider a scenario when a pharmacy attempts to prepare a dispense, but cancels it prior to the dispense being handed over to the patient.  At a later point in time, the pharmacy makes a second attempt to prepare a dispense and successfully hands it over to the patient.  Which of the following represents what you would expect to see?</p>\n<p><strong>Option 1:</strong>  A single dispense record that is modified over time.  The status lifecycle of the single dispense would be:  preparation &gt; cancelled/stopped &gt; preparation &gt; completed<br>\n<strong>Option 2</strong>: A dispense record for each attempted dispense event (e.g. one record has cancelled/stopped end state status;  second record has completed end state status).</p>",
        "id": 237545616,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1620240114
    },
    {
        "content": "<p>My leaning would be the second - not that my opinion counts for much here :)</p>",
        "id": 237572322,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620250589
    },
    {
        "content": "<p>What is \"cancels it\"? If it is removed from the original packaging, it most likely cannot be un-dispensed. Also the reason for canceling may need to be recorded, and the reason for un-dispense may be tricky. If the second dispense is just a simple update to the previous dispense attempt, option 1 may suffice.</p>",
        "id": 237584574,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1620258461
    },
    {
        "content": "<p>But anything beyond simple should be safer with option 2</p>",
        "id": 237584641,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1620258490
    },
    {
        "content": "<p>i think that it is up to the implementation.  I don't think we (the Core Spec) want to say anything about that.  There are pros and cons to each option.  I too lean towards #2 but I can see why #1 would work for some systems.</p>",
        "id": 237593205,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1620265959
    },
    {
        "content": "<p>2</p>",
        "id": 237652332,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620305549
    },
    {
        "content": "<p>What is the context? Is it a pharmacy IT system design? Is it patient-centric interoperability? Is it pharmacy IS interoperability? I think the answer will depend on the specific context.</p>\n<p>From the patient care point of view, there should be only one Medication Dispense resource, the one that was successfully handed over to the patient. The information that there was a \"failed attempt\" is of no obvious use outside the pharmacy.</p>",
        "id": 237667883,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1620311641
    },
    {
        "content": "<p>A failed attempt at dispensing may be relevant for inventory management as well.</p>",
        "id": 237699089,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1620322706
    },
    {
        "content": "<p>That would be part of pharmacy IS interoperability.</p>",
        "id": 237713554,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1620328395
    },
    {
        "content": "<p>Right. my comment was about the failed attempt being of no obvious use outside the pharmacy</p>",
        "id": 237742166,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1620341279
    },
    {
        "content": "<p>Context is interop (sharing the dispenses across systems for various consumption purposes).</p>",
        "id": 239108176,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1621264750
    },
    {
        "content": "<p>status=declined is the closest I see for \"we started the dispense but we stopped and we may do this dispense in the future\". </p>\n<p>In my experience, I have not had a need to track the declined dispense internally. So, I would go with Option 1.</p>\n<p>If there is an operational need to track the declined dispense, then Option 2 is necessary.  I'm interested in thoughts on why the decline dispense would need to be tracked.</p>",
        "id": 239139302,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1621276714
    },
    {
        "content": "<p>I can imagine that this would be the case if the dispense fails (jar is broken before giving it to the patient; realizing that there was a mistake/issue with the quantities while mixing a solution)</p>",
        "id": 239143445,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621278400
    },
    {
        "content": "<p>in that case you may want to capture that.</p>",
        "id": 239143521,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621278429
    },
    {
        "content": "<p>I don't consider this a dispense, but a consumption. So we may not need to capture this as a Dispense resource</p>",
        "id": 239143598,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621278462
    }
]