[
    {
        "content": "<p>How do you express that a MedicationRequest is to prevent disorder X? In other words the intent is not curative but preventive and the target disorder X is not a current Condition of the Patient. It is a condition to be averted.<br>\nI can't figure out what to put in MedicationRequest.reason to express for instance \"prevent cerebrovascular accident\", in a structured manner.</p>",
        "id": 249614457,
        "sender_full_name": "François Macary",
        "timestamp": 1629132657
    },
    {
        "content": "<p>It could be included in the MedicationRequest.reason attribute which is the \"reason or indication for ordering or not ordering the medication\" - it is a CodeableReference</p>",
        "id": 249615806,
        "sender_full_name": "Melva Peters",
        "timestamp": 1629133296
    },
    {
        "content": "<p>Yes, this is the path I'm following. However, there is no concept in SNOMED representing \"prevention of disorder X\", and if I use a reference to a Condition resource instead. This would be a Condition that is not current for the patient, but to be feared for the future. And I can't see how to express that in Condition.</p>",
        "id": 249625418,
        "sender_full_name": "François Macary",
        "timestamp": 1629137380
    },
    {
        "content": "<p>Having done some additional search, I think the closest solution is to put in MedicationRequest.reason a concept \"at risk of disorder X\". For instance 866240007 |At risk of cerebrovascular accident (finding)|. One would infer that the medication is prescribed to mitigate that risk, hence with a preventive intent.</p>",
        "id": 249684940,
        "sender_full_name": "François Macary",
        "timestamp": 1629183801
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> - yeh, had a similar need for treatment intent in mCODE and didn't think that MedicationRequest.reason was sufficient since we have that specifically bound to cancer condition codes. <a href=\"http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/StructureDefinition-mcode-cancer-related-medication-request.html\">http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/StructureDefinition-mcode-cancer-related-medication-request.html</a>. It would have been really unruly to add \"risk of\" concepts for all of our cancer codes, especially since that value set is also used for our diagnosis of cancer (and risk of is not a diagnosis for us).<br>\nBecause of that, we had to create an extension for treatment intent called (procedure intent), and included preventative in our value set. <a href=\"http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/ValueSet-mcode-procedure-intent-vs.html\">http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/ValueSet-mcode-procedure-intent-vs.html</a>. We felt that was a clearer designation and wouldn't rely upon a lot of external logic to infer preventative by deconstructing a SNOMED expression to identify \"at risk for disease\" (which could also be inaccurate in its association for preventative treatments).<br>\nAnyway, perhaps both of our needs merits at least a discussion to add treatment intent to the MedicationRequest resource, if not at least create a standard extension for it.</p>",
        "id": 249992489,
        "sender_full_name": "May Terry",
        "timestamp": 1629382435
    },
    {
        "content": "<p>I like the idea of adding an intent and a valueset. I presume these could be the intents  - Therapeutic, prophylactic, diagnostic, others. <br>\nIMO, a valueset and an explicit data element is better than inferrence from the procedure code.</p>",
        "id": 249995876,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1629383947
    },
    {
        "content": "<p>Presuming that such information is useful to share and should therefore be in the interfaces, I think a standard interface makes sense</p>",
        "id": 249996040,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1629384014
    },
    {
        "content": "<p>Thank you for this. I concur that having an element conveying the intent bound to the comprehensibe ValueSet {preventive, curative, diagnostic, palliative, supportive, forensic, screening, guidance} is more robust and straightforward. <br>\nI would be tempted to promote this element into the base standard resource MedicationRequest, naming it \"treatmentIntent\" rather than \"procedureIntent\" , because this name is more suitable for procedures which consist in medication administration, and also \"treatmentIntent\" already exists with this name in MedicationKnowledge (and should be bound to the same ValueSet).</p>",
        "id": 249999232,
        "sender_full_name": "François Macary",
        "timestamp": 1629385357
    },
    {
        "content": "<p>I suggest that you add a Jira issue <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span></p>",
        "id": 250031021,
        "sender_full_name": "Melva Peters",
        "timestamp": 1629399353
    },
    {
        "content": "<p>Jira created: <a href=\"https://jira.hl7.org/browse/FHIR-33219\">https://jira.hl7.org/browse/FHIR-33219</a></p>",
        "id": 250109595,
        "sender_full_name": "François Macary",
        "timestamp": 1629461540
    }
]