[
    {
        "content": "<p>Are you considering to add MedicationKnowledge as a possible type of reference in the MedicationRequest.Medication for the next versions?</p>",
        "id": 188121961,
        "sender_full_name": "Ernesto Quevedo Caballero",
        "timestamp": 1581610679
    },
    {
        "content": "<p>No.  MedicationKnowledge's scope is completely different from Medication and the MedRequest/Dispense/Statement/Administration resources just need a means to identify the medication (which is Medication's scope).  There is no need to link to MedKnowledge.</p>",
        "id": 188125255,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1581612550
    },
    {
        "content": "<p>I was looking at how to represent (in R4) the statement that a patient is <em>not</em> taking a specific medication. For both MedicationStatment (R4) and MedicationUsage (R5), the spec includes an example with the title \"Patient reports they are not taking Tylenol PM\" (<a href=\"https://www.hl7.org/fhir/medicationstatementexample2.html\">R4 example</a>, <a href=\"http://build.fhir.org/medicationusageexample2.html\">lates build R5 example</a>) which would match that. However, in both these examples it seems very hard to tell that it is about medications <em>not</em> being taken (at least for machines that cannot read the text in <code>note</code>).</p>\n<p>For the R4 example, the <code>status</code> is set to \"active\" and <code>statusReason</code> gives the SNOMED code for \"Liver enzymes abnormal\"; <code>note</code> contains \"Patient cannot take acetaminophen as per Dr instructions\".  But the status \"active\" is defined as meaning \"The medication is still being taken\" which contradicts the title &amp; note. So I would have expected <code>status</code> = \"not-taken\" (not a perfect match since it sounds like it suggests that patients should/could have taken the medication, but seems the closest). </p>\n<p>For the R5 example, the <code>status</code> is \"recorded\", the <code>reason</code> the same as the <code>statusReason</code> in the R4 version, and the <code>note</code> identical. The status seems appropriate, but  <code>reason</code> is  defined as \"[a] concept, Condition or observation that supports why the medication is being/was taken\", which, as it stands, seems to rule out that it can be a reason for smt. <em>not</em> being taken. Even if reasons for not-taking are allowed, a given reason does not necessarily imply \"taking\" or \"not taking\" - e.g. elevated blood pressure is a reason to take a blood-pressure lowering drug, but may be a reason <em>not</em> to take other drugs that e.g. could push it even higher.</p>\n<p>Based on that, I'm unsure how to proceed in R4. I'd like some representation that makes it easy for a system to automatically recognize that a medication is <em>not</em> being taken, but the examples make me wonder whether that easily doable.</p>",
        "id": 264142824,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1638963263
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 264161794,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638973470
    },
    {
        "content": "<p>hmm, you are quite correct that the example is wrong in both R4 and R5.  Can you create a JIRA issue for us to fix them?</p>\n<p>In R4: the status should be 'not-taken'<br>\nIn R5: we introduced the 'adherence' backbone element that would allow you to put 'not-taking' in the adherence.code (it's an example code so if you had better codes you could use those) and then put the reason why the patient is not taking (if needed) in adherence.reason.</p>",
        "id": 264186138,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1638983005
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> Thanks for the guidance, that should work for me - will open a JIRA ticket. </p>\n<p>Out of curiosity: For conditions, <a href=\"http://hl7.org/fhir/R4/condition.html#9.2.3.5\">the spec guidance</a> is not to use Condition to capture the fact that a patient does <em>not</em> have condition Y (unless it was previously believed to be the case) and instead use Questionnaire or Observation. Have similar approaches been considered or used for \"not taking X\"?</p>",
        "id": 264262820,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1639032429
    },
    {
        "content": "<p>JIRA <a href=\"https://jira.hl7.org/browse/FHIR-34437\">#FHIR-34437</a></p>",
        "id": 264263355,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1639033099
    },
    {
        "content": "<p>Hi,<br>\nI am working on HL7 v2 to FHIR mapping for RDE^O11. As per multiple discussions on Zulip, we have mapped RXC segment to ingredients of Medication received in RXO/RXE segment. I am unsure about how data will be received in v2.  Can someone please confirm if it is clinically possible to have different components of  the same Medication? Or there would be unique Medication Code in RXO/RXE for every combination of RXCs. For example,</p>\n<p>Message 1:<br>\n    RXO|123^TestMed^SNOMED|TAB|5|mg|125|ml|<br>\n    RXC|A|abc^Comp1^SNOMED||| <br>\n    RXC|B|xyz^Comp2^SNOMED||| </p>\n<p>Message 2:<br>\n    RXO|123^TestMed^SNOMED|TAB|5|mg|125|ml|<br>\n    RXC|A|pqr^Comp1^SNOMED||| <br>\n    RXC|B|xyz^Comp2^SNOMED|||</p>",
        "id": 265522769,
        "sender_full_name": "gauri raut",
        "timestamp": 1639978461
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span></p>",
        "id": 265576951,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640013831
    }
]