[
    {
        "content": "<p>I added some comments on #21301 . I do not agree with the decision of naming it differently, but that could be because of a different perspective - <br>\nAll xxxDefinition resources should  have the same concepts - especially for Products: Devices and Meds. However, it could be (?) that the MedicationKnowledge is overlapping with what we are doing with Catalog.</p>",
        "id": 167402197,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559749592
    },
    {
        "content": "<p>What is the best way to review and try to align perspectives? A few use cases to show that devices and meds are the same, and we try to focus on a common ground?</p>",
        "id": 167402284,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559749667
    },
    {
        "content": "<p>Just to be clear, I care a bit about the name, and a lot more if the name implies that the scope is not aligned.</p>",
        "id": 167402363,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559749695
    },
    {
        "content": "<p>if I use 1 resource to make a catalog of meds (formulary) and 2 resources for a catalog of devices, then what do I use to make a list of devices with meds and meds with devices? At the end of a discussion this should converge, i think. <br>\nNo urgency, but the longer we postpone, the harder it will feel to align.</p>",
        "id": 167402582,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559749824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span></p>",
        "id": 167402617,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559749853
    },
    {
        "content": "<p>I've responded to your comments on the item.</p>",
        "id": 167405366,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1559751681
    },
    {
        "content": "<p>I should note that implementers are currently using the List resource to return formulary information.  The use of Composition to hold CatalogEntry entries was deemed too limiting as the implementers didn't consider the response to a request for formulary information to be a document.  The people behind the Catalog profile might want to look at using List instead of Composition.</p>",
        "id": 167405644,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1559751849
    },
    {
        "content": "<p>List was an option too, we can revive it. that is good feedback.</p>",
        "id": 167406505,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559752471
    },
    {
        "content": "<p>as for the scope, I think there is some overlap/misalignment. not saying which one is right or wrong, but seems that there are 2 different ways to handle the contextual definitions of a resource - In the catalog or in the resource. whatever is the solution, should be one consistent approach.</p>",
        "id": 167406664,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559752619
    },
    {
        "content": "<p>Personally i am a bit lost with so many resources, when I implemented the solution was to go the other direction - one definitional object, which supports a graph of concepts. <br>\nI will need to see it implemented for real, non-IDMP cases like national drug concepts, clusters, ad-hoc clusters...</p>",
        "id": 167406787,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559752703
    },
    {
        "content": "<p>that was also the solution that made sense for openMedicine btw. So i need to see how this other approach would work, but i need to raise if we are making it different between meds and devices.</p>",
        "id": 167406896,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559752802
    },
    {
        "content": "<p>CatalogItem hasn't been approved yet and it's still problematic in that it's supplementing information about another resource that would typically be expected to live as part of that resource instance or in other resources that are already defined.  Catalog is an organizational function, not a definitional function.</p>",
        "id": 167411874,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559756217
    },
    {
        "content": "<p>A catalog contains definitions of items, and/including the relations between those items. for that we had a CatalogItem (previously entryDefinition). <br>\nI know this is not ideal, but I am looking for 1) the definitional resource for a medication. 2) what is the alignment of that with device, nutrition... if it is catalogItem or  built in resource, that is something we can leave to te details and harmonize later. <br>\nFor now, i look at consistency: I would not like to have a NutritionKnowledge, but if that becomes the standard, less bad. What I think is that medicationKnowledge is definitional but perhaps there is not clarity on what \"definitional\" means, and I may be missing something</p>",
        "id": 167413991,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559757901
    },
    {
        "content": "<blockquote>\n<p>I know this is not ideal, but I am looking for 1) the definitional resource for a medication. 2) what is the alignment of that with device, nutrition...</p>\n</blockquote>\n<p>As I mentioned in my response to your tracker comment, we don't have a traditional definitional resource of a medication.  The closest would probably be the RegulatedMedicinalProduct as that contains all of the information about a medication.</p>",
        "id": 167414197,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1559757988
    },
    {
        "content": "<p>We won't necessarily have alignment between different types of substances.  But we can define a pattern and encourage the divergences to be only those that are necessary/appropriate.</p>",
        "id": 167414396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559758125
    },
    {
        "content": "<p>From what I read, RegulateMedicinalProduct is  insufficient for most clinical catalogs as it stands today. It is representing one IDMP concept, which is clearly insufficient.<br>\nAnd I think there is the issue: Definition is not only made by the IDMP regulators. Definition is IMO when a national regulator defines the product and its use, or when a college decides a specific use for a drug, or when a hospital defines their maximum doses for a ward, or when a vendor defines the actual codes, or when a department defines the distribution rules.</p>",
        "id": 167415036,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559758447
    },
    {
        "content": "<blockquote>\n<p>We won't necessarily have alignment between different types of substances.  But we can define a pattern and encourage the divergences to be only those that are necessary/appropriate.</p>\n</blockquote>\n<p>\"different types of substances\" you mean between a med and nutrition, or between a generic and a brand product?</p>",
        "id": 167415113,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559758501
    },
    {
        "content": "<p>Right, and as I said, we don't really have a definitional resource that covers what you want.  Both RegMedProduct and MedKnowledge cover some of that scope but neither is intending to be truly definitional.</p>",
        "id": 167415161,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1559758507
    },
    {
        "content": "<blockquote>\n<p>Right, and as I said, we don't really have a definitional resource that covers what you want.  Both RegMedProduct and MedKnowledge cover some of that scope but neither is intending to be truly definitional.</p>\n</blockquote>\n<p>Yes, that was my concern. From research (openMedicine) and  implementation, my request is \"we need THAT first of all\". For the implementers to have something that works, and for sake of having something that can become a pattern.</p>",
        "id": 167415838,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559758994
    },
    {
        "content": "<p>Understood, except that no implementers have made that use case request - well, other than you perhaps?  The MedKnowledge resource was created explicitly to help implementers who needed to share their drug formulary and drug database information.  It is sort of definitional in that sense but not as complete as I think you'd like.</p>",
        "id": 167416055,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1559759142
    },
    {
        "content": "<p>curious to see requirements from those other developers who need their drug formulary and database but do not need what is common in Europe.</p>",
        "id": 167416673,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559759503
    },
    {
        "content": "<p>as i said, we have time, unless we want to close the scope now - i just need to raise the flag so that we don't think that it's all settled. I will gladly be proved wrong with a working example</p>",
        "id": 167416809,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559759584
    }
]