[
    {
        "content": "<p>I see that this has been removed. So the status can't be unknown, and there's no logical default value for legacy records? What's the intent here, and shouldn't this be discussed somewhere in the resource definition?</p>",
        "id": 265629618,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640043928
    },
    {
        "content": "<p>also, the documentation sill uses 'statement' liberally. But perhaps that should stay that way so it's easy to change it back ;-)</p>",
        "id": 265629694,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640043973
    },
    {
        "content": "<p>what I miss from earlier versions is the ability to say 'not-taken' explicitly. how would that be recorded now?</p>",
        "id": 265629741,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640044033
    },
    {
        "content": "<p>We changed this based on <a href=\"http://jira.hl7.org/browse/FHIR-32060\">FHIR-32060</a> which was submitted by Lloyd.  <a href=\"https://jira.hl7.org/browse/FHIR-32060\">https://jira.hl7.org/browse/FHIR-32060</a></p>",
        "id": 265639155,
        "sender_full_name": "Melva Peters",
        "timestamp": 1640052107
    },
    {
        "content": "<p>You can use MedicationUsage.adherence = not-taking to say that they are not taking explicitly.</p>",
        "id": 265639222,
        "sender_full_name": "Melva Peters",
        "timestamp": 1640052156
    },
    {
        "content": "<p>well, I think it might be useful to mention the presumption of accuracy somewhere</p>",
        "id": 265641347,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640054569
    },
    {
        "content": "<p>and I feel as though adherence = not-taking is slightly skewed because it assumes that there is an instruction to take it, and their might not have been. </p>\n<p>It's routine for people to get asked 'are you taking X' - that's a proper use of MedicationUsage, right?</p>",
        "id": 265641375,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640054635
    },
    {
        "content": "<p>the example <a href=\"https://hl7.org/fhir/5.0.0-snapshot1/medicationusageexample2.json.html\">https://hl7.org/fhir/5.0.0-snapshot1/medicationusageexample2.json.html</a> muddies the water quite a bit by being weirdly specific about the medication that's not being taken. (is some other dose being taken instead?) and by not including an adherence, and hiding the 'not-taking' bit in a non-processible text</p>",
        "id": 265641523,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640054820
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> on the use for recording \"not taking this med\". As discussed in <a href=\"#narrow/stream/179249-Medication/topic/MedicationRequest.2EMedication\">this thread</a> (which has a different title, looks like I accidentally posted a new question in an existing thread!), the \"not-taking\" examples are actually incorrect in both R4 and the newest build (this has been captured in JIRA <a href=\"https://jira.hl7.org/browse/FHIR-34437\">#FHIR-34437</a>).  A <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> argued in that thread, adherence \"not-taking\" should be the correct code for this example. But like Grahame, thinking about it know I also feel this is slightly misleading if it captures a response to a question like \"Are you taking medication X?\" - \"not-taking\" under adherence does sort of give the impression that the patient is ignoring advice given, although that is not implied at all by the question.</p>\n<p>For comparison: For conditions, the spec guidance is to <em>not</em> use Condition to capture the fact that a patient does not have condition Y (unless it was previously believed to be the case) and instead use Questionnaire or Observation. Have similar approaches been considered or used for \"not taking X\" for meds?</p>",
        "id": 265684095,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1640092962
    },
    {
        "content": "<p>I do not think 'not taking' is a good value for adherence.</p>",
        "id": 265719811,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1640111835
    },
    {
        "content": "<p>\"not taking as ordered\" is completely different from \"not taking, as ordered\". And \"not taking regardless of order\"</p>",
        "id": 265719965,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1640111918
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> I think the resource MedicationStatement acts as an observation in that sense - someone is noting/asserting that the patient is (not) taking a med</p>",
        "id": 265720150,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1640112034
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I guess the question then becomes if there is a better way to represent \"plain not taking\" (no implications about instructions) with MedicationStat/Usage.</p>",
        "id": 265794491,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1640173385
    },
    {
        "content": "<p>I think that should be the core aspect of MedStatement</p>",
        "id": 265794640,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1640173529
    },
    {
        "content": "<p>I.e. focus on whether it's being taken or not</p>",
        "id": 265794703,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1640173565
    },
    {
        "content": "<p>The adherence is not the main statement imo. Adherence can be an inference or assertion by someone else</p>",
        "id": 265794748,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1640173619
    },
    {
        "content": "<p>Adherence is always with respect to an order.  A patient might be not taking a medication - and that fully compliant with one order and non-compliant with a different order.</p>",
        "id": 265863217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640213310
    },
    {
        "content": "<p>that's my mother in law. GP counts her as adherent, and her specialist counts her as not. I'm really looking forward to Australian trying to create a reconciled medications record ;-)</p>",
        "id": 265966085,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640305991
    }
]