[
    {
        "content": "<p>A few things I noticed while implementing based on MedicationKnowledge:</p>\n<ul>\n<li>the resource does not have a name. It has a synonym. So where would the main name for the resource be? Is it the first synonym? or in code.coding.display? I think it should have a name, we should be able to profile and say that name is mandatory</li>\n<li>ingredient.item.isActive is no longer a boolean but a codeableconcept - which is great. But the name isActive hints at a boolean. Can this be changed?</li>\n</ul>",
        "id": 253330064,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631656550
    },
    {
        "content": "<ul>\n<li>(already discussed, I think ) - the link from MedicationKnowledge to Medication is strange, especially because the link from Medication to MedicationKnowledge seems much more common and is not there.</li>\n</ul>",
        "id": 253330550,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631656806
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I suggest you add Jira issues if you want something done about what you are raising.</p>",
        "id": 253348614,
        "sender_full_name": "Melva Peters",
        "timestamp": 1631668801
    },
    {
        "content": "<p>I was hoping for some discussion on these matters, namely the synonym thing.</p>",
        "id": 253382369,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631696287
    },
    {
        "content": "<p>Maybe there is a reason for a medication not to have an explicit name (I can't imagine one), or maybe there is some guidance of alternatives</p>",
        "id": 253382423,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631696335
    },
    {
        "content": "<p>a) yes, the name is expected to be part of the code.  If you think it should be different, please raise a JIRA issue<br>\nb) The new version of MedKnowledge fixes this, it will get into the build when the merge errors get resolved<br>\nc) In pharmacy/ehr systems that we surveyed, no one had a link from the information about what they prescribed/dispensed to the drug knowledge base record of that.  They all had it the other way - search for drugs, look at the knowledge base information about the drug, and then look at the links for the orderable/dispensable branded drugs that were associated with that knowledge base record.  If you have use cases for the opposite link, please raise a Jira issue.</p>",
        "id": 253439117,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1631721644
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179249-Medication/topic/MedicationKnowledge.20name/near/253382369\">said</a>:</p>\n<blockquote>\n<p>I was hoping for some discussion on these matters, namely the synonym thing.</p>\n</blockquote>\n<p>Discussion of these Pharmacy-related issues occurs at the Pharmacy WG as not all Pharmacy WG members participate in Zulip.  So the only real way to get discussion is to raise a Jira issue so that it becomes visible to the Pharmacy WG and we can then discuss it.</p>",
        "id": 253439481,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1631721729
    },
    {
        "content": "<p>I will. It's just that not all people in Zulip participate in the Pharmacy WGs, hence the broader discussion as we do for other resources</p>",
        "id": 253455128,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631726974
    }
]