[
    {
        "content": "<p>Hoping to get some immediate feedback from the Pharmacy WG community... we have a need in oncology to identify a \"treatment intent\" to identify whether a given medication is \"curative\" or \"palliative\".  We have created a profile called CancerRelatedMedicationStatement  (<a href=\"http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/StructureDefinition-mcode-cancer-related-medication-statement.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/StructureDefinition-mcode-cancer-related-medication-statement.html\">http://build.fhir.org/ig/HL7/fhir-mCODE-ig/branches/master/StructureDefinition-mcode-cancer-related-medication-statement.html</a>) where we created this as an extension.  It was suggested by one of our ballot commenters that we re-purpose MedicationStatement.category instead of creating an extension.  We however feel that it's not the same semantically with the medication statement category more in line with the setting (inpatient, outpatient, community, etc.).  Moreover would like to keep that as well as our need for a \"treatment intent\".  However, because the cardinality of category 0..1,  we can only choose either-or.  </p>\n<p><strong>Question</strong>:  Is it appropriate in this case for us to keep our extension for treatment intent as we have done in our mCODE FHIR IG?  <br>\ncc: <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> , <span class=\"user-mention\" data-user-id=\"243725\">@Caroline Potteiger</span></p>",
        "id": 188580239,
        "sender_full_name": "May Terry",
        "timestamp": 1582143115
    },
    {
        "content": "<p>I would agree that this seems perfect for the category data element.  We have changed category to be 0..* in R5.  Unfortunately, in R4, it is only 0..1, so if you wanted treatment-intent-category and setting-category, you'll need to use an extension.</p>",
        "id": 188581456,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1582144022
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> - we'll definitely note a change when R5 is out. For now, we'll keep the extension.</p>",
        "id": 188610028,
        "sender_full_name": "May Terry",
        "timestamp": 1582173822
    }
]