[
    {
        "content": "<p>Representing dose in MedicationAdministration.dosage or MedicationRequest.dosageInstruction<br>\n(both reference Dosage datatype)<br>\nReviewed 2 examples:<br>\n<a href=\"https://www.hl7.org/fhir/medicationadministration0310.html\">https://www.hl7.org/fhir/medicationadministration0310.html</a> This example demonstrates dose as a simpleQuantity with UOM drawn from UCUM. The medication code is an NDC code.<br>\n<a href=\"https://www.hl7.org/fhir/medicationadministration0306.html\">https://www.hl7.org/fhir/medicationadministration0306.html</a> This example demonstrates dose as a simpleQuantity with UOM drawn from v3-orderableDrugForm. The medication code is a SNOMED code.</p>\n<p>The guidance for datatype Quantity has this text: If the unit can be coded in UCUM and a code is provided, it SHOULD be a UCUM code. If a UCUM unit is provided in the code, then a canonical value can be generated for purposes of comparison between quantities.</p>\n<p>When evaluating a MedicationAdministration resource, how would an implementation know that a dose is represented as some multiple of the strength for the requested medication (10 mg) vs: a reference to the dose form (e.g. 2 tab)? Is the intent to find this information from the MedicationAdministration reference to Medication.ingredient.strength which is a ratio?</p>\n<p>Use case: transmitting cumulative dose information to a registry</p>",
        "id": 228797094,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1614873299
    },
    {
        "content": "<p>Hmm, we probably should make the 0306 example just not have a code.  Or use the \"{}\" notation, i.e. {TAB} which implies the unity unit.</p>\n<p>That aside, there isn't an easy answer to your question.  We had this problem in v3 implementations and we will still have it in FHIR.  It totally depends on your data and whether you can determine the amount of medicine in one unit of the Medication.  Strangely enough, I just saw this yesterday where my mother's prescription was changed from 100mg to 150mg.  It turns out that the medication she was prescribed comes in 100mg tablets, so the pharmacist had to turn the dosage on the request of 150 mg into 1.5 tablets.  I don't know if there would be anything other than the name of the drug that would have allowed that transformation.  The Medication resource isn't going to normally have strengths because the Medication.code would identify the manufactured product, so there wouldn't be any need for other information.  You'd need to consult your drug knowledge base and hopefully it would have the amount of drug provided.   If it just provided strengths as ratios of ingredients, then you'd be out of luck since you wouldn't know if the tablet was a 100mg, 250mg, or 400mg tablet since the strength ratios would be the same.</p>",
        "id": 228802126,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1614874688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  FYI</p>",
        "id": 229474458,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1615295920
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span>  i am guessing you intended to draw the attention of a different John than I... right?</p>",
        "id": 229481068,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615298597
    }
]