[
    {
        "content": "<p>I’m working in a scenario where we are dealing with many medications that have multiple (I.e. 2-3) active ingredients. Whilst these medications can usually be represented using a single drug catalog code, I’ve got a question about how best to represent the dosage in this scenario. </p>\n<p>For example:</p>\n<p>Piperacillin 4g Tazobactam 500mg</p>\n<p>Many clinical systems seem to store the dosage of the first active ingredient only. Some will use that and a knowledge of the ratio to automatically calculate the dosage of the second active ingredient. </p>\n<p>My question is: what is the best practice regarding how to represent dosage in FHIR?  Should I include multiple dosages, or a single dosage with some kind of ratio?</p>\n<p>Thanks.</p>",
        "id": 182144489,
        "sender_full_name": "Tim Blake",
        "timestamp": 1574990259
    },
    {
        "content": "<p>Some thoughts: Dosage is dosage of an item. <br>\nIf the item is in tablets, dosage can be in tablets, say 2 tablets<br>\nIf the item is a liquid, dosage can be in ml of the liquid.<br>\nThe complexity of the composition of the medication is in MedicationUsage.medication, which is a sibling of MedicationUsage.dosage.</p>",
        "id": 182145898,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1574993010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> Not quite sure what you're referring to with MedicationUsage?</p>",
        "id": 183108557,
        "sender_full_name": "Tim Blake",
        "timestamp": 1576016027
    },
    {
        "content": "<p>Upon further reading, isn't what I want to use the \"strength\" of relevant ingredients using Ratios?</p>",
        "id": 183108646,
        "sender_full_name": "Tim Blake",
        "timestamp": 1576016069
    },
    {
        "content": "<p>Strength represents the amount of the ingredient in the dosage form (for example, in your example, Piperacillin 4g).  The dosage of Piperacillin that is to be given is different.  My experience is that the dosage is often in text rather than structured. :(  Pharmacy has a change request to add a text line to represent the dosage of the overall MedicationRequest so you could say Give 4.5g Piperacillin and 700mg Tazobactam.  While you can include multiple dosage lines, there is no way to point those lines to a specific ingredient.  I would encourage you to add a JIRA issue for Pharmacy to consider with your specific use case.</p>",
        "id": 183109157,
        "sender_full_name": "Melva Peters",
        "timestamp": 1576016533
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  Can you please point me to where I raise a JIRA issue, as I haven't done that before.  As a workaround in the mean time, would a text based compound dosage be a reasonable approach, i.e. dosage = \"8g / 1000mg\"?</p>",
        "id": 183109625,
        "sender_full_name": "Tim Blake",
        "timestamp": 1576016928
    },
    {
        "content": "<p>Here's the link to JIRA. <a href=\"https://jira.hl7.org/projects/FHIR/issues/FHIR-18445?filter=allopenissues\" target=\"_blank\" title=\"https://jira.hl7.org/projects/FHIR/issues/FHIR-18445?filter=allopenissues\">https://jira.hl7.org/projects/FHIR/issues/FHIR-18445?filter=allopenissues</a> I would suggest you could use an extension -  we will be adding an attribute to MedicationRequest, Dispense and Statement that is a text field  called MedicationRequest.dosagetext</p>",
        "id": 183109755,
        "sender_full_name": "Melva Peters",
        "timestamp": 1576017088
    },
    {
        "content": "<p>Thanks.  But that's just a workaround.  In the longer term is there a way to link dosage statements to active ingredients for complex compound medications?</p>",
        "id": 183109936,
        "sender_full_name": "Tim Blake",
        "timestamp": 1576017248
    },
    {
        "content": "<p>Yes, that's a workaround.  Add the JIRA issue and join the Pharmacy WG call to ensure your requirements are met</p>",
        "id": 183109991,
        "sender_full_name": "Melva Peters",
        "timestamp": 1576017305
    },
    {
        "content": "<p>Okay, thanks.</p>",
        "id": 183110009,
        "sender_full_name": "Tim Blake",
        "timestamp": 1576017328
    },
    {
        "content": "<p>I just noticed that the name of the new attribute that has been proposed is renderedDosageInstruction rather than dosagetext.</p>",
        "id": 183110149,
        "sender_full_name": "Melva Peters",
        "timestamp": 1576017451
    },
    {
        "content": "<p>Of what type? string?</p>",
        "id": 183110217,
        "sender_full_name": "Tim Blake",
        "timestamp": 1576017485
    },
    {
        "content": "<p>Yes</p>",
        "id": 183110277,
        "sender_full_name": "Melva Peters",
        "timestamp": 1576017588
    }
]