[
    {
        "content": "<p>Question - I see some discussion of RxTerm in prior chats, but I'm wondering how it plays with FHIR resources. Would it be an element of a Medication resource? It certainly could be a ValueSet as a subset of the RxNorm CodeSystem, I imagine</p>",
        "id": 272340501,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1645141392
    },
    {
        "content": "<p><a href=\"https://lhncbc.nlm.nih.gov/MOR/RxTerms/\">RxTerm</a> RxTerms is a drug interface terminology derived from RxNorm for prescription writing or medication history recording (e.g. in e-prescribing systems, PHRs).</p>\n<p>Relative to Medication,  RxTerms could be used in a user interface to look up the product and RxNorm term to populate Medication.code</p>",
        "id": 272443213,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1645211023
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span>. So just to confirm, RxTerm is not a code system itself on the Medication resource; it's a way to guide users to select a Medication?</p>",
        "id": 273012439,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1645650910
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span>  Yes.  RxTerms is a subset of the structure (single table, select fields) and content (only US prescribable) of RxNorm.  A convenience provided by NLM for use in product selection.  NLM has a simple example of product lookup - <a href=\"https://rxterms.nlm.nih.gov/\">RxTerms Demo</a>.  The RXCUI found in RxTerms is the same as that found in RxNorm. when using the RXCUI (whether found in RxTerms or RxNorm) in a FHIR instance, coding.system is always <a href=\"http://www.nlm.nih.gov/research/umls/rxnorm\">http://www.nlm.nih.gov/research/umls/rxnorm</a>.</p>",
        "id": 273093074,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1645711548
    }
]