[
    {
        "content": "<p>MedicationRequest.substitution covers substitution of one medication for another.<br>\nIn Australia, in community prescribing and dispensing,  substitution of one brand for another is common, but substitution of one active ingredient for another is forbidden. In hospital prescribing, substitution of one active ingredient for another is permitted.<br>\nThe element MedicationRequest.substitution seems to be designed for active ingredient substitution, rather than brand substitution. It looks as if it cannot do both, e.g. cannot say \"can substitute brand, but not active ingredient\".</p>",
        "id": 153991761,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1535605357
    },
    {
        "content": "<p>No, you could totally do that with the proper terminology.  The existing value set is just an example and I've used different value sets to convey similar semantics to what you are asking for.  I can't find the specific value set that I used (I've archived that material) but it was something like \"All substitution allowed\", \"Stay in drug class\", \"Same Active Ingredient\", \"No Substitution\".</p>",
        "id": 153991762,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1535605601
    },
    {
        "content": "<p>I thought about that, but the element <a href=\"http://hl7.org/fhir/STU3/medicationrequest-definitions.html#MedicationRequest.substitution.reason\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/medicationrequest-definitions.html#MedicationRequest.substitution.reason\">MedicationRequest.substitution.reason</a> seems to be about <strong>why</strong> substitution is allowed/prohibited or why it was done.<br>\nUsing it to say \"this is the type of substitution I'm talking about\" seems like a misuse of the design.</p>",
        "id": 153991763,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1535606010
    },
    {
        "content": "<p>Yeah, we should probably tighten up our language here.  Because saying substitution.allowed = true with a reason of \"keep within the same drug class\" seems to be a common enough use case and I'm not sure we (the committee) meant to restrict that.</p>",
        "id": 153991765,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1535606127
    },
    {
        "content": "<p>Tracker item raised about this.</p>",
        "id": 153991766,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1535606302
    },
    {
        "content": "<p>The general case could be complex, if there is a need to record two types of substitution, both with reasons. e.g. type_of_substitution=\"brand but not drug\" with reasons \"to allow cheaper brands\" and \"prohibited by regulation\".<br>\nI think that I don't need two reason codes, so I'd be fine with the addition of a substitution type code element.</p>",
        "id": 153991769,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1535607144
    },
    {
        "content": "<p>Tracker <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17769&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17769&amp;start=0\">#17769</a></p>",
        "id": 153991770,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1535607552
    },
    {
        "content": "<p>In DSTU2, the MedicationDispense.substitution boolean is presumably set to True if the dispensed medication differs from the ordered medication. However, the MedicationOrder also supports substitution, allowing the pharmacist to specify a MedicationOrder.dispenseRequest.medication different from that ordered by the clinician.</p>\n<p>1. Does DSTU2 MedicationDispense.substitution indicate a difference from MedicationOrder.medication, MedicationOrder.dispenseRequest.medication, or either?<br>\n2. Should DSTU2 MedicationOrder.substitution reflect a difference within the MedicationOrder (.medication vs .dispenseRequest)?<br>\n3. In R4, there is no MedicationRequest.dispenseRequest.medication. If the pharmacist makes a substitution prior to Dispensing, do we expect the processing entity to revise the MedicationRequest? How would such a modification be flagged?<br>\nThis difficulty may result from different perspectives on the pharmacy process. We are supporting a pharmacy process where the MedicationOrder may pass through several states before resulting in a Dispense.</p>",
        "id": 164451514,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1556544241
    },
    {
        "content": "<p>Dispense (and the attributes incl substitution) is about what happened i.e. if there was a substitution.<br>\nMedRequest is about what is allowed to happen. so, starting with question 3. this is not flagged. it is a new medrequest - something the pharmacist says is planned to happen</p>",
        "id": 164457856,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1556548797
    },
    {
        "content": "<p>similar to v2 OMP/RXE</p>",
        "id": 164457925,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1556548832
    },
    {
        "content": "<p>1 and 2. i dont understand. substitution in a request is whether product ban be substituted</p>",
        "id": 164458023,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1556548912
    },
    {
        "content": "<p>MedicationOrder.substitution is about whether substitution is permitted, not about whether it's happened.</p>",
        "id": 164459086,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556549705
    },
    {
        "content": "<p>Reasons for changes between what's in the placer order and filler order are not reflected anywhere to my knowledge</p>",
        "id": 164459131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556549743
    },
    {
        "content": "<p>Thanks, Jose. Check my understanding:<br>\nFor R4, if the pharmacist tweaks the request, it's a new request. It may have the same native identifier, but the FHIR resource identifier is different; it's not just a version.<br>\nThat seems self-consistent, though it will make our design more complicated.</p>\n<p>Re questions 1 &amp; 2: DSTU2 MedicationOrder supports two medications: the root medication (which we are thinking is what the clincian said) and the dispenseRequest.medication, which is what we are thinking is how the Pharmacist interprets it. But before dispense.</p>",
        "id": 164459320,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1556549856
    },
    {
        "content": "<p>The dispenseRequest.medication has nothing to do with how the pharmacist interprets it.  It reflects the fact that you might order a product that comes packaged a particular way - e.g. with a device - and want to specify the code for that - but when you talk about administering you point to the specific drug, not the \"package\" to be dispensed.</p>",
        "id": 164460077,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556550450
    },
    {
        "content": "<p>That's very interesting. so, which is which? and why was it removed in R4?</p>",
        "id": 164463064,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1556552814
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> might be able to comment on reason for removal - my guess is that it was an 80% call.  The one on dispense was what was being authorized to be supplied, the higher level one was what was to be administered.</p>",
        "id": 164463400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556553036
    },
    {
        "content": "<p>It was removed much earlier in STU3 v1.6.  The Pharmacy WG would have to search hard to find out why, but I suspect we had feedback from implementers that they didn't handle this.</p>",
        "id": 164463420,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1556553058
    },
    {
        "content": "<p>The MedicationRequest.dispenseRequest.medication was removed as part of tracker 8476.  It didn't make sense to have two medication attributes so Pharmacy decided to remove the medication in the DispenseRequest attribute.  There is another tracker item 10406 from Lloyd that also points this out.</p>",
        "id": 164498908,
        "sender_full_name": "Melva Peters",
        "timestamp": 1556582118
    },
    {
        "content": "<p>Thanks. So the request identifies the clinically indicated substance (possibly a product but not preferably, contrary to DSTU2); and the product selection shows up in Dispense, right? In DSTU2 way may opt to ignore the dispenseRequest.medication to better align for migration to R4.</p>",
        "id": 164727771,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1556818380
    },
    {
        "content": "<p>more like (IMO)<br>\nclinically indicated substance goes into a request.<br>\nif there is a step to define what medication is to be dispensed, it goes into another medRequest (in v2 this is the RXE)<br>\nthen the medication actually dispensed is in the medDispense</p>\n<p>This is similar but better than V2 approach where you would have OMP and RXE, but the boundary between OMP and RXE was not clear in implementations. Now it is easy: as long as you are stating an intent, you use a request.</p>",
        "id": 164856258,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1556957003
    },
    {
        "content": "<p>I would indeed ignore MedicationRequest.DispenseRequest</p>",
        "id": 164856271,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1556957027
    },
    {
        "content": "<p>Many thanks Jose; I think that's where we're headed but good to hear stated clearly.</p>",
        "id": 164866676,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1556974018
    }
]