[
    {
        "content": "<p>Prinzipielle Fragen an die Runde:</p>\n<p>Gibt es schon eine Einigung über die zu verwendenden Codesysteme und Value sets?<br>\nCodes prinzipiell über LOINC, falls das möglich ist, sonst SCT, TNM, KBV, generisch?<br>\nValue sets in dieser Reihenfolge: <br>\nNormative Answer Lists von LOINC, falls vorhanden, sonst SCT, TNM, KBV, generisch?<br>\nGegenwärtig weichen vor allem die Value sets zwischen CCR und DKTK z.T. deutlich voneinander ab.<br>\nWas sagen die Terminologie-Experten?</p>\n<p>Werden generell zwei TNM-Kreise (von UICC-Stadien über alle TNM-Kategorien) in \"c\" und \"p\" getrennt, so wie das die Referenzterminologien handhaben?</p>\n<p>Werden die Suffixe \"mi\", \"i+\", \"i-\", \"mol+\", \"mol-\" separat modelliert oder in die betreffenden Value sets aufgenommen?</p>\n<p>Viele Grüße</p>\n<p>Gunter Haroske</p>",
        "id": 190956757,
        "sender_full_name": "Gunter Haroske",
        "timestamp": 1584524487
    },
    {
        "content": "<p>Ich denke das Allignment über die zu verwendenden codes und VS bekomme wir einerseits durch die anpassung der Profilierung an das im letzten Treffen gesagt hin, andererseits sollten wir dies (hier) diskutieren, sehr guter Punkt.</p>\n<p>Meine erste Erkenntnis in diesem Bereich: bei histologische Tumormarkertests ist der NCIT auch sehr gut geeignet</p>",
        "id": 190962906,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584528023
    },
    {
        "content": "<p>Was meinen die Anderen zu SnomedCT? Da es jetzt noch nicht für jeden frei verfügbar ist würde ich ungern SCT schon required/extensible irgendwo binden.</p>",
        "id": 190963293,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584528247
    },
    {
        "content": "<p>Relevante Systeme aus meiner Sicht: Loinc, NCIT, <a href=\"https://www.basisdatensatz.de/\" target=\"_blank\" title=\"https://www.basisdatensatz.de/\">https://www.basisdatensatz.de/</a> (ADT/GEKID), TNM, ggfs. KBV codierungen</p>",
        "id": 190963445,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584528331
    },
    {
        "content": "<p>Wenn es in richtung *omics geht kommen noch einige CS dazu: (HGNC, Sequenceontology, HGVS, ...)</p>",
        "id": 190963541,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584528373
    },
    {
        "content": "<p>Eben wegen der ziemlich großen Auswahl wäre eine Anwendungsstrategie m.Mn. hilfreich.</p>\n<p>Der Basisdatensatz ist aus meiner Sicht sowas von generisch, dass es mir schwerfällt, ihn als Codesystem zu nutzen. <br>\nTNM könnte Lizenzprobleme haben (?). Außerdem gibt es dafür keinen maschinenlesbaren Zugriff. Aber das dürfte kein Problem sein, wenn man die Mappings von LOINC oder SCT verwendet.</p>\n<p>KBV ist sehr deutsch, aber für einige wenige (administrative) Zwecke wohl nicht zu umgehen. </p>\n<p>Der NCIT ist medizinisch sehr gut gegliedert, aber gerade bei den Tumormarkern der Histologie wahrscheinlich SNOMED CT nicht überlegen. Wegen der Verfügbarkeit von SCT würde ich mir keine Sorgen mehr machen, in reichlich 9 Monaten kann jeder ...</p>",
        "id": 190997650,
        "sender_full_name": "Gunter Haroske",
        "timestamp": 1584545625
    },
    {
        "content": "<p>Wenn SnomedCT für alle verfügbar ist, dann gerne. Momentan gibt es ja nur die MII Lizenz. <br>\nSobald die nationale Lizenz vorhanden ist würde ich dann auf SCT migrireren. Von NCIT auf SnomedCT können dann ConceptMaps angelegt werden.</p>",
        "id": 191096167,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584614998
    },
    {
        "content": "<p>Das leuchtet mir ein.<br>\nIm Moment reden wir ja SCT betreffend nur über \"eine Hand voll\" von Konzepten, die wir für die Onkologie brauchen. Diese sind aber oft deutlich besser geeignet als die im Moment vorgeschlagenen, z.B. für die TNM-Präfixe a, r, y. Die treffen in SCT genau, in LOINC, wie jetzt vorgeschlagen, sind die Codes sogar sachlich falsch. An anderer Stelle, wie bei den UICC/AJCC-Tumorstadien, sind LOINC Konzepte wieder sicherlich besser, als generische VS, die aus dem TNM abgeschrieben wurden. Oder sind das  \"echte\" Codes? <br>\nWir sollten das Schritt für Schritt durchgehen und die Vor- und Nachteile diskutieren. Am besten mit Terminologie-Spezialisten.</p>",
        "id": 191220627,
        "sender_full_name": "Gunter Haroske",
        "timestamp": 1584698115
    },
    {
        "content": "<p>Danke für das Feedback. Ich bin ganz ihrer Meinung. Das Thema muss strukturiert und terminologischer Beratung angegangen werden.</p>",
        "id": 191223751,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584700001
    },
    {
        "content": "<p>Die Fragen gehören zum TC Terminologien: <span class=\"user-mention\" data-user-id=\"194953\">@Heike Dewenter</span> <span class=\"user-mention\" data-user-id=\"220379\">@Elisabeth Pantazoglou</span> </p>\n<p>Ganz grob empfehle ich mit der Aussicht auf kurzfristige Mitgliedschaft die Reihenfolge: SCT, LOINC, HL7 Value Sets. Prop. dt. Konzepte sollten in diesem Rahmen nach SCT gemappt werden (siehe ADT/GEKID-Aktivität von uns), sofern möglich und ggf. dt. Extensions in SCT vorbereitet werden.</p>",
        "id": 191428201,
        "sender_full_name": "Sylvia Thun",
        "timestamp": 1584931179
    },
    {
        "content": "<p>Ich wäre bei SCT eher für oncological extensions - zusammen mit anderen Ländern...</p>",
        "id": 191439777,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1584949438
    },
    {
        "content": "<p>Ich gebe zu bedenken, dass wir jetzt in SCT definieren wir noch einige Nutzer ausschließen die keine Lizenz haben. Sobald die nationale Lizenz da ist kann man sehr gerne umstellen.</p>",
        "id": 191443684,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584952275
    }
]