[
    {
        "content": "<p>\"Histologie\" bedeutet für Pathologen viel mehr, als vorliegendes Konzept hier wirklich meint. \"Histologie\" meint die morphologische feingewebliche Charakteristik einer Läsion, eines Gewebes, eines Organs, die sich in einer Vielzahl von Konzepten niederschlägt. Im Profil geht es jedoch um eine international vereinbarte Tumorklassifikation.</p>\n<p>Das Profil \"Histologie\" sollte daher in \"Histologischer Tumortyp\" umbenannt und wie folgt definiert werden:</p>\n<p>\"Histologischer Tumortyp gibt an, wie ein Tumor gemäß seiner histologischen Charakteristik klassifiziert wird, basierend auf der aktuellen WHO-Klassifikation (in den \"blue books\"), resultierend in einer ICD-O-3 Klassifizierung oder einer deren Systematik entsprechenden.\"</p>\n<p>Die CS-Version im value (ICDOVersionVS) ist wiederum sehr genuin (ist ADT-Gekid ein semantischer Standard?) und durch die genauere vorgeschlagene Definition eigentlich überflüssig.</p>",
        "id": 211417983,
        "sender_full_name": "Gunter Haroske",
        "timestamp": 1601215310
    },
    {
        "content": "<p>Aufbauend auf die Anmerkungen: Wie geht man eigentlich damit um, wenn man nur einen Code für eine \"Achse\" der ICD-O verwenden möchte? Also z.B. nur den Histologiecode-Teil. Ich bekomme mit der System-URN für ICD-O-3 dann eine Fehlermeldung (Code ungültig) vom tx.fhir server....</p>",
        "id": 217649409,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1606148548
    },
    {
        "content": "<p>wie genau ist das icd-o-3 VS aufgebaut? Iirc wirft das bei uns keine Fehler.</p>",
        "id": 217654957,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1606151115
    },
    {
        "content": "<p>ICD-O-3 hat zwei Achsen, Topographie (C-Achse) und Morphologie (M-Achse). Im Profil Histologie wird nur nach der M-Achse kodiert! Insofern dürfte das keine Fehlermeldung generieren. Ist der Value formal richtig ? (\"This value set includes codes from the following code systems:<br>\nInclude codes from urn:oid:2.16.840.1.113883.6.43.1 where code Regex \\d\\d\\d\\d/\\d\")???</p>",
        "id": 217869460,
        "sender_full_name": "Gunter Haroske",
        "timestamp": 1606301734
    }
]