[
    {
        "content": "<p>Hallo,<br>\nich beschäftige mich in meiner Masterarbeit mit der Datenübertragung zwischen den klinischen Krebsregistern und dem IQTIG als Bundesauswertungsstelle. Der Fokus liegt dabei auf den Daten zum Prostatakarzinom.<br>\nIch konnte mit meinem Thema eine Kommilitonin für FHIR begeistern und sie möchte ebenfalls etwas in diese Richtung machen, weiß aber nicht so wirklich, welche Firmen mit FHIR arbeiten, was es für Projekte gibt und wen man am besten ansprechen sollte. Als sie mir von ihren Plänen und Problemen berichtete, dachte ich ziemlich schnell an dieses Projekt. Bei dem Treffen im Februar hatte ich den Eindruck, dass die Umsetzung auch personalmäßig schwierig werden könnte. Wäre es evtl. eine gute Möglichkeit einen Einstieg über eine Masterabreit zu bekommen? Möglichwerweise könnte diese das Projekt etwas vorantreiben. Vielleicht ist das Thema aber auch zu komplex. Gute Vorarbeiten, auf denen man aufbauen kann, sind ja vorhanden. <br>\nMich würde eure Meinung dazu interessieren: Wäre das ein gutes Thema für eine Masterarbeit, ist es zu komplett/speziell, könnte man es evtl. auf einen bestimmten Teil des Projektes begrenzen?<br>\nEs würde uns freuen wenn ihr euch dazu äußern würdet :)<br>\nVG Luise</p>",
        "id": 204681103,
        "sender_full_name": "Luise Oeppert",
        "timestamp": 1595431579
    },
    {
        "content": "<p>Am besten wenden Sie sich an Tobias Hartz, den Leiter des KKR Niedersachsen. Bisher scheint FHIR bei den Krebsregistern allerdings noch keine Rolle zu spielen. Somit gibt es auch bisher keine Firma, die entsprechende Lösungen anbieten. Es gibt aber Projekte in der Pathologie, die das zum Ziel haben.<br>\nVG Gunter Haroske</p>",
        "id": 204767287,
        "sender_full_name": "Gunter Haroske",
        "timestamp": 1595489207
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"238510\">@Luise Oeppert</span> wir am MOLIT Institut beschäftigen uns mit ADT/GKID FHIR Mapping (Motivation ist das Nutzen der ADT/GKID Daten als bereits existente und strukturierte Informationsquelle der Fallgeschichte innerhalb unseres Tumorboards).</p>",
        "id": 204796620,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1595510895
    },
    {
        "content": "<p>Zeitlich kam das in letzter Zeit wegen mehreren Covid19 Projekten etwas zu kurz.</p>",
        "id": 204796684,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1595510930
    },
    {
        "content": "<p>Danke :)<br>\nIch werde das mal so an meine Kommilitonin weitergeben.</p>",
        "id": 205222344,
        "sender_full_name": "Luise Oeppert",
        "timestamp": 1595934185
    }
]