[
    {
        "content": "<p>Hallo Zusammen,</p>\n<p>im Nachgang zu unserem Treffen ist mir noch aufgefallen, dass wir für die QS die Standortnummer eines Krankenhauses/von Ambulanzen benötigen. Dieses Kennzeichen wurde damals für die QS des G-BA eingeführt und ist abrechnungsrelevant (liegt bei den Kassen vor). Wir müssen nämlich im IQTIG unsere Auswertungen standortbezogen durchführen, nicht auf Krankenhausebene.</p>\n<p>Bis 2019 war die Standortnummer eine zweistellige Zahl (00-99), die der IKNR zugeordnet wurde. Jedes Krankenhaus hat da gemacht was es für richtig hielt. Seit 2020 gibt es beim InEK ein zentrales Standortregister. Die neuen Standortnummern sind 9-stellig. Sie beginnen immer mit \"77\" um den Unterschied zur Betriebsstättennummer zu zeigen. Anschließend folgen 4 Zahlen, die den Standort eindeutig kennzeichnen. Abschließend kommt \"000\". Ambulanzen erhalbte die ersten sechs Stellen des KH-Standorts dem diese zugeordnet sind. Die siebente Stelle ist eine \"0\", die 8. und 9. Stelle kennzeichnet den Ambulanztyp.</p>\n<p>Hier ist die Definition: <a href=\"https://www.dkgev.de/fileadmin/default/Mediapool/2_Themen/2.1_Digitalisierung_Daten/2.1.2._Informationstechnik_im_Krankenhaus/2.1.2.1._Verzeichnisse_und_Register/Vereinbarungen_Standortverzeichnis.pdf\" title=\"https://www.dkgev.de/fileadmin/default/Mediapool/2_Themen/2.1_Digitalisierung_Daten/2.1.2._Informationstechnik_im_Krankenhaus/2.1.2.1._Verzeichnisse_und_Register/Vereinbarungen_Standortverzeichnis.pdf\">https://www.dkgev.de/fileadmin/default/Mediapool/2_Themen/2.1_Digitalisierung_Daten/2.1.2._Informationstechnik_im_Krankenhaus/2.1.2.1._Verzeichnisse_und_Register/Vereinbarungen_Standortverzeichnis.pdf</a></p>\n<p>Können wir das Feld mit aufnehmen? Ich werde auch gleich noch einmal auf Kees Kleihues-van Tol zugehen und fragen ob das auch im ADT/GEKID mit aufgenommen werden kann.</p>\n<p>Noch eine Ergänzung: Die ersten 6 Stellen der Standortnummer (die den Krankenhausstandort beschreiben) werden auch als Standort-ID bezeichnet. Diese ID benötigen wir im IQTIG. Wenn es noch Ambulanzen gibt, dann wird das Gesamtkonstrukt (Standort-ID + 0XY) als Standortnummer bezeichnet. Falls das in der Modellierung gesondert berücksichtigt werden muss wollte ich das noch erwähnen.</p>\n<p>Viele Grüße<br>\nJens</p>",
        "id": 191858258,
        "sender_full_name": "Jens Meier",
        "timestamp": 1585215151
    }
]