[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"195036\">Carol Macumber</span> <a href=\"#narrow/stream/179202-terminology/topic/Using.20multiple.20codes.20with.20CodeableConcept.20Datatype/near/237695703\">said</a>:</p>\n<blockquote>\n<p>I don't see it in the list of terminologies supported when I do <a href=\"http://tx.fhir.org/r4/metadata?mode=terminology\">http://tx.fhir.org/r4/metadata?mode=terminology</a>, ...</p>\n</blockquote>\n<p>The search parameter \"mode=terminology\" caught my eye.  Where is that defined? <a href=\"http://hl7.org/fhir/R4/searchparameter-registry.html\">http://hl7.org/fhir/R4/searchparameter-registry.html</a> shows \"mode\" for CapabilityStatement tied to <a href=\"http://hl7.org/fhir/R4/capabilitystatement-definitions.html#CapabilityStatement.rest.mode\">rest.mode</a> and a values set <a href=\"http://hl7.org/fhir/R4/valueset-restful-capability-mode.html\">binding</a> with only \"client\" and \"server\".  Are search parameters for [base]/metadata defined somewhere else and different from CapabilityStatement?</p>",
        "id": 237825173,
        "sender_full_name": "Paul Denning",
        "timestamp": 1620395203
    },
    {
        "content": "<p>mode=terminology is a pre-adoption of the CapabilityStatement2 proposal where you can ask filtered questions about what a server does rather than getting a dump of absolutely everything.</p>",
        "id": 237844729,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620402463
    },
    {
        "content": "<p>The approach is still a work in progress and certainly isn't something widely supported.  Depending how things go at ballot, it might not even make it into the official spec</p>",
        "id": 237844867,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620402508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> that's incorrect. The response to metadata?mode=terminology should be a TerminologyCapabilities resource, and that's been the case since R4. That resource remained at FMM Level 0 for quite some time, but is now at FMM Level 1 - see <a href=\"http://build.fhir.org/terminologycapabilities.html\">http://build.fhir.org/terminologycapabilities.html</a>.</p>\n<p>For an implementations example GET <a href=\"https://terminz.azurewebsites.net/fhir/metadata?mode=terminology\">https://terminz.azurewebsites.net/fhir/metadata?mode=terminology</a></p>",
        "id": 237903485,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620429235
    },
    {
        "content": "<p>I don't think that's defined on the http page or the CapabilityStatement page - and I believe TerminologyCapabilities is slated to be deprecated as part of the CapabilityStatement2 approach</p>",
        "id": 237912047,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620436115
    },
    {
        "content": "<p>It IS defined on the RESTful API page here... <a href=\"http://hl7.org/fhir/2021Mar/http.html#capabilities\">http://hl7.org/fhir/2021Mar/http.html#capabilities</a> - and that page has a Maturity Level of normative. Also, the TerminologyCapabilities resource is owned by the Vocabulary WG, not FHIR-I, and I haven't heard any discussions in their meetings about deprecating it.</p>",
        "id": 237939902,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620464322
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?  Not sure how the return of a non-normative resource can be normative...</p>",
        "id": 237961689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620485834
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> If this is what you are saying, I don't think that TerminologyCapabilities is <strong>returning</strong> - it's more like the understanding of the Vocab WG (I agree with Peter) is that it is <strong>staying</strong>.  If your statement is correct, then it seems that there has been a pretty significant lack of communication that needs to be addressed with the Vocab WG (as soon as possible).</p>",
        "id": 238008853,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1620536208
    },
    {
        "content": "<p>What I take away as \"normative\" here is that the API <code>[base]/fhir/metadata?mode=terminology</code> exists and that it results in a Resource of type <code>TerminologyCapabilities</code>.  That <code>TerminologyCapabilities</code> is not itself normative simply means that its contents cannot yet be relied upon not to change.</p>",
        "id": 238009398,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1620536775
    },
    {
        "content": "<p>Non-normative resources can change or be removed entirely - especially low maturity ones or ones that aren't even STU.  I could be mistaken about the plans for TerminologyCapabilities specifically, but certainly the intention of CapabilityStatement2 was to provide a more generic means of querying a system for their 'capabilities' without needing to introduce new resources for every subset of capabilities that might be of interest.</p>",
        "id": 238038035,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620568959
    },
    {
        "content": "<p>it's certainly never been agreed that any new approach to CapabilitiesStatement will render TerminologyCapabilities redundant. You certainly wish that it will be the case, but that doesn't mean that we all agree about that. As conceived, CapabilitiesStatement2 appears to fall short to me. </p>\n<p>It is true that there's a normative interaction that refers to a non-normative resource; we can deprecate that it we need to</p>",
        "id": 238064536,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620597205
    },
    {
        "content": "<p>Is there a good place to go to catch up on CapabilitiesStatement2, it's design goals, etc.?  The spec itself seems pretty thin at the moment.</p>",
        "id": 238068009,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1620601029
    },
    {
        "content": "<p>the work is thin at the moment</p>",
        "id": 238068161,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620601217
    },
    {
        "content": "<p>right, so a search on <code>capabilitystatement2</code> seems to be reasonably useful. <a href=\"#narrow/search/capabilitystatement2\">https://chat.fhir.org/#narrow/search/capabilitystatement2</a></p>",
        "id": 238073221,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1620606859
    }
]