[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Is is easy to create the BE SNOMED cache file? Now that we can use our own tx server...</p>",
        "id": 258902219,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635115089
    },
    {
        "content": "<p>I  just want to see if I can do it myself, of it is a long and delivate process. And I don't mean to add it to the <a href=\"http://tx.fhir.org\">tx.fhir.org</a>, I just want to have the cache file, so that I can create a local instance</p>",
        "id": 258902243,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635115152
    },
    {
        "content": "<p>Sure, <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>.  It might be \"easy\" - or not quite so \"easy\".  I think it would be great to work through it with you, and I can apprise you of the things that I've learned along the way.  And assuming that we are able to get there (which I'm sure we will be), I think we definitely would be interested in hosting it on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>, in addition to you doing it on your own instance (assuming the licensing is ok for that).  One thing I'm interested in knowing is if it the Belgian Edition is distributed as a full edition, or as the Belgian extension to use with the International Edition.  Either way works, it's just that there is an extra step to do if it's only distributed as the extension.  Let me know if you have time and want to take a look at it with me.</p>",
        "id": 258902659,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1635115815
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> . The BE SNOMED CT is available as an extension based on the 2021July International edition</p>",
        "id": 258903315,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635116772
    },
    {
        "content": "<p>I'll ping you tomorrow if that's ok, to plan for a call</p>",
        "id": 258903323,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635116800
    },
    {
        "content": "<p>Yes, that would be great.</p>",
        "id": 258903348,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1635116851
    },
    {
        "content": "<p>I would have suggested tomorrow morning (my time), but that is going to be a little busier than usual tomorrow, with the SNOMED CT business meeting and a brief presentation that I am giving there on IPS.  3:00 PM CDT (22:00 CEST) should be pretty good for me (of course that's rather on the late side for you).</p>",
        "id": 258903644,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1635117253
    },
    {
        "content": "<p>10 pm CEST is doable, thanks</p>",
        "id": 258965999,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635171807
    }
]