[
    {
        "content": "<p>I have an interesting situation under consideration. tl:dr - I would like to add two new codes as children to a current code that I want to deprecate to encourage use of the two more specific codes while maintaining backwards compatibility to data using the old \"parent\" code. The intention would be that if/when EXPERIENCE is ever retired, the two new codes would be promoted to level 1 codes. Do we think this is acceptable?</p>\n<p>The specifics involve ObservationValue code system, the <a href=\"https://terminology.hl7.org/CodeSystem-v3-ObservationValue.html#v3-ObservationValue-_ObservationMeasureType\">_ObservationMeasureType</a> hierarchy that was created, and is used by the quality measure community. There is a need to separate out (and clarify)  using two new codes for each of PATIENT EXPERIENCE and PATIENT ENGAGEMENT distinct types of measures instead of using EXPERIENCE for either. But the EXPERIENCE concept has been in use and actually aligns with other documentation (in the US, the CMS blueprint) that will continue. By deprecating EXPERIENCE we signal to not use it anymore but we keep it available as a non-retired code for those that <em>must</em> use it. </p>\n<p>I'm interested in comments on this approach. Also wonder if non CMS eCQM users (<span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span>  SANER?) or <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> Patient Engagement have issues.</p>",
        "id": 254746975,
        "sender_full_name": "Robert McClure",
        "timestamp": 1632506682
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  I think it might be best to keep the parent code (not deprecate or eventually retire it?), for the historical data reason that you mentioned and maybe also for other potential use as a grouper, but mark it as <code>http://hl7.org/fhir/concept-properties#notSelectable</code> (i.e. \"abstract\").  In that case (assuming the terminology server supports it), it should show up in the value set expansion as expansion.contains.abstract = 'true' - which of course means that it shouldn't be used as the code in any new instances, and one of the child codes that you've added should be selected instead.</p>",
        "id": 254749672,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1632507797
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Interesting suggestion. My primary concern is the frequency that \"notSelectable\" is ignored whereas Deprecated is a clear status - that admittedly can also be ignored. Still, that is a good suggestion.</p>",
        "id": 254755903,
        "sender_full_name": "Robert McClure",
        "timestamp": 1632510329
    },
    {
        "content": "<p>Note that you can yank a code from a value set without deprecating it in the code system.</p>",
        "id": 254760359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632512251
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> good point, but the broader context of use for the CMS users includes generalizing to EXPERIENCE so best we keep it \"in view\" within the value set. I'm thinking Rob's suggestion is actually best - to make it abstract. Then perhaps once it's not used in the Blueprint, we remove it from the value set.</p>",
        "id": 254935697,
        "sender_full_name": "Robert McClure",
        "timestamp": 1632666831
    },
    {
        "content": "<p>you could mark it as both deprecated AND abstract; then $expand calls with <code>excludeInactive=true</code> will ignore it</p>",
        "id": 255509598,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1632970774
    },
    {
        "content": "<p>You should ask quality <span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span>   At NYP we have an entire division on Patient Experience and it doesn't mean the same as engagement or empowerment.  My impression is in the US we have several programs that measure experience.</p>",
        "id": 256003352,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1633320156
    },
    {
        "content": "<p>Sorry for the delay in following up. We were waiting for further input. The measureType value set is incorporated into the ObservationValue code system, managed by Orders and Observations. So the change will require approval by CQI and OO. Discussion at the January 2022 WGM suggested that the current definition of Experience covers both patient experience and patient engagement. Experience definition: \"A measure related to the level of patient engagement or patient experience of care.\" [https://terminology.hl7.org/CodeSystem-v3-ObservationValue.html#v3-ObservationValue-_ObservationMeasureType]. So the suggested approach is to make \"patientExperience\" and \"patientEngagement\" children of \"Experience\" and set \"experience\" as non-selectable; I.e., only the children should be selectable.  Moreover, the definitions of the two new items need clarification.  Suggestions:  (1) Patient experience: \"Patient experience encompasses the range of interactions that patients have with the health care system, including their care from health plans, and from doctors, nurses, and staff in hospitals, physician practices, and other health care facilities. As an integral component of health care quality, patient experience includes several aspects of health care delivery that patients value highly when they seek and receive care, such as getting timely appointments, easy access to information, and good communication with health care providers.\" (Reference:  <br>\n<a href=\"https://www.ahrq.gov/cahps/about-cahps/patient-experience/index.html\">https://www.ahrq.gov/cahps/about-cahps/patient-experience/index.html</a>); and (2) PatientEngagement, \"a broad concept that combines patient activation with interventions designed to increase activation and promote positive patient behavior, such as obtaining preventive care or exercising regularly.\" (Reference: <a href=\"https://www.healthaffairs.org/do/10.1377/hpb20130214.898775/full/\">https://www.healthaffairs.org/do/10.1377/hpb20130214.898775/full/</a>).  Please comment on (A). Appropriateness of creating 2 children for \"Experience\" as noted and making \"Experience\" non-selectable; and (B) the new suggested definitions of patientExperience and patientEngagement.   Thank you.</p>",
        "id": 270082840,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1643654655
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span></p>",
        "id": 270099344,
        "sender_full_name": "Abdullah Rafiqi",
        "timestamp": 1643660740
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span> Makes sense to me. I like the definitions except I'd like to not use the word \"measure\" in the Experience concept definition. Either \"Representation of patient engagement...\" or \"Assessment of patient engagement...\"  I'm fine with making Experience \"Nonselectable\" and the two concepts as children. I agree the two definitions are sufficiently distinct and are both types of experience, and we'd want one or the other.</p>",
        "id": 271010987,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644254266
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I agree with your assessment of the Experience definition. My understanding was that we would be challenged trying to change the definition of an existing item (I.e., experience). One suggestion had been to change the definition of experience to remove the reference to engagement but the decision was changing the meaning of the existing term would be poor vocabulary practice.  Can we remove the word \"measure\" from the existing definition?</p>",
        "id": 271014036,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644255509
    },
    {
        "content": "<p>I don't remember the original definition but the new one does not change the meaning from what I'd assume it was intended to be. You can clarify but you should not change. And the gray area situations intend to align with current <em>usage</em> even if that is not perfectly aligned with the stated definition.</p>",
        "id": 271017273,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644256734
    }
]