[
    {
        "content": "<p>the FHIR terminology services work really well for FHIR content. They work less well if you want to use the terminology services with v2, CDA, or openEHR. </p>",
        "id": 153893930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497490692
    },
    {
        "content": "<p>the fundamental issue for all these is that they don't use URIs for representing code system identifiers</p>",
        "id": 153893931,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497490712
    },
    {
        "content": "<p>CDA kind of does, in that it uses OIDs (which can be prefixed in a URI), but it's not the same URI. </p>",
        "id": 153893932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497490737
    },
    {
        "content": "<p>V2 uses a fixed string identifier (mostly) . So does openEHR. A different fixed identifier, of course. </p>",
        "id": 153893933,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497490765
    },
    {
        "content": "<p>I'm interested in opinions as to what we should do to make the terminology services work really well in those contexts ?</p>",
        "id": 153893934,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497490785
    },
    {
        "content": "<p>straw man idea:</p>",
        "id": 153893935,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497490792
    },
    {
        "content": "<ul>\n<li>define an extension for CDA, v2, and openEHR identifier on code systems. </li>\n<li>update the terminology services so that they accept these in coding.system from the client in place of the right FHIR URIs</li>\n<li>also, to return those extensions, if the client requests those identifiers</li>\n</ul>",
        "id": 153893936,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497490879
    },
    {
        "content": "<p>thoughts?</p>",
        "id": 153893937,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497490882
    },
    {
        "content": "<p>I tried to come up with a deterministic way when working on the IHE profiles. We decided to just warn the implementers that in some cases a lookup-table would be needed.  Yes, it would be nice if the FHIR terminology services allowed for a list of alias (0..*). These would be searchable, but marked only for use when URI is not possible.  Yes, please... and then I can update the IHE text...</p>",
        "id": 153893996,
        "sender_full_name": "John Moehrke",
        "timestamp": 1497532304
    },
    {
        "content": "<p>So the URI in coding.system on a request in this case would be the URL of the CDS, v2, or openEHR extension?</p>",
        "id": 153894385,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1497893763
    },
    {
        "content": "<p>not a url? I don't actually know. </p>",
        "id": 153894418,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497906796
    }
]