[
    {
        "content": "<p>In the Argonaut discussion on race <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> made the comment that \"in general the coding should encompass the concept, not be narrower than it\", and I've heard similar comments from others over the months/years.  This seems to indicate that refining concept granularity isn't a valid use case for alternate codings.  However the CodeableConcept type description includes the wording \"codings may have slightly different granularity due to the differences in the definitions of the underlying codes\".</p>\n<p>My question is, if there is an existing coding for a concept (e.g. an ICD-9 code for a Condition) and a person/system adds a more granular ICD-10 code (that convey meaning that the original code could not), is that expected use?  The concept has essentially \"moved\" from the original to the narrower concept by this process.  We've many use cases where a sub-specialist defines codes more granular than standard codes and would like to retro-actively add these super-specific codings.</p>",
        "id": 153850495,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1474578116
    },
    {
        "content": "<p>be aware of the difference between SHALL and SHOULD. Lloyd will be using these carefully; you are allowed to put codes of different granularity in a set of Codings, but it's mostly a bad/unsafe idea</p>",
        "id": 153850500,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474579596
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191351\">@Chris Grenz</span> What that text means that you might have a codes from different systems that say \"lung infection\", \"pneumonia\", \"viral pneumonia\" and \"severe viral pneumonia\" for a concept of \"confirmed, sudden onset severe viral pneumonia likely caused by organism X\".  But you shouldn't send codes for \"servere\" and \"viral\" and \"pneumonia\" to convey the concept.  So in your case, sending the most specific ICD-9 and the most specific ICD-10 (and the most specific SNOMED, for that matter) code is definitely expected use.</p>",
        "id": 153850501,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474579624
    },
    {
        "content": "<p>\"... but it's mostly a bad/unsafe idea\"  ????  We explicitly recommend this approach  for the Vitals Profile.   We want the broad concept here and the more granular as a coding if you want to.  So I have \"Body height by tape measure\" or \"laser beam\" -  ti doesn't seem unsafe to stick under plain old \"body height\".   In the end I think its a case by case decision.  </p>",
        "id": 153850713,
        "sender_full_name": "Eric Haas",
        "timestamp": 1474850233
    }
]