[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> - my attention has just been drawn to this: <a href=\"http://www.fhir.org/guides/argonaut/r2/ValueSet-condition-category.xml.html\" target=\"_blank\" title=\"http://www.fhir.org/guides/argonaut/r2/ValueSet-condition-category.xml.html\">http://www.fhir.org/guides/argonaut/r2/ValueSet-condition-category.xml.html</a>. Is there any reality behind the code system \"<a href=\"http://argonaut.hl7.org\" target=\"_blank\" title=\"http://argonaut.hl7.org\">http://argonaut.hl7.org</a>\"?</p>",
        "id": 153963945,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526941604
    },
    {
        "content": "<p>Just a local code system we used during development -- for US Core (STU3) see <a href=\"http://hl7.org/fhir/us/core/ValueSet-us-core-condition-category.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/ValueSet-us-core-condition-category.html\">http://hl7.org/fhir/us/core/ValueSet-us-core-condition-category.html</a></p>",
        "id": 153963953,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526943403
    },
    {
        "content": "<p>Did we miss a step to make the codeSystem 'official'?</p>",
        "id": 153963954,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526943423
    },
    {
        "content": "<p>that's much better. But it's not what the vendors are actually using...</p>",
        "id": 153963955,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526943467
    },
    {
        "content": "<p>did we look at snomed?</p>",
        "id": 153963956,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526943576
    },
    {
        "content": "<p>I do think the definitions could do with a little more work. Is this a classification (e.g. are the terms in here mutually exclusive?)</p>",
        "id": 153963958,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526943608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> you should inform the argonaut members of this. Cerner is referening the local code system. See <a href=\"https://fhir.cerner.com/millennium/dstu2/general-clinical/condition/\" target=\"_blank\" title=\"https://fhir.cerner.com/millennium/dstu2/general-clinical/condition/\">https://fhir.cerner.com/millennium/dstu2/general-clinical/condition/</a> as an example</p>\n<p>And yes, this is another one that really needs work. It seems that these codes are a mash-up of categories and situations of use.</p>",
        "id": 153963962,
        "sender_full_name": "Robert McClure",
        "timestamp": 1526945937
    },
    {
        "content": "<p>that's a version issue. it will go away when they update to a later version of argonaut (cause it will be based on US core then)</p>",
        "id": 153963963,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526946154
    },
    {
        "content": "<p>Problem with assuming an update will fix this is argonauters are fixated on the floor being DTSU2 and that will have an impact on initial expectations for use. I'd bet that Cerner site <strong>is</strong> what they do now. Can't we get them to fix it because as is, they are describing a non-implementable spec, right?</p>",
        "id": 153963964,
        "sender_full_name": "Robert McClure",
        "timestamp": 1526946365
    },
    {
        "content": "<p>\"Problem\" and \"Health Concern\" definitely have some overlap -- ONC CCDS required systems to expose both. <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> , is there a definition in SNOMED or other terminology concept we can reference?</p>",
        "id": 153963965,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526946379
    },
    {
        "content": "<p>I think the issue is a bit deeper then us using a local code system...</p>",
        "id": 153963966,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526946402
    },
    {
        "content": "<p>well, that's an argonaut question, I'll ask on the argonaut track. But I suspect the answer will be no, not going to change. Which means that the best option is for us to back-migrate the code system definition from US-Core</p>",
        "id": 153963967,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526946458
    },
    {
        "content": "<p>Brett, I didn't find anything for health concern in SCT. But I think my question and your answer suggest that there's a possibility of better definitional work</p>",
        "id": 153963969,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526946497
    },
    {
        "content": "<p>Definitely.</p>",
        "id": 153963970,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526946507
    },
    {
        "content": "<p>Unfortunately the SCT definitions are not exposed. Not sure if I have solution for that. I have a bigger concern about the inclusion of situation of use (\"on the problem list\" and \"recorded at a specific encounter\")</p>",
        "id": 153963972,
        "sender_full_name": "Robert McClure",
        "timestamp": 1526946524
    },
    {
        "content": "<p>Here is the <a href=\"http://www.fhir.org/guides/argonaut/r2/ValueSet-argo-codesystem.html\" target=\"_blank\" title=\"http://www.fhir.org/guides/argonaut/r2/ValueSet-argo-codesystem.html\">original codesystem in the spec</a>. In DSTU2 there was this really sweet way to define the URI so I bunched all the codes into a single codesystem.  It was part of Valueset back then.   Its  there after all and so no need to use US Core.   I thought Rob M was  overstating things a bit  by describing it as a  \"a non-implementable spec\" since I had not heard a lot a grumbling about the missing code system ... until now. </p>\n<p>At the time we added these categories because they were not there in the base resource and they were defined in the MU regs.  We spent a <em>lot of time</em> on this topic and came up with a couple of codes.  I don't wish to revisit the definitions unless the implementers of argonaut want to.    I remember that  the code system resource underwent so major changes so that  we had to split these codes up into separate codesystems and subsequent to USCore  one of them got added to core spec and so there is overlap there.  ( One reason why we are not rushing out a R4 version before the underlying specification is firmed up)</p>",
        "id": 153963998,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526955036
    },
    {
        "content": "<p>Eric's explanation makes sense to me.  I'm not sure that there is anything in particular that needs to be done at the moment, in anticipation of eventually moving to the R4 version based on US Core.</p>",
        "id": 153964011,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1526960216
    },
    {
        "content": "<p>well, maybe i could fix the missing link problem (not linked in the spec). As for the definitions, I wouldn't propose to change the meanings of the code, only to be clearer about their definitions</p>",
        "id": 153964019,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526962685
    },
    {
        "content": "<p>They are purposefully a bit ambiguous.  These were after all categories designed to meet regulatory requirements.</p>",
        "id": 153964025,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526969130
    },
    {
        "content": "<p>here is the definition in the FHIR spec :</p>\n<p><a href=\"http://hl7.org/fhir/valueset-condition-category.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-condition-category.html\">http://hl7.org/fhir/valueset-condition-category.html</a>:</p>\n<p><em>Problem List Item</em> 'An item on a problem list which can be managed over time and can be expressed by a practitioner (e.g. physician, nurse), patient, or related person.'</p>\n<p>vs argo/uscore:  </p>\n<p><em>Problem</em>    'The patients problems as identified by the provider(s). Items on the provider’s problem list'</p>\n<p>They seem to say the same thing to me.</p>",
        "id": 153964027,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526969528
    },
    {
        "content": "<p>can something be both a problem and a concern? because the definitions are unclear about that</p>",
        "id": 153964037,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526976304
    },
    {
        "content": "<p>the expansion in US core is even more confusing given the additional 2 codes in the expansion</p>",
        "id": 153964038,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526976326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> By \"unimplementable\" I mean any implementation spec (what would you call the Cerner web site I'm pointing to?) references a code system that does not exist anywhere. Even given the totally loose requirement of the identifier only needs to be a uri and not resolve, a value set is expected to return a real value set resource and this one can't because the code system fails at the url location specified. So yes, this is technnically unimplementable. I'm am a bit fed up with model requirements being held to task but terminology is always \"ah, come on - it's good enough, right?\"</p>",
        "id": 153964098,
        "sender_full_name": "Robert McClure",
        "timestamp": 1527000168
    },
    {
        "content": "<p>Like I said before - we published the IG at the same time as R3 and C'est Voila Problem category showed up in both.  Based on my experience sitting in on many PC discussions, I think we will be hard pressed to come up with better definitions.  MIchelle was instrumental in helping us navigate this tricky area and she should be consulted when she returns.</p>",
        "id": 153964100,
        "sender_full_name": "Eric Haas",
        "timestamp": 1527004549
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  The CodeSystem is indeed present as I point out.  You have to go in the way back machine to remember that it was represented as a ValueSet resource.   However, there is  a  bad link.</p>",
        "id": 153964101,
        "sender_full_name": "Eric Haas",
        "timestamp": 1527004779
    },
    {
        "content": "<p>yes, it does exist and we should fix the bad link as Grahame offered</p>",
        "id": 153964103,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1527004928
    },
    {
        "content": "<p>As I read it, the difference between a problem and a concern is about where it is recorded, not about the underlying condition</p>",
        "id": 153964263,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1527053418
    },
    {
        "content": "<p>concerns are not something that would normally be recorded as \"problems\" in a system. EG: I'm worried about my financial status is a concern</p>",
        "id": 153964352,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1527093539
    },
    {
        "content": "<p>that category primarily came from the \"health concern\" ONC requirement, IIRC</p>",
        "id": 153964353,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1527093570
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Doing a bit of old-thread review I've noted you pointed out something I completely forgot - that in the olden-days code systems were value sets. So I stand corrected, the content <strong>was</strong> there, just not as we (me) now expect. And we are again reminded how fragile uri that look like url's are...</p>",
        "id": 153965531,
        "sender_full_name": "Robert McClure",
        "timestamp": 1527687742
    }
]