[
    {
        "content": "<p>Folks, I know many of you are eyebrow-deep in the IG but I'm looking for a FHIR terminology server (v3 or even better v4) that accepts PUTs,  has international and US SCT, LOINC, ICD-10-CM, and supports the standard filters. I'd like to make some value sets and they need to stick around through the next ballot cycle (perhaps less if I move them.) Can anyone direct me to a site?</p>",
        "id": 153988493,
        "sender_full_name": "Robert McClure",
        "timestamp": 1534529875
    },
    {
        "content": "<p>Mine is close to that - it's R4 and it could be fully there by sometime next week.  For one thing I haven't gotten to updating to the latest SNOMED and LOINC yet, but I need to.  In the meantime you can try it at <a href=\"http://fhir.hausamconsulting.com/\" target=\"_blank\" title=\"http://fhir.hausamconsulting.com/\">http://fhir.hausamconsulting.com/</a> if you want.</p>",
        "id": 153988500,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534531158
    },
    {
        "content": "<p>the endpoint is <a href=\"http://fhir.hausamconsulting.com/baseR4\" target=\"_blank\" title=\"http://fhir.hausamconsulting.com/baseR4\">http://fhir.hausamconsulting.com/baseR4</a></p>",
        "id": 153988502,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534531210
    },
    {
        "content": "<p>it's based on standard HAPI functionality (which I'll update soon to the latest)<br>\nit's otherwise not very fancy (at least not yet) but has the basics</p>",
        "id": 153988503,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534531358
    },
    {
        "content": "<p>ok you can use <a href=\"http://test.fhir.org/r3\" target=\"_blank\" title=\"http://test.fhir.org/r3\">test.fhir.org/r3</a> or /r4</p>",
        "id": 153988552,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534537867
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> if I want to specify use of the latest us extension for sct, would I put <a href=\"http://snomed.info/sct/731000124108\" target=\"_blank\" title=\"http://snomed.info/sct/731000124108\">http://snomed.info/sct/731000124108</a> into the system element? And that works on your test server?</p>",
        "id": 153988558,
        "sender_full_name": "Robert McClure",
        "timestamp": 1534538931
    },
    {
        "content": "<p>no. this is explained on the <a href=\"http://hl7.org/fhir/snomedct.html\" target=\"_blank\" title=\"http://hl7.org/fhir/snomedct.html\">http://hl7.org/fhir/snomedct.html</a> page:</p>\n<blockquote>\n<p>The URI <a href=\"http://snomed.info/sct\" target=\"_blank\" title=\"http://snomed.info/sct\">http://snomed.info/sct</a>  identifies the SNOMED CT code system</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>The SNOMED CT URI Specification  describes how to unambiguously reference a particular version of a SNOMED CT edition: <code>http://snomed.info/sct/[sctid]/version/[YYYYMMDD]</code> where [sctid] is the concept id that identifies the given SNOMED CT edition (based on the identifier of the most dependent module), and \"YYYYMMDD\" is the date of release.</p>\n</blockquote>",
        "id": 153988562,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534539193
    },
    {
        "content": "<p><a href=\"http://tx.fhir.org\" target=\"_blank\" title=\"http://tx.fhir.org\">tx.fhir.org</a> has the latest version of US snomed, but I haven't got around to putting it on <a href=\"http://test.fhir.org\" target=\"_blank\" title=\"http://test.fhir.org\">test.fhir.org</a> yet - that'll be getting some love next week</p>",
        "id": 153988563,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534539232
    },
    {
        "content": "<p>duh. how could I have forgotten that...<br>\nBut then to confirm, <a href=\"http://snomed.info/sct/731000124108\" target=\"_blank\" title=\"http://snomed.info/sct/731000124108\">http://snomed.info/sct/731000124108</a> is a valid version identifier for \"latest us edition\" which means, I've just realized, that for all other code systems if version is specified, you are to use a <em>specific</em> version, but for SCT it could mean, go find the latest one with this [sctid] or a specific version with the YYYMMDD on it. Kind of a pain for TS implementers</p>",
        "id": 153988681,
        "sender_full_name": "Robert McClure",
        "timestamp": 1534545946
    },
    {
        "content": "<p>I didn't follow that. if you don't specify a version.. use the latest... what's the issue?</p>",
        "id": 153988694,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534546547
    },
    {
        "content": "<p>I indicate us edition in the \"version\" element of the value set compose but that means the $expand must use the latest available us edition. That is not how other code systems work where if there is a version specified in the \"version\" element, you don't need to figure out <em>which is the latest of that version</em>.</p>",
        "id": 153988705,
        "sender_full_name": "Robert McClure",
        "timestamp": 1534547802
    },
    {
        "content": "<p>ok, that's true. but it's analagous to not specifying a version at all - then you must figure out which is the latest version (though I haven't found that to be a handicap so far). SCT is more complicated, you must track which is latest, per edition. That's baked into how SCT works. You could, perhaps, require that for some contexts, a full version uri is required always .</p>",
        "id": 153988715,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534549126
    },
    {
        "content": "<p>I've really tried to be silent on this issue, but I just have to get it off my chest. I do not agree with the location of the uri/version split that has been specified for SCT. In my mind, SCT US is a separate CodeSystem from SCT Canada, SCT International, etc. And versions are time-based \"snapshots\" of CodeSystems. Thus the 'system' uri for SCT US should be \"<a href=\"http://snomed.info/sct/731000124108\" target=\"_blank\" title=\"http://snomed.info/sct/731000124108\">http://snomed.info/sct/731000124108</a>\", and a version would be designated by YYYMMDD (or the full string as Graham cited above if required). Specifying edition in the version string rather than the system uri seems very inconsistent to me. It results in the confusion with regard to \"latest version\" semantics that Rob describes.  Sigh, that feels better  ;-)</p>",
        "id": 153988941,
        "sender_full_name": "Jack Bowie",
        "timestamp": 1534611210
    },
    {
        "content": "<p>so you you claim that the concept 160245001 (No current problems or disability) means something different in US Snomed than it does in any other snomed?</p>",
        "id": 153988971,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534622697
    },
    {
        "content": "<p>Not necessarily. Just that 160245001 has a meaning in every edition (in which it is defined) that is appropriate for that edition. And could have different attributes/properties. Editions aren't \"extensions\" or supplements. They are complete CodeSystems unto themselves. Am I missing something (I appreciate that I am coming in late to this discussion.)</p>",
        "id": 153988975,
        "sender_full_name": "Jack Bowie",
        "timestamp": 1534624261
    },
    {
        "content": "<p>Code system is a names pace in which each code has a semi-fixed meaning.  Snomed is a  single namespace across all editions.  Changing attributes and properties is fine across versions of a single code system.</p>",
        "id": 153988977,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534624835
    },
    {
        "content": "<p>Thanks, that's what I was looking for. \"Snomed is a single namespace across all editions.\" If that's the way we choose to define it, okay. But then putting edition into version seems to me to break the normal understanding of \"version\". Seems fairly arbitrary. I could argue that SCT US is by your definition also a well-defined CodeSystem. \"Editions\" of ICD-10 aren't treated this way. So another special case for SNOMED? Thanks again. I got my minute on the soapbox.</p>",
        "id": 153988980,
        "sender_full_name": "Jack Bowie",
        "timestamp": 1534625962
    },
    {
        "content": "<p>ICD-10 would be treated that way if it had concept permanence.</p>",
        "id": 153988984,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534631132
    },
    {
        "content": "<p>This is a compromise. we could have gone either way, and perhaps the way we chose is less convenient for terminology servers. but that's consistent with the overall approach: move as much work and complexity to the server as possible</p>",
        "id": 153988991,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534633704
    },
    {
        "content": "<p>If there was a separate CodeSystem URI per Edition, then a ValueSet like \"all descendants of limb fracture\" would need to be (re-)defined for every Edition.<br>\nBy having a single CodeSystem for all Editions of SNOMED CT, there can be a single ValueSet definition, and then you can specify either a specific Edition or Version URI as desired when performing the expansion. [edited to make meaning more explicit]</p>",
        "id": 153988992,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534634101
    },
    {
        "content": "<p>Oh. This is a subtlety I was not aware of.  But understandable given the decision. Thanks. We'll need to look into this.</p>",
        "id": 153988993,
        "sender_full_name": "Jack Bowie",
        "timestamp": 1534634889
    },
    {
        "content": "<p>One more question. Say I have an intentional ValueSet, like all descendants of \"Heart Disease\", based on <a href=\"http://snomed.info/sct\" target=\"_blank\" title=\"http://snomed.info/sct\">snomed.info/sct</a> (no version). I expand this ValueSet on a server in the US and a server in Australia. Could the expansions be different (because they have different \"defaults\" for version/edition) or will they always be the same (i.e., based on SCT International)?</p>",
        "id": 153989213,
        "sender_full_name": "Jack Bowie",
        "timestamp": 1534693052
    },
    {
        "content": "<p>They can be different</p>",
        "id": 153989214,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534697496
    },
    {
        "content": "<p>Just as they could be different with different servers in the US (because one has an older release).  However, the expansion result should include the actual SNOMED version used in the <code>expansion.parameter</code> section</p>",
        "id": 153989280,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534717649
    },
    {
        "content": "<p>Agree that <code>expansion.parameter</code> should be populated, but what I'd like to see is that the minimum good practice is to include the code system and code system version with every code in the expansion, and description as an optional item.</p>",
        "id": 153989554,
        "sender_full_name": "Robert McClure",
        "timestamp": 1534776443
    }
]