[
    {
        "content": "<p>Is <code>urn:ietf:bcp:47</code> a true CodeSystem? I understand that it's being treated as one throughout the FHIR spec; however, all <a href=\"https://tools.ietf.org/rfc/bcp/bcp47.txt\">BCP-47</a> really does is define a best practice for creating language codes with a consistent structure/syntax. The meaning is assigned to those codes by other authorities (e.g., <a href=\"https://id.loc.gov/vocabulary/iso639-1.html\">ISO</a>), <em>not</em> the IANA. This would seem to make BCP-47 an <a href=\"https://www.hl7.org/fhir/valueset.html#int-ext\">intensional ValueSet</a>, where inclusion in the ValueSet is contingent on a ReGex match as defined in BCP-47.</p>\n<p>Am I misunderstanding?</p>",
        "id": 244213266,
        "sender_full_name": "Matt Rouhana",
        "timestamp": 1624919772
    },
    {
        "content": "<p>bcp:47 defines a grammar for codes that have a defined meaning.  The fact that the constituents of the grammar are other code systems doesn't matter.  It defines what codes are valid and the meaning to be inferred from them - as such, it's a code system.</p>",
        "id": 244216803,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624922491
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks for the clarification. As such, is the use of constituent code systems allowed in <code>Patient.communication.language</code>, from a validation perspective? Or does the <code>system</code> for that element always need to be <code>urn:ietf:bcp:47</code>?</p>",
        "id": 244426028,
        "sender_full_name": "Matt Rouhana",
        "timestamp": 1625060963
    },
    {
        "content": "<p>The system always needs to be urn:ietf:bcp:47 - that's based on the binding.  If the binding is to a CodeableConcept, then you might have translations to other systems.</p>",
        "id": 244435230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625064609
    }
]