[
    {
        "content": "<p>Is there a best practice to follow when a SNOMED term used in a published IG is retired and replaced by a new code? Should the IG be updated sooner rather than later to use the new code?<br>\nIn our specific case, a CDA observation template in the published birth defect reporting CDA IG is using SNOMED code 249135009  (Meconium stained liquor (finding)) as the observation code value. However, it looks like this code has been retired. There is a new code (168092006 (Amniotic fluid -meconium stain (finding)) which seems to be appropriate to use instead.<br>\nShould the IG be updated via an errata or dot release (\"sooner\" update) or is it valid for an already published IG to continue to use a retired code (presumably this would be changed when the document is balloted next (\"later\" update))?</p>",
        "id": 192403185,
        "sender_full_name": "Craig Newman",
        "timestamp": 1585667687
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> Is this code a result value or is it a identifying a template? Can you send the snippit where it's used in the IG? I ask because if it is used to identify a template we have a bigger issue I believe. Thankfully this is a rare situation but unfortunately that means we don't have a lot of experience on impacts with different approaches.</p>",
        "id": 192429611,
        "sender_full_name": "Robert McClure",
        "timestamp": 1585678946
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  It's the Observation/code (not the value of the observation)</p>\n<p><a href=\"/user_uploads/10155/O84f89pAyaWPS5RSXAqCVtWu/image.png\" title=\"image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/O84f89pAyaWPS5RSXAqCVtWu/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/O84f89pAyaWPS5RSXAqCVtWu/image.png\"></a></div>",
        "id": 192429999,
        "sender_full_name": "Craig Newman",
        "timestamp": 1585679144
    },
    {
        "content": "<p>SO the template is specific to this observation only, correct?</p>",
        "id": 192430208,
        "sender_full_name": "Robert McClure",
        "timestamp": 1585679233
    },
    {
        "content": "<p>yes</p>",
        "id": 192440116,
        "sender_full_name": "Craig Newman",
        "timestamp": 1585683908
    },
    {
        "content": "<p>Assuming that the relevant binding in your IG relates to a specific edition, but not version, of SNOMED CT, there is a practical consideration here. SNOMED concepts, even when their status is changed in inactive, are still permanent and a deactivated concept may well have been used in an EHR. From that perspective, due consideration should be given before removing an inactive concept from a FHIR Profile or IG.</p>",
        "id": 192440338,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1585684012
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> I think you might agree that changing the code so that it is using the current active code would be a breaking change and require an updated IG.  Peter's solution of locking the IG to the version of SNOMED CT where that code is still active I think could be considered an errata, but I'd ask the CDA MB. Perhaps <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> can give some insight into how you could update this single template so that it uses the current code and what that might mean for IG versioning and any ballot implications. Implementers could then indicate which template ID they are using.</p>",
        "id": 192442905,
        "sender_full_name": "Robert McClure",
        "timestamp": 1585685370
    },
    {
        "content": "<p>I'm not suggesting locking an IG to a specific version of SNOMED CT; in most cases that would be impractical - particularly as SI moves to continuous releases. Many/most IGs will assume the latest version of an edition and, while new versions of an IG may add concepts, the key point I'm trying to make is they should be careful about removing inactive concepts as that may break client implementations.</p>",
        "id": 192448545,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1585688289
    },
    {
        "content": "<p>Well I am suggesting they could at least lock a template to a specific version. I don't know if we can do that, but it makes sense here.</p>",
        "id": 192535161,
        "sender_full_name": "Robert McClure",
        "timestamp": 1585750878
    },
    {
        "content": "<p>I agree it's potentially a breaking change. At this point, we aren't aware of any production implementations. It would be interesting to know if a template could be locked to a specific version of SNOMED, especially when it's a hard coded value like this.</p>",
        "id": 192572120,
        "sender_full_name": "Craig Newman",
        "timestamp": 1585765633
    },
    {
        "content": "<p>I'm not sure if there's anything particularly wrong with just leaving it as it is, with plans (as you indicated) to update it in the next release (whenever that may occur).  As Peter said, regardless of its current status the concept is still present in subsequent versions of SNOMED CT and can legitimately be referenced.  And since very likely you are not expecting, on either the sending or receiving side, to rely on the hierarchical relationships of the concept (which <strong>will</strong> have changed with inactivation), then I don't think there will be any consequences for simply following whatever update cycle you otherwise would plan to have.</p>",
        "id": 192574749,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585766879
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> my concern with that agreeably simple approach is the code is not active. And if someone actually searches for a \"meconium\"  code in the current code system they will be confused. <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> can you reach out to Lisa and ask if some of the approaches we suggested are possible?</p>",
        "id": 192615342,
        "sender_full_name": "Robert McClure",
        "timestamp": 1585795610
    },
    {
        "content": "<p>If this is Observation.code, then it is a CodeableConcept which allows for multiple Codings.  Unless you've got some profiling going on that says you can only have one SNOMED code, then you could just add in the replacement code and have both there.</p>",
        "id": 192649080,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1585825196
    },
    {
        "content": "<p>Craig is referring to the CDA birth defect reporting IG</p>",
        "id": 192655784,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585829715
    },
    {
        "content": "<p>ah, CDA Observation, not FHIR - that's before my time :-)</p>",
        "id": 192659984,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1585831797
    },
    {
        "content": "<p>In an interesting Zulip experiment, I have cross-posted to the C-CDA stream to see if that elicits any responses. If it doesn't, I'll ping Lisa more directly...</p>",
        "id": 192691132,
        "sender_full_name": "Craig Newman",
        "timestamp": 1585844470
    }
]