[
    {
        "content": "<p>We are changing the general design of the Multiple Chronic Care Condition Care Plan IG (MCC) (<a href=\"https://trifolia-fhir.lantanagroup.com/igs/lantana_hapi_r4/MCC-IG/index.html\">https://trifolia-fhir.lantanagroup.com/igs/lantana_hapi_r4/MCC-IG/index.html</a>) I used to work on and am now working on again. Rather than creating 800+ new profiles, we will create a base set of MCC profiles that conform to US Core profiles (or some other base resource) and point to a \"library\" of value sets that can be used with  the various base MCC Profiles. <strong>Question:</strong> Is there any advantage to binding to the relevant code system(s) in the various base profiles, instead of just requiring xx.code and not specifying the code systems? The \"Library\" will group the value set listings related to the appropriate MCC Profile and point to the  base profile and where the value set (term) can be used in the profile.</p>",
        "id": 274065858,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1646356873
    },
    {
        "content": "<p>If you specify a fixed code (or better yet a CodeableConcept pattern), there's no technical reason to provide a binding.  Your IG <em>will</em> inherit the default binding though, which some might find confusing.</p>",
        "id": 274066734,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646357519
    },
    {
        "content": "<p>True - in our case most of our base templates will inherit bindings from US Core. How do I bind to a CodeableConcept pattern? <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> <span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span></p>",
        "id": 274150674,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1646409949
    },
    {
        "content": "<p>Pattern and bindings are separate things.  Pattern is like a fixed value, but more lenient - it won't yell if you include a display, extension, id, or other element in addition to your mandated code and system.</p>",
        "id": 274154537,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646411845
    },
    {
        "content": "<p>How do I assert a codableConcept Pattern in a profile?</p>",
        "id": 274182548,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1646424657
    },
    {
        "content": "<p>In the structure definition, just put a patternCodeableConcept on the element.  Trifolia has an element that lets you do it near where you specify fixed values.  FSH has a special syntax but I'm afraid I don't know it.</p>",
        "id": 274188810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646428271
    },
    {
        "content": "<p>Yes, I was just getting ready to say that. :)</p>",
        "id": 274188857,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1646428308
    },
    {
        "content": "<p>cool stuff. is there an example of the use of the codableConcept patter in a profile? I'm super curious.</p>",
        "id": 274189058,
        "sender_full_name": "Bret H",
        "timestamp": 1646428417
    },
    {
        "content": "<p>I do it <a href=\"http://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Observation-results-laboratory-uv-ips.html\">here</a> for Observation.category in the IPS lab results Observation profile (you can see it in the Observation.category:laboratory slice in the XML or JSON - I don't have a FSH example handy).</p>",
        "id": 274189693,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1646428761
    },
    {
        "content": "<p>might be a problem on my end - does not seem like I was able to get to the example or download it <span aria-label=\"oh no\" class=\"emoji emoji-1f615\" role=\"img\" title=\"oh no\">:oh_no:</span></p>",
        "id": 274189930,
        "sender_full_name": "Bret H",
        "timestamp": 1646428883
    },
    {
        "content": "<p>Nope, it was my problem - I had linked to my local copy instead of the build (fixed).</p>",
        "id": 274190252,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1646429058
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 274199165,
        "sender_full_name": "Bret H",
        "timestamp": 1646434144
    }
]