[
    {
        "content": "<p>On the FHIR Tracker Issues call yesterday we reviewed a set of 11 issues that have been marked as ready-for-vote.  We finalized the dispositions and have prepared a block vote, and we're proposing to vote on the block during the Main Vocab call next Thursday (7/24).  Here is a link to the Confluence <a href=\"https://confluence.hl7.org/display/VOC/FHIR+block+vote+for+Main+Vocab+WG+conference+call+2020-07-23\">page</a> with the list of the trackers to be voted on in the block.</p>\n<p>Please let me know if you have any questions or if there are any issues that you would like to have pulled from the block.  And please join the conference <a href=\"http://www.hl7.org/concalls/CallDetails.aspx?concall=49826\">call</a> next Thursday at 3:30 Eastern for the vote.  Thanks!</p>",
        "id": 204267328,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595025343
    },
    {
        "content": "<p>FHIR-23785 (<a href=\"http://jira.hl7.org/browse/FHIR-23785\">J#23785</a>) still seems problematic - the proposed text change does not clarify whether the URL is intended to be that of a FHIR Tx endpoint (and thus used for <code>base</code> in <code>[base]/ValueSet/$expand?url=[valueSetUri]</code> to obtain the trusted expansion, or directly resolved and thus a <code>GET</code> on the url would retrieve the trusted expansion.</p>",
        "id": 204276210,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595034627
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>.  Do you want to pull the issue from the block to discuss separately (and potentially revise the resolution) on the call?</p>",
        "id": 204302146,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595081655
    },
    {
        "content": "<p>As the revised text doesn't resolve or address the ambiguity, yes I think it needs to be pulled.<br>\nDue to timezones (3:30 Eastern), it would be great if we could discuss here or on the ticket itself.</p>",
        "id": 204324383,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595118636
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span> are you able to provide insight as to whether this URL is meant to be of an (authoritative) expanded ValueSet or an (authoritative) FHIR endpoint from which to obtain an expansion?</p>",
        "id": 204324468,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595118794
    },
    {
        "content": "<p>Yes, if we can agree on an updated resolution (here or in Jira) within the next 24 hours or so then we may be able to revise the tracker and keep it in the block.  <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>- your thoughts?</p>",
        "id": 204421232,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595251413
    },
    {
        "content": "<p>Good question <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> . My opinion on this is that it would be an authoritative expansion resource. I do not think we should expect the ability to respond to an $Expand. But I'd like to hear what people think is most useful, doable. I'm assuming that this will not be something that most value sets will have so perhaps we say it has to support $expand?</p>",
        "id": 204440353,
        "sender_full_name": "Robert McClure",
        "timestamp": 1595260501
    },
    {
        "content": "<p>Thanks Rob, I would also expect it to be to a pre-expanded ValueSet and not a FHIR endpoint.</p>\n<p>Michael</p>\n<p>Sent from my iPhone</p>",
        "id": 204495678,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595286721
    },
    {
        "content": "<p>I think there is (at least implicit) agreement that this needs to return a ValueSet resource with an authoritative expansion (that's what this is all about).   But is that a single, static item, apparently based on an assumed fixed set of the expansion parameters?  If not, then it seems that you would need it to be a FHIR endpoint, so that it can return the authoritative expansion for any combination of the $expand operation parameters.</p>",
        "id": 204542824,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595335866
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Can you say what parameters you think should be considered? My assumption is \"current code system version and nothing filtered out.\" I think we'd want to say in the comment that best practice would be that the source for this is committing to keep the expansion UTD based on the most recent code system version. We should also say that users that access the expansion should confirm that the expansion is based on the code system version they expected. Perhaps we also should note that the expansion should include the parameters used to generate the expansion. FWIW, I'd also like to say (someday) that the expansion resource SHALL conform to the following profiles <a href=\"https://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/StructureDefinition-cpg-executablevalueset.html\">cpg-executablevalueset</a>, <a href=\"https://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/StructureDefinition-cpg-computablevalueset.html\">cpg-computablevalueset</a>, and <a href=\"https://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/StructureDefinition-cpg-publishablevalueset.html\">cpg-publishablevalueset</a>.</p>",
        "id": 204594823,
        "sender_full_name": "Robert McClure",
        "timestamp": 1595360974
    },
    {
        "content": "<p>I think <em>all</em> expansions MUST contain the parameters that were used to derive the expansion (such as code system version).<br>\nI would also expect that any use of a \"authoritative expansion\" should also check that the parameters are compatible with the context of use.<br>\nNaturally then there may be many \"authoritative\" expansions, each with different expansion parameters.</p>",
        "id": 204624106,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595383932
    },
    {
        "content": "<p>Agree with Michael.  I could probably go with \"current code system version and nothing filtered out\", as long as that is explicit.  But anything else ('activeOnly, excludeNested, system-version or force-system-version, etc.) requires a FHIR endpoint and the $expand operation (which might be a reasonable approach to it?).</p>",
        "id": 204636098,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595401774
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> Would you have any time to suggest a revised proposed resolution for FHIR-23785 (<a href=\"http://jira.hl7.org/browse/FHIR-23785\">J#23785</a>) that would meet your needs and expectations that we can discuss on the call today?  It looks like we will pull this from the block and discuss it separately.  if you are able to join at some point (maybe during the latter part of the call?) that would be great (but not necessarily expected).  One thing I think we should consider is if whatever solution we decide on is required or suggested (i.e. best practice) behavior for servers that implement it.</p>",
        "id": 204796545,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595510869
    },
    {
        "content": "<p>Thanks Rob, I've added suggested text to the ticket, but it has raised further (similar) questions about the associated valueset-authoritativeSource extension.</p>",
        "id": 204875812,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595560837
    },
    {
        "content": "<p>FHIR-<a href=\"https://jira.hl7.org/browse/FHIR-23785\">23785</a> was discussed on the Vocab FHIR tracker call today. I would like to propose the following solution but we want input from zulip:<br>\nI propose that <a href=\"http://build.fhir.org/extension-valueset-trusted-expansion.html\">valueset-trusted-expansion</a> should be defined to contain a URL of a FHIR server where an authoritative value set expansion may be obtained that conforms to the requirements that are consistent with those specified by the following two profiles:</p>\n<ul>\n<li><a href=\"https://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/StructureDefinition-cpg-executablevalueset.html\">cpg-executablevalueset</a></li>\n<li><a href=\"https://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/StructureDefinition-cpg-computablevalueset.html\">cpg-computablevalueset</a></li>\n</ul>\n<p>I think that the <a href=\"http://build.fhir.org/extension-valueset-authoritativesource.html\">valueset-authoritativeSource</a> extension should be defined as the url of a FHIR terminology service endpoint that is capable of generating an authoritative valid FHIR expansion for the value set.</p>\n<p>I think these two extensions should not be co-dependent. They may be the same server (likely will be when authoritative source is populated.) I also understand that we need to provide \"best practice\" guidance as to the parameters that should be used to generate the trusted expansion, which other than those needed to support the profiles, should be to use the most recent code systems and to not evoke any other restrictive parameters. </p>\n<p>I also encourage <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> to comment on the potential to have a terminology service to choose (as should be noted in the capability statement) that they populate the trusted expansion with a url that holds a persisted expansion resource for the returned expansion. This would allow requesters the ability to get the expansion without performing another $expand. This is something Peter suggested and while it's not directly aligned and may have some difficult implications, it's an interesting use.</p>",
        "id": 205535181,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596144739
    },
    {
        "content": "<blockquote>\n<p>This would allow requesters the ability to get the expansion without performing another $expand</p>\n</blockquote>\n<p>Don't understand why this is useful.</p>",
        "id": 205543043,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596150647
    },
    {
        "content": "<blockquote>\n<p>cpg-computablevalueset</p>\n</blockquote>\n<p>Don't understand why this profile is part of the discussion. nor do I understand why it exists, actually</p>",
        "id": 205543227,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596150799
    },
    {
        "content": "<p>Thanks for the summary <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> , unfortunately I was on another call at the same time.<br>\nCan you provide explicit examples of values for these extensions?</p>",
        "id": 205543323,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1596150846
    },
    {
        "content": "<p>There's also <a href=\"http://hl7.org/fhir/R4/extension-valueset-expression.html\">http://hl7.org/fhir/R4/extension-valueset-expression.html</a> which worries me - fine for documentation purposes, but I can see it being used as a proprietary crutch that blocks interoperability.</p>",
        "id": 205543525,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1596150991
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> The <a href=\"http://hl7.org/fhir/R4/extension-valueset-expression.html\">valueset-expression extension</a> was originally created to meet the need of computably defining a value set content logical definition in the FHIR space that <em>does not use</em> the standard FHIR compose structure. I'm surprised you think this is \"a crutch that blocks interoperability\" when it is defined to be computable and requires the identification of the computable syntax used. FHIR's compose sytax is pretty thin and other terminology query systems exist (eg: TQL) or SQL queries against standard table structures (eg: RxNorm, UMLS, etc.) so providing a way to include those actually improves interoperability. Not everyone uses SNOMED CT that supports intra-FHIR compose approach that can utilize ECL.</p>",
        "id": 205609276,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596211713
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and others: <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  and I are working on improving the demonstrably incomplete documentation on the <a href=\"https://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/documentation-terminology.html\">cpg value set profiles</a>. I'll note that these are still in flux and include elements and MustSupport that I do not think belong in a general core profile, hence my statement above that trusted expansion should be consistent with (but note specifically use) the cpg profiles. We plan to improve upon the material at the <a href=\"https://build.fhir.org/ig/HL7/cqf-recommendations/branches/master/index.html\">FHIR Clinical Guidelines IG</a> and will launch a zulip thread to open discussion on these ValueSet profiles once the documentation is up to snuff.</p>",
        "id": 205610108,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596212116
    },
    {
        "content": "<p>perhaps better documentation will help me understand the purpose</p>",
        "id": 205636264,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596226091
    },
    {
        "content": "<p>By blocking interoperability, I mean that this extension imposes a requirement (or demand) on terminology servers to 1. use or re-implement SQL / TQL / other query language, and 2. use \"standard table structures\".<br>\nThe alternative is to expose the required (by the SQL / etc) information in the CodeSystem itself, and to express the SQL etc using the compose syntax, which is actually pretty expressive.  It would seem not unreasonable to attempt to do a standard mapping from RxNorm and UMLS file formats into FHIR CodeSystem so that all terminology servers can provide a consistent support at some established minimal level.</p>",
        "id": 205660173,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1596249956
    },
    {
        "content": "<p>Looking at the ValueSets in the IG linked above, I see nothing that requires the valueset-expression extension -- I'd be interested to see some examples that involve queries that can't be expressed as a ValueSet.compose</p>",
        "id": 205660241,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1596250050
    },
    {
        "content": "<p>Looking at the expressiveness of the ValueSet compose syntax, I note that multiple filters within a single compose.include are resolved using conjunction. However, I can't see any rules for how to handle multiple compose.include elements that each contain filters; although it might make sense to use disjunction?</p>",
        "id": 205664963,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1596258397
    },
    {
        "content": "<p>is this what you are asking about?</p>\n<blockquote>\n<p>Multiple include statements are cumulative - e.g. the value set contains the union of all the includes<br>\nWithin an include, all the criterion apply -e.g. the value set contains the intersection of the criterion</p>\n</blockquote>",
        "id": 205745196,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596404221
    },
    {
        "content": "<p>?</p>",
        "id": 205745197,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596404221
    },
    {
        "content": "<p>Yes, thanks. Not quite sure how I missed those Composition Rules!</p>",
        "id": 205746025,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1596405899
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> So your answer to this is to force everyone to use FHIR compose or not use FHIR, right? I don't support such a hard-line take my ball and leave approach. I think allowing users to express how they actually created a member set using non-FHIR terminology server capabilities is actually useful and you might be surprised to discover that there are more people using SQL to create what we call value sets, then are using a FHIR terminology service. </p>\n<p>As for examples, I have some Apelon TQL I can send but you are missing the point. I don't agree with your demand that everyone must use FHIR compose or they don't get to use FHIR.</p>",
        "id": 205818206,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596473477
    },
    {
        "content": "<p>TQL is probably a reasonable ask.  SQL is absolutely not.  There's nothing interoperable about SQL because don't expect (or <em>want</em>) database designs to be consistent, and furthermore, allowing execution of arbitrary SQL on a server is something no sane DBA would ever allow.  I do agree that using something like TQL for an expression that could be done using ValueSet.compose is an anti-pattern and should be strongly discouraged.  However, allowing for it in an extension to support communication with systems that can't convert is reasonable (at least in some spaces), just as we allow folks to transmit CDA documents embedded in DocumentReference.  You can't, however, expect that most terminology servers are going to pay attention to such extensions or do anything useful with them.  For many, an extension with TQL will be no more computable than a value set defined in narrative.</p>",
        "id": 205825853,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596477447
    },
    {
        "content": "<p>I would argue that if all you are doing is wrapping a proprietary query in a FHIR ValueSet skin, then you are not \"using FHIR\".  In my book, FHIR is about interop, so this approach is not in the right spirit.  It's not that \"you don't get to use FHIR\" if you don't use compose, it's that there is limited _value_ to using FHIR if you don't use compose.</p>\n<p>But, by all means, include the TQL as documentation; that is really valuable, and also useful to some if it's machine readable (not just replicated in the narrative, but at least include the pre-expanded ValueSet or an extensional definition.</p>\n<p>One concern I have about TQL (based on things I seen in the context of LOINC), is that it still queries a proprietary data model, not something sanctioned by the code system publisher.  The strength of the FHIR CodeSystem is that it provides a mechanism for having a consistent and agreed on API (table design) to the code system content.</p>\n<p>My second concern is that I cannot find any documentation for it online. </p>\n<p>However, if a language such as TQL is widely used, then it might make sense to make it a first-class citizen in the FHIR Terminology ecosystem, just like ECL is for SNOMED.</p>",
        "id": 205870780,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1596512564
    },
    {
        "content": "<p>you could use TQL in a filter just like ECL, but I'm not sure that it's standardised enough?</p>",
        "id": 205897284,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596542095
    },
    {
        "content": "<p>but also, that's not what Rob's trying to do, from what he says. Obviously clearer documentation would help</p>",
        "id": 205897308,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596542121
    },
    {
        "content": "<p>but <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> the expression extension seems far removed from the start of this conversation about trusted source</p>",
        "id": 205897337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596542152
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179202-terminology/topic/Block.20vote.20on.20Vocab.20Main.20call.202020-07-23/near/205543043\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>This would allow requesters the ability to get the expansion without performing another $expand</p>\n</blockquote>\n<p>Don't understand why this is useful.</p>\n</blockquote>\n<p>Distributing expansions for IGs and Profiles?</p>",
        "id": 206210585,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1596757473
    },
    {
        "content": "<p>that's a provisioning question. Does it make any difference to the client?</p>",
        "id": 206211393,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596758245
    },
    {
        "content": "<p>It might make a difference to the application developers using an IG to have a consistent rendering of a complex ValueSet expansion.</p>",
        "id": 206216934,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1596764652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> The issue with TQL vs ECL is that ECL can declare all operators <em>within a single code system</em> because that is all it's good for and it fits with the <em>everything must be code system specific</em> mindset of FHIR. TQL is code system agnostic and is not declared within a code system. I might not understand how FHIR works now, but I was under the impression that concept filters had to be declared within a code system. Not true?</p>",
        "id": 206368638,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596929083
    },
    {
        "content": "<p>not quite true, no. A code system can define filters for use with the code system, but it's also possible for us to define filters that can be used against all code systems. And so we could choose to define a TQL query, if there was a standard to refer to. Or we could do it less formally if there was a less formal to base it on</p>",
        "id": 206409344,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597002911
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> I've asked to find an accessible TQL reference. So I take from your comment, there is no way to use TQL or any other general terminology query syntax other than FHIR compose but FHIR-I and Vocab are open to making some changes to the Filter element (specifically filter.property and  filter.op) to support a more complex compose that matches what TQL would create? We need to add support what in SQL would be inner joins at least. I'd have to spend more time with this to be more clear but it would be a lot simpler to acknowledge that there are existing users that are interested in exchanging operable TQL even if others can't use it. The community certainly has no problem promoting ECL when very few can use that. I really don't see why there is such pushback on making value sets understandable and useful for users that can not get what they want using compose. If you refuse to accept an expression extensions, just assume it's rules-text. The only other outcome is all the logic used to craft an expansion is hidden in user files and they have to continue to make brittle enumerated compose.include when that brittleness is not clearly communicated.</p>",
        "id": 206416230,
        "sender_full_name": "Robert McClure",
        "timestamp": 1597015293
    },
    {
        "content": "<blockquote>\n<p>there is no way to use TQL or any other general terminology query syntax other than FHIR compose</p>\n</blockquote>\n<p>I didn't say that. Nor did the committee. Michael pushed back on it, if people use a TQL expression in place of what can be said in a compose. Which I think is reasonable. But I think it's reasonable to allow people to exchange additional metadata about how they defined the value set, while not encouraging them to avoid actually defining them properly.  From that regard, the definition of the extension and it's examples clearly need additional work.</p>\n<p>But I think it's reasonable also to define how TQL could be used in a compose, which would have a different purpose and different ramifications. (Though I don't see how that relates to inner joins)</p>\n<p>So: I don't think there's underlying disagreement here - we just need clarity in both the source definitions and this discussion</p>",
        "id": 206419465,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597021063
    },
    {
        "content": "<blockquote>\n<p>Michael pushed back on it, if people use a TQL expression in place of what can be said in a compose. Which I think is reasonable.</p>\n</blockquote>\n<p>Exactly.  I also asked for examples of things that can be said in TQL that could not be expressed (or are difficult to express) in a <code>ValueSet.compose</code>.  It sounds like inner joins might be related to this?</p>",
        "id": 206522806,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1597100133
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> , <span class=\"user-mention\" data-user-id=\"196635\">@Jessica Snell</span>  (Apelon), is going to post how to access the TQL Documentation and provide some examples</p>",
        "id": 206581578,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1597156007
    },
    {
        "content": "<p>The Apelon TQL Documentation is available on the Documentation Downloads page at <a href=\"http://www.apelondts.org/Downloads/Documentation/tabid/137/Default.aspx\">http://www.apelondts.org/Downloads/Documentation/tabid/137/Default.aspx</a>. Access does require creating a free login to <a href=\"http://apelondts.org\">apelondts.org</a>. I am working with our developer to get a list of TQL functionality that cannot be represented in FHIR and will be in touch.</p>",
        "id": 206585312,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1597157801
    },
    {
        "content": "<p>Thanks Jessica - not sure how I missed this</p>",
        "id": 206623566,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1597175933
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191343\">Michael Lawley</span> <a href=\"#narrow/stream/179202-terminology/topic/Block.20vote.20on.20Vocab.20Main.20call.202020-07-23/near/206623566\">said</a>:</p>\n<blockquote>\n<p>Thanks Jessica - not sure how I missed this</p>\n</blockquote>\n<p>It was posted in there this morning, so you didn't miss it! Let me know if you have any questions, happy to help.</p>",
        "id": 206624961,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1597176621
    },
    {
        "content": "<p>So, I see from the documentation that TQL is a lot more than a query language -- it includes DML-like statements, IO statements etc.<br>\nWould it be reasonable to assume that <strong>only</strong> <code>collection-statement</code>s are used for ValueSet definition?  (and that such <code>collection-statement</code>s do not themselves contain statements?<br>\ni.e., the grammar is effectively limited to:</p>\n<div class=\"codehilite\"><pre><span></span><code>collection-statement := FROM [ collection-mods ] collection “;”\n</code></pre></div>",
        "id": 206769521,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1597278339
    },
    {
        "content": "<p>This topic has moved on somewhat to the valueset-expression extension and TQL, but I'll move us back (at least for the moment) to the discussion of the proposed resolution text for <a href=\"http://jira.hl7.org/browse/FHIR-23785\">J#23785</a>.  We looked at this again on the first 30 min. of the FHIR Tracker call today (ended early for the co-chair webinar) and came up with this update.  We tried to take into account the most recent comments.  This doesn't specify conformance to the cpg-executablevalueset and cpg-computablevalueset profiles, but I'm not sure that's a requirement (and if it is, it can be added)?  It would be great to be able to get this issue resolved with a vote on the Vocab Main call next week.</p>",
        "id": 206874124,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1597354130
    }
]