[
    {
        "content": "<p>More of a SNOMED question: Is it possible to infer Observation.category from a SNOMED Concept. E.g. for a concept 160621008 (Ex-cigar smoker) would it be possible to use the CodeSystem to find out this is social-history ... Would I need to use a refset?</p>",
        "id": 153912941,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507360081
    },
    {
        "content": "<p>You can use the CodeSystem $subsumes operation to return any relationship between SCT codes. This will tell you that 160621008|Ex-cigar smoker| is not subsumed by 160476009|Social history|... CodeSystem/$subsumes?system=http://snomed.info/sct&amp;codeA=160621008&amp;codeB=160476009</p>\n<p>These concepts come from different SCT hierarchies. Ex-cigar smoker is a clinical finding and social history an observable entity.</p>",
        "id": 153912944,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1507367580
    },
    {
        "content": "<p>So using this example <a href=\"https://gist.github.com/KevinMayfield/a1921748f91e6245319132989be14909\" target=\"_blank\" title=\"https://gist.github.com/KevinMayfield/a1921748f91e6245319132989be14909\">https://gist.github.com/KevinMayfield/a1921748f91e6245319132989be14909</a></p>",
        "id": 153912945,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507370925
    },
    {
        "content": "<p>I think this is true: valueQuantity 428041000124106 Occasional tobacco smoker is a child code of 229819007 Tobacco use and exposure.</p>",
        "id": 153912946,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507371193
    },
    {
        "content": "<p>Which in turn comes under category social-history from CodeSystem <a href=\"http://hl7.org/fhir/observation-category\" target=\"_blank\" title=\"http://hl7.org/fhir/observation-category\">http://hl7.org/fhir/observation-category</a></p>",
        "id": 153912947,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507371235
    },
    {
        "content": "<p>From an implementation point of view: Given many systems I've worked on would have just recorded the code: 428041000124106 Occasional tobacco smoker.  When I recieved a search on category social history I need to find the correct place in the SNOMED heirarchy to search from and then search for child codes.</p>",
        "id": 153912948,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507371392
    },
    {
        "content": "<p>Alternatively we should use a SNOMED ValueSet for category. (I’m not a clinical coder) Something like we would use <a href=\"https://snomedbrowser.com/Codes/Details/228272008\" target=\"_blank\" title=\"https://snomedbrowser.com/Codes/Details/228272008\">https://snomedbrowser.com/Codes/Details/228272008</a> in place of social-history.</p>",
        "id": 153912950,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507371576
    },
    {
        "content": "<p>So observation.valueQuantity is a child of observation.code is a child of observation.category.</p>",
        "id": 153912951,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507371712
    },
    {
        "content": "<p>Ideally, you should be able to infer the Observation.category code(s) from Observation.code, but there is no guarantee of (or even suggestion of, really) whether that will be possible in any given case.  The only explanation in the Observation resource documentation is \"Used for filtering what observations are retrieved and displayed\".  That pretty much reflects the original intent of the 'category' element, and the thought at that time was that it could be used for that purpose by applications that weren't able to understand the semantics of the code system being used in Observation.code, but by using the 'category' code they could at least figure out where to display the data in their application.  In practice, what people need and want in that regard is obviously rather implementation and system dependent, and it's difficult to find a single set of codes that will work for that purpose for everyone.  So now the 'category' element has become 0..* Codeable concept, so you can pretty much categorize the resource however you want - essentially treating 'category' as a set of one or more \"tags\".  Getting back to the original intent, if your system <strong>does</strong> understand the semantics of the code system that is being used in Observation.code, then you can make use of the code system semantics instead to achieve that purpose, and in that case  you really wouldn't need to use the 'category' element at all.  And if you do populate Observation.category, the code(s) there should be semantically consistent with Observation.code, as I think you've described above (e.g. if using SNOMED CT they would be at a higher level in the SNOMED CT hierarchy).  You might map the FHIR observation-category codes to the code system being used in Observation.code (but you don't have to do that) - if you did do that then you could provide both the FHIR code and the mapped code (e.g. SNOMED CT), since translations are allowed.  In your own situation, using SNOMED CT, I suspect that you might want to consider one of those options.</p>",
        "id": 153912954,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1507387869
    },
    {
        "content": "<p>Thanks. So I believe we would need a SNOMED ValueSet for observation.categories and observation.codes - the (UK) profiles I looked at, had standard fhir 'example' bindings to valuesets but when I looked at the detail they are both bound to SNOMED CT. Nothing to stop us from going live soon though.</p>",
        "id": 153912955,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507389392
    },
    {
        "content": "<p>Yes, I think that's what I would do in your situation.</p>",
        "id": 153912962,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1507398659
    },
    {
        "content": "<p>I think this is showing a constraint between valueQuantity-&gt;code-&gt;category which isn't apparent in the profile. The most detailed concept (valueCodeableConcept/code) will dictate concepts above it (code/category) in the resource - so when a Observation is POSTed in it may be different when retrieved. Think we need to build this into UK validation tools to prevent this.</p>",
        "id": 153912975,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507448991
    },
    {
        "content": "<p>The validation would ensure SNOMED CT parent/child relationships are correct</p>",
        "id": 153912976,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1507449066
    }
]