[
    {
        "content": "<p>While I am reviewing a ballot, I notice this: <br>\nIn base FHIR spec, ValueSet.useContext.value[x] has an example binding. The profile I reviewed sliced ValueSet.useContext like this:<br>\n<a href=\"/user_uploads/10155/oQvOCZCP-wVFAP9dHJO4yNoe/image.png\">image.png</a> <br>\nI am not sure if this is correct since there is no value set created using that specific code system</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/oQvOCZCP-wVFAP9dHJO4yNoe/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/oQvOCZCP-wVFAP9dHJO4yNoe/image.png\"></a></div>",
        "id": 223174591,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1611014412
    },
    {
        "content": "<p>I think that it is OK. <br>\nThe slice definition does fix values for the elements, and that is all it is required to do. Slicing can work on elements that cannot be bound, such as integer.<br>\nBinding an element to a value set is independent.</p>",
        "id": 223174936,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1611014829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> I disagree. This is nothing like what is going on with using the integer datatype to clarify that a single integer is acceptable in a slice for an unbound element. <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> did you NEG comment this? Clearly they have a minimum expectation for certain required codes in that \"example\" binding. I don't think we have a good approach for this described. Perhaps there could be a MIN binding of some type, yet still example? <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 223246614,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611071666
    },
    {
        "content": "<p>There's no requirement to bind a value set to a coded element.  It's completely fine to just set a fixed value for a slice.  The only constraint is that if there <em>is</em> a binding on the element overall, all slices must adhere to the rules of that binding.</p>\n<p>My main issue with this example is the fixed values declared for Coding.display.  That's really bad practice.</p>",
        "id": 223249744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611073027
    },
    {
        "content": "<p>Also, you're constraining all coding repetitions, which is also bad practice.  Much better to slice by pattern and declare just code and system.</p>",
        "id": 223249844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611073067
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<blockquote>\n<p>There's no requirement to bind a value set to a coded element. It's completely fine to just set a fixed value for a slice. The only constraint is that if there is a binding on the element overall, all slices must adhere to the rules of that binding.</p>\n</blockquote>\n<p>That seems sloppy to me, but perhaps I'm confused about something. Is it true that if a slice fixes to a specific coding in this case a <em>mustSupport</em>, that implementers will have to  make sure that whatever value set is <em>implemented</em> also includes any code that is in the slice? If that is correct, then we are hiding requirements that the IG author should make more specific. </p>\n<p>BTW, I completely agree with your suggestion on how to specify the slice.</p>",
        "id": 223254932,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611075059
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I would like to clarify this. The value[x] has an example binding in base profile. While slicing it, the author could ignore the binding and put any system/code in the slice since the binding strength is example?</p>",
        "id": 223257391,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1611075985
    },
    {
        "content": "<p>Technically, even if they defined a required binding, they wouldn't have to ensure the binding contained the code - however that would mean that when sending the fixed code they might have to send a translation that was in the value set as an additional coding.  If the binding was looser, then there'd be less of an issue. </p>\n<p>Example bindings are completely ignorable from an implementer perspective.  They carry no weight in terms of implementation expectation - they're just to give an idea of the kinds of concepts that could potentially be used.</p>",
        "id": 223260593,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611077168
    },
    {
        "content": "<p>I was just going to say something similar with respect to the example binding.</p>",
        "id": 223260881,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1611077270
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> You are just restating the party line on what each of these things means but you are missing the interdependency allowed by this (my word) - sloppy - capability to have a <em>must support</em> slice that requires a specific code in an element with an example binding. It's saying two different things that are yes, technically, not in conflict but is a hidden dependency that is very unclear. This is saying there is \"there is no binding\" but also \"you must support this code.\" FHIR might think this makes sense but that element has implementation requirements that are hidden in the slice.</p>",
        "id": 223586767,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611272492
    },
    {
        "content": "<p>What would you suggest?  Forcing the example binding to include the code seems like unnecessary busy-work, especially for an example binding.  Reality is implementers must look at both fixed values <em>and</em> bindings <em>and</em> invariants to understand what they have to worry about.</p>",
        "id": 223587966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611273522
    },
    {
        "content": "<p>I think at a minimum we need to clarify exactly what you just said if in fact it is how we want this capability controlled - through each of those levers independently.</p>\n<p>Confirm for me: The approach taken is a known approach for communicating the requirement to implementers that they must include and understand the code in the slice with <strong>no requirement </strong>that the code be in the bound value set? If yes, then I think vocab needs to agree this is makes sense. We will also need to explain that the binding is only part of the requirements implementers have on values that must be implemented for that element. This is <strong>very different</strong> than any other product we have. And this sort of process should not just \"be ok\" based on FHIR-I, but an agreed upon approach that meets all user needs in a transparent way. TO be clear, I'm not saying this need is wrong. I'm saying it's sloppy communication. <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span></p>",
        "id": 223589128,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611274549
    },
    {
        "content": "<p>If a binding is applied to a repeating element, that binding applies to all repetitions.  (I just submitted an issue indicating that we have a problem on some of our resource elements because of that - <a href=\"https://jira.hl7.org/browse/FHIR-30501\">https://jira.hl7.org/browse/FHIR-30501</a>.)  However, example and preferred bindings are irrelevant from a conformance perspective.  If there's a required binding, you <em>could</em> have an invariant or slice that forces something else as well, but that should be unusual.  Most typical would be to force a fixed value/pattern for a high-level categorization and then a required binding to specify the detail.</p>",
        "id": 223589792,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611275065
    },
    {
        "content": "<p>I can't see any rules we could make here that wouldn't have reasonable use-cases that would violate the rule.</p>",
        "id": 223589814,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611275095
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Can you give a link that documents what you have said here? Where is this policy stated so that IG devs understand they can do this and implementers understand the implications of it?</p>",
        "id": 223721070,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611362424
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I don't think there is a policy anywhere but it makes total sense and has been how I've been building my IGs.</p>",
        "id": 223724467,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611365890
    },
    {
        "content": "<p>You have to remember that example bindings are basically no binding at all.  Preferred bindings have more weight but don't actually impose any real constraints since I can use any code I want.  Obviously Extensible and Required actually do impose a constraint.</p>",
        "id": 223724502,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611365987
    },
    {
        "content": "<p>So if I have a data element that has an example or preferred binding and I constrain that to have a fixed code, I don't need to bind it to a value set first just so I can fix the code.  You could do that but I don't see the point to that.  Just adds a level of indirection (maybe misdirection?) - \"here is this value set you have to take one of your codes from, except that I have fixed it to just be this one code.\"</p>",
        "id": 223724588,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611366099
    },
    {
        "content": "<p>Right.  This isn't a \"policy\".  It's just how the machinery works.  Bindings exist, fixed values exist, patterns exist and invariants exist.  We haven't declared any dependency amongst them, which means that no dependency exists.  And there's no need for a dependency to exist.  The only time you'd actually run into trouble is if you had an element of type 'code' or 'Coding' and specified both a fixed value or pattern and also a fixed binding that conflicted.  Even then, I'm not sure if the publication machinery would catch it - it'd just be impossible to create an instance that satisfied the constraints.</p>\n<p>Whether implementers understand this (or anything else) will vary.  Fixed values and invariants are widely understood.  Patterns, perhaps less so.  And bindings less still.  But declaring a 'policy' that just reflects current reality isn't likely to make that better.</p>",
        "id": 223730657,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611375448
    },
    {
        "content": "<p>Folks, to be clear, I'm not disagreeing with the value of meeting different needs using the appropriate capability. What I'm pointing out is this is completely different than what we have done in other product families and explaining to designers and implementers the resulting functionality and dependencies is useful. And we need to make sure those of us who work explicitly with terminology understand how to communicate and teach the policy. </p>\n<blockquote>\n<p>Whether implementers understand this (or anything else) will vary. Fixed values and invariants are widely understood. Patterns, perhaps less so. And bindings less still. But declaring a 'policy' that just reflects current reality isn't likely to make that better.</p>\n</blockquote>\n<p>This is the part that I simply do not agree with. Why on earth would we not make this approach clear? This subtle blaming of users that they will not understand things if we make them clear,  is not justifiable. In particular I want to be able to point to guidance that clarifies <strong>all</strong> the places in FHIR that must be reviewed to determine what values must be computably understood and may be exchanged for an element. Until this thread, I would have said it was solely determined by the binding.  To blame me for misunderstanding because I am not fully FHIR developer-knowledgable is not a solution. I'll help, let's clarify.</p>",
        "id": 223756766,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611418174
    },
    {
        "content": "<p>If you'd like to submit a change proposal with wording you feel makes things more clear, by all means do :)</p>",
        "id": 223757015,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611418514
    },
    {
        "content": "<p>Given that I'm just learning of this, I'm not able to clarify what it means so I'll happily accept your assistance <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 223757918,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611419746
    },
    {
        "content": "<p>The slice on useContext there isn't intended to provide a configuration point, it's a fixed value constraint to indicate that the instance is for use in public health reporting. I would agree that it should only be a constraint on a single slice, and I agree the use of pattern on system and code only would be a better practice, but I also agree that this isn't a case where a value set binding would be necessary, it's just constraining to a single code. I'd also be happy to try to help provide language to clarify the capabilities, but where would that language go?</p>",
        "id": 223758189,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1611420090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  I agree that it could be useful to document this, or reference the documentation for it, in a single place that we could point people to.</p>",
        "id": 223758250,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1611420173
    },
    {
        "content": "<p>The only thing I can think to say is that \"The content of coded elements can be constrained by fixed values, patterns, bindings and constraints.  Those can be declared as applying to all repetitions of the instance, individual repetitions (via slicing) or, in the case of CodeableConcept, on individual Coding slices within the CodeableConcept.  Any combination is legal so long as it's possible to construct a valid instance.  For example, it's possible to have a 'required' binding on Condition.code requiring a SNOMED code as well as a 'pattern' that forces the presence of a specific ICD10 code because it's possible to have multiple codings within Condition.code and thus satisfy both.\"</p>",
        "id": 223762427,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611425673
    },
    {
        "content": "<p>If you like that text, you can figure out where you'd like it to appear :)</p>",
        "id": 223762434,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611425691
    },
    {
        "content": "<p>That's probably not too bad to start with.</p>",
        "id": 223762533,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1611425869
    },
    {
        "content": "<p>Proposed Modification:<br>\nThe content of coded elements can be constrained by any combination of fixed values, patterns, bindings and constraints. One of these constraint can be declared as applying to all repetitions of the instance (via binding where appropriate) or individual repetitions (via slicing.) For an element using CodeableConcept, individual Coding slices within the CodeableConcept can <em>independently</em> constrain using any of these methods. For an element, any combination is legal so long as it's possible to construct a valid instance. This means that a summary of all allowed values can only be determined by assessing all the constrain options used for that element. For example, it's possible to have a 'required' binding on Condition.code requiring a SNOMED code as well as a 'pattern' that forces the presence of a specific ICD10 code because it's possible to have multiple codings within Condition.code and thus satisfy both.</p>",
        "id": 223765499,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611428191
    },
    {
        "content": "<p>Help me with \"patterns.\" Is that a specific thing we need to mention in a specific way?</p>",
        "id": 223766117,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611428530
    },
    {
        "content": "<p>I don't want to call out 'binding' as special - it's not.</p>\n<p>How about: \"The content of coded elements can be constrained by any combination of fixed values, patterns, bindings and constraints.  If specified at the element level, the constraint applies to all repetitions.  If applied to  slices, the constraints can be limited to a subset of repetitions for repeating elements and, for CodeableConcepts, it's also possible to define constraints for subsets of the codings.  All constraint assertions are independent, but authors SHOULD ensure that constraints are not defined in a way that makes it impossible to satisfy all the constraints in a single instance.  For example, if an element is of type code, it's not useful (though not strictly prohibited) to have a 'required' binding to SNOMED codes while also asserting a fixed value that's an ICD-10 code.  The only way to satisfy both constraints would be to omit the element entirely.  On the other hand, if the data type were a CodeableConcept, it'd be possible to have an instance with multiple codings, and thus satisfy both the binding and the fixed value.\"</p>",
        "id": 223773081,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611432955
    },
    {
        "content": "<p>Some of that advice is probably going to confuse 'authors' (presumably those creating profiles and IGs) and completely bamboozle those of us blessed with the task of developing working software.  In particular, it makes no sense (to me anyway) to bind any element with a datatype of  code to SNOMED CT as that code in insolation (i.e. without a code system uri or description) is meaningless when received in a resource. So far, just about every element of datatype code that I've used has been in a mandatory field with a required binding strength , exposed by the .NET Reference Library as an enumerated datatype  and a member of a Value Set that contains meaningful codes (i.e. understandable by humans and machines ). For examples, take a look at the <a href=\"http://hl7.org/fhir/medicationrequest.html\">MedicationRequest</a> resource.</p>",
        "id": 223783756,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1611444147
    },
    {
        "content": "<p>The point of the example is that it's possible to create constraints that are impossible to satisfy, but in most cases even if you have 'conflicting' constraints, you can still create an instance that satisfies all of them.</p>",
        "id": 223785516,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611446458
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Do you mean you can create an instance that satisfies all of the constraints or just one of them?</p>",
        "id": 223790177,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1611453999
    },
    {
        "content": "<p>Instances must satisfy all declared constraints</p>",
        "id": 223791671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611456533
    },
    {
        "content": "<p>So if there's a pattern saying \"must have exactly this ICD-10 code\" and a required value set drawing only from SNOMED, that can't be satisfied for 'code', but can be satisfied for CodeableConcept.</p>",
        "id": 223791730,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611456606
    },
    {
        "content": "<p>How about <a href=\"http://build.fhir.org/valueset-marital-status.html\">this gem</a> from the extensible binding to patient.martialStatus - particularly the definition of the concept for UNK  ('unknown')!</p>",
        "id": 224136474,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1611718445
    },
    {
        "content": "<p>Unknown isn't mutually exclusive with extensible.  'Other' is though.  If you know the marital status and it's not equivalent to or a specialization of any of those listed, then extensible would be ok.  The big problem is that the space is completely covered by the codes.  Either you're married or you're unmarried.  The intersection of those two concepts, by definition, covers the entire space, so any esoteric thing you could come up with would have to fall under one or the other.  Unless somehow there's a state that somehow allows you to be simultaneously both?  The reality is that the code system is total junk.  Specialization relationships should exist that aren't there, and there's no recognition that you could be many of those things simultaneously - because multiple relationships could exist.</p>",
        "id": 224137552,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611719795
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 224139396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611722161
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> the last proposed draft above could be improved by restructuring it to first talk about binding and then secondarily to talk about slices. As it is, it mixes the concepts and the slicing and introduces slicing on the sly</p>",
        "id": 225230367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612476243
    }
]