[
    {
        "content": "<p>Seeking clarification on the Code System Resource.</p>\n<p>The FHIR CodeSystem Resource specifies three operations ($lookup, $subsumes, $compose), but there is currently no way to validate that a concept code is a valid code in the code system (similar to the $validate-code operation on the ValueSet Resource).</p>\n<p>How would one go about validating that a concept code is valid in a given code system?</p>\n<p>One way would be to do a $lookup and looking for null result, but I don't see this specified anywhere in the specification.</p>\n<p>Another option would be to use the implicit value set for all codes in the code system and do a Value Set $validate-code.</p>\n<p>Have either of the above options been considered and recommended, or is a new Code System Resource Operation in order here?</p>",
        "id": 153868417,
        "sender_full_name": "Russ Hamm",
        "timestamp": 1484847890
    },
    {
        "content": "<p>Thus far, I've used the $validate-code operation on the implicit value set for the all of the codes in the larger code systems on my terminology server (e.g. SCT &amp; LOINC).</p>",
        "id": 153868428,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1484852532
    },
    {
        "content": "<p>I mentioned $validate-code on the implicit value set for \"all codes\" for the code system  to Russ as the most likely option currently.  But we might want to have a more explicit (and obvious) mechanism for this?  Probably $validate-code also on CodeSystem - so that you could validate on either the value set or the code system explicitly?</p>",
        "id": 153868463,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1484863625
    },
    {
        "content": "<p>I think the $validate-code option is reasonable, but also that $lookup is the more direct option.  I'd prefer to avoid a proliferation of operations and instead document this use-case in the spec.  The gotcha here is clearly articulating appropriate behaviour of $lookup for a composite code where the code system supports composition.  E.g., language codes, UCUM, and SNOMED CT</p>",
        "id": 153868467,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1484864581
    },
    {
        "content": "<p>A $validate-code operation at the Code System resource level seems to align with the CTS2 \"exists\" or \"existsInCodeSystem\" operations on the Entity Description Service which is used to determine if the specified Entity exists in the specified code system version.</p>\n<p>In this context an Entity is analogous to a concept.</p>",
        "id": 153868469,
        "sender_full_name": "Russ Hamm",
        "timestamp": 1484864874
    },
    {
        "content": "<p>I guess that it boils down to the use case; does a user wish to validate that a code is a valid member of a value set, or a code system? If it's the later then, as Michael says, $lookup may be the more direct option.</p>",
        "id": 153868512,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1484880273
    },
    {
        "content": "<p>it would be good anyway to clarify what lookup does when there's no such code. The answer should be an OperationOutcome... so it serves to validate</p>",
        "id": 153868553,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484907578
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Yes, it should be an OperationPutcome.  And if we clarify that behavior, then I think using $lookup would work. </p>",
        "id": 153868566,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1484917100
    },
    {
        "content": "<p>Looking at the spec, the ValueSet <code>$validate-code</code> operation returns a Parameters Resource with result=false if the validation fails so, unless that is incorrect, perhaps the CodeSystem <code>$lookup</code> operation should behave in the same way?  Maybe for R4 as there is no R3 $lookup out parameter that indicates failure?</p>",
        "id": 153868669,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1484936408
    },
    {
        "content": "<p>Since Code Systems and Value Sets are distinct animals I see both use cases being of value. <br>\nFor example:.</p>\n<p>1. Is '22298006'  a valid concept identifier in SNOMED?<br>\n2. Is '22298006' a valid concept identifier in the Ischemic Heart Disease Value Set?</p>\n<p>Is it reasonable to assume that receiving a null result from a $lookup operation on a Code System implies that the conce does not exist in the code system?  I would prefer to submit a $validate operation for a given code on a Code System, and if it retunres \"true\", then proceed with a $lookup to obtain whatever metadata I may be interested in.</p>",
        "id": 153868832,
        "sender_full_name": "Russ Hamm",
        "timestamp": 1485203288
    },
    {
        "content": "<p>I like that.</p>",
        "id": 153868833,
        "sender_full_name": "Russ Hamm",
        "timestamp": 1485203611
    },
    {
        "content": "<p>We can do this sufficiently in ValueSet $validate-code, I think - <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12700\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12700\">GF#12700</a>.  We may still want to enhance the behavior of the $lookup response when presented with an invalid code, as well.</p>",
        "id": 153869146,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1485370383
    },
    {
        "content": "<p>valid = false is different from validate failed with operation outcome </p>",
        "id": 153870120,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486349260
    },
    {
        "content": "<p>$lookup should return an operation outcome - at least for DSTU3. Is there a task to make this explicit?</p>",
        "id": 153870121,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486349283
    },
    {
        "content": "<p>We voted on <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12700\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12700\">GF#12700</a> on Thursday, to add $validate-code also to CodeSystem, but it didn't address the operation outcome - so we don't currently have a task for that.</p>",
        "id": 153870130,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1486349729
    }
]