[
    {
        "content": "<p>Suppose I am coding sub-types of a given disease X with SNOMED (e.g. diabetes, which has the sub-types type-1, type-2 etc.).  Let's say there are  5 possible subtypes of X, viz. A, B, C, D, and E. However, for a particular purpose, I only want to explicitly capture the occurrence of A and B - for the rests, I only want to capture \"patient has a different type of disease\" (neither A nor B, so C, D, or E). The parent code X is of course also implied, but using that is too vague because it also includes A &amp; B. I want to be able to code all cases uniformly as conditions, so I want the code for \"this type of disease but not subtype A or B\" to mean exactly that and not be a generic \"other\" code. In effect, I want a \"union code\" saying \"either C or D or E\". Is there some way of doing that (short of defining a custom code with that exact meaning)? E.g is there some of way of using a condition with the code set to X and then elsewhere using other codes to indicate (in a structured form) that the subtype is known not to be A or B?</p>",
        "id": 267983889,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1642148769
    },
    {
        "content": "<p>Why not just allow people to say C D or E, then just treat them as a group for your use case?</p>\n<p>Stopping someone from providing the extra detail (when known) is somewhat of an anti pattern.</p>",
        "id": 267984122,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1642148929
    },
    {
        "content": "<p>Agreed, but this is something that has already been fixed (pre-existing guidelines).</p>",
        "id": 267984188,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1642149000
    },
    {
        "content": "<p>There is no way to do this with snomed as-is. The best you can do is define a new code - F - that is a child of X and the parent of C, D, and E.</p>",
        "id": 267984647,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1642149278
    },
    {
        "content": "<p>Can one design such a code (within SNOMED) \"on-the-fly\" or do you mean one should submit that as a suggestion for a new code to SNOMED?</p>",
        "id": 267985078,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1642149535
    },
    {
        "content": "<p>It would have to be a new code for SNOMED. There's no good way to specify disjunction (or negation) via post coordination.</p>\n<p>Given that this is a guidelines driven requirement, it's probably reasonable for the new code to be created.</p>\n<p>If you absolutely must do this via post coordination then you could construct a Situation With Explicit Context code that says \"X known present\" and \"A known absent\" and \"B known absent\", but that's pretty horrid for data analysts to consume.</p>",
        "id": 267989367,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1642152308
    },
    {
        "content": "<p>OK, that sounds sensible - thanks <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> !</p>",
        "id": 267990873,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1642153225
    },
    {
        "content": "<p>Thinking more about this: Is there a standard way, in SNOMED or ICD-10, of creating <em>conjunctive</em> codes? I.e. if I want to say \"the patient is known to have either disease A or B\" - again in cases where there is no parent term representing this particular set of codes.</p>",
        "id": 267998013,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1642157584
    }
]