[
    {
        "content": "<p>1. Can a supplement specify and alternative <code>display</code> value for a concept?</p>\n<p>2. Can it specify an alternative <code>use</code> code for a designation?</p>",
        "id": 153946730,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1521589054
    },
    {
        "content": "<p>#1 it can add designations. We haven't described any way in which it could replace the display defined by the code system, but we also haven't said that a code system supplement can't define a designation that is the most appropriate to use in a given context. </p>\n<p>#2. no. but it can define a new designation with the same value and a new use code</p>",
        "id": 153946731,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521590866
    },
    {
        "content": "<p>Are supplements permissible for SNOMED CT?</p>",
        "id": 153946740,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1521595712
    },
    {
        "content": "<p>summary of discussion on call this morning:<br>\n- SCT editions are fragments of SCT. <br>\n- it's theoretically possible that someone could publish an entire copy of SCT, but no one is empowered to resolve all the conflicts that arise trying to do so<br>\n- SCT language packs might be supplements<br>\n- there's a useful thing to do with code system supplements: adding external property references to SC concepts (e.g. this SCT concept for lab test has x loinc codes as result tests)<br>\n- you could do the same using reference sets in SCT. FHIR is probably easier to author and consume in the FHIR world, SCT reference sets are easier to use across the SCT eco-system<br>\n- FHIR has no reason to prohibit SCT supplements<br>\n- SCT could probably do so, but why? Inclination seemed to be not to prohibit, but good documentation is required somewhere</p>",
        "id": 153946741,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521596144
    },
    {
        "content": "<p>Thanks Grahame. It will be interesting to see if supplements are an easier way to implement some of the SCT Reference Set types. An example of a Value Set containing SCT concepts and supplementary information about those concepts might be helpful.</p>",
        "id": 153946792,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1521618249
    },
    {
        "content": "<p>1. Wrt \"SCT editions are fragments of SCT.\", this was an assertion of Grahame's and I'm not quite sure what it really means (ie. what the implications are).  On the surface it seems plausible, but I'd like to understand better how this interacts with, for example, the versioning dimension.  It's also not entirely clear what are the practical impacts of fragments; the spec (rightly at this stage)  warns about having multiple fragments present in a terminology server.</p>\n<p>2. From an IP perspective, I believe anyone with a SNOMED licence is empowered to resolve a merged version of SCT, but the challenge is getting others to accept it for use.  I could conceive an national release centre (NRC) attempting such a thing, probably in collaboration/consultation with other NRCs.</p>\n<p>3. SCT language reference sets manifesting as supplememts is very appealing, if only to establish \"a use of preferred term\".  Currently there's no way within SCT to mark a designation as unacceptable, but I believe that may be a desirable additional role here.  However, I don't fully understand how supplements are referenced as part of a ValueSet definition or in an operation like $expand because I've only just stumbled across <a href=\"http://hl7.org/fhir/StructureDefinition/valueset-supplement\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/valueset-supplement\">http://hl7.org/fhir/StructureDefinition/valueset-supplement</a> which raises some questions for me:<br>\n a - why is this not directly referenced?<br>\n b - why an extension and not an element in <code>ValueSet</code>?<br>\n c - Why is it typed as <code>Reference(CodeSystem)</code> and not <code>uri</code> or <code>canonical</code>?</p>\n<p>4. I don't believe there's any desire (nor authority) for SCT to prohibit supplements since they don't affect the hierarchy or the modeling of concepts</p>",
        "id": 153946804,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1521626117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> do you support supplements with <code>$expand</code> or <code>$lookup</code>?</p>",
        "id": 153946805,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1521626275
    },
    {
        "content": "<p>#1 - agree about the practical issues; in fact, that's a good description of the issue. Agree that the fact that the editions are heavily linked to versioning means that the natural way to think about them is as versions, but underneath that is the fact that the versions are on subsets of the whole. Were one to extract out a frozen version, but still split up into national distributions, then you'd have fragments for real. But I'm not claiming that would be a useful thing to do, and since no one is going to (or, at least, should not try) representing SCT as an actual CodeSystem resource instance, it's all pretty academic</p>",
        "id": 153946819,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521632703
    },
    {
        "content": "<p>#3 - we didn't make it a core element yet because we're being conserative. If it gets used enough, we'll probably elevate it. It should definitely be a canonical(CodeSystem) - I realise that I haven't systematically reviewed the extensions. can you create a task for that?</p>",
        "id": 153946820,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521632794
    },
    {
        "content": "<p>Is there ever a reason for Reference(CodeSystem), Reference(ValueSet), or Reference(ConceptMap) rather than canonical(CodeSystem) etc?</p>",
        "id": 153946824,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1521633652
    },
    {
        "content": "<p>possibly in a corner case - literal reference. but we've pretty much said not enough justification. just do canonical</p>",
        "id": 153946825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521633861
    },
    {
        "content": "<p>Added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15808\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15808\">GF#15808</a></p>",
        "id": 153946826,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1521633972
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>, I don't support supplements in any operation at the moment as, like you, I'm not sure how they can be referenced by ValueSets  and for $lookup the 'parent' Code System (let alone an individual code) doesn't contain any reference to a supplement. I'm also still uncertain in general about the use of FHIR to resolve limitations in external (to HL7) code systems.</p>",
        "id": 153946909,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1521659271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  Ditto, we have yet to implement supplements. We currently support the creation of local \"namespaces\" that can contain their own concepts AND designations, terms, attributes and relationships to and from other \"namespaces\". Further, a local \"namespace\" can contain only associations between other namespaces, which aligns with a FHIR ConceptMapand not a FHIR CoddeSystem..sigh. The local \"namespaces\" composed of concepts and additional attributes, I think, can be represented as supplements, but time will tell :)</p>",
        "id": 153951824,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1523453854
    },
    {
        "content": "<p>2 example resources:</p>",
        "id": 153952209,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523616465
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/MtAXp1w5gs96s9J5wGu0N6E2/codesystem-example-supplement.xml\" target=\"_blank\" title=\"codesystem-example-supplement.xml\">codesystem-example-supplement.xml</a></p>",
        "id": 153952210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523616482
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/hCSJQ50Q9rfSwV9AhSaBcpGb/valueset-example-supplement.xml\" target=\"_blank\" title=\"valueset-example-supplement.xml\">valueset-example-supplement.xml</a></p>",
        "id": 153952212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523616546
    },
    {
        "content": "<p>These are for testing code system supplement functionality</p>",
        "id": 153952213,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523616558
    },
    {
        "content": "<p>e.g. <a href=\"http://localhost:964/r4/ValueSet/[id]/$validate-code?code=chol-mass&amp;system=http://hl7.org/fhir/CodeSystem/example\" target=\"_blank\" title=\"http://localhost:964/r4/ValueSet/[id]/$validate-code?code=chol-mass&amp;system=http://hl7.org/fhir/CodeSystem/example\">http://localhost:964/r4/ValueSet/[id]/$validate-code?code=chol-mass&amp;system=http://hl7.org/fhir/CodeSystem/example</a></p>",
        "id": 153952214,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523616575
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , here's the example that I brought up at the CIMI lunch that I don't see how to represent with a Code System supplement: <a href=\"https://github.com/cqframework/opioid-cds/blob/master/pages/cql/OMTKLogic-0.1.0.cql#L140\" target=\"_blank\" title=\"https://github.com/cqframework/opioid-cds/blob/master/pages/cql/OMTKLogic-0.1.0.cql#L140\">https://github.com/cqframework/opioid-cds/blob/master/pages/cql/OMTKLogic-0.1.0.cql#L140</a></p>",
        "id": 153964723,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1527201589
    },
    {
        "content": "<p>I don't think we could represent it with a ConceptMap either, because it's not just a straight conversion factor, it depends on the dose and the dose form.</p>",
        "id": 153964724,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1527201633
    },
    {
        "content": "<p>we discussed that use case in vocab, and it was one of the key reasons that we dropped ConceptMap back to trial-use - you aren't the only one with that use case</p>",
        "id": 153964725,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527201646
    },
    {
        "content": "<p>or one like it</p>",
        "id": 153964726,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527201669
    },
    {
        "content": "<p>Looking for examples of CodeSystems supplements to test the new functionality in Ontoserver V6.<br>\nBoth language translation supplements and property supplements are supported.<br>\n<span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> did you have any of these?</p>",
        "id": 174680183,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1567378279
    },
    {
        "content": "<p>Only a simple example of a language translation supplement that Grahame created - <a href=\"https://terminz.azurewebsites.net/fhir/CodeSystem/bundle-type-german\" target=\"_blank\" title=\"https://terminz.azurewebsites.net/fhir/CodeSystem/bundle-type-german\">https://terminz.azurewebsites.net/fhir/CodeSystem/bundle-type-german</a>  which supplements <a href=\"https://terminz.azurewebsites.net/fhir/CodeSystem/bundle-type\" target=\"_blank\" title=\"https://terminz.azurewebsites.net/fhir/CodeSystem/bundle-type\">https://terminz.azurewebsites.net/fhir/CodeSystem/bundle-type</a></p>",
        "id": 174680699,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1567379163
    }
]