[
    {
        "content": "<p>I am trying to find a codeSystem URL to put into the answerOption.valueCoding.system  property   for a questionnaire item about adverse event outcome.  I would like to use a URL that conforms to FHIR standards and that will be accepted by the IG publishing tools   <span aria-label=\"persevere\" class=\"emoji emoji-1f623\" role=\"img\" title=\"persevere\">:persevere:</span> .</p>\n<p>The values that we want the user to select from in the questionnaire item are at  <a href=\"http://hl7.org/fhir/R4/codesystem-adverse-event-outcome.html\">http://hl7.org/fhir/R4/codesystem-adverse-event-outcome.html</a></p>\n<p>Questions:</p>\n<ol>\n<li>\n<p>The defining URL  <a href=\"http://terminology.hl7.org/CodeSystem/adverse-event-outcome\">http://terminology.hl7.org/CodeSystem/adverse-event-outcome</a>   leads to a 404 error.  Does that 404 error mean that this URL is not to be used in the answerOption.valueCoding.system property? </p>\n</li>\n<li>\n<p>Should I use <a href=\"http://hl7.org/fhir/R4/codesystem-adverse-event-outcome.html\">http://hl7.org/fhir/R4/codesystem-adverse-event-outcome.html</a>  instead because it is a valid URL that doesn't give a 404 error?</p>\n</li>\n<li>\n<p>Why doesn't <a href=\"https://terminology.hl7.org/codesystems.html\">https://terminology.hl7.org/codesystems.html</a>  have a link for the adverse-event-outcome codesystem?  Does this mean that <a href=\"http://terminology.hl7.org/CodeSystem/adverse-event-outcome\">http://terminology.hl7.org/CodeSystem/adverse-event-outcome</a> is not approved?</p>\n</li>\n</ol>",
        "id": 261392898,
        "sender_full_name": "Diane",
        "timestamp": 1636856291
    },
    {
        "content": "<ol>\n<li>There is no requirement that canonical URLs resolve - though the fact this one doesn't is odd.   <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> - any idea what's happening here</li>\n<li>Definitely <em>don't</em> use <a href=\"http://hl7.org/fhir/R4/codesystem-adverse-event-outcome.html\">http://hl7.org/fhir/R4/codesystem-adverse-event-outcome.html</a>.  The web page that describes the code system is NOT typically the canonical URL.</li>\n<li>Not clear what's happening here...</li>\n</ol>",
        "id": 261394809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636859446
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>        So the IG will accept any url?    I could just put something like <a href=\"http://www.google.com\">www.google.com</a>?      One of the validators we tried over the summer didn't like external urls.    Presumably,   <a href=\"http://www.google.com\">www.google.com</a>   would not pass the IG voting requirements, though?</p>\n<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>     Ted...When you get a chance, can you comment on my questions #1  and #3?     Also,  the concepts (but not the codes themselves)  in <a href=\"http://terminology.hl7.org/CodeSystem/adverse-event-outcome\">http://terminology.hl7.org/CodeSystem/adverse-event-outcome</a>     are very similar to those in <a href=\"https://terminology.hl7.org/CodeSystem-v2-0241.html\">https://terminology.hl7.org/CodeSystem-v2-0241.html</a>   for Patient Outcomes.   Is there any overall attempt to be sure that multiple parallel code systems are not published?</p>",
        "id": 261587607,
        "sender_full_name": "Diane",
        "timestamp": 1637027124
    },
    {
        "content": "<p>The requirement is that the URL be the official URL for the code system.  If you're making up your own, it should be in the IG's canonical space.  If it's external and you expect other implementations will also be using the code system, you should be submitting a request to the HTA to register an official URL (which they'll do after discussion with the terminology source if they can) that everyone using FHIR will be required to use.  One of the criteria for the URLs is \"it's nice if they resolve to something useful to an end user\".  But that's a nice-to-have.  And there are lots of reasons why sometimes they don't.</p>\n<p>In terms of avoiding having HL7 create multiple code systems that say things that are similar, in theory the UTG process can help with that.  In practice, not so much.  Quite often the v2 terminologies don't necessarily follow 'good terminology practices' so there's a deliberate decision to create something new.  Other times, it happens by accident and because review is done by volunteers who happen to have the time to bother, in practice stuff gets missed.  Good quality review requires time by knowledgeable people whose time tends to be scarce.  It's a problem we haven't figured out a good solution to :(</p>",
        "id": 261590793,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637030197
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"237340\">@Diane</span> upon examination, it would appear that when the subset of FHIR R4 CodeSystems had their canonical URL changed to be anchored in THO (<a href=\"http://terminology.hl7.org\">http://terminology.hl7.org</a>) and their source moved to THO, this one was changed but never moved (the move was a manual operation, and it must have just been missed is my surmise).   Sorry this happened, but happy you found it (no one else has reported this in all this time, ugh).   I will get this object migrated into THO asap.    It is absolutely supposed to be there and this is simply a technical error in the content which must be addressed.   <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> any issues with moving it into THO?  This is pro-forma, does not need any kind of consensus review...what other element value mapping might need to occur besides the &lt;version&gt; element?     And for everyone reading this thread,  I want to call attention to the last paragraph of Lloyd's comment above; we are suffering many pains due to this particular problem.</p>",
        "id": 261591471,
        "sender_full_name": "Ted Klein",
        "timestamp": 1637030924
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>     Thank you for the explanation of the URL and its usage in the event of an external code system.</p>",
        "id": 261774567,
        "sender_full_name": "Diane",
        "timestamp": 1637150378
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>   Thank you for finding the answers about this code system and working to get it migrated into THO.  There is so much for volunteers to manage that I am sure that minor glitches can occur.</p>",
        "id": 261774935,
        "sender_full_name": "Diane",
        "timestamp": 1637150591
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> in principle I'd generally agree but in fact, this code system is already dropped in favor of SCT. <span class=\"user-mention\" data-user-id=\"197447\">@Diana_Ovelgoenne</span> see here: <a href=\"https://build.fhir.org/valueset-adverse-event-outcome.html\">https://build.fhir.org/valueset-adverse-event-outcome.html</a> - I recommend you follow this approach.</p>",
        "id": 261875828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637199361
    },
    {
        "content": "<p>Will discuss with the BR&amp;R team.   Meanwhile,  I have two questions, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>   and <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> </p>\n<ol>\n<li>\n<p>Our questionnaires are R4 but this code system that you are suggesting is R5.   Will this cause problems with our IG publishing?  We have already balloted and the code system for the Adverse Event questionnaire is what is holding up final publishing.    </p>\n</li>\n<li>\n<p>The defining URL on the page <a href=\"https://build.fhir.org/valueset-adverse-event-outcome.html\">https://build.fhir.org/valueset-adverse-event-outcome.html</a>   is  pointing to   <a href=\"http://hl7.org/fhir/ValueSet/adverse-event-outcome\">http://hl7.org/fhir/ValueSet/adverse-event-outcome</a>.    If you look at the codes at  <a href=\"http://hl7.org/fhir/ValueSet/adverse-event-outcome\">http://hl7.org/fhir/ValueSet/adverse-event-outcome</a>,  you will see that they are the old (ICSR)   codes  and not the SCT codes.   What is the defining URL for the new SCT codes supposed to be?</p>\n</li>\n</ol>",
        "id": 261885579,
        "sender_full_name": "Diane",
        "timestamp": 1637210286
    },
    {
        "content": "<p>given the situation - that arises because AdverseReaction is still early in the development cycle - I'd clone the R5 value set into your IG</p>",
        "id": 261885794,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637210574
    },
    {
        "content": "<p>So since the R5 value set is anchored in <a href=\"http://hl7.org/fhir\">hl7.org/fhir</a> and the code system is SCT, THO is not involved.    That having been said, since the R4 value set has the old code system in the logical definition anchored in THO, should we add the R4 code system to the THO ci build with a &lt;status&gt; of 'retired' so it gets into the THO 3.0.0 release so folks can see it, and also see the retirement comment that it has been retired because the value sets no longer use it?    If not (as this seems like just 'busy work') how do folks that may run into this problem not again waste time getting all this disconnection sorted?    Personally, IMHO, all the stuff that was published in R4 that is anchored in <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> should be visible there; the &lt;status&gt; and commtents about deprecation should clarify if not longer straightforwardly active,</p>",
        "id": 261958044,
        "sender_full_name": "Ted Klein",
        "timestamp": 1637255326
    },
    {
        "content": "<p>or is this sufficiently handled with your URL redirect that references the R4 code system page when the system is clicked on from the logical definition of the R4 value set?</p>",
        "id": 261958294,
        "sender_full_name": "Ted Klein",
        "timestamp": 1637255422
    },
    {
        "content": "<p>Note there is no server redirect so the URL direct gives a 404 error...</p>",
        "id": 261958345,
        "sender_full_name": "Ted Klein",
        "timestamp": 1637255444
    },
    {
        "content": "<p>I'm not sure it's worth it, but yes, we could. We just have many other problems to deal with</p>",
        "id": 261970320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637260658
    }
]