[
    {
        "content": "<p>A number of code systems and value sets whose canonical URLs are rooted at <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> have had copies of their content added to the UTG publish and current builld space.   The question has arisen as to whether now is the time - or are we not yet ready - to begin to make changes in these through the UTG maintenance process, or to continue updating them in the FHIR ecosystem as has been done up to now.   The UTG Pilot has started and we expect to have a full membership rollout no later than early July, but some code systems (such as hl7workgroups) have already been undergoing updates in UTG.    What is the sense of the group on this?  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 198886431,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590584347
    },
    {
        "content": "<p>the original intent was that once UTG is up, they'll be removed from FHIR and maintained through UTG.</p>",
        "id": 198886512,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1590584393
    },
    {
        "content": "<p>I don't think that anything has changed with that; the main question is at what stage UTG is considered to be 'up'</p>",
        "id": 198886588,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1590584413
    },
    {
        "content": "<p>Yes exactly.   All about timing.   And part of this is then turning on the process of making sure the correct version of the resources is the one that folks get to mostly.   We have a process now, but it has only just begun.    I would love if someone has some small simple changes to put them through the tug Pilot to help flesh out any issues, I am ready to keep on top of it to address anything that arises.</p>",
        "id": 198886990,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590584585
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196635\">@Jessica Snell</span> and the UTG testing associated with the Pilot Phase should include test cases to ensure we are ready to transition maintanence to UTG. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> when this occurs, if copies will remain in FHIR, we need to add some verbiage pointing users to the UTG process for maintance requests as FHIR will now be showing the \"Convienence Copies\"</p>",
        "id": 198892970,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1590587463
    },
    {
        "content": "<p>The actual rule is that they'll be removed from FHIR once any of the resources that use them hit FMM3+.  However, I'm in favor of all of the code systems for those that <em>aren't</em> yet FMM3+being flagged as 'temporary' so it's clear those codes will have to move.  (We don't actually want to start sticking stuff in UTG when the community doesn't have enough implementation experience to be confident about what the terminology should actually be...)</p>",
        "id": 198896256,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590588815
    },
    {
        "content": "<p>Could we itemize these codesystems and let the author know? I suspect that I would be impacted but have no idea if that is true or not. I am very confused on what terminology is vs UTG vs HTA vs any other term that vocabulary invents</p>",
        "id": 198919831,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590598268
    },
    {
        "content": "<p>ok.  since the questions was raised relative to one of the ECQM objects, can <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> perhaps be convinced to make the changes to measurePopulationType as part of the Pilot in UTG in the next couple days?   That might help to kill several birds with one stone</p>",
        "id": 199025474,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590674293
    },
    {
        "content": "<p>Things became more complicated on today's Vocabulary WG call.   As of right now, it is my understanding that V2 and V3 and Unified code systems and value sets rooted in UTG (<a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> URLs)  are changed through the UTG process, and any needed in the FHIR Build space must be updated in FHIR from UTG.  Changed objects listed in the FHIR Code Systems and Value Sets tabs on UTG are updated in the FHIR Build space, and any changes done there must be copied into UTG.   Unless this can be handled by the Publisher based on Versions of the Code Systems and Value Set resources.  In a more perfect world :-) folks could update them wherever they need to in the next couple weeks while we are doing the transition and it will come out in the wash.   But we will still need to migrate the more recent changed items rooted in UTG to there from FHIR back to UTG once we declare it officially 'up'.   This needs to be decided and communicated as soon as possible to those that are asking the question.</p>",
        "id": 199091770,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590703271
    },
    {
        "content": "<p>it was my intent to remove anything from <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> from the build, and to use UTG directly</p>",
        "id": 199109280,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1590721198
    },
    {
        "content": "<p>as soon as UTG is the operational naster</p>",
        "id": 199109327,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1590721210
    },
    {
        "content": "<p>so we only need to figure out what the definition characteristics must be to declare it the 'operational master'.</p>",
        "id": 199151481,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590757838
    },
    {
        "content": "<p>in the meantime, is there aa way to know what may have been pushed in the FHIR ecosystem since the UTG snapshot of version 4.2.0 of those code system and value set resources rooted in <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>?</p>",
        "id": 199151613,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590757908
    },
    {
        "content": "<p>From the editor's perspective, what is the process for making changes to terminology that is included in the UTG? I know exactly how to make the changes to code systems included in the FHIR build, is there a similar process associated with UTG content?</p>",
        "id": 199167814,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1590765225
    },
    {
        "content": "<p>I'm happy to make the changes as part of a pilot here, and we have a very simple candidate change that fits nicely, I just need to know where/how to make that change in UTG content.</p>",
        "id": 199167941,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1590765265
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> The UTG process requires creating a forked version of the UTG content, modifying it, putting that change out for viewing via the UTG review process, then when that review process completes, if passed the fork is merged into the source of truth as an update. If you are willing, I'll work with you to be in the pilot. Remind me - what code system are we changing? Have you pushed it out into the build (I assume not?)</p>",
        "id": 199184094,
        "sender_full_name": "Robert McClure",
        "timestamp": 1590772585
    },
    {
        "content": "<p>Yes Rob has it correct, and it is all pretty fully documented on the UTG Confluence pages for the Pilot at <a href=\"https://confluence.hl7.org/display/VOC/Participating+in+UTG+Pilot+Testing\">https://confluence.hl7.org/display/VOC/Participating+in+UTG+Pilot+Testing</a> and <a href=\"https://confluence.hl7.org/display/VOC/UTG+Tooling+and+Proposal+Documentation\">https://confluence.hl7.org/display/VOC/UTG+Tooling+and+Proposal+Documentation</a>.   We have one proposal with changes out for consensus review right now, and I am waiting for the build to complete on the second one which will be passed to consensus review state as soon as the publisher finishes.  Except for a few control buttons on the Jira screens for the workflow which should not be viewed by submitters (permissions settings I am working on the fix for this weekend) it all seems to be working reasonably.  Would really love to have you try it out and let me know what is broken :-)</p>",
        "id": 199215149,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590788069
    },
    {
        "content": "<p>note that the UTG process is only for those code systems and value sets with canonical URLs at <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>, and that are NOT ballot bound (schema bound) ie used in FHIR elements of 'code' datatype (ok for codeable concept)</p>",
        "id": 199215538,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590788346
    },
    {
        "content": "<p>and also PLEASE update the &lt;version&gt; element!</p>",
        "id": 199215600,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590788384
    },
    {
        "content": "<p>We also want to change the name of two code systems that we're managing under our Evidence resource, and add a new code to one of them: <a href=\"https://jira.hl7.org/browse/FHIR-27744\">https://jira.hl7.org/browse/FHIR-27744</a></p>\n<p>What would the UTG process be for making this updates?</p>",
        "id": 199641981,
        "sender_full_name": "Khalid Shahin",
        "timestamp": 1591201508
    },
    {
        "content": "<p>Until your resources hit maturity level 2, you shouldn't be using UTG for your terminologies.  The UTG terminologies have to follow \"good terminology practices\" - so once a code exists, you can't get rid of it, you can't make significant changes to the definitions, refactor the hierarchy, etc.  When we're in the early STU stages, we often aren't completely confident in what the codes should be and need some implementation experience to confirm our terminology needs.  FHIR-specific terminologies should be used at this stage, with a clear expectation set that we'll move to other more 'robust' terminologies (ideally ones maintained outside HL7) once we're more confident in the requirements.</p>",
        "id": 199653939,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591207097
    },
    {
        "content": "<p>Okay, that's good to know, <span class=\"user-mention\" data-user-id=\"220253\">@Khalid Shahin</span> , given the maturity level, I think what I hear Lloyd saying is that we should continue to make those changes in the FHIR build directly.</p>",
        "id": 199659138,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591209550
    },
    {
        "content": "<p>Where do I ask specific questions about this process? Just keep them coming in this thread? <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> ? For example, why are we using bitbucket?</p>",
        "id": 200038863,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591558698
    },
    {
        "content": "<p>Using BitBucket because it integrates more easily w/Jira - but still works with standard Git tooling</p>",
        "id": 200039490,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591559701
    },
    {
        "content": "<p>So I don't _have_ to install SourceTree, yes?</p>",
        "id": 200040031,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591560502
    },
    {
        "content": "<p>From the pilot document: </p>\n<blockquote>\n<p>Sourcetree is required to manage your local vocabulary changes and push those changes back to the branch that you are using to submit your proposal.</p>\n</blockquote>",
        "id": 200040051,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591560569
    },
    {
        "content": "<p>But that could say \"A git client such as SourceTree is required to manage....\"</p>",
        "id": 200040058,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591560594
    },
    {
        "content": "<p>They are trying to keep things as simple and consistent as possible for everyone - particularly those who aren't used to using git.  I have the same inclination to use my current setup and tools (primarily command line) for updates, without dealing with SourceTree, but I haven't finished fully exploring that yet.</p>",
        "id": 200040257,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1591560893
    },
    {
        "content": "<p>Yes, that's fine to document with Sourcetree, but I'd really prefer not to have to install another git client :)</p>",
        "id": 200040742,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591561657
    },
    {
        "content": "<p>Exactly right.   We have an awful lot of folks who cannot spell 'git', and we need to give step by step exact directions.     Basically what the Jira automation does is create a UTG Bitbucket branch for your proposal making sure it does a Pull for the latest current build so you always work again st 'current', and you play with it however you like.  The 'Submit' of a proposal causes a validation of content and a replication of the branch in the UTG Git, which is a highly protected environment, and forces a build of the branch.   The URL to the branch is then inserted into the proposal so that reviewers see the proposed changes in context, browsing just like the main site.  I myself only really use the SourceTree tooling to debug the workflow and script operations;  I normally use my git CLI in my unix environment.    It is all about what makes you most comfortable.  Note that some content changes are done by the scripting after Submit to modify the Bitbucket and Git branches (labeling in the IG control file mainly) for Consensus Review, then we are working on automating the generation of the Provenance bundle for history tracking which gets added after a proposal is Approved and gets implemented into the source of truth.   If you are sued to doing IG builds that is wonderful, as most of the error valuation is making sure the changes build without errors - most of our submitters are not ready to or capable of doing a local IG build with their changes.  If you are good with that, I need to give you some additional parameters for the java command to do the build, since without them the UTG build usually segfaults.</p>",
        "id": 200041544,
        "sender_full_name": "Ted Klein",
        "timestamp": 1591562853
    },
    {
        "content": "<p>Yes, I’m used to doing local ig builds</p>",
        "id": 200051676,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591579982
    },
    {
        "content": "<p>Trying to get the terminology server started and connected from the FHIR Toolkit, the server is running locally as expected, but the FHIR Toolkit cannot connect to it because it has an unknown value in the fhirVersion list:</p>",
        "id": 200116995,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591631182
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/WBrzhzbwsJeE476fi1Br-REB/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/WBrzhzbwsJeE476fi1Br-REB/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/WBrzhzbwsJeE476fi1Br-REB/image.png\"></a></div>",
        "id": 200117003,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591631186
    },
    {
        "content": "<p>So I'm trying to characterize the change I'm actually making, it is a clarification to the definition of two existing concepts in a code system. Looking at the (not yet approved) code system versioning policies <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=66938361\">here</a>, would that be a patch version change, since it is a clarification?</p>",
        "id": 200131759,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591637992
    },
    {
        "content": "<p>which terminology server?</p>",
        "id": 200140071,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591642042
    },
    {
        "content": "<p>The local one that I installed as part of this pilot, downloaded from <a href=\"http://www.healthintersections.com.au/FhirServer/vocabpoc-install-0.0.6.exe\">http://www.healthintersections.com.au/FhirServer/vocabpoc-install-0.0.6.exe</a></p>",
        "id": 200142719,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591643323
    },
    {
        "content": "<p>hmm. I'll have to do something about that</p>",
        "id": 200145958,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591645163
    },
    {
        "content": "<p>Just reporting it as an issue, it's not stopping me at this point</p>",
        "id": 200148644,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591646465
    },
    {
        "content": "<p>Should I log an issue somewhere?</p>",
        "id": 200148660,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591646474
    },
    {
        "content": "<p>here, I guess: <a href=\"https://github.com/grahamegrieve/fhirserver/issues\">https://github.com/grahamegrieve/fhirserver/issues</a></p>",
        "id": 200150205,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591647205
    },
    {
        "content": "<p>I note that the CodeSystem resources in the sourceOfTruth include generated narrative. Will that narrative be refreshed by the tooling, or does my change proposal need to include the change reflected in the narrative?</p>",
        "id": 200834061,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592169563
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> source of truth should not include narrative</p>",
        "id": 200840639,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592181004
    },
    {
        "content": "<p>Not sure what you mean.   I think when the FHIR code system resources were inported they were pulled in by Dave T fro the FHIR pages generated maybe not from the package?  Not sure.    I think all the FHIR ones look like this, no idea what needs to be done to fix. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  please advise</p>",
        "id": 200842750,
        "sender_full_name": "Ted Klein",
        "timestamp": 1592185183
    },
    {
        "content": "<p>Given that such narrative should have <code>status=generated</code>, does it matter that it's present?</p>",
        "id": 200842943,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1592185555
    },
    {
        "content": "<p>process problem. We should delete all of them</p>",
        "id": 200843228,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592186147
    }
]