[
    {
        "content": "<p>I need to represent Medi-Span's dispensable drug id (DDID). Is there a recommended URL? Should <a href=\"https://www.wolterskluwercdi.com/\" target=\"_blank\" title=\"https://www.wolterskluwercdi.com/\">https://www.wolterskluwercdi.com/</a> be used? Are there additional steps that need to be taken besides including this in the capability statement?</p>\n<p>Note: Topic was moved from #implements to this stream. <a href=\"#narrow/stream/179166-implementers/topic/CodeSystem.20for.20Medi-Span\" title=\"#narrow/stream/179166-implementers/topic/CodeSystem.20for.20Medi-Span\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/CodeSystem.20for.20Medi-Span</a></p>",
        "id": 173054585,
        "sender_full_name": "Mona O",
        "timestamp": 1565639839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Thank you very much for your response to my question. I was wondering if you had any updates or guidance you could provide from the previous discussions with Wolter Kluwers? Your assistance and movement of this item is greatly appreciated!</p>",
        "id": 173055609,
        "sender_full_name": "Mona O",
        "timestamp": 1565640597
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> Not sure what answer  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> provided but this is something the <a href=\"mailto:termauth@lists.hl7.org\" target=\"_blank\" title=\"mailto:termauth@lists.hl7.org\">HTA </a> is responsible for answering unless WKH has already explicitly defined it. And if they have, it needs to be on the <a href=\"https://www.hl7.org/fhir/terminologies-systems.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/terminologies-systems.html\">Code Systems</a> page and I don't see it there. If this is still needed, please send a request to that email to move the process along.</p>",
        "id": 173235072,
        "sender_full_name": "Robert McClure",
        "timestamp": 1565811603
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> I found the emails from 2017 that Grahame referred to on the other thread, and this is what I have from Medispan at that time (2017-01-20) regarding DDID:</p>\n<blockquote>\n<p>DDID - Clinical Drug Information, LLC  <br>\nSource      The Dispensable Drug Identifier (DDID) is made available by Clinical Drug Information, LLC at <a href=\"http://docs.wolterskluwercdi.com/codesystems/DDID\" target=\"_blank\" title=\"http://docs.wolterskluwercdi.com/codesystems/DDID\">docs.wolterskluwercdi.com/codesystems/DDID</a> <br>\nSystem              <a href=\"http://docs.wolterskluwercdi.com/codesystems/DDID\" target=\"_blank\" title=\"http://docs.wolterskluwercdi.com/codesystems/DDID\">docs.wolterskluwercdi.com/codesystems/DDID</a> <br>\nVersion             N/A<br>\nCode            The code is an identifier for a Dispensable drug.<br>\nDisplay             The correct display for a DDID is the Dispensable Drug’s name for it associated with the source DDID. <br>\nFilter Properties         None are described yet.<br>\nVersion Issues  <br>\nClinical Drug Information, LLC releases updates to DDID on a regular basis. Each release is identified by the issue date.<br>\nCopyright/License Issues <br>\nDDID is property of Clinical Drug Information, LLC and its affiliates and/or licensors.  All rights reserved. DDID may only be used by licensed customers. </p>\n</blockquote>\n<p>I will note that the url is not resolvable presently (gives a \"Not Found\" response).  I don't know whether it was resolvable previously or not (I don't recall that I checked at the time).  But, even though it's not resolvable now, that isn't required, and this is the url that Wolters Kluwer provided for use in FHIR and (unless there's something else that I'm not aware of) it should remain as the canonical identifier for DDID that we continue to use. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span></p>",
        "id": 173236711,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565812881
    },
    {
        "content": "<p>As we discussed with WK in 2017, adding the system urls to the Code Systems page in the FHIR spec isn't necessarily a given, but it could be useful (in the CI build - I think it's unlikely that we would want to or be able to update it for R4), and that's something we can further consider.</p>",
        "id": 173237672,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565813526
    },
    {
        "content": "<p>not a technical correction for R4, but we can add it in the CI build for R5. We should ask WK to make the URL resolve, but yes, it's not mandatory</p>",
        "id": 173240564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565815448
    },
    {
        "content": "<p>We certainly should confirm with WKH since now is the time to improve it if they want to.</p>",
        "id": 173243372,
        "sender_full_name": "Robert McClure",
        "timestamp": 1565817392
    },
    {
        "content": "<p>I have no problem with that in this case.  But I'm not sure whose task it is to do that?  HTA?  Or the requester?  Or Vocab WG?  Or ??  And do we do that (and how frequently do we do it) for all of the external code systems?  And in the meantime while we're waiting for that to be done in this case for Medispan DDID, I'm assuming that \"<a href=\"http://docs.wolterskluwercdi.com/codesystems/DDID\" target=\"_blank\" title=\"http://docs.wolterskluwercdi.com/codesystems/DDID\">docs.wolterskluwercdi.com/codesystems/DDID</a>\" is the url that can be used for this in FHIR now since WK already has provided it for that purpose (and GE, who I believe was the original requester, presumably is using it)?</p>",
        "id": 173245060,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565818915
    },
    {
        "content": "<p>And a bit more explicitly, once we've assigned a canonical identifier for a code system in FHIR, we normally don't expect it to change, even if the code system publisher changes, etc.  So I'm not sure how much work (if any) we expect to do for \"maintenance\" following the initial verification (unless we might receive a further request to do something)?</p>",
        "id": 173245438,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565819242
    },
    {
        "content": "<p>vocab has approved these in the past. wrt HTA, we have referred requests for new codes to them. We have changed one system URL snce we started, I think, one of the genomics ones. Typically, maintenance consists of clarifying things like what are valid displays, filters etc</p>",
        "id": 173245799,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565819535
    },
    {
        "content": "<p>and how versioning works</p>",
        "id": 173245800,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565819539
    },
    {
        "content": "<p>when I mentioned \"maintenance\" I was still referring to the canonical url itself - agree with Grahame about the rest</p>",
        "id": 173246018,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565819757
    },
    {
        "content": "<p>This is an HTA task</p>",
        "id": 173264358,
        "sender_full_name": "Robert McClure",
        "timestamp": 1565842541
    },
    {
        "content": "<p>why? it hasn't been before.</p>",
        "id": 173264364,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565842555
    },
    {
        "content": "<p>HTA is responsible for managing tasks regarding external terminology authorities. They are also responsible for defining policies for this, to be approved by TSC</p>",
        "id": 173264414,
        "sender_full_name": "Robert McClure",
        "timestamp": 1565842610
    },
    {
        "content": "<p>That includes managing the canonical uri. I'll agree this is something they didn't know was on their task list but it's theirs per the TSC</p>",
        "id": 173264474,
        "sender_full_name": "Robert McClure",
        "timestamp": 1565842689
    },
    {
        "content": "<p>well, to speak frankly, HTA has been a place where things go to not get done in the past. If HTA gets it done, then that's fine by me. We just need to respond in a timely fashion on these things.</p>\n<p>Of course, I'm saying this in a case where we didn't respond at all in a timely fashion :-(. But these things are hard to do - they require consistent pushing to get done</p>",
        "id": 173264520,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565842796
    },
    {
        "content": "<p>I don't think it is an HTA task in the case we're discussing for Medispan, at least at this point (maybe the initial discussion with them could have gone through HTA) - but the urls came from Wolters Kluwer</p>",
        "id": 173264630,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565842931
    },
    {
        "content": "<p>if HTA wants to try to verify it again with them now, as I mentioned, that should be fine</p>",
        "id": 173264705,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565843079
    },
    {
        "content": "<p>HTA is who should manage the process but <strong>you</strong> can do the work with them to make sure it gets done quickly. Just make sure you take the process through them.</p>",
        "id": 173265178,
        "sender_full_name": "Robert McClure",
        "timestamp": 1565843946
    },
    {
        "content": "<blockquote>\n<p>take the process through them</p>\n</blockquote>\n<p>I don't know what that means then. There's no way to route a gForge task to HTA. There's no documentation anywhere that I can find about how to submit this to HTA for consideration</p>",
        "id": 173265405,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565844369
    },
    {
        "content": "<p>in regard to the Medispan urls, and following on from my questions above, it's not clear to me that it's necessary to do anything at all for this at present other than hopefully publish the urls somewhere where implementers can find them (e.g. the terminologies-systems page in the CI build)<br>\nif HTA wants to do more to re-verify these urls with WK then that's fine, but I'm not thinking at the moment of doing more with it myself</p>",
        "id": 173265426,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565844462
    },
    {
        "content": "<p>WRT Medispan urls, I'd agree given that you are reporting they have already defined what they want. Yes, HTA should confirm. <br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Yes, the process is undefined because HTA was not aware they should be doing this until recently and the've not gotten the process clarified. Just because the horse desperately wants out of the barn, please don't decide all you cart-pullers should run out ahead ;-) Instead, please help HTA formulate what is needed so they can take on the task.</p>",
        "id": 173495189,
        "sender_full_name": "Robert McClure",
        "timestamp": 1566149642
    },
    {
        "content": "<p>As I understand it, and please correct me if I'm wrong, a canonical URL,  in order to be \"canonical\" and act as \" a single, authoritative URL\" really can only be provided by the code system owner.   However, we understand that not all code system owners are going to be responsive to this need.  Hence HTA is going to develop the \"graceful degredation\" policy for URLs.  In this instance, since this happens to be my area of expertise, has anyone considered that DDID is not necessarily a code system but a value set derived from the entire Medispan knowledgebase offering?</p>",
        "id": 173558177,
        "sender_full_name": "Julie James",
        "timestamp": 1566232652
    },
    {
        "content": "<p>no, I haven't, but i could believe that that is the case</p>",
        "id": 173567793,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566239954
    },
    {
        "content": "<p>Although a NamingSystem would allow someone to create a canonical url that referred to that CodeSystem wouldn't it?</p>",
        "id": 173570290,
        "sender_full_name": "David Hay",
        "timestamp": 1566241797
    },
    {
        "content": "<p>it would allow us to define it</p>",
        "id": 173571670,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566242901
    },
    {
        "content": "<p>we should consider the code system vs. value set issue for this, as Julie says - but if MediSpan has already declared it to be that way (whether they actually needed to or not), then we may want to continue to treat it as such<br>\nalternatively, we could go back to them and explain how (and why) they could do it differently - and HTA could take that on (but I think we wouldn't want to wait too long to get it done)</p>",
        "id": 173579935,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1566249201
    },
    {
        "content": "<p>I am always concerned that these kinds of code system owners do not fully appreciate the difference between a CodeSystem and a ValueSet</p>",
        "id": 173624347,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1566269008
    },
    {
        "content": "<p>that wouldn't make them unusual</p>",
        "id": 173632949,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566283215
    }
]