[
    {
        "content": "<p>I'm trying to create some CodeSystem supplements to add some properties to certain SNOMED concepts. So far, I don't seem to be able to get this to work (using OntoServer)</p>\n<p>So a few questions:</p>\n<ul>\n<li>Should CodeSystem supplement work with SNOMED ?</li>\n<li>Would the CodeSystem to supplement be \"<a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>\", or would it need a full canonical URL (including version)?</li>\n<li>If yes to the above, what does that look like for SNOMED?</li>\n</ul>\n<p>thanks</p>",
        "id": 204924844,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595602114
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> Thoughts? <br>\nInteresting question regarding what to put into the version identifier. I'm not sure... WRT, the canonical url I would think that it would be the standard SCT url. This once again highlights that for terminology artifacts the canonical url is not sufficient to identify the artifact. For code systems it seems you need to look at version <strong>and</strong> codesystem.content to understand what you are looking at. And even then, how can you tell the various supplements from each other based on elements you can reliably find? <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 204952046,
        "sender_full_name": "Robert McClure",
        "timestamp": 1595616142
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I don't understand your comments.</p>",
        "id": 204963782,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595623096
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> </p>\n<ul>\n<li>in principle a  code system supplement should work with SNOMED but it's up to the system whether it supports that. <a href=\"http://tx.fhir.org\">tx.fhir.org</a> doesn't - I don't (yet?) allow supplements for code systems not defined using a code system resource</li>\n<li>the codesystem to supplement is a canonical URL. So the URL is <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>. </li>\n<li>if you want a version specific supplement, then you'd use the canonical URL version form: <a href=\"http://snomed.info/sct|[ver]\">http://snomed.info/sct|[ver]</a> where [ver] is a full URL of an edition or an edition/version, as specified in the snomed page</li>\n</ul>\n<p>so:</p>\n<div class=\"codehilite\"><pre><span></span><code> <span class=\"s2\">&quot;supplements&quot;</span> <span class=\"err\">:</span> <span class=\"s2\">&quot;http://snomed.info/sct|http://snomed.info/sct/999000021000000109/version/20200731&quot;</span><span class=\"err\">,</span>\n</code></pre></div>",
        "id": 204964337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595623372
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I'll see what the CSIRO folk have to say next week. I tried various options on CodeSystem.supplements including the options you suggested. So either I'm doing something wrong (possible <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> ) or OntoServer does not support this for SNOMED.</p>",
        "id": 204969714,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595626731
    },
    {
        "content": "<p>probably the second. Part of my rationale for not supporting it is that I expect snomed supplements to be distributed in RF2. (not that I support that either right now <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span>). But it's certainly not wrong to do what you're trying to do</p>",
        "id": 204969817,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595626823
    },
    {
        "content": "<p>Ontoserver 6 does support supplements (even for SNOMED and LOINC), but currently requires you to specify the version, as per the syntax Grahame shows above.</p>",
        "id": 204971730,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595628483
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  clearly I am doing something wrong then.</p>",
        "id": 204972223,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595628907
    },
    {
        "content": "<p>Great news that it supports it though.</p>",
        "id": 204972355,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595629016
    },
    {
        "content": "<p>You also need to use <a href=\"https://www.hl7.org/fhir/extension-valueset-supplement.html\">https://www.hl7.org/fhir/extension-valueset-supplement.html</a> in your ValueSet so that Ontoserver knows that it should use the supplement</p>",
        "id": 204972465,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595629111
    },
    {
        "content": "<p>you should be able to also ask for that in the expansion/validation parameters, and languages should be picked up automatically if you specify the right language</p>",
        "id": 204972499,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595629170
    },
    {
        "content": "<p>What is the parameter to <code>$expand</code> for this?</p>",
        "id": 204972655,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595629317
    },
    {
        "content": "<p>So a general question re the supplements then. I have a need to add some properties to various SNOMED concepts. TO do this I am doing the following</p>\n<ul>\n<li>Create several VS with ECL expressions</li>\n<li>Expanding each VS to get the concepts</li>\n<li>For each expanded VS then create a CodeSystem supplement, listing each concept code from the previous step</li>\n</ul>\n<p>It seems slightly long-winded but as you cant use ECL in the definition of the supplement I'm not seeing a quicker way</p>",
        "id": 204972697,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595629328
    },
    {
        "content": "<p>I don't think we've defined one yet</p>",
        "id": 204972703,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595629335
    },
    {
        "content": "<p>Are you trying to add a property(ies) to each concept that matches some ECL?<br>\nSupplements really are just a static list if concepts with their additional properties / designations; there's no mechanism to do \"rule-based\" things</p>",
        "id": 204972852,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595629470
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191343\">Michael Lawley</span> <a href=\"#narrow/stream/179202-terminology/topic/CodeSystem.20Supplements.20with.20SNOMED/near/204972465\">said</a>:</p>\n<blockquote>\n<p>You also need to use <a href=\"https://www.hl7.org/fhir/extension-valueset-supplement.html\">https://www.hl7.org/fhir/extension-valueset-supplement.html</a> in your ValueSet so that Ontoserver knows that it should use the supplement</p>\n</blockquote>\n<p>Ah - that's thrown me. I clearly misunderstand how the supplements are designed to work. I thought that if I created a supplement that added a property, then did a codesystem $lookup on the concept I would see the property.</p>",
        "id": 204972863,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595629489
    },
    {
        "content": "<p>I think that's true, yes</p>",
        "id": 204972881,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595629514
    },
    {
        "content": "<p>The problem with that is then every supplement would compete/combine with every other supplement</p>",
        "id": 204972941,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595629570
    },
    {
        "content": "<p>why is that a problem?</p>",
        "id": 204973004,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595629661
    },
    {
        "content": "<p>for $lookup specifically?</p>",
        "id": 204973007,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595629670
    },
    {
        "content": "<p>probably not so bad for $lookup, but you would probably also want to know which properties came from which supplements, and I can see it sewing confusion when $lookup says something about a property but then a ValueSet doesn't match because the appropriate supplement isn't in scope.</p>",
        "id": 204973189,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595629824
    },
    {
        "content": "<p>agree that the supplement source of a property should be clear</p>",
        "id": 204973207,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595629852
    },
    {
        "content": "<p>Until there's more experience with using them, requirements, use cases, etc we've gone for a (conservative) approach of requiring an explicit signal to bring a supplement into scope.</p>",
        "id": 204973421,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595630085
    },
    {
        "content": "<p>An individual CodeSystem resource can only have one Content Mode. My questions is that if a $lookup request is made in relation to a resource whose Content Mode is 'supplement' what properties should be available - just the supplementary ones, or the default properties for other Content Modes as well?</p>",
        "id": 204973633,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1595630311
    },
    {
        "content": "<p>what's the explicit signal for a look up? (that's why it should be automatic for that operation - unlike value set operations)</p>",
        "id": 204973830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595630533
    },
    {
        "content": "<p>we haven't talked about what it means to do a look up against the supplement itself</p>",
        "id": 204973846,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595630555
    },
    {
        "content": "<p>You're not allowed to use the supplement's URI as the value for system, and instance-based <code>$lookup</code> is not defined, so I don't think you can legally do a lookup agains a supplement directly</p>",
        "id": 204973850,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595630561
    },
    {
        "content": "<p>There is no explicit signal for $lookup, but if we had a parameter for $expand to indicate the supplements to use, then we could also use that for $lookup</p>",
        "id": 204973961,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595630678
    },
    {
        "content": "<p>Well that's scuppered my plans <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span>  <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  perhaps I could drop you a note next week to say what we are trying to achieve and you can let us know whether OntoServer can do it. If not time to rustle up a plan B..</p>",
        "id": 204974207,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1595630931
    },
    {
        "content": "<p>absolutely</p>",
        "id": 204974236,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595630960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> My point aligns with the questions you all noted below: How can you tell supplements from each other? What is the unique element that allows you to say \"use this supplement\"? In part because I assumed that you would need to specify when a supplement is to be used for an expansion, and for a lookup. So you'd need to identify the specific supplement when asking to do anything with the code system - expansion, lookup, etc. I think assuming that a TS would always use every available supplement (how about fragments?) with every use of a code system would be very confusing to receivers.</p>",
        "id": 205014106,
        "sender_full_name": "Robert McClure",
        "timestamp": 1595699753
    },
    {
        "content": "<p>Supplements have a unique URI, so that (or the canonical including version) can be used to identify them.<br>\nFor us, it is the use of <a href=\"http://hl7.org/fhir/StructureDefinition/valueset-supplement\">http://hl7.org/fhir/StructureDefinition/valueset-supplement</a> that allows them to be brought into scope, but this means that the operation requires a ValueSet, so pure CodeSystem operations are not able to make use of supplement content.</p>",
        "id": 205073527,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595809627
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> &amp; <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Big head-slap for me as I forgot the specifics noted in the <a href=\"https://www.hl7.org/fhir/codesystem.html#supplements\">supplement spec</a>. Now that I'm back on the bus, seems we need to allow all code system uses and operations to incorporate specified supplements. Perhaps this means that we can declare \"a version\" of the code system that includes specific supplements and then refer to that versioned code system for use \"in all things.\" I understand that is not how the value set extension was envisioned, but perhaps we could consider a more global use of cs supplements.  Is there any sense to this? If not, how do we more globally make use of cs supplements?</p>",
        "id": 205244215,
        "sender_full_name": "Robert McClure",
        "timestamp": 1595947358
    },
    {
        "content": "<p>well, I'm not sure. Here's where I think we are:</p>\n<ul>\n<li>language specific code system supplements - actually, displays defined in supplements for different languages - are automatically in scope of the appropriate language is requested</li>\n<li>for value set operations ($expand, $validate-code) properties defined in supplements are only in scope if the value set says that they are</li>\n</ul>\n<p>What we haven't agreed to:</p>\n<ul>\n<li>what happens for code system operations ($lookup, $validate-code, $subsumes)</li>\n<li>what happens for the concept map operation $translate</li>\n</ul>",
        "id": 205297174,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595974555
    },
    {
        "content": "<p>I think that a linear extrapolation of previous committee deliberations would be:</p>\n<p>$validate-code: displays from supplements are automatically in scope based on the language of  context. properties from supplements are only in scope if they are explicitly referenced (I think that properties are only relevant for the evalution of the <code>abstract</code> parameter)</p>\n<p>$subsumes: properties for supplements are only relevant when supplements are explicitly referenced. (Actually, I think we haven't discussed whether supplements can define is-a / parent / child relationships; I think they should be able to to, but I can see that being controversial since you could certainly do some bad things doing that, as well as doing good things)</p>\n<p>$translate: given the looseness of this operation, we should allow server discretion for whether to consider supplements. This certainly matters since a key use of supplements is to serve the $translate operation</p>\n<p>$lookup: I don't come to clear answer by extrapolating on this one. I think that it would be one of:</p>\n<ul>\n<li>properties and displays from supplements are only includes if they are explicitly referenced </li>\n<li>properties and displays from supplements are automatically included by clearly labelled with their supplement source </li>\n</ul>\n<p>I prefer the second approach, on this one</p>",
        "id": 205297736,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595974923
    },
    {
        "content": "<p>I'm open to the idea that we could define a 'version' but I suspect it makes a mess of how versions work?</p>",
        "id": 205297775,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595974969
    },
    {
        "content": "<p>I think I'm generally in agreement.  Can you restate (or revise) the second bullet for $lookup (it's not particularly clear as is)?</p>\n<blockquote>\n<p>properties and displays from supplements are automatically included by clearly labelled with their supplement source</p>\n</blockquote>\n<p>Maybe this is also something we should have some discussion on during the Tracker call on Thursday this week so we can get something ready for voting on the Main call.</p>",
        "id": 205299851,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595976408
    },
    {
        "content": "<blockquote>\n<p>$translate: given the looseness of this operation, we should allow server discretion for whether to consider supplements. This certainly matters since a key use of supplements is to serve the $translate operation</p>\n</blockquote>\n<p>Can you elaborate?  <code>$translate</code> is basically a table lookup operation so I don't quite follow how supplements are relevant.</p>",
        "id": 205301026,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595977349
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> </p>\n<blockquote>\n<p>properties and displays from supplements are automatically included and clearly labelled with their supplement source using a sub-property</p>\n</blockquote>",
        "id": 205304060,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595979929
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> </p>\n<p>I supplement may define properties with type Coding, which are effectively translations to other code systems, and a server could choose to include these in scope when it does the $translate operation</p>",
        "id": 205304127,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595979980
    },
    {
        "content": "<p>the base code system can do this too</p>",
        "id": 205304131,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595979987
    },
    {
        "content": "<blockquote>\n<p>$translate is basically a table lookup </p>\n</blockquote>\n<p>I don't think that is true based on the definition in the specification</p>",
        "id": 205304147,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595980020
    },
    {
        "content": "<p>What CodeSystem properties define implicit maps?</p>",
        "id": 205311835,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595989171
    },
    {
        "content": "<blockquote>\n<p>table lookup<br>\ndepends gives you a multi-valued key for the lookup, unmapped is the complexity (where you need to look at the internal group-structure of the map).  What parts of the spec are you considering?</p>\n</blockquote>",
        "id": 205311971,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1595989319
    },
    {
        "content": "<p>There's no standard code system properties that define maps, but properties of code systems frequently do define maps. That's why. for $translate, we don't say how it's done or mandate it, but we don't prohibit it</p>",
        "id": 205314253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595992222
    },
    {
        "content": "<p>What parts of the spec are you considering?</p>\n<blockquote>\n<p>Translate a code from one value set to another, based on the existing value set and concept maps resources, and/or <em>other additional knowledge available to the server</em></p>\n</blockquote>",
        "id": 205314270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595992273
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I see through your suggestions you assume the operations can work \"when supplements are explicitly referenced\" and I'm not sufficiently technical to comment on how hard that will be, if all users can determine what they need to reference, and that servers can respond clearly identifying what was used. I'll leave others to comment on this, but for me simply addressing this, I <em>do</em> think we should discuss that a version of the code system could be used to specify what collection of supplements is included. Seems to me this is very similar to what we already do with SNOMED CT. Granted <em>SNOMED</em> manages that complexity, we don't, but perhaps we can support it by crafting an extension that clarifies the dependent supplements. Granted it's new work so only useful if the other approaches you've noted are too hard.</p>",
        "id": 205383572,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596041871
    },
    {
        "content": "<p>Code systems generally won't know about their supplements.  In many cases, they won't even <em>want</em> supplements to exist.  (However they <em>will</em> exist because the code system publisher also won't want to add the properties, relationships and alternate designations desired.)  Supplements should be (and can be) referenced by the value sets that rely on them.  And that's generally the only place they need to be.</p>",
        "id": 205405431,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596052482
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I think that the key difference between what happens with snomed and supplements is that the snomed versioning system applies to fragments of the official snomed space, not to supplements. And I think that makes a real difference</p>",
        "id": 205406632,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596053005
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'm not sure how your comments wrt only value sets use supplements squares with the issues of needing code system operations on supplement content, as noted in the thread above.</p>",
        "id": 205425938,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596065637
    },
    {
        "content": "<p>If you were calling $lookup and wanted properties included from a supplement, you'd have to list the relevant supplements as an argument to the call.  You can't expect the referencing code system to know about any of them.  You could, perhaps, use a shortcut that simply says \"use all supplements associated with the code system that the terminology service is aware of\".</p>",
        "id": 205434603,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596074809
    },
    {
        "content": "<p>there's every reason to expect that the server is aware of them</p>",
        "id": 205436070,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596076405
    },
    {
        "content": "<p>The server can be (though different servers may vary in what they have stored locally).  The Code system won't be aware.</p>",
        "id": 205438703,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596080133
    },
    {
        "content": "<p>For <code>CodeSystem/$lookup</code> we either need to</p>\n<ol>\n<li>add an extra parameter for explicitly mentioning additional supplements to use,</li>\n<li>automatically include all known (to the server) supplements for the code system, or</li>\n<li>relax the restriction on the supplement's URI being used as the system parameter.</li>\n</ol>\n<p>These are not (all) mutually exclusive options.</p>\n<p>In any case, it would be very useful to have a sanctioned, consistent, and clear mechanism for including supplement-sourced properties in the <code>$lookup</code> result so that the client can determine the provenance of the additional values.  This should probably also work for supplemented designations.</p>",
        "id": 205532680,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1596143191
    },
    {
        "content": "<p>do we have a task for that?</p>",
        "id": 205534916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596144589
    },
    {
        "content": "<p>We do now - <a href=\"http://jira.hl7.org/browse/FHIR-28172\">J#28172</a></p>",
        "id": 205535635,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1596145115
    }
]