[
    {
        "content": "<p>Is there a way to indicate a concept display text for use with \"common english\", as in not medical-speak, but normal human.   I don't find a .language that  seems clear as many medical terms display do indicate they are in en-US, but are clearly medical-speak (e.g. \"Axilla\" vs \"Under-Arm\")</p>",
        "id": 198326132,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590070869
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  Some discussion at the tail-end of this thread....https://chat.fhir.org/#narrow/stream/179202-terminology/topic/ValueSet.20.24expand.20questions</p>",
        "id": 198372078,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1590092530
    },
    {
        "content": "<p>I am not getting a good understanding of how this should be done. I get that historically our vocabulary efforts have been for clinicians, but we must recognize that, especially with FHIR, data are being more exposed to patients.  I am not looking for a data representation, but rather a way to provide alias display values in CodeSystem / ValueSet for a human that is not medically trained. (CodeableConcept already has .text that can be used for some of this)</p>",
        "id": 198429748,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590146021
    },
    {
        "content": "<p>Some national editions of SNOMED CT  (e.g. New Zealand) now contain 'patient-friendly' terms. These can be provided in FHIR ValueSets  in response to $expand operation requests (using the includeDesignations and designation parameters). However, a standard way to populate the includDesignations (token) parameter is still a matter of some debate among the Vocabulary WG and the Terminology Server implementers. My Server also returns 'patient-friendly' SNOMED CT terms (where they exist - there are only 170 at present) in response to a CodeSystem $lookup operation request.</p>",
        "id": 198497625,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1590183396
    },
    {
        "content": "<p>so, in those cases. How is the patient-friendly designated?</p>",
        "id": 198501549,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590186077
    },
    {
        "content": "<p>Are you asking how and by whom patient-friendly SCT terms are developed, how a client application might determine when to use them or how they can be identified as such in a response to a FHIR API request?</p>",
        "id": 198503449,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1590187632
    }
]