[
    {
        "content": "<p>I have some questions about conceptMap equivalence values.</p>\n<p>relatedto - \"The concepts are related to each other, and have at least some overlap in meaning, but the exact relationship is not known\": If relationship is not known, why does this require knowledge of \"some overlap\"? Recommend removing that criterion. Requiring overlap prohibits mapping for any purpose other than synonymy (cause &amp; effect, disorder &amp; department, DRG to procedure, etc.)</p>\n<p>equivalent - \"The definitions of the concepts mean the same thing (including when structural implications of meaning are considered) (i.e. extensionally identical).\": If there is a difference between equivalent and equal, it is not clear. 'Structural implications' requires further explanation or illustration of how they affect the mapping use case.</p>\n<p>equal - \"The definitions of the concepts are exactly the same (i.e. only grammatical differences) and structural implications of meaning are identical or irrelevant (i.e. intentionally identical).\" See above.</p>\n<p>wider - \"The target mapping is wider in meaning than the source concept.\":  If there is a difference between wider and subsumes, it is not clear. If the distinction is &gt; vs =&gt;, perhaps the names could reflect this as \"broader\" and \"broaderOrEqual\"</p>\n<p>subsumes - \"The target mapping subsumes the meaning of the source concept (e.g. the source is-a target).\"    See above.</p>\n<p>narrower - \"The target mapping is narrower in meaning than the source concept. The sense in which the mapping is narrower SHALL be described in the comments in this case, and applications should be careful when attempting to use these mappings operationally.\"  See below.</p>\n<p>specializes - \"The target mapping specializes the meaning of the source concept (e.g. the target is-a source).\": If there is a difference between narrower and specializes, it is not clear. If the distinction is &lt; vs &lt;=, perhaps the names could reflect this as \"narrower\" and \"narrowerOrEqual\"</p>\n<p>inexact - \"The target mapping overlaps with the source concept, but both source and target cover additional meaning, or the definitions are imprecise and it is uncertain whether they have the same boundaries to their meaning. The sense in which the mapping is narrower SHALL be described in the comments in this case, and applications should be careful when attempting to use these mappings operationally.\": This sounds like the appropriate home for the secondary sense of relatedTo</p>\n<p>unmatched - \"There is no match for this concept in the destination concept system.\":  Term sounds like \"match not performed\" rather than \"match not found.\" Suggest \"notInTarget\" </p>\n<p>disjoint - \"This is an explicit assertion that there is no mapping between the source and target concept.\" This is self-contradictory, as “disjoint” is itself a mapping. Recommend “that there is no semantic overlap.” </p>\n<p>Also, indentation suggests that ‘disjoint’ is a child of ‘unmatched’: this is incorrect. ‘unmatched’ rows have no target; ‘disjoint’ rows must.</p>",
        "id": 153918516,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1510246345
    },
    {
        "content": "<p>relatedTo: I disagree with removing the requirement for some overlap in meaning. \"cause &amp; effect, disorder &amp; department, DRG to procedure, etc\" - these are all changes to the scope of ConceptMap, and if we made the change (I think it would be good idea) would require additional consideration</p>",
        "id": 153918634,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510262535
    },
    {
        "content": "<p>with regard to equal and equivalent: I think the difference between 'mean the same thing' and 'have identical definitions' is pretty clear.</p>",
        "id": 153918635,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510262591
    },
    {
        "content": "<p>subsumes requires that the relationship between the concepts be is-a as well as the wider. Wider does not require is-a</p>",
        "id": 153918636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510262646
    },
    {
        "content": "<p>I don't mind the change to 'notInTarget' rather than 'unmatched'</p>",
        "id": 153918637,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510262696
    },
    {
        "content": "<p>I think the suggested changes to disjoint definition is good</p>",
        "id": 153918638,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510262718
    },
    {
        "content": "<p>I agree with removing the requirement for overlap for relatedTo.  One of the common relationship pairs we deal with is \"belongsTo / memberOf\" when, for example, grouping codes together into categories.</p>",
        "id": 153921200,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1511401419
    },
    {
        "content": "<p>With regards equal and equivalent, I've had to ask this question more than once, and almost everyone I've tried to explain it to after they've asked me  has not been satisfied. So I think the response of the difference is pretty clear is demonstrably false.  It is not clear.  The closest I get to understanding why the distinction <em>might</em> be important is when it is described in terms of a concrete example.  At the very least I think such an example should be provided as both helpful explanation and motivation for the distinction.</p>",
        "id": 153921205,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1511401649
    },
    {
        "content": "<p>+1 for disjoint</p>",
        "id": 153921206,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1511401681
    },
    {
        "content": "<p>At one point I came up with the following table to try to illustrate the different meanings of the relationships <a href=\"/user_uploads/10155/_sGj8q4Uo21f3AKwI7R7OslD/ConceptMap-equivalence.png\" target=\"_blank\" title=\"ConceptMap-equivalence.png\">ConceptMap-equivalence.png</a><br>\nIt may /may not be accurate or helpful, but feedback appreciated</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/_sGj8q4Uo21f3AKwI7R7OslD/ConceptMap-equivalence.png\" target=\"_blank\" title=\"ConceptMap-equivalence.png\"><img src=\"/user_uploads/10155/_sGj8q4Uo21f3AKwI7R7OslD/ConceptMap-equivalence.png\"></a></div>",
        "id": 153921207,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1511401786
    },
    {
        "content": "<blockquote>\n<p>At one point I came up with the following table to try to illustrate the different meanings of the relationships <a href=\"/user_uploads/10155/_sGj8q4Uo21f3AKwI7R7OslD/ConceptMap-equivalence.png\" target=\"_blank\" title=\"ConceptMap-equivalence.png\">ConceptMap-equivalence.png</a><br>\nIt may /may not be accurate or helpful, but feedback appreciated</p>\n</blockquote>\n<p>Why is there any overlap between the concepts for unmatched?  I appreciate the need to distinguish it from disjoint, so maybe just touching for unmatched. A small point in an otherwise very useful illustration.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/_sGj8q4Uo21f3AKwI7R7OslD/ConceptMap-equivalence.png\" target=\"_blank\" title=\"ConceptMap-equivalence.png\"><img src=\"/user_uploads/10155/_sGj8q4Uo21f3AKwI7R7OslD/ConceptMap-equivalence.png\"></a></div>",
        "id": 153921231,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1511417764
    },
    {
        "content": "<p>1. <a href=\"https://build.fhir.org/conceptmap-example-specimen-type.html\" target=\"_blank\" title=\"https://build.fhir.org/conceptmap-example-specimen-type.html\">Examples</a> show 'unmatched' without targets, confirming Lloyd's point.</p>",
        "id": 153921864,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1511882781
    },
    {
        "content": "<p>2. The bits on the right don't seem Venn-distinct. I thought the diff was between \"&lt;\" and \"&lt;=\" but that's not what I see in the diagram.</p>",
        "id": 153921865,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1511882877
    },
    {
        "content": "<p>3. but an excellent tool for settling things</p>",
        "id": 153921866,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1511882888
    },
    {
        "content": "<p>I wonder if it's too late to create an alias for \"ConcetpMap\"</p>",
        "id": 153921867,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1511882948
    },
    {
        "content": "<p>I agree that unmatched is (or should be) without target.  As we discussed on the Vocab FHIR Tracker Issues call, I agree that the apparent distinction being made in the diagram on the right side between 'wider' and 'subsumes' and 'narrower' and 'specializes' (whether or not they \"touch\" at two points along the edge in the diagram) probably isn't a real or useful distinction to make.  Any further clarification on that, <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>?  I'm not sure what you are thinking about regarding an alias for ConceptMap, <span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span>?</p>",
        "id": 153922026,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1511952642
    },
    {
        "content": "<p>Regarding \"alias\": I mistyped \"ConceptMap.\"</p>\n<p>Regarding the Venn sheet: I had thought I'd seen a distinction between \"broader\" and \"subsumes.\" But, like the equal/equivalent issue, while I see a distinction for value set definitions, I don't see how it applies to value equivalence. I.e., I might have a value set defined as \"things subsumed by hepatitis\" (hep a, hep b, etc.) and I'd have to decide whether the general head concept was a member. But as for the concepts themselves, hep &gt; hep a. Period. What am I missing?</p>\n<p>I'm trying to think of examples where a concept can be defined as including more specific classes but not what they have in common, and all I can come up with is question codes (\"kind of hepatitis\"). Which is different.</p>",
        "id": 153922043,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1511961729
    },
    {
        "content": "<p>My understanding is that broader and narrower allow for the kinds of issues that crop up when mapping between a poly hierarchy like SNOMED and a mono hierarchy classification like ICD 10.</p>",
        "id": 153922164,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1511993819
    },
    {
        "content": "<p>I think that's right, Michael.  But I think how that really works in that case is that what you would have might be more completely described as \"inexact-broader\" and \"inexact-narrower\" (which, if true, should be represented as subtypes of \"inexact\").  In your current diagram I think that \"wider\" is still showing true subsumption and \"narrower\" true specialization (as from the set membership perspective \"touching\" at points along the edges wouldn't invalidate that).</p>",
        "id": 153922320,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1512062932
    },
    {
        "content": "<p>That sounds much better to me; they are special-cases of \"inexact\"</p>",
        "id": 153922461,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1512086511
    },
    {
        "content": "<p>The sentences I'm reading make sense but I'm still not getting a distinction. Examples would be very useful.</p>",
        "id": 153926656,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1513863916
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> Do you have suggestions?  Do you want to add a tracker for it?</p>",
        "id": 153926660,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1513867725
    },
    {
        "content": "<p>Of course: <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14209&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14209&amp;start=0\">14209</a></p>",
        "id": 153926662,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1513867914
    },
    {
        "content": "<p>Suggestions: add examples to demonstrate, e.g., how  Wider &lt;&gt; Subsumes. <br>\n\"Mapping a polyhierarchy to a monohierarchy\": getting there,  but I still need the instance example.</p>",
        "id": 153926663,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1513868124
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14209&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14209&amp;start=0\">Gforge  14209</a>: It feels like the answers to these questions were \"gee, that's complicated; let's not do anything.\" How do we line up act II? Would it be easier if it were 5 more bite-sized suggestions?</p>",
        "id": 153943428,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1520610281
    },
    {
        "content": "<p>E.g., 1 - Either loosen the semantics of the binding or tighten the semantics of the resource.<br>\nrelated to - The definition specifies overlap in meaning. Does this mean that there are no use cases for other kinds of relationships? (E.g., CDC reportable condition mapping table for lab test to inferred condition). The property is called 'equivalence,' but the resource is 'ConceptMap.'  Rename property 'relationship' (&amp; expand binding) or rename resource 'equivalenceMap.'</p>\n<p>2 - provide examples for equivalent &amp; equal</p>\n<p>3 - provide concrete differentation between wider &amp; subsumes, narrower &amp; specializes, with examples, and let the hierarchy reflect the relationships.</p>\n<p>4 - distinguish 'inexact' from 'related to' by removing 'uncertain' from definition of 'inexact' and clarifying that it means that it is known that the relationship is not disjoint and not equivalent.</p>\n<p>5 - decouple hierarchy of unmatched &amp; disjoint - unmatched instances have no target by definition. (There may be two meanings: this map doesn't specify a match but we may not have looked; or we looked and we assert that the target system does not have a match.) Whereas all disjoint instances should have a target for which the disjointness is asserted. This suggests that 'disjoint' is not a specialization of 'unmatched,' for which instances do not have targets. Flatten.</p>",
        "id": 153943431,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1520610832
    },
    {
        "content": "<p>We decided to pull this one from the block vote, so I think we can continue with Act I.  Carmela Couderc requested the pull, and I asked her to help with figuring out what the right pathway forward is for this.  She is planning to add some additional material on it to the tracker.  Any or all of your thoughts above may be helpful.  Do we need to form a small group (maybe the three of us) to work through this?</p>",
        "id": 153943436,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520611555
    },
    {
        "content": "<p>I updated the tracker with some information that will help us move forward.  Forming a small group sounds like a good plan.</p>",
        "id": 153943525,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1520618654
    },
    {
        "content": "<p>Thanks. I think I've said what I know but happy to participate when meetings happen.</p>",
        "id": 153943534,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1520624607
    },
    {
        "content": "<p>Thanks, Carmela.  I've attached the diagram of ConceptMap equivalences from <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>'s post on Nov. 22.</p>",
        "id": 153943535,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520624689
    },
    {
        "content": "<p>#1. I don't understand - I think you haven' said enough about why the definition of relatedTo suddenly becomes the need for a while new renamng</p>\n<p>#2. good to provide examples</p>\n<p>#3. ok to add better doco about the relationship between the difference and the heirarchy meaning</p>\n<p>#4. not sure what the 'secondary meaning' of relatedTo is, but there's a big difference between 'these things are related' and 'these things have vague definitions that overlap to some degree' </p>\n<p>#5 . the definition of 'unmatched' is clear: we looked and there is no map.  But agree that you could assert a valid relationship from concept A to B, and also assert that the concept A is disjoint from  concept C (that would be common) and so disjoint is not a specialization of unmatched</p>",
        "id": 153943540,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520626630
    },
    {
        "content": "<p>#1. the definition of 'relatedto' has two clauses: one that restates 'related to' as two words (could be more specific, but aligns with the general concept of map, NOS), and one that asserts an overlap (which is a more specific kind of relationships, which might be more appropriately named 'equivalenceMap').</p>",
        "id": 153943598,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1520693893
    },
    {
        "content": "<p>#1 and #4 are related. perhaps this is clearer:<br>\nwider: A ⋂ B = A; A ⋃ B = B<br>\nnarrower: A ⋂ B = B; A ⋃ B = A<br>\nequivalent: A = B<br>\ndisjoint: A ⋂ B = ∅<br>\ninexact: A ⋂ B ≠ ∅<br>\nOR<br>\ninexact: A ⋂ B ≠ ∅ &amp; A - B ≠ ∅ &amp; B - A ≠ ∅<br>\n    (i.e., distinct from wider &amp; narrower)<br>\nrelatedto: A ⋂ B ≠ ∅ (same as inexact #1)<br>\nOR<br>\nrelatedto: no testable assertion can be made (leaving aside the question of whether all relationships must be equivalence relationships)</p>",
        "id": 153943600,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1520694788
    },
    {
        "content": "<p>so firstly, concept map is about equivalence. if you want to relate concepts by different criteria (e.g. 'this test for this disease') then we anticipate that you'll create CodeSystem supplements</p>",
        "id": 153943634,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520742427
    },
    {
        "content": "<p>related to is for cases where at least some degree of overlap is asserted (as specifically different from unmatched or disjoint), but it is not possible to say more than that</p>",
        "id": 153943636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520742488
    },
    {
        "content": "<p>My understanding of wider &amp; narrower is that they allow for some \"spillage\", so<br>\n  wider: A ⋂ B = A - ε; A ⋃ B = B + ε<br>\n  narrower: A ⋂ B = B - ε; A ⋃ B = A + ε<br>\nThe presence of the ε being the key distinction between wider and generalizes and narrower and specializes.</p>\n<p>I also understand the difference between relatedTo and inexact as being more like<br>\n  relatedto: A ⋂ B ≠ ∅<br>\n  inexact: A ⋂ B &gt;&gt; ∅</p>",
        "id": 153943721,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1520813393
    },
    {
        "content": "<p><strong>Use cases needed</strong><br>\nWe are looking at the value set for ConceptMap equivalence. One of the issues is values that don't seem clearly distinguished, and we're tempted to recommend collapsing them. But we want to make sure they aren't needed.<br>\n1. Equal &amp; equivalent. <br>\nThe current structural distinction sounds like a reasonable criterion for value set definitions, but it's not clear how it applies to concepts from different systems. We need an example of how the distinction might be recognized, ideally with some functional consequence.<br>\n2. broader &amp; subsumes; (same question for Narrower &amp; specializes)<br>\nThese seem indistinguishable. One suggestion was that the broader parent might be close but include some error, which is not tolerated in the child. For an automated map, it's not obvious where that distinction -- not a match, not a miss, but close --  would be useful. <br>\nIf this is useful, it would also be good to know <br>\na) whether this distinction is met by SKOS \"closeMatch\" or if it must also specify which side the error may be on.<br>\nb) whether \"close\" might subsume \"match\"<br>\nA second question concerns the need for many other values, whether sufficiently distinguished or not. The obvious use-case of substituting target values for source values in a specification seems to need a \"match\" value to support matches, possibly a \"broader\" value to support BT translations that may support valid albeit lossy rule application, and not much else. Can we identify use cases for no match, disjoint, narrower, inexact, etc.?</p>",
        "id": 153964709,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1527199765
    },
    {
        "content": "<p>1. I don't see why it matters whether they come from different systems for the difference. it might be more relevant if they don't have a definition</p>",
        "id": 153964719,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527201298
    },
    {
        "content": "<p>2. see CodeSystem.heirarchyMeaning. if the hierarchy meaning is subsumption, then broader and subsumes <em>are the same thing</em>. But if either code system heirarchy is not subsumption, then they mean different things</p>",
        "id": 153964720,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527201341
    },
    {
        "content": "<p>I don't understand the second question</p>",
        "id": 153964721,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527201363
    },
    {
        "content": "<p>1. If they come from the same system, they might have the same \"structural\" definition, in which case it's hard for me to imagine needing a map. If they come from different systems, the odds of the \"structural\" definitions being the same seem infinitesimal. But perhaps I don't understand what is meant by \"structural\" definition, so, again, some concrete examples would be most useful.<br>\n(The situation could conceivably, rarely, arise among extensions of SCT, but it's still unclear to me how the distinction would be useful.)</p>\n<p>2. HierarchyMeaning describes the respective systems, not the map. The map, if we're talking about equivalence maps, is about semantic overlap, which, in the cases of broader and narrower, means subsumption. IMHO.</p>\n<p>It's quite possible I'm missing something here, and I'm really interested in seeing some examples to find out what it is.</p>\n<p>3. The \"second question\" (apologies for the numbering) is that even for values that seem semantically clear, I don't have any use cases. Examples would be nice.</p>\n<p>All three questions are requests for examples.</p>",
        "id": 153964846,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1527259067
    },
    {
        "content": "<p>#1 you might not find examples of this amongst the big code systems , with their extensive editorial rules about meaning, but it's commonly encountered in the real world where code systems are <em>exact copies</em> of each other. or subsets of them are. We have lots of this at HL7 - and in the existing concept maps, in fact. See <a href=\"http://build.fhir.org/cm-address-type-v3.html\" target=\"_blank\" title=\"http://build.fhir.org/cm-address-type-v3.html\">http://build.fhir.org/cm-address-type-v3.html</a>.</p>\n<p>But you might start finding it between LOINC and SCT if SCT starts importing LOINC concepts....</p>",
        "id": 153964856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527267659
    },
    {
        "content": "<p>#2: here's a code system where the relationships are not subsumptive: <a href=\"http://build.fhir.org/v3/AddressPartType/cs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/AddressPartType/cs.html\">http://build.fhir.org/v3/AddressPartType/cs.html</a> (not that this is not stated in the  resource, erroneously and something that will be fixed as part of the UTG remediation). So, when mapping between address type code systems, you could assert that one code is broader than another, but not that it subsumes the other. </p>\n<p>The same would apply if you were mapping between classifications - where the relationship between the terms is 'grouped-with', not 'is-a'. In this case, you could map 2 concepts as 'bigger' or 'smaller' without being able to say anything about 'is-a' between them</p>",
        "id": 153964857,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527267910
    },
    {
        "content": "<p>#3: you're asking for examples for disjoint etc? or just saying that you don't have any use for that?</p>",
        "id": 153964858,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527267985
    },
    {
        "content": "<p>#1. I think the only distinction between the two is that the \"The definitions of the concepts mean the same thing\" vs \"The definitions of the concepts are exactly the same.\" So, does this mean that the _text_ definitions are the same? Because it goes on to say they can have \"grammatical differences,\" which makes it hard to say what the difference is between meaning the same thing and being textually sort of exactly the same.</p>\n<p>E.g., the definitions of the address examples seem to me to mean the same thing, but I can't see arguing that the definitions are identical. <br>\nMailing addresses - PO Boxes and care-of addresses. = Used to send mail. <br>\nA physical address that can be visited. = Used primarily to visit an address. </p>\n<p>It seems to me that the point of the map is to assert that the definitions are equivalent, for the purposes of the use case, whether the text is identical or not. If there is a distinction to maintain here, what would be useful would be an example of a case where the distinction matters to someone. </p>\n<p>(The \"structural implications\" verbiage hurts more than it helps, I think, as it doesn't distinguish the terms but it does introduce undefined complexity.) </p>\n<p>#2. Yes, address parts can be compositional (though the only hierarchy I see in that system is subsumptive). But assume you have an address code system that does assert, e.g., that counties are parts of states. If I were to map Maryland from system A as broader than Arundell County from system B in a Concept Map I'd be doing it wrong. Concept Map relations are equivalence relations, not partitive. The internal relations the systems may or may not assert about their contents are orthogonal to the equivalence map.</p>\n<p>So if the answer is that 'broader than' includes kinds of relationship other than semantic equivalence overlap, I think that stuff belongs elsewhere. Or, if we do decide to handle other relationships here, that would be in a different part of the hierarchy. </p>\n<p>#3. I am asking for examples for all of these. Does anyone have any?</p>",
        "id": 153965853,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1527718761
    },
    {
        "content": "<p>We use no match all the time, and inexact when the maps are auto-generated (because the algorithm can't be more specific).<br>\nIn the past we've also used disjoint to help with QA</p>",
        "id": 153965995,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1527725779
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> </p>\n<p>#1: \"The home address of the patient\" and \"Patient's home address\" are grammatically different but identical. It certainly is true that there's a grey zone here - we knew that when we defined the codes. But in principle, there's exact matches and non-exact matches. It's possible that some of the example is wrong - can you create a task to review the mapping equivalences there?</p>\n<p>#2: the heirarchy is much flatter than it used to be... or I've processed it wrongly.... BNN, BNR, BNS are under SAL, but they are not is-a with \"SAL\".  If you take for granted that concept maps are not about non-subsumption heirarchies then of course you won't be able to tell the difference between non-subsumption and subsumption based relationships since you defined use cases out of existence. I think you wrong about concept maps. </p>\n<p>#3 we have an example of disjoint: <a href=\"http://build.fhir.org/conceptmap-example.html\" target=\"_blank\" title=\"http://build.fhir.org/conceptmap-example.html\">http://build.fhir.org/conceptmap-example.html</a> (here it makes a common confusion people have). I've seen no-match used as well</p>",
        "id": 153966037,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527753941
    },
    {
        "content": "<p>We are still working on the <a href=\"http://build.fhir.org/valueset-concept-map-equivalence.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-concept-map-equivalence.html\">concept-map-equivalence</a> valueset and soliciting requirements and use cases for understanding whether these codes are clear and consistent and sufficient for the intended uses of ConceptMap.  We're also looking at <a href=\"https://www.w3.org/TR/skos-reference/#mapping\" target=\"_blank\" title=\"https://www.w3.org/TR/skos-reference/#mapping\">SKOS</a> and <a href=\"https://www.iso.org/standard/71088.html?browse=tc\" target=\"_blank\" title=\"https://www.iso.org/standard/71088.html?browse=tc\">ISO 21564</a> (I'm looking for a more helpful reference) mapping codes/concepts to see if they can provide additional clarity or value.  And we're also thinking about non-equivalence mapping uses for ConceptMap (for general attributes, etc.).  Please add any thoughts, use cases, requirements and experiences that you have.</p>",
        "id": 153966697,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1528127134
    },
    {
        "content": "<p>In preparation for Montreal WGM, a small team of <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> , <span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> , <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> , <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span>  and myself planned to meet, but ended up with an email exchange, consolidated here: <a href=\"https://docs.google.com/document/d/1ViXN5iAo1mnG7s_SauzHtKBBHd869IwkvAsVYX0W7-0/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/document/d/1ViXN5iAo1mnG7s_SauzHtKBBHd869IwkvAsVYX0W7-0/edit?usp=sharing\">https://docs.google.com/document/d/1ViXN5iAo1mnG7s_SauzHtKBBHd869IwkvAsVYX0W7-0/edit?usp=sharing</a>  . Folks interested in ConceptMap and CodeSystemSupplement - please read.  Thanks.</p>",
        "id": 163648415,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1555592198
    },
    {
        "content": "<p>I've added come clarifying (I hope) comments to this doc</p>",
        "id": 164508946,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1556596506
    }
]