[
    {
        "content": "<p>I saw <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> 's <a href=\"https://gist.github.com/lawley/3a59cf669d29a6d62e2948bc51e101a3\">write up</a> of current issues and was recently exploring use of dependsOn as well. I was wondering about how this might work for quantitative properties, so the proposal makes sense to me. But, I was curious if someone here could point me to some examples of existing ConceptMaps making use of the current dependsOn structure? Thx in advance.</p>",
        "id": 231667181,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1616604190
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> The <a href=\"https://build.fhir.org/ig/HL7/livd/StructureDefinition-conceptmap-testcode-uv-livd.html\">LIVD Test Code ConceptMap</a> is using dependsOn.  It's at least one example.</p>",
        "id": 231668135,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1616604520
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ! That's helpful and is analogous to the use case I had. I do wonder about the <a href=\"https://build.fhir.org/ig/HL7/livd/ConceptMap-66a4034b-6cc6-46ed-be83-343dfc51f2d7.html\">example resource</a> just using properties like \"specimen\" as just a string vs something in URI syntax per <a href=\"https://tools.ietf.org/html/rfc3986\">rfc3986</a>.</p>",
        "id": 231730441,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1616631769
    },
    {
        "content": "<p>Yes, I agree.  The data type for <code>property</code> is <code>uri</code>, so the example is technically not correct (but I'm not recalling that we had build warnings for it?).  That would be a good issue to log for the next version of the IG.  We are also in the process of updating the way that <code>dependsOn</code> is structured in ConceptMap so that it is better structured and more robust, and hopefully those changes will make it in for the R5 draft.</p>",
        "id": 232440594,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1617116451
    },
    {
        "content": "<p>Are relative URIs not valid here?  Many use-cases for maps with dependsOn/product elements will not have formal URIs</p>",
        "id": 232543432,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1617172865
    },
    {
        "content": "<p>You're right about relative URLs being valid, <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>.  I wasn't thinking of the strings we were using in the LIVD example as being that, but I suppose they may be.</p>",
        "id": 232596134,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1617199254
    }
]