[
    {
        "content": "<p>We would like to get some comments, today, if possible, on <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15604\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15604\">GF#15604</a>.  The LIVD project in OO has identified the need to represent mapping dependencies in text.  The current dependsOn.code element can actually do this since its data type is string rather than code, but the documentation doesn’t indicate that is allowed.  We would like to change the element name from ‘code’ to ‘value’ and update the documentation to make this more consistent and clear.  The main question for today is whether there would be objection to pre-applying this substantive change in the build today before the substantive freeze deadline.</p>",
        "id": 153942115,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520193711
    },
    {
        "content": "<p>+1 to changing the description before the deadline. I'm a little nervous about changing the name before the deadline- not sure it will get sufficient endorsement to bet on making it like this. What happens if vocab doesn't endorse it?</p>",
        "id": 153942116,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520193822
    },
    {
        "content": "<p>I think there is a very good chance that Vocab will approve it - we generally like consistency and clarity, and don’t like to put things in code elements that aren’t codes. :). If it would happen to not get approved we could pull it back in QA (a bit of a hassle, but doable).  I’m interested in <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>’s opinion, as one of the implementers most experienced with ConceptMap.</p>",
        "id": 153942117,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520194348
    },
    {
        "content": "<p>I don't have much to say about  the use of text in this context because we have no experience with using/implementing dependsOn at all. However I am very much in favour of naming things accurately, so support the name change from that perspective.</p>",
        "id": 153942138,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1520199593
    },
    {
        "content": "<p>So what do we think about pre-applying the element name change to 'value'?</p>",
        "id": 153942167,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520218332
    },
    {
        "content": "<p>I guess we do it</p>",
        "id": 153942199,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520222743
    },
    {
        "content": "<p>ok - then will commit within the next few minutes</p>",
        "id": 153942200,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520222811
    },
    {
        "content": "<p>I'm finishing up with a build run right now</p>",
        "id": 153942201,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520222875
    },
    {
        "content": "<p>k great</p>",
        "id": 153942202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520222925
    },
    {
        "content": "<p>are you updating all the java model code? or just for that change?</p>",
        "id": 153942203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520222948
    },
    {
        "content": "<p>just the specific parts that I needed for that change, if that's what you are asking<br>\nso in the R4 model it's only ConceptMap.java<br>\nplus the relevant bits of the XML, JSON and RDF parsers, the 10_40, 13_40 and 30_40 converters and the NarrativeGenerator</p>",
        "id": 153942204,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520223392
    },
    {
        "content": "<p>ok great.</p>",
        "id": 153942206,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520223555
    }
]