[
    {
        "content": "<p>Hello!  I am seeking controlled vocabularies or ontologies to use to represent social determinants of health (SDH) and lifestyle medicine concepts like foods, diet, exercise, sleep. I see LOINC offers some coverage of SDH: <a href=\"https://loinc.org/sdh/\" target=\"_blank\" title=\"https://loinc.org/sdh/\">https://loinc.org/sdh/</a> <br>\nIs anyone aware of some noteworthy UMLS or other ontologies to represent these concepts? Thanks</p>",
        "id": 153942708,
        "sender_full_name": "David Donohue",
        "timestamp": 1520427352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Others? Any ideas here? How are folks coding diet/food intake?</p>",
        "id": 163544288,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1555492616
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193259\">@Margaret Dittloff</span>  (Academy of Nutrition and Dietetics)  ?</p>",
        "id": 163571505,
        "sender_full_name": "Eric Haas",
        "timestamp": 1555514980
    },
    {
        "content": "<p>There is activity in SNOMED CT on the general SDH topic.  I should be able to gather some details from our meeting last week and otherwise if desired.  Agree with checking with Margaret regarding specifics for diet/nutrition.  I do know that they've added content to SNOMED for that fairly recently.</p>",
        "id": 163590846,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1555527242
    },
    {
        "content": "<p>The international Nutrition Care Process Terminology covers assessment of food and nutrient intake.  Most of these terms have been mapped to either SNOMED (International) or LOINC.  Example, the food intake panel (80453-4) covers food amount estimated (99.9% of all cases) and measured (reserved for metabolic research). You'll see it covers food groups, numbers of meals/snacks per day, breastmilk and infant formula volume/day, and enteral (Tube Feedng) details.  <span class=\"user-mention\" data-user-id=\"197951\">@Becky Gradl</span> Informatics Manager at the Academy Nutrition and Dietetics is working on a food insecurity mapping project so she may have other comments.</p>",
        "id": 163658841,
        "sender_full_name": "Margaret Dittloff",
        "timestamp": 1555599271
    }
]