[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> where would I find the minutes from the WGM in NOLA? I need to implement country codes ASAP and want to do what we said we'd do</p>",
        "id": 153935658,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517965341
    },
    {
        "content": "<p><a href=\"http://confluence.hl7.org:8090/display/VOC/Wednesday+Q1+Minutes\" target=\"_blank\" title=\"http://confluence.hl7.org:8090/display/VOC/Wednesday+Q1+Minutes\">http://confluence.hl7.org:8090/display/VOC/Wednesday+Q1+Minutes</a></p>",
        "id": 153935660,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517966524
    },
    {
        "content": "<p>But maybe not the decision you are looking for.  Here is what was minuted:   Bring in ISO country codes to the unified code systems.<br>\nthere are numeric codes, 2 character alpha codes and 3 character iso code options used for different purposes.<br>\nVersioning is also an issue it is encorporated in the urn.<br>\nHTA has to think about how we acknowledge the IP and how we publish an external code system such as this one.<br>\nurn:iso:std:iso:3166<span class=\"emoji emoji-1f44e\" title=\"-1\">:-1:</span>ed-1:en this is the urn for the first edition of ISO 3166 part 1 in english<br>\nWe should publish the identifier, but the registry has to contain the actual content as there is no readilly accessible iso version. The tracker item asks to combine parts 1 and part 2 containing all the parts versions and additions, or we could have the uri at the part level and have a different entry for each variation of the code system.</p>",
        "id": 153935661,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517966566
    },
    {
        "content": "<p>so we decided to have different code systems for the different parts</p>",
        "id": 153935662,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517966712
    },
    {
        "content": "<p>the link from the old wiki to the new wiki is broke, btw</p>",
        "id": 153935663,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517966735
    },
    {
        "content": "<p>oh good grief.  Yes when Patrick moved the Confluence pages the links broke, I'll see if I can fix it tonight.    I never got back any information from the email to ISO, and I am trying to get in touch with the 3166 maintenance agency.  They announced that they will release a new version in 2018 soon.   So we should do separate URLs for each of the 3 parts, then they can track the versioning correctly (as ISO will update the parts on a difference schedule).</p>",
        "id": 153935665,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517967238
    },
    {
        "content": "<p>so I forgot to look at this. We've already used urn:iso:std:iso:3166 extensively for the 2 lette codes</p>",
        "id": 153935666,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517967671
    },
    {
        "content": "<p>mapped to 1.0.3166.1.2.</p>",
        "id": 153935668,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517967739
    },
    {
        "content": "<p>Well that's not a good urn, according to 5141 for the ISO specs and from ISO themselves.   Should be urn:std:iso:3166:-1  And if all you have is the 2 letter codes, that is just 1/3 of the code system content.</p>",
        "id": 153935681,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517971684
    },
    {
        "content": "<p>it's not that I disagree, but I think that we're too late to fix this.</p>",
        "id": 153935682,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517971737
    },
    {
        "content": "<p>`</p>",
        "id": 153935683,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517971751
    },
    {
        "content": "<p>we can say that we use urn:std:iso:3166:-1 for what we were going to use urn:std:iso:3166:-1 :ed-1 for, and then use the others</p>",
        "id": 153935685,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517971797
    },
    {
        "content": "<p>well that would be too bad then.</p>",
        "id": 153935686,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517971817
    },
    {
        "content": "<p>if the maintenance agency publishes the urn to be used when they do the release later this year, if it is in conflict with us, that would be Bad, IMHO</p>",
        "id": 153935688,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517971917
    },
    {
        "content": "<p>I will send another missive to Geneva and see if I can get a response</p>",
        "id": 153935689,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517971991
    },
    {
        "content": "<p>I'm sure it's going to be a pain, but I'm not sure why we can't fix it - and if we are going to fix it, doing it now would be better than later.</p>",
        "id": 153935690,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517972018
    },
    {
        "content": "<p>My thought exactly</p>",
        "id": 153935691,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517972061
    },
    {
        "content": "<p>well, we have 100s of uses of that url. including in content going normative. if we're going to change it, we have to decide <em>now</em>. And then I have to somehow figure out how to support the old url in code supporting the old versions</p>",
        "id": 153935692,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517972095
    },
    {
        "content": "<p>I think we should swallow the bitter pill now.   and btw - the current edition is 2, so the urn would be urn:std:iso:3166:-1:ed-2</p>",
        "id": 153935693,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517972362
    },
    {
        "content": "<p>with edition 3 promised later this year</p>",
        "id": 153935694,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517972383
    },
    {
        "content": "<p>agree</p>",
        "id": 153935695,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517972383
    },
    {
        "content": "<p>but Grahame will have to do most of the work :(</p>",
        "id": 153935696,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517972412
    },
    {
        "content": "<p>I just wish Geneva was more responsive.  I sent that email over a month ago.</p>",
        "id": 153935697,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517972442
    },
    {
        "content": "<p>so presumably we'll also need to change again once edition 3 becomes a reality</p>",
        "id": 153935698,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517972469
    },
    {
        "content": "<p>sigh</p>",
        "id": 153935699,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517972497
    },
    {
        "content": "<p>I will CALL the folks in Geneva tomorrow morning.   Although it probably won't do any good...</p>",
        "id": 153935700,
        "sender_full_name": "Ted Klein",
        "timestamp": 1517972545
    },
    {
        "content": "<p>why would we change the system URL for subsequent version releases? do they change codes? none of the other uses of 2 letter country codes have any versioning infrastrcture</p>",
        "id": 153935701,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517972776
    },
    {
        "content": "<p>en-US.. imagine if that changed meaing....</p>",
        "id": 153935702,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517972786
    },
    {
        "content": "<p>unless I'm missing something, we'll either need to stay with the edition-agnostic url (which doesn't officially exist) or we'll need to keep up with it as the editions change - I'm not thinking of another obvious choice<br>\nobviously the former would be far easier, but I believe we're here because we thought we needed to use the \"official\" urls</p>",
        "id": 153935705,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517974517
    },
    {
        "content": "<p>umm. I understood 'edition' to refer to 3 different parts updated independently. So there's 3166, in parts, each of which have versions</p>",
        "id": 153935706,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517974643
    },
    {
        "content": "<p>is that wrong?</p>",
        "id": 153935707,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517974646
    },
    {
        "content": "<p>I'm opposed to using an edition-specific URI.  We should have one URI for 2-character codes that we use for all time.  If ISO does something bone-headed and re-uses a 2-letter code at some point in the distant future, then people can put the version-specific URI in the Coding.version element.</p>",
        "id": 153935708,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517974704
    },
    {
        "content": "<p>I believe that edition and part are separate<br>\nI just checked Wikipedia which talks about 3 parts and 5 editions, but Ted was referring to the current 2nd and the upcoming 3rd edition, which definitely doesn't correspond - so I'll leave it to Ted to clarify</p>",
        "id": 153935711,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517974960
    },
    {
        "content": "<p>I think I'm leaning toward Lloyd's position, regardless of what ISO does - maybe we (Ted) can convince them later</p>",
        "id": 153935713,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517975030
    },
    {
        "content": "<p>ideally, we'll have stable URLS for the parts, and also URLS for each edition of each part, and we'l use the stable URLs for code system URLs</p>",
        "id": 153935714,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517975065
    },
    {
        "content": "<p>right</p>",
        "id": 153935715,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517975075
    },
    {
        "content": "<p>but I'd rather not change the existing URL for the 2 letter part, even if it breaks the pattern</p>",
        "id": 153935716,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517975105
    },
    {
        "content": "<p>using \"urn:iso:std:iso:3166\" to mean specifically the 2-letter codes and not the others doesn't seem like a great idea, but not wanting to change it certainly is understandable</p>",
        "id": 153935717,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1517975315
    },
    {
        "content": "<p>OK, sorry didn't look at this until now...so there are three parts.    PART ONE contains the 2-letter codes, AND the 3-letter codes AND the numeric codes.   THERE EXISTS NO PART OR SEPARATE EDITION OR PUBLICATION OF JUST THE 2-LETTER CODES.    Sorry for shouting, but there is a reason that for YEARS we have had to use the HL7 value set machinery to separate the 2-letter codes and the 3-letter codes.   That is just what it is, published by someone outside of HL7,  It is what it is.    It is my understanding that the changes in the editions are the removal of countries that disappear (being gobbled up by aggressive neighbors) and additions of new countries (South Sudan anyone?).    I think there may have been some name changes in the past that may or may not have involved code changes, I would have to research that (Burma-&gt;Myanmar when the military coup happened all those years ago comes to mind).  All this having been said, it would be more convenient to have one stable URI for each Part, and use our HL7 versioning machinery to deal with the edition releases, and I would support that.   But Lloyd, if you really want to have one URI for the 2-letter codes only (with potentially a different one for the 3-letter codes) then I would have to insist that you create a new FHIR code system \"based on ISO 3166-1\" on take on the burden of maintaining it as an HL7 owned and curated object, and remove text that claims that it is the ISO code system so as to avoid violating copyright and IP stuff with ISO.   Maybe you can make urn:fair:lloyd:country, for instance  :-)</p>",
        "id": 153935822,
        "sender_full_name": "Ted Klein",
        "timestamp": 1518034392
    },
    {
        "content": "<p>if part 1 includes in the 2 letter codes and the 2 letter codes and the numeric codes, what do the other parts contain?</p>",
        "id": 153935837,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518036425
    },
    {
        "content": "<p>-1 includes country codes.  -2 includes province/state/territory codes.  -3 include retired country codes.  Because I guess you need a new code system when you retire things??</p>",
        "id": 153935842,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518037185
    },
    {
        "content": "<p>makes sense if you think about publishing rather than code systems</p>",
        "id": 153935843,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518037248
    },
    {
        "content": "<p>I'm happy for there to be one URI for the country codes and we can filter to 2-character codes using valueset machinery.  What I needed was a way to separate out the province/state/territory codes.  If we want to treat the whole thing as a single humongous code system and do everything with value set machinery, I can accept that - though we'd need to revamp the existing country code value set too.</p>",
        "id": 153935844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518037274
    },
    {
        "content": "<p>so I'd like to use urn:iso:std:iso:3166 for all 3 kinds of codes, then. Not sure about -3.</p>",
        "id": 153935845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518037276
    },
    {
        "content": "<p>I've never seen anyone using part 2 codes.</p>",
        "id": 153935846,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518037301
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> do you want to draft a code system for all the codes?</p>",
        "id": 153935847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518037315
    },
    {
        "content": "<p>Using province &amp; territory codes?</p>",
        "id": 153935853,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518037477
    },
    {
        "content": "<p>well, 2 variants for review?</p>",
        "id": 153935859,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518037908
    },
    {
        "content": "<p>Not following the request...</p>",
        "id": 153935885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518043177
    },
    {
        "content": "<p>Part two is country subdivisions (in the US the states, in Canada the provinces, etc).  Part 3 is changed/retired country codes, so actually contains the provenance/audit trail for the country codes that were changed/retired.</p>",
        "id": 153935889,
        "sender_full_name": "Ted Klein",
        "timestamp": 1518044290
    },
    {
        "content": "<p>so part 3 isn't a separate coding system? and we're not using part 2 in FHIR, we've been using  <a href=\"http://hl7.org/fhir/ValueSet/usps-state\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/usps-state\">http://hl7.org/fhir/ValueSet/usps-state</a></p>",
        "id": 153935890,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518044393
    },
    {
        "content": "<p>usps-state doesn't really fly for an international standard...</p>",
        "id": 153935893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518044734
    },
    {
        "content": "<p>well, you can make a proposal then.</p>",
        "id": 153935917,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518050017
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/mbHJYxfY-6mCe9CXKHVhOH8e/country-codes.xml\" target=\"_blank\" title=\"country-codes.xml\">country-codes.xml</a></p>",
        "id": 153935918,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518050023
    },
    {
        "content": "<p>usps-state is used extensively in the US and that aint gonna change anytime soon and I am surprised Canada is not the same.  We actually gave you guys <code>NB</code> so a mapping would be good ( and Lloyd should still be thanking us for that :-))</p>",
        "id": 153936411,
        "sender_full_name": "Eric Haas",
        "timestamp": 1518120668
    },
    {
        "content": "<p>NB?</p>",
        "id": 153936415,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518120716
    },
    {
        "content": "<p>\"In<br>\nNovember 1969, at the request of the Canadian<br>\npostal administration, the abbreviation for<br>\nNebraska, originally NB, was changed to NE, to<br>\navoid confusion with New Brunswick in Canada.\"</p>",
        "id": 153936417,
        "sender_full_name": "Eric Haas",
        "timestamp": 1518120756
    },
    {
        "content": "<p>wouldn't happen now...</p>",
        "id": 153936421,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518120802
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> we said in the disposition to this that we would define value sets for the 2/3 letter, and numeric codes from 3166. But because of IP restrictions, I can't do this by enumeration, right?</p>",
        "id": 153936486,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518128044
    },
    {
        "content": "<p>can't we use filters to do it?</p>",
        "id": 153936491,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1518129212
    },
    {
        "content": "<p>I <em>think</em> we can enumerate the 2 letter codes no problem, but for the 3 letter and the numeric ones we probably have to do an intensional definition.  If I can ever contact someone at CS I'll get a clarification.</p>",
        "id": 153936492,
        "sender_full_name": "Ted Klein",
        "timestamp": 1518129250
    },
    {
        "content": "<p>I believe it would be best to use the intensional definitions for all of them, and I'm not sure if the IP affects that<br>\nI think we'll also need a value set of 2 character codes plus the 3 character codes where a corresponding 2 character code doesn't exist?</p>",
        "id": 153936494,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1518129510
    },
    {
        "content": "<p>technically I can do eiher. enumerated is better for the implementers, so I'm happy to do that for 2 letter</p>",
        "id": 153936495,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518132611
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153936508,
        "sender_full_name": "David McKillop",
        "timestamp": 1518135543
    },
    {
        "content": "<p>Considering the widespread use of country codes and the widespread misunderstanding of how those work/are maintained, it's probably a good idea to try to add the gist of this discussion to the CodeSystem/ValueSet descriptions.<br>\nWe've, The Netherlands, not specified ISO 3166 in FHIR so far, as coded countries are a rarity and people have a textual string instead where a code could have been (Address.country) -- also in Address the uri does not surface.<br>\nThat being said, we've made the mistake of changing things over the years in V3 because we felt they could be done better moving forward all the while forgetting to respect existing implementations more. I really agree with Grahame's argument to accept that implementations for ISO 3166 based on the current uri make it next to impossible to start changing it now.</p>\n<p>The current terminologies-systems.html explanation needs updating though:</p>\n<ul>\n<li>urn:iso:std:iso:3166<ul>\n<li>ISO 2 letter Country Codes</li>\n<li>A few country codes have been reused (e.g. CS). If a version is needed, simply use the year of publication e.g. 1998</li>\n<li>1.0.3166.1.2.2</li>\n</ul>\n</li>\n</ul>\n<p>What the current OID mapping is, beats me given the discussion above:</p>\n<ul>\n<li>1.0.3166.1    Complete    iso3166-1</li>\n<li>1.0.3166.1.2  Complete    iso3166-1edition2</li>\n<li>1.0.3166.1.2.1    Complete    iso3166-1edition2numeric</li>\n<li>1.0.3166.1.2.2    Complete    iso3166-1edition2alpha2</li>\n<li>1.0.3166.1.2.3    Complete    iso3166-1edition2alpha3</li>\n</ul>\n<p>You would think, that all of the above have some sort of relationship to the uri</p>",
        "id": 153936553,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1518163728
    },
    {
        "content": "<p>I'm midway through the editorial work of updating it</p>",
        "id": 153936559,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518174692
    },
    {
        "content": "<p>you should have run into iso3166 a lot, in StructureDefinition.jurisdiction and ValueSet.jurisdiction</p>",
        "id": 153936560,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518175943
    },
    {
        "content": "<p>ok, <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a> is fully updated for iso3166 - please check (mainly at <a href=\"http://build.fhir.org/iso3166.html\" target=\"_blank\" title=\"http://build.fhir.org/iso3166.html\">http://build.fhir.org/iso3166.html</a>)</p>",
        "id": 153936683,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518234232
    },
    {
        "content": "<p>I haven't updated <a href=\"http://tx.fhir.org\" target=\"_blank\" title=\"http://tx.fhir.org\">tx.fhir.org</a> to support iso 3166 yet</p>",
        "id": 153936684,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518234244
    }
]