[
    {
        "content": "<p>The medication content of SNOMED CT Australian extension has its own root concept standing by side of the SNOMED CT root concept. Thus this extension is only visible in Shrimp. Not in IHTSDO browser. Can someone explain why it was built this way?</p>",
        "id": 153857539,
        "sender_full_name": "François Macary",
        "timestamp": 1479388352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> - ping</p>",
        "id": 153857550,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479390175
    },
    {
        "content": "<p>Here's the detailled technical reason:<br>\nThe problem really is that the SNOMED CT root concept is defined (in my opinion) in the wrong module.  The Australian National Release Centre (NRC) has (had?) a need to distribute AMT as a stand-alone extension (independent of the normal SNOMED content), but the root concep is defined in that module rather than in the metadata module.  We've (myself and the NRC) been working with the IHTSDO to sort out an alternative but it's taken longer than we hoped.</p>",
        "id": 153857607,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479431097
    },
    {
        "content": "<p>However, I'm not entirely sure that this is the reason why the extension is not visible in the IHTSDO browser.  I'm not sure what's required to get additional releases supported by their browser, but I imagine that SNOMED CT-AU's use of concrete domain content (for medication strengths etc) is a more likely reason.</p>",
        "id": 153857608,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479431253
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> I've just checked the IHTSDO browser - if you search for the AMT content it's all there.  For example, a search for the other root concept (30561011000036101) takes you to <a href=\"http://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=30561011000036101&amp;edition=au-edition&amp;release=v20160930&amp;server=https://browser-aws-1.ihtsdotools.org/api/snomed&amp;langRefset=32570271000036106\" target=\"_blank\" title=\"http://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=30561011000036101&amp;edition=au-edition&amp;release=v20160930&amp;server=https://browser-aws-1.ihtsdotools.org/api/snomed&amp;langRefset=32570271000036106\">http://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=30561011000036101&amp;edition=au-edition&amp;release=v20160930&amp;server=https://browser-aws-1.ihtsdotools.org/api/snomed&amp;langRefset=32570271000036106</a> and you can drill down in the concept details panel</p>",
        "id": 153857650,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479451568
    },
    {
        "content": "<p>Thanks Michael for your two replies. I see it in IHTSDO browser, now.<br>\nThe other reason I asked is that we (Phast company) are currently working on translating and extending the medication content for France, and our natural intent is to reuse as much as possible the content from the core edition (substances, medicinal products, qualifiers), and plug our extended contents onto these core hierarchies. As I understand the 'module' management in CT, we can still publish these extensions as a single \"France extension\" module, even though the content is scattered across multiple hierarchies. Correct? <br>\nIn other words I hope we won't have the module issue that you had. </p>",
        "id": 153857698,
        "sender_full_name": "François Macary",
        "timestamp": 1479467231
    },
    {
        "content": "<p>Yes, that is correct. The only reason for the AU issue is the desire to be able to publish AMT standalone.<br>\nThis will naturally go away (not be possible) once the AU content is integrated with core substances, but this integration raises a number of problematic modelling issues relating (largely) to salt forms where the is_a hierarchy in core is either 1) broken or 2) the meanings of the substance codes in AMT vs core are subtly different</p>",
        "id": 153857880,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479603786
    }
]