[
    {
        "content": "<p>I am building a platform to support a specific use case with codes/concepts that do no exist in any coding system. I might use SNOMED-CT and create mappings for it. Can you suggest the best possible route based on your experience. Either building a new set of concepts, or use and existing one. With either of those two approaches how should I implement it?</p>",
        "id": 167088994,
        "sender_full_name": "Ozair Bajwa",
        "timestamp": 1559422088
    },
    {
        "content": "<p>Can you provide examples of some of the concepts you're trying to represent?</p>",
        "id": 167089000,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559422125
    },
    {
        "content": "<p>I am using Procedure codes for surgical procedures including Laterality. I have looked through all the major coding systems and the one that come close is SNOMED-CT, and even there I could not find the ones I am looking for. I know we could use the ConceptMap to map the codes that might be close my use case, but looking for alternatives or an easier route. It is not an extensive list as most of the other codes exist in the available code systems.</p>",
        "id": 167089279,
        "sender_full_name": "Ozair Bajwa",
        "timestamp": 1559422592
    },
    {
        "content": "<p>Can you give a couple of specific examples?</p>",
        "id": 167091596,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559426453
    },
    {
        "content": "<p>Certainly surgical procedures would be things that would be appropriate to add to SNOMED CT if they're not yet there.</p>",
        "id": 167091608,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559426477
    },
    {
        "content": "<p>If the relevant procedure concepts are in SNOMED CT but without laterality attributes, then post-coordination could be a solution.</p>",
        "id": 167106393,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1559453771
    },
    {
        "content": "<p>if you have perfect 1 &lt;-&gt; 1 mappings between your custom codes and SNOMED CT codes, then just use the SNOMED CT codes. but that's pretty unlikely. Usually, the codes are not quite perfect matches, so you should define your own codes in a code system, use them directly, and then define mappings in a concept map and provide them in the CodeableConcept.coding too</p>",
        "id": 167109390,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559459538
    },
    {
        "content": "<p>Better still, send a request to your SNOMED national release centre to add these codes.  Then we can all benefit.</p>",
        "id": 167111680,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1559463239
    },
    {
        "content": "<p>Thanks a lot for all the useful feedback.I have searched through the SNOMED-CT browser for similar concepts but there is no 1-1 mapping. The concepts are in a pilot phase but the use case is around Medical Devices (Surgical not POC) in surgical environment. The immediate needs can be addressed by what Grahame suggested but going forward is it better to maintain a separate code system and provide mapping or submit a formal request to SNOMED to add these codes?  What are the challenges or pros/cons of either approach. I would love to learn from your experience and feedback.</p>",
        "id": 167138974,
        "sender_full_name": "Ozair Bajwa",
        "timestamp": 1559510282
    },
    {
        "content": "<p>I think the general consensus in the terminology community (in HL7 and otherwise) is that if the content is appropriate for inclusion in an externally maintained clinical terminology like SNOMED CT (which seems likely to be the case here) that it would be better to go ahead and submit the content for inclusion in SNOMED rather than trying to publish and maintain your own separate terminology (code system).  That decision could be affected some by the kind of reasoning you want to be able to do with the coded data, as the reasoning capabilities using SNOMED are likely to be more robust.  A factor in the other direction may be how rapidly you need to have the new content and how much control you feel you need to maintain over it.  In some cases that could push you more toward maintaining the content independently as a separate code system, but you should think carefully about whether that's really necessary and is worth the long term cost before doing that.</p>",
        "id": 167147651,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1559525101
    }
]