[
    {
        "content": "<p>We are planning to use the value set  given by <a href=\"https://loinc.org/LL2335-9/\">LOINC LL2335-9 (Numeric rating scale from 0-10 / Score of 0-10)</a>  for collecting questionnaire answers about reported pain levels (cf.  <a href=\"https://loinc.org/72514-3/\">LOINC 72514-3 (Pain severity - 0-10 verbal numeric rating [Score] - Reported)</a> for which it is the associated answer set). This gives a nice standard encoding, but on the client side it leads to some added complexity. Specifically, is hard to tell that a code from this set actually represents a number that can e.g. be mapped to a 0-10 scale for display. </p>\n<p>Does anyone have experience with/general advice on working with such \"crypto-numeric\" value sets and communicating their numeric nature? Specifically, here are the questions I am wondering about (apologies for the vagueness, my own thoughts on this are still nebulous!):</p>\n<ol>\n<li>Now that the suitable codes are available, my instinct was to use them. But are there good arguments for simply making the answer type for the relevant questions \"integer\" even if the LOINC code for the questions (say,  LOINC 72514-3) has LL2335-9 as the official set of answers?</li>\n<li>For now, we are looking at using the <a href=\"http://hl7.org/fhir/R4/extension-questionnaire-itemcontrol.html\">questionnaire-itemcontrol</a> to signal that the answer from a particular choice-type question should be rendered by a UI item that understands the numeric nature (including the ordering of codes).  But that pushes all the logic to the client. Are there other approaches to making the ordering this more explicit in the resources, e.g. by using the Questionnaire maxValue/minValue extensions (or maybe an extension on ValueSet)? Or using the ordering of the codes in the value set expansion? (If I read it right, the spec states that <a href=\"http://hl7.org/fhir/R4/valueset.html#expansion\">the list of codes in a value set expansion is actually considered ordered</a>: \"Note that the expansion structure is inherently ordered; this specification does not fix the meaning of use of the order. \")</li>\n</ol>",
        "id": 208334263,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1598616602
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> I think you are looking for the <a href=\"http://build.fhir.org/extension-ordinalvalue.html\">ordinal value</a> extension?  You can use it in CodeSystem.concept and ValueSet.compose.include.concept (as well as Coding and Questionnaire.item.answerOption, if needed).  I'm not sure that there is any way to use it (or anything else) to order the codes in a value set expansion (I haven't really explored that), but it seems that it could help with a lot of what you want.</p>",
        "id": 208339726,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1598620145
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ah, excellent, I'd missed that! - that would indeed cover some important parts of our use case. But is there any way to use this with a pre-defined value set like LOINC LL2335-9  (0-10 scale) that does not contain the extension out of the box? E.g. is there something similar to how code system supplements allows supplying translations for existing code systems?</p>",
        "id": 208391217,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1598646302
    },
    {
        "content": "<p>When you say \"pre-defined value set\", do you mean in this case the values of the LOINC answer list?  Or are you referring to a particular ValueSet resource instance (e.g. from <a href=\"http://fhir.loinc.org\">fhir.loinc.org</a>) that is defined based on that code list?  If it's the set of LOINC codes itself that you care about, could you not create a ValueSet resource instance yourself with a definition of that set of codes that also includes the ordinal value extension?</p>",
        "id": 208392638,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1598647178
    },
    {
        "content": "<p>You can start with the definition in 'compose' as here for <a href=\"https://fhir.loinc.org/ValueSet/LL2335-9\">LL2335-9</a> and add the extension with the appropriate value for each repetition of 'concept'.</p>",
        "id": 208394033,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1598648080
    },
    {
        "content": "<p>Yes indeed, I was referring to the ValueSet with the canonical <a href=\"http://loinc.org/vs/LL2335-9\">http://loinc.org/vs/LL2335-9</a> . I suppose I was under the impression than since this exists as a LOINC answers set with a canonical URL, it would  not be best practice to define an identical ValueSet (with a different canonical) that differs only by the presence of extensions. Hence, I was wondering if there would be some way to just \"tack on\" the extensions but keep the canonical URL. Or are \"parallel value sets\" not a problem?</p>",
        "id": 208449276,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1598728430
    },
    {
        "content": "<p>A value set is \"a selection of concepts for use in a particular context\".  So my take is that if, in your context of use, the ordinal value extension is needed and (to your knowledge) a value set with the needed codes and the extension hasn't already been defined, then it is perfectly legitimate to go ahead and create that value set and use it in your application.</p>",
        "id": 208451288,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1598731275
    },
    {
        "content": "<p>OK, perfect - thanks. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>!</p>",
        "id": 208486030,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1598795311
    },
    {
        "content": "<p>I would think that such implicitly defined LOINC ValueSets should also include the ordinal extension?</p>",
        "id": 208921756,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1599110012
    },
    {
        "content": "<p>Last time I looked at LOINC answers in the distribution, the ordering was difficult (the same answer list could be ordered differently for different terms, IIRC). It's been a while, though</p>",
        "id": 208922190,
        "sender_full_name": "Jim Steel",
        "timestamp": 1599110613
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> Unfortunately, that does not seem to be case for the ValueSets served by the central LOINC server (which is where the answer set canonicals takes you). E.g it is not on the scale I mention, <a href=\"http://loinc.org/vs/LL2335-9\">http://loinc.org/vs/LL2335-9</a> --&gt; resolves to <a href=\"https://fhir.loinc.org/ValueSet/LL2335-9\">https://fhir.loinc.org/ValueSet/LL2335-9</a>.</p>",
        "id": 208929171,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599117771
    },
    {
        "content": "<p>That's something that Regenstrief hasn't implemented for those value sets, but we can suggest to them that they should consider doing that.  <span class=\"user-mention\" data-user-id=\"193853\">@Swapna Abhyankar</span>?</p>",
        "id": 208959967,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1599136797
    },
    {
        "content": "<p>LOINC Answer lists include a sequence number for each of the answer strings in a particular list. The AnswerList .csv download file includes this field (see the AnswerFileReadme for the details), but it looks like it's not implemented in the FHIR TS, or at least not visibly so. Is it possible that it's implemented on the backend, which is why the answer strings show up in the correct order when you look at <a href=\"https://fhir.loinc.org/ValueSet/LL2335-9\">https://fhir.loinc.org/ValueSet/LL2335-9</a>, but just not displayed? (Sorry, FHIR newbie here).</p>",
        "id": 209048298,
        "sender_full_name": "Swapna Abhyankar",
        "timestamp": 1599184412
    }
]