[
    {
        "content": "<p>Is there any discussion of including links in the UI for term definitions? It seems that if the system publisher did things just right, an implementer could populate a &lt;system&gt;&lt;code&gt; link under any term on a screen and support user lookups, but that behavior isn't specified or described anywhere.</p>",
        "id": 207314697,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1597783907
    },
    {
        "content": "<p>in which UI?</p>",
        "id": 207319964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597786874
    },
    {
        "content": "<p>A good example of a UI that does just that can be found here... <a href=\"http://ontoserver.csiro.au/vstool/\">http://ontoserver.csiro.au/vstool/</a></p>",
        "id": 207355426,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1597793769
    },
    {
        "content": "<p>I'm suggesting that support might be baked into the standard. Which UI? Any UI that surfaces it (for code systems that support the \"UI link to definition\" feature). </p>\n<p>This would mean that any system steward who wants to conform would need to resolve some standard construction of system + code, or supply some other service URL as metadata. Right now, \"<a href=\"http://snomed.info/sct/194828000\">http://snomed.info/sct/194828000</a>\" doesn't get you anything.</p>",
        "id": 207555433,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1597947161
    },
    {
        "content": "<p>I'm not really sure exactly what you're asking for. To my knowledge, FHIR doesn't make any UX requirements anywhere else. We just define an interoperability specification. It sounds like you're expecting something built on the $lookup operation, but I'm not aware of anything else HL7 has done like this. But perhaps I have misunderstood what you are talking about</p>",
        "id": 207572610,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597956459
    },
    {
        "content": "<p>For SNOMED it would be <a href=\"http://snomed.info/id/194828000\">http://snomed.info/id/194828000</a> - the URI for an SCTID, but I too am not sure what you're after that's not covered by $lookup on the code (perhaps with ?_format=html)</p>",
        "id": 207793623,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1598220620
    }
]