[
    {
        "content": "<p>Can someone help me understand why <code>ValueSet.compose.include.concept.designation</code> is part of the data model for listing concepts to include? Designations are generally defined by the underlying CodeSystem rather than by a ValueSet, no? (And, for example, there is no <code>ValueSet.compose.include.concept.property</code> element, so the goal can't be to convey a full concept inline here...)</p>",
        "id": 276554503,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1648165850
    },
    {
        "content": "<p>The idea is that, in limited circumstances, you may want ValueSet-specific (ie context-specific) display text that varies from that of the underlying code system.  One example might be a limited language translation. Another might be where the display device has limited space, so you need a set of carefully crafted short names that fit in the space.<br>\nOf course doing it this way is not really re-usable, and the preferred approach from a reusability perspective would be a code system supplement (esp. for translations).</p>",
        "id": 276555499,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1648166625
    },
    {
        "content": "<p>Thanks! So when performing an expansion on a value set of that defines some designations inline, should these designations be added to the set of underlying designations from the code system itself, or should they be \"pasted over\" them, effectively replacing/shadowing any designations from the underlying code system?</p>",
        "id": 276556977,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1648167822
    },
    {
        "content": "<p>They augment, just as a supplement would.  The corner-case is <code>display</code>.  We resolve this by repeating display as an explicit designation, and then the specific value used in the display element is just the one selected based on the <code>displayLanguage</code> parameter or the Accept-Language header, but all options are available as designations.</p>",
        "id": 276558425,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1648168954
    }
]