[
    {
        "content": "<p>Unless I've overlooked it, it seems that we've only barely touched on the question of whether you can use a designation from a code system supplement in a resource instance in Coding.display.  I can't find anything documented in the spec that specifically addresses it, and searching back in Zulip this is all that I found (from 2018-03-20):</p>\n<blockquote>\n<p>Michael Lawley: 1. Can a supplement specify and alternative display value for a concept?</p>\n<ol start=\"2\">\n<li>Can it specify an alternative use code for a designation?</li>\n</ol>\n<p>Grahame Grieve: #1 it can add designations. We haven't described any way in which it could replace the display defined by the code system, but we also haven't said that a code system supplement can't define a designation that is the most appropriate to use in a given context.</p>\n<p>#2. no. but it can define a new designation with the same value and a new use code</p>\n</blockquote>\n<p>And this from 2018-11-16:</p>\n<blockquote>\n<p>Xiaocheng Luan: Hi everyone, I work in Paul's team, new to FHIR. Guess my main confusion is what exactly a supplement is. I could imagine two extreme views:<br>\n(1) A supplement is a \"patch\" to the code system it references, it's not a code system by itself (and thus can't be used in a Coding). A supplement-aware terminology server considers it to be part of the code system it \"supplements\".<br>\n(2) A supplement is a code system of its own right, it \"inherits\" the definitions from the code system it references and adds extra, much like a subclass in the context of object oriented modeling. It thus has its own code system URL (e.g., loinc.org-ext1) and can be used in \"Coding\".</p>\n<p>For the \"patch\" view in (1), there could be issues of local vs. global/standard, and consistency issues across terminology servers on specific code systems (with/without different supplements defined).<br>\nFor the \"subclass\" view, it may obligate terminology servers hosting such \"supplement/subclass\" code systems to be fully aware of/support the filters, properties, etc., defined in the original (parent) code system?<br>\nThis \"subclass\" view was what I thought it should roughly be but it does not appear to be the case based on the conversations in this thread?</p>\n<p>Lloyd McKenzie: A code system supplement is absolutely constrained to be #1. It cannot define new codes, nor can it define new meanings for codes. However, it can define new properties, new display values and/or new relationships for codes defined in another code system.</p>\n</blockquote>\n<p>Lloyd's take on it isn't particularly detailed but it sounds at least somewhat more permissive.  So is the consensus still that an additional designation that is specified in a code system supplement <strong>cannot</strong> be used to populate an instance of Coding.display, or is this something that we do (or want to) allow?</p>",
        "id": 185236910,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1578592056
    },
    {
        "content": "<p>It's certainly something we <em>need</em> to allow.  However, it may be that the value set will need to acknowledge the supplements that are in scope for the use of that value set.  (We can't expect a validator to check for displays defined in supplements it doesn't know anything about...)</p>",
        "id": 185237905,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578592726
    },
    {
        "content": "<p>Yes, we will need to consider that.  If the supplement is included in an IG (package), would it also need to be declared in the value set definition(s)?  Probably so, but we should look at all of the possible options.</p>",
        "id": 185240556,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1578594363
    },
    {
        "content": "<p>Sounds like a good thing for Vocab to discuss :)</p>",
        "id": 185241158,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578594741
    },
    {
        "content": "<p>If it's just any supplement that happens to be available in the hierarchy of dependencies or in the local guide, that makes things easier for the specifier, but somewhat harder for the tool.  It also creates some challenges with using terminology services - as you'd need the terminology service to be aware of the supplements.  Would also need to consider whether it's allowed to point to a supplement that <em>isn't</em> part of the hierarchy of dependencies or local guide, or whether you must always have a dependency.</p>",
        "id": 185241309,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578594868
    },
    {
        "content": "<p>I'm getting the following error if I use -sct ca to run against the canadian set<br>\n  Error @ ImmunizationRecommendation.recommendation[0].targetDisease.coding[0] (line 12, col2) : Unable to provide support for code system <a href=\"http://snomed.info/sct\" target=\"_blank\" title=\"http://snomed.info/sct\">http://snomed.info/sct</a> version 20611000087101 for '<a href=\"http://snomed.info/sct#36989005\" target=\"_blank\" title=\"http://snomed.info/sct#36989005\">http://snomed.info/sct#36989005</a>' -- </p>\n<p>Without -sct ca, I get the following, similar to yours.<br>\n  Error @ ImmunizationRecommendation.recommendation[0].targetDisease.coding[0] (line 12, col2) : Unable to provide support for code system <a href=\"http://snomed.info/sct\" target=\"_blank\" title=\"http://snomed.info/sct\">http://snomed.info/sct</a> version 900000000000207008 for '<a href=\"http://snomed.info/sct#36989005\" target=\"_blank\" title=\"http://snomed.info/sct#36989005\">http://snomed.info/sct#36989005</a>'</p>\n<p>In both instances, the code should have been found.</p>",
        "id": 185254019,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1578602950
    },
    {
        "content": "<p>we certainly do not want value sets to have to explicitly declare language packs. But we've pretty much agreed here before that they need to declare supplements if they use them in filters</p>",
        "id": 185279089,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1578626461
    },
    {
        "content": "<p>I think we did agree on that.  But I'm not sure at that point how thoroughly we had considered all of the possible use cases.  I'm not saying for sure that I think we could or should do something different - just that we may not have explored all of the possible scenarios fully.  I'm thinking particularly in the IPS context with the use of and desire to communicate multiple languages.  I think it does work with the current Coding.display rules - but the Immunization example that we had in the IPS spec wasn't following that, and that's what I'm cleaning up now.</p>",
        "id": 185279782,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1578627575
    },
    {
        "content": "<p>We are currently evaluating how to use: <a href=\"http://hl7.org/fhir/ValueSet/iso3166-1-2\">http://hl7.org/fhir/ValueSet/iso3166-1-2</a> with german displays.<br>\nAs this will be a language pack with no filters i assume, that i have to create a CS with a new URI.<br>\nsupplements has to be pointing to: urn:iso:std:iso:3166</p>",
        "id": 205135712,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1595865753
    },
    {
        "content": "<p>can i then just add the concepts, just insert a german display value and setting the CS language to DE ?</p>",
        "id": 205135762,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1595865789
    },
    {
        "content": "<p>I don't think you should create a new code system (I'm pretty certain that HTA would not agree with that).  It sounds like this is appropriate to do with a code system supplement.</p>",
        "id": 205136317,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595866048
    },
    {
        "content": "<p>Coincidentally, we've just tried to use <a href=\"http://hl7.org/fhir/ValueSet/iso3166-1-2\">http://hl7.org/fhir/ValueSet/iso3166-1-2</a> too, however, it doesn't seem to work yet as the IG Publisher generates an error and replaces this with a blank binding in the profile.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191451\">Patrick Werner</span> <a href=\"#narrow/stream/179202-terminology/topic/Designations.20from.20code.20system.20supplements.20in.20Coding.2Edisplay.3F/near/205135712\">said</a>:</p>\n<blockquote>\n<p>We are currently evaluating how to use: <a href=\"http://hl7.org/fhir/ValueSet/iso3166-1-2\">http://hl7.org/fhir/ValueSet/iso3166-1-2</a> with german displays.<br>\nAs this will be a language pack with no filters i assume, that i have to create a CS with a new URI.<br>\nsupplements has to be pointing to: urn:iso:std:iso:3166</p>\n</blockquote>",
        "id": 205194840,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1595906418
    },
    {
        "content": "<p>uh? what's an example?</p>",
        "id": 205197039,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595910195
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <a href=\"#narrow/stream/179202-terminology/topic/Designations.20from.20code.20system.20supplements.20in.20Coding.2Edisplay.3F/near/205136317\">said</a>:</p>\n<blockquote>\n<p>I don't think you should create a new code system (I'm pretty certain that HTA would not agree with that).  It sounds like this is appropriate to do with a code system supplement.</p>\n</blockquote>\n<p>I also thought i will create a CS with the same canonical URI, but with a different language, then i read: <a href=\"https://www.hl7.org/fhir/codesystem.html#supplements\">https://www.hl7.org/fhir/codesystem.html#supplements</a> which states:  </p>\n<ul>\n<li>The CodeSystem.url for a supplement SHALL never appear in a Coding.system</li>\n<li>The CodeSystem.url for a supplement must be under the control of the authority creating or publishing the supplement (e.g. not in the same space as the code system being supplemented, unless the supplement is being issued by the same authority as the original code system+</li>\n</ul>",
        "id": 205219406,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1595931802
    },
    {
        "content": "<p>So i'm confused on how to provide a supplement just for german display values.</p>",
        "id": 205219436,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1595931834
    },
    {
        "content": "<p>so that means that you can't publish a supplement with a URL like <a href=\"http://hl7.org/fhir/CodeSystem/3166-supplement\">http://hl7.org/fhir/CodeSystem/3166-supplement</a>, because you aren't <a href=\"http://hl7.org\">hl7.org</a> (though you could ask us to do that). But you can publish it as <a href=\"http://hl7.de/fhir/CodeSystem/3166-supplement\">http://hl7.de/fhir/CodeSystem/3166-supplement</a> because you have the authority to do so (assuming you act on behalf of HL7 germany in this case)</p>",
        "id": 205220286,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595932471
    },
    {
        "content": "<p>Understood, thanks.<br>\nWhat about this use-case: an uv profile defines a VS Binding. This VS contains english displays. For the German Implementation we want to have german displays, but not violating the VS Binding.</p>",
        "id": 205456896,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596100403
    },
    {
        "content": "<p>So i would create a CS with a different URI, containing the same concepts, but with german display values. Mark it as supplement?</p>",
        "id": 205457068,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596100536
    },
    {
        "content": "<p>And it would be up to the server/validator, to pick up the supplement(s) when expanding the VS?</p>",
        "id": 205457154,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596100589
    },
    {
        "content": "<p>Or do i have to take the original CS, extend the concepts with designations, give it another uri than the original CS?</p>",
        "id": 205457216,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596100665
    },
    {
        "content": "<p>P.S.: i missunderstood: \"The CodeSystem.url for a supplement SHALL never appear in a Coding.system\" which means i still code with the original CS URI, and never insert the supplement CS URI, which has to be a different URI.</p>",
        "id": 205457632,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596101034
    },
    {
        "content": "<p>I think you need to change the binding to a binding that invokes the supplement</p>",
        "id": 205465137,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596107017
    },
    {
        "content": "<p>which breaks conformance in a derived profile</p>",
        "id": 205481027,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596117329
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> i heard you might be interested in language specific expansions as well.</p>",
        "id": 205481335,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596117484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> Why would it break conformance?</p>",
        "id": 205487947,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596120566
    },
    {
        "content": "<p>You're allowed to change even required bindings - you just can't increase the set of codes available.</p>",
        "id": 205487996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596120589
    },
    {
        "content": "<p>oh! right.</p>",
        "id": 205488230,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596120693
    },
    {
        "content": "<p>Thanks for the clarification</p>",
        "id": 205488364,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596120744
    },
    {
        "content": "<p>Yes, if you change the binding to an equivalent ValueSet (eg by including the original) that also references the supplement, then $validate should take into account the german displays.</p>",
        "id": 205531394,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1596142589
    }
]