[
    {
        "content": "<p>The FHIR validator is producing this message, and someone has asked me about it:</p>\n<div class=\"codehilite\"><pre><span></span><code>Warning: Display Name for http://terminology.hl7.org/CodeSystem/observation-category#vital-signs should be one of &#39;Vital Signs&#39; instead of &#39;vital-signs&#39;\n</code></pre></div>\n<p>I don't believe we've ever clarified whether HL7 code system displays are case sensitive or not, and therefore whether this is an appropriate warning. SCT displays are case sensitive, as are UCUM displays. More specifically, for FHIR, we'd need an extension to say something about this on a CodeSystem or a ValueSet?</p>",
        "id": 258450777,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634767017
    },
    {
        "content": "<p>This particular warning isn't just about case sensitivity - there's also the difference of ' ' vs '-'.  That difference is always significant and the warning is valid, regardless of what we decide about case.  I think we should always consider the displays as case-sensitive, unless there's an explicit indication otherwise.  And since we don't seem to have a way to do that, possibly we need to add an extension for it.</p>",
        "id": 258452404,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634767837
    },
    {
        "content": "<p>What problem would we be trying to solve by allowing displays to <em>not</em> be case-sensitive?  Is there a reason for systems to change the case of displays (and not change anything else)?</p>",
        "id": 258452897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634768067
    },
    {
        "content": "<p>some of the formal display names are overly uppercased. Sometimes SHOUTING, sometimes Just Too Many Upper Case First Letters.</p>",
        "id": 258453176,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634768186
    },
    {
        "content": "<p>Agree with Lloyd.  I'm not sure there is a good reason for it - that's why I mentioned \"possibly\".</p>",
        "id": 258453237,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634768215
    },
    {
        "content": "<p>not a strong argument, just one that I have seen where internal copies of formal vocabulary have been made more human friendly.</p>",
        "id": 258453283,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634768241
    },
    {
        "content": "<p>so I missed the '-' thing - thanks for pointing that out</p>",
        "id": 258454473,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634768895
    },
    {
        "content": "<p>Making more \"human friendly\" often involves much more than just capitalization.  You're free to define your own value sets that create whatever display names you like - and the validator will spit out warnings that they don't match the official ones.</p>",
        "id": 258455147,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634769277
    }
]