[
    {
        "content": "<p>I need to encode smt. with the ICD-10 code M41.86. That is the code M41.8 \"Other forms of scoliosis\", extended with the supplementary subclassification digit  6 \"Lumbar region\" (cf. section on Dorsopathies(M40-M54) in the <a href=\"https://icd.who.int/browse10/2010/en\">ICD-10 browser</a>). However, the browser does not offer a display text for this particular combination and I'm not of official rules for generating display strings for 5-digit codes from the 4-digit ones (for now, I put \"Other forms of scoliosis, lumbar region\"). Are there such rules for official lists of display texts for 5-digit codes?</p>",
        "id": 265529304,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1639985894
    },
    {
        "content": "<p>As long as your locally generated text is consistent with the meaning of the concept, you can use your own local text as the description for the concept. Particularly true when it is a valid code but there is no defined description by the code system, like this. I don't know if there is an official syntax for this from WHO, but yours looks fine.</p>",
        "id": 265578147,
        "sender_full_name": "Robert McClure",
        "timestamp": 1640014378
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>  I agree with Rob M.  But I will add that if ICD-10 (WHO or a national variant?) <strong>does</strong> (now, or possibly in the future) provide a mechanism for generating a \"standard\" description for the codes with the additional digits, then all Coding instances should be using those descriptions for 'display'.</p>",
        "id": 265594367,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1640022095
    },
    {
        "content": "<p>Sounds good, thanks Rob &amp; Rob!</p>",
        "id": 265670505,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1640083076
    },
    {
        "content": "<p>Actually, one follow-up question. Running the latests JAR validator on this example, it throws a validation error saying that the code M41.86 is invalid (using the general ICD-10 URL, <code>http://hl7.org/fhir/sid/icd-10</code>):</p>\n<div class=\"codehilite\"><pre><span></span><code>Error @ Condition.code.coding[0] (line 23, col21):\nThe code &quot;M41.86&quot; is not valid in the system http://hl7.org/fhir/sid/icd-10;\nThe code provided (http://hl7.org/fhir/sid/icd-10#M41.86) is not valid in the value set &#39;All codes known to the system&#39; (from http://tx.fhir.org/r4) for &#39;http://hl7.org/fhir/sid/icd-10#M41.86&#39;\n</code></pre></div>\n<p>Is that a limitation of the term server or is this actually an invalid code for this ICD-10 URL?</p>",
        "id": 265678445,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1640088967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>  M41.86 is a valid ICD-10-CM (US) code, but it is not in the \"base\" WHO version of ICD-10 (according to the ICD-10 <a href=\"https://icd.who.int/browse10/2019/en\">browser</a>).  So the error message is correct.</p>",
        "id": 265689869,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1640096467
    },
    {
        "content": "<p>Ah, OK. But how is one then supposed to use the supplementary subclassification listed in the browser in the section on dorsopathies and referred to in the section on M41 (when writing codes in the base ICD-10 version)? Looking at section of 2.4.6 of the <a href=\"https://icd.who.int/browse10/Content/statichtml/ICD10Volume2_en_2010.pdf\">ICD-10 instruction manual linked from the browser</a>, it says </p>\n<blockquote>\n<p>The fifth and subsequent character levels are usually subclassifications along a<br>\ndifferent axis from the fourth character. They are found in:<br>\nChapter XIII –  subdivisions by anatomical site</p>\n</blockquote>\n<p>and chapter XIII (M00-M99) is where M41.8 is at home. I thought that meant adding a fifth character is valid.</p>",
        "id": 265693197,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1640098335
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> Yes, you have a good point on that.  My assumption was that the browser included the complete contents, but according to the manual it seems that it probably does not.  These \"supplementary classifications\" can be a real pain (I've run into this a lot in working with ICD-9-CM and ICD-10-CM).  So if this \"new\" interpretation based on the documentation in the manual is correct, then the issue becomes that we need to obtain a new source file for ICD-10 that is actually complete.  I have that available and I've used it for ICD-10-CM, but at the moment I don't know where else to look for it for the \"base\" ICD-10 from WHO.</p>",
        "id": 265695359,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1640099550
    },
    {
        "content": "<p>OK, thanks for the update <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>. If I know that M41.86 is indeed a valid code, the validation error in itself is actually not an issue for me (does not break any builds etc.).</p>",
        "id": 265794124,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1640173033
    }
]