[
    {
        "content": "<p>We are on the verge of working with DSM 5 as a system. The DSM 5 system does not yet have an OID assigned to it (nor a FHIR System URI for that matter). We need both an OID and a system URI. What's the best way forward? <span class=\"user-mention\" data-user-email=\"ted@tklein.com\" data-user-id=\"676\">@Ted Klein</span> Klein?</p>",
        "id": 153912083,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1507045754
    },
    {
        "content": "<p>Can you add a tracker?  And we'll get it on the Vocab agenda.</p>",
        "id": 153912115,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1507059945
    },
    {
        "content": "<p>Added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13998\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13998\">GF#13998</a>. Thanks in advance!</p>",
        "id": 153912267,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1507126685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Is this the common way to ask for new code system uri? We are considering to create a system uri form IMO lexicals (we already have OID assigned)</p>",
        "id": 153912794,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1507242180
    },
    {
        "content": "<p>I don't think it's actually necessary to bring up the request here (in Zulip), unless there are questions that need to be answered - like do we really need this?, do we already have it (but I didn't find it)?, etc.  What we do need, if it is vocabulary content that you feel should be part of the core specification, is to have a tracker item created so that we can make sure that it is addressed.</p>",
        "id": 153912801,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1507245738
    },
    {
        "content": "<p>According to the NIH, DSM-5 \"is not a standalone terminology\". It is merely a value set of diagnoses coded into ICD-9 and ICD-10. What is the proper way to work with these codes in FHIR? I found code system url <a href=\"http://hl7.org/fhir/sid/dsm5\" target=\"_blank\" title=\"http://hl7.org/fhir/sid/dsm5\">http://hl7.org/fhir/sid/dsm5</a> but there is no accompanying content. Are we meant to \"invent\" a DSM-5 CodeSystem with ICD-9 and ICD-10 codes copied into it? That doesn't seem right. Really, DSM-5 should just be a ValueSet composed of codes from ICD. I think I'll do it that way. But I'm concerned about this publicized url for a CodeSystem that doesn't actually exist. If I implement a simple ValueSet and come across anything that references this imaginary CodeSystem instead of expanding the ValueSet directly, it won't be able to resolve the CodeSystem.</p>",
        "id": 191522334,
        "sender_full_name": "Elise Myers",
        "timestamp": 1584990836
    },
    {
        "content": "<p>Thanks for the question, <span class=\"user-mention\" data-user-id=\"224108\">@Elise Myers</span>.  We should take a look and see if we think that DSM-5 could (and should) be properly represented as a ValueSet based on the ICD-9 and ICD-10 code systems (in whatever combination).  I would have thought that wasn't the case, but I haven't really thought about it in any detail before and based on what you've said I wonder if that might be true.  If that does turn out to actually be the case, then I agree that we <strong>wouldn't</strong> want to additionally define a separate url for the DSM-5 \"code system\" (and we can deprecate - i.e. remove from the FHIR spec - the one that we have).  Would you like to make a tracker for this for the Vocab WG to consider?</p>",
        "id": 191523255,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1584991312
    },
    {
        "content": "<p>I'd be happy to! How do I do that...?</p>",
        "id": 191523657,
        "sender_full_name": "Elise Myers",
        "timestamp": 1584991497
    },
    {
        "content": "<p>There's a link for <a href=\"http://hl7.org/fhir-issues\" target=\"_blank\" title=\"http://hl7.org/fhir-issues\">Propose a change</a> at the bottom of every page of the FHIR spec (Including the Code Systems page, which I presume you're looking at).  If you have issues or questions with that (Jira can be a bit arcane to deal with, particularly at first) or if you would rather have someone else enter the tracker, let us know.</p>",
        "id": 191524133,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1584991713
    },
    {
        "content": "<p>is there a publicly available list of DSM-5 codes?</p>",
        "id": 191538908,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584998785
    },
    {
        "content": "<p>I'm not completely certain, but I don't think there is (not without cost, anyway).</p>",
        "id": 191539276,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1584998968
    },
    {
        "content": "<p>This is the best list I found <a href=\"http://www.nyscouncil.org/wp-content/uploads/2014/01/DrD-DSM-5AlphaICD-9-10a.pdf\" target=\"_blank\" title=\"http://www.nyscouncil.org/wp-content/uploads/2014/01/DrD-DSM-5AlphaICD-9-10a.pdf\">http://www.nyscouncil.org/wp-content/uploads/2014/01/DrD-DSM-5AlphaICD-9-10a.pdf</a></p>",
        "id": 191550268,
        "sender_full_name": "Elise Myers",
        "timestamp": 1585005478
    },
    {
        "content": "<p>That's seems like a decent list, but it <strong>looks</strong> for the most part like a mapping (with either or both ICD entries for most, but not all of the items), and it may be complete in regard to DSM-5 but that's not clear as far as I can see, and it doesn't show anything about versions or dates, etc. (of either the DSM-5 list or the ICD code systems).  I think we will need to look at an \"official\" DSM-5 source along with some some published coding and usage guidance.</p>",
        "id": 191561405,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585016898
    },
    {
        "content": "<p>Absolutely agree. Just offering the best I had found so far.</p>",
        "id": 191674057,
        "sender_full_name": "Elise Myers",
        "timestamp": 1585084851
    },
    {
        "content": "<p>done <a href=\"https://jira.hl7.org/browse/FHIR-26645\" title=\"https://jira.hl7.org/browse/FHIR-26645\">https://jira.hl7.org/browse/FHIR-26645</a></p>",
        "id": 191807208,
        "sender_full_name": "Elise Myers",
        "timestamp": 1585168334
    },
    {
        "content": "<p>Great.  Thanks, <span class=\"user-mention\" data-user-id=\"224108\">@Elise Myers</span>!  We'll get it on a call agenda - we probably can discuss it on the FHIR Tracker Issues call tomorrow.</p>",
        "id": 191834453,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585189981
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224108\">@Elise Myers</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Was there any progress on this?  We've recently had an enquiry about supporting DSM-5</p>",
        "id": 263960243,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1638854764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"224108\">@Elise Myers</span> This is getting rather old now.  And I'm not aware of any progress that has happened on it?  It certainly does seem like something that we need to have support for.  I don't see an HTA page for it (unless I missed something).  <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span></p>",
        "id": 264034668,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1638897201
    },
    {
        "content": "<p>Noted on ticket that this has been added to next HTA call.</p>",
        "id": 264039921,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1638899070
    },
    {
        "content": "<p>Some initial research that will be the start of discussion at HTA, comments welcome</p>\n<p>The DSM-5 gives mental health professionals criteria and definitions to classify diseases through a common language, while ICD-10 assigns a code that is used for reimbursement in claims processing (in the US, perhaps other places).<br>\n-NIH/NLM provides a \"metathesaurus representation\" of DSM-V, which states \"DSM-V is is a set of diagnostic criteria for ICD9CM and/or ICD10CM codes.  There are no native DSM-5 codes, it is not a standalone terminology.\" <br>\n-The APA provides guidance and criteria by which the ICD10CM (or legacy ICD9CM) should be utilized for diagnosis. Initial HTA research shows that there are no DSM V codes <br>\n-Changes to the DSM can be found here <a href=\"https://www.psychiatry.org/psychiatrists/practice/dsm/updates-to-dsm-5\">https://www.psychiatry.org/psychiatrists/practice/dsm/updates-to-dsm-5</a> and are characterized in two ways<br>\n  1) Updates to DSM criteria and text <a href=\"https://www.psychiatry.org/psychiatrists/practice/dsm/updates-to-dsm-5\">https://www.psychiatry.org/psychiatrists/practice/dsm/updates-to-dsm-5</a><br>\n  2) Changes to ICD-10-CM Codes for DSM-5 Diagnoses</p>",
        "id": 264172373,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1638977676
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> . The issue of ICD10 vs ICD10-CM here is interesting, because we have ICD10-AM so I suspect there are similar / related concerns for the Asia Pacific use of DSM-5 and codes. (I have no knowledge of how it is used in AU though).</p>",
        "id": 264378505,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1639089870
    }
]