[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195194\">@Colby Seyferth</span> I'm very interested in what the drivers are for implementing terminology services inside the EHR.  Or, put another way, why not use an externalised terminology service?</p>",
        "id": 160920567,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1552690898
    },
    {
        "content": "<p>because any existing EHR already has lots of value sets and code systems and extensive internal terminology services.</p>",
        "id": 160926661,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552698585
    },
    {
        "content": "<p>If you were designing from scratch.... maybe you would use an external terminology service</p>",
        "id": 160926691,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552698602
    },
    {
        "content": "<p>It would be insightful to know how many EHR vendors have switched, or plan to switch, their internal terminology 'services' to FHIR.  I would expect that the biggest reason for such a major re-factoring of this application layer would be to move to an external service (hopefully FHIR).</p>",
        "id": 160942771,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1552726460
    },
    {
        "content": "<p>aprroximately none, so far as I know. A far more likely thing is to make parts of your internal services that already exist available via an external interface</p>",
        "id": 160966492,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552768418
    },
    {
        "content": "<p>and parts of your internal new development leverage an external server</p>",
        "id": 160966540,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552768449
    },
    {
        "content": "<p>My guess is that the later scenario is more likely here in NZ to facilitate the implementation of SNOMED CT in EHRs.</p>",
        "id": 160969601,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1552773325
    },
    {
        "content": "<p>I think it's a good idea</p>",
        "id": 160970029,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552774039
    },
    {
        "content": "<p>It would be interesting if layering a FHIR layer over the (often multiple) internal terminology systems were a path to integrating and providing consistent and better functionality, with or without external terminology services.<br>\nIt should also offer great benefits to the EHR vendors in terms of maintenance costs for importing and massaging all the external code lists</p>",
        "id": 161026520,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1552876808
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>, that's essentially what we're starting to do.</p>",
        "id": 161039996,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1552898762
    },
    {
        "content": "<p>In many ways, providing terminology services is an essential feature of an EHR.  <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  I'm not quite sure that I know what \"switching\" to FHIR means.  We may implement a set of FHIR APIs on top of our existing terminology services, and implement integration with external terminology services (and probably both at the same time).</p>",
        "id": 161095422,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1552942390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> you're describing the same kind of adapter approach described by <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> above which relates to more mature EHR products. Not all EHRs (in this part of the world anyway) have a cohesive approach to terminology and changing their architecture to consume external terminology services exposed by a FHIR API would represent quite a major change, maybe akin to flicking a switch?</p>",
        "id": 161097204,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1552943812
    },
    {
        "content": "<p>They will have lots of more simple terminologies though, and in some areas may not require the more complex terminology capabilities.</p>",
        "id": 161097440,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1552944024
    },
    {
        "content": "<p>Sure. In NZ, SNOMED CT and NZMT implementations are the major concern and most vendors have very little experience of a providing  or consuming  a terminology services API. In fact, as I type, this I'm in a meeting with the Ministry and a group of GP and Pharmacy vendors discussing this very topic.</p>",
        "id": 161097816,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1552944372
    }
]