[
    {
        "content": "<p>Is their a case for simplification of terminology services?</p>\n<p>Most EPR systems I've worked with, support multiple CodeSystems (in a CodeSystem table) and then these have child Conepts (in a Concept table). They are likely to have another Concept linktable for ParentChild links. Thats how the UK reference implementation was designed (it started off as a HAPI JPA Server which does the same). </p>\n<p>The Concept table is one of the key tables but we don't have a simple way of interacting with it. We have to use CodeSystem and the style of interaction is differerent to the rest of FHIR. E.g. if I wanted to find a Patient with a name of Smith I would do Patient?name=smith but I can't do the same without using parameters. What I'd expect to be able to do is run a RESTful query like Concept?name=heart rate&amp;codesystem=9999</p>\n<p>In addition to that query I'd probably want a simple way of ascending or descending the Concept heirarchy</p>\n<p>When working with FHIR I tend to use either a SNOMED browser or SQL queries instead, I don't normally use terminology services. I do use them in validation and for expanding valuesets but I think the difference here is 80/20.</p>\n<p>The main point is I feel a Concept resource serves as a introduction to terminology services. Going straight to a full blown terminology service is probably too much, having a simplified interaction aids getting clinical coding from a back room activity to main stream.</p>",
        "id": 172199496,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1564645890
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> I think that the FHIR Resource you need to focus on is the ValueSet. This can contain concepts from one, or many, Code Systems and, indeed, all the concepts from a given Code System. FHIR even exposes the larger Code Systems (e.g. SNOMED CT and LOINC) in their entirety via Implicit Value Sets. If your particular interest is SNOMED CT, then I recommend reading this page in the FHIR Specification... <a href=\"http://hl7.org/fhir/snomedct.html\" target=\"_blank\" title=\"http://hl7.org/fhir/snomedct.html\">http://hl7.org/fhir/snomedct.html</a>. As an implementer, any feedback you could provide on this would be welcomed by the Terminology Services Group of the SNOMED on FHIR Project as we are producing an Implementation Guide to supplement the guidance on this page. We are also hoping to hold a break-out session at the upcoming Atlanta WGM Connectathon to elicit feedback from other potential consumers of terminology services.</p>\n<p>I have an exemplar FHIR R4 Terminology Server and you can make queries via a fairly simple Web GUI at <a href=\"https://terminz-itp.azurewebsites.net/Home/Terminology\" target=\"_blank\" title=\"https://terminz-itp.azurewebsites.net/Home/Terminology\">https://terminz-itp.azurewebsites.net/Home/Terminology</a>.  The FHIR URL of each request is displayed along with a tabluar view of the response so, for example, you can see how text filter searching for Concept Descriptions is achieved across the whole of a SNOMED CT edition &amp; version (in this case it's the latest version of the NZ Edition which includes all of the 20190131 version of the International Edition).</p>",
        "id": 172201094,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1564647417
    },
    {
        "content": "<p>The use case that prompted the comment was building a Questionnaire. </p>\n<p>For each question.item I was searching for Concepts and the quickest way of finding them was via this snomed browser:  <a href=\"https://snomedbrowser.com/\" target=\"_blank\" title=\"https://snomedbrowser.com/\">https://snomedbrowser.com/</a><br>\nI would also be generating ValueSets for some of these items (valuesets being ideal for picklists).</p>\n<p>So yes I could build a ValueSet query but it's not intuitive, it seems odd I use ValueSet to search for Concepts to build a ValueSet. Shouldn't the filter be on Concept type not the name? Also the ability to ascend or descend a heirarchy I find to be very useful [I'm a bit biased on this because this is how our read code browser worked in the 90's but it was a simple way for users to add observations to patient records]</p>",
        "id": 172289866,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1564731284
    },
    {
        "content": "<p>There is a task open to add search to code system</p>",
        "id": 172291382,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564733101
    },
    {
        "content": "<p>Is there a GForge Tracker for this? I couldn't see it in the list of open tasks for CodeSystem.</p>\n<p><span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> I also wrote a Read Code browser back in the 90s. Much simpler when the (single) hierarchy is implemented within the codes themselves - but very limiting!</p>",
        "id": 172292588,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1564734639
    },
    {
        "content": "<p>You might find <a href=\"https://ontoserver.csiro.au/snapper2\" target=\"_blank\" title=\"https://ontoserver.csiro.au/snapper2\">https://ontoserver.csiro.au/snapper2</a> useful for building ValueSets.<br>\nAside from that, is <code>Concept?name=heart rate&amp;codesystem=999</code> really that different from <code>ValueSet?filter=heart rate&amp;url=http://snomed.info/sct?fhir_vs</code> ?</p>",
        "id": 172430557,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1564886242
    }
]