[
    {
        "content": "<p>ok, so I agreed to create an example on of a value set compose that sets up a heirarchy on today's vocab call. So here we go:</p>",
        "id": 153970043,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529026382
    },
    {
        "content": "<p>.. hmm .. to long for Zulip. All right, let's try this:</p>",
        "id": 153970044,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529026423
    },
    {
        "content": "<p><a href=\"http://www.healthintersections.com.au/example-heirarchical-expand.xml\" target=\"_blank\" title=\"http://www.healthintersections.com.au/example-heirarchical-expand.xml\">http://www.healthintersections.com.au/example-heirarchical-expand.xml</a></p>",
        "id": 153970045,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529026479
    },
    {
        "content": "<p>I tried to iterate all the possibilities - that makes this way more conceptually complicated than real world examples, I hope. I would not advocate some of the combinations I showed, but I could imagine them arising anyway</p>",
        "id": 153970046,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529026566
    },
    {
        "content": "<p>orientation: </p>\n<ul>\n<li>the base code system included has 4 root codes with 2-3 child codes each. 2 of the root codes are abstract</li>\n<li>the value set includes some but not all of the codes. </li>\n<li>when expanding from the UI, you want to reproduce some of the hierarchy from the code system, and introduce a purely arbitrary 'most common' grouping to be at the top </li>\n<li>some of the hierarchy comes from codes that are not actually in the value set</li>\n</ul>",
        "id": 153970047,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529026697
    },
    {
        "content": "<ul>\n<li>the resulting UI expansion is included, as is the not-for-ui expansion (as a comment)</li>\n</ul>",
        "id": 153970048,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529026917
    },
    {
        "content": "<p>If the CodeSystem has hierarchyMeaning=is-a, then must that semantics be preserved in the expansion hierarchy?<br>\nMore generally, would a ValueSet be allowed to set up hierarchy that did not respect the hierarchyMeaning, and if so, how would a client know this?</p>",
        "id": 153970053,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1529036223
    },
    {
        "content": "<p>Structurally, the value set is allowed to set up any hierarchy it wants to. Whether that's a good idea or not very much depends... and particular authorities over code systems or value sets might want to say something about that. But I don't think it would be a good idea for us to say anything</p>",
        "id": 153970054,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529036888
    },
    {
        "content": "<p>I forgot to say: set up like this, this complex extension could become core elements in R5 if we converged on this approach in practice</p>",
        "id": 153970059,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529039283
    },
    {
        "content": "<p>.. no takers...</p>",
        "id": 153970429,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529407060
    },
    {
        "content": "<p>This might be more compelling to me if the compose used rules (filters) rather then being extensional.</p>",
        "id": 153970687,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1529466634
    },
    {
        "content": "<p>that wasn't the use case. And I feel as though the heirarchy should be inferred in the intensional use case</p>",
        "id": 153970701,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529486363
    },
    {
        "content": "<p>I sat with Graham and got a quick look at what is inside the proposal and in short, I think it seems a good first step. But I need some of you more code-enabled to look and chime in.</p>",
        "id": 153970848,
        "sender_full_name": "Robert McClure",
        "timestamp": 1529518090
    },
    {
        "content": "<p>If it's only applicable to the extensional case, then why not specify it in the expansion itself? This wouldn't require any changes, except perhaps in terms of directing terminology servers that they should/might behave differently when a (full) expansion is explicitly provided.</p>",
        "id": 153970904,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1529551218
    },
    {
        "content": "<p>I don't understand this. This would essentially say ' there's no reason for extensional value sets'</p>",
        "id": 153971082,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529669396
    },
    {
        "content": "<p>technically, btw, the solution would work in an intensional value set. It's just as comfortable as a cart without a wheel - but that's inherent in the problem to me</p>",
        "id": 153971084,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529669438
    }
]