[
    {
        "content": "<p>Where are the exception codes for terminology module operations defined, e.g. Unknown code system, Unknown code system version, Unknown concept code, Unknown Language, Language not supported for code system, etc.? I searched for \"exceptions\" through the Bing search on the FHIR website, but didn't find anything helpful about exceptions. Does the FHIR standard define exceptions and are there standard ways to extend exceptions for various APIs?</p>",
        "id": 153920781,
        "sender_full_name": "Senthil Nachimuthu",
        "timestamp": 1511293618
    },
    {
        "content": "<p>Those are all covered by the Issue Type Codes for the OperationOutcome resource... <a href=\"http://hl7.org/fhir/valueset-issue-type.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-issue-type.html\">http://hl7.org/fhir/valueset-issue-type.html</a></p>",
        "id": 153920816,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1511302693
    },
    {
        "content": "<p>It might be a good idea to associate HTTP response status codes with these, e.g. as properties on the code system</p>",
        "id": 153920868,
        "sender_full_name": "Jim Steel",
        "timestamp": 1511311591
    },
    {
        "content": "<p>I think Senthil has a good point.  We haven't defined any of the terminology-specific exceptions that he mentioned, except for 'code-invalid'.  At this point it's pretty much server dependent regarding what is returned as an OperationOutcome.  Possibly we could consider defining some additional issue types for some of them (e.g. unknown code system and unknown code system version).  And maybe it would be useful to at least allow (not necessarily require) declaring additional server-defined exception behavior in TerminologyCapabilities?</p>",
        "id": 153920999,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1511350320
    },
    {
        "content": "<p>Thank you all. As a first step, we need to define what exceptions are applicable to the terminology services module. As a second steps, we need to associate specific exceptions with specific operations. This is what we did with CTS 1 and 2, but is there some documentation on how FHIR deals with exceptions - I'd like to educate myself about it please. The Bing search did not return anything useful. Thank you!</p>",
        "id": 153921051,
        "sender_full_name": "Senthil Nachimuthu",
        "timestamp": 1511367062
    },
    {
        "content": "<blockquote>\n<p>We haven't defined any of the terminology-specific exceptions that he mentioned, except for 'code-invalid'.  At this point it's pretty much server dependent regarding what is returned as an OperationOutcome.  Possibly we could consider defining some additional issue types for some of them (e.g. unknown code system and unknown code system version).  And maybe it would be useful to at least allow (not necessarily require) declaring additional server-defined exception behavior in TerminologyCapabilities?</p>\n</blockquote>\n<p>We need to consider this from a client developer perspective and analyse if and how they might benefit from a more granular set of TS-related exception issue type codes as opposed to viewing the text in the diagnostics value which can provide more specific information. It would also be informative to view this in the light of how developers process exceptions thrown by broader applications frameworks, such as .NET (exception.message - plus stack trace - tells me more than anything else) and it's not as if many terminology services errors are going to be thrown back to end users, other than invalid codes (in various contexts). The bulk of the remainder are more likely to be down to what's supported by the individual terminology server at the resource instance level (code system edition &amp; version; concept map).</p>",
        "id": 153921113,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1511384990
    },
    {
        "content": "<p>I agree with you, Peter.  I'm not sure what would be the best approach to determine this, but I agree that we shouldn't add anything unless we have some evidence that it would be useful.</p>",
        "id": 153921125,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1511388825
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>We haven't defined any of the terminology-specific exceptions that he mentioned, except for 'code-invalid'.  At this point it's pretty much server dependent regarding what is returned as an OperationOutcome.  Possibly we could consider defining some additional issue types for some of them (e.g. unknown code system and unknown code system version).  And maybe it would be useful to at least allow (not necessarily require) declaring additional server-defined exception behavior in TerminologyCapabilities?</p>\n</blockquote>\n<p>We need to consider this from a client developer perspective and analyse if and how they might benefit from a more granular set of TS-related exception issue type codes as opposed to viewing the text in the diagnostics value which can provide more specific information. It would also be informative to view this in the light of how developers process exceptions thrown by broader applications frameworks, such as .NET (exception.message - plus stack trace - tells me more than anything else) and it's not as if many terminology services errors are going to be thrown back to end users, other than invalid codes (in various contexts). The bulk of the remainder are more likely to be down to what's supported by the individual terminology server at the resource instance level (code system edition &amp; version; concept map).</p>\n</blockquote>\n<p>Peter, I agree with your concerns. Here is one real world use case that I have encountered and implemented. A lab HL7 interface keeps sending messages to a date warehouse. The datawarehouse translates the local lab codes on the fly and stores them. Now, suddenly the lab sends a new code. This throws a \"No Map\" or \"Unknown Code\" exception. There are other types of exceptions we've seen when we have centralized terminology servers - e.g. \"Unknown Code System\", \"Unknown code system version\", \"Unsupported language\", etc. These happen at runtime, not just configuration time. So, it's not sufficient to just send a human readable error message in the text description. There needs to be a standardized set of exceptions that the implementer can program against so that their system knows what to do or whom to alert, as opposed to getting a NullPointerException with the stacktrace or a HTTP 404 error. Thanks.</p>",
        "id": 153921874,
        "sender_full_name": "Senthil Nachimuthu",
        "timestamp": 1511887715
    },
    {
        "content": "<p>I agree with Peter that OperationOutcome.issue.code is designed to fill the purpose.</p>",
        "id": 153923053,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1512509599
    }
]