[
    {
        "content": "<p>Hi All - what should be the behavior of the $expand operation if it expands a valueset and the valueset has a compose.include on a codesystem that does not exist in the FHIR server?</p>\n<p>Take for example <a href=\"http://build.fhir.org/immunization-definitions.html#Immunization.vaccineCode\" target=\"_blank\" title=\"http://build.fhir.org/immunization-definitions.html#Immunization.vaccineCode\">http://build.fhir.org/immunization-definitions.html#Immunization.vaccineCode</a>, which has EXAMPLE binding on <a href=\"http://build.fhir.org/valueset-vaccine-code.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-vaccine-code.html\">http://build.fhir.org/valueset-vaccine-code.html</a>. This valueset imports urn:oid:1.2.36.1.2001.1005.17, which doesn't exist in our FHIR server and I can't find a ready-to-use CodeSystem for it.</p>\n<p>The logic for expanding valuesets (i.e. <a href=\"http://build.fhir.org/valueset.html#expansion\" target=\"_blank\" title=\"http://build.fhir.org/valueset.html#expansion\">http://build.fhir.org/valueset.html#expansion</a>) only has to say about this:</p>\n<blockquote>\n<p>Otherwise: For each compose.include:<br>\nIf there is a system, identify the correct version of the code system, and then:<br>\nIf there are no codes or filters, add every code in the code system to the result set.<br>\nIf codes are listed, check that they are valid, and check their active status, and if ok, add them to the result set (the parameters to the $expand operation may be used to control whether active codes are included).</p>\n</blockquote>\n<p>I'm assuming the \"check that they are valid\" part means looking up if the code exists in the codesystem.<br>\n1. If the code doesn't exist in the codesystem, does the $expand operation fail with an OperationOutcome? Or the code is just not included?<br>\n2. If the codesystem itself is not found, does the $expand operation fail with an OperationOutcome? Or all the codes the valueset listed under that codesystem are just not included?</p>",
        "id": 179510250,
        "sender_full_name": "Michael Calderero",
        "timestamp": 1572510031
    },
    {
        "content": "<p>I think it should be an error</p>",
        "id": 179520609,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572519771
    }
]