[
    {
        "content": "<p>We're building profiles to support reporting to a clinical health registry (colonoscopy). In some cases there are questions where the range of allowed answers is a valueSet  that includes \"None\", \"Other\", \"Unknown\" and \"Not applicable\",  where we use the HL/ code systems list-empty-reason (nilknown), nullFlavor (OTH) and data-absent-reason (unknown and not-applicable) . But then we some value sets where we need the option of  \"Uncertain\". Which I can find nowhere in any of these or related code systems. It feels like it should be there, as it is related, but I cannot find it. <br>\nMy question is: Does it exist, and I just cannot find it? Or do I need to use another, local  (self-invented) code system? Anyone encountered this issue and solved it elegantly without having to use a local (self-invented) code?<br>\n [example of such a Question: \"Is the lesion endoscopically complete removed\": Yes, No, Uncertain]</p>",
        "id": 231315241,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1616421956
    },
    {
        "content": "<p>Missing codes is a quite common issue.  A locally inclusive vocabulary might mitigate it.</p>",
        "id": 231317619,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616422884
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192103\">Lin Zhang</span> <a href=\"#narrow/stream/179202-terminology/topic/Expressing.20Uncertain.20as.20a.20codableConcept/near/231317619\">said</a>:</p>\n<blockquote>\n<p>Missing codes is a quite common issue.  A locally inclusive vocabulary might mitigate it.</p>\n</blockquote>\n<p>Yes, there are of course a lot of codes we have to use from local code systems. But in the case of \"Uncertain\", it just feels like it should have been there, since all these other related ones: no, other, unknown, n/a  exist. But, if it's not there, we'll use a local code.</p>",
        "id": 231384932,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1616447245
    },
    {
        "content": "<p>How about <a href=\"https://terminology.hl7.org/CodeSystem-v3-ActUncertainty.html\">ActUncertainty</a> or <a href=\"https://terminology.hl7.org/CodeSystem-certainty-rating.html\">StatisticCertaintyRating</a></p>",
        "id": 231554179,
        "sender_full_name": "Robert McClure",
        "timestamp": 1616538634
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191503\">Robert McClure</span> <a href=\"#narrow/stream/179202-terminology/topic/Expressing.20Uncertain.20as.20a.20codableConcept/near/231554179\">said</a>:</p>\n<blockquote>\n<p>How about <a href=\"https://terminology.hl7.org/CodeSystem-v3-ActUncertainty.html\">ActUncertainty</a> or <a href=\"https://terminology.hl7.org/CodeSystem-certainty-rating.html\">StatisticCertaintyRating</a></p>\n</blockquote>\n<p>Thanks for the tips, much appriciated:</p>\n<ul>\n<li>ActUncertainty [stated with uncertainty] doesn't seem right, as there are no value that is recorded that the clinician is uncertain about. It a more general \"I'm uncertain what to record\"</li>\n<li>StatisticCertaintyRating isn't right either as that is about certainty of statistical values (EBMonFHIR),  categories of how certain you are that the statistics reflect the true values in the population (or thing) you are looking at.</li>\n</ul>",
        "id": 231660098,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1616601730
    },
    {
        "content": "<p>Some LOINC answer list(s) might include a code for 'Uncertain'. But it's just a guess.</p>",
        "id": 231664333,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616603138
    },
    {
        "content": "<p>For example, Normative LOINC Answer List LL4540-2<br>\n<a href=\"https://loinc.org/LL4540-2\">https://loinc.org/LL4540-2</a></p>",
        "id": 231665111,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616603418
    },
    {
        "content": "<p>And SNOMED CT might be another potential source terminology.</p>",
        "id": 231665824,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616603690
    },
    {
        "content": "<p>For example, SNOMED CT 64957009 |Uncertain (qualifier value)|</p>",
        "id": 231666282,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616603847
    },
    {
        "content": "<p><a href=\"https://browser.ihtsdotools.org\">https://browser.ihtsdotools.org</a></p>",
        "id": 231666414,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616603891
    },
    {
        "content": "<p>Or, even you can also create a ValueSet using codes from more than one CodeSystem.</p>",
        "id": 231670659,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616605366
    },
    {
        "content": "<p>DO not use LOINC answer values independent of LOINC observations and even then be careful. If you are just looking for coded concepts that fit the bill and have universal access, have you looked in SNOMED if it's open for use in your jurisiction?</p>",
        "id": 231687123,
        "sender_full_name": "Robert McClure",
        "timestamp": 1616611278
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191503\">Robert McClure</span> <a href=\"#narrow/stream/179202-terminology/topic/Expressing.20Uncertain.20as.20a.20codableConcept/near/231687123\">said</a>:</p>\n<blockquote>\n<p>DO not use LOINC answer values independent of LOINC observations and even then be careful. If you are just looking for coded concepts that fit the bill and have universal access, have you looked in SNOMED if it's open for use in your jurisiction?</p>\n</blockquote>\n<p>In SNOMED there is a qualifier value concept , under \"Qualifier for certainty of diagnosis (qualifier value)\" and \"General adjectival modifier (qualifier value)\" that lexically fits [Uncertain (qualifier value) 64957009], although the uncertainty is not just about diagnosis. But we're not building expressions (where qualifiers would be useful). We use SNOMED for clinical concepts only, not as a just words. To me, it would fit much better together with the other HL7 code systems where we find:   \"None\", \"Other\", \"Unknown\" and \"Not applicable\" (systems list-empty-reason, nullFlavor or data-absent-reason. I could probably suggest  Uncertain as an extention/addition to one of those. I'll see who to contact about that</p>",
        "id": 231820311,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1616685488
    },
    {
        "content": "<p>The only place I know this sort of need was discussed and addressed was for allergy intolerance.  See <a href=\"https://terminology.hl7.org/CodeSystem-reaction-event-certainty.html\">AllergyIntoleranceCertainty</a> That is obviously specific to allergy but perhaps this needs to be generalized? Perhaps you can talk to Patient Care about that?</p>",
        "id": 231854572,
        "sender_full_name": "Robert McClure",
        "timestamp": 1616697620
    },
    {
        "content": "<p>Need an ability to discover ValueSet(s) by searching the content.</p>",
        "id": 231894047,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616716312
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191503\">Robert McClure</span> <a href=\"#narrow/stream/179202-terminology/topic/Expressing.20Uncertain.20as.20a.20codableConcept/near/231854572\">said</a>:</p>\n<blockquote>\n<p>The only place I know this sort of need was discussed and addressed was for allergy intolerance.  See <a href=\"https://terminology.hl7.org/CodeSystem-reaction-event-certainty.html\">AllergyIntoleranceCertainty</a> That is obviously specific to allergy but perhaps this needs to be generalized? Perhaps you can talk to Patient Care about that?</p>\n</blockquote>\n<p>Thank you. I was thinking I would ask HL7 terminology authority. I'm just waiting for my Jira access. I'll write the result of my quest for uncertainty once I get somewhere:)</p>",
        "id": 231938328,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1616752534
    },
    {
        "content": "<p>I expedited your request.  You should be good to go.</p>",
        "id": 231962235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616764780
    },
    {
        "content": "<p>The HTA is only focused on external terminology issues so they are not going to help you with this. I'd go to Patient Care, which was involved with the allergy work, and see if they can help generalize the allergy-specific value set/ code system created. <span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span></p>",
        "id": 232029001,
        "sender_full_name": "Robert McClure",
        "timestamp": 1616791418
    },
    {
        "content": "<p>I recall preliminary discussions and discussions in openEHR about the certainty issue around allergy.  I had not reviewed the value set referenced in AllergyIntoeranceCertainty.  There appears to be some ambiguity and to me a poorly constructed value set.  Likely and unlikely is a clinical judgement which could overlap considerably between observers.  And the observer is often the patient.  The existence of testing for pharmaceuticals, biologics is vanishingly rare.  Less than 1% of substances.  Rechallenge is the gold standard, but rarely undertaken except by accident.    The definition of AllergyIntoleranceCertainty does not align with the definitions of the values in the value set.  The former refers to \"the manifestation in a reaction\", the latter to the reaction.  This also does not align well with VerificationStatus in the AllergyIntolerance Resource.</p>",
        "id": 232043749,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1616800077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span> and <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> Any suggestion on who to contact in the Patient care WG? I see very little about terminology/vocabulary on their pages,  <a href=\"https://www.hl7.org/Special/committees/patientcare/overview.cfm\">https://www.hl7.org/Special/committees/patientcare/overview.cfm</a>, but there is a \"Facilitator - Vocabulary\": Susan Matney, listed there.</p>",
        "id": 233292178,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1617702251
    },
    {
        "content": "<p>Simplest is to submit a change request against the resource - it will then be discussed by the full work group.</p>",
        "id": 233349489,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617726376
    },
    {
        "content": "<p>I'll ping <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>, and we can consider having further discussion on a Patient Care WG FHIR (Thursday) call?  I think we'll want to be careful about where we might go with this.</p>",
        "id": 233354826,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1617728590
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> suggestion of entering a change request is best approach.  There is a 90% override rate for drug-allergy alerts which would suggest to me that there is room for improvement in the way the resource exists.  I think uncertainty is not the only issue, but it is an issue.</p>",
        "id": 233367207,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1617734045
    },
    {
        "content": "<p>Agree a change request will be needed.</p>",
        "id": 233372685,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1617736297
    },
    {
        "content": "<p>My original suggestion was to expand the HL/ code system nullFlavor (that has the value OTH-Other) OR data-absent-reason (that has the values unknown and not-applicable) to add in the value of \"Uncertain.\" That way we could use it in a range of different value sets. Is that in the lines of your thinking? [Link to the issue I placed with HTA (as we talked about earlier in this thread, this was maybe not the right place to add the request: <a href=\"https://jira.hl7.org/browse/HTA-38]\">https://jira.hl7.org/browse/HTA-38]</a></p>",
        "id": 233514054,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1617810471
    },
    {
        "content": "<p>I'll just say that I'm a bit uncertain about adding a code for 'Uncertain' across the board. :)  It certainly warrants some discussion to determine if that, or something else, is the way we want to address this need (certainly acknowledging that the need to deal with uncertainty is very real).</p>",
        "id": 233545759,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1617822969
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <a href=\"#narrow/stream/179202-terminology/topic/Expressing.20Uncertain.20as.20a.20codableConcept/near/233545759\">said</a>:</p>\n<blockquote>\n<p>I'll just say that I'm a bit uncertain about adding a code for 'Uncertain' across the board. :)  It certainly warrants some discussion to determine if that, or something else, is the way we want to address this need (certainly acknowledging that the need to deal with uncertainty is very real).</p>\n</blockquote>\n<p>How is a general \"Uncertain\" different from a general \"Unknown\" og general \"Other\"?</p>",
        "id": 234126261,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1618218505
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>  for the discussion today. <br>\nMy arguments for including Uncertain into NullFlavor is that: <br>\na) although you would usually have some data, it is not enough to appropriatley make a choice of the other available values presented in the value set. So it's not null data, but it is a flavor of Null, which is \"not enough\".  <br>\nb) There are other values on the list that is not strictly No data: TRC -trace [The content is greater than zero, but too small to be quantified.] and  SQ-Sufficient Quantity<br>\nc) Seeing as I was confused by the different code systems with overlapping values, I would be reluctant to create a new code system with \"nullFlavor-related-stuff\",  just for the sake of keeping nullFlavor clean of things with absolutely no data (except from the 2 examples in b). Making the code systems user friendly and easy to find could be a part of the general harmonization. Less likehood of someone choosing the wrong option or making their own stuff because they cannot find what they are looking for.<br>\nd) Uncertain, although not as common as Unknown, is a pretty common value in registry value sets. And registry data capture, transfer and harmoniszation is a superb use case for FHIR (in my view at least). And so, not having it in any of the HL7 code systems, makes implementers create their own local value  - which doesn't help interoperability or standardization. <br>\n[e) To throw in another suggestion: To unify, maybe nil-known should also be in the NullFlavor list?]</p>\n<p>Suggestion for definition: <br>\nUNCERT - Uncertain: There is some data, but not enough to appropriately make a choice of the other available values presented in the value set. It should not be used in the cases where data is unknown,  or the actual value is not a member of the set of permitted data values in which UNK or OTH should be used.</p>",
        "id": 236744349,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1619730061
    },
    {
        "content": "<p>I can certainly see those arguments - but I think that there <strong>might</strong> (and I am <strong>uncertain</strong> about this) be a better way and a better place to do it.  I also would like to know if this use of terminology is related to any use of an HL7 information model (e.g., FHIR or CDA), or if it's entirely independent of any particular information model standard (e.g. HL7, openEHR, etc.).  And, if we do this (or something similar), I would also like to give further consideration as to whether it should be based on the v3 NullFlavor code system/value set or the FHIR data-absent-reason (with the addition of 'uncertain', and any other concepts that are deemed to be \"missing\", to either of them).  I don't think the deciding factor for choosing which one should be only or primarily whether the NullFlavor code system at the present time has more of the needed concepts (for Linn's use case) than data-absent-reason does.  And, finally, I think there still could be some consideration of whether SNOMED CT is or could be appropriate (even though they have tended to want to stay mostly away from this space in the past).</p>",
        "id": 236747764,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1619730902
    },
    {
        "content": "<p>We would use it in FHIR profiling. Since some of the vendors that will be exporting data using these FHIR profiles are based on openEHR, I raised the issue with them, and it turns out they have had the discussion of (and how to) using the NullFlavor code system and the issue of uncertain (see links above). Which for us, where hospitals covering 85% of the population are using an openEHR based EHR, is quite important for standarization.</p>",
        "id": 236755387,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1619734353
    },
    {
        "content": "<p>Is there a way to look at any of the openEHR-related discussion on this?</p>",
        "id": 236759085,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1619736547
    },
    {
        "content": "<p>yes, I posted the link and included it in the email I sent you: \"We have several EHRs that use openEHR, and I’ve been following their discussion around this topic too, as it is similar and also revolves around the use of HL7 code systems: <a href=\"https://openehr.atlassian.net/wiki/spaces/spec/pages/4915211/Null+Flavours+and+Boolean+data+in+openEHR\">https://openehr.atlassian.net/wiki/spaces/spec/pages/4915211/Null+Flavours+and+Boolean+data+in+openEHR</a> and <a href=\"https://discourse.openehr.org/t/uncertain-unknown-and-no-information/1473/3\">https://discourse.openehr.org/t/uncertain-unknown-and-no-information/1473/3</a>\"</p>",
        "id": 236759444,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1619736754
    },
    {
        "content": "<p>Thanks.  I'll look at it.</p>",
        "id": 236759520,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1619736808
    },
    {
        "content": "<p>Is this a Jira yet?<br>\nWhether \"uncertain\" is a null flavor or an assertion of a confidence level depends on the element. In the example given (\"Is the lesion endoscopically complete removed\": Yes, No, Uncertain]) it looks like a null flavor, but it seems to mean \"unknown,\" which we already have. If there were two questions (Y/N and certainty level) then it would be a proper value. (Though certainty level could also be Y/N, or percentile, etc.) (You could also precoordinate 'certainly, pretty sure, probably not, absolutely not' - would \"uncertain\" mean the second one or the third?) We need to distinguish between \"I'm so uncertain I'm not answering\" and \"I'm answering but hedging.\" And if the ask is for the first one, I'd want to understand how it differs from 'unknown.'</p>",
        "id": 236828972,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1619787155
    },
    {
        "content": "<p>I've tried to define it above, but can probably be refined: UNCERT - Uncertain: There is some data, but not enough to appropriately make a choice of the other available values presented in the value set. It should not be used in the cases where data is unknown, or the actual value is not a member of the set of permitted data values in which UNK or OTH should be used.<br>\nIt's an unanswered Jira request from me, I'm not sure if I put it in correctly though. <a href=\"https://jira.hl7.org/browse/HTA-38\">https://jira.hl7.org/browse/HTA-38</a><br>\nI haven't updated it after our conversations, after refining the suggestion I should update it,</p>",
        "id": 236829663,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1619787490
    },
    {
        "content": "<p>OK; you may need to redirect that to -- I saw Patient Care mentioned but if this is for Observation that would be O&amp;O. <br>\nAnd it's still a little fuzzy to me. \"Not enough data to choose among the options\" sounds like unknown, unless there is enough data to specify some other value, in which case it sounds to me like \"other.\" But the lesion example sounded like unk.</p>",
        "id": 236860451,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1619799135
    },
    {
        "content": "<p>In our specific use case, Uncertain is used 2 times in extentions in the Procedure profile, and once in an Observation profile. </p>\n<p>Regarding Uncertain and Unknown: It might theoretically/statistically seem like they overlap, or that Unknown can cover for Uncertain, but when clinical personnel register what they do, it is a difference between Unknown and Uncertain (re. mentally and emotionally). The clinical groups collecting data to registries needs to be able to have these two options to use in their questions, to better reflect the mental process of  what has been evaluated and support what clinicians would like to describe. I've seen it in almost all clinical registries I've worked with. Much less common than Unknown, but for some cases Uncertain is/seems more appropriate, especially for the one doing the registration. If you are trying to remove a polyp, you either have removed it, or you didn't, and in some cases you tried, but have a feeling there might be something left you didn't remove, and would like to capture that (both for the purpose of the registry and for the clinical note itself). It kind-of is unknown, and I agree it could be very subtle differences, but still, it feels different to have e.g 2 choices and you are unsure what is correct (or if what you think might be the case is really right, which I guess would be most of the cases. Usually you lean towards one, but you are not sure enough)) vs. you have no clue.  Uncertainty can also come from conflicting available data.<br>\nI do agree that Uncertain should not be used when Unknown is appropriate, and uncertain-choices should be kept to the minimum. But that is more an implementation-strategy, and a strategy that should be followed by questionnaire and registry-admins. For the few cases where Uncertain is appropriate,  we somehow need to be able to capture it.</p>",
        "id": 236965624,
        "sender_full_name": "Linn Brandt",
        "timestamp": 1619874374
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196665\">@Linn Brandt</span>  In my reading, the results of the openEHR discussions in the links that you posted above (at least at this point) don't seem to add support for adding \"uncertain\" as a \"null flavor\" (in the HL7 v3 or FHIR code systems or otherwise).  I think I agree with Jay's analysis of it, as well.  As Jay said, a lot depends on the data element in question.  </p>\n<p>The v3 NullFlavor and FHIR data-absent-reason code systems are both sets of codes that describe the reason why the requested or otherwise normally expected data for a particular element is absent.  I think what you are asking for is a code that means something like \"the requested or expected data is not provided because it is uncertain what is an appropriate code to choose\" (I don't know if that's the best wording, but it seems reasonably close).  Do you agree that is the (general) idea?</p>\n<p>In the questionnaire type example of \"Is the lesion endoscopically complete removed\", where you are provided a limited set of possible responses and are asked to choose one, if you are uncertain whether the lesion has been completely removed endoscopically, then you are saying \"I don't know if the lesion was endoscopically completely removed\", and \"Unknown\" would be an appropriate choice to represent that.  If, instead, you were dealing with a question or data element with the notion of something like \"What is the diagnosis?\", where you would be expected to choose a code from a much larger value set (most likely with an extensible binding) and you were not able to find a code from that value set that appropriately captured the meaning of the diagnosis that you were trying to represent (note that there <strong>is</strong> a diagnosis that you have in mind, even if you can't find a code to represent it), then in that case you would choose the code for \"Other\", assuming that was available, and then you would describe the diagnosis that you actually have in mind in the data element text (CodeableConcept.text in FHIR, or an equivalent in openEHR or another model), or possibly an extension.  In the case where there was an extensible binding (in the FHIR context) of the data element to the value set, you might also be able to choose a code from different value set (and potentially a different code system) that better represents your intended meaning and use that as the code for the data element.</p>",
        "id": 237001203,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1619903854
    },
    {
        "content": "<p>In regard to <a href=\"https://jira.hl7.org/browse/HTA-38\">https://jira.hl7.org/browse/HTA-38</a>, I agree that the HTA space isn't the right place for this (HTA deals with code systems that are external to HL7).  So for the v3 NullFlavor code system this should be a UTG change proposal (project \"UTG Change Proposals\" - in the 'UP' space).  And if you wanted to suggest a change to the FHIR data-absent-reason code system, that would be a FHIR change request (project \"FHIR Specification Feedback\" and issue type \"Change Request\").  But definitely all of this can be rather confusing.</p>",
        "id": 237002546,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1619904765
    }
]