[
    {
        "content": "<p>I would like to define an extension on ElementDefinition.binding that specifies additional bindings.</p>\n<p>ElementDefinition.binding is the conformance binding: what the validator enforces - and there can only be one. But in addition, designers will be able to specify additional bindings.</p>\n<p>Extension<br>\n  purpose: code - defines how the binding is used<br>\n  usage : UsageContext - defines the contexts in which this binding is used for it's purpose<br>\n  valueSet : canonical(ValueSet)<br>\n  documentation : markdown</p>\n<p>draft set of the codes for purpose property:</p>\n<ul>\n<li>conformance - this value set replaces the overall conformance value set in a particular usage context</li>\n<li>required: this value set is required by (this specification | external regulation) for new records. It's a subset of what is allowed because the full conformance binding allows for legacy records</li>\n<li>recommended: this value set is the list of codes that are recommended for the user to choose from<ul>\n<li>UI: this value set is provided to user look up in a given context* starter: this value set is a good set of codes to start with when designing your system</li>\n</ul>\n</li>\n<li>component: this value set is a component of the base value set (this allows different documentation for different parts of the overall value set, e.g. by code system)</li>\n<li>minimum: systems SHALL support at least this value set (per the definition of must-support)</li>\n<li>maximum: this replaces the existing maxvalue set extension (though the tooling would continue to accept either)</li>\n</ul>\n<p>The IG publisher will publish these additional bindings, but they'll be ignored by the validator.  (for now, though I'd look at enforcing extra conformance value sets if the validator can process the usageContext)</p>\n<p>This would impact on revisions of the current specifications in two ways:</p>\n<ul>\n<li>in a few places we use extensible+max we mostly really want a base value set with a recommended value set </li>\n<li>in a few places we use extensible, and we really want a fairly large base value set with a required - <em>this is what legislation wants for new records</em></li>\n</ul>",
        "id": 270617426,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643922284
    },
    {
        "content": "<p>I don't understand what some of these mean.</p>\n<ul>\n<li>conformance: you can tighten, but you can't replace the base binding if the base binding is 'required' or 'extensible'.  And it would seem this could happen just by tightening the base value set, no need for an extension?</li>\n<li>required - I'd prefer a name of \"new data\".  'required' is a misleading name</li>\n<li>recommended - does this mean we'd ditch the UCUM binding and turn the max binding into the base binding and use this new extension for the UCUM binding?</li>\n<li>component - explain the use-case?</li>\n</ul>\n<p>I'm also not thrilled with the notion of usage context.  Generally, if rules are different for different contexts, then you have different profiles.  If we want to embed context-specific rules inline within a profile, value set isn't the only thing we'd need.  And we'd need to have a way to render the variations.</p>",
        "id": 270618310,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643922698
    },
    {
        "content": "<ul>\n<li>conformance - it would have an invariant that if the purpose = conformance, then you must have a usage context, because it's about being more specific in a specific context</li>\n<li>required - I don't care about the name</li>\n<li>recommended - which UCUM binding, but we'd certainly talk about doing that, yes</li>\n<li>component - this is trying to capture one of the underlying reasons for the oft-repeated question, \"I want multiple bindings\":  I have different value sets and having a combining value set loses information and documentation associated with the multiple value sets </li>\n</ul>\n<p>As for usage context, it's no service to users to have myriad profiles that differ only by usage context and some bindings. Obviously there are scenarios where that's exactly what you should do, but also, there are scenarios where that's exactly what should not do. Agree that we need to render this properly. As for usage context... maybe we want to put a usage context extension on invariants and mappings too, but we don't need to talk about that here</p>",
        "id": 270619872,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643923460
    },
    {
        "content": "<ul>\n<li>conformance - ok.  Your original description didn't say \"more specific\" - which I'm interpreting as \"valid constraint\"</li>\n<li>component - so this would an alternative to slicing coding?  <br>\nusage context - I don't see why value sets would matter, but cardinality, mustSupport, minValue/maxValue, etc. wouldn't.  My leaning would be for us to have a complex extension that allows you to list all of the 'constraint'/documentation elements.  I don't see value in a binding-specific or element-by-element solution.</li>\n</ul>",
        "id": 270646900,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643933086
    },
    {
        "content": "<p>I agree that it looks like this can be a replacement for slicing on CodeableConcept.coding (or on CodeableConcept directly, as in IPS).  Presumably you can specify multiple conformance bindings.  And I assume that in the case of a <strong>preferred</strong> base binding, being a \"valid constraint\" still means that the specified conformance bindings could be, but would not need to be, a subset of or even have any overlap at all with the base binding.  Assuming that's all true, then when can we start using this in IPS?</p>",
        "id": 270663360,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1643945372
    },
    {
        "content": "<p>Will the additional binding also have a binding strength - or will that behavior be fixed based on the value of 'purpose'?  It seems like 'purpose' should be sufficient - and having a binding strength in addition would make it too complex and far more confusing.  But it would be good to be clear about what you have in mind.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>?</p>",
        "id": 270664489,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1643946632
    },
    {
        "content": "<p>We'd have to enforce that the slicing replacement was only allowed on CodeableConcept, not on Coding or code.  (Even if the Coding was x..*, the bindings would all apply to each repetition.)</p>",
        "id": 270664493,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643946636
    },
    {
        "content": "<p>Yes, I think that's correct.  It doesn't seem that having this as an option for use on CodeableConcept.coding would be useful or sensible.  But it could and likely would be used to replace many current instances where slicing on CodeableConcept.coding has been used, by instead using this extension on the CodeableConcept element itself.</p>",
        "id": 270665309,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1643947458
    },
    {
        "content": "<p>I'm not sure about slicing. what are you trying to achieve, and then I'll describe how it might make a difference. if you're wanting to say, 'one code from this value set, and one code from that value set', then this isn't it</p>",
        "id": 270669972,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643952495
    },
    {
        "content": "<p>there's no binding strength, because binding strength is a property of the conformance binding. But maybe there'd need to be a binding strength on the context specific bindings?</p>",
        "id": 270670000,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643952537
    },
    {
        "content": "<p>You can start using this in IPS now, but it won't render. So it would be experimental and I won't start coding it until we have some degree of consensus - not sure how much</p>",
        "id": 270670037,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643952593
    },
    {
        "content": "<blockquote>\n<p>component - so this would an alternative to slicing coding?</p>\n</blockquote>\n<p>that depends what was trying to be done by slicing. Some of what's trying to be done by slicing is convey the alteranative purposes, but sometimes, it's additional conformance rules.</p>\n<blockquote>\n<p>usage context - I don't see why value sets would matter, but cardinality, mustSupport, minValue/maxValue, etc. wouldn't. My leaning would be for us to have a complex extension that allows you to list all of the 'constraint'/documentation elements. I don't see value in a binding-specific or element-by-element solution.</p>\n</blockquote>\n<p>well, that would be a whole lot more difficult to present, and is less common. at least, it would be less common to want to have a single profile that did this rather than being right to have multiple profiles</p>",
        "id": 270670204,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643952733
    },
    {
        "content": "<p>If this isn't \"one code from X, one code from Y\", can you explain what it is?</p>",
        "id": 270671911,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643954652
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Of course we need it to render.  And of course that takes time and effort (hopefully not too much!).  But it's probably worth beginning the experiment with it now.  And I'm not sure if there is a need for binding strength on the context specific bindings - probably that's part of the experiment.</p>",
        "id": 270673349,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1643956292
    },
    {
        "content": "<p>Right. Feel free to experiment,but what are you trying to achieve?</p>",
        "id": 270673403,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643956332
    },
    {
        "content": "<p>Essentially, a choice of terminology bindings on a CodeableConcept element for use in specific contexts.</p>",
        "id": 270711889,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1643980188
    },
    {
        "content": "<p>I'd really like some examples of where we're expecting the 'context' bit to be used.</p>",
        "id": 270725784,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643986793
    },
    {
        "content": "<p>I need some examples. Perhaps IPS based <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 271012379,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644254833
    },
    {
        "content": "<p>As soon as I've created them (planning for the Wed. IPS call) I'll share them.</p>",
        "id": 271013234,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1644255141
    },
    {
        "content": "<p>ok I've added a draft rendering of this in the next IG publisher release, so we can play with it. I added one more feature to the extension:</p>\n<p>any : boolean</p>\n<p>if any = true then the binding only applies to one of the repeats, not all of them</p>",
        "id": 278624460,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649715454
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Where is the extension defined?</p>",
        "id": 278690315,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1649769226
    }
]