[
    {
        "content": "<p>What, in the general case, <em>should</em> happen to those coded items that will be encountered in current real-world poorly-coded EPRs and that fall <strong>outside</strong> the terminology binding for the relevant resource?</p>\n<p>By way of illustration, consider the Condition.code element and its <a href=\"https://www.hl7.org/fhir/valueset-condition-code.html#definition\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-condition-code.html#definition\">current 'example' SNOMED CT binding</a>, which suggests a fairly narrow scope: to only &lt; 404684003 |Clinical finding|. This narrow binding would , however, render invalid some volume of clinically significant coded items that we know to be present in real-world Problem Lists.</p>\n<p><span class=\"user-mention\" data-user-id=\"192077\">@Linda Bird</span> of SNOMED International has previously proposed a somewhat more permissive:</p>\n<div class=\"codehilite\"><pre><span></span>&lt; 404684003 |Clinical finding|\nOR &lt; 413350009 |Finding with explicit context|\nOR &lt; 272379006 |Event|\n</pre></div>\n\n\n<p>..but something like the following would in truth be needed if the Condition.code binding were to cover a fuller gamut of the things that clinicians have empirically already put in their Problem Lists:</p>\n<div class=\"codehilite\"><pre><span></span>&lt; 404684003 |Clinical finding|\nOR &lt; 413350009 |Finding with explicit context|\nOR &lt; 71388002 |Procedure|\nOR &lt; 443938003 |Procedure carried out on subject|\nOR &lt; 439763000 |Procedure on family member|\nOR &lt; 57177007 |Family history with explicit context|\nOR &lt; 272379006 |Event|\nOR &lt; 48176007 |Social context|\n</pre></div>\n\n\n<p>But even <em>that</em> broader binding for Condition.code would still preclude some relatively common but semantically more wildly incorrect miscodes that clinicians are currently permitted - and therefore do - enter through modern-day permissive clinical coding interfaces as the code for the 'problem' before them. For example, codes for pieces of anatomy (e.g for lymphnode) when they <em>really</em> mean an unspecified disorder located at that site (lymphadenopathy); codes for substances (e.g. alcohol) when they <em>really</em> mean disorders caused by their use or exposure (acute alcohol inebriation and/or chronic dependency); codes for forces of nature (high temperature) when they <em>really</em> mean either disorders associated with exposure to those forces (heat stroke) or that the patient are themselves a source of that force (pyrexia).  </p>\n<p>FHIR implementations <em>could</em> choose to allow <strong>all</strong> codes that may currently appear in a Problem List to be uncritically passed as a Condition resource ... but then the terminology binding for Condition.code probably <em>should</em> be &lt; 138875005 |SNOMED CT Concept| (!). Or, they could choose to constrain out at least some of the more major 'category error' miscoding choices by enforcing something in the spirit of one or other of the candidate bindings above, and press their colleagues in primary data capture interface implementations to mirror that constraint for new data capture going forward...but this would still mean that some real world historically <em>already</em> coded Problems could not be passed, except if re-coded by the reluctant clinician or possibly when degraded to text only. </p>\n<p>This line of reasoning led me to wondering: what middle-ground implementation behaviors could more actively support an incremental transition of terminology binding strengths along the presumed trajectory from <code>example</code> (send what you like; here's a clue) to <code>required</code> ( send only from these) ? For example, if <strong>all</strong> codes are to be passed initially whether or not they satisfy a prevailing <code>example</code> terminology binding constraint, would it be helpful if senders could flag those that <em>failed</em> to satisfy it? Is there already a standard mechanism for passing this validation failure information in FHIR? </p>\n<p>The alternative seems to be either (i) the problem list item is not sent (ii) it <strong>is</strong> sent but as text only (Condition.code.coding is not populated) or (iii) its sent as a coded item anyway but the receiver must re-run all semantic validation tests if it cares about the answer, and the sender has no operational reason for running them anyway. The first option is clinically untenable. The second assumes that the code is <strong>never</strong> useful, an assumption that would require clinical sign-off but that can not be proven <em>a priori</em> for the general case. The third option seems a missed opportunity.</p>",
        "id": 153933097,
        "sender_full_name": "Jeremy Rogers",
        "timestamp": 1517260693
    },
    {
        "content": "<p>hi Jeremy. Many issues here. Some comments:<br>\n- this is a big part of reason why these bindings are only ever example bindings (which means: we don't make any rules, but here's the kind of codes we expect to be used)<br>\n- there's also extensible and required bindings. <br>\n- I strongly recommend against required bindings for clinical codes for the reasons you've described<br>\n- even 'extensible bindings' are problematic<br>\n- we also have the concept of 'best practice' bindings - e.g.  'you must use a snomed code' and 'we believe that best practice is a clinical finding'<br>\n- there's no standard way to flag codes that fail some applied terminology criteria (typically, the applied criteria vary as  the content wombles through the clinical eco-system). There is always extensions, of course</p>",
        "id": 153933124,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517265658
    },
    {
        "content": "<p>generally, we say: send all the codes your have (always preserve everything) and when consuming content, use any codes you can.</p>",
        "id": 153933126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517265710
    },
    {
        "content": "<p>as far as I can tell, either you can use a code, or you can't. Whether there's some set of rules that the code is or isn't valid against has no relationship to whether you know how to use it or not</p>",
        "id": 153933129,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517265746
    },
    {
        "content": "<p>Basically this is the age-old question of how to operationalize V3 CWE, or CDA SHOULD, or FHIR Extensible bindings. Graham has provided the pragmatic response that has a lot of \"do the best you can\" in it plus the possibility of implementing receiver warnings based on these \"best practice bindings\" that I need to understand. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> where is this documented? Our Binding Semantics project is still trying to clarify how these \"extensional\" bindings can be conformance tested and what they allow implementers to do. Many would say that it is simply guidance for a future explicit (think required) value set, but I'm pretty sure implementers want the loosey-goosey function of this. We are working on this here:  <a href=\"http://confluence.hl7.org:8090/display/VOC/Vocabulary+Binding+Semantics+%28VBS%29+Project\" target=\"_blank\" title=\"http://confluence.hl7.org:8090/display/VOC/Vocabulary+Binding+Semantics+%28VBS%29+Project\">http://confluence.hl7.org:8090/display/VOC/Vocabulary+Binding+Semantics+%28VBS%29+Project</a></p>",
        "id": 153934373,
        "sender_full_name": "Robert McClure",
        "timestamp": 1517432662
    },
    {
        "content": "<p>I think the best documentation (other than that buried in vocab minutes) is here:</p>",
        "id": 153934401,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517435257
    },
    {
        "content": "<p><a href=\"http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources\">http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources</a></p>",
        "id": 153934402,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517435419
    },
    {
        "content": "<p>though that doesn't have anything to do about best practice, which probably really hasn't landed anywhere yet</p>",
        "id": 153934403,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517435452
    }
]