[
    {
        "content": "<p>I am trying to test out a use case, where I want to see all conditions of a certain type (In this case cognitive function finding). </p>\n<p>From the documentation I can see that something like  GET [base]/Condition?code:below=373930000 should work. I have also tried using the below-modifier, and specifying the system - GET [base]/Condition?code:below=http://snomed.info/sct|373930000 </p>\n<p>However, I have tried several of the public available test-servers, and none of them seems to support the searches, or return empty bundles. (I have checked that Condition-instances that fulfill the search criteria actually exist on the servers).</p>\n<p>Do you know of any test-servers where I can test code-supsumption? Alternative strategies for testing my use case would also be welcome.</p>\n<p>Best regards,<br>\nKirstine</p>",
        "id": 230524355,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1615905955
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span> I show this capability with the <code>:below</code> modifier (typically using the HAPI server) when I do FHIR terminology teaching.  I can send you a query that should show that it works (my HAPI server is being a bit slow right now, though, so I'm verifying that it actually is working first!).</p>",
        "id": 230695962,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1615990160
    },
    {
        "content": "<p>This query shows \"Code in a resource subsumes the specified search code (e.g. is-a* relationship) - below “Diabetes mellitus” (73211009)\":</p>\n<div class=\"codehilite\"><pre><span></span><code>http://fhir.hausamconsulting.com/r4/Condition?code:below=http://snomed.info/sct%7C73211009\n</code></pre></div>\n<p>The data currently on the server seems a little odd (and it isn't all being returned?), but I think you can see that it works.</p>",
        "id": 230699098,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1615991335
    },
    {
        "content": "<p>The server does seem to be responding rather slowly (I'll try to look into that) - so you may need to be patient. :)</p>",
        "id": 230699307,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1615991417
    }
]