[
    {
        "content": "<p>Does anyone have any opinion on <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16035\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16035\">GF#16035</a>? Expansions do not include definitions or comments in the publication because they are not in the value set expansion</p>",
        "id": 153979518,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532976413
    },
    {
        "content": "<p>Clients don't request value set expansions blindly. Surely there has to be an assumption that they have some prior knowledge of the definition and purpose of what they're requesting in the same way that an OOP developer needs to understand a class before instantiating it.  However, I can see the value in displaying comments to end users who are selecting concepts from a value set if the descriptions require further explanations.</p>",
        "id": 153979557,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1532982765
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I'm not sure if I understand exactly what you just said, but the question seems to come to what should be included in the default rendering of value set expansions.  I don't know if it actually needs to be more than code and display generally, although the definition information is certainly useful to have in many cases.  In V2 that is being carried in Comment/Usage Note, so if we keep the Definition column in the V2 rendering (I assume it's probably not standards family specific) then I think it would make sense to have that information included (having a consistently empty Definition column doesn't make much sense).</p>",
        "id": 153979559,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1532982872
    },
    {
        "content": "<p>what I'm saying is that the publication of an expansion doesn't include the definition of the concept because the definition of the concept is not in the expansion according to the spce</p>",
        "id": 153979571,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532986656
    },
    {
        "content": "<p>Right.  It sounds like the reasonable thing to do is remove the Definitions column from the expansion rendering.</p>",
        "id": 153979577,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1532988853
    },
    {
        "content": "<p>oh. I am providing definitions. I'll go back and re-evaluate the task.</p>",
        "id": 153979586,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532990389
    },
    {
        "content": "<p>We're currently working on what an expansion should and could be in the VSE project. I think we are in general agreement that code id, code system id, code system version, description are required when available, anything else would be defined by either the $expand parameters used, or default server behavior.</p>",
        "id": 153979705,
        "sender_full_name": "Robert McClure",
        "timestamp": 1533046956
    },
    {
        "content": "<p>so I'm looking at <a href=\"http://build.fhir.org/v2/0078/index.html\" target=\"_blank\" title=\"http://build.fhir.org/v2/0078/index.html\">http://build.fhir.org/v2/0078/index.html</a> - I see some small rendering issues but I don't see any information that might be present that is not present</p>",
        "id": 153983458,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533688840
    },
    {
        "content": "<p>The v2 source includes &lt;p&gt; in the source of the comments. Is this supposed to be understood as html?</p>",
        "id": 153983459,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533689254
    },
    {
        "content": "<p>Presumably that's the case (that's it's html) - <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> should be able to clarify.</p>",
        "id": 153983646,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1533735690
    }
]