[
    {
        "content": "<p>We agree to compare VSD status and ValueSet.status for <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16431\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16431\">GF#16431</a>:</p>\n<ul>\n<li>Preliminary: State during which time the Value Set Definition version is being drafted and is not available for use. The element Workflow Status will carry additional information regarding pre-Active state.</li>\n<li>Active: State during which the Value Set Definition version is available for use. The Activity Status Date associated with this status is known as the “Effective Date”. </li>\n<li>Inactive: State indicating that the Value Set Definition version is no longer available for use in creating new content. The Activity Status Date associated with this status is known as the “Expiration Date”.</li>\n<li>Deleted: State intended to be used to remove a Value Set Definition from use and view in a repository and is only possible if the Value Set was never Active (i.e., can only transition from Preliminary).</li>\n</ul>\n<p>Existing status (common to all conformance resources):</p>\n<ul>\n<li>draft Draft   This resource is still under development and is not yet considered to be ready for normal use.  ~draft</li>\n<li>active    Active  This resource is ready for normal use.  ~active</li>\n<li>retired   Retired This resource has been withdrawn or superseded and should no longer be used.    ~inactive</li>\n<li>unknown   Unknown The authoring system does not know which of the status values currently applies for this resource. Note: This concept is not to be used for \"other\" - one of the listed statuses is presumed to apply, it's just not known which one.</li>\n</ul>\n<p>Comments:</p>\n<ul>\n<li>unknown has no equivalent in VSD, but since VSD makes it a required element, VSD might need it</li>\n<li>draft = Preliminary - definitions seem functionally equivalent to me</li>\n<li>active = Active - definitions seem functionally equivalent to me</li>\n<li>retired = inactive - definitions are different in as much as the definition includes 'creating new content'. I think that the VSD is wrong on this, because it relates to assumptions outside the workflow of the individual resource and what it means to replace it or not. FHIR has a take on this which is thoroughly discussed and common across all the conformance resources. So I don't want to change the general FHIR definition</li>\n<li>deleted -&gt; inactive - the definition of this in VSD is related to the assumptions built into the previous one, so same comments.</li>\n</ul>\n<p>It's hard to comment about the comments that are part of the definition, because of the common sharing of status elements in FHIR. I reviewed them and there's no consistent mapping between the resources and the elements for several reasons.</p>\n<p>So I don't see any solid candidate for change. <span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span></p>",
        "id": 153978569,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532657250
    },
    {
        "content": "<p>The problem with \"has been withdrawn or superseded and should no longer be used\" is that even though the version marked \"INACTIVE\" is not to be used <em>for new content creation</em> because there is a newer version available, the INACTIVE version can still be used to generate expansions that were in use when it was ACTIVE for comparisons, data retrieval, and legal reasons. So yes, it can be used for those reasons.</p>\n<p>I'm not sure what your point is about DELETED. It's valid and not obviously not the same as INACTIVE</p>",
        "id": 153979172,
        "sender_full_name": "Robert McClure",
        "timestamp": 1532890338
    },
    {
        "content": "<p>So you can't generate an expansion for comparison purposes etc on a deleted value set?</p>",
        "id": 153979175,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532890937
    },
    {
        "content": "<p>Practically, Active = Published and available for use (hence the definition.) So a deleted version would not have been available for use. The only entities that could do an expansion based on it would be server dependent based on allowed access to never active, pre-publication content. So for some, yes, they could do a compare, but the expectation is that it's not a value set non-authors could find.</p>",
        "id": 153979178,
        "sender_full_name": "Robert McClure",
        "timestamp": 1532891266
    },
    {
        "content": "<p>ok so my comment about deleted was wrong; it corresponds to actually being deleted in FHIR, so we don't have a status for that.</p>",
        "id": 153979183,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532892885
    }
]