[
    {
        "content": "<p>It has been brought to my attention that there are some OIDS identified in some core FHIR valueSets and codeSystems that are not within the HL7 OID registry. These OIDs were assigned during version 1(ish) of FHIR.</p>",
        "id": 245490199,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625860758
    },
    {
        "content": "<p>for example <a href=\"http://build.fhir.org/valueset-provenance-entity-role.html\">http://build.fhir.org/valueset-provenance-entity-role.html</a><br>\nhas OID  2.16.840.1.113883.4.642.3.436<br>\nand I am told that is not in the HL7 OID registry</p>",
        "id": 245490347,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625860814
    },
    {
        "content": "<p>Question 1: Should it be in the HL7 OID registry?</p>",
        "id": 245490392,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625860833
    },
    {
        "content": "<p>Question 2: presume I am not unique and there is likely many... could this be addressed with tooling?</p>",
        "id": 245490443,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625860858
    },
    {
        "content": "<p>Question 3: Given that these are CodeSystems and ValueSets specific to FHIR.... should the OID just be removed from the CodeSystem or ValueSet as the canonical URI is mandated to be used, and OIDs are considered the devil's doing.</p>",
        "id": 245490547,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625860910
    },
    {
        "content": "<p>re: <a href=\"https://jira.hl7.org/browse/FHIR-26398\">https://jira.hl7.org/browse/FHIR-26398</a></p>",
        "id": 245490624,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625860932
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 245491816,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625861542
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> THis has come up elsewhere and I don't think we have crafted a specific response. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> this is not a Graham question as this is not something he get's to control, but he can give his opinion ;-) The registry is actually controlled by HQ, so perhaps TSC. It should be managed by vocab. I'll say this, it would be crazy to assume that every OID used in a FHIR artifact, let alone even every HL7 balloted artifact, to be in the OID registry. There are thousands of VSAC OIDs and essentially none of the ones created there would be in the registry. Similarly I don't think it should even have all the code system OIDs. The OID registry should be for OIDs <em>you get from the registry</em> and perhaps others, but no rule. If you want to find all the code system OIDs in FHIR artifacts, we need support that via some sort of report.</p>",
        "id": 246019478,
        "sender_full_name": "Robert McClure",
        "timestamp": 1626296339
    },
    {
        "content": "<p>I would be happy to reassign that jira ticke to TSC.</p>",
        "id": 246019939,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626296466
    },
    {
        "content": "<p>Grahame generally writes the tooling that spits this out and would make it happen, if was going to.  Code = control to a large extent :)  (Not that someone else couldn't try t write it if they really wanted.)  Someone could also choose to take on doing it by hand, but I don't think that's terribly realistic (and would be quite error-prone).</p>\n<p>I think one of the question is \"at what point should OIDs belonging to FHIR artifacts propagate into the registry?\"  Not all code systems we define in the core spec are expected to remain for long.  Some of them are for low maturity resources and are expected to migrate to THO before they hit FMM3.  Also, lots of things can happen between releases that end up not appearing in an 'official' release.  I think we should be cautious about propagating <em>everything</em> to the OID registry.</p>",
        "id": 246029689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626301349
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Are you saying there is code that checks to see if an OID for something in FHIR <em>must</em> be in the HL7 OID registry? Why in the world would it do that??</p>",
        "id": 246108216,
        "sender_full_name": "Robert McClure",
        "timestamp": 1626361786
    },
    {
        "content": "<p>FHIR creates OIDs automatically when new code systems and value sets are defined.  If we want those OIDs to propagate to the registry - along with the associated metadata (which may change), it makes sense to do that in an automated fashion too.  Certainly we can't count on authors of FHIR code systems or value sets submitting manual registration requests.</p>",
        "id": 246110938,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626362956
    },
    {
        "content": "<p>I don't see a reason to do that but could be convinced if the reason exists. I'm confident that all the OIDs created in support of HL7 IGs <em>are not in the HL7 OID registry and never will be</em> so am not sure why we'd do something to stick those \"created by FHIR\" (what is that supposed to actually mean?) into the registry. If we want the list of OIDs in IG, let's make a report.</p>",
        "id": 246137720,
        "sender_full_name": "Robert McClure",
        "timestamp": 1626374495
    },
    {
        "content": "<p>They're not in the OID registry now.  I believe the request was to make them show up  there.  If we want them to show up there, it'll need a tooling solution.  If we don't want them there, then no action needs to be taken</p>",
        "id": 246236396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626448288
    }
]