[
    {
        "content": "<p>Has a FHIR system URI been published for HCPCS codes (<a href=\"http://oid-info.com/get/2.16.840.1.113883.6.285\" target=\"_blank\" title=\"http://oid-info.com/get/2.16.840.1.113883.6.285\">http://oid-info.com/get/2.16.840.1.113883.6.285</a>)?</p>",
        "id": 153926106,
        "sender_full_name": "David Teirney",
        "timestamp": 1513652133
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191709\">@David Teirney</span> It doesn't appear that we have so far, but I assume that we should.  I don't know what the url should be, but we can figure that out.</p>",
        "id": 153929237,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1516203115
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> any thoughts on when there might be some movement on what the FHIR HCPCS system URL should be?</p>",
        "id": 153942354,
        "sender_full_name": "David Teirney",
        "timestamp": 1520245336
    },
    {
        "content": "<p>Thanks for the reminder, David.  I haven't heard of any further progress on this, but we should make some.  Let's propose a url to use (you're welcome to suggest one, if you like) and let's see if we can get it included before the deadline this Sunday.</p>",
        "id": 153942677,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520398531
    },
    {
        "content": "<p>Sorry for responding to an old thread, was a URL ever selected for HCPCS?  I don't see any references on the terminology page.</p>",
        "id": 171559744,
        "sender_full_name": "Travis Bean",
        "timestamp": 1563917481
    },
    {
        "content": "<p>It's kind of long, but this has the benefit of actually resolving to the release page for the system: <a href=\"https://www.cms.gov/Medicare/Coding/HCPCSReleaseCodeSets/\" target=\"_blank\" title=\"https://www.cms.gov/Medicare/Coding/HCPCSReleaseCodeSets/\">https://www.cms.gov/Medicare/Coding/HCPCSReleaseCodeSets/</a></p>",
        "id": 171729538,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1564090380
    },
    {
        "content": "<p>I think we could go with something like that (but it doesn't seem particularly \"canonical\").  Or we can think about creating a <a href=\"http://terminology.hl7.org\" target=\"_blank\" title=\"http://terminology.hl7.org\">terminology.hl7.org</a> url, which we have done in a lot of cases.  Unless there would be some way to encourage and convince CMS to create a simple and stable canonical url, which (if it was possible) would be ideal.</p>",
        "id": 171742695,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564107605
    },
    {
        "content": "<p>It's the plural in that URI that bothers me -- this is supposed to identify a single CodeSystem.</p>",
        "id": 171747095,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1564115937
    },
    {
        "content": "<p>Agree.</p>",
        "id": 171763699,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564137582
    },
    {
        "content": "<p>It is the responsibility of HTA to define a process for this. Not sure where the url that Bryn came from but we need to put a stop to randomly making these up if that did not come from CMS as their decision. I understand there could be time pressure for this sort of stuff. I'll reference this thread to HTA. Until they chime in, please be cautious about deciding this is resolved. I encourage anyone with questions like this to send them to <a href=\"mailto:termauth@lists.hl7.org\" title=\"mailto:termauth@lists.hl7.org\">termauth@lists.hl7.org</a></p>",
        "id": 171947324,
        "sender_full_name": "Robert McClure",
        "timestamp": 1564408622
    },
    {
        "content": "<p>we shouldn't randomly make them up but we should also reserve the right to do that if the relevant party is non responsive</p>",
        "id": 171947464,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564408697
    },
    {
        "content": "<p>The relevant party is HTA and it should be responsive.</p>",
        "id": 171947508,
        "sender_full_name": "Robert McClure",
        "timestamp": 1564408724
    },
    {
        "content": "<p>Of course, the most relevant party for HCPCS is CMS, but as far as I know we don't expect their involvement.  If HTA agrees this is their task (and that is also generally understood), that's next.</p>",
        "id": 171948287,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564409254
    },
    {
        "content": "<p>TSC has clarified that this is HTA responsibility. This clarification is new information to HTA so it will take a bit of time to work out all the process requirements. While you are correct that CMS is the terminology Authority, HTA is the entity responsible for getting the canonical uri. So it <strong>is</strong> the relevant entity.</p>",
        "id": 171948792,
        "sender_full_name": "Robert McClure",
        "timestamp": 1564409563
    },
    {
        "content": "<p>At the September WGM, HTA will be producing a policy for this, based on \"graceful degredation\" - i.e. from the best (code system owner manages and publishes a canonical URL) through to the worst (code system owner is totally non-responsive).</p>",
        "id": 173557615,
        "sender_full_name": "Julie James",
        "timestamp": 1566232157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> Is the HTA going to take on the task of engaging with the relevant owners?  And can we commit to providing a URL in a \"reasonable\" timeframe (i.e. 6 months or less)?</p>",
        "id": 173648471,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566299809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> The HTA is going to develop the policy that WGs should follow to engage with code system owners as necessary, including some supporting material (e.g. draft letter to explain and hopefully make clear what the \"ask\" is), for those code systems that are not already documented on the HTA pages.  And to get the WGs to provide content to update those pages so that others can re-use the information.  But the HTA will not be taking over the role of WG Vocabulary Facilitators :) <br>\nPart of the policy with its \"graceful degredation\" will be to give guidance as to \"reasonable\" timeframes for responses etc. and next steps to take.</p>\n<p>It would be very helpful if you could point me to where exactly what the \"ask\" is, clearly documented with examples.  It seems, particularly for the provision of \"canonical URLs\",  that term is sadly not canonical, as it means many things to many people.</p>",
        "id": 173649420,
        "sender_full_name": "Julie James",
        "timestamp": 1566300892
    },
    {
        "content": "<p>My recommendation would be to actually avoid engaging with any terminology authors that HL7 doesn't already have good quality relationships with and who are likely to understand what it is we're trying to do.  Expending a bunch of energy to get an authority-assigned URL rather than issuing an SID within the HL7 namespace doesn't make much sense - especially if we don't expect the organization to understand/care about the ramifications of changing their website organization going forward.  The HTA's responsibilities should be:<br>\n1. determining whether the owner of a code system is one of the few organizations with which we have a sufficiently strong relationship (and which have a terminologically aware web policy) that it makes sense to reach out to;<br>\n2. verifying the determination of the Vocabulary facilitator that the proposed code system is indeed 'new' and in need of a new URL<br>\n3. vetting proposed SIDs in the HL7 namespace to ensure they meet the criteria of short, descriptive, non-confusing<br>\nAnd either of the latter two could actually be delegated to the Vocabulary WG if desired</p>",
        "id": 173659861,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566309344
    },
    {
        "content": "<p>The benefit of an HL7-assigned SID is that we can update the metadata (via NamingSystem) to point to any organization-defined website needed as websites get refactored.  It also means that we can ensure that URLs are version-independent, stable and nor horribly long and ugly.</p>",
        "id": 173660000,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566309434
    },
    {
        "content": "<p>I'm quite sympathetic to this position, but it would be very easy to always classify all orgs as \"difficult\" by default, and then end up misunderstanding the ins and outs of their code system(s) leading to mis-application of HL7's own rules.</p>",
        "id": 173777996,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1566379825
    },
    {
        "content": "<p>There's certainly a need to understand the ins and outs of the code system.  Engaging with them on that level makes good sense.  The issue is more about who should create/manage the CodeSystem canonical URL.  For that, we need to worry more about whether the organization understands/cares about HL7's processes and needs more than what we understand about the code system.  To properly issue a URL, all HL7 needs is a proper understanding of the boundaries of the code system namespace.</p>",
        "id": 173787984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566389973
    },
    {
        "content": "<p>If the terminology organization doesn't genuinely understand the purpose of the URL and the essentialness of keeping it unchanged (and short and simple) once established, they shouldn't be issuing it.  We can (and have) created URLs for lots of code systems without capturing any guidance about their use as part of the specification.</p>",
        "id": 173788102,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566390067
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> but with a clarifying caveat: we are defining  a canonical URL to be used in the context of HL7 specifications. Yes, it can be used elsewhere but we need to be clear this is OUR identifier for the code system and is not meant to be more then that because we do not have the authority to do any more. Based on that I think we should consider<em>always</em> using NamingSystem unless we get a <em>well formed for our needs</em> canonical url from the TA.</p>",
        "id": 173794425,
        "sender_full_name": "Robert McClure",
        "timestamp": 1566394695
    },
    {
        "content": "<p>I think that can work.  But for consistency, we maybe should (as our own best practice) always create a NamingSystem resource instance in every case, regardless of whether the code system owner gives us a \"good\" canonical url or not.</p>",
        "id": 173795774,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1566395588
    }
]