[
    {
        "content": "<p>I'm not sure if this is the right place to ask, but seems closer to terminology than anything else.  I'm working on some CDS for which we need to capture \"elevated blood pressure\" as inclusion criteria.  I've been asked to make use of the following codes:</p>\n<ul>\n<li>ICD-10-CM R03.0 \"Elevated blood-pressure reading, without diagnosis of hypertension\"</li>\n<li>SNOMED-CT 24184005 \"Finding of increased blood pressure (finding)\"</li>\n<li>SNOMED-CT 371622005 \"Elevated blood pressure reading without diagnosis of hypertension (situation)\"</li>\n</ul>\n<p>How/where would you expect to find these codes in FHIR data?  Would they be in a <code>Condition</code> (as the <code>code</code>), in a BP panel <code>Observation</code> (as an <code>interpretation</code>), <code>Encounter.reasonCode</code>, somewhere else?  What's the right use of these?</p>",
        "id": 250407677,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1629750846
    },
    {
        "content": "<p>The value sets these came from indicate the following clinical focus: \"The purpose of this value set is to represent concepts for diagnoses of elevated blood pressure or hypertension.\"  Normally I would think of <em>diagnosis</em> as being a <em>Condition</em>, but I'm not convinced this is actually correct in this case.  I just need someone smarter than me to confirm one way or the other. ;-)</p>",
        "id": 250408034,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1629751065
    },
    {
        "content": "<p>I think this is a case of getting lots of opinions, but for me, Condition | Observation | Condition. </p>\n<p>However in practice, it's common to see clinical users mixing diagnoses and observations, as generally, specific observations lead automatically to obvious diagnoses, or specific diagnoses imply necessary observations (same thing happens with medications). So I would never assume anything with consuming Observations and Conditions</p>",
        "id": 250408151,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629751100
    },
    {
        "content": "<p>are you composing e.g. CQL that's supposed to match existing data (reflecting some clinic's coding practice)?</p>",
        "id": 250408263,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1629751153
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - for SCT 24184005, which you said you'd personally associate to Observation, would that be an Observation.interpretation, or are you suggesting as the Observation.code (and in that case, what value)?</p>",
        "id": 250408433,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1629751232
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191452\">@Eric Prud'hommeaux</span> - yes, CQL -- but as a general case to be shared in a public repo (not with any specific clinic in mind).  This is CQL that was originally piloted a few years ago.  We're now updating it based on minor changes in the USPSTF recommendation it was based on -- but cannot pilot it again at this time.</p>",
        "id": 250408706,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1629751378
    },
    {
        "content": "<p>good question. I think Observation.code with value = true | false, but it's a definitely not an obvious call.</p>",
        "id": 250410265,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629752140
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> (and others) -- I'm doing this for DSTU2 and R4.  DSTU2 Observation apparently doesn't have <code>valueBoolean</code> so... I'm guessing maybe <code>valueCodeableConcept</code> instead?  If so, any thoughts on the right code to indicate the finding of elevated BP?  Some candidates:</p>\n<ul>\n<li>SCT 10828004 \"Positive (qualifier value)\"</li>\n<li>SCT 260373001 \"Detected (qualifier value)\"</li>\n<li>SCT 52101004 \"Present (qualifier value)\"</li>\n<li>SCT 260411009 \"Presence findings (qualifier value)\"</li>\n<li>SCT 373066001 \"Yes (qualifier value)\"</li>\n</ul>\n<p>Or something else?</p>",
        "id": 250533904,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1629832432
    },
    {
        "content": "<p>oh I expected that you'd use <a href=\"http://hl7.org/fhir/DSTU2/valueset-example-yesnodontknow.html\">http://hl7.org/fhir/DSTU2/valueset-example-yesnodontknow.html</a></p>",
        "id": 250534314,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629832607
    },
    {
        "content": "<p>Oh, right.  Perfect.  Thank you.</p>",
        "id": 250534430,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1629832665
    },
    {
        "content": "<p>Elevated blood pressure is a finding. There is no resource for a finding that is represented by a single code. An Observation is a post-coordinated finding comprised of two codes: an observable or procedure and a result. There is no resource specifically for a precoordinated finding like “finding of increased blood pressure”. Condition is only appropriate for diagnoses like hypertension. FHIR lacks a monovalued finding. 🤭🤔😢</p>",
        "id": 253908330,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1632016403
    },
    {
        "content": "<p>Actually, you can send \"Hypertension?\" as a code and present/found/true/etc. as a code.  You can also send \"Finding\" as a code and \"Hypertension\" as a value.  There's a whole section in Observation about exactly this <a href=\"https://build.fhir.org/observation.html#code-interop\">here</a>.</p>",
        "id": 253909162,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632017387
    },
    {
        "content": "<p>fwiw: an elevated blood pressure isn't always \"hypertension.\"  Suggest using instead a coded concept indicating elevated B/P such as SNOMED CT Finding of increased blood pressure (finding) SCTID: 24184005</p>",
        "id": 254054085,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1632146406
    }
]