[
    {
        "content": "<p>In a context of underdeveloped HIT communities, various terminology resources still remain in the paper-based age, their official/recognized uris look like a dream.</p>",
        "id": 215930082,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1604721273
    },
    {
        "content": "<p>So I'm confused about how to select uris for them, I mean those national/regional ones.</p>",
        "id": 215930195,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1604721416
    },
    {
        "content": "<p>Use a NamingSystem resource for this?</p>",
        "id": 215948462,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1604744685
    },
    {
        "content": "<p>My understanding is that the uris do not have to resolve, they act as a unique identifier for the code systems</p>",
        "id": 215952716,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604751941
    },
    {
        "content": "<p>that means that as long as the uri is unique in your jurisdiction/domain, you are good.</p>",
        "id": 215952777,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604751980
    },
    {
        "content": "<p>Yeah, I agree.  But consensus would be needed to avoid proliferation of various URIs.</p>",
        "id": 215954447,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1604754915
    },
    {
        "content": "<p>Yes.  This is a governance issue for each country/region.  You have to agree on a process to agree on and register URIs for 'common public identifiers' - license numbers, national and regional patient ids, etc.  - any identifier that could conceivably be captured in lots of independent systems outside the scope of the organization that defined the identifier.  NamingSystem gives you a way to computably share those definitions and stick them in a registry, but you still need a process of deciding and agreeing what they're going to be.</p>",
        "id": 215972062,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604781055
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Appreciate it so much!  It resolved my concern.</p>",
        "id": 215983657,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1604800275
    }
]