[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> an HTA related question. If a value set excludes codes from a code system, does it need to make any copyright statement concerning that code system?  I think that the answer might be <strong>no</strong></p>",
        "id": 207106221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597638710
    },
    {
        "content": "<p>how about a concept map? If a concept map maps from an HL7 code system to e.g. SNOMED CT, does it need a SNOMED CT copyright statement? I think that the answer should be <strong>yes</strong></p>",
        "id": 207106283,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597638790
    },
    {
        "content": "<p>Sorry, not sure if I am clear.  Are you asking....\"Value set X contains n concepts from Code System A and n concepts from Code System B (defined however one likes in VSD) but no concepts from Code System C\".  Does there need to be a copyright statement for Code System C?  If so 1) why would one specify a value set definition in that way 2) is it even possible to do so (bearing in mind how horrendous negation still is to do) 3) do you have any live examples of this because they may need looking at.  So my (rather than HTA) advice would be a) don't do it unless you have to (KISS principle) and b) if you must mention a code system negatively (i.e. with a don't use statement) then I don't think it needs a copyright statement.  But I can ask the full HTA also.</p>",
        "id": 207118751,
        "sender_full_name": "Julie James",
        "timestamp": 1597653425
    },
    {
        "content": "<p>If you are doing a concept map, then you are USING the code system content.  So yes, it needs a copyright statement.</p>",
        "id": 207118774,
        "sender_full_name": "Julie James",
        "timestamp": 1597653454
    },
    {
        "content": "<p>a value set can explicitly exclude codes from a code system. Typically, you do this in 2 cases:</p>\n<ul>\n<li>you are including a heirarchy from a code system, and excluding some specific codes in the heirarchy</li>\n</ul>\n<p>or </p>\n<ul>\n<li>you are importing a value set that includes codes from a code system, and you are specifically excluding some of the codes</li>\n</ul>",
        "id": 207121306,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597655297
    },
    {
        "content": "<p>Does the copyright statement relate to <em>use of the codes in the specific terminology artifact</em> (ValueSet / ConceptMap) or to <em>users of the specific terminology artifact</em> (eg the expansion, translation, lookup, etc)?</p>",
        "id": 207220903,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1597722544
    },
    {
        "content": "<p>both aspects are in play and they're not quite the same</p>",
        "id": 207222587,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597725147
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> A value set can only <em>exclude</em> codes from a code system if it has already previously <em>included</em> codes from that code system.  The inclusion would mandate the copyright statement.  The exclusion is just a filter and shouldn't impose any additional expectations I think.</p>",
        "id": 207785460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598207515
    },
    {
        "content": "<blockquote>\n<p>A value set can only exclude codes from a code system if it has already previously included codes from that code system</p>\n</blockquote>\n<p>not necessarily true. If you have imported value sets, you might just be ensuring that future versions of them don't do that</p>",
        "id": 207791545,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598217004
    },
    {
        "content": "<p>So you'd exclude specific codes on the off chance that they might in the future be added to a future version of the value set?  How would you have a clue which ones you might want to exclude?</p>",
        "id": 207804588,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598239955
    },
    {
        "content": "<p>you'd be excluding entire terminologies. Actually, this is already a feature where you are importing value sets that include multiple terminologies and you don't want all the choices</p>",
        "id": 207805546,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598241761
    }
]