[
    {
        "content": "<p>Does anyone have experience with profiling (or instantiating) the CodeSystem resource to WHO foundation, WHO linearization or ICD-11 mms specifically? I have been reading the ICD-11 content model guide: <a href=\"https://icd.who.int/icdapi/docs/ContentModelGuide.pdf\">https://icd.who.int/icdapi/docs/ContentModelGuide.pdf</a> and think it could be great if there were a reccomended implementation of WHO foundation and WHO linearizations as CodeSystems (Which would then include ICD-11 mms). For example, I am not completely sure whether it would be best to implement an ICD-11 \"inclusion\" as a property or a designation (but would probably go with property)? Whether the relationship between a linearization and a foundation concept, should be represented as a property in the linearization-profile, or represented as a separate ConceptMap (but would probably go with ConceptMap)? I don't know if these are the best examples, my point is just that there is a risk of ambigiuos implementations of the new WHO family of code systems, that many are obligated to implement. All examples, experiences or other thought are welcome. Maybe you have some thoughts <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> and <span class=\"user-mention\" data-user-id=\"192129\">@Daniel Karlsson</span>  ?</p>",
        "id": 265565355,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1640008439
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span> These sound like good thoughts and suggestions.  I haven't personally done anything with this (yet), but I do agree that it is going to be needed.</p>",
        "id": 265593071,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1640021505
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span>?</p>",
        "id": 265617907,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1640035744
    },
    {
        "content": "<p>flagging for <span class=\"user-mention\" data-user-id=\"193544\">@Jonathan Payne</span>  and <span class=\"user-mention\" data-user-id=\"340886\">@Joe Amlung</span>  - is this already on your list for the ICD team?</p>",
        "id": 266945748,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1641395022
    },
    {
        "content": "<p>I think this is already done - we just have to publish the details once we get some licensing stuff aligned with WHO (Robert Jakub)</p>",
        "id": 267959048,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1642125751
    },
    {
        "content": "<p>Is there a case for implementing the ICD-11 Foundation as a CodeSystem and the linearizations as ValueSets? As all of the properties, attributes, pre and post coordination and linearization details sit at that level, this might be a simpler and more logical implementation, rather than having multiple CodeSystem resources with concept maps between them.</p>",
        "id": 268214272,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1642377180
    },
    {
        "content": "<p>the linearizations assign codes to combinations of the foundation concepts, and are treated like code systems in their own right</p>",
        "id": 268214342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1642377261
    },
    {
        "content": "<p>So far, I've only found and downloaded a beta version of the MMS Linearization and will be interested to compare the limited information (much of it UI-related) that contains about each entity with what is/will be available in the Foundation data. I suspect (although this is just speculation on my part) that it won't be possible to obtain all the properties for Code System $lookups from just a linearization.  </p>\n<p>Interesting, all 5,112 concepts in the MMS Linearization file that I have that don't contain a Foundation URI have either 'unspecified' or 'other' suffixes to the Entity URI.</p>",
        "id": 268215179,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1642378419
    },
    {
        "content": "<p>Thanks for sharing status of current work, and other suggestions. I would agree with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> that  linearization are best treated as CodeSystems, though <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>'s suggestion have given me food for thought. I would be very interested in seeing your current work, as soon as WHO allows it - is there a way to keep myself updated? (so that you don't have to be bothered by me writing here every other week :-)</p>",
        "id": 268712780,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1642693835
    },
    {
        "content": "<p>From the ICD-11 Content Model Guide referenced above...</p>\n<p>3.5 Linearizations<br>\nA linearization is a constrained subset of the Foundation Component, which serves a particular purpose.</p>\n<p>While it's easy to latch on to a simple statement from a complex guide, there are some interesting conundrums here - e.g.. the codes (as opposed to entity identifiers) are in the linearizations yet post-coordination requires using codes from outside the linearization.  Are there any other examples of code systems (if we are to treat linearizations as such) that depend on, and utilise, concepts held in another code system?</p>",
        "id": 268769338,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1642718898
    },
    {
        "content": "<p>LOINC -- It uses UCUM codes for some properties</p>",
        "id": 268776974,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1642723883
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191343\">Michael Lawley</span> <a href=\"#narrow/stream/179202-terminology/topic/ICD-11.20code.20system.20profile/near/268776974\">said</a>:</p>\n<blockquote>\n<p>LOINC -- It uses UCUM codes for some properties</p>\n</blockquote>\n<p>OK - but properties not concepts and not sure if that's implemented with explicit references to UCUM...<br>\n<a href=\"https://loinc.org/forums/topic/ucum-codes-and-loinc-properties/\">https://loinc.org/forums/topic/ucum-codes-and-loinc-properties/</a></p>\n<p>Is this a good analogy to ICD-11 <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> ?</p>",
        "id": 268887456,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1642791301
    },
    {
        "content": "<p>Conceptually <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  is right.  The \"EXAMPLE_UCUM_UNITS\" property (field in the LOINC Table) uses UCUM codes as the values. (See <a href=\"https://loinc.org/kb/users-guide/loinc-database-structure/\">https://loinc.org/kb/users-guide/loinc-database-structure/</a>) However, Regenstrief hasn't quite gotten to adding that property to into the canonical FHIR CodeSystem representation of LOINC just yet. <a href=\"https://loinc.org/fhir/loinc.xml\">https://loinc.org/fhir/loinc.xml</a></p>",
        "id": 269286245,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1643129599
    }
]