[
    {
        "content": "<p>Can anyone share any experience with creating new ICD codes?  Anyone have experience?</p>",
        "id": 154026837,
        "sender_full_name": "Geoff Low",
        "timestamp": 1545345659
    },
    {
        "content": "<p>As far as I know only NCHS creates new ICD-10-CM codes - and WHO creates the \"base\" ICD-10 codes.</p>",
        "id": 154026870,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1545361537
    },
    {
        "content": "<p>Do they release new codes for ICD-10, or is everything now focused on ICD-11?</p>",
        "id": 154026875,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545363248
    },
    {
        "content": "<p>it looks like ICD-10 2016 is the latest - not certain if more are planned (or not)<br>\nICD-10-CM (US) continues to be released yearly - the 2019 version is for use from October 1, 2018 through September 30, 2019</p>",
        "id": 154026876,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1545363512
    },
    {
        "content": "<p>I think the case the people I'm talking to is for adding a term for Castleman's Disease - it has its own code in ICD-10, but has been lumped  in with with a bunch of other lymphoproliferative disorders in ICD-11 (and given that ICD-10 is not used outside the US, it's a problem).  I assumed these people had done their due diligence, but there's a link on <a href=\"https://icd.who.int/dev11/l-m/en\" target=\"_blank\" title=\"https://icd.who.int/dev11/l-m/en\">https://icd.who.int/dev11/l-m/en</a> which refers to making proposals and comments.... Sigh.  Thanks for your suggestions</p>",
        "id": 154026902,
        "sender_full_name": "Geoff Low",
        "timestamp": 1545388132
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span> I didn't realize that you were referring to ICD-11.  A preview of that has been released, but it hasn't yet been officially approved by WHO and isn't scheduled to take effect until 1 January 2022, as I understand.  So I don't believe that any countries are actually using it yet, and if you want new codes to use now they would need to be in ICD-10 or one of its country/regional variations.  The ICD 10 codes are used all over the world, except for a very few countries that still use ICD-9 (and I believe the US was the most recent one to move from ICD-9 to ICD-10).  If your main or only concern is getting this \"right\" in ICD-11, then I think I would try to speak about that with Chris Chute.  <span class=\"user-mention\" data-user-id=\"197078\">@Christopher Chute</span> is on Zulip, but isn't subscribed to this stream, so you probably will need to message him privately.</p>",
        "id": 154026917,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1545401617
    },
    {
        "content": "<p>Thanks, that's really helpful.  I'll follow up - Hope you have a great break</p>",
        "id": 154026926,
        "sender_full_name": "Geoff Low",
        "timestamp": 1545404230
    }
]