[
    {
        "content": "<p>Hello, has a Concept Map been published for the transformation of ICD Codes to SNOMED? Or are there any ways with the FHIR Mapping Language to do such a transfromation? Thanks in advance!</p>",
        "id": 231964866,
        "sender_full_name": "Alexander Dimitrov",
        "timestamp": 1616765720
    },
    {
        "content": "<p>ICD-?<br>\nNLM provides a SCT to ICD-10-CM map <br>\n<a href=\"https://www.nlm.nih.gov/research/umls/mapping_projects/snomedct_to_icd10cm.html\">https://www.nlm.nih.gov/research/umls/mapping_projects/snomedct_to_icd10cm.html</a></p>",
        "id": 231966204,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616766220
    },
    {
        "content": "<p>ICD-10 to SNOMED</p>",
        "id": 231978791,
        "sender_full_name": "Alexander Dimitrov",
        "timestamp": 1616770710
    },
    {
        "content": "<p>Yeah, I know the direction.  Just FYI.</p>",
        "id": 231997267,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616777263
    },
    {
        "content": "<p>And what's your use case(s)?</p>",
        "id": 231998038,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616777528
    },
    {
        "content": "<p>I'm trying to map an International Patient Summary FHIR Document from ELGA (the Austrian EHR) CDAs. In some ELGA Documents the ICD-10 terminology is used, where as in the IPS FHIR Profile the SNOMED one. For the mapping with the FHIR Mapping Language I would need a concept map, which is taking care of the ICD-10 to Snomed terminologies.</p>",
        "id": 232020121,
        "sender_full_name": "Alexander Dimitrov",
        "timestamp": 1616787184
    },
    {
        "content": "<p>So you have fairly narrow source and target valuesets?</p>",
        "id": 232204426,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1616978086
    },
    {
        "content": "<p>A potential mapping issue: generally, one ICD-10 code might correspond more than one SNOMED CT codes.  So do you have additional but necessary information to do such mappings?</p>",
        "id": 232270246,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617025607
    },
    {
        "content": "<p>Unfortunately no. I just have the ICD-10 code (for example M25.46) and the displayName in German. To be more specific, the source terminology is ICD-10 BMG 2017 and the target terminology would be <a href=\"http://hl7.org/fhir/uv/ips/ValueSet-core-problem-finding-situation-event-gps-uv-ips.html\">http://hl7.org/fhir/uv/ips/ValueSet-core-problem-finding-situation-event-gps-uv-ips.html</a></p>",
        "id": 232291654,
        "sender_full_name": "Alexander Dimitrov",
        "timestamp": 1617033523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"367809\">@Alexander Dimitrov</span> I don't want to suggest that you <strong>shouldn't</strong> map to and use the SNOMED CT codes from the GPS for this, but I will point out that the binding to the value set is <strong>required</strong> in the problemGPSCode <strong>slice</strong>, but the slicing rule itself is open.  So you are actually free to use the ICD-10 BMG 2017 codes alone (without requiring additional mapped SNOMED CT codes) for Condition.code, and you will still be conformant to the Condition-uv-ips profile if you do that.  With that said, though, it's still desirable for us (as a community) to provide a means of mapping the ICD codes (with any ICD variety) to SNOMED CT and to encourage sending the SNOMED CT code in addition to the ICD code whenever possible.</p>",
        "id": 232296011,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1617035394
    },
    {
        "content": "<p>Thanks for your message <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>! Yes, that is indeed a very good point, so I guess I will leave the ICD-10 BMG 2017 codes. thanks!</p>",
        "id": 232474218,
        "sender_full_name": "Alexander Dimitrov",
        "timestamp": 1617129023
    }
]