[
    {
        "content": "<p>Hello, I wanted to raise the idea about a code system for pediatric developmental milestones. Mostly, I wanted to ask the process (and if there would be an interest) in trying to formally recognize the code set. IDOB is a database of developmental milestones created by Boston Children's Hospital, and maintained primarily by Carol L. Wilkinson, MD, PhD, and M. Jackson Wilkinson. It can be found at this website: <a href=\"https://idob.info/\">https://idob.info/</a></p>",
        "id": 210280127,
        "sender_full_name": "Grey Faulkenberry",
        "timestamp": 1600270668
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 210289805,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600275168
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"235060\">@Grey Faulkenberry</span> Just looked briefly (not to be confused with I<a href=\"https://idob.info/observations/5309003/\">IDOB#5309003</a>) at this source. Looks very interesting but may be more of a thesaurus then a code system. It's not clear by just looking at it. The site is not very clear on details and does not provide a download that I can find. In any case, the process (which <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> knows) is to follow the approach noted by the HTA which is responsible for helping. See <a href=\"https://confluence.hl7.org/display/TA/General+policy+on+the+use+of+external+code+systems+in+HL7+standards\">here</a> and <a href=\"https://confluence.hl7.org/display/TA/External+Code+System+Owner+Engagement+Process\">here</a> and also this will result in the code system showing up <a href=\"https://confluence.hl7.org/display/TA/External+Terminologies+-+Information\">here</a>. </p>\n<p>BTW, if this is a code system (with approved mappings) and not a thesaurus then the conveners should consider hosting it at <a href=\"http://bioportal.bioontology.org/\">BioPortal</a>.</p>",
        "id": 210292696,
        "sender_full_name": "Robert McClure",
        "timestamp": 1600276618
    },
    {
        "content": "<p>Haha, well played sir. And thanks for the information. I can check on the background of some of your points. I know the authors are interested in trying to make it more usable, so if it doesn't meet the requirements for a code system currently, I think they'll want to continue to work and improve it until it is.</p>",
        "id": 210294838,
        "sender_full_name": "Grey Faulkenberry",
        "timestamp": 1600277555
    }
]