[
    {
        "content": "<p>Is there a tool which takes a spreadsheet of term maps in a certain format and then converts them into FHIR ConceptMap resources? I was thinking of creating a Python script to do this to save myself some time in manually crafting JSON files or specified with FSH syntax, but I would not want to recreate something that is already available.</p>",
        "id": 271452759,
        "sender_full_name": "May Terry",
        "timestamp": 1644509083
    },
    {
        "content": "<p>I'm not sure that I've seen anything like that, <span class=\"user-mention\" data-user-id=\"192302\">@May Terry</span>.  But it would be good to know if others are aware of something.  It wouldn't surprise me if Ontoserver has something along those lines, but I don't recall for sure if they do. <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> ?</p>",
        "id": 271458958,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1644511657
    },
    {
        "content": "<p>Snapper allows importing csv files to generate a concept map but is size limited.<br>\nIt's good for one-off type exercises. Otherwise I am quite partial to using jq to produce a json resource with a repeatable script</p>",
        "id": 271487674,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1644523905
    },
    {
        "content": "<p>I thought you might - but I didn't recall for sure. :)</p>",
        "id": 271488355,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1644524254
    },
    {
        "content": "<p>I haven't done anything like this for the general case. Only for the v2/FHIR mapping project. The problem really is that you need a source of metadata that doesn't fit into a cvs type mapping thing. And also that people's assumptions about how the mapping does/should work are highly variable</p>",
        "id": 271489495,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644524803
    },
    {
        "content": "<p>SmileCDR has a utility for doing this as well <a href=\"https://smilecdr.com/docs/smileutil/import_csv_to_conceptmap.html\">https://smilecdr.com/docs/smileutil/import_csv_to_conceptmap.html</a></p>",
        "id": 271491984,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1644526136
    },
    {
        "content": "<p>Thanks, Dan.  Good to know - I didn't think to check that.</p>",
        "id": 271492073,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1644526192
    },
    {
        "content": "<p>In the past I've just used a formula in Excel to output the json fragments for all the concepts. Then assemble itn to a resource.</p>",
        "id": 271637645,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1644614009
    }
]