[
    {
        "content": "<p>I was slightly surprised to find the following statement in the <a href=\"http://hl7.org/fhir/R4/datatypes.html#Coding\">specification of the <code>Coding</code> type</a>:</p>\n<blockquote>\n<p>If the system is present, and there is no code, then this is understood to mean that there is no suitable code in the system in which to represent the code.</p>\n</blockquote>\n<p>Thinking about this for a while, this seems potentially problematic to me in the (valid) case where there is no display text either.</p>\n<ol>\n<li>My initial reaction upon seeing smt. like this in real data would be that this is probably most likely due to sloppiness or a system bug, rather than a conscious choice. If so, then interpreting it as an actual statement (rather than ignoring it or deeming it invalid) would be problematic. It's of course always problematic if the source system fills a resource incorrectly and in the end we have to trust the source to do the right thing. But my point here is that I suspect that, empirically, many such cases will turn out to be errors (much more so that for present but incorrect codes) - my dev experience suggests that accidentally leaving out a data element is much more likely than actively setting it to something incorrect.</li>\n<li>Although we in this case get no \"positive\" information\" at all, the above interpretation can actually lead to a very strong statement. E.g. if the system is SNOMED CT, we would interpret a missing code as knowledge that the thing in question is not covered by the hundreds of thousands of available codes. It seems hard for a receiving system to do something with this.</li>\n<li>It might lead implementers to simply regularly send no code if they can't seem to find one that matches, rather than trying to get the system extended or looking for alternative systems.</li>\n</ol>\n<p>Has this been a topic of discussion (more than normal, I mean...) or are my empirical hunches just way off? I realize this is normative so there is not much wiggle room anyway, but maybe someone knows the reasoning behind this choice. E.g. why was it not imposed that <code>code</code> OR <code>display</code> be present if <code>system</code> is present ?</p>",
        "id": 274945256,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1646987837
    },
    {
        "content": "<p>Well, display is the term for the code, so if there's no code then there can't really be a valid display.<br>\nBut as to the interpretation of a system but no code, that seems a little bit of a stretch to me.  It's a universal \"OTHER\" which, for classifications is invalid since a classification is by definition exhaustive. Furthermore, you'd want to know the code system version (because a later version may have added an appropriate code).<br>\nSo yes, I would agree that a system without a code should be invalid</p>",
        "id": 274956768,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1646994485
    },
    {
        "content": "<p>hmmm. There's a few places in the data types were that happens - you indicate what category is not known and you have to use the system to do that</p>",
        "id": 274969257,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647002648
    },
    {
        "content": "<p>but it's not something that we should put on Coding generally, only on particular elements</p>",
        "id": 274969283,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647002676
    },
    {
        "content": "<p>We've suggested and discussed at times that this could be used in an instance to indicate that a code from the specified code system is expected, but no suitable code in the code system for representing that meaning was identified.  That's slightly different from saying that <strong>there is no</strong> suitable code - because in some cases it's possible that a suitable code might actually exist in the code system, but in this particular instance, for whatever reason, no code was found.  I can see some rationale for this - and so far we have not excluded that interpretation.  But whether we really want to allow or encourage it may need some further consideration.</p>",
        "id": 274997381,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647015977
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> that this will result in <strong>many</strong> more errors than valid uses, and I also agree with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  that if there is a valid use, it would be in a <em>specific</em> situation that I'd rather see use a different approach (pattern?) Can we fix this in R5? <span class=\"user-mention\" data-user-id=\"196635\">@Jessica Bota</span> <span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span></p>",
        "id": 275002794,
        "sender_full_name": "Robert McClure",
        "timestamp": 1647018390
    },
    {
        "content": "<p>I'm guessing that a Coding with only a system value would be sufficient to meet cardinality constraints on Coding or CodeableConcept. At a gut level, that feels wrong, but I don't see any other way to interpret it.</p>",
        "id": 275015811,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1647024244
    },
    {
        "content": "<p>wow, that is worse that just a code without a system</p>",
        "id": 275016936,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647024778
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> Would you please enter a JIRA ticket to describe this issue and include a link to this Zulip thread? We will take up this topic on one of the Vocab tracker calls. Thanks.</p>",
        "id": 275018980,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1647025385
    },
    {
        "content": "<p>I just taught an HL7 Terminology course and we explicitly say that a Coding with just a system is saying \"I would have sent a code from this system, but no appropriate code exists.\"  I guess you'd send this to satisfy a constraint to a Required binding to a value set that only takes from CodeSystem X to say \"you are forcing me to send a code from X but no appropriate code exists\"?</p>",
        "id": 275019227,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1647025455
    },
    {
        "content": "<p>Yes, what Jean said in the first sentence is what was taught originally and what has continued to be taught in the FHIR terminology tutorials - and is what I said above.  It's part of a question or discussion about \"why are all of the elements in Coding optional?\".  But I don't think it works (and it shouldn't work) to satisfy a required binding - in that case you have to send one of the actual codes (both 'system' and 'code') that are in the bound value set.</p>",
        "id": 275034595,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647033289
    },
    {
        "content": "<p>A Coding could have nothing but an extension. <a href=\"https://www.hl7.org/fhir/datatypes.html#Coding\">https://www.hl7.org/fhir/datatypes.html#Coding</a><br>\nAll data types have that option.<br>\nYou can define local profiles of data types that are stricter.<br>\nMaybe there could be some standard ones defined in Core.</p>",
        "id": 275182665,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1647216577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span> I opened ticket <a href=\"https://jira.hl7.org/browse/FHIR-36267\">FHIR-36267</a> for this, linking this thread and summarizing some of the issues raised.</p>",
        "id": 275199972,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1647241581
    }
]