[
    {
        "content": "<p>I'm trying to find some text that explains the distinction we are making on code systems that are Internal(FHIR) and External(FHIR).  The only thing that I can see is that Internal(FHIR) code systems are used in FHIR code elements whereas External(FHIR) are used in CodeableConcept elements.</p>",
        "id": 204210847,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1594995384
    },
    {
        "content": "<p>I think the intention is that \"internal FHIR\" codes are those referenced by 'code' elements, meaning that they're tied to the FHIR schema.  Such codes are maintainable <em>only</em> in the FHIR spec and can't change unless you move to a new FHIR release.  They're published in UTG, but can't be changed there.</p>\n<p>External FHIR codes are temporary code systems created for resources with FMM 2 and less as place-holders/testing areas for terminologies used in FHIR specs that are not 'code' (Coding or CodeableConcept).  The expectation is that by the time the resource evolves to FMM3+, those terminologies should be retired and the element should be bound to an element using an external code system (e.g. LOINC, SNOMED) or a shared terminology maintained as part of UTG.</p>",
        "id": 204225905,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595002226
    },
    {
        "content": "<p>I did see some External(FHIR) code systems that were used in value sets that had extensible bindings.  My initial assumption was what you stated so I'll go with that. :)</p>",
        "id": 204226363,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595002464
    },
    {
        "content": "<p>They could even be used with 'required' bindings - so long as the element isn't of data type 'code'.</p>",
        "id": 204226482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595002531
    },
    {
        "content": "<p>external means going to be moved to UTG</p>",
        "id": 204265679,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595023984
    },
    {
        "content": "<p>Right - but moved when they get mature enough.  We don't want to put draft/experimental/just learning content into UTG</p>",
        "id": 204279567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595039586
    }
]