[
    {
        "content": "<p>Is there a FHIR CodeSystem that represents ISO/HL7 10781 lifecycle events?  This is not the same as the ISO 21089 lifecycle events, nor the HL7 v2/v3 lifecycle events.</p>",
        "id": 165928423,
        "sender_full_name": "John Moehrke",
        "timestamp": 1558120428
    },
    {
        "content": "<p>then I don't think I have made one for that</p>",
        "id": 165941910,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558132177
    },
    {
        "content": "<p>Is there a specific way to do that with ISO terminology?</p>",
        "id": 165975396,
        "sender_full_name": "John Moehrke",
        "timestamp": 1558186720
    },
    {
        "content": "<p>copy the way I did it for the other ISO terminologies?</p>",
        "id": 165992698,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558216215
    },
    {
        "content": "<p>so, ISO is not being nice like DICOM and IHE are?  okay, I guess the hard work will need to be done.</p>",
        "id": 166084416,
        "sender_full_name": "John Moehrke",
        "timestamp": 1558358732
    },
    {
        "content": "<p>no whatever is done, we do.</p>",
        "id": 166084828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558359086
    },
    {
        "content": "<p>Is there any movement on getting this available for the FHIR core build? It has been asked to include these codes in the valueSet with the other lifecycle events.  (FHIR-24907). Those that use these codes do not want to be forced to convert to one of the other lifecycle codeSystems.</p>",
        "id": 205506023,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596129411
    },
    {
        "content": "<p>no progress on my part. what's the license?</p>",
        "id": 205534873,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596144550
    },
    {
        "content": "<p>I don't know, or know how to answer that. I simply have a CR asking for it. If the terminology gods want to tell me that licensing prevents it, then that is a fine solution.</p>",
        "id": 205600226,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596207378
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Is the set of codes defined for lifecycle events listed in the HL7 specification someplace? Or did ISO do something different with <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=269\">HL7 EHR-System Functional Model, R2</a> that added the content you want?</p>",
        "id": 205612863,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596213611
    },
    {
        "content": "<p>I don't know, I don't have access to the ISO specification. All I know is \"ISO/HL7 10781 lifecycle\".   are these available inside HL7? I couldn't find them, but I am not good at finding vocabulary.. (word fail me all the time)</p>",
        "id": 205613077,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596213745
    },
    {
        "content": "<p>I don't have the ISO spec either but my assumption is that the ISO publication is exactly the same as the HL7 publication, but I'll admit that sounds foolish. And I agree, I do not think the EHR-S FM defines <em>any</em> specific terminology (hence a <em>functional model</em>). I'll ask HQ but perhaps we need to get more info on the source and use-case leading to the need for this \"terminology.\"  I will say there are references in the EHR-S FM to \"record lifecycle\" and they list  \"origination, attestation, amendment, access/use, translation, transmittal/disclosure, receipt, de- identification, archive...\" but that is apparently not exhaustive nor is it official.  It also has \"Lifecycle Events include originate, retain, amend, verify, attest, access/view, de-identify, transmit/receive, and more.\" I suspect you may be looking for something that was alluded to in EHR-S FM (ISO 10781:2015) but not officially defined there. Can you ask the EHR group <span class=\"user-mention\" data-user-id=\"192546\">@Gary Dickinson</span> ?</p>",
        "id": 205621404,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596218313
    },
    {
        "content": "<p>Gary has provided me a draft of the ISO specification. But I have no idea to what extent I can share that, nor if it is  sufficient to define a vocabulary. At that time, when life was less complex with licensing issues, I was simply going to do the data entry into a FHIR codeSystem resource myself. But now I am afraid to do that.</p>",
        "id": 205645071,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596232027
    },
    {
        "content": "<p>you should do that anyway. The question is where we put it.</p>",
        "id": 205645098,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596232054
    },
    {
        "content": "<p>I see a bunch of emails that went nowhere...</p>",
        "id": 205645256,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596232151
    },
    {
        "content": "<p>we'll put it in the terminology support package and deal with any issues this creates later</p>",
        "id": 205645279,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596232175
    },
    {
        "content": "<p>so, I should use the draft spec I have, and make a codeSystem file... and give that file to you?</p>",
        "id": 205645383,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596232226
    },
    {
        "content": "<p>yes</p>",
        "id": 205645393,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596232233
    },
    {
        "content": "<p>my draft is 2007.  nothing resembling a lifecycle vocabulary.</p>",
        "id": 205649091,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596235408
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192546\">@Gary Dickinson</span> Has also provided a glossary pdf to me from an unknown document (pgs 36-37) that seems to have the code system. I've sent him an email to try and clarify and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  are cc'd. I hope we can bring this to closure soon.</p>",
        "id": 205819705,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596474185
    },
    {
        "content": "<p>I think what this is referring to is the reference from the EHR-S FM version 2 (ISO-10781) to ISO 21089. The publicly available details of the <a href=\"https://www.iso.org/obp/ui/#iso:std:iso:ts:21089:ed-1:v1:en\">2018 version</a> lists the following:<br>\n15.1.2 Record lifecycle event — Originate/retain record entry instance(s)<br>\n15.3 Record lifecycle event — Transform/translate<br>\n15.4 Record lifecycle event — Attest<br>\n15.5 Record lifecycle event — Access/view<br>\n15.6 Record lifecycle event — Report (output)<br>\n15.7 Record lifecycle event — Disclose<br>\n15.8 Record lifecycle event — Transmit<br>\n15.9 Record lifecycle event — Receive/retain<br>\n15.10 Record lifecycle event — De-identify (anonymize)<br>\n15.11 Record lifecycle event — Pseudonymize<br>\n15.12 Record lifecycle event — Re-identify<br>\n15.13 Record lifecycle event — Extract<br>\n15.14 Record lifecycle event — Archive<br>\n15.15 Record lifecycle event — Restore (from archive)<br>\n15.16 Record lifecycle event — Destroy/delete<br>\n15.17 Record lifecycle event — Deprecate<br>\n15.18 Record lifecycle event — Reactivate (from delete or deprecate)<br>\n15.19 Record lifecycle event — Merge<br>\n15.20 Record lifecycle event — Unmerge<br>\n15.21 Record lifecycle event — Link<br>\n15.22 Record lifecycle event — Unlink<br>\n15.23 Record lifecycle event — Add legal hold<br>\n15.24 Record lifecycle event — Remove legal hold<br>\n15.25 Record lifecycle event — Verify</p>",
        "id": 205832288,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596480658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> do you just happen to have the details captured in a FHIR CodeSystem resource?</p>",
        "id": 205837460,
        "sender_full_name": "John Moehrke",
        "timestamp": 1596483163
    },
    {
        "content": "<p>Unfortunately, I don't.</p>",
        "id": 205842284,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596485829
    },
    {
        "content": "<p>Starting off 2021 optimistic that a conclusion will happen on this one. What is the go forward plan for this one?  <span class=\"user-mention\" data-user-id=\"192546\">@Gary Dickinson</span> can you help?</p>",
        "id": 221533710,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609772764
    },
    {
        "content": "<p>Record Lifecycle Events are now incorporated in the FHIR Record Lifecycle Event Implementation Guide (<a href=\"http://hl7.org/fhir/ehrsrle/ehrsrle.html\">http://hl7.org/fhir/ehrsrle/ehrsrle.html</a>) (noting that there is an error in the description for RLE #11) and the FHIR RLE Code Set (<a href=\"https://terminology.hl7.org/1.0.0/CodeSystem-iso-21089-lifecycle.html\">https://terminology.hl7.org/1.0.0/CodeSystem-iso-21089-lifecycle.html</a>).  They are also incorporated in ISO 21089:2018 Health Informatics - Trusted End-to-End Information Flows, ISO/HL7 10781 EHR System Functional Model Release 2.1 (<a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=528\">http://www.hl7.org/implement/standards/product_brief.cfm?product_id=528</a>), ISO/HL7 16527 PHR System Functional Model Release 2 (awaiting final publication at HL7).</p>",
        "id": 221536021,
        "sender_full_name": "Gary Dickinson",
        "timestamp": 1609773810
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192546\">@Gary Dickinson</span> I am confused. I thought the ask was for 10781... not 21089... If they are the same thing, then we can stop... but I have a CR from you explicitly asking for 10781<br>\nsee <a href=\"https://jira.hl7.org/browse/FHIR-24907\">https://jira.hl7.org/browse/FHIR-24907</a></p>",
        "id": 221540374,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609775651
    },
    {
        "content": "<p>given that I don't have access to ISO specifications, due to paywall... I can't evaluate anything other than the numbers 21089 are not equal to 10781. If they are equal, then I can close this as done.</p>",
        "id": 221540494,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609775703
    },
    {
        "content": "<p>what is the codeSystem.system value of this code system?    Most of the problem is that we keep referring to specification numbers, not vocabulary managed systems.</p>",
        "id": 221540785,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609775820
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192546\">@Gary Dickinson</span> and vocab leadership... this is a specific confusion on ISO lifecycle events. I would be happy to close the CR as not being needed, but I can't confirm. See my last few questions to Gary</p>",
        "id": 231313545,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616421339
    },
    {
        "content": "<p>Here is the full current record lifecycle event list, as incorporated in ISO 21089:2018 (Trusted end-to-end information flows), in alphabetical order with number sequence:</p>\n<p>(5)  Access/View - Lifecycle Event<br>\noccurs when an agent causes the system to obtain and open a record entry for inspection or review</p>\n<p>(23)  Add Legal Hold - Lifecycle Event<br>\noccurs when an agent causes the system to tag or otherwise indicate special access management and suspension of record entry deletion/destruction, if deemed relevant to a lawsuit or which are reasonably anticipated to be relevant or to fulfill organizational policy under the legal doctrine of “duty to preserve”</p>\n<p>(2)  Amend (Update) - Lifeycle Event<br>\noccurs when an agent makes any change to record entry content currently residing in storage considered permanent (persistent)</p>\n<p>(14)  Archive – Lifeycle Event<br>\noccurs when an agent causes the system to create and move archive artifacts containing record entry content, typically to long-term offline storage</p>\n<p>(4)  Attest – Lifecycle Event<br>\noccurs when an agent causes the system to capture the agent’s digital signature (or equivalent indication) during formal validation of record entry content</p>\n<p>(27)  Decrypt – Lifecycle Event<br>\noccurs when an agent causes the system to decode record entry content from a cipher</p>\n<p>(10)  De-Identify (Anononymize) – Lifecycle Event<br>\noccurs when an agent causes the system to scrub record entry content to reduce the association between a set of identifying data and the data subject in a way that may or may not be reversible</p>\n<p>(17)  Deprecate – Lifecycle Event<br>\noccurs when an agent causes the system to tag record entry(ies) as obsolete, erroneous or untrustworthy, to warn against its future use</p>\n<p>(16)  Destroy/Delete – Lifecycle Event<br>\noccurs when an agent causes the system to permanently erase record entry content from the system</p>\n<p>(7)  Disclose – Lifecycle Event<br>\noccurs when an agent causes the system to release, transfer, provision access to, or otherwise divulge record entry content</p>\n<p>(26)  Encrypt – Lifecycle Event<br>\noccurs when an agent causes the system to encode record entry content in a cipher</p>\n<p>(13)  Extract – Lifecycle Event<br>\noccurs when an agent causes the system to selectively pull out a subset of record entry content, based on explicit criteria</p>\n<p>(21)  Link – Lifecycle Event<br>\noccurs when an agent causes the system to connect related record entries</p>\n<p>(19)  Merge – Lifecycle Event<br>\noccurs when an agent causes the system to combine or join content from two or more record entries, resulting in a single logical record entry</p>\n<p>(1)  Originate/Retain – Record Lifecyle Event<br>\noccurs when an agent causes the system to:  a) initiate capture of potential record content, and b) incorporate that content into the storage considered a permanent part of the health record</p>\n<p>(11)  Pseudonymize – Lifecycle Event<br>\noccurs when an agent causes the system to remove record entry content to reduce the association between a set of identifying data and the data subject in a way that may be reversible</p>\n<p>(18)  Re-activate – Lifecycle Event<br>\noccurs when an agent causes the system to recreate or restore full status to record entries previously deleted or deprecated</p>\n<p>(9)  Receive/Retain – Lifecycle Event<br>\noccurs when an agent causes the system to:  a) initiate capture of data content from elseware, and b) incorporate that content into the storage considered a permanent part of the health record</p>\n<p>(6)  Report (Output) – Lifecycle Event<br>\noccurs when an agent causes the system to produce and deliver record entry content in a particular form and manner</p>\n<p>(12)  Re-identify – Lifecycle Event<br>\noccurs when an agent causes the system to restore information to data that allows identification of information source and/or information subject</p>\n<p>(24)  Remove Legal Hold - Lifecycle Event<br>\noccurs when an agent causes the system to remove a tag or other cues for special access management had required to fulfill organizational policy under the legal doctrine of “duty to preserve”</p>\n<p>(15)  Restore – Lifecycle Event<br>\noccurs when an agent causes the system to recreate record entries and their content from a previous created archive artifact</p>\n<p>(3)  Transform/Translate – Lifecycle Event<br>\noccurs when an agent causes the system to change the form, language or code system used to represent record entry content</p>\n<p>(8)  Transmit – Lifecycle Event<br>\noccurs when an agent causes the system to send record entry content from one (EHR/PHR/other) system to another</p>\n<p>(22)  Unlink – Lifecycle Event<br>\noccurs when an agent causes the system to disconnect two or more record entries previously connected, rendering them separate (disconnected) again</p>\n<p>(20)  Unmerge – Lifecycle Event<br>\noccurs when an agent causes the system to reverse a previous record entry merge operation, rendering them separate again</p>\n<p>(25)  Verify – Lifecycle Event<br>\noccurs when an agent causes the system to confirm compliance of data or data objects with regulations, requirements, specifications, or other imposed conditions based on organizational policy</p>",
        "id": 232688619,
        "sender_full_name": "Gary Dickinson",
        "timestamp": 1617238629
    }
]