[
    {
        "content": "<p>I have some JIRA tickets in FHIR core that are against vocabulary now managed in terminology. Is there a process to move them? I have some really simple ones in that the comment is that the date of the codesystem is in the future (2023), which clearly is not true. <a href=\"http://jira.hl7.org/browse/FHIR-25623\">FHIR-25623</a></p>",
        "id": 229319336,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615218263
    },
    {
        "content": "<p>Use the UTG process</p>",
        "id": 229319788,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615218416
    },
    {
        "content": "<p>awful big and cumbersome hammer to get a typo fixed. This typo might stay wrong until after 2023</p>",
        "id": 229320321,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615218616
    },
    {
        "content": "<p>does the UTG process explain how to re-assign tickets? or link them?</p>",
        "id": 229322121,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615219229
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span></p>",
        "id": 229324412,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615219715
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"196635\">@Jessica Snell</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I assume you mean reassigning a FHIR ticket to UTG John?   If so, we have not documented or done work to explore and debug exactly how to do that - it is hopefully just an artifact of startup of the new process for updating terminology, swirled with the fact that some very old FHIR tickets were agains core terminology that was 'moved' to THO as part of the R4 core release.    In hindsight, what probably should have been done is tickets referring to the moved stuff should have been moved as well.  Ah well, 20/20 hindsight...the datafields and screens are different so they cannot just be moved in Jira.    I'll put this on the UTG call agenda to be discussed.</p>",
        "id": 229364834,
        "sender_full_name": "Ted Klein",
        "timestamp": 1615233695
    },
    {
        "content": "<p>yes, that is the case... but  I would not classify this as a legacy jira ticket problem. This jira ticket came in thru the FHIR change request method, I would expect many others might do that today.</p>",
        "id": 229365615,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615234054
    },
    {
        "content": "<p>but I also wonder if UTG has a light weight pathway for something like this that is clearly just a typo, vs a signficant code fix.</p>",
        "id": 229365806,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615234135
    },
    {
        "content": "<p>Is it not a simple as creating a \"UP\" technical correction ticket in Jira and linking the original ticket to it for traceability?</p>",
        "id": 229451612,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1615284319
    }
]