[
    {
        "content": "<p>I do not understand the value of <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13732\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13732\">GF#13732</a>. We already have a max value set of all possible languages, and then we have a shorter list, a practical one - which is <em>translated to other languages</em>. I do not understand the value of adding a whole bunch of dialect variations for non-HL7 affiliates, when any language is allowed, and this is the common set. Why add uncommon variants?</p>",
        "id": 153982048,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533362819
    },
    {
        "content": "<p>rather than just add a big long lit just because, I'd rather:</p>\n<ul>\n<li>ask affiliates if they believe that there's anything missing for their realms</li>\n<li>accept requests for this</li>\n</ul>",
        "id": 153982049,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533362869
    },
    {
        "content": "<p>if the problem is that some terminology service wants a blown out list to use as a short cut for the max list, well, then, let's add that as it's own value set - and why not actually build it automatically so that it's comprehensive, instead of a list that's too long to be useful, and too short to be comprehensive?</p>",
        "id": 153982050,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533362932
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> this is your ask. <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> this is your motion. <span class=\"user-mention\" data-user-id=\"193539\">@Brian Ahier</span> you seconded (man, I've never heard of you being on a call)</p>",
        "id": 153982051,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533362991
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> As I understand it, the content of MAX would include all possible technically valid combinations, many (most?) of which are not known languages. Your shorter \"practical\" list is to my understanding a one-time guess at languages in play for HL7 affiliates. This list is to be used across all jurisdictions and the list I presented is known to be of use. Your suggested approach means that in implemented systems when a patient needs to document a needed language, they will not be able to because no system will ever support, nor expect a clinician to craft the correct representation for a missing language on the fly. This results in incomplete, perhaps dangerous, lack of data in the record. What makes you think that HL7 affiliates define the breadth of useful languages? Isn't it possible that it would be the rare languages that might be most problematic for patient care and demonstrate a need for capturing that information?</p>\n<p>What is the problem with taking a known, vetted list and using that instead of your 'HL7 defines the sum of need' list?</p>",
        "id": 153982191,
        "sender_full_name": "Robert McClure",
        "timestamp": 1533486513
    },
    {
        "content": "<p>well, perhaps I'm at a disadvantage, because I have no sense of provenance of that list; nor any sense of how is being used. I just look at it and see a mis-hit - not comprehensive enough to be everything, but too comprehensive for real world usage</p>",
        "id": 153982208,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533504184
    },
    {
        "content": "<p>In Australia there is a (still being developed) ValueSet for language common in Australia that will include local indigenous languages. We plan to bind to that in local specifications.</p>",
        "id": 153982414,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1533530784
    },
    {
        "content": "<p>do they even have valid codes?</p>",
        "id": 153982445,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533537514
    },
    {
        "content": "<p>It's on the task list for the terminology to find some.</p>",
        "id": 153982835,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1533596593
    },
    {
        "content": "<p>There is reference material: <a href=\"https://collection.aiatsis.gov.au/language/about\" target=\"_blank\" title=\"https://collection.aiatsis.gov.au/language/about\">https://collection.aiatsis.gov.au/language/about</a> - \"AIATSIS assigns an alpha-numeric code to each language variety, with a community preferred name and spelling, to form a reference name\"</p>",
        "id": 153983424,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1533680891
    },
    {
        "content": "<p>... which won't be valid in the language attribute...</p>",
        "id": 153983428,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533680936
    },
    {
        "content": "<p>there is also <a href=\"https://livingarchive.cdu.edu.au/language-codes-in-iso-639-3/\" target=\"_blank\" title=\"https://livingarchive.cdu.edu.au/language-codes-in-iso-639-3/\">https://livingarchive.cdu.edu.au/language-codes-in-iso-639-3/</a> which appears to incorporate the work by AIATSIS up to certain limits</p>",
        "id": 153983435,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1533681411
    },
    {
        "content": "<p>We have made efforts to extend <a href=\"http://hl7.org/fhir/ValueSet/languages\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/languages\">http://hl7.org/fhir/ValueSet/languages</a>, to include indigenous languages. We have a draft value set, <a href=\"https://healthterminologies.gov.au/fhir/ValueSet/common-languages-australia-1\" target=\"_blank\" title=\"https://healthterminologies.gov.au/fhir/ValueSet/common-languages-australia-1\">https://healthterminologies.gov.au/fhir/ValueSet/common-languages-australia-1</a>, including codes that we have submitted to the working group for BCP-47. We can't get a response from the working group. </p>\n<p>Another issue is that the BCP-47 code system has no formal FHIR definition so any value set we create to extend the extensibly bound one in the spec will never expand nor can we validate (automatically) any code within it. If a FHIR code system definition becomes available and we still can’t get in touch with the working group to process our submission we may be able to author a complimentary but separate code system perhaps based on ABS but will look into your references also Michael. Adding a note that using codes outside of BCP-47 is obviously prohibited so this is just considering options.</p>",
        "id": 153983456,
        "sender_full_name": "Liam Barnes",
        "timestamp": 1533687970
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192027\">@Liam Barnes</span> I'm not sure which WG you are referring to in \"can't get a response from the working group\"?  I note that PA recently resolved <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16336\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16336\">GF#16336</a> as Not Persuasive.  I'm not seeing any open or not yet applied issues on this at the moment, but Vocab certainly would have an interest generally.  If there's a particular tracker that I (or Vocab) have overlooked, let me know.  I've run into the same issue with not being able to expand and validate these codes, and I would like to see that changed, too.  Happy to work together with you to figure out the best way for that to happen.</p>",
        "id": 153983640,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1533735548
    },
    {
        "content": "<p>I thought Liam meant theW3C working group</p>",
        "id": 153983780,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533758568
    },
    {
        "content": "<p>yes, you're probably right - that makes sense but it didn't occur to me at the time</p>",
        "id": 153983782,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1533758658
    },
    {
        "content": "<p>Sorry for the confusion. Yes I meant the group responsible for the language tag registry. Really what I mean is we've tried to contact IANA. I can't say we have a clear way forward. Firstly, if we can get our indigenous languages added to the registry we will at least have valid codes. As for the expansion/validation problem I don't fully understand the problem, other than there's no FHIR code system. Ideally, that would be available in the base spec but defining that code system could well be complicated by the various combinations of subtags possible.</p>",
        "id": 153984024,
        "sender_full_name": "Liam Barnes",
        "timestamp": 1533791529
    },
    {
        "content": "<p>so there's no formal FHIR definition, but my server uses this as the source:</p>",
        "id": 153984030,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533795370
    },
    {
        "content": "<p><a href=\"https://www.iana.org/assignments/language-subtag-registry/language-subtag-registry\" target=\"_blank\" title=\"https://www.iana.org/assignments/language-subtag-registry/language-subtag-registry\">https://www.iana.org/assignments/language-subtag-registry/language-subtag-registry</a></p>",
        "id": 153984031,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533795443
    },
    {
        "content": "<p>Does your server have any rules about the combination of different subtags in the registry?</p>",
        "id": 153984037,
        "sender_full_name": "Liam Barnes",
        "timestamp": 1533797060
    },
    {
        "content": "<p>the grammar has to be followed. I don't any specific rules about combinations beyond that</p>",
        "id": 153984043,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533798852
    },
    {
        "content": "<p>This is the best source I have found on how to construct language tags. It is very good. <a href=\"https://www.w3.org/International/articles/language-tags/index.en\" target=\"_blank\" title=\"https://www.w3.org/International/articles/language-tags/index.en\">https://www.w3.org/International/articles/language-tags/index.en</a></p>",
        "id": 153984492,
        "sender_full_name": "Robert McClure",
        "timestamp": 1533847695
    },
    {
        "content": "<p>so where does this leave us? the reason I'm pushing back against this change is precisely because \"The golden rule when creating language tags is to keep the tag as short as possible\" - the proposed changes take a curated value set and blow that away with something that looks like a complete expansion but isn't. So it fails from both perspectives for me. And you (<span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>) have still not provided any provenance information about that other value set</p>",
        "id": 153984505,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533848481
    }
]