[
    {
        "content": "<p>I'm looking for feedback on a few assumptions I'm making about how to handle large composes and expansions:</p>\n<ol>\n<li>From what I can see, the way to handle large composes would be by spreading the definition across multiple ValueSets and use a grouping ValueSet to bring them together. Some practical, implementation-defined limit on the number of concepts that could appear in a single ValueSet definition, but no need for the spec to say anything about that (and it doesn't, from what I can see).</li>\n<li>There is provision in the ValueSet expansion element for saying \"this is a portion of the overall expansion, beginning at offset X\", so in theory, you could have a \"value set\" with an expansion of 100,000 codes, and you would render that over the API with, say, 100 ValueSet instances, each with the same canonical, but different ids, each one with 1000 codes in it.</li>\n</ol>",
        "id": 230441465,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1615853692
    },
    {
        "content": "<p>For systems that have implemented large value sets, is this how you've done it?</p>",
        "id": 230441497,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1615853721
    },
    {
        "content": "<p>Or do you avoid persisting the expansion at all (i.e. the only way to get the expansion is through an invocation of the $expand operation?)</p>",
        "id": 230441531,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1615853757
    },
    {
        "content": "<p>Sounds good</p>",
        "id": 230474996,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1615882746
    },
    {
        "content": "<p>I mean it's disirable</p>",
        "id": 230475450,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1615883041
    },
    {
        "content": "<p>We support arbitrary size expansions (from $expand) using count &amp; offset parameters. In the expansion itself the offset is indicated as is the total, so you can determine that you've not got the whole thing and you can persist each expansion \"page\" separately.</p>",
        "id": 230475536,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1615883074
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 230512203,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1615901665
    }
]