[
    {
        "content": "<p>There seem to be two value sets that could be used for laterality: <a href=\"http://hl7.org/fhir/ValueSet/bodysite-laterality\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/bodysite-laterality\">http://hl7.org/fhir/ValueSet/bodysite-laterality</a> and <a href=\"http://hl7.org/fhir/ValueSet/bodystructure-relative-location\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/bodystructure-relative-location\">http://hl7.org/fhir/ValueSet/bodystructure-relative-location</a>. Neither is ideal because they both contain inactive SNOMED-CT codes (419161000 and 419465000). The first is missing some laterality concepts and the second has some non-laterality concepts. The question is: should we fix the existing laterality value set or create our own?</p>",
        "id": 178877839,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1571852679
    },
    {
        "content": "<p>for mCode? or for something else?</p>",
        "id": 178878451,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571853080
    },
    {
        "content": "<p>It is for mCODE, yes.</p>",
        "id": 178878490,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1571853108
    },
    {
        "content": "<p>Our primary interest is for mCODE, although I can see it affecting other use cases (e.g.: Surgery and Radiology procedures) which might need to specify laterality.</p>",
        "id": 178878697,
        "sender_full_name": "May Terry",
        "timestamp": 1571853209
    },
    {
        "content": "<p>so fixing the source in FHIR won't help on your timeframe. That means that you have to define your own. But we don't want to add yet another value set. So can CIMI, OO, and II work together to agree on the right value set? These are both example value sets, so I expect that they're very easily changed</p>",
        "id": 178878727,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571853232
    },
    {
        "content": "<p>but do you want <em>laterality</em> or <em>relative location</em>? they are not the same thing</p>",
        "id": 178878824,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571853274
    },
    {
        "content": "<p>We currently have laterality and anatomical orientation as two separate elements. We don't have a concept of relative location, but we use a concept of location relative to a landmark, which is a more complex concept involving a landmark type, landmark body location, and a distance and direction from that landmark to the body site of interest.  In cancer, the landmark could be the left nipple, the distance 5 cm, and direction could be 11 o'clock.</p>",
        "id": 178892829,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1571862169
    },
    {
        "content": "<p>is that consistent with the BodyStructure resource?</p>",
        "id": 178893014,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571862243
    },
    {
        "content": "<p>What mark is doing  aligns more with  openEHR and the original bodysite resource:  <a href=\"http://hl7.org/fhir/2015Jan/bodysite.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2015Jan/bodysite.html\">http://hl7.org/fhir/2015Jan/bodysite.html</a></p>",
        "id": 178996064,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571950180
    },
    {
        "content": "<p>It should come more in-line with the current BodyStructure resource (or the BodyStructure resource should evolve to meet <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span>'s needs.  We don't want to be using extensions to define body location when we have a resource specifically intended for that purpose.</p>",
        "id": 179011955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571963560
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> we have to change BodyStructure considerably to fit our needs. It doesn’t give much advantage to start from there. Extending bodySite is more logical.</p>",
        "id": 179012934,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1571964493
    },
    {
        "content": "<p>Giving the implementer a choice between a single code or an extension that references a different resource seems very awkward.</p>",
        "id": 179013082,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1571964654
    },
    {
        "content": "<p>It seems much better to say the code is always in body site and there may be an extension that modifies or enriches the meaning of that code</p>",
        "id": 179013114,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1571964695
    },
    {
        "content": "<p>I think you should discuss with the OO committee on <a class=\"stream\" data-stream-id=\"179256\" href=\"/#narrow/stream/179256-Orders-and-Observation-WG\">#Orders and Observation WG</a> - this isn't really a terminology issue, and they are the ones who defined it that way. I agree with Lloyd: we do not want implementation guides published through HL7 ignoring the existing models and creating alternative realities</p>",
        "id": 179013629,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571965335
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> , given that you're talking about a tumor or lesion that's going to need multiple Observations (and maybe Procedures) tied to it over time, you really should be using the resource.  That's the only way you can link everything that's been said about/done to the tumor/lesion over time.  If you're not happy with how BodyStructure defines things, extend it as needed and submit change requests.</p>",
        "id": 179013731,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571965485
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, a tumor could be viewed as body structure or a condition. Multiple Observations can be tied to a BodyStructure, (through focus), but Procedures can only be tied to Condition | Observation | Procedure | DiagnosticReport | DocumentReference.</p>",
        "id": 179015039,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1571967337
    },
    {
        "content": "<p>Procedures can be tied to BodyStructure in the same way that Observations can - one of the main reasons for BodyStructure was to allow repeated observations of the same tumor/lesion/fetus/etc.  The Condition may well be associated with multiple tumors/lesions.  (Or in the case of pregnancy, multiple fetuses)</p>",
        "id": 179016021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571968858
    }
]