[
    {
        "content": "<p>After examining complaints from the IG Publisher about unknown code systems I decided to have a look at our CodeSystem situation. We have 93 distinct local code systems to deal with. Some identified with a URI and most based on urn:oid:.</p>\n<p>Because this is STU3 there is also the odd system that got a URI assigned in R4. This concerns 1.3.160 or GTIN.</p>\n<p>I would like to help implementers by supplying more formal information on these codesystems than we currently do, and hopefully satisfy the IG Publisher in the process.</p>\n<p>I can think of two ways, or both:</p>\n<ul>\n<li>Add CodeSystem resources for each, outlining copyrights, where to get them (we seldom own them) etc. and use CodeSystem.content = not-present<ul>\n<li>Big note: the CodeSystem.url will be urn:oid:... for these systems where applicable</li>\n</ul>\n</li>\n<li>Add NamingSystem that does that same thing except that it does not have the burden of content and concentrates on meta only.</li>\n</ul>\n<p>Any advice to share which is preferred?</p>",
        "id": 207966471,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1598364165
    },
    {
        "content": "<p>I've done #1 for my Da Vinci guide where I have X12 code systems.  I call them \"stub\" code systems as they aren't code systems that you can use (since the content isn't present) but it gives the URL (or OID in your case), some definitions, and potentially some copyright information.</p>",
        "id": 207970683,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598366144
    },
    {
        "content": "<p>The decision at least partly comes down to who is in control of the code system and how much and what types of metadata are available for it.  The CodeSystem resource should represent the point of view and the content determined by the code system owner/publisher (although someone else, such as yourself, might actually create the resource instance).  If the metadata includes the copyright and many of the additional items (including properties, filters, etc.), then CodeSystem is the only way that we have to represent that.  If you have multiple identifiers of one or more identifier types (e.g. an oid and a url, or multiples of those) and need or want to declare or obtain the preferred identifier for a type, then obviously NamingSystem is needed for that.  So in some cases you may need both.</p>",
        "id": 207986106,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1598373206
    },
    {
        "content": "<p>I didn't write the terminology sub-system used in the validator and the publisher to deal with the situation where a package declares a code system stub for a code system that <a href=\"http://tx.fhir.org\">tx.fhir.org</a> handles. By default, the stub hides the <a href=\"http://tx.fhir.org\">tx.fhir.org</a> server's support for the code system. But stubs like this are appearing in multiple places, especially UTG, and so I am hunting down all these places and trying to figure out whether the stub should be referenced or not. </p>\n<p>This is to say: if you declare those as code system stubs, you may get unexpected side effects. We can discuss/debug</p>",
        "id": 208026563,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598391100
    },
    {
        "content": "<p>My intention after reading all this, is to create both CodeSystems and NamingSystems for each of the 93 systems. From there I intend take the discussion to the IG creation stream if unexpected things turn up there.</p>",
        "id": 208080468,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1598442150
    },
    {
        "content": "<p>Of course it would be good to also bring relevant issues/questions back to this stream, as well (in addition to IG Creation).</p>",
        "id": 208086355,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1598446135
    },
    {
        "content": "<p>Sure. If I run into issues creating the shell CodeSystems I'll check in here. Maybe one thing:</p>\n<ul>\n<li>FHIR juggled URIs from STU3 to R4 for all HL7 systems</li>\n<li>Every once in a while a new URI gets added e.g. for GTIN in R4, where we use the OID in STU3</li>\n</ul>\n<p>This means that for us in STU3 we stick with what was known in STU3, and expect to move to R4 system identification when we move to R4. We cannot convert while in production with STU3.</p>\n<p>The value proposition of ever changing identifiers is not very good. We had stable OIDs for 15-20 years, and now FHIR changes identifiers from OIDs to URIs and then from URIs to different URIs. All without helping patients. I've expressed this before.</p>\n<p>My main question is really about what the experience with this is so far. Do people check NamingSystems? Does an STU3 NamingSystem have a different preferred identifier for the same system than R4? That would be my expectation. Would it be correct to even list the R4 GTIN URI in an STU3 NamingSystem? How does all this interrelate with CodeSystem.url? STU3 GTIN CodeSystem and R4 GTIN CodeSystem would be virtually different systems based on their canonical.</p>",
        "id": 208664771,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1598953099
    },
    {
        "content": "<p>In general, we should not be changing code system URIs once they are defined. The change to <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> was very much a once off.</p>",
        "id": 208665267,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598953413
    },
    {
        "content": "<p>I was counting on that. But given the life span of STU3 implementations it does raise long term questions.</p>",
        "id": 208826089,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1599054580
    },
    {
        "content": "<p>yes i hear you. It's painful but it's also definitely in the trial-use space, and the committee decided to make the change based on the outcome of the trial use</p>",
        "id": 208882716,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599078435
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191375\">Alexander Henket</span> <a href=\"#narrow/stream/179202-terminology/topic/Local.20CodeSystem.20declaration/near/208664771\">said</a>:</p>\n<blockquote>\n<p>My main question is really about what the experience with this is so far. Do people check NamingSystems? Does an STU3 NamingSystem have a different preferred identifier for the same system than R4? That would be my expectation. Would it be correct to even list the R4 GTIN URI in an STU3 NamingSystem? How does all this interrelate with CodeSystem.url? STU3 GTIN CodeSystem and R4 GTIN CodeSystem would be virtually different systems based on their canonical.</p>\n</blockquote>\n<p>It's certainly possible to use the NamingSystem resource for identifier translation. There isn't currently an operation to do this, although one has been proposed for R5 <a href=\"https://jira.hl7.org/browse/FHIR-26837\">JIRA 26837</a>. I've created a custom operation to do this on my R4 Server as, in addition to OID to URI changes as we move from CDA to FHIR,  an NZ government dept has already changed a group of identifiers used in production FHIR R4 systems.</p>",
        "id": 208889980,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1599081948
    },
    {
        "content": "<p>It is also arguable (intended) that when a terminology server resolves a CodeSystem URI it should look at its NamingSystems as part of the process.<br>\nOntoserver doesn't do this (yet).  I don't know what other systems do - <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 208921552,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1599109718
    },
    {
        "content": "<p>I'm not sure that my server does yet. The mini-terminology server in the validator does</p>",
        "id": 208931959,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599119708
    },
    {
        "content": "<p>Terminz uses Naming System resources for converting the Code System OIDs in CDA documents to FHIR CodeSystem URIs, but I need to extend this for resolving URIs where CodeSystem URIs have (already!) been changed by their owner.</p>",
        "id": 208948153,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1599129681
    }
]