[
    {
        "content": "<p>What is the rationale for the naming of the CodeSystem properties for LOINC's \"major axes\" (COMPONENT, PROPERTY, TIME_ASPCT, SYSTEM, SCALE_TYP, METHOD_TYP)? Is it only that these were the names of the columns in the main LOINC file in the distribution? Or are they used in external systems as well?</p>",
        "id": 153986047,
        "sender_full_name": "Jim Steel",
        "timestamp": 1534206453
    },
    {
        "content": "<p>The reason for asking is that the LOINC distribution now includes a part file (and a part link file), which seem to be a far better sources of this property data, and the part link file uses different names (and I'd argue aesthetically better names) for them (COMPONENT, PROPERTY, TIME, SYSTEM, SCALE, METHOD)</p>",
        "id": 153986049,
        "sender_full_name": "Jim Steel",
        "timestamp": 1534206610
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153986050,
        "sender_full_name": "Jim Steel",
        "timestamp": 1534206681
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span></p>",
        "id": 153986052,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534207025
    },
    {
        "content": "<p>Agreement with LOINC from our PoV</p>",
        "id": 153986053,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534207034
    },
    {
        "content": "<p>Incidentally, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  your server (like ours) currently returns part names for those properties, rather than part codes (it was the only thing that was possible until they added the part and part link files)</p>",
        "id": 153986057,
        "sender_full_name": "Jim Steel",
        "timestamp": 1534207100
    },
    {
        "content": "<p>hm. I'll add it to my list</p>",
        "id": 153986063,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534209258
    },
    {
        "content": "<p>Another change that might be considered for the LOINC normative CodeSystem properties is changing CLASS to be code-typed instead of String-typed (this code can be harvested from the LoincPartLink file, like the codes for the 6 major axes, whose properties are already code-typed)</p>",
        "id": 153993338,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536125192
    },
    {
        "content": "<p>FWIW, <a href=\"http://fhir.loinc.org\" target=\"_blank\" title=\"http://fhir.loinc.org\">fhir.loinc.org</a> still does that one as a string. It does use loinc part codes for the axis properties, but it does them as Codings rather than codes (as they're defined at <a href=\"http://build.fhir.org/loinc.html\" target=\"_blank\" title=\"http://build.fhir.org/loinc.html\">http://build.fhir.org/loinc.html</a>)</p>",
        "id": 153993340,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536125628
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> ?</p>",
        "id": 153994835,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1536477424
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> I can't speak for LOINC officially, but in the LOINC group value sets work we've looked at this.  In principle I agree with Jim that changing CLASS to Coding (or code) would be good, but in practice at present I think we may actually need to go the other way and make all of the property types (including the six major axes) string.  The reason for that is that currently LOINC hasn't defined a single part (LP) code for each unique property value \"combination\" (including the subparts for COMPONENT, SYSTEM and TIME_ASPCT), nor is there an agreed compositional syntax for doing that using the LP codes.  Probably the '^' character could be used compositionally in the same way that it is now being used in the string representation, but that hasn't been agreed and it isn't instantiated that way in the <a href=\"http://fhir.loinc.org\" target=\"_blank\" title=\"http://fhir.loinc.org\">fhir.loinc.org</a> server (which is a HAPI instance).   If the string representations were used throughout, then regex filters could be reliably used for fully defining the group (and other) value sets intensionally, but right now without that it doesn't quite work.  The fully coded approach (either compositional or with unique single LP codes) would be even better, but until we get there the string solution would be the easiest to implement.</p>",
        "id": 153994869,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536507083
    },
    {
        "content": "<p>It seems like a backwards step if LOINC are doing (IMHO) the right thing and moving to codes for properties, and (I suspect) hierarchy amongst those part codes</p>",
        "id": 153995034,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536536703
    },
    {
        "content": "<p>Also, I'm not suggesting we change the FSN</p>",
        "id": 153995035,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536536727
    },
    {
        "content": "<p>Why do we need a code for the unique combinations of parts?</p>",
        "id": 153995061,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536541372
    },
    {
        "content": "<p>Well, what we need is a full representation of the property value.  As I see it, that can be either: (1) a string value, as currently distributed in the main LOINC table; (2) a unique code that fully represents that value (including all subparts), which doesn't currently exist; or (3) a compositional expression which includes multiple codes for the value (including the existing individual codes for all of the subparts), which hasn't been defined or represented anywhere yet.  The only one of the three that currently exists and we could just use right now is #1.  It wouldn't be particularly hard to do either of the other two, but a decision would need to be made to do it that way and a bit of work would need to be done.</p>",
        "id": 153995097,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536551216
    },
    {
        "content": "<p>I don't follow. Which property?</p>",
        "id": 153995098,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536551267
    },
    {
        "content": "<p>For a given LOINC term, there is at most one Primary LOINC Part (identifiable using a Part code according to the Parts file) for each of the axis properties, right?</p>",
        "id": 153995099,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536551377
    },
    {
        "content": "<p>in particular, COMPONENT, SYSTEM or TIME_ASPCT, when subparts are present (i.e. the additional parts of the value separated by '^')</p>",
        "id": 153995100,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536551582
    },
    {
        "content": "<p>these are very important to be represented and computable (via code or regex) when constructing intensional value set definitions</p>",
        "id": 153995101,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536551682
    },
    {
        "content": "<p>I can't generate complete and accurate intensional group value set definitions (which is what I've been working on recently) unless I can rely on the property values being fully represented</p>",
        "id": 153995102,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536551828
    },
    {
        "content": "<p>Is there an example part? The parts file includes part names with ^ in them, but the part codes are different</p>",
        "id": 153995106,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536552081
    },
    {
        "content": "<p>What do you mean by \"the part codes are different\"?</p>",
        "id": 153995107,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536552150
    },
    {
        "content": "<p>it is true that the parts file includes some part names with '^', but the problem is it doesn't include that for <strong>all</strong> of them - and the ones that aren't included can't be ignored</p>",
        "id": 153995108,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536552239
    },
    {
        "content": "<p>Doesn't that mean that not all combinations are possible/allowed?</p>",
        "id": 153995109,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536552276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> can you give an example of a code &amp; property with \"the additional parts of the value separated by '^'\"?</p>",
        "id": 153995110,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1536552277
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> If you look at COMPONENT for \"Amitriptyline [Mass/volume] in Serum or Plasma --trough\" (16361-8):<br>\n<a href=\"http://fhir.loinc.org/CodeSystem/$lookup?system=http://loinc.org&amp;code=16361-8\" target=\"_blank\" title=\"http://fhir.loinc.org/CodeSystem/$lookup?system=http://loinc.org&amp;code=16361-8\">http://fhir.loinc.org/CodeSystem/$lookup?system=http://loinc.org&amp;code=16361-8</a><br>\nyou can find \"Amitriptyline\" (LP14983-8) and the \"Challenge\" 2nd subpart \"trough\" (LP20176-1), but there is nothing that represents \"Amitriptyline^trough\" as a combination</p>",
        "id": 153995113,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536553253
    },
    {
        "content": "<p>Is that not just an additional property called CHALLENGE?</p>",
        "id": 153995114,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536553327
    },
    {
        "content": "<p>Then you can just have both filters within the same include to find terms that have both?</p>",
        "id": 153995115,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536553733
    },
    {
        "content": "<p>Yes, I think that definitely <strong>could</strong> work.  But currently these subpart values are distributed as subparts of COMPONENT, SYSTEM or TIME_ASPCT, not as a separate property, and they're not represented that way in the canonical LOINC code system.  If it is true (and I suspect that it is) that <strong>all</strong> of the defined subparts can only be used in one way, so that a representation of them as additional separate individual properties is unambiguous and unique, then that is clearly another way to solve the problem.  But they're not distributed that way in the LOINC table - so currently you will still have to parse the composite strings in those three major axis properties in order to get the individual subpart property values (until and unless LOINC adds them as separate fields in the distribution).  Currently, using the existing full string values as they are already being distributed in the LOINC table will be considerably easier.</p>",
        "id": 153995117,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554080
    },
    {
        "content": "<p>It will definitely need the Parts and LoincPartLink tables as well as the main table</p>",
        "id": 153995118,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554121
    },
    {
        "content": "<p>Which are now out of beta (as of loinc 2.64)</p>",
        "id": 153995119,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554147
    },
    {
        "content": "<p>Unless there's something there that I haven't yet considered, I think that's necessary but currently is not sufficient.</p>",
        "id": 153995120,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554240
    },
    {
        "content": "<p>Maybe LoincPartLink does have it (I should look closer at that).  But even if it does, we need to change the canonical LOINC CodeSystem and the official representation in the HAPI server to include them as properties in their own right.</p>",
        "id": 153995123,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554388
    },
    {
        "content": "<p>the hapi server as in <a href=\"http://loinc.fhir.org\" target=\"_blank\" title=\"http://loinc.fhir.org\">loinc.fhir.org</a>?</p>",
        "id": 153995125,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554554
    },
    {
        "content": "<p>yes</p>",
        "id": 153995126,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554570
    },
    {
        "content": "<p>actually, <a href=\"http://fhir.loinc.org\" target=\"_blank\" title=\"http://fhir.loinc.org\">fhir.loinc.org</a></p>",
        "id": 153995127,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554585
    },
    {
        "content": "<p>sorry, yes</p>",
        "id": 153995128,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554591
    },
    {
        "content": "<p>There are already some discrepancies between that and the spec, i think</p>",
        "id": 153995129,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554605
    },
    {
        "content": "<p>yes, but it's the \"official\" source</p>",
        "id": 153995130,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554627
    },
    {
        "content": "<p>Hmm</p>",
        "id": 153995131,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554631
    },
    {
        "content": "<p>has Ontoserver fully handled this? - if so, that's a good precedent to follow</p>",
        "id": 153995132,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554658
    },
    {
        "content": "<p>We've got some stuff built, but its not released yet</p>",
        "id": 153995133,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554688
    },
    {
        "content": "<p>so it does everything that I've suggested is needed?<br>\nwe can look at it and talk to <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> if that's the case</p>",
        "id": 153995134,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554759
    },
    {
        "content": "<p>when you're ready to show it (at least as a preview)</p>",
        "id": 153995135,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554798
    },
    {
        "content": "<p>we'll need to work with <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> and <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> to get everything in sync</p>",
        "id": 153995136,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536554920
    },
    {
        "content": "<p>Yeah, sure</p>",
        "id": 153995137,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554935
    },
    {
        "content": "<p>I can certainly get our stuff up on our test server</p>",
        "id": 153995138,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536554948
    },
    {
        "content": "<p>I'll just implement the CHALLENGE property first though. Sounds like that might be useful</p>",
        "id": 153995139,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536555629
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>  I agree that LoincPartLink appears to contain the necessary level of detail (in 'Primary' properties).  Starting with the CHALLENGE property is reasonable, but I think we'll need all of them (including SUPER SYSTEM and TIME MODIFIER, and I'm pretty sure also ADJUSTMENT, COUNT and DIVISORS) to make it fully useful.</p>",
        "id": 153995142,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536558171
    },
    {
        "content": "<p>In HAPI the terminology uploader (specifically LoincPartLinkHandler and related code for properties) will need to be updated to utilize this data.</p>",
        "id": 153995143,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536558907
    },
    {
        "content": "<p>I assume that's just for Primary parts, not Search parts? The Search ones to me look like some kind of early attempt at hierarchy</p>",
        "id": 153995157,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536560046
    },
    {
        "content": "<p>The Part file stuff still needs some work, I suspect. I found only a small overlap between the Part codes I harvested from the multi-axial hierarchy file and those I harvested from the Parts file.</p>",
        "id": 153995158,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536560166
    },
    {
        "content": "<p>Also, if you're updating to incorporate Part and PartLink files, you may want to look at Answer and AnswerLink files, and perhaps the Group stuff (if you haven't already), which also all have relatively recently come out of Beta</p>",
        "id": 153995159,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536560166
    },
    {
        "content": "<p>right - most of the work on the intensional group value set definitions has been done, but without the full property representations it isn't fully useable yet<br>\nI haven't worked on the answers and answer links, but I think that <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> has all of that working</p>",
        "id": 153995161,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536560831
    },
    {
        "content": "<p>Is the aim for the groups that there will be standard normative intensional ValueSets maintained by Regenstrief and distributed along with the release?</p>",
        "id": 153995168,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536565913
    },
    {
        "content": "<p>The Groups stuff in the distribution looks like it would be hard to parse intensional ValueSets from automatically</p>",
        "id": 153995169,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536566060
    },
    {
        "content": "<p>(extensional would be pretty easy though)</p>",
        "id": 153995170,
        "sender_full_name": "Jim Steel",
        "timestamp": 1536566071
    },
    {
        "content": "<p>Right - you need additional data that isn't part of the LOINC distribution to accurately generate the intensional definitions.  And yes, extensional is pretty straightforward (for both the groups and parent groups).</p>",
        "id": 153995171,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536566353
    },
    {
        "content": "<p>Thanks for the good comments here. I'll try to chime in on 3 relevant points. First, to go way back to the Property naming issue, we discussed this at the LOINC Committee (with input from the HL7/FHIR folks too) and agreed the most straightforward approach was to use the official field names for the main properties, but adopted more fhir-style ones for new/custom. Second, we'd be open to modifying CLASS to be coding if the community would prefer it that way. (Strings can be gleaned from LOINC Table, Part codes have to be gleaned from LoincPartLink table). Third, there are several forces that are leading us in the direction to update the canonical property list to include all of the more detailed part types. The Component, for example, can really have subparts (as defined in the User Guide) but also more fine grained distinctions that aren't well described (e.g. suffixes, divisors, etc). But there are issues: We may not be creating all the Parts we need (e.g. for deprecated terms), not all the link types (PRIMARY vs SEARCH) are being labeled right, etc. So this will take some work to fix, in terms of the LOINC release artifacts, the canonical definition, and of course servers that are implementing it. From the LOINC side, this will be something we're working on in the next year. We will definitely be looking for input/feedback from the FHIR community along the way. The interim challenge is that right now, the only workable strategy for building the most complicated value sets (e.g LOINC Groups) intensionally is with strings. But, my personal preference would be to keep moving forward with the coded part-based approach.</p>",
        "id": 153996195,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1536749165
    },
    {
        "content": "<p>Thanks, Dan.  I agree with you that the coded part-based approach clearly is the best strategy in the long run.  So if there isn't a compelling reason that requires making the intensional definitions (for group and other complicated value sets) fully operational now, it makes sense to continue to move forward with the coded approach.  Changing CLASS to a coded property would seem to be a straightforward initial move to make in that direction.</p>",
        "id": 153996242,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536761645
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> we're really keen to have a usefully complete implementation and using coded values is a much preferred solution to string values.<br>\nCan you also comment on the choice to use Coding rather than code - the spec (<a href=\"http://build.fhir.org/loinc.html#props\" target=\"_blank\" title=\"http://build.fhir.org/loinc.html#props\">http://build.fhir.org/loinc.html#props</a>) defines these properties as being code-typed</p>",
        "id": 153996432,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1536803542
    }
]