[
    {
        "content": "<p>Hi everybody,</p>\n<p>I hope this question is not considered off topic but I have already asked it in the LOINC forum and have no other idea where to reach out to people with more knowledge. </p>\n<p>Currently we are working to import lab results into a FHIR server and want to use LOINC codes to identify them. On example would be food allergy to walnuts. Here we check for IgE antibodies in a dried blood spot. The test is similar to 41198-3 but differs in the system.</p>\n<p>Overall I don’t see many LOINC codes for tests with dried blood. It this, because the distinction between dried blood and serum is not important for LOINC or because dried blood tests are not so common elsewhere?</p>\n<p>So my question is, if I should require a new LOINC code for every one of our tests (we have many &gt;200) or should I use the one for serum where available?</p>\n<p>Best Erik</p>",
        "id": 219954867,
        "sender_full_name": "Erik Krempel",
        "timestamp": 1608025158
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 219982591,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608040884
    },
    {
        "content": "<p>What most of them likely need are just  LOINC codes with the system type Bld (i.e., whole blood) rather than Dried Blood codes.</p>",
        "id": 219985298,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608042153
    },
    {
        "content": "<p>Of course, you might need to propose new term requests to LOINC Committee if no right codes available.  For example, indeed, there are only a small amount of LOINC codes for IgE of Bld.  See <a href=\"https://search.loinc.org/searchLOINC/search.zul?query=ige+whole+blood\">https://search.loinc.org/searchLOINC/search.zul?query=ige+whole+blood</a></p>",
        "id": 219986124,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608042519
    },
    {
        "content": "<p>I think this should definitely be discussed with the LOINC staff and Committee.  LOINC does have a SYSTEM code for 'Blood.dried', but I don't know if new LOINC codes may be needed for these tests.</p>",
        "id": 220005441,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1608050104
    },
    {
        "content": "<p>Thanks for your answers.  Next to Blood.dried there is <a href=\"http://Bld.dot\">Bld.dot</a> (DBS) with more codes. In my understanding they are pretty similar. </p>\n<p>When I have a look at all the existing DBS tests there a typically quantitative scales like [Moles/volume]. I have no idea how this is done with DBS in a way that makes results comparable. Concentration in the sample is strongly influenced by the solvent used prior to processing. Some level of calibration would be needed. I still have the feeling that my understanding is missing some critical point to understand how it is used in LOINC so far. Therefore I am a bit reluctant to request new codes for our tests.</p>\n<p>Could you point me to the right way to start a discussing with the LOINC staff? I tried posting the question in the forum, but after three weeks there was only one read and no reply.</p>",
        "id": 220087069,
        "sender_full_name": "Erik Krempel",
        "timestamp": 1608106234
    },
    {
        "content": "<p><a href=\"https://loinc.org/contact/\">https://loinc.org/contact/</a></p>",
        "id": 220105238,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608118838
    },
    {
        "content": "<p><a href=\"https://loinc.org/submissions/\">https://loinc.org/submissions/</a></p>",
        "id": 220105245,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608118847
    },
    {
        "content": "<p>Yes, <a href=\"http://Bld.dot\">Bld.dot</a> is more specific and more suitable for your case.</p>",
        "id": 220105310,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608118913
    },
    {
        "content": "<p>LOINC forum is not a very active place.</p>",
        "id": 220105387,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608118957
    }
]