[
    {
        "content": "<p>Hi,<br>\nI've been looking at LOINC's Linguistic variants with a view to mapping them to CodeSystem supplements. Looking at the distribution format, its basically the same structure as the old LOINC table. It looks easy enough to provide translations of the LOINC terms' LCNs and short names, but its a bit of a nuisance to provide translations of part names (the rest of the distribution has progressed nicely to providing actual term-part links and part tables instead of just part names in the main table), and not possible to provide translations of answer list or answer code displays. Are there any plans to have a more structured representation of the Linguistic Variants (in line with the way the main distribution has been moving)? If not, please consider this a suggestion for it :) <span class=\"user-mention\" data-user-id=\"193853\">@Swapna Abhyankar</span></p>",
        "id": 220327581,
        "sender_full_name": "Jim Steel",
        "timestamp": 1608255475
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> ,<br>\nWe don't have any plans right now to change our distribution of the linguistic variants but will certainly take that under consideration. Can you please send more specific information, including specific suggestions for the format you would like to see, to <a href=\"mailto:loinc@loinc.org\">loinc@loinc.org</a>? A couple things to keep in mind - right now we have volunteer translators who either translate Parts or the LCN (their choice) for a subset of terms/parts. The translations are a release behind, so the new content released this week as part of LOINC 2.69 will be translated over the next few months and released with LOINC 2.70 in June. Some translators update their translations every cycle, but some only do so every few years, and some have not been updated in many years, so the contents of each variant are pretty variable.</p>",
        "id": 220428168,
        "sender_full_name": "Swapna Abhyankar",
        "timestamp": 1608325590
    }
]