[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> I have a LOINC problem that I'm confused about. What's the relationship between the answers sheet in LOINC_263_PanelsAndForms.xlsx from the LOINC Panels and Forms File,  and the AnswerList_Beta_1.csv in the LOINC Answer File, Beta 1 download?</p>",
        "id": 153935650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517963265
    },
    {
        "content": "<p>Daniel and I talked about something like this in Amsterdam. Are you finding some concepts in the Answer File that aren't in the Panels and Forms file?</p>",
        "id": 153935651,
        "sender_full_name": "Jim Steel",
        "timestamp": 1517963326
    },
    {
        "content": "<p>y. LL4033-8 -</p>",
        "id": 153935652,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517963355
    },
    {
        "content": "<p>Yeah, there are a bunch. Especially in cancer, IIRC</p>",
        "id": 153935653,
        "sender_full_name": "Jim Steel",
        "timestamp": 1517963378
    },
    {
        "content": "<p>my server does not support <a href=\"http://loinc.org/vs/LL4033-8\" target=\"_blank\" title=\"http://loinc.org/vs/LL4033-8\">http://loinc.org/vs/LL4033-8</a> because of this.</p>",
        "id": 153935654,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517963389
    },
    {
        "content": "<p>Yeah, Ontoserver has the same problem</p>",
        "id": 153935655,
        "sender_full_name": "Jim Steel",
        "timestamp": 1517963405
    },
    {
        "content": "<p>My understanding is that down the track, we should be using the Answers file to harvest answer and answer list concepts, instead of the Panels and Forms file. I'm reluctant to do that while its still beta, though</p>",
        "id": 153935656,
        "sender_full_name": "Jim Steel",
        "timestamp": 1517963457
    },
    {
        "content": "<p>the answers file looks like a subset to me - I haven't done a full analysis ut the row count is significantly less</p>",
        "id": 153935657,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517963595
    },
    {
        "content": "<p>We sort of need the beta codes.  They're referenced in normative v2 specifications and we're trying to reference them in STU FHIR specifications.</p>",
        "id": 153935703,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517974291
    },
    {
        "content": "<p>how can we reference beta codes from normative specifications? and which ones?</p>",
        "id": 153935704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517974344
    },
    {
        "content": "<p>Actually, it looks like they're ANSI Technical Reports, so informative, not normative.</p>",
        "id": 153935709,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517974785
    },
    {
        "content": "<p>Lots of them.  There's an IG for genetic reporting and another for cytogenetic reporting and both have a whole whack of new LOINC codes, about half of which have answer lists which I suspect will be in the \"beta\" list.  And it's entirely possible they'll see some evolution from feedback from the FHIR process.  But I think we still need to expose them - otherwise balloters won't be able to see the proposed codes.</p>",
        "id": 153935710,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517974875
    },
    {
        "content": "<p>in principle, I'm fine with exposing them. But I'm hoping that <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> or someone familiar with LOINC can clarify the difference between them, so I know how to load them with the least amount of work... right now, I see 90k lines in one, and 20k lines in the other, where the smaller one contains codes the larger doesn't... what are implementers supposed to do?</p>",
        "id": 153935712,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517975018
    }
]