[
    {
        "content": "<p>I've come across a number of LOINC answer lists that, in addition to the LOINC Answer IDs,  also explicitly list a corresponding SNOMED code for each answer (underneath the display text). Example are e.g. <a href=\"https://loinc.org/LL360-9/\">LL360-9 (positive/negative)</a> or <a href=\"https://loinc.org/LL2419-1/\">LL2419-1 (blood group)</a>. The latter, in turn, is the preferred answer list for <a href=\"https://loinc.org/883-9/\">LOINC 883-9 </a>. </p>\n<p>My question is whether it is considered best practice to use the LOINC answer ID codes to encode answers or rather the associated SNOMED codes. The former seems to be what the \"preferred answer list\" suggests. Then the corresponding ValueSet are also directly available, e.g. for referencing in a Questionnaire. However, one of the standard Observation examples is a blood group observation  (<a href=\"https://www.hl7.org/fhir/r4/observation-example-bloodgroup.json\">this one</a>).  It has <code>code</code> LOINC 883-9, but for the result it does not use an answer ID from the LOINC answer list but rather the equivalent SNOMED code.</p>",
        "id": 208800923,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599040193
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> LOINC answers are only strings and don't have definitions. For example \"clear\" is used in the LOINC list for diets, breath sounds, and others. If your country uses SNOMED CT, I would encourage you to use the SNOMED Codes.</p>",
        "id": 208875449,
        "sender_full_name": "Susan Matney",
        "timestamp": 1599074957
    },
    {
        "content": "<p>OK, I will stick to SNOMED then. For my understanding: In what contexts would one then actually use the LOINC Answer IDs? I was under the impression that they are \"normal\" codes in the FHIR context since the LOINC terminology server provides  answer sets (with the Answer IDs as codes) as ValueSet resources (e.g. breath sounds = <a href=\"http://loinc.org/vs/LL3841-5\">http://loinc.org/vs/LL3841-5</a>).</p>",
        "id": 208928484,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599117281
    },
    {
        "content": "<p>Is that true (that LOINC answers are only strings)? we have LOINC answer codes in our server</p>",
        "id": 208932012,
        "sender_full_name": "Jim Steel",
        "timestamp": 1599119745
    },
    {
        "content": "<p>Clear is LA19732-9</p>",
        "id": 208932129,
        "sender_full_name": "Jim Steel",
        "timestamp": 1599119810
    },
    {
        "content": "<p>(Notwithstanding that, I definitely agree with the advice of using SNOMED CT if that is what your country uses!)</p>",
        "id": 208932325,
        "sender_full_name": "Jim Steel",
        "timestamp": 1599119956
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> Right, this is what confuses me a bit (quite possibly due to a lack of understanding of LOINC on my part): in the ValueSet resources, the Answer ID appear as normal codes, but if you look at the LOINC pages for the answer sets (e.g. <a href=\"https://loinc.org/LL2419-1/\">https://loinc.org/LL2419-1/</a>), \"Answer ID\" and \"Code\" are different columns and the latter is empty for all entries.</p>",
        "id": 208938001,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599123196
    },
    {
        "content": "<p>Background: I am working in the context of a European project taking IPS as the guiding star (the latter uses both LOINC and the SNOMED GPS subset). I had a quick look at their <a href=\"http://www.hl7.org/fhir/uv/ips/STU1/StructureDefinition-Observation-pregnancy-status-uv-ips.html\">pregnancy Observation profile</a> and that requires the pregnancy status to be indicated by a LOINC answer ID from an <a href=\"http://www.hl7.org/fhir/uv/ips/STU1/ValueSet-pregnancy-status-uv-ips.html\">IPS ValuesSet</a> that matches the LOINC answer list <a href=\"https://loinc.org/LL4129-4\">https://loinc.org/LL4129-4</a>. However, in this case not all the answer IDs have an indicated SNOMED code. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Was there a defined approach to the use of LOINC answer set in IPS?</p>",
        "id": 208938029,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599123219
    },
    {
        "content": "<p>Well, I will first say that the LOINC answer codes are in fact legitimate codes (as <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> has described) - saying that they are just \"strings\" isn't really an accurate description (all codes, including SNOMED CT, have descriptions that are \"just strings\", and these are no different).  The next question is are they \"good\" codes, or a good choice to use in any particular context.  The LOINC answer code lists do have one particular characteristic which may be an advantage in some situations, in that they are very specifically and tightly linked to the specific LOINC observation codes that they are associated with.  In some cases that may make them a better choice to use than a set of SNOMED CT codes that weren't developed exactly for that particular context.  Actually, I think that for the most part the LOINC answer codes are pretty well defined in the context of the observation code that they are used with, as I mentioned.  SNOMED CT codes also generally don't have formal definitions (only a very few of them do), and their meaning is still considered to be what is stated in the fully specified name (which is, of course, a string).  But SNOMED CT codes do also have the hierarchical relationships which the LOINC codes do not have - and that clearly gives the SNOMED CT codes the edge in most cases (if other considerations aren't in play).  </p>\n<p>With that in mind, now I'll try to answer the question about the approach of using the LOINC answer codes in IPS.  The main principle, I think, that drove that decision is that where possible we wanted to specify codes so that the <strong>same</strong> set of codes could be used for a particular data element by <strong>everyone</strong> around the world (after all, it is the \"international\" patient summary).  There were many places where we couldn't do that (like medication codes, for example).  But where we could reasonably do it, that's what we tried to do.  But in those (relatively few) cases, we might not be able to use SNOMED CT because there are associated licensing issues and costs, as not all countries are SNOMED members, and if the particular codes weren't included in the GPS (Global Patient Set) then we couldn't do anything more than just include them as an option (example binding) .  On top of that, when we started working on the FHIR IPS IG the GPS didn't yet exist, and in some places we may have chosen some codes (like LOINC answer lists) where we could or would have made a different choice if the SNOMED CT codes had been available in the GPS at the time that we were making the decision.  Once the GPS was available, we tried to incorporate it wherever it made sense and we could, but we didn't necessarily go back and reconsider every one of the decisions that we had made earlier.</p>\n<p>I don't actually recall all of the places in IPS where we have specified LOINC answer codes, but the <a href=\"http://hl7.org/fhir/uv/ips/StructureDefinition-Observation-tobaccouse-uv-ips.html\">tobacco use observation</a> is one of them.  In that case the Observation.code is fixed to LOINC 72166-2 \"Tobacco smoking status\", and Observation.value has a required binding to the associated list of 8 LOINC answer codes (from LL2201-3, with description \"Smoking Status - HL7 Value Set / Value Set based on HL7 Vocab TC and Structured Doc consensus (per CDC submission 7/12/2012 for smoking status term)\").  I think this is a case where probably now there are SNOMED CT codes for this in the GPS that we <strong>could</strong> use instead, but the LOINC answer codes are still a very logical and appropriate choice for use with the LOINC 72166-2 code for the observation, and we didn't see any clear reason to change that.</p>",
        "id": 208967181,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1599140096
    },
    {
        "content": "<p>Thank you for the thorough analysis <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>! - gives me a good basis for an informed choice.</p>",
        "id": 209067770,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1599208456
    },
    {
        "content": "<p>I also forgot to mention in reference to your earlier comment on the confusion with the LOINC answer lists and the empty \"Code\" but populated \"Answer ID\" columns, that I also don't understand why they are displaying it that way.  It does seem confusing, as it indeed seems to suggest that an \"answer id\" isn't a \"code\".  But, as you also noted, the answer ids are being treated as \"normal codes\" in the LOINC FHIR representation (in the value sets and otherwise), and that's how I would consider them.  <span class=\"user-mention\" data-user-id=\"193853\">@Swapna Abhyankar</span>?</p>",
        "id": 209091831,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1599225284
    }
]