[
    {
        "content": "<p>Does anyone know what it means to have a LOINC code that references a different organization in the name, and has a copyright notice that the code \"is used with permission\" from that external organization?<br>\n<a href=\"https://loinc.org/75772-4/\">Advance directives panel [ADVault]</a></p>",
        "id": 257397225,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1634143199
    },
    {
        "content": "<p>It usually means, and does in this case, that the code is specific to the particular context described by the definition. So for this one, that code represent the ADVault panel specifically and should be used to represent that specific use. If you have a different advance directive set of questions you need to identify, you should use a different code. The only \"generic\" set I see for a collection of AD questions is for use in C-CDA <a href=\"https://loinc.org/75911-8/\">Advance directives panel</a> and if the intent is to use this for a set of IG-specified questions in FHIR, we need LOINC to confirm we can do that. <span class=\"user-mention\" data-user-id=\"234040\">@Jami Deckard</span> <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span></p>",
        "id": 257411634,
        "sender_full_name": "Robert McClure",
        "timestamp": 1634148651
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> , I have just been talking with representatives from ADVault about these codes particularly in relation to the PACIO Advance Directives Interoperability. Are you working with Advance Directives? Can you share what you are looking to do with such a code?</p>",
        "id": 257738526,
        "sender_full_name": "Corey Spears",
        "timestamp": 1634320512
    },
    {
        "content": "<p>I was just curious what it meant for LOINC codes to be from an external entity. The initial pointer to the codes came from the PACIO project.</p>",
        "id": 257742260,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1634322061
    },
    {
        "content": "<p>The answer we came to is that it depends on the details.  From what I understood, the panel is specific. The concepts for codes underneath are currently listed as copyrighted, though I do not think that was the original intended purpose when they were created. <span class=\"user-mention\" data-user-id=\"380222\">@Sara Armson</span> provided us a great overview. <span class=\"user-mention\" data-user-id=\"270306\">@Maria D Moen</span> may want to chime in with her thoughts.</p>",
        "id": 257770981,
        "sender_full_name": "Corey Spears",
        "timestamp": 1634334944
    },
    {
        "content": "<p>We are asking LOINC to remove the copyright from the terms included in the Advance Directive Panel, while keeping the copyright on the panel itself.  That should resolve any concerns about the intent to have the codes available to the general public for use.</p>",
        "id": 259261164,
        "sender_full_name": "Maria D Moen",
        "timestamp": 1635350052
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span></p>",
        "id": 259289345,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1635361106
    },
    {
        "content": "<p>LOINC has accepted our request to remove the copyright on the 80 (or so) concepts related to our panel, and just retain the copyright attribution on the panel itself.  We expect to see the changes with the Feb 2022 LOINC release.  <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  Thank you for all of your comments, we all came together to find the right solution!</p>",
        "id": 260030920,
        "sender_full_name": "Maria D Moen",
        "timestamp": 1635874510
    }
]