[
    {
        "content": "<p>Marital status contains the value \"legally separated.\" We have the value \"separated.\" We don't track jurisdiction for this value or whether any specific legal criterion is or must be met.</p>\n<p>DSTU2: binding is required. 4 will be extensible.</p>\n<p>Do we need to create our own MaritalStatus extension for our value, or is this close enough? What use cases do we anticipate partners using this for? (Asking local record SMEs as well.)</p>\n<p>If we do create an extension, it will make our lives easier to use it for all marital status values, not just the one that doesn't fit. </p>\n<p>How are others dealing with these required-but-doesn't-quite-fit cases?</p>",
        "id": 173117989,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1565706369
    },
    {
        "content": "<p>Sounds like a case for OTH - \"If the only thing that is unknown is how to properly express the value in the necessary constraints (value set, datatype, etc.), then the OTH or UNC flavor should be used.\" -- <a href=\"https://www.hl7.org/fhir/valueset-marital-status.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-marital-status.html\">https://www.hl7.org/fhir/valueset-marital-status.html</a></p>",
        "id": 173169932,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1565750020
    },
    {
        "content": "<p>it's not clear to me whether that means 'separated for legal purposes' or 'separated with legal evidence'</p>",
        "id": 173185152,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565772231
    },
    {
        "content": "<p>I assume legally separated means any separation that has a legal documentation of any kind. Using that, there is a need for \"Separated\" as a different concept that subsumes Legally Separated and I'd say that is an extension.</p>",
        "id": 173233678,
        "sender_full_name": "Robert McClure",
        "timestamp": 1565810592
    },
    {
        "content": "<p>at the minimum we should have a hamonization proposal to clarify whether your assumption is true or not. And if it's true, we should add 'separated' as opposed to 'legally separated'</p>",
        "id": 173240456,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565815385
    }
]