[
    {
        "content": "<p>If CodeSystem.valueSet has been given a value in a CodeSystem supplement (i.e., CodeSystem.supplements also has a value):</p>\n<ol>\n<li>is this legal</li>\n<li>if so, what should it mean?</li>\n</ol>\n<p>I don't have a good feel for the answer to 1., but if it is yes, then I would suggest that the meaning is \"all codes in the supplemented code system, supplemented by this supplement\".  i.e., with all the supplement's designations and properties.</p>",
        "id": 224143304,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1611727017
    },
    {
        "content": "<p>A supplement can't change a value set definition, it can only change the expansion contents.  As such, my preference would be to say that supplements can't have a defining value set.</p>",
        "id": 224192636,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611759497
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> that supplements can not add concepts (per the defined intent of a supplement)  and it is concepts that the value set \"definition\" (ie: the scope) represents. But it is possible that the scope describes concept attributes that are only available in the supplement, therefore determining the expansion can only be done by using the supplement.</p>",
        "id": 224201890,
        "sender_full_name": "Robert McClure",
        "timestamp": 1611763090
    },
    {
        "content": "<p>Certainly a supplement should not change the meaning of the existing valueset declared on the base CodeSystem, but what about a new (different) valueSet URI?<br>\nIf anything, it could either be all codes in the code system, with supplemented features, or just all supplemented (in this one) codes.</p>",
        "id": 224263618,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1611789794
    },
    {
        "content": "<p>So we'd define a separate value set that is identical to the canonical value set for the base code system and only adds \"and use this supplement\"?  Is there really value in that?</p>",
        "id": 224269741,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611794102
    },
    {
        "content": "<p>Agreed, the value is possibly quite limited. But currently there is nothing said about the valueSet property in a supplement, and this leaves a grey are that really should be clarified.</p>\n<p>As a potential use-case, consider a code system supplement for SNOMED CT that includes (a library of) post coordination expressions. It might be quite convenient to have the supplement's valueSet URI be usable as either: \"all codes in SNOMED as well as the expressions in this supplement\", or \"all codes &amp; expressions in this supplement\".</p>",
        "id": 224289790,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1611816625
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> , might be that it's Thursday of the WGM and my brain is mush,  but I'm just going to restate my understanding for any other poor souls who are trying to follow.</p>\n<p>The definition of codesystem.valueset = \"Canonical reference to the value set with entire code system\" where \"The definition of the value set SHALL include all codes from this code system and only codes from this code system, and it SHALL be immutable\"<br>\nwhile the definition of  codesystem.supplements = \"Canonical URL of Code System this adds designations and properties to\" </p>\n<p>In your example,  that equates to a codesystem resource representing \"all codes in SNOMED as well as the expressions in this supplement\" via<br>\ncodesystem.valueset = <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a><br>\ncodesystem.supplements = (library of SCT post coordinated expressions)</p>\n<p>Where I get lost is the \"It would be quite convenient to have the  supplement's valueSet URI be usable\"...are you saying you'd then use the URL for the codeystem defined above in another codesystem.valueset declaration?</p>\n<p>There is still a lot of work to be done around further clarifying the use of supplements. Thus the \"black box\" type warning that still exists stating \"The impact of Code System supplements on value set expansion - and therefore value set validation - is subject to ongoing experimentation and implementation testing, and further clarification and additional rules might be proposed in future versions of this specification.\" </p>\n<p>Perhaps from this we could get some folks to start drafting that verbiage...</p>",
        "id": 224340845,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1611847353
    },
    {
        "content": "<p>Perhaps it's best to avoid the SNOMED and post coordination example in the first case.<br>\nLet's start with a CodeSystem, A, with URI <code>http://example.com/A</code> and valueSet URI <code>http://example.com/A/vs</code>.  This code system is in English and has codes X, and Y.<br>\nThus an expansion of <code>http://example.com/A/vs</code> returns the codes X and Y with English display text.</p>\n<p>Now define a CodeSystem supplement, B, of our CodeSystem A.  The supplement will have the URI <code>http://example.com/A-sup</code>, supplements=<code>http://example.com/A</code>, a translation to Icelandic of code X, an extra property for X, and lets also set its valueSet URI to <code>http://example.com/A-sup/vs</code>.</p>\n<p>So, what now should an expansion of <code>http://example.com/A-sup/vs</code> return, if anything at all?</p>\n<p>I am suggesting that it should retain the \"all codes from this code system and only codes from this code system\" semantics, but that it should also behave as if the ValueSet included the <a href=\"http://hl7.org/fhir/StructureDefinition/valueset-supplement\">http://hl7.org/fhir/StructureDefinition/valueset-supplement</a> extension with a reference to <code>http://example.com/A-sup</code>.</p>",
        "id": 224424932,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1611888234
    },
    {
        "content": "<p>CS and its supplement(s) are not aways from the same authoring organization.  So how to determine the URIs for them?</p>",
        "id": 224555382,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1611967401
    },
    {
        "content": "<p>There's no algorithm to determine URIs.  You have to find them declared - e.g. in a registry or documentation or something.</p>",
        "id": 224588572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612018215
    },
    {
        "content": "<p>Typically the owner of a code system will have no clue that many supplements even exist.</p>",
        "id": 224588583,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612018241
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Emm, Agree.  Thanks a lot.</p>",
        "id": 224818116,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1612229174
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> above, but we would need to be clear that the membership of the value sets is identical; it's only the displays and properties that might be different</p>",
        "id": 225230604,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612476365
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> It took me a while to work through your phrasing of \"a value set of the supplement\" because I think of this as a value set that <em>uses</em> something specific drawn from the supplement and not be \"the supplement value set.\".  But I think we are assuming the same thing where e value set include would specify system/version  <em>of the supplement.</em>  And then I agree with  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  that things need to align, at least the code system supplement has to have all the concepts needed by the value set. </p>\n<p>This does raise the real concern that this means value sets could be created that only rely upon the supplement for content meaning control of the code system content used may be suspect. Do others have this concern?</p>",
        "id": 226171168,
        "sender_full_name": "Robert McClure",
        "timestamp": 1613151912
    },
    {
        "content": "<p>Supplements can't define concept meaning, so not sure how this could be a concern.</p>",
        "id": 226171987,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613152127
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179202-terminology/topic/meaning.20of.20CodeSystem.2EvalueSet.20in.20a.20supplement/near/226171987\">said</a>:</p>\n<blockquote>\n<p>Supplements can't define concept meaning, so not sure how this could be a concern.</p>\n</blockquote>\n<p>In Michael's example of a CodeSystem resource where the content is defined as 'supplement', the code of each post-coordinated concept contains the Compositional Grammar defining the meaning of the Concept.  That begs the question as to whether the meaning  of those concepts is defined exclusively in those codes,  and therefore in the supplement, or elsewhere.</p>",
        "id": 226205252,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1613169097
    },
    {
        "content": "<p>A supplement can define relationships, it can't define an additional syntax.  If you want to leverage existing codes and define a post-coordinated code that draws on them, that's a new CodeSystem.  All \"code\" values must be recognized by the original code system, regardless of what supplements are in play.</p>",
        "id": 226207763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613170675
    },
    {
        "content": "<p>All post coordinations _are_valid recognised members of the original CodeSystem.</p>",
        "id": 226224552,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613188243
    },
    {
        "content": "<p>At least in the case of SNOMED CT</p>",
        "id": 226224560,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613188256
    },
    {
        "content": "<p>yes - I was just going to say that</p>",
        "id": 226224571,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1613188269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> what I'm referring to is an implicit ValueSet identified by the CodeSystem.valueSet URI as specified in the supplement itself.<br>\nAt the moment there's no requirement that it has the same value as the CodeSystem being supplemented.</p>",
        "id": 226224714,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613188466
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191343\">Michael Lawley</span> <a href=\"#narrow/stream/179202-terminology/topic/meaning.20of.20CodeSystem.2EvalueSet.20in.20a.20supplement/near/226224552\">said</a>:</p>\n<blockquote>\n<p>All post coordinations _are_valid recognised members of the original CodeSystem.</p>\n</blockquote>\n<p>OK, the concepts in the post-coordinated expressions (PCE) are valid members of the supplemented Code System - but I don't see how the concept represented by the complete PCE can be said to be in that code system. While I realize that supplements are a handy containers for PCEs, I don't see how they fit into the definition of a supplement in the spec as being ' designations or properties'. Maybe that definition is the problem and needs to be extended to include PCEs?</p>",
        "id": 226225817,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1613190232
    },
    {
        "content": "<p>I would expect CodeSystem/$validate-code for a snomed PCE to succeed (subject to syntax etc), so I should be able to use the PCE in a supplement to, for example, supply designations.</p>\n<p>After all, the spec says:</p>\n<blockquote>\n<p>The following SNOMED CT artifacts are valid in the code element for the <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a> namespace: Concept IDs  and SNOMED CT Expressions  (using SNOMED CT Compositional Grammar ). SNOMED CT Terms  and Description Identifiers  are not valid as codes in FHIR, nor are other alternative identifiers associated with SNOMED CT Concepts.</p>\n</blockquote>",
        "id": 226226111,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613190704
    },
    {
        "content": "<p>Supplements can't define post-coordinated expressions.  I'm not even sure they can supplement them - we've never talked about that and I think it'd be problematic.  SNOMED doesn't allow you to define a designation for a PCE.  Why should a supplement?  Supplements don't allow you to do anything you couldn't do in the original code system if the code system author had wanted to.</p>",
        "id": 226226229,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613190861
    },
    {
        "content": "<p>The snomed PCG specification at least allows:</p>\n<blockquote>\n<p>Automatically transforming the expression into a human-readable term using a predefined algorithm. For example, a simple algorithm may just remove the concept identifiers and nesting – e.g. \"fracture of bone: finding site = arm, laterality = left\". More sophisticated algorithms may use pattern matching and predefined templates to construct a more natural term – e.g. \"fracture of bone in left arm\";</p>\n</blockquote>\n<p>So it should at least be allowable to record the result of such an algorithm in a supplement?</p>\n<p>Also, PCEs are valid snomed codes - the supplement isn't \"defining them\", only using them.</p>",
        "id": 226227028,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613192183
    },
    {
        "content": "<p>Sorry, link for above text is <a href=\"https://confluence.ihtsdotools.org/plugins/servlet/mobile?contentId=29951571#content/view/29951571\">https://confluence.ihtsdotools.org/plugins/servlet/mobile?contentId=29951571#content/view/29951571</a></p>",
        "id": 226227033,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613192212
    },
    {
        "content": "<p>No.  Because there's no mechanism to record the result of executing the algorithm in the base code system.  The code system allows you to list codes and display names.  It doesn't allow you to list display names for a post-coordinated expression.  A supplement is no different in that respect.</p>",
        "id": 226231349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613199886
    },
    {
        "content": "<p>CodeSystem.concept.code isn't allowed to contain a post-coordinated expression.  That's as true when defining the code system as when defining a supplement.  Valueset.compose.concept.code is free to contain post-coordinated expressions, and you're free to list the results of the naming algorithm in the designations there.</p>",
        "id": 226231410,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613199998
    },
    {
        "content": "<p>Where is that stated?</p>\n<blockquote>\n<p>Element Id    CodeSystem.concept.code<br>\nDefinition    A code - a text symbol - that uniquely identifies the concept within the code system.</p>\n</blockquote>\n<p><code>421720008 |Spray dose form|  +  7946007 |Drug suspension|</code> or <code> 421720008 + 7946007</code> is a SNOMED code that identifies the concept \"drug suspension in spray dose form\"</p>",
        "id": 226233444,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613203566
    },
    {
        "content": "<p>CodeSystem defines codes, not combinations.</p>",
        "id": 226252207,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613232278
    },
    {
        "content": "<p>Allowed combinations is defined by an algorithm that, at present, is shareable in CodeSystem as descriptive text.</p>",
        "id": 226252226,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613232308
    },
    {
        "content": "<p>So you would have the same constraints for common UCUM expressions?</p>",
        "id": 226271934,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613254473
    },
    {
        "content": "<p>My reading of the spec doesn't include the constraints you're talking about:</p>\n<p><a href=\"http://hl7.org/fhir/codesystem.html#scope\">http://hl7.org/fhir/codesystem.html#scope</a></p>\n<blockquote>\n<p>In addition, the CodeSystem resource may <strong>list</strong> some or all of the <strong>concepts</strong> in the code system</p>\n</blockquote>\n<p>But, I'm approaching this  from a \"is it ruled out\" perspective, whereas (I assume) you're approaching it from a different perspective which is not at all clear to me.</p>",
        "id": 226272452,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613255248
    },
    {
        "content": "<p>I would.  I'd expect to see \"m\" and \"L\" as codes in a UCUM code system, but I'd only expect to see \"mL\" in a value set.</p>",
        "id": 226272759,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613255668
    },
    {
        "content": "<p>Certainly this is something we ought to clarify in the resource.  Right now, the words pre and post-coordination don't appear on the page at all...<br>\nThoughts <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>?</p>",
        "id": 226272841,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613255823
    },
    {
        "content": "<p>My concern with allowing post-coordinated codes to be listed is how a consumer differentiates post-coordinated expressions from actual 'codes'.  Also, what's the value of enumerating the combinations in the system when the whole point of having post-coordination is to avoid having to enumerate when defining?</p>",
        "id": 226272897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613255908
    },
    {
        "content": "<p>I would ask why a consumer needs to do such differentiation?  In SNOMED, expressions _are_ codes, just as concept ids _are_ codes.  But when does a consumer need to differentiate <code>m</code> from <code>mL</code> in UCUM?</p>",
        "id": 226273001,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613256114
    },
    {
        "content": "<p>Being able to enumerate some post-coordinations is not the same as _having_ to enumerate them.</p>",
        "id": 226273128,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613256265
    },
    {
        "content": "<p>The use-case we are trying to support is an 'expression library' -- from an implementation perspective, enumerating the expressions in a supplement means we can pre-process them (run a classifier and pre-compute subsumptions etc), using the results to inform ValueSet expansions.  It also allows people to associate designations, including translations, with the expressions to support <code>$expand?filter=...</code></p>",
        "id": 226273380,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613256671
    },
    {
        "content": "<p>Our other use-case is for things like UCUM, where we allow for a CodeSystem fragment to enumerate all the \"well known\" codes so we have a simplified implementation strategy</p>",
        "id": 226273876,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613257389
    },
    {
        "content": "<p>Consumers generally don't need code systems.  Consumers need value sets.  Terminology servers need to be able to consume code systems.  If the postcoordinated symbols and raw codes are intermingled, how is a valueset to know what to do?</p>",
        "id": 226274197,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613257887
    },
    {
        "content": "<p>I'm with <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> here in agreeing that we have not, and should not, disallow codes that technically are the result of a code system defined algorithm for valid post or pre-coordinated expressions. I guarantee that users are not interested in more hurdles in using UCUM and they consider existing combinations of atoms valid codes in the UCUM code system. Regenstrief  considers the <a href=\"https://ucum.org/trac/wiki/adoption/common\">common UCUM Units</a> list a set of UCUM codes. SNOMED can't get out of it's own way regarding the use of expressions as \"real\" codes but they certainly do consider an expression equivalent to a concept and assume and expression should be treated as a valid concept when determining equivalence and placement in the inferred structure. Ergo, an expression is a code in the code system. </p>\n<p>As for using a supplement to hold a set of enumerated expressions, I think we need to really discuss the pros and cons of using that vehicle versus allowing this to be done in a fragment. I'd rather we found it acceptable to use fragment I think, but want to hear why supplement is better.</p>",
        "id": 226274587,
        "sender_full_name": "Robert McClure",
        "timestamp": 1613258417
    },
    {
        "content": "<p>What valueset features need to distinguish between postcoordinated symbols and raw codes ?</p>",
        "id": 226275184,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613259302
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> The reason we opted for supplements and not fragments is twofold:</p>\n<ol>\n<li>only the code system authority can publish fragments, and</li>\n<li>there is a documented mechanism for bringing the content of a supplement into the scope of a ValueSet.  How and when fragments combine (if at all) is undefined (<a href=\"http://hl7.org/fhir/codesystem.html#fragments\">http://hl7.org/fhir/codesystem.html#fragments</a>)</li>\n</ol>",
        "id": 226275351,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613259580
    },
    {
        "content": "<p>For one, if you're going to post-coordinate, you need to know what are 'real' codes and what's already an expression - because the rules for inclusion are likely to be different.</p>",
        "id": 226275822,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613260323
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  I think we need to clarify what \"Publish\" means regarding fragments. FHIR servers through out the world contain code system fragment resources that exist solely on that server and no place else. IE: it seems to me that anyone can decide what subset they want and need in a resource for use and this is not only useful, it is demonstrably practical. I'd be very surprised if your server does not contain code system resources that are (or should be) marked as fragments that you did not get for the code system authority as an officially published fragment. So #1 is not practically true and it should be made clear that it is not a requirement because it's simply impossible and wrong to make this a requirement. That leaves #2 and I wondered if that was the problem so I suggest we work on clarifying what needs to change to make use of fragments for PCE the proper solution. Then the argument that PCEs are \"real codes\" fits.</p>",
        "id": 226313992,
        "sender_full_name": "Robert McClure",
        "timestamp": 1613321522
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> for SNOMED CT, my (slightly informed) guess is that FHIR Terminology Servers generally implement subsets as Value Set resources based on Reference Sets - not as Code System Fragments. I also don't see how the current definition of a Code System Fragment in the FHIR Specification would allow us to treat PCEs (particularly those created 'close-to-user form') as Fragments. The better solution is to extend the definition of Supplements to include PCEs.</p>",
        "id": 226322603,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1613333602
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I think it's more than just a definition of \"Publish\" in this case (and I agree with your sentiments on pragmatic uses), but rather some of the technical aspects, as well as some conceptual ones.<br>\nFrom a technical perspective, a supplement can express explicit dependencies on the base CodeSystem content it is referencing - specifically via the version field.  A fragment doesn't really do this; it effectively exists in isolation from other fragments or a complete CodeSystem.<br>\nFrom a conceptual perspective, if a terminology server contains two CodeSystem instances for the same code system (and version), one of which is <code>complete</code> and the other is a <code>fragment</code>, it would seem entirely reasonable for it to completely ignore the fragment as extraneous, especially if the server has in-built support for the code system.  On the other hand, a supplement is intrinsically positioned as containing information additional to the base.</p>",
        "id": 226336469,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613351850
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> Yep, this is complicated. I can tell you that I know IGs are including code system fragments that only include the codes needed to support expansions defined in the IG, so they don't have to represent all the concepts they don't need. Make sure as you consider this you are not focused solely on SCT, LOINC. Also keep in mind that for UCUM I would presume it's always a fragment and I suspect that every server will have a different set. So we need to make what is practically happening technically correct. This sounds like a topic for a call - can we do it during a main vocab call normally 3:30p ET? Say 30min max? <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span></p>",
        "id": 226406183,
        "sender_full_name": "Robert McClure",
        "timestamp": 1613407178
    },
    {
        "content": "<p>UCUM doesn't need to be a fragment.  Enumerating full UCUM is pretty easy.  You just can't enumerate all the post-coordinated concepts.</p>",
        "id": 226406950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613407679
    },
    {
        "content": "<p>But we have been including the PCEs as codes and it's honestly the best way to do it. But I get that this means it's technically confusing. I really don't want to complicate the majority in order to force 'correctness\" on one or two.</p>",
        "id": 226407340,
        "sender_full_name": "Robert McClure",
        "timestamp": 1613407929
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> What would an IG do that?  Surely IGs shouldn't be including code systems that they aren't themselves defining?<br>\nIf they want to ensure a certain rendering of a ValueSet, then I would have expected them to instead include an expansion in the ValueSet definition?</p>",
        "id": 226431759,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613424593
    },
    {
        "content": "<p>If partial code systems are being included in IGs so that the value sets can contain the concepts definitions, there is no need. There is an extension on value set that allows definitions to be recorded: <a href=\"http://hl7.org/fhir/R4/extension-valueset-concept-definition.html\">http://hl7.org/fhir/R4/extension-valueset-concept-definition.html</a><br>\nEdited: This is a bad idea, as pointed out by <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> below.</p>",
        "id": 226458678,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1613435158
    },
    {
        "content": "<p>Good lord. You all have made this  value set round hole the size of a truck so that every code system truck gets to drive right on in. Yes, yes I understand that no one cares about code systems and only value sets really matter. But even a trivial FHIR server should be able to provide an Expansion so that there is consistency across value set use of concepts. I hope that concept definition extension is from the pre-code system in FHIR days.  <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> Including definitions is only one reason to have code system resources available to an IG. <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> IGs may need concept information for a variety of reasons. From what I understand, <strong>very few</strong> FHIR implementations make use of a terminology service, so anything they need is inside the FHIR server. Yes, point-in-time expansions included in a FHIR value set resource (best using <a href=\"http://hl7.org/fhir/uv/cpg/StructureDefinition-cpg-executablevalueset.html\">ExecutableValueSet Profile</a> can be a very useful approach when the code system rarely changes.  But for IGs that need code systems that have complexity that various value sets use differently, we need to encourage the use of the code system resource as a central concept repository. Not demand it, but support it properly. And I'd agree that we need to make adding definitions to concepts in a code system resource easy so people don't use the absolutely easier value set extension. Having to create a supplement seems heavyweight given the \"but it's fine\" consideration for doing it in a value set.</p>",
        "id": 226544820,
        "sender_full_name": "Robert McClure",
        "timestamp": 1613495828
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> no that is an entirely inappropriate use of that extension.  It is designed for the case where the underlying code system does not define a meaning for the code, not for when you just don't have a representation of it to hand.</p>\n<p>That extension is a last resort mechanism for use when someone else has painted you into a corner.</p>",
        "id": 226578074,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613510391
    },
    {
        "content": "<p>+1 for  ExecutableValueSet Profile</p>",
        "id": 226749564,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1613608202
    },
    {
        "content": "<p>I see I'm late to this party, but I definitely disagree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> on this one. if the code system defines a grammar, but does not enumerate all the possible codes allowed under the grammar, a supplement can enumerate additional codes and define displays and properties for them.</p>",
        "id": 227537668,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614132972
    },
    {
        "content": "<p>the fact that enumerates them does not make any difference to their validity, only their properties and displays</p>",
        "id": 227537686,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614133005
    },
    {
        "content": "<p>That's going to make checking supplements for validity darn hard.  The rule is \"supplements can't have codes that aren't in the base code system\".  If a supplement includes post-coordinated expressions created with an algorithm that's opaque to the terminology server, how is it to check that the codes in the supplement that aren't in the base code system are legitimate?</p>",
        "id": 227543831,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614138453
    },
    {
        "content": "<p>it can't, of course. Grammars are hard. But <a href=\"http://tx.fhir.org\">tx.fhir.org</a> can and the validator, at least, can check the grammar for snomed and ucum</p>",
        "id": 227543949,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614138595
    },
    {
        "content": "<p>though it doesn't actually happen right now</p>",
        "id": 227544003,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614138611
    },
    {
        "content": "<p>supplements, generally, are on my to do list</p>",
        "id": 227544017,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614138631
    },
    {
        "content": "<p>It seems weird to me - because it's giving supplements a capability to do something the base code system <em>can't</em> do.  A post-coordinating system can define algorithms to determine properties and/or representations for post-coordinated concepts, but it can't enumerate them and define non-algorithm-based properties or representations.  In general, supplements haven't been able to do things the base code systems couldn't have done.  Why are we making an exception here?</p>",
        "id": 227544191,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614138835
    },
    {
        "content": "<p>it can enumerate them, or some of them, if it wants to. There's nothing here that a base code system can't do</p>",
        "id": 227544538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614139139
    },
    {
        "content": "<p>UCUM can't define a custom display-name or properties for mL.  Nor can SNOMED do so for 298756009:{363698007=371195002,116676008= 72704001} - at least not without defining a pre-coordinated term for it.</p>",
        "id": 227545556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614140050
    },
    {
        "content": "<p>I'm not sure what you mean there.</p>",
        "id": 227548680,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614143006
    },
    {
        "content": "<p>a code system resource can do that if it wants, if the rules of the code system allow it. I'm not sure about UCUm but SCT allows it to happen with a pre-coordinated term</p>",
        "id": 227548729,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614143046
    },
    {
        "content": "<p>Sure - but a pre-coordinated term is a distinct code.  Are we aware of <em>any</em> post-coordinated code system that allows defining properties or display names for post-coordinated terms except algorithmically?</p>",
        "id": 227604796,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614176414
    },
    {
        "content": "<p>sorry, I meant, SCT allows it to happen with a post-coordinated term</p>",
        "id": 227664505,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1614197782
    },
    {
        "content": "<p>That's surprising to me, but ok, if code systems can do it, then certainly supplements can do it too.</p>",
        "id": 227691494,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614208503
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Yes - BCP47 does exactly that - algorithmically determined names for expression-based codes. en-CA = Canadian english.</p>",
        "id": 227715018,
        "sender_full_name": "Robert McClure",
        "timestamp": 1614226247
    },
    {
        "content": "<p>Algorithmic is fine.  Grahame is saying that SNOMED-CT allows <em>non</em> algorithmic names to be assigned to specific post-coordinated expressions.  If that's true, there's no reason why supplements couldn't do the same.</p>",
        "id": 227715687,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614227008
    },
    {
        "content": "<p>So called \"properties\" in FHIR actually include concept relationships but the latters might lead to a structured definition meaningfully different from their original one in the  code system.</p>",
        "id": 227771661,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1614262027
    }
]