[
    {
        "content": "<p>I missed the phone call this morning - too many calls....</p>",
        "id": 153915575,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508817479
    },
    {
        "content": "<p>was this discussed? where are we?</p>",
        "id": 153915576,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508817496
    },
    {
        "content": "<p>Seems like the next step is to evaluate the tradeoffs among the various unpleasant options.</p>",
        "id": 153915586,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1508821057
    },
    {
        "content": "<p>connectathon here we come...</p>",
        "id": 153915594,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508825044
    },
    {
        "content": "<p>We proposed to do 'alternate' in the extension space, rather than in core as at present (if we can get you to agree with that!).  And add a topic specifically for it for the Connectathon terminology track, to try that out vs. the ConceptMap solution.  The other alternative, of course, is to expand the cardinality on 'code' to 1..*, but I think the sense was not to do that (at least not yet).  Anyone want to add anything else?</p>",
        "id": 153915595,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1508825968
    },
    {
        "content": "<p>I can agree to do it in extension space. With the same design as currently in the resource?</p>",
        "id": 153915596,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508826095
    },
    {
        "content": "<p>Yes, but with an additional 'alternate.display' element.  Ted thought there were some uses in V3 that would need that.  I'm not recalling any, but we can look.</p>",
        "id": 153915597,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1508826351
    },
    {
        "content": "<p>I for one would be interested in gaining a better understanding of the implications of changing the concept.code cardinality to 1..*, and possibly documenting that.</p>",
        "id": 153915711,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1508853413
    },
    {
        "content": "<p>what would alternate.display do?</p>",
        "id": 153915792,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508880213
    },
    {
        "content": "<p>It would provide an alternate display term that is associated with that particular alternate code.  I'm not thinking of any cases at the moment where we need that, but Ted thinks that there are some.  It probably makes sense to provide it in case we do need it, particulary since it will be in extension space and we can work with it and determine what we actually do need.</p>",
        "id": 153915803,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1508885474
    },
    {
        "content": "<p>hmm. scary idea</p>",
        "id": 153915836,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508896689
    },
    {
        "content": "<p>As I said, I don't see where it would be needed (or desirable, as you say).  If the display is different then that would (most likely) indicate a different meaning, which should be a separate concept.  I'm fine with sticking with the current structure in the extension and then we can see how that plays out in the Connectathon and otherwise and if anything else surfaces.</p>",
        "id": 153915876,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1508915910
    },
    {
        "content": "<p>why introduce this if is a \"just in case\"  let the implementers create an extension.   Making more work for yourself for an outside edge case.</p>",
        "id": 153916025,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508946218
    },
    {
        "content": "<p>I'm not quite sure which part are you suggesting is \"just in case\", Eric?  There is clearly a need (I think well within the 80%) to be able to handle code systems that do define multiple codes per concept - the question is how.  Adding the 'alternate' complex element is certainly one way to do that, but we haven't reached a consensus as to whether it's the \"best\" way, so it makes sense to do it in extension space and test it in the Connectathon(s).  Probably you are referring to the addition of 'alternate.display' as \"just in case\", and there I agree.  I think leaving that off and only adding it if a clear need for it surfaces in the Connectathon(s) or otherwise makes the most sense.</p>",
        "id": 153916214,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1508997993
    },
    {
        "content": "<p>I was talking about the alternate.display bit</p>",
        "id": 153916285,
        "sender_full_name": "Eric Haas",
        "timestamp": 1509035331
    },
    {
        "content": "<p>I'm still not entirely following this - we have <em>code</em> systems, not <em>concept</em> systems.  SNOMED has multiple codes per concept purely because of post coordination.  I'd like to understand why each of the codes for the same concept cannot exist independently. To represent these codes in a FHIR CodeSystem would probably require not much more than identifying a well-known property (\"equivalentTo\"?) that is symmetric and implies these semantics (for $subsumes / $closure support)<br>\n.</p>",
        "id": 153921400,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1511495124
    },
    {
        "content": "<p>a code system defines a set of concepts, and assigns codes to them</p>",
        "id": 153921405,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511504302
    },
    {
        "content": "<p>I'm also struggling a bit to determine what problem this discussion relates to. There are many real-world situations where a single idea in a clinician's head can only be represented using a single, indefeasible, structured expression comprising more than one code from the same code system, and this representation as a single expression is different from the concurrent capture (or messaging) of the same underlying codes but as discrete single coded items that happen to be all recorded on the same day. SNOMED CT postcoordinated expressions are an obvious example of such code expressions, but dagger-asterisk codings and other multi-code expressions under rather older compositional schemes may also be in scope, like e.g. ICD9/10, ICD-O or the UK' OPCS.</p>\n<p>Take how 'Intentional paracetamol and dextropropoxyphene poisoning' should be coded under ICD-10, as a single expression formed of several codes :</p>\n<p>T391|X609|T404|X629 </p>\n<p>or...</p>\n<p>T39.1 4-Aminophenol derivatives |<br>\nX60.9 Intentional self-poisoning by and exposure to nonopioid analgesics, antipyretics and antirheumatics |<br>\nT40.4 Other synthetic narcotics (unspecified place) |<br>\nX62.9 Intentional self-poisoning by and exposure to narcotics and psychodysleptics [hallucinogens], not elsewhere classified (unspecified place) </p>\n<p>Or was that not the issue here?</p>",
        "id": 153924255,
        "sender_full_name": "Jeremy Rogers",
        "timestamp": 1513004271
    },
    {
        "content": "<p>no that wasn't the issue here. That's just a code from FHIR's point of view. The issue was that a few code systems deliberately define more than one code for the same expression, and documents them as synonyms.</p>",
        "id": 153924332,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513021101
    },
    {
        "content": "<p>In our legacy Coverage file, there are 4 different fields for subscriber relationship to patient (original, hipaa, ncpdp (2)). I think we can call these different representations of a single relationship, so we can populate the 0..1 CodeableConcept with 4 Codings with different systems. Right?</p>",
        "id": 232958835,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1617402234
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> UCUM is such a CodeSystem. UCUM codes for unit of measurements include case-sensitive and case-insensitive ones.</p>",
        "id": 232973563,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617416811
    },
    {
        "content": "<p>UCUM allows for annotations, which are semantically irrelevant but part of the code. On that basis I think you can argue that UCUM has an infinite number of codes (expressions) for any particular unit concept. That is in addition to the possibility of taking any existing unit concept expressed in UCUM, and multiplying and dividing it by the same value (either a constant or a unit expression). The result is a new valid UCUM expression for the same (equal mathematically) concept.</p>",
        "id": 241712921,
        "sender_full_name": "Colin E.",
        "timestamp": 1623016978
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"261105\">@Colin E.</span> I don't agree that changing the \"annotation\" results in another code for the same concept. I agree with your statement that such a change results in a <em>mathmatically</em> equivalent <em>for UCUM</em> expression, but this is a side-effect and the two annotation-based expressions for \"the same unit\" result in different concepts in UCUM. At least we treat them as different.</p>",
        "id": 241715217,
        "sender_full_name": "Robert McClure",
        "timestamp": 1623020891
    },
    {
        "content": "<p>I think that's semantics. these are definitely different codes:</p>\n<p>mg/mL{water}<br>\nmg/mL{saline}</p>\n<p>But they're totally equivalent concepts in the right context. So I agree with <span class=\"user-mention\" data-user-id=\"261105\">@Colin E.</span></p>",
        "id": 241718330,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623026207
    },
    {
        "content": "<p>Perhaps more exciting / worrying is that in UCUM (and I suspect most other systems based on understanding units, and maybe even those that can do dimensional analysis based on symbolic maths)  mg/g == mL/L == ms/s == 10^-3</p>\n<p>These are all versions of \"one thousandth\" (or 0.1%) at one level, but whether a (say) mass fraction can safely be considered the \"same concept\" as a volume fraction, or even a ratio between two elapsed times, is beyond my knowledge of maths and metrology to answer.</p>\n<p>As to whether the annotated units I used as examples are treated as different concepts or not, people with a lot more experience that I in these areas have commented that best practice when receiving unit in UCUM in a FHIR message is to strip off the annotations before they are stored or processed, so that would indicate they would be treated as the same.</p>",
        "id": 241814120,
        "sender_full_name": "Colin E.",
        "timestamp": 1623088030
    },
    {
        "content": "<blockquote>\n<p>whether a (say) mass fraction can safely be considered the \"same concept\" as a volume fraction, or even a ratio between two elapsed times, is beyond my knowledge</p>\n</blockquote>\n<p>The answer is contextual. To mw knowledge, there is not ontology that even aims to provide a framework for answering that question</p>\n<blockquote>\n<p>that best practice when receiving unit in UCUM in a FHIR message is to strip off the annotations before they are stored or processed</p>\n</blockquote>\n<p>I disagree. I would never strip off annotations before storage, but I would not consider them for comparison purposes. What exactly 'processing' means... that depends then</p>",
        "id": 241818470,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623089815
    },
    {
        "content": "<p>What would you expect if both <code>mg/mL{water}</code> and <code>mg/mL{saline}</code> were passed to <code>$closure</code>?<br>\nWhat about the expansion of a ValueSet if both were included in the ValueSet definition?</p>",
        "id": 241871731,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1623129372
    },
    {
        "content": "<blockquote>\n<p>What would you expect if both mg/mL{water} and mg/mL{saline} were passed to $closure?</p>\n</blockquote>\n<p>\"Annotations do not contribute to the semantics of the unit but are meaningless by definition\"</p>\n<p>so that is a clear answer, then?</p>\n<blockquote>\n<p>What about the expansion of a ValueSet if both were included in the ValueSet definition?</p>\n</blockquote>\n<p>they'd be both be in it as defined</p>",
        "id": 241875191,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623133680
    },
    {
        "content": "<p>for $closure, would you expect to get an equivalence map back between the two codes?  Or, would you expect them to be treated as a single concept, and thus no map.</p>",
        "id": 241875755,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1623134235
    },
    {
        "content": "<p>equivalence map. They are not the same codes, they are the same concept</p>",
        "id": 241880138,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623137451
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  You complain that the difference is semantics yet rely upon nuanced distinctions between code and concept to justify your point. By what FHIR rule are you sayig that two strings in the same code system, that <em>you say</em> have the same meaning, should be in a value set expansion? What use are they if they have the same meaning? How is that computable? The problem with all that is you are incorrect, they actually have different meanings in UCUM, they <em>just can not be converted.</em></p>\n<p>A code system concept is a bounded idea that has meaning persistance as represented by codes in the code system. UCUM honestly has some very confusing statements, and they are all focused on supporting unit conversion but confusion reigns when thinking about unique idea representation. UCUM, in the official code system, has <strong>many</strong> concepts with only annotaion respresentations: {binding_index}, {CAG_repeats}, {cells}, {activity}, {absorbance}, and I can go on. If we treat UCUM such that all those represent the same concept (apprently NULL??), then at a minimum all UCUM concepts that are only annotations can not be reliably used in FHIR systems.  But that is foolish and in fact, Graham, you don't have this one correct.</p>",
        "id": 242535762,
        "sender_full_name": "Robert McClure",
        "timestamp": 1623625973
    },
    {
        "content": "<blockquote>\n<p>you are incorrect, they actually have different meanings in UCUM, they just can not be converted</p>\n</blockquote>\n<p>I think you are referring to the text where I was quoting from UCUM</p>",
        "id": 242545232,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623638785
    },
    {
        "content": "<blockquote>\n<p>at a minimum all UCUM concepts that are only annotations can not be reliably used in FHIR systems</p>\n</blockquote>\n<p>I certainly agree with that statement. In general I agree that annotations can't be used reliably, but people certainly do use them</p>",
        "id": 242545251,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623638855
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Here is the thing, as I have said, the guidance in UCUM docs is not as helpful as I would like to see regarding practical use. I suppose that is yet another task I need to add to my list - talk to LOINC about clarifying UCUM. My point is this, we - those of us interested in data communication - are not as interested in the use of UCUM to convert between different equivalent units as we are in using it to identify a specific, focused, unit of measure. That unit may be only of use in one place and have no coversions to anything.  But accurate understanding of meaning and high fidelity of understanding is the goal. Therefore I suggest that we come to an agreement that for our use UCUM annotations provide unique information and that we consider the entire exchanged expression as a complete unique concept represented as a unique code. We can tackle unit conversion equivalenace as a separate issue that follows defined UCUM governance. I would like to point out that the perspective I am promoting is not in direct contradiction with the UCUM documents. In particular section 3.2 \"ARBITRARY UNITS\" states \"Arbitrary or procedure defined units are units whose meaning entirely depends on the measurement procedure (assay).\" therefore they have meaning, just not in relation to other units. It also states that they realized (starting with 1.6) that these units are indeed \"commensurable.\" Unfortunately the text consistantly uses phrases like \"...an arbitrary unit and is not comparable with any other arbitrary unit or term\" when the comparison under question is one of unit <em>mathematics</em> comparison but not unit meaning. </p>\n<p>I will work to clarify this interpretation with LOINC but if we do not follow this guidance and consider all UCUM expressions as unique ideas, different concepts represented by different codes, we must toss out all the arbitrary annotations. I understand this means we must consider unit mathematics (conversion) equivalency as a separate task, but I suggest that is reassonable and possible.</p>\n<p>Thoughts? <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> , <span class=\"user-mention\" data-user-id=\"261105\">@Colin E.</span> , <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> , <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> , <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span></p>",
        "id": 242608041,
        "sender_full_name": "Robert McClure",
        "timestamp": 1623682022
    },
    {
        "content": "<p>I also understand that for my approach to be acceptable, we have to get UCUM to modify the statements in the Example section \"Symbols commonly used as units that are no real units of measurements are not defined by The Unified Code for Units of Measure.   ■2 Users are free to use curly braces expressions (§12) if they think it is important to use symbols rather than the default unit 1.   ■3 Curly braces expressions are equivalent to the unit 1. The details of the annotations in the curly braces have no defined meaning in The Unified Code for Units of Measure.\" I'd rather it say that these curley brace expressions have no defined conversion meaining and are arbitrary in value but actually <em>do have meaning for exchange</em> and <strong>should</strong> be considered units, they just have a conversion meaning = 1.</p>",
        "id": 242609794,
        "sender_full_name": "Robert McClure",
        "timestamp": 1623682685
    },
    {
        "content": "<p>sounds like UCUM needs an additional way to differentiate between explanatory and definitional annotations. In the mean time, we could add a note to the UCUM page explaining the issue and noting that the use of annotations introduces uncertainty that has to be somewhere</p>",
        "id": 242627283,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623689519
    },
    {
        "content": "<p>Sorry just seeing this now...there are two sets of things here IMHO - the specific multiple codes issue is something in several systems of codes where there are multiple concept representations and some of them are identifying representations ie they are associated only with one concept in the system and can be used as a primary key for that concept.   Some code systems, such as SNOMED CT, explicitly label one of those as 'THE CODE</p>",
        "id": 242645546,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623697935
    },
    {
        "content": "<p>'</p>",
        "id": 242645550,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623697938
    },
    {
        "content": "<p>whereas the others are unique but should not be used as primary keys for a variety of reasons.</p>",
        "id": 242645579,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623697957
    },
    {
        "content": "<p>Other systems, such as ISO 3166-1, have multiple sets of codes where no single set is considered primary or solely the unique identifier, but have various labels ie two character alpha, three character alpha, numeric; other systems have different approaches.</p>",
        "id": 242645773,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623698046
    },
    {
        "content": "<p>We have two code systems in HL7 where there are more than one identifying representation for a particular concepts, and we have adopted in THO (UTG) the convention to use the property 'SYNONYM' to indicate that more than one code in the system are representations of a particular concept; this enables the machinery of specific display strings for the different codes without having to get all fancy with extensions.</p>",
        "id": 242646020,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623698162
    },
    {
        "content": "<p>A system such as UCUM which is inherently a post coordination grammar based system has by definition more than one way to represent concepts, although it is my understanding that in UCUM the atom concepts have unique single identifying representations.    Folks who persist precoordinated sets of complex grammar expressions for SNOMED CT, IANA media types, some AJCC terminologies, and some others, often find the multiple representation problem rearing its ugly head.</p>",
        "id": 242646410,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623698335
    },
    {
        "content": "<p>There are several approaches to deal with this; none are simple pretty and elegant (of course).    Fortunately, it is not widespread.  Unfortunately, in the case of UCUM, it is extremely ubiquitous.    We perhaps should consider some elegant specific solution for UCUM only, with guidance for those struggling with it for other systems.    I have long been concerned with 3166-1 for related reasons.    I am unconvinced that we need a complex general solution to the problem however, as the juice is likely not worth the squeeze.</p>",
        "id": 242646982,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623698595
    },
    {
        "content": "<p>what's an equivalent problem in 3166?</p>",
        "id": 242651244,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623700613
    },
    {
        "content": "<p>Some systems communicate the 2 character code, others the 3 character code, etc.   Most now because of this can process either one, most systems I am familiar with treat it as a code systems with 1000 or so coded concepts and it just so happens that the same display name (which does not have to be unique in a code system) is used for triplets of codes, LOL.  So they game it since there is not a general solution.</p>",
        "id": 242654878,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623702436
    },
    {
        "content": "<p>From a practical \"data use\" perspective that flows from the agenda of pushing terminology semantics out of a client/data processing system and into a terminology server, it would seem that codes need to be preserved syntactically (else the client system needs to know when and how to do something other than string matching when correlating terminology server responses with the actual codes stored in a record), but the terminology server handles the concept-ness.  There, the semantics are those of subsumption which includes equivalence.</p>\n<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> I'm not sure what you're doing in THO, but I would hope that when there are multiple codes for the same concept, then their FHIR CodeSystem representation captures that as multiple codes that are equivalent (i.e., have each other as both parent and child properties).</p>",
        "id": 242667166,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1623710006
    },
    {
        "content": "<p>Four years ago at a WGM face-to-face there was a long discussion on this topic in a joint Vocab/FHIR quarter.   At that time it was decided to use a new property \"synonymCode\" to have different codes that identify the same underlying concept in a single code system to essentially 'point' to each other.  This was implemented for the two places in HL7 terminology where they occur two years ago when it was implemented in THO.    This can be revisited in light of updated experience and opinions but this is what we are using today.   I know off the top of my head without searching it is used in V3 ActCode; the property declaration is:     &lt;property&gt;<br>\n    &lt;code value=\"synonymCode\"/&gt;<br>\n    &lt;uri value=\"http://hl7.org/fhir/concept-properties#synonym\"/&gt;<br>\n    &lt;description value=\"An additional concept code that was also attributed to a concept\"/&gt;<br>\n    &lt;type value=\"code\"/&gt;<br>\n  &lt;/property&gt;</p>",
        "id": 242725900,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623760856
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/codesystem-concept-properties.html\">http://build.fhir.org/codesystem-concept-properties.html</a></p>",
        "id": 242726116,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623760975
    },
    {
        "content": "<p>I certainly don't support that in <a href=\"http://tx.fhir.org\">tx.fhir.org</a> right now. a todo for me, I guess</p>",
        "id": 242736030,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623765391
    },
    {
        "content": "<p>No, we don't.  But there are ways to logically support the equivalent of this in the current infrastructure (as has been proposed - but still has not yet been implemented - for NDC).</p>",
        "id": 242767121,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623777259
    },
    {
        "content": "<p>Having first class support in the CodeSystem resource for multiple codes for a concept would obviously be a substantive change (at least if all of the codes are to be treated \"equally\").  We should decide if that is something that we believe needs to be supported.</p>",
        "id": 242767686,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623777540
    },
    {
        "content": "<p>I don't think we want to make it first class. I just have to implement what we agreed. But I thought I had done it for NDC? what's not done?</p>",
        "id": 242800132,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623791336
    },
    {
        "content": "<p>okay, that's great! (I almost suggested a new property <code>equivalent</code> that would play the same role).<br>\nOne thing though, the code is defined as <code>synonym</code> but above you're renaming it as <code>synonymCode</code> -- is there a good reason for doing that? (other than forcing terminology server implementers to be disciplined about the distinction between the CodeSystem-local property name and it's formal identity via the URI.</p>",
        "id": 242813771,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1623800762
    },
    {
        "content": "<blockquote>\n<p>Having first class support in the CodeSystem resource for multiple codes for a concept would obviously be a substantive change</p>\n</blockquote>\n<p>I don't follow this claim.  SNOMED CT already has this (post coordination), as has UCUM.  Indeed its support is also implied by the <code>$subsumes</code> operation being able to return <code>equivalent</code>.  To a lesser extent, it is also the semantics you get with case-insensitive code systems.</p>",
        "id": 242815189,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1623801919
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> was talking about the CodeSystem resource itself, where concept.code is 0..1 not 0..*</p>",
        "id": 242815290,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623801979
    },
    {
        "content": "<p>ah, I missed that.  thx for the clarification</p>",
        "id": 242815333,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1623802017
    },
    {
        "content": "<p>Yes, that's it.</p>",
        "id": 242815495,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623802159
    },
    {
        "content": "<p>For the NDC 10 and 11 digit code issue, Vocab and HTA agreed that it is a single code system, with 2 codes for each concept.  In order to represent that currently in FHIR (with concept.code 0..1), we have to treat each code as if it is a separate concept (in the CodeSystem resource and terminology service API), but then you can declare that the two concepts are in fact equivalent with a ConceptMap.  It's a bit of a pain and slightly complicated, but I think it provides logically correct behavior and is a workable way forward with the current specification and infrastructure.  I worked up a solution for this for NDC, which Vocab WG approved (see 2020-08-20 <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=91983476\">minutes</a> item #7).  I'm intending to post the example resources (including value set expansions) separately here again (shortly).</p>\n<p>It looks like Grahame has partly implemented this on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>, as it appears on a $lookup to be responding to both the 10 digit (e.g., <code>0409-3718-01</code>) and 11 digit (e.g., <code>00409371801</code>) codes (at least on a quick spot check).  But in order to create a means to define 10-digit-only and 11-digit-only value sets, which are a requirement, I think the additional <code>code-type</code> property (or equivalent) also needs to be there - and that doesn't appear to be the case (I don't see anything like that showing up in $lookup).</p>",
        "id": 242817453,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623804163
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 242817948,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623804671
    },
    {
        "content": "<p>I'll post the value set and concept map examples in a bit.</p>",
        "id": 242818076,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623804766
    },
    {
        "content": "<p>make a task for me to fix $lookup on ndc. I agree I missed that.</p>",
        "id": 242818206,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623804868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Issue <a href=\"https://github.com/grahamegrieve/fhirserver/issues/119\">#119</a> created.  I included the additional bits for 'code-type' and 'synonym' properties and 'code-type' filter and $translate support.</p>",
        "id": 242826608,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623814216
    },
    {
        "content": "<p>Here is the full set of the NDC 10 and 11 digit examples:<br>\n<a href=\"/user_uploads/10155/r34eKdlWhBTkJ47ZwwaG4TUE/CodeSystem_NDC_1011digit.json\">CodeSystem_NDC_1011digit.json</a> <br>\n<a href=\"/user_uploads/10155/atdmHJbJhMWigCWmaAoWMKRq/ConceptMap_NDC_translate_10to11digit_response.json\">ConceptMap_NDC_translate_10to11digit_response.json</a> <br>\n<a href=\"/user_uploads/10155/e2uB-GRSvtZN_bIeBWdFgM5p/ConceptMap_NDC_translate_11to10digit_response.json\">ConceptMap_NDC_translate_11to10digit_response.json</a> <br>\n<a href=\"/user_uploads/10155/o2FxPodi9hsI4NbVUl_Jkznk/ConceptMap_NDC_10to11digit.json\">ConceptMap_NDC_10to11digit.json</a> <br>\n<a href=\"/user_uploads/10155/-DSb3Ly9rLMd0UcvBBj75BJo/ConceptMap_NDC_11to10digit.json\">ConceptMap_NDC_11to10digit.json</a>  <br>\n<a href=\"/user_uploads/10155/igs789IJdut7IfBtwe49JdeJ/ValueSet_NDC_10digit_expansion.json\">ValueSet_NDC_10digit_expansion.json</a> <br>\n<a href=\"/user_uploads/10155/lFQHnxb5Zl3Z4MGjWMPE6rFk/ValueSet_NDC_10digit.json\">ValueSet_NDC_10digit.json</a> <br>\n<a href=\"/user_uploads/10155/OCCDPNDd6imNrUGbzaL5f6DD/ValueSet_NDC_11digit_expansion.json\">ValueSet_NDC_11digit_expansion.json</a> <br>\n<a href=\"/user_uploads/10155/IdufBSe-x3PPlmJy_JxHaObm/ValueSet_NDC_11digit.json\">ValueSet_NDC_11digit.json</a></p>",
        "id": 242826648,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623814312
    },
    {
        "content": "<blockquote>\n<p>At that time it was decided to use a new property \"synonymCode\" to have different codes that identify the same underlying concept in a single code system to essentially 'point' to each other.</p>\n</blockquote>\n<p>Does this mean a supplement can define additional synonyms?</p>",
        "id": 242843268,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623830903
    },
    {
        "content": "<p>Why is the ConceptMap needed to declare equivalence (given the existence of \"synonymCode\")?</p>",
        "id": 242860906,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1623839113
    },
    {
        "content": "<p>I would think it declares equivalence between separate concepts, not synonymy which is something different</p>",
        "id": 242861351,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623839396
    },
    {
        "content": "<p>Strictly speaking, by specifying the 'synonym' (or 'synonymCode') property I think the ConceptMap may not be required.  But at least an implicit concept map is required if you want to support translating between the \"synonym codes\" using $translate.  So to show how that works with existing servers I made explicit ConceptMap examples.</p>",
        "id": 242863113,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623840463
    },
    {
        "content": "<p>As far as using 'synonymCode' goes, I don't think it is something that actually \"exists\" (i.e. has been defined and is available for use/reuse).  I think 'synonym' does exist, because it is defined in the concept-properties code system.  If you want to use 'synonymCode' now, as far as I can see you have declare it for each CodeSystem instance where you want to use it.  Correct?  If for some reason you wanted to, I think for use in your code system you could just as well declare the property code value associated with the uri '<a href=\"http://hl7.org/fhir/concept-properties#synonym\">http://hl7.org/fhir/concept-properties#synonym</a>' to be 'xyz123' - 'synonymCode' isn't special.  This seems a little weird, but I guess the spec allows it.  If we want to actually define this property to be 'synonymCode', rather than 'synonym', then I think we would need to actually change that in the concept-properties code system.  I do agree that 'synonymCode' is more explicit and probably less confusing (as it is <strong>not</strong> the same as a \"synonym\" description/designation).  But at this point I don't know if we want to change that?</p>",
        "id": 242865191,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623841767
    },
    {
        "content": "<p>well, the standard specifies the URI as the definition. A propety 'synonymCode' not anchored on the URI has no meaning, and my server will be ignoring it; I won't be paying any attention to the actual code, only the URI. But it's useful for us to be consistent in the code we use in the THO</p>",
        "id": 242865693,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623842085
    },
    {
        "content": "<p>Right.  The particular value that is used in <code>concept.property.code</code> is scoped only for that CodeSystem instance (and is defined in <code>property.code</code> in association with the value of <code>property.uri</code>).</p>",
        "id": 242866816,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623842860
    },
    {
        "content": "<p>Should a server ignore all properties that are not also explicitly declared in the CodeSystem?  Even including \"well-known\" ones like <code>inactive</code>, <code>parent</code> and <code>child</code>?</p>",
        "id": 242867684,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1623843423
    },
    {
        "content": "<p>well, that's a little uncertain. THO assumes that we're not, and I'm not, but the spec doesn't make it clear why we're doing that</p>",
        "id": 242869280,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623844586
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I'd assume that parent/child (are there others?) <strong>must not be ignored</strong> because we allow those creating code system resources to include hierarchies simply through resource concept structure. So we explicitly do not require those two as defined properties. As for status, I'd say we also presume all servers support this because we already assume, if nothing else is stated, that any concept in the resource \"is active\" and we also have the core element of ValueSet.compose.inactive that presumes this information is available.</p>",
        "id": 242900705,
        "sender_full_name": "Robert McClure",
        "timestamp": 1623858723
    },
    {
        "content": "<p>well, you're talking about the concepts there, rather than by what means servers identify the actual properties in the syntax.</p>",
        "id": 242934078,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623873324
    },
    {
        "content": "<p>back to NDC:</p>",
        "id": 243271314,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624140229
    },
    {
        "content": "<p>is the a property / filter for product codes (code9?)</p>",
        "id": 243339173,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624250438
    },
    {
        "content": "<p>what other filters would people want?</p>",
        "id": 243339178,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624250451
    },
    {
        "content": "<p>I suppose you certainly could define a 9-digit \"normalized\" NDC product code format.  But I've only seen that distributed in the 8-digit with dash format.  Until and unless we have examples where it's needed and requested to have the 9-digit format, I think I wouldn't include that.</p>",
        "id": 243341479,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624253782
    },
    {
        "content": "<p>but how would you include/exclude those codes from a vlaue set (the 8 digits ones with a dash, which is what I meant by code9)</p>",
        "id": 243341730,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624254240
    },
    {
        "content": "<p>I agree that if we are going to include them as an additional code, then you would need a property and filter for them.  In that case I think I would make the 'code-type' value either <code>8-digit</code> or, maybe better, <code>product</code>.  But we would also need to consider whether we should include hierarchy, so that all of the full \"package\" level codes are grouped under the corresponding \"product\" level code.  It seems that where the \"product\" level codes are used is SPL (I'm not aware at the moment of anywhere else)?</p>",
        "id": 243342992,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624255805
    },
    {
        "content": "<p>we'd have to invent codes for heirarchy, and that generally ends badly. So I prefer the property approach</p>",
        "id": 243343324,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624256236
    },
    {
        "content": "<p>Sure.  I agree with using the property approach.</p>",
        "id": 243343400,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624256298
    },
    {
        "content": "<p>code-type = product then</p>",
        "id": 243343405,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624256316
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191503\">Robert McClure</span> <a href=\"#narrow/stream/179202-terminology/topic/Multiple.20Codes.20for.20Concepts/near/242608041\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> Here is the thing, as I have said, the guidance in UCUM docs is not as helpful as I would like to see regarding practical use. I suppose that is yet another task I need to add to my list - talk to LOINC about clarifying UCUM. My point is this, we - those of us interested in data communication - are not as interested in the use of UCUM to convert between different equivalent units as we are in using it to identify a specific, focused, unit of measure. That unit may be only of use in one place and have no coversions to anything.  But accurate understanding of meaning and high fidelity of understanding is the goal. Therefore I suggest that we come to an agreement that for our use UCUM annotations provide unique information and that we consider the entire exchanged expression as a complete unique concept represented as a unique code. We can tackle unit conversion equivalenace as a separate issue that follows defined UCUM governance. I would like to point out that the perspective I am promoting is not in direct contradiction with the UCUM documents. In particular section 3.2 \"ARBITRARY UNITS\" states \"Arbitrary or procedure defined units are units whose meaning entirely depends on the measurement procedure (assay).\" therefore they have meaning, just not in relation to other units. It also states that they realized (starting with 1.6) that these units are indeed \"commensurable.\" Unfortunately the text consistantly uses phrases like \"...an arbitrary unit and is not comparable with any other arbitrary unit or term\" when the comparison under question is one of unit <em>mathematics</em> comparison but not unit meaning. </p>\n<p>I will work to clarify this interpretation with LOINC but if we do not follow this guidance and consider all UCUM expressions as unique ideas, different concepts represented by different codes, we must toss out all the arbitrary annotations. I understand this means we must consider unit mathematics (conversion) equivalency as a separate task, but I suggest that is reassonable and possible.</p>\n<p>Thoughts? <span class=\"user-mention silent\" data-user-id=\"191343\">Michael Lawley</span> , <span class=\"user-mention silent\" data-user-id=\"261105\">Colin E.</span> , <span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> , <span class=\"user-mention silent\" data-user-id=\"191982\">Ted Klein</span> , <span class=\"user-mention silent\" data-user-id=\"195036\">Carol Macumber</span></p>\n</blockquote>\n<p>I've been off for a week's holiday and it looks as if this subject has had a fair bit of traffic and maybe moved on beyond the point where i can keep up, but i'll  comment where I think can ;-)</p>\n<p>AFAIK UCUM is designed to provide 2 main things- simple (verifiable) syntax, and semantics for \"unit-aware\" comparison and conversion of Quantities . Both of those are extremely useful, but they both have their limitations.</p>\n<ul>\n<li>\n<p>The syntax leans emphasises simplicity and lack of ambiguity for machine-compatibility. It's not designed to optimise human readability.</p>\n</li>\n<li>\n<p>The semantics deals with mathematical equality as the key (almost the only) semantic relationship. Two expressions are equal if you can divide one by the other and get the result value of 1, or 1.0. That's it, UCUM doesn't deal with other relationship like synonyms. Even the two variants of Litre (capital \"L\" and lower case \"l\") are dealt with by just defining two separate concepts with the same value.</p>\n</li>\n</ul>\n<p>More tricky questions exist-ike for example: \"uL/L\" = \"nL/mL\", but are they true synonyms? I.e. can you exchange one for the other without loss of information, and if you can why do so many UCUM lists cointain both?</p>\n<ul>\n<li>The concepts are modelled in a \"concept space\" of base units and powers of those units.</li>\n</ul>\n<p>I think it is asking too much of the inner workings and intent of UCUM to say, for example that there is an issue with \"the comparison under question is one of unit mathematics comparison but not unit meaning\". As far as UCUM is concerned the unit mathematics comparison IS the unit meaning. That's the power (you can convert 1m/s to 1000mm/s) but also the limitation ( 1g/g == 1L/L because the dimensionality of both is \"1\").</p>\n<p>IMHO the issue of human readability is significant, but only sometimes. In the short term the answer for us is almost certainly a curated list of UCUM codes aligned to human-readable equivalents. This feels like \"unfinished business\" in UCUM because they have the \"printSymbol\" text already for each unit atom, what's missing are the syntactic rules for assembling those into expressions that remain readable. That seems like a solvable problem.</p>\n<p>The harder problems are the ones that the over-use of annotations (again IMHO) hint at-</p>\n<p>1) Countable items.</p>\n<p>The unit of a countable thing is \"1\", by definition according to SI. The authors of UCUM seem to have stepped on the precipice of a slippery slope by starting to define \"real\" units for countable entities (e.g. Colony Forming Units- [CFU]) and then maybe realised they could be signing themselves up to defining every countable thing/concept in human experience as a separate concept and stopped. </p>\n<p>Personally I would argue that the Si view is correct. If countable items are distinct that should be identified in the concept for the Term, not the unit. The unit might not necessarily be \"1\" (to distinguish countables from other dimensionless measurements) but all countables are the same.</p>\n<p>2) Unit hierarchies</p>\n<p>Colleagues working on prescribing tend to insist they need complex named countable units like \"packs of 30 tablets of 30mg per tablet active ingredient\". I think this is a general problem of hierarchical \"Quantities of Quantities\" that we don't have a good solution for at the moment, so we are shoehorning a hierarchical problem into a flat text field.</p>\n<p>3) Dimensionless values</p>\n<p>This is the issue that the unit-based model hits a \"singularity\" when units cancel out. So for example in UCUM, and presumably in any other units-based system, 1mg/g  == 1mmol/mol (==1/1000) when in fact a mass concentration is not in general the same as a  molar concentration of the same substances (it depends on the molecular masses of the components).</p>\n<p>I think to deal with this you would need a solution that handles Quantity dealing with the dimensionality in both the Unit space, and in terms of a more generalised mathematical representation, so that (for example) molar concentrations and mass concentrations are kept distinct.</p>\n<p>I don't know of any off the shelf / FOSS solution that works at that level.</p>",
        "id": 243408133,
        "sender_full_name": "Colin E.",
        "timestamp": 1624293044
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179202-terminology/topic/Multiple.20Codes.20for.20Concepts/near/242843268\">said</a>:</p>\n<blockquote>\n<p>Does this mean a supplement can define additional synonyms?</p>\n</blockquote>\n<p>A supplement can assert additional relationships, but can't change the meaning of existing concepts or introduce new codes.  So, for example, if someone had published a code system where multiple codes meant the same thing but hadn't declared that, a supplement could make the declaration.  (Similarly, a supplement could in principle assert subsumption relationships that were implicit in concept definitions but not made explicit.)  At least that's my opinion/understanding of what supplements can/should be able to do.</p>",
        "id": 243823271,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624557614
    },
    {
        "content": "<p>it can introduce new properties. So it can define synonyms.</p>",
        "id": 243826198,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624558952
    },
    {
        "content": "<p>It can't introduce new codes.  The synonym code would need to already exist.</p>",
        "id": 243842577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624566888
    },
    {
        "content": "<p>It must always be possible to tell if a code is valid within a code system without access to any supplements.</p>",
        "id": 243842711,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624566918
    },
    {
        "content": "<blockquote>\n<p>It can't introduce new codes. The synonym code would need to already exist.</p>\n</blockquote>\n<p>I think this is wishful thinking. I'd like that this is the case, for sure, but I don't think we actually say that or have that written down anywhere</p>",
        "id": 243843518,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624567312
    },
    {
        "content": "<p>It was a fundamental premise on which we allowed code system supplements to exist at all.  Supplements <strong>cannot</strong> define new codes.  End stop.  If you want to define new codes, you must use a new code system.  Supplements let you define new properties and relationships.  That's all they can do.</p>",
        "id": 243843793,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624567442
    },
    {
        "content": "<p>Allowing supplements to define codes would be a disaster...</p>",
        "id": 243843866,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624567468
    },
    {
        "content": "<p>I believe that Lloyd is correct - and that we have made that explicit.</p>",
        "id": 243843996,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624567539
    },
    {
        "content": "<p>did we? because what we actually said is:</p>\n<blockquote>\n<p>A codesystem supplement cannot define any new CodeSystem.concept.code. i.e.: all CodeSystem.concept.code in the supplement must be a code from the \"supplemented\" code system</p>\n</blockquote>",
        "id": 243844442,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624567757
    },
    {
        "content": "<p>when we define synonyms using properties, then we're in an undocumented area</p>",
        "id": 243844522,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624567798
    },
    {
        "content": "<p>if you think I've missed something actually documented, I'm all ears</p>",
        "id": 243844674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624567861
    },
    {
        "content": "<p>I don't think we have additional documentation (at least not anything that is \"official\"), but the issue is more about how we consistently interpret the documentation that we do have - as you have just shown.  I don't think that what we actually do or are proposing to do is \"define synonyms using properties\".  Instead what we are doing is \"declare that codes are synonyms using properties\".  You can't use a code as the value of the 'synonym' property (for example) that doesn't already exist in the code system.  If the content of that code system is defined in a CodeSystem resource instance (which is not required and may often not be the case), then that \"synonym\" code must be one of the CodeSystem.concept.code instances declared for that code system (not declared somehow in a supplement).  I think the next sentence in the documentation further supports this interpretation:</p>\n<div class=\"codehilite\"><pre><span></span><code>If a supplement needs to define new concepts/codes to use as property values, it can be paired with a new (possibly contained) Code System and use the Coding type for the property values.\n</code></pre></div>\n<p>I actually think that what is documented here should be pretty clear (but I'll acknowlege that this could in some degree be specific to my own interpretation).  So if someone has a clearly different interpretation of this same documentation, I am interested in hearing how you think it works.</p>\n<p>I will throw one more thing out here.  I think what really is still left essentially undocumented about the use of code system properties is how to define new <strong>properties</strong> (not property values) that are not already defined in the code system itself or in an existing \"standard\" place like the <a href=\"http://hl7.org/fhir/codesystem-concept-properties.html\">ConceptProperties</a> code system.  To add one (or maybe two or three) new codes for properties that the code system itself doesn't explicitly define, do you have to create another new code system (again, it seems that it can't be a supplement) in order to define them?  This is what I have struggled with a bit.</p>",
        "id": 243851153,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624571297
    },
    {
        "content": "<p>I'm pretty sure the intention is that supplements can define additional properties and relationships.  The ones we used as examples (e.g. pCLOCD) absolutely define net new properties.  One thing I <em>don't</em> think we've talked about is how to manage multiple supplements that define colliding properties.  (I think the default answer has been \"don't define value sets that rely on supplements that conflict\".)</p>",
        "id": 243859294,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624577482
    },
    {
        "content": "<p>Yes, I agree with you on that.  The slightly weird thing is that we don't mention that in the Code System Supplements <a href=\"http://hl7.org/fhir/codesystem.html#supplements\">section</a>.  But we do say it in the <code>CodeSystem.supplements</code> definition: <code>The canonical URL of the code system that this code system supplement is adding designations and properties to.</code></p>",
        "id": 243860328,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624578156
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Your use of \"synonym\" here (if I understand you) to mean \"synonym code\" is an edge case when considering typical code systems and I question if it is at all valid. Synonym everywere else (show me other examples?) has always been used to provide additional descriptions that <em>may</em> have nuanced differences in meaning (hopefully not, but it's human discourse) that are intended to be scoped as \"the same for use\" as the preferred description. The synonym idea is not intended to support \"synonym codes.\" So let's consider SCT and the equivalent expressions issue. Those are not considered \"synonyms,\" they are considered equivalent concept expressions and I believe would be considered equivalent codes. <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>? I admit I don't understand the prior discussion on \"codes are synonyms\" or what the point of all that was. I hope you all are not confusing what a code is -  codes are identifiers for concepts, nothing else. </p>\n<p>Here is the thing, it seems that we painted ourselves into a corner that I'm not sure was useful by restricting concepts to only one code. Granted, that is a big change and honestly I think it would mean changing the datatype for codesystem.concept.code from code to identifier. Yes big change for edge cases, but we seem to have quite a few. Just putting it out there. Maybe we can try using some sort of extension?</p>",
        "id": 243926551,
        "sender_full_name": "Robert McClure",
        "timestamp": 1624632809
    },
    {
        "content": "<p>I think that the approach that we worked out for \"synonym codes\" with the NDC 10 and 11 digit codes can work in general.  It's taken a long time to get it implemented, because it required changes to the terminology server code (rather than a CodeSystem resource), but Grahame now has it implemented on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>.  Here's an example: <code>http://tx.fhir.org/r4/CodeSystem/$lookup?system=http://hl7.org/fhir/sid/ndc&amp;code=00409371801</code>.  I completely agree that talking about multiple codes for a concept as \"synonyms\" can be extremely confusing and misleading.  I think it would be best to change the <code>synonym</code> code in the <a href=\"http://hl7.org/fhir/concept-properties\">concept-properties</a> code system to something else (maybe at least to <code>synonym-code</code>?) to help lessen the confusion with the primary use of \"synonym\" to refer to alternate descriptions/designations, but that's what we have now.</p>",
        "id": 243929776,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624634265
    },
    {
        "content": "<p>Ok so I did misunderstand one thing, which is that the intent is that the code has to be defined in it's own right, and all the synonym property is doing is claiming that it's a the same concept</p>",
        "id": 243970000,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624654750
    },
    {
        "content": "<p>Yes, that's right.  But the $lookup for either the 10 or 11 digit codes is already working (at least it did for the ones that I checked), so I assumed that you had done the part about defining the code in its own right.   What I haven't actually tried to do yet is define an NDC 10-digit or 11-digit only value set using the <code>code-type</code> property and see what the $expand results are for that.</p>",
        "id": 243971314,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624655487
    },
    {
        "content": "<p>it was in general I missed that.</p>",
        "id": 243971476,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624655602
    },
    {
        "content": "<p>I have been trying to follow this conversation and struggling with the implications of what I think is being said. This partly turns on the constraint of one code per concept (or not) and the apparent/consequential distinction between equivalent concepts, and equivalent codes.</p>",
        "id": 243999280,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1624690838
    },
    {
        "content": "<p>It now appears that with the statement \"the code has to be defined in it's own right, and all the synonym property is doing is claiming that it's a the same concept\", that really what's being said is that two <em>concepts</em> have to be defined and that the synonym poperty is stating equivalence of the concepts?</p>",
        "id": 243999283,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1624690848
    },
    {
        "content": "<p>Yes.  That's what I think.  But I've also thought that (at least at present) we shouldn't rely on that alone for declaring the equivalence.  There should also be a ConceptMap instance (explicit or implicit) that declares that and of course can be used to support $translate between the different \"synonym codes\".</p>",
        "id": 244012102,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624709634
    },
    {
        "content": "<p>I think that a synonym code goes beyond saying the two concepts are equivalent. claiming two codes are synonyms means that they are equal in every way except the literal code. So other than the synonym property, all their properties are the same</p>",
        "id": 244015096,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624714083
    },
    {
        "content": "<p>Yes, I agree.  But, as you know, we had the discussion before about the difficulty of making a reliable and reproducible distinction between 'equal' and 'equivalent', which led to removing 'equal' from the ConceptMap relationships in R5.  Depending on how you would interpret 'equal', two concepts that were identical in everything <strong>except</strong> for having different codes wouldn't necessarily be considered 'equal'.  So I stick with using 'equivalent'.</p>",
        "id": 244015525,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624714604
    },
    {
        "content": "<p>Agree.  Any property, relationship or designation that holds for any synonym should hold for all.</p>",
        "id": 244034613,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624741901
    },
    {
        "content": "<p>except the synonym property ;-)</p>",
        "id": 244034967,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624742366
    },
    {
        "content": "<p>I really am uncomfortable with this approach. You are making something that will be very simple to screw up. I suspect this is all some sort of hack to make a complex thing work within existing TS functionality. We should not be making mulltiple concept objects for something we KNOW is one thing, just so we can have multiple codes for it. Fix the damn requirement for one and only one code for a concept. And I think concet.code should use the datatype Identifier. Restrict out the things we don't need and make it 1..*</p>",
        "id": 244217795,
        "sender_full_name": "Robert McClure",
        "timestamp": 1624923442
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I assume your comment is mostly directed at my comment on <code>the approach that we worked out for \"synonym codes\"</code>.  It's certainly OK to change your mind, but apparently you were comfortable with this approach when we reviewed and voted on it for NDC-11 on <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=91983476\">8/20</a> (item #7) - you made the motion to approve it.  The approach hasn't changed.  Maybe it would be good and probably better to have true \"first class\" support for multiple codes per concept designed into the specification - but this approach can accomplish a very similar result.  If there is a specific reason for changing your position I'm definitely interested in hearing what it is.</p>",
        "id": 244226622,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624933881
    },
    {
        "content": "<p>Simple fact is we're past the point where we can change this.  CodeSystem is normative.  Changing Concept.code to repeat would be a breaking change.  And it would break a <em>lot</em> of existing systems.  The notion of synonym codes has long been agreed to be handled this way.  It's relatively uncommon and the work-around defined functions just fine.  Yes, it's a bit complex, but the systems that deal with it must deal with far greater complexities.</p>",
        "id": 244232420,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624940988
    },
    {
        "content": "<p>Yes, agree.</p>",
        "id": 244232480,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624941056
    },
    {
        "content": "<p>Yes I've changed my mind. Yes, it's a breaking change. Yes, I think this approach is worth the break. Yes, I will accept that I'm likely in the minority and the hacked approach to deal with code systems with multiple codes can work BUT we need to bake into FHIR servers the understanding and tooling to use the hack we created.</p>",
        "id": 244438238,
        "sender_full_name": "Robert McClure",
        "timestamp": 1625065642
    },
    {
        "content": "<p>I don't know that it needs to be baked into all servers.  It SHOULD be baked into terminology servers.  There are lots of servers that won't recognize equivalence of pre-coordinated and post-coordinated expressions or equivalence of codes from different code systems.  Synonym codes from the same system aren't really any different.  It's not <em>good</em> when systems don't recognize those codes are equivalent, but systems function and life goes on when they don't.</p>",
        "id": 244438829,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625065842
    },
    {
        "content": "<p>I assume Rob meant terminology servers</p>",
        "id": 244475238,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1625081194
    },
    {
        "content": "<p>I certainly agree that a good set of test cases is important</p>",
        "id": 244475264,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1625081212
    },
    {
        "content": "<p>Two different identifiers are not equivalent. Whether the concepts that they identify are equivalent is a separate concern. As an R4 Terminology Server provider, I am not at liberty to change the cardinality of CodeSystem.concept.code, certainly not without hacking the C# reference library and risking breaking clients.  The obvious answer to me is to use the codesystem-alternate extension to identity instances where there are multiple identifiers for the same concept within a single Code System - but maybe I'm missing something?</p>",
        "id": 244500405,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1625094811
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  Those UCUM codes with annotations only actually have a special/implicit unit \"unity\"(means \"one\").</p>",
        "id": 250460553,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1629796975
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192103\">Lin Zhang</span> <a href=\"#narrow/stream/179202-terminology/topic/Multiple.20Codes.20for.20Concepts/near/250460553\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191503\">Robert McClure</span>  Those UCUM codes with annotations only actually have a special/implicit unit \"unity\"(means \"one\").</p>\n</blockquote>\n<p>It is more acurate to say that the an annotation in a UCUM code (text within {} braces) has the measning of Unity (==1). Annotations can be involved in complex expressions, the presence of an annotation doesn't reduce the whole expression to a value of \"1\".</p>\n<p>So,  <strong>30mg{wet weight}/L</strong>  is equal to <strong>30mg/L</strong> The annotation resolves to 1, and disappears as it has no effect on the result, but the expression as a whole has a non-Unity value.</p>",
        "id": 272689378,
        "sender_full_name": "Colin E.",
        "timestamp": 1645450890
    },
    {
        "content": "<p>BTW- a (very late) comment on the above regarding synonyms and UCUM.</p>\n<p>UCUM is solely concerned with matters of mathematical <strong>equality</strong>, not \"synonymity\" (if that's a word). UCUM has no concept of a synonym, as an example the UCUM atoms <strong>L</strong> and <strong>l</strong> (both meaning \"Litre\") are defined in the UCUM definition file as two separate items that happen to have the same value, they can't be designated as true synonyms.</p>\n<p>In many cases this might not seem to matter. If <strong>0.1 mmol/L</strong> is <em>equal to</em> <strong>100 umol/L</strong>, many people might be happy to say they are synonymous.</p>\n<p>However, if I say to users (Lab scientists and clinicians) that <strong>10 umol/mL</strong> and <strong>10 mmol/L</strong> are true synonyms, i.e. anything, including software is free to change one form to the other with NO loss or change of information, a significant proportion will tell me I'm wrong, because (a) one of the terms isn't exactly what the analyser or test kit produced, so it is verboten; and (b ) the denominator carries some hint of a \"sane\" sample size, and clinicians don't think of most lab samples in terms of litres.</p>\n<p>A more extreme example- In UCUM 1<strong>0mg/g</strong> == <strong>10mL/L</strong> == <strong>1%</strong>.  I don't think most of us would accept those as being synonyms, converting between them involves loss of information.</p>\n<p>So \"equal to\" means \"dividing one by the other gives a reult of 1\". That's not always a synonym. Not sure if theres' a separate word for it, \"equinym\" maybe?</p>",
        "id": 272691237,
        "sender_full_name": "Colin E.",
        "timestamp": 1645451822
    }
]