[
    {
        "content": "<p>Should the NamingSystem Resource have a title element, for a human-friendly name, as found in the ValueSet, CodeSystem and ConceptMap resources - or would that be 'overkill'?</p>",
        "id": 160160795,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1551922536
    },
    {
        "content": "<p>Do you have a specific use-case?</p>",
        "id": 160162873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551925245
    },
    {
        "content": "<p>So we might take the human-friendly name from the resource instance itself and place that on a page such as <a href=\"https://standards.digital.health.nz/id/nhi\" target=\"_blank\" title=\"https://standards.digital.health.nz/id/nhi\">https://standards.digital.health.nz/id/nhi</a>. Given that those other terminology resources already have a title element, is this an omission by design or by accident?</p>",
        "id": 160171798,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1551938004
    },
    {
        "content": "<p>As I look at the resource, it seems sort of a no-brainer to add it actually.  The only question is whether it should be 'title' or 'label' - i.e. the preferred label for the thing the namespace represents - what you should show on the screen when you have an identifier with that system (or a code with that system if displaying the system actually matters)</p>",
        "id": 160172188,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551938560
    },
    {
        "content": "<p>'Title' would be consistent with the corresponding element in the ValueSet, CodeSystem and ConceptMap resources. If starting from scratch, 'label' is probably a better name for an element that holds a human-friendly name - but it's too late to change ValueSet &amp; CodeSystem, so my vote would be for consistency.</p>",
        "id": 160172804,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1551939483
    },
    {
        "content": "<p>The reason I proposed a different name is that the purpose is slightly different.  Title is the human-friendly name for the resource instance.  NamingSystem.label would be the human-friendly name for the identifier that has the system.</p>",
        "id": 160205356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551971078
    },
    {
        "content": "<p>Lloyd may have a point there.  NamingSystem is a bit different in that respect.</p>",
        "id": 160208438,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1551973241
    },
    {
        "content": "<p>So <code>title</code> in a CodeSystem resource for SNOMED CT is the human-friendly name of the resource itself (not the particular SNOMED CT instance)?</p>",
        "id": 160283554,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1552046565
    },
    {
        "content": "<p>yes</p>",
        "id": 160756956,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552547345
    }
]