[
    {
        "content": "<p>Has there been any more work done on what the correct handling of an NDC 11 value is supposed to be in FHIR? Should we place the NDC 11 value within a unique value set? It feels wrong for my company to create a unique value set for such a commonly used set of values, but the FHIR NDC value set is very clear it is for NDC 10 values only: <a href=\"http://hl7.org/fhir/ndc.html\" target=\"_blank\" title=\"http://hl7.org/fhir/ndc.html\">http://hl7.org/fhir/ndc.html</a>.</p>",
        "id": 154013277,
        "sender_full_name": "Joseph Athman",
        "timestamp": 1540829438
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?</p>",
        "id": 154013287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540829770
    },
    {
        "content": "<p>Anyone else have insight in to what we should be doing here?</p>",
        "id": 154014401,
        "sender_full_name": "Joseph Athman",
        "timestamp": 1541027901
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 154014438,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541033944
    },
    {
        "content": "<p>This is an interesting issue which has come up and been discussed several times, but without actually reaching a firm conclusion (as I recall).  The issue, of course, is that the official published NDC codes are 10 digit (with dashes in 3 different arrangements), but what most (or probably all) drug database vendors and many others use for practical reasons is the unofficial normalized 11-digit format (without dashes).  The documentation for RxNorm <a href=\"https://www.nlm.nih.gov/research/umls/rxnorm/docs/2012/rxnorm_doco_full_2012-1.html\" target=\"_blank\" title=\"https://www.nlm.nih.gov/research/umls/rxnorm/docs/2012/rxnorm_doco_full_2012-1.html\">here</a> in <em>6.0 Normalizing NDC codes in RxNorm</em> describes this.  I think it also may help provide the solution, as I believe we can potentially use the non-proprietary RxNorm distribution of \"normalized NDC codes\" as the source for a FHIR \"11 digit NDC\" code system (if it's considered separate from RxNorm proper) and value set.  We would need to figure out how this is published and made accessible.  That's my take on it at this point.</p>",
        "id": 154014444,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541035471
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> that the RxNorm normalization NDC is the best openly available source for US NDC codes. NLM has stated they feel this is true. If we decide this is true (I suspect this would be something vocab + US Realm needs to jointly decide), then we need to figure out how we use it. If we can be very clear regarding what we exactly want distributed, perhaps we could get NLM to host this for us within VSAC as a value set. I understand it is a code system so perhaps we could also get this into UMLS but I suspect not, since they - correctly - see this as addition information provided with RxNorm (so it's already there. So if we can get it in as a value set in VSAC perhaps we could then use that to host it inside UTG as the code system?</p>",
        "id": 154014571,
        "sender_full_name": "Robert McClure",
        "timestamp": 1541084715
    },
    {
        "content": "<p>I agree that it would be ideal for VSAC to provide and host a value set for this (once we’ve worked out the code system details).</p>",
        "id": 154014573,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541085105
    },
    {
        "content": "<p>so what should the code system URI be?</p>",
        "id": 154014730,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541095678
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, always with the hard questions... In the past, when we've run into this sort of situation we occasionally decide this is an HL7 code system because we are taking data obtained elsewhere and crafting our specific view of it. Then we are responsible for keeping it up to date. I don't think NLM will publish it as a code system, it's linked content to rxnorm.  But perhaps we can get them (me) to publish it as a value set, and then we use the value set to update our republishing of the content as a code system. I'm sure others - <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> - will have an opinion.</p>",
        "id": 154015274,
        "sender_full_name": "Robert McClure",
        "timestamp": 1541190126
    },
    {
        "content": "<p>I was going to check to see if the way that RxNorm publishes it it could be considered as part of the RxNorm code system itself (<a href=\"http://www.nlm.nih.gov/research/umls/rxnorm\" target=\"_blank\" title=\"http://www.nlm.nih.gov/research/umls/rxnorm\">http://www.nlm.nih.gov/research/umls/rxnorm</a>) and then we can create a value set for the 11-digit NDC codes from that.  I didn't get a chance to check that out yet.  But I think they would be publishing these as coded attributes (mappings) of the RxNorm codes rather than as separately identifiable codes themselves, so there's a good chance that it won't be quite that easy.  But I think that's pretty much what Rob M. is also suggesting, and maybe that can work.</p>",
        "id": 154015276,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541190825
    },
    {
        "content": "<p>I always argue against reimplementing external content as our own internal code system, as this obligates us to take on the burden of maintenance and currency.  Right now the entire reason for having 'stubs' for external code systems that we have some enumerated (e.g. SNODENT subset) in HL7 is to help alleviate that burden - but this does not make the burden go away.  The external sources occasionally update the content, and we have not funding or good processes in HL7 to stay on top of this.  Sequestering such material at least provides the information so we can periodically check to see if it is still current and OK  Therefore I would suggest that we have such an external 'stub' for the external code system, and import the codes that are needed, much as we have done in the case of the Dental content in V3.  This may require some MOU to make happen, not sure.</p>",
        "id": 154015287,
        "sender_full_name": "Ted Klein",
        "timestamp": 1541192930
    },
    {
        "content": "<p>so what HL7 needs to do is to define the URL for NDC 11 letter codes.  We can also choose to publish the actual code system, but I don't see that as at all necessary in the short term. So let's just decide on the URL please.</p>",
        "id": 154015289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541193335
    },
    {
        "content": "<p>I don't think the RxNorm URL is appropriate, because we say CUI of type SAB, and I don't think we should change that</p>",
        "id": 154015290,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541193370
    },
    {
        "content": "<p>note that if we do decide to publish an actual code system for implementer convenience, we can choose to do so via the package fhir.tx.support, which I am maintaining though FHIR foundation as a way to publish code systems we don't maintain but which the terminology servers need to support for various reasons</p>",
        "id": 154015291,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541193451
    },
    {
        "content": "<p>It would probably be best if we could get a url for this from NLM.  But if we can't have that, then maybe an HL7 url like <a href=\"http://hl7.org/fhir/sid/us-ndc-11\" target=\"_blank\" title=\"http://hl7.org/fhir/sid/us-ndc-11\">http://hl7.org/fhir/sid/us-ndc-11</a>.</p>",
        "id": 154015298,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541194081
    },
    {
        "content": "<p>I thought about a <a href=\"http://terminology.hl7.org\" target=\"_blank\" title=\"http://terminology.hl7.org\">terminology.hl7.org</a> url, but I'm not sure if we are intending to use those for external code systems this way (guessing not).</p>",
        "id": 154015299,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541194151
    },
    {
        "content": "<p>Hmmm...so a good question here.   In most cases, we do not want to make a URL at <a href=\"http://terminology.hl7.org\" target=\"_blank\" title=\"http://terminology.hl7.org\">terminology.hl7.org</a> for external code systems except where the external organization is one of those that cannot figure out how to spell URL, LOL.   That having been said, if we are creating a URL in hl7;org/fhir, then I would think that it would be better to put it at <a href=\"http://terminology.hl7.org\" target=\"_blank\" title=\"http://terminology.hl7.org\">terminology.hl7.org</a> instead...all this having been said, I still want to get the package/IGpublish stuff working to generate the browsable content at <a href=\"http://terminology.hl7.org\" target=\"_blank\" title=\"http://terminology.hl7.org\">terminology.hl7.org</a> this month if possible, certainly no later than next month...</p>",
        "id": 154015300,
        "sender_full_name": "Ted Klein",
        "timestamp": 1541194395
    },
    {
        "content": "<p>Have we set up any kind of separate space for external code systems in <a href=\"http://terminology.hl7.org\" target=\"_blank\" title=\"http://terminology.hl7.org\">terminology.hl7.org</a>?  I'm not thinking that I've heard of anything, but I wonder if we want to do something different than <a href=\"http://terminology.hl7.org/CodeSystem\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem\">terminology.hl7.org/CodeSystem</a> if it's external?  This is just a thought, but maybe something like <a href=\"http://terminology.hl7​.org/CodeSystem/ext/us-ndc-11\" target=\"_blank\" title=\"http://terminology.hl7​.org/CodeSystem/ext/us-ndc-11\">http://terminology.hl7​.org/CodeSystem/ext/us-ndc-11</a>?</p>",
        "id": 154015302,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541195073
    },
    {
        "content": "<p>That is yet to be discussed.  There is a separate Git folder for maintenance (but all the product families have their own there as well).   WE have a few choices, the first and most obvious that comes to mind is <a href=\"http://terminology.hl7.org/external/CodeSystem\" target=\"_blank\" title=\"http://terminology.hl7.org/external/CodeSystem\">http://terminology.hl7.org/external/CodeSystem</a> etc, but there may be better options.  Thoughts?</p>",
        "id": 154015309,
        "sender_full_name": "Ted Klein",
        "timestamp": 1541197785
    },
    {
        "content": "<p>if we give it a URL in <a href=\"http://terminology.hl7.org\" target=\"_blank\" title=\"http://terminology.hl7.org\">terminology.hl7.org</a>, then we have to create a code system resource, though it can have content = not-present</p>",
        "id": 154015310,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541197834
    },
    {
        "content": "<p>I'm fine with that url variation, too.  A content not-present code system makes sense and shouldn't be a problem.</p>",
        "id": 154015312,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541197964
    },
    {
        "content": "<p>That is exactly what I'm thinking Grahame...we will have quite a few code system resources in UTG for all of the external code systems in V3 that must be generated into the coremif that have no content in v3...these things are what I am talking about when I refer to 'stubs'...</p>",
        "id": 154015327,
        "sender_full_name": "Ted Klein",
        "timestamp": 1541200571
    },
    {
        "content": "<p>Right now we have two different options:  1) all code systems go into <a href=\"http://terminology.hl7.org/CodeSystem\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem\">terminology.hl7.org/CodeSystem</a>, and the ones that are NOT maintained by HL7 (whether or not they have content, most do not) are listed in the List manifest as external in the \"external\" area (not sure how to render this yet tho...).  2) we have a separate path for these as <a href=\"http://terminology.hl7.org/external/CodeSystem\" target=\"_blank\" title=\"http://terminology.hl7.org/external/CodeSystem\">terminology.hl7.org/external/CodeSystem</a> (or something like that)</p>",
        "id": 154015328,
        "sender_full_name": "Ted Klein",
        "timestamp": 1541200703
    },
    {
        "content": "<p>I am ambivalent about which of these two ways to go, and open to other suggestions as well</p>",
        "id": 154015329,
        "sender_full_name": "Ted Klein",
        "timestamp": 1541200733
    },
    {
        "content": "<p>Should not have a seperate path on the end point</p>",
        "id": 154015459,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541273485
    },
    {
        "content": "<p>I learned the Olivier Bodenreider today that the 11digit format generates some non-unique codes and so there may be some issues. We'll need to do some investigating.</p>",
        "id": 154015519,
        "sender_full_name": "Robert McClure",
        "timestamp": 1541309849
    },
    {
        "content": "<p>I'd like to hear where Olivier believes this will be non-unique.  From my understanding of the algorithm for transforming to 11 digits I don't believe that would be the case (unless the officially published NDC codes may also in some cases be non-unique, which I suppose is possible).  I definitely am interested in hearing the details from Olivier and would like to see any examples where this is an issue.</p>",
        "id": 154015522,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541311205
    },
    {
        "content": "<p>whatever, this doesn't mean it's not a code system?</p>",
        "id": 154015827,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541484085
    },
    {
        "content": "<p>Agree.  But of course we do have the rule that \"Within a code system definition, all the codes SHALL be unique\".  So if the algorithm to convert to the 11 digit codes (by padding the three segments with zeros to their full length) does have an issue with non-uniqueness, then we'll have to determine how to address that.</p>",
        "id": 154015830,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541484877
    },
    {
        "content": "<p>well, we know of some that a non-conformant</p>",
        "id": 154015832,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541485244
    },
    {
        "content": "<p>anyway, it seems like the URL is going to be <a href=\"http://terminology.hl7.org/CodeSystem/ndc-11\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/ndc-11\">http://terminology.hl7.org/CodeSystem/ndc-11</a></p>",
        "id": 154015833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541485263
    },
    {
        "content": "<p>I really appreciate all of the discussion here and driving towards a solution. I think this will really help interoperability.</p>",
        "id": 154016085,
        "sender_full_name": "Joseph Athman",
        "timestamp": 1541560800
    },
    {
        "content": "<p>Hi Joe, Rob, all. I'm working on a prescription-related  implementation guide for use in the US (CARIN Alliance's consumer realtime pharmacy benefit check - RTPBC), and also need to specify use of normalized NDC11s. We're working with the Pharmacy and Finl Mgmt WGs, and Melva pointed me to this thread. </p>\n<p>I spent a few minutes on the FHIR / terminology pages looking to see if a code system URL has been established as discussed here, but didn't find anything. I could definitely just be missing it...</p>\n<p>This is something we'll definitely need, so I'm happy to do anything I can to be of help</p>",
        "id": 178486670,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1571413812
    },
    {
        "content": "<p>It's been quite a while, but appreciate you re-engaging on this, <span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span>, as we obviously dropped the ball on this collectively and we do need to arrive at a solution.  In FHIR R4, which was released shortly after our previous discussion, we now have code system supplements.  But, according to our rules a supplement can't define any new codes, so that won't work for what we are wanting to do here.  It seems that under the present (normative) rules we must create a new url and code system (that is not a supplement) if we want to use these codes in Coding.code (which we do).  So then I think we're still at the question of who will own and manage this new code system for use of these codes in FHIR.  Is Grahame's suggestion above of <a href=\"http://terminology.hl7.org/CodeSystem/ndc-11\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/ndc-11\">http://terminology.hl7.org/CodeSystem/ndc-11</a> still the best candidate (I'm assuming likely so)?  That, of course means that HL7 will be the owner.  Terminology servers that already support RxNorm should be able to relatively easily support this new code system as well, with the content being obtained from the regular RxNorm distribution. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"192948\">@Joseph Athman</span></p>",
        "id": 178704923,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1571696695
    },
    {
        "content": "<p>Melva suggested I create a tracker item for this, which I did here... <br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25045\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25045\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25045</a></p>\n<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"192948\">@Joseph Athman</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span></p>",
        "id": 178874878,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1571850637
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span>.  It's on the to-do list.</p>",
        "id": 179188990,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1572213751
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> . Quick question: An imp guide that I'm writing is on track to ballot in January and needs to include NDC11s.</p>\n<p>Until this URL is in place, what would be the right way to reference it in my IG? I want to do it in a way that indicates we'll be using the new URL but won't cause publishing issues due to it's not existing yet.</p>\n<p>And this is probably a dumb question, but I want to be clear in my understanding... Will HL7 create just the <em>code system</em> url (<a href=\"http://terminology.hl7.org/CodeSystem/ndc-11\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/ndc-11\">http://terminology.hl7.org/CodeSystem/ndc-11</a>), and then I'll need to define a ValueSet in my profile that refers to it... which I'll then bind to in my MedicationRequest profile?</p>\n<p>Thanks for your help!</p>",
        "id": 181653893,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1574440254
    },
    {
        "content": "<p>This question has come up again and we do need to get it resolved.  The <a href=\"https://jira.hl7.org/browse/FHIR-25045\">tracker</a> was looked at again on Jan. 23 and flagged at that time for review by HTA, but I haven't heard anything subsequently.  So the main question now is, I think, can we go ahead and create and publish this as a code system using <code>http://terminology.hl7.org/CodeSystem/ndc-11</code> as the system url?  Or is there an alternative plan?  <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span> (I've likely left out some others who could or should be tagged, but this should be a good start)</p>",
        "id": 198882600,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1590581950
    },
    {
        "content": "<p>Strongly suggest we get this on the agenda for today's HTA call.</p>",
        "id": 198885828,
        "sender_full_name": "Ted Klein",
        "timestamp": 1590583991
    },
    {
        "content": "<p>I'm resurrecting this old thread to to inform everyone that there has been further progress on this.  We came up with a different solution to support the NDC 10 and 11 digit codes using a new <code>code-type</code> property.  Grahame has completed the additional implmentation for that on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>.  Here's an example: <code>http://tx.fhir.org/r4/CodeSystem/$lookup?system=http://hl7.org/fhir/sid/ndc&amp;code=00409371801</code>.  You should now be able to create value sets that contain only 11-digit or 10-digit codes, using the <code>code-type</code> property.  The NDC content on <a href=\"http://tx.fhir.org\">tx.fhir.org</a> is currently out of date, but I'm hoping to update that today.</p>",
        "id": 243932014,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624635248
    }
]