[
    {
        "content": "<p>As we discussed on the last call (6/28), I've divided the previously proposed block vote into 4 smaller blocks which should help us to be able to review and vote on the specific blocks with greater confidence.  This is the same overall list of items that we had been proposed for voting on the 6/28 call (minus the ones that were pulled).  To find these items in GForge, use the filter Reviewing Work Group = Vocabulary, status = (any open status) and Group = A, B, C or D (as explained below).<br>\n<strong>Group A</strong>: Affirmative comments with proposed Persuasive resolutions (18 items)<br>\n<strong>Group B</strong>: Negative comments with proposed Persuasive resolutions (and either non-substantive or compatible change) (18 items)<br>\n<strong>Group C</strong>: Affirmative comments with proposed non-Affirmative (Persuasive with Mod, Not Persuasive, Not Related, Considered ...) resolutions (22 items)<br>\n<strong>Group D</strong>: Negative comments with proposed Not Persuasive or Persuasive with Mod resolutions (14 items)</p>\n<p>The plan will be to vote on all 4 of these blocks on the call this Thursday (7/12).  Please complete as much review as you are able and plan to vote on as many of the blocks as you feel able to.  I will also post the lists of specific items for the blocks on the proposed call agenda.</p>\n<p>We will also try to cover as many of the \"fit for teleconference\" items on the calls today and Thursday as we are able, and will propose additional block votes (with the intention of keeping each of them at a \"manageable\" size) and expect to schedule multiple block votes on each of the upcoming calls so that we are able to get through the list of outstanding items in time for the ballot deadline.</p>",
        "id": 153974369,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1531165566
    },
    {
        "content": "<p>Also let me know if you would like to have any particular items pulled from any of the blocks.</p>",
        "id": 153974372,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1531165864
    },
    {
        "content": "<p>I've also added this item to block A: <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16332&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16332&amp;start=0\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16332&amp;start=0</a> (so it's now 18 items), which is from the 2018-May Core Normative Infrastructure ballot (rather than Conformance).</p>",
        "id": 153974375,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1531167422
    }
]