[
    {
        "content": "<p>I saw someone in this stream mention that 'display' does not have to be unique within a code system, and I can't find anything in the documentation that asserts otherwise.  When presenting a list of coded options to a user, how is a user supposed to choose between two options with the same display string?</p>",
        "id": 274563818,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1646756215
    },
    {
        "content": "<p>I would have to assume that there is another attribute in play. Perhaps one of the codes is deprecated. Perhaps one of the codes is an abstract or a branch (not a leaf) and isn't supposed to be used as a leaf. Ultimately you'd have to take it up with the author of the code system as to why two different codes have the same display/definition.</p>",
        "id": 274581399,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1646763158
    },
    {
        "content": "<p>Typically it's tied to associations/relationships.  If all you see is the display, the user's going to have a problem.  So typically, with a value set you'll either constrain to codes with distinct displays where the context implicit in the display aligns with the context of the data element, or you'll define valueset-specific designations that provide the additional context/uniqueness.</p>",
        "id": 274592740,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646767436
    },
    {
        "content": "<p>The challenge we have is that people don't want to see redundant context.  If you're looking at a UI that says \"Arm fracture: type\", you don't want to see a list of codes that say \"compound arm fracture\", \"greenstick arm fracture\", \"arm stress fracture\" - you just want to see \"compound\", \"greenstick\", \"stress\".  However, those displays would make perfect sense if the UI prompt was \"Injury type\".  Different code systems make different assumptions about UI context, and thus impose different rules on display names.</p>",
        "id": 274593185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646767638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is right, the meaning of the display is tied to the \"fully specified meaning\" which could be in an alternate display and would usually include some semantic type information, and additionally in the concept context (IE: the relationships.) \"Cold\" is a classic example that can occur in a code system as the display for multiple concepts (temperature and condition.)</p>",
        "id": 275003913,
        "sender_full_name": "Robert McClure",
        "timestamp": 1647018926
    }
]