[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> : several implementers have asked me about NUCC specialisties. I generated a code system resource for NUCC which would make it easy for all FHIR implemetnters to use it. How can we distribute it? </p>",
        "id": 153841639,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469794929
    },
    {
        "content": "<p>This appears to be an HTA or US affliate issue</p>",
        "id": 153841640,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469794986
    },
    {
        "content": "<p>Does HTA have any documentation about the correct way to requiest this?</p>",
        "id": 153841641,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469795171
    },
    {
        "content": "<p>We've just had an email thread on this with the conclusion that NUCC needs to be pulled from the v3 MIF distribution, based on concerns expressed by AMA representatives (AMA is the steward/manager, not the actual owner).  What you have in the external code systems list looks appropriate to me, as it links to the AMA site (which refers to licensing), and doesn't contain content.  Is there anything else needed?</p>",
        "id": 153841643,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1469796176
    },
    {
        "content": "<p>listing the NUCC in the terminology system list is necessary, but leaves many things unstated. Providing an actual code system resource resolves all those things. </p>",
        "id": 153841644,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469798522
    },
    {
        "content": "<p>agree with using CodeSystem - are the \"unstated things\" something that we need to ask HTA or \"US affiliate\" about?</p>",
        "id": 153841655,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1469803151
    },
    {
        "content": "<p>well, could be. It's obvious to me what would be correct, and I'm pretty sure there's only one correct answer, but it might not be clear to some</p>",
        "id": 153841656,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469803293
    }
]