[
    {
        "content": "<p>The OID for the Value Sets for v2 tables 0568 and 0930 are currently the same.  This isn't intuitive to me since they have different URLs.  First Q is whether this is official or still open to revision?</p>",
        "id": 184036707,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1576984191
    },
    {
        "content": "<p>I'm not entirely sure if that is by design (probably) or a mistake.  The content of the two is completely identical, so I think that at least theoretically they could be considered to be the same value set and code system, with 2 different V2 table numbers.  In V2.9 they are not enumerated in the specification (or even logically defined) - the value set is specified in both cases with the Description \"Value Set of codes of units of measure that are used to specify volume\" and Content Logical Definition \"enumerated per table content\".  And I don't see them at all in the FHIR CI build or the current build of UTG.  <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>?</p>",
        "id": 184038436,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1576988057
    },
    {
        "content": "<p>I agree that they share the same CodeSystem but they are separate ValueSets at least as far as ID and URL so I don't think it makes sense for them to share an OID.  I don't think so on purely logical grounds, but ran into the issue for purely practical reasons.  I was importing all the JSONs into a newer version of some integration logic.  I had placed a unique on OID and as-is this violates it.</p>",
        "id": 184039873,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1576991225
    },
    {
        "content": "<p>On logical grounds, how do you say that 0568 is deprecated (<code>retired</code> appears to be the concept in the system) if it's not distinguished (by OID) from the 0930 system that replaces it.</p>",
        "id": 184039974,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1576991496
    },
    {
        "content": "<p>I need to check that. (But this kind of discussion should bei done in the v2 stream on the HL7 Channel and in UTG.)</p>",
        "id": 184048318,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1577009308
    },
    {
        "content": "<p>The tables were added in error a number of years ago in some ballot cycle.  The table description for 568 states: \"Volume Units Note this table has been deprecated and is replacaced by table 0930.\"  The same situation exists for tables 567/929.   They actually got published (made it past the QA review without being caught, and through multiple ballot cycles without being caught, which tells you something about how closely terminology has been examined in past ballots.    Since they are identical and both the older table should not be used (seems to be that in the ballot the newer ones added in error should the been the ones that were deprecated, but whatever...) the fact that the OIDs are the same should not matter for implementation - but of course if these are persisted in UTG with different URIs then the OIDs must be different.    We'll see if we can make a change s an erratic before 2.9 is published.   But we could also leave them the same and just have a NamingSystem entry that shows that both OIDs identify the same object.</p>",
        "id": 184050532,
        "sender_full_name": "Ted Klein",
        "timestamp": 1577013810
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span> Sorry.  Grahame suggested here (in a chain of conversation that went FHIR ValueSet page =&gt; UTG resource file =&gt; this question).</p>",
        "id": 184067607,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1577045400
    },
    {
        "content": "<p>Is there a channel for the UTG that you can link to?  We've been mapping v2 =&gt; v3 (+a bunch of code systems) for years so we may know of (or stumble upon) more items if we knew what to notice.</p>",
        "id": 184067873,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1577045841
    },
    {
        "content": "<p>BTW here are a bunch more:</p>\n<ul>\n<li>OID 2.16.840.1.113883.21.453:  v2-0568 and v2-0930</li>\n<li>OID 2.16.840.1.113883.1.11.10228:  v2-0952 and v3-Confidentiality</li>\n<li>OID 2.16.840.1.113883.1.11.20428:  v2-0719, v3-ConfidentialityModifiers, and v3-InformationSecurityPolicy</li>\n<li>OID 2.16.840.1.113883.1.11.78:  v2-0078 and v3-ObservationInterpretation</li>\n<li>OID 2.16.840.1.113883.1.11.20560:  v2-0959 v3-WorkClassificationODH</li>\n</ul>",
        "id": 185868084,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1579213227
    },
    {
        "content": "<p>I'm not clear if CodeSystem.Name is supposed to be unique as well but Codesystem-composition-altcode-kind and CodeSystem-codesystem-altcode-kind have a duplicate name.</p>",
        "id": 185869060,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1579213957
    },
    {
        "content": "<p>... there are other instances of the name conflict as well... enough that I assume it is not unique (FHIR doesn't clearly say it is).  However I find it odd that a name (even a Computer Friendly one) would duplicate.  A good example is OrganizationUnitType which is duplicated in both ValueSet and CodeSystem (e.g .0406 and 0474 is an example of both).</p>",
        "id": 185869409,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1579214225
    },
    {
        "content": "<p>In case you want to head towards uniqueness, here are all the rest of the duplicates (each duplicated in both CodeSystem and ValueSet): OrganizationUnitType (0406, 0474), ProviderRole (0286, 0443), ItemStatus (0625, 0776), AllowSubstitution (0161, 0279)</p>",
        "id": 185870153,
        "sender_full_name": "Clayton Daley",
        "timestamp": 1579214780
    }
]