[
    {
        "content": "<p>I discovered a varily depp flaw in the way OIDs were being generated for value sets. They were assigned to binding names, not value sets. And some value sets are used by multiple different bindings, and binding set names do not need to be unique... a real mess</p>",
        "id": 153873432,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488054912
    },
    {
        "content": "<p>I am retiring FHIR OID branch 2, which had been reserved for value sets, and creating branch 3, and re-identifying everything using the correct identifiers</p>",
        "id": 153873433,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488054973
    },
    {
        "content": "<p>oh - not good<br>\nsounds like a reasonable strategy to fix it</p>",
        "id": 153873434,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1488055040
    },
    {
        "content": "<p>Are you saying that all FHIR value sets will get new OIDs? If so, you should create a mapping table of old to new.</p>",
        "id": 153874354,
        "sender_full_name": "Robert McClure",
        "timestamp": 1488427840
    },
    {
        "content": "<p>The problem is that the same OIDs have been used for multiple things over time due to the assignment mechanism being broken - so there's no reliable assertion from old to new.  In theory we could do a range - i.e. old OID A might correspond to new OID X, Y or Z, but I'm not sure it's worth the effort.  OIDs would only have been relevant if people were using FHIR value sets in a v3 environment and that's a pretty rare thing right now.</p>",
        "id": 153874359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488431098
    },
    {
        "content": "<p>We've got the original files in SVN so if anyone really needs the mapping, we can make the effort when someone asks for a non-theoretical reason.</p>",
        "id": 153874360,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488431136
    }
]