[
    {
        "content": "<p>I'd love it if some vocab people could review this mapping of the OMOP Vocabularies table to HL7 standard OIDs and FHIR URIs. </p>\n<p><a href=\"https://docs.google.com/spreadsheets/d/1ykzbW-RMRJV4doIpZANibu45WveLFoFA/edit?usp=sharing&amp;ouid=111904620053364392286&amp;rtpof=true&amp;sd=true\">https://docs.google.com/spreadsheets/d/1ykzbW-RMRJV4doIpZANibu45WveLFoFA/edit?usp=sharing&amp;ouid=111904620053364392286&amp;rtpof=true&amp;sd=true</a></p>\n<p>I'll make changes or I can give edit access if you ask. </p>\n<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> HCPCS - which is correct?</p>\n<p>Once we've reviewed this, I'll work with the HL7 / OHDSI joint project to get this table filled out and agreed, and hopefully, added to OMOP itself</p>",
        "id": 250727537,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629958336
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> fyi</p>",
        "id": 250728163,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629958727
    },
    {
        "content": "<p>I'm unsure about the <code>vocabulary_concept_id</code> column - these may be the ids in a specific instance of the vocab data, but my understanding is that these are internal ids, allocated during a vocab load process, and not portable across tooling deployments?</p>",
        "id": 251372920,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1630411310
    },
    {
        "content": "<p>I notice AMT is not included in the list.  This may not be a bad thing - the support for AMT is archaic (dates back to AMT V2), but given that SNOMED is limited to a non-standard combination of US + UK + INT, that orphans AMT as well.</p>",
        "id": 251373350,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1630411514
    },
    {
        "content": "<p>It may also be useful to have a <code>FHIR Version</code> column corresponding to the <code>vocabulary_version</code> column, since they also don't, in general, align.</p>",
        "id": 251373533,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1630411595
    },
    {
        "content": "<p>well, we need to talk about Australian usage more generally, but that discussion belongs elsewhere.</p>",
        "id": 251374536,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630412125
    },
    {
        "content": "<p>I thought vocabulary_concept_id was standardised by athena?</p>",
        "id": 251374564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630412146
    },
    {
        "content": "<p>They are specific to an Athena instance.  If you run your own (rather than relying on <a href=\"https://athena.ohdsi.org/\">https://athena.ohdsi.org/</a>), then you will get different values. (Also if you reload from scratch with new versions - but I don't know how this is managed specifically for <a href=\"https://athena.ohdsi.org/\">https://athena.ohdsi.org/</a>)</p>",
        "id": 251375060,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1630412423
    },
    {
        "content": "<p>My main concern is that they are surrogate keys, not intrinsically stable.  I would be much happier if they were a function of the code system + code pair (and + version, where the codesystem doesn't support concept permanence), since then they'd be stable (and you wouldn't need a giant lookup table/map).</p>",
        "id": 251375636,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1630412750
    },
    {
        "content": "<p>well, anyway, that's kind of an OMOP problem more than a FHIR problem, I think. Doesn't affect this table, right?</p>",
        "id": 251375938,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630412886
    },
    {
        "content": "<p>not substantively, no</p>",
        "id": 251377092,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1630413507
    },
    {
        "content": "<p>ok finally getting a few moments to look at this...the entry for HCPCS in the spreadsheet is, I think, messed up.   Syntactically correct, semantically wrong I believe.   \"HPC\" the originally (back prior to 2001 I believe more than 20 years ago) this was entered as part of the pro forma import of UMLS.  It is the entirety of the technical composition of Healthcare Financing Administration (HCFA) Common Procedure Coding System (HCPCS), however no one in the real world of implemented systems uses this - it covers all three \"levels\" the first of which is CPT-4, and the others are CDT-2 dental codes and HCPCS modifier codes.   What I believe is actually used is now referred to as \"HCPCS(II)\" or just \"HCPCS\" and was formed to disentangle the conflation confusion originally.  The official title is \"Healthcare Common Procedure Coding System (HCPCS) level II alphanumeric codes\" and is identified with 2.16.840.1.113883.6.285 (for OID based terminology systems).    So I don't know if the entry for this in the OMOP stuff is accurate, or reflects an incomplete understanding of the etiology and use of this beast.  The HTA page at <a href=\"https://confluence.hl7.org/display/TA/Healthcare+Common+Procedure+Coding+System+%28HCPCS%29+Level+II\">https://confluence.hl7.org/display/TA/Healthcare+Common+Procedure+Coding+System+%28HCPCS%29+Level+II</a> has pretty complete information, and the CodeSystem resource \"stub\" in THO at <a href=\"https://build.fhir.org/ig/HL7/UTG/CodeSystem-hcpcs-Level-II.html\">https://build.fhir.org/ig/HL7/UTG/CodeSystem-hcpcs-Level-II.html</a> should also be correct.</p>",
        "id": 251640452,
        "sender_full_name": "Ted Klein",
        "timestamp": 1630536248
    },
    {
        "content": "<p>Do you want me to examine the other two items highlighted in yellow?    I am not sure what the column headings on the first row of the google sheet actually are intended to mean (\"vocabulary reference\"?   \"vocabulary_id\"?).</p>",
        "id": 251640544,
        "sender_full_name": "Ted Klein",
        "timestamp": 1630536315
    },
    {
        "content": "<p>all but columns B and C are from the omop table</p>",
        "id": 251640568,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630536337
    },
    {
        "content": "<p>I'm not sure I've got the yellow ones right, so sure, please review</p>",
        "id": 251640628,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630536364
    },
    {
        "content": "<p>And do we have anything on all the empty pale yellow squares?</p>",
        "id": 251641086,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630536707
    },
    {
        "content": "<p>We do, on several but not all.  I have not time to do the diligence required, but for sure some of these need straightening out.   <span class=\"user-mention\" data-user-id=\"340004\">@Davera Gabriel</span> I think is involved in this in some way, perhaps she can take some time to look into these?</p>",
        "id": 251646207,
        "sender_full_name": "Ted Klein",
        "timestamp": 1630540148
    },
    {
        "content": "<p>Hi guys...  I can provide some context which may help.</p>\n<p>I am a member of the newly-minted OMOP Vocab WG., its only met 3 times thus far.  The OMOP Vocab work used to be folded under the OMOP Common Data Model group, but due to changes in community requirements the need for a separate WG was embraced and thus formed.  Thus far the group has developed a mission and as of yesterday proposed a set of objectives and key results, most of which (in their draft form) aim to improve the vocab content development processes.  One thing we identified as a community need is an historical set of OMOP vocab releases, which are unavailable as static info.  Right now they employ a machine process which generates changes between development and production instances, but do not retain full histories / versions.  A work item at the upcoming annual symposium (unfortunately co-occuring during our next Connectathon) is the Vocab WG will be crowd-generating a \"time machine\" (their term) of full prior versions to host on an open resource.  Additionally, one of the SIG-like group of tasks identified for the WG is \"version control / concept lifecycle management\"  As such, please take-away that the OHDSI Vocab group is aware and has prioritized this as an area for work / improvement.</p>\n<p>An additional SIG-like activity identified in this group's formation is \"FHIR Terminology Alignment\" for which I have been designated as the lead.  I see my role therein as being focused on detailed activities that (it would seem) stem from the larger HL7 / OHDSI joint project.  Your spreadsheet is something I envisioned as being a key objective / starting point.  But I suppose the immediate take-away is to echo what <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> stated regarding discontinuity of OMOP concepts at times and add that the OHDSI Vocab WG is keen to improve the versioning processes.  HL7 FHIR will be better off while engaging to understand where they are with that and not make assumptions regarding the continuity (ie:  canonical-like) assertions of declaring versioning information / identifiers of components of the OMOP Vocabulary just yet.</p>\n<p>How can I assist with your goals?  I am happy to work with you.</p>",
        "id": 251759638,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1630606111
    },
    {
        "content": "<blockquote>\n<p>not make assumptions regarding the continuity</p>\n</blockquote>\n<p>Sure. but that kinds of means we're stuck at no go stage; the first thing to do is to assign code system identifiers so we can use codes...</p>",
        "id": 251771846,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630610638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> if you can help me understand more fully the need / context, I will be sure that is a priority item in the \"FHIR Terminology Alignment\" work.  But note:  I gather not a lot of progress may be made until after their symposium, but we can try.  I will look at your ss again and queue-up questions re: what I might not understand.  The next OHDSO Vocab WG is at the end of September, perhaps we can get this ask on that agenda</p>",
        "id": 251772530,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1630610924
    },
    {
        "content": "<p>well, I think the question of continuity isn't relevant here. The question is whether we (FHIR + OMOP communities) can agree to identify the OMOP vocabularies consistently. For things external to OMOP, HL7 needs to assign OIDS and URIs to them, and then we need to get them into our agreed list. Then, we need to agree what they are for the OMOP internal ones. And finally, we need to agree where this list is mastered and published</p>",
        "id": 251781385,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630614556
    },
    {
        "content": "<p>got it, thank-you.  I am happy to share this need to assign and engage the OHDSI Vocab WG, or ask for an agenda spot and invite you or appropriate FHIR designee(s) to engage on this topic.  Does this work as a next step?</p>",
        "id": 251787429,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1630617197
    },
    {
        "content": "<p>sure that works. What time are the calls?</p>",
        "id": 251787598,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630617294
    },
    {
        "content": "<p>Standby:  there was a spot kicking around on 9/21, and since that's during our WGM, I am double checking to see if that is actually the case and when the next one after that is scheduled so both options can be considered</p>",
        "id": 251789184,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1630618066
    },
    {
        "content": "<p>... in the future maybe we can get them to join our WGMs :)</p>",
        "id": 251789521,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1630618153
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"340004\">@Davera Gabriel</span> I am very keen to understand how I might be able to engage with the OHDSI Vocab WG.  As you might expect \"FHIR Terminology Alignment\" is something I (and a broader Australian OHDSI user community) are very keen on.</p>",
        "id": 251793084,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1630620026
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> That's great news.  The WG is just forming, finalizing their key objectives to initiate work on after the symposium.  As I eluded to above the community as a whole is absorbed with execution / attendance at their annual symposium 9/12-15.  I expected to be able to review the overarching key objectives and discern / develop what FHIR Terminology Alignment also fell within those.  Grahame's list of identifiers is a nice ask that at least somewhat falls in that general domain.  Perhaps we could work on a set of FHIR Alignment objectives / activities together / as a group?  Also, I am pretty sure the OMOP Vocab WG is an open meeting, although occurring at a time that's not so convenient for you.  I think I can help by facilitating convos / engagement between the respective Terminology communities, and am also thinking we might consider convening some meetings more conducive to participation among our Southern Hemisphere membership as well...  Can I suggest we start with the FHIR Alignment objectives based on their WG OKRs?  Certainly keen on my part to divide and achieve :)</p>",
        "id": 251896858,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1630682457
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> the OHDSI Vocab WG meets every other Tuesday at noon EASTERN (US) with some variance for the 5-week months.  the pattern is to meet at the same time as the OMOP CDM WG, but opposite weeks.  The next meeting is 9/21, which means the following is October 5.   What works for you?</p>",
        "id": 251898000,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1630682906
    },
    {
        "content": "<p>well, noon eastern isn't really very practical - 2am.</p>",
        "id": 251921932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630692969
    },
    {
        "content": "<p>I agree that alignment objectives are a good place to start</p>",
        "id": 251921983,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630692997
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I see there are a couple of OHDSI / HL7 workshops aiming to drum up community involvement that have been scheduled at the end of the month. I expect to have met again with the OHDSI Vocab group again before those workshops.   Does this obviate the need for the course of action you &amp; I have been discussing in this thread?   Or might I press ahead?  Please advise &amp; thanks</p>",
        "id": 253127072,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1631553621
    },
    {
        "content": "<p>no please press ahead. Those workshops would naturally include a summary report from one of of us regarding progress on this</p>",
        "id": 253127194,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631553674
    },
    {
        "content": "<p>and probably working through the need for it</p>",
        "id": 253127213,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631553684
    },
    {
        "content": "<p>good deal:  just wanted to check potential cross-purposes :)</p>",
        "id": 253127938,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1631553933
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Reviewing the referenced ss (for context to queue-up an agenda item in the OMOP Vocab WG next week) was this generated against OMOP v5.3.1 or 6.0?</p>",
        "id": 253589415,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1631801963
    },
    {
        "content": "<p>probably 5.3.1? I couldn't get the scripts to generate 6 to run - syntax and logic errors in 6.0.</p>",
        "id": 253630063,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631817755
    },
    {
        "content": "<p>mind you, there were errors to fix in 5.3 too. Quite surprising</p>",
        "id": 253630095,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631817770
    },
    {
        "content": "<p>fwiw:  5.3.1 is the most stable, deployed version.   This was established in late 2019 when they conducted a big community hackathon and surveyed the participants re:  their deployed versions.  The reason for this is the Atlas / other tooling stacks run on 5.3.1 and were not yet converted to 6.0.  As such, the 6.0 CDM was developed, and is now in re-development. Theya re actively working on 6.x in the CDM WG in 2021.   Im not sure of the newly minted \"6\" will be 6.1 or not.  I gather there were so few adopters of 6.0 that they might just stick w that.  So...  definitely do your work for now on 5.3.1.  This is what we used for the N3C implementation for the reason stated above.  The CDM WG is actively working on 6, but its not in any sort of widespread use.  Put conversion to 6.x on the development roadmap somewhere and be at-ease knowing your user base will likely be running 5.3.1 for the time being.</p>",
        "id": 253632889,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1631818815
    },
    {
        "content": "<p>Hello again <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Mik (at OHDSI) is asking what the significance of the red shaded cells?  I've sent over your comments above about the yellow highlighted cells.  Also:  they are starting up the OHDSO Vocabulary WG the following week on 9/28, not next week 9/21 as I thought.</p>",
        "id": 253640103,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1631821717
    },
    {
        "content": "<p>the two red shaded cells are my proposal for OHDSI to approve, the canonical URLs for the OMOP vocabularies. They show what the pattern would be</p>",
        "id": 253640235,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631821782
    },
    {
        "content": "<p>@Ted Klein - Would it be safe to use the following as the codeSystem  from <a href=\"https://terminology.hl7.org/CodeSystem-HCPCS.html\">https://terminology.hl7.org/CodeSystem-HCPCS.html</a>?<br>\nsee code system <a href=\"http://terminology.hl7.org/CodeSystem/HCPCS\">http://terminology.hl7.org/CodeSystem/HCPCS</a></p>",
        "id": 253645643,
        "sender_full_name": "Emma Jones",
        "timestamp": 1631824052
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> Does this mean we (implementers) can use either of these as the code system in our FHIR implementations?<br>\n<a href=\"http://terminology.hl7.org/CodeSystem/HCPCS\">http://terminology.hl7.org/CodeSystem/HCPCS</a>  or <a href=\"http://www.cms.gov/Medicare/Coding/HCPCSReleaseCodeSets\">http://www.cms.gov/Medicare/Coding/HCPCSReleaseCodeSets</a></p>",
        "id": 253743913,
        "sender_full_name": "Emma Jones",
        "timestamp": 1631886271
    },
    {
        "content": "<p>Sorry just saw this now - The Canonical URL for HCPCS is <a href=\"https://www.cms.gov/Medicare/Coding/HCPCSReleaseCodeSets\">https://www.cms.gov/Medicare/Coding/HCPCSReleaseCodeSets</a>.  This is in the most recent THO Published Release 2.1.0 and is considered authoritative.     The URI that was created algorithmically through the import from the old V3 coremif content when the initial working set for THO/UTG was created (<a href=\"http://terminology.hl7.org/CodeSystem/HCPCS\">http://terminology.hl7.org/CodeSystem/HCPCS</a>) was identified as erroneous and was corrected last year based on comprehensive information documented by HTA see page at <a href=\"https://confluence.hl7.org/display/TA/Healthcare+Common+Procedure+Coding+System+%28HCPCS%29+Level+II\">https://confluence.hl7.org/display/TA/Healthcare+Common+Procedure+Coding+System+%28HCPCS%29+Level+II</a>   You should not be using the THO-anchored URI, as it was part of the initial dataset for THO before vetting and review.    Is there any further information on this one, <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span>  and <span class=\"user-mention\" data-user-id=\"196635\">@Jessica Bota</span> ?</p>",
        "id": 254109508,
        "sender_full_name": "Ted Klein",
        "timestamp": 1632168348
    },
    {
        "content": "<p>New to this community here, so not sure it's the right place. But: How do you guys deal with the fact that the CMS only stores the current codes. They explicitly kill deprecated ones (to avoid having providers use it for billing). Do you keep them somewhere?</p>",
        "id": 254202906,
        "sender_full_name": "Christian Reich",
        "timestamp": 1632229355
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"409404\">@Christian Reich</span> HL7 doesn't \"keep\" copies of external terminologies.  The only exception to this is a \"courtesy copy\" of a portion of SNODENT in THO. External terminologies referenced in FHIR specs require an OID for the terminology and an immutable, canonical URI to support consistent publishing.  Information about those requirements can be found here:  <a href=\"https://confluence.hl7.org/display/TA/External+Terminologies+-+Information\">https://confluence.hl7.org/display/TA/External+Terminologies+-+Information</a>  Ted is asking about resolution of this requirement in his comment above.  We will need to develop an approach to this requirement in the OHDSI Vocab WG for OMOP.  Looking forward to that discussion!</p>",
        "id": 254370578,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1632318784
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ... do you have a JIRA ticket created for completion of your OMOP vocab mapping worksheet?  I've just come from the OHDSI CDM Vocab WG meeting, and I have an update.  Rather than message / chat, I thought it might be worthwhile to persist a chain of events as is enabled in JIRA?  My reasoning is that its more than one monolithic decision that OHDSI needs to consider to complete your worksheet. mtia...</p>",
        "id": 257239219,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1634059112
    },
    {
        "content": "<p>... if there isn't one - I'm happy to create one.   I just didn't want to create a duplicate</p>",
        "id": 257251343,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1634063928
    },
    {
        "content": "<p>I don't think there's one, thanks. I mean, I didn't create one because it doesn't - right now at least - impact on any published HL7 standards. But that doesn't mean we can't have one</p>",
        "id": 257252320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634064326
    }
]