[
    {
        "content": "<p>Can I use $lookup operation to get all child concept from a parent? For example on MESH code, given coding 'A', I would like to return codings for 'A01',...'A21'. I don't know if $lookup can do that or I have to define my own operation. <a href=\"/user_uploads/10155/Qzo7c9xbBtz5B9O2b_1FTKav/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Qzo7c9xbBtz5B9O2b_1FTKav/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/Qzo7c9xbBtz5B9O2b_1FTKav/image.png\"></a></div>",
        "id": 249769272,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629229614
    },
    {
        "content": "<p>child is a <a href=\"http://hl7.org/fhir/terminology-service.html#standard-props\">standard property</a> for those code systems with a defined hierarchy and can be requested in a $lookup operation</p>",
        "id": 249788064,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1629239915
    },
    {
        "content": "<p>You could also POST a ValueSet to $expand with a filter saying <code>parent = X</code></p>",
        "id": 250061192,
        "sender_full_name": "Jim Steel",
        "timestamp": 1629415675
    },
    {
        "content": "<p>There is no value set. The use case is that we are trying to build a viewer/browser for MeSH. Because MeSH has a tree structure, so the use case is that when clicking on one tree node (MeSH concept), the API returns the immediate children of that concept so the viewer can show them sub tree nodes. I think the $lookup operation that <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> suggested is good. The only problem is that the property structure is too complicated. Because we need to return both the Unique ID (the concept code) and the Tree Number of child concept, we have to deal with parts inside parts.</p>",
        "id": 250132286,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629473020
    },
    {
        "content": "<p>If you want to see how another terminology viewer/browser uses the API, you could have a look at <a href=\"https://ontoserver.csiro.au/shrimp\">https://ontoserver.csiro.au/shrimp</a> (and snoop its network requests in your browser's developer console). It does an $expand of a dynamic (ie not pre-existing) ValueSet that includes the focus concept's ancestors and direct children, then does a batch $lookup of those concepts to retrieve the parent/child links to wire up the graph</p>",
        "id": 250560619,
        "sender_full_name": "Jim Steel",
        "timestamp": 1629845744
    }
]