[
    {
        "content": "<p>Recent Touchstone testing has highlighted that some Terminology Server implementations are placing the definitions of operations defined by resource type (e.g. $expand, $lookup, etc.) in the rest.system element of their Capability Statement, rather than (or in addition to) the rest.resource element. As far as I can see the only definition of a terminology operation listed as a 'resource' type that has a system setting of true is $closure. Do others see this is a significant conformance issue?</p>",
        "id": 209722113,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1599780546
    },
    {
        "content": "<p>We inherit our CapabilityStatement behaviour from HAPI and thus have three operations defined at system level (<code>$closure</code>, <code>$versions</code>, and <code>$convert</code>), with everything else attached to the Resource.  I'm unaware if this has caused problems with Touchstone?</p>",
        "id": 209722560,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1599780900
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> is there a specific Touchstone test I should run to check this?</p>",
        "id": 209722883,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1599781154
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> if you run any of the TS operation tests in Touchstone,  you will see a pink ('c') (capability) flag against the Test Script Name and Destination if it considers that \"one or more interactions in this test script are not supported by the capability statement\". On of the possible warnings is based on where the operationDefinitions are placed in the Capability Statement.</p>\n<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span> was going to investigate further.  For example Touchstone is looking at rest/server/operation/definition/reference/valueset-expand and reporting that it can't be found  it the operation definition isn't in the rest.system element (c/f  rest/server/resource/valueset/read which can be found).</p>",
        "id": 209724159,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1599782321
    },
    {
        "content": "<p>I can speak to intent here. It's wrong to list an operation under a resource if it is not linked to a resource, but it's not wrong to list an operation under a resource even if it also operates at the system level, when that is still linked to a particular resource</p>",
        "id": 209734381,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599789853
    },
    {
        "content": "<p>it would probably be good to clarify this</p>",
        "id": 209734389,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599789873
    }
]