[
    {
        "content": "<p>Good morning! I'm currently working on an IG that makes very very extensive use of the PHIN VADS vocabulary. Thanks to <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , we are successfully able to use PHIN VADS value sets because of the us.cdc.phinvads package. However, we are now running into the issue of needing to use a CDC code system (PHIN Questions) which leads to build and validation errors for our IG. I know there was a thread about this issue last year and there was mention of involving the HTA and connecting with the CDC to work out these code system issues. I was wondering if there have been any updates on this effort and if not, I wanted to know the process for putting forth the effort to get the PHIN Questions code system supported.</p>",
        "id": 245957706,
        "sender_full_name": "Andy Stevens",
        "timestamp": 1626268675
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 245975428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626276269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, I wanted to follow up on this topic</p>",
        "id": 246722136,
        "sender_full_name": "Andy Stevens",
        "timestamp": 1626875495
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"421123\">@Andy Stevens</span>  I'm not sure of any details on this.  I think we will need to check (again?) with HTA. <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <br>\nThere is an HTA meeting today, but I expect this might need to be put on the agenda for a future call.</p>",
        "id": 246751791,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1626888532
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"421123\">@Andy Stevens</span> , Do you have a JIRA ticket associated with your specific request? If not, please open one and I'll be sure to get it on the agenda for the next call</p>",
        "id": 246758827,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1626891683
    }
]