[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I need your help with something. I'm doing something about including PHINVads in FHIR IGs. That will make it easy for IG authors to use them. But in order to do that, I need to sort out the canonical URL for a PHINVads value set. </p>\n<p>Right now, authors are just using the web site URL: <code>https://phinvads.cdc.gov/vads/ViewValueSet.action?oid={oid}</code>. but that's not the URL we want. I think it should be <code>https://phinvads.cdc.gov/fhir/ValueSet/{oid}</code></p>",
        "id": 207481818,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597888716
    },
    {
        "content": "<p>I'm going to use my proposed canonical URL for now, but it would be good to align with PHINVads earlier rather than later if it turns out that this needs to change. I guess this is a formal request of HTA? (I don't know; we haven't talked about HTA in terms of external value sets instead of code systems)</p>",
        "id": 207481837,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597888794
    },
    {
        "content": "<p>I don't know if anyone knows whether we can download all value sets from phinvads somewhere? All I can find is individual value set downloads.</p>",
        "id": 207481940,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597888876
    },
    {
        "content": "<p>Could try: <a href=\"https://phinvads.cdc.gov/vads/BrowseValueSets_browse.action\">https://phinvads.cdc.gov/vads/BrowseValueSets_browse.action</a>, then \"Download All\"?</p>",
        "id": 207482329,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1597889445
    },
    {
        "content": "<p>magic. is there an equivalent for code systems?</p>",
        "id": 207482509,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597889703
    },
    {
        "content": "<p>Can't find anything, no.</p>",
        "id": 207483212,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1597890649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Given that PHINVADS has lots of code systems, SCT and LOINC included, you'll not have anything similar to what Sarah found. While they officially say the <a href=\"https://www.cdc.gov/phin/resources/vocabulary/index.html\">CDC only creates a few code systems</a>, they in fact are responsible for a few others. For example, there is a code system PHIN uses when it makes up new concepts it needs in \"random spots.\" That is called <a href=\"https://phinvads.cdc.gov/vads/ViewCodeSystem.action?id=2.16.840.1.114222.4.5.274\">PHIN VS (CDC Local Coding System)</a> but I don't see a way to get all the concepts. They also note <a href=\"https://phinvads.cdc.gov/vads/downloads/CodeSystem_UpdateCalendar.pdf\">here</a> some others that I think they also make up, like <a href=\"https://phinvads.cdc.gov/vads/downloads/CodeSystem_UpdateCalendar.pdf\">Lab Test(PHLIP)</a>. If we need all of these, we should use HTA to help sort this all out. I'll also note that only a few PHIN code systems seem to have a canonical url determined and I think there are some duplicates. <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> has HTA linked up with CDC/PHINVADS at all? Note that Graham also wants to get canonical urls for value sets and it seems HTA should help with that too.</p>",
        "id": 207543986,
        "sender_full_name": "Robert McClure",
        "timestamp": 1597941307
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span> I agree with Rob, we should engage CDC in the codesystem conversation and then include value sets. I'm ok with proposing Grahame's canonical as a starting point if they don't already have one in mind.</p>",
        "id": 207553488,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1597946126
    },
    {
        "content": "<p>well we already have IGs using PHINVads value sets that depend on code systems whose OIDs I have not tracked down outside PHINVads. Presumably these are those internal code systems. Can HTA please work with the CDC to clarify this. </p>\n<p>Here's what I'm planning to do right now: I've written a converter that takes the full download from PHINVads and bulk converts the text files (what a format mess they are) to FHIR value sets, and then I'm releasing them in a FHIR Package with the name 'us.cdc.phinvads', so that people can use them from their IGs. I don't think there's a better to do that unless CDC do some development on their side</p>",
        "id": 207572482,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597956366
    },
    {
        "content": "<p>hmm minor but very important correction: the canonical URL should be <code>http://phinvads.cdc.gov/fhir/ValueSet/{oid}</code>, not <code>https://phinvads.cdc.gov/fhir/ValueSet/{oid}</code></p>",
        "id": 207695854,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598052723
    },
    {
        "content": "<p>ok, phinvads produces some text value sets that are full of random crap. it's weird. but all other value sets are now usable in implementation guides</p>",
        "id": 207695876,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598052752
    },
    {
        "content": "<p>see <a href=\"#narrow/stream/179252-IG-creation/topic/Referencing.20PHINVads.20Value.20sets\">https://chat.fhir.org/#narrow/stream/179252-IG-creation/topic/Referencing.20PHINVads.20Value.20sets</a> for details</p>",
        "id": 207695933,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598052821
    },
    {
        "content": "<p>this does mean that we will now have a series of issues around code system identity.</p>",
        "id": 207695942,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598052838
    },
    {
        "content": "<p>the way the importer works is that it loads core FHIR + UTG resources, and looks through them trying to translate phinvads OIDs to FHIR code system URLs. If it doesn't find any matching OIDs, it just uses the generated canonical URL urn:oid:{oid} but this generally means that the code system is not known to the FHIR eco-system, and I expect we'll have a run of either finding  the code system or adding the OID to UTG. Note that quite a few US FHIR IGs are making extensive use of PHINVads</p>",
        "id": 207696040,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598052936
    },
    {
        "content": "<p>for now, the us.cdc.phinvads package is generated manually but we can address that if we need to</p>",
        "id": 207696110,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598052993
    },
    {
        "content": "<p>Why <code>http</code> and not <code>https</code>, especially when there's such a push to treat these as URLs ?</p>",
        "id": 207806092,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1598242697
    },
    {
        "content": "<p>because eventually, https will go away. And because as much as possible, we use http: in canonical URLs everywhere we can</p>",
        "id": 207812291,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598252194
    }
]