[
    {
        "content": "<p>We’ve come across an implementation scenario where a coded element at the point of data capture is drawn from a value set with extensible binding and:</p>\n<ol>\n<li>Not all codes from the specified value set are presented to the user; and</li>\n<li>An additional local code with the description of “other” is also presented, and not part of the value set (technically allowed because the value set is extensible…)</li>\n</ol>\n<p>The question here is how to we preserve the meaning of that context-dependent “other” option in a corresponding FHIR resource without making any changes to the way the data is currently captured (non-negotiable from the clinical side)?<br>\n<span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span>  and I have been scratching our heads and the only (and clearly clumsy) solution we have found to this issue is to provide guidance to implementers to fully expand the implicit negative space as a pseudo-code in CodeableConcept.text as “NOT(A or B or C)”, where A, B and C are the codes from the value set that are surfaced in the UI.</p>\n<p>The use of “other” options is very common in questionnaires, and it’s bound to come up again, yet I’ve been unable to find any discussions and/or guidance on this topic. Any and all ideas welcome!</p>",
        "id": 177182292,
        "sender_full_name": "Rute Martins",
        "timestamp": 1570043488
    },
    {
        "content": "<p>It's very difficult to define what set of codes a user \"considered\", especially if the UI requires them to type search criteria to find the code they eventually select.  In theory, the system could create (and transmit) a value set of all the codes the user was exposed to (and the display terms used) at the time they made their decision.  In practice, good luck getting a client application to do that...  The most common practice is to maintain traceability that a particular result came from a given questionnaire.  That lets you go back and see exactly what options were presented and even how the question was phrased.</p>",
        "id": 177182608,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570043739
    },
    {
        "content": "<p>Agreed. I should add that this particular application is not a questionnaire, but that the options presented can (and will likely) change in the future. There's not a robust version tracking mechanism we could use to keep that traceability. But even if there was, we would still be highly dependent on knowing which questionnaire and what version (it may not be publicly available). What then?</p>",
        "id": 177183238,
        "sender_full_name": "Rute Martins",
        "timestamp": 1570044129
    },
    {
        "content": "<p>if you really don't have good control over the versioning of the context where the question was asked, then you can use the value set extension: <a href=\"http://hl7.org/fhir/r4/extension-valueset-reference.html\" target=\"_blank\" title=\"http://hl7.org/fhir/r4/extension-valueset-reference.html\">http://hl7.org/fhir/r4/extension-valueset-reference.html</a></p>",
        "id": 177183356,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570044234
    },
    {
        "content": "<p>but: even then the potential list of other codes doesn't really provide you with that much information. you know what the user could have chosen, but not why they didn't choose them</p>",
        "id": 177183448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570044295
    },
    {
        "content": "<p>We're on DSTU2, sadly.</p>",
        "id": 177184719,
        "sender_full_name": "Rute Martins",
        "timestamp": 1570045222
    },
    {
        "content": "<p>Nothing stops you from pre-adopting the extension in DSTU2</p>",
        "id": 177184768,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570045281
    },
    {
        "content": "<p>that one was defined back in R2</p>",
        "id": 177186602,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570046463
    },
    {
        "content": "<p>How important is the interpretation of the \"Other\" case?  i.e., is it really the case that you need to interpret it as \"not X and not Y and not Z and ...\"?  Or is it more sensibly interpreted as \"Unspecified\"?</p>",
        "id": 177284955,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1570134476
    },
    {
        "content": "<p>What about DAR?</p>",
        "id": 177354601,
        "sender_full_name": "Eric Haas",
        "timestamp": 1570205860
    },
    {
        "content": "<p>DAR?</p>",
        "id": 177726976,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1570635878
    },
    {
        "content": "<p>presumably <a href=\"https://www.hl7.org/fhir/extension-data-absent-reason.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/extension-data-absent-reason.html\">https://www.hl7.org/fhir/extension-data-absent-reason.html</a></p>",
        "id": 177736002,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1570641672
    }
]