[
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-14963\">FHIR#14963</a> Seeks to create a new ValueSet/CodeSystem bound to a CodeableConcept containing FHIR terminology, hence no SNOMED or other international system.  Does that go through UTG or just in the FHIR space? (cc <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>)</p>",
        "id": 240171691,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1621941205
    },
    {
        "content": "<p>For low-maturity resources, new code systems can (and typically should) temporarily live in FHIR space because \"good practice\" terminology rules don't apply - you can rename codes, change hierarchies, completely rewrite definitions with impunity and no need to deprecate codes.  For FMM3+, unless it's a 'code' element, you're supposed to move to an external terminology (e.g. SNOMED, LOINC, <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>, etc.) unless you can convince the FMG there's a good reason to have the terminology <em>only</em> live in the FHIR space (typically because it would have zero relevance elsewhere).</p>",
        "id": 240180362,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621946450
    },
    {
        "content": "<p>Thanks Lloyd. We got Grahame in this PA session. As this is also example binding and FHIR terminology, the verdict is that we don't go through UTG for that.</p>",
        "id": 240180733,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1621946628
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> can you advise what process PA would need to go through to get this specific change applied (who do we pass it to)?<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-14341\">https://jira.hl7.org/browse/FHIR-14341</a></p>",
        "id": 240417989,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1622087537
    },
    {
        "content": "<p>You'd need to submit a proposal through the UTG Jira project.</p>",
        "id": 240439910,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622107661
    },
    {
        "content": "<p>I don't know what that proposes to change. I don't know which code system it's talking about, and I don't know whether it's proposing to replace a code or a disaply</p>",
        "id": 240441050,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622108351
    },
    {
        "content": "<p>no, I figured it out a little but it's still unclear. It proposing to change the existing display to what it already is?</p>",
        "id": 240441390,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622108559
    }
]