[
    {
        "content": "<p>We would like to get implementer community input on <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14710\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14710\">GF#14710</a> regarding tightening the cardinality of ConceptMap source[x] and target[x] to 1..1, and whether there are use cases that have been identified that would support leaving one or both of them as optional at 0..1.  Would welcome input from <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> and other implementers and potential users of ConceptMap.</p>",
        "id": 153942867,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520450027
    },
    {
        "content": "<p>What would be the values to use when mapping to/from implicit codesystems (<a href=\"http://build.fhir.org/conceptmap.html#implicit\" target=\"_blank\" title=\"http://build.fhir.org/conceptmap.html#implicit\">http://build.fhir.org/conceptmap.html#implicit</a>) such as elements in a StructureDefinition or a MedicationResource?</p>",
        "id": 153942899,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1520464004
    },
    {
        "content": "<p>That's a reasonable question.  In that section we describe using the canonical URLs StructureDefinition.url and Questionnaire.url and also [base]/Medication as the 'system' (which presumably means to be used for group.source and group.target, as they are intended to refer to code systems).  But prior to that in the Scope and Usage section we say: \"Mappings between code systems are only defined in the context of the specified source and destination <strong>value sets</strong> ...\".  That's not consistent guidance.  And I don't think our examples are entirely consistent, either.  In the SNOMED CT / ICD-10 mapping example (103) we have the url <a href=\"http://hl7.org/fhir/sid/icd-10-us\" target=\"_blank\" title=\"http://hl7.org/fhir/sid/icd-10-us\">http://hl7.org/fhir/sid/icd-10-us</a> being used for <strong>both</strong> targetCanonical, which is intended to reference a value set <strong>and</strong> for group.target which references a code system.  In the Using ICD-[X] Codes with FHIR page that url is specified as representing the code system.  Again in ConceptMap Scope and Usage we say: \"Note that all code systems have value sets that include the entire code system, and these value sets can be used for mappings that are valid in all contexts\".  For FHIR code systems we do designate the \"all codes\" value sets for each code system, which have different urls, but we haven't made that explicit (as far as I'm aware) for many of the external code systems such as ICD-10.  Again, it doesn't seem like we're being consistent here.  I wonder if it would be best to simplify this by removing source[x] and target[x] entirely and only specify group.source and group.target and allow those to be a reference to either a value set or a 'system' (code system or otherwise)?</p>",
        "id": 153942911,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520466735
    },
    {
        "content": "<p>ConceptMap.Group currently has a cardinality of 0..*, so that would also need 'tightening' if we are to dispense with source[x] and target[x]. Removing them would also represent a major breaking change and it might be hard to promote the maturity of this resource beyond it's current level of 3 if we made such a change. For example , lots of implementations and test scripts would need to change.</p>",
        "id": 153942950,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1520489978
    },
    {
        "content": "<p>I don't understand this proposal. the value set and code system references have quite different purposes.</p>",
        "id": 153942951,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520493693
    },
    {
        "content": "<p>and i think the guidance is quite right - the context can be associated with a value set, but the mappings are between codes in code systems</p>",
        "id": 153942952,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520493746
    },
    {
        "content": "<p>from concept map 103:</p>\n<div class=\"codehilite\"><pre><span></span>    &lt;sourceCanonical value=&quot;http://snomed.info/id?fhir_vs&quot;/&gt;\n    &lt;targetCanonical value=&quot;http://hl7.org/fhir/sid/icd-10-us&quot;/&gt;\n</pre></div>",
        "id": 153942953,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520493819
    },
    {
        "content": "<p>the first is a value set. the second is a code system, and needs correcting.</p>",
        "id": 153942954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520493838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I agree that our intent probably is reasonable and the general guidance is correct.  I'm not really comfortable myself with tightening the cardinalities.  So if we fix some of the issues that I raised earlier, I would be happy with that.   For example 103, I don't know that we have a url available for an \"all codes\" value set for ICD-10-US.  Do we?  For the ones that FHIR has defined (like this one), presumably we should have a rule that we can use for constructing the \"all codes\" value set references.</p>",
        "id": 153943011,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520522975
    },
    {
        "content": "<p>Hi - we just implemented ConceptMap and so far I don't see a use case for leaving either ConceptMap.source[x] or .target[x] blank. I could see a use case where both ConceptMap.source[x] and ConceptMap.target[x] are populated and both ConceptMap.group.source and ConceptMap.group.target are blank. My interpretation of this scenario would mean that when the .source[x] and .target[x] valuesets are expanded all the codes should only belong to one code system. group.source and group.target could then be implied based on those.</p>\n<p>Of course, when either .source[x] or .target[x] are expanded and they contain codes from multiple codesystems (because ValueSets can .compose.include other valuesets), then group.source and group.target become mandatory (in my opinion).</p>",
        "id": 153943052,
        "sender_full_name": "Michael Calderero",
        "timestamp": 1520527733
    },
    {
        "content": "<p>Thanks for the input, Michael.  That's very helpful.  From what you said, I'm presuming that you probably didn't deal with the aspects described in 4.9.7 Implicit Code Systems in your implementation?</p>",
        "id": 153943058,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520528085
    },
    {
        "content": "<p>I admit we didn't look at that part and didn't consider it. How's a ConceptMap for those supposed to look like?</p>",
        "id": 153943068,
        "sender_full_name": "Michael Calderero",
        "timestamp": 1520529440
    },
    {
        "content": "<p>We don't have examples in the spec for those so far, and we will need to create them.  If anyone already does have some examples using the implicit constructs that they can provide (<span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, others?), that would be helpful.</p>",
        "id": 153943071,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520529834
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/terminology-service.html#4.6.5\" target=\"_blank\" title=\"http://build.fhir.org/terminology-service.html#4.6.5\">http://build.fhir.org/terminology-service.html#4.6.5</a> last paragraph says:</p>\n<blockquote>\n<p>Every code system has an implicit value set that is \"all the concepts defined in the code system\" (CodeSystem.valueSet)...Clients can refer to these implicit value sets by providing the URI for the code system itself.</p>\n</blockquote>\n<p>So can we use this to assert that every code system (including implicit code systems) has an implicit valueset, and we can refer to the implicit code system's valueset by providing the URI for the implicit code system itself? This seems to fall apart when Medication resources are factored in however...</p>",
        "id": 153943087,
        "sender_full_name": "Michael Calderero",
        "timestamp": 1520530792
    },
    {
        "content": "<p>...or probably not if we use [baseurl]/Medication in source[x] and/or target[x]...</p>",
        "id": 153943088,
        "sender_full_name": "Michael Calderero",
        "timestamp": 1520530932
    },
    {
        "content": "<p>Good reminder that we did say that on the Terminology Service page.  That's probably the simplest way to make it work, but if we're going to rely on it being available it probably shouldn't only be documented on the Terminology Service page.  For many, but definitely not all, code systems we have a separate and distinct url for the \"all codes\" value set.  So, in those cases, would we consider it to be correct to <strong>either</strong> use the specific \"all codes\" url <strong>or</strong> the code system url and  and consider them both as legitimate references for the \"all codes\" value set and handle them in the same way?</p>",
        "id": 153943123,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520541233
    },
    {
        "content": "<p>we haven't defined an all codes value set for ICD-10 - presumably that's why the example doesn't use it. I don't think we should allow the code system URI as a proxy for the value set. We haven't done that anywhere else</p>",
        "id": 153943229,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520599828
    },
    {
        "content": "<p>Tracker 12314 was entered in October 2016 to loosen the cardinality.</p>",
        "id": 153943544,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1520627943
    },
    {
        "content": "<p>Good pickup, Carmela.  I remember it now, but until seeing this I had totally forgotten that we had made a change to relax those cardinalities due to the $closure considerations.  That's certainly a valid use case for it, at least the way that $closure is architected now.  But possibly we could reinstate the requirements for the cases that aren't involving initiation of a closure table, using an invariant?  Or, at the very least we could document that this is the reason for the relaxed cardinality, so that we don't have to re-investigate this when the question comes up again at some time in the future.</p>",
        "id": 153943556,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1520630812
    },
    {
        "content": "<p>document for now</p>",
        "id": 153943569,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520638457
    }
]