[
    {
        "content": "<p>According to the standard, filter in expansion is \"A text filter that is applied to restrict the codes that are returned (this is useful in a UI context). The interpretation of this is delegated to the server in order to allow to determine the most optimal search approach for the context\".</p>",
        "id": 153923942,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1512851227
    },
    {
        "content": "<p>So the server can design some customized expression in filters to support special expansion request. For example,  I can design my server to support \"filter=http://snomed.info/sct\" for expansion on SCT code only.</p>",
        "id": 153923943,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1512851514
    },
    {
        "content": "<p>Is my understanding correct?</p>",
        "id": 153923944,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1512851522
    },
    {
        "content": "<p>As a text filter on the $expand operation is performed on a Value Set, that usage would only make sense if a Value Set contains concepts from more than one code system. A more typical usage of that filter, particularly when related to UI interactions, is to return concepts based on matching descriptions.</p>",
        "id": 153923946,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1512852612
    },
    {
        "content": "<p>Definitely. I am just wondering if a server developer can push the usage of filter beyond description matching. The target value set has codes from multiple code system. I used to use includedCodeSystem in ExpansionFilter to expand on certain code system. Since that property is removed, I have to find some other ways to do the same. Other than introduce an extension, I think I can (and I should) use filter parameter since this is a server interpretation of optimal search approach.</p>",
        "id": 153923951,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1512853188
    },
    {
        "content": "<p>As an alternative, you might design your server to use the context input parameter (uri) for this use case. Not it's stated purpose in the spec, but possibly a better fit than the text filter property?</p>",
        "id": 153923985,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1512871607
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>: \" I used to use includedCodeSystem in ExpansionFilter to expand on certain code system\" -  why not us the value set machinery, since that's what it's supposed to do</p>",
        "id": 153923986,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512872316
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> what is \"value set machinery\"?</p>",
        "id": 153923992,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1512876091
    },
    {
        "content": "<p>define a value set on the code system, then expand it... what do you need profile for?</p>",
        "id": 153924002,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512886450
    },
    {
        "content": "<p>I have a value set definition which need to expand to two different code systems. Each expansion contains codes from one code system. In another works there are two different expansions from the same definition. Is this one value set or two value sets?</p>",
        "id": 153924092,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1512931960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> I think context is a better choice than filter</p>",
        "id": 153924093,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1512931992
    },
    {
        "content": "<p>I don't understand ' value set definition which need to expand to two different code systems' - what's the definition?</p>",
        "id": 153924115,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512934477
    },
    {
        "content": "<p>I think the way you would do this is using ExpansionProfile.excludedSystem.  Maybe what you are wanting is more like \"includedSystem\", which we don't have, but in any reasonable real-world case I expect that excludedSystem should be workable for what you need.  The alternative, which I think Grahame is suggesting, and you may have alluded to, would be to create separate value sets that are defined specifically to include the codes from the particular code system that you need in each case.</p>",
        "id": 153924122,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1512937352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> are you able to share the value set definition?  I think it would help us to provide better guidance.<br>\nUsing the filter parameter the way you're describing seems unnecessary</p>",
        "id": 153924400,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1513046328
    }
]