[
    {
        "content": "<p>I would like some guidance on changing the canonical URI used as the system for a codeSystem.</p>",
        "id": 243417027,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624297285
    },
    {
        "content": "<p>Long ago in FHIR core we guessed at what the system value would be for the IHE managed codes for format code. Today the system value IHE is using is different. This difference is driven by IT facts-of-life, and norms driven by the IG Publisher tooling.  It is not clear to me that this difference is overall a problem. What is the toolbox of things I can used to make this less painful?</p>",
        "id": 243417756,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624297631
    },
    {
        "content": "<p>so, FHIR core thinks the system canonical URI should be</p>\n<blockquote>\n<div class=\"codehilite\"><pre><span></span><code>        &lt;system value=&quot;http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem&quot;/&gt;\n</code></pre></div>\n\n</blockquote>",
        "id": 243417837,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624297679
    },
    {
        "content": "<p>I can't go forward with that... because it is odd to have a canonical URI that lists both ValueSet in the URL, and codesystem in the id.... the root <a href=\"http://ihe.net\">ihe.net</a> is also not where these will go.</p>",
        "id": 243417987,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624297750
    },
    {
        "content": "<p>so IHE is currently putting this codeSystem at</p>\n<blockquote>\n<p><a href=\"http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode\">http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode</a></p>\n</blockquote>",
        "id": 243418216,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624297845
    },
    {
        "content": "<p>there is a http redirect from that FHIR core canonical URI to the IHE managed canonical URI</p>",
        "id": 243418347,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624297900
    },
    {
        "content": "<p>I say \"can't go forward\"... but realistically, i can.. which is part of the question to the terminology group</p>",
        "id": 243418718,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624298042
    },
    {
        "content": "<p>The other question is use of the .identifier with an OID system... should this OID be usable in FHIR?</p>",
        "id": 243418846,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624298080
    },
    {
        "content": "<p>meaning... far longer ago, this set of code system has been given the OID <code>1.3.6.1.4.1.19376.1.2.3</code>  which is what is used in all other standards where these codes are used (XDS, HL7 v3, CDA, DICOM, etc).</p>",
        "id": 243419135,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624298191
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> The initial short answer is one you'll not be surpriosed to here, even with you being the main IHE expert on all this: HTA is responsible for sorting out issues with external code systems. <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> . That said, what needs to be assertained when consiudering a canonical uri/l change is essentially how extensively (and how long) is the FHIR-published url  in use? If it's not used by any guides other than yours and you can confirm, with your user base, that making a change is acceptable, then I'd say it can be considered. The fact that it is in FHIR core I don't believe means this is not possible, although the change process would be technically different. And of course, it only changes going forward. This also means we need to keep track of the different identifiers and the current, not confirmed, thinkking is for a code system we might not use nameingsystem, but instead track all that directly in the code system resource (stub or fragment, or complete -= IE: whatever we have here.) We've not settled on all this yet but I think we just use the Identifer datatype to do this.</p>\n<p>As for using an OID: Yes we can include an OID as a business <a href=\"http://build.fhir.org/codesystem-definitions.html#CodeSystem.identifier\">identifier</a> for the code system. But FHIR servers all <em>use</em> the url as the identifier; use of the other identifiers I suspect is hit-and-miss depending on server functionality.</p>",
        "id": 243566567,
        "sender_full_name": "Robert McClure",
        "timestamp": 1624389868
    },
    {
        "content": "<p>I am not sure how far the canonical URI has been used. learning all the IGs that are profiling something is not easy, knowing to what extent that IG is implemented is even harder.</p>",
        "id": 243568555,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624390766
    },
    {
        "content": "<p>I know the OID is far more used. for 15ish years worth of use.</p>",
        "id": 243568618,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624390798
    },
    {
        "content": "<p>the OID is, and always has been, inside the FHIR CodeSystem as the .identifier.</p>",
        "id": 243568709,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624390825
    },
    {
        "content": "<p>but, as you point out. Use of business identifier for a codeSystem as the system value is not well supported. Specifically not supported by the FHIR validator.</p>",
        "id": 243568795,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624390863
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ? can you give me some guidance on the above situation/questions?</p>",
        "id": 243568894,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624390917
    },
    {
        "content": "<p>I am looking for some advice from terminology experts --- should I keep using the original canonical URI even though it is constructed strangely (meaning it has \"ValueSet\" in the URI for a CodeSystem)?</p>\n<blockquote>\n<p><a href=\"http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem\">http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem</a><br>\nIt is just a canonical URI, so is the format that important?<br>\nWhile FHIR aware architects will look at it and be confused, as it sure looks like it is defining a ValueSet?<br>\nYet, this might be the one more in use today?<br>\nIs correcting the canonical URI to be better FHIR formatted be the right thing to do today?<br>\nIs there another solution? <br>\n<span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <span class=\"user-mention silent\" data-user-id=\"191503\">Robert McClure</span> <span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <span class=\"user-mention silent\" data-user-id=\"191982\">Ted Klein</span></p>\n</blockquote>",
        "id": 243785442,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624541406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Some questions to get this closed:</p>\n<ul>\n<li>Can you be the official contact for IHE so if we determine the best approach for the canonical url, it will be acceptable to IHE (and best they will independently promote it?)</li>\n<li>Of all the not great urls, I agree that one is very confusing and should be changed if possible.</li>\n<li>I very much want FHIR to agree that we use the code system resource as I noted above to manage <strong>all</strong> identifiers for a code system (IE: not use nameingsystem for this) and we would mark that identifier as use = Old\"</li>\n</ul>",
        "id": 243794681,
        "sender_full_name": "Robert McClure",
        "timestamp": 1624545106
    },
    {
        "content": "<p>Yes I am</p>",
        "id": 243794767,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624545132
    },
    {
        "content": "<p>I am unfamiliar with namingsystem (hence why I ask experts)</p>",
        "id": 243794922,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624545205
    },
    {
        "content": "<p>to be clear... I am asking onbehalf of IHE.. I am the owner of this codesystem in IHE. I am looking to have IHE do this the best way possible.</p>",
        "id": 243795140,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624545312
    },
    {
        "content": "<p>Looking at NamingSystem -- is this something that would be used if we change URI? IHE or HL7 would publish that explains the transition away from the old URI to the new URI? It could also include the stable OID that is not in question, right?</p>",
        "id": 243796433,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624545860
    },
    {
        "content": "<blockquote>\n<p><a href=\"http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem\">http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem</a></p>\n</blockquote>\n<p>so I have no idea what brain fart led to this being the code system.</p>",
        "id": 243826274,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624558987
    },
    {
        "content": "<p>I don't see how the code system would be meaningfully used outside the context of IHE so I don't see why HL7 shouldn't change it if IHE asks</p>",
        "id": 243826530,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624559105
    },
    {
        "content": "<blockquote>\n<p>Use of business identifier for a codeSystem as the system value is not well supported. Specifically not supported by the FHIR validator.</p>\n</blockquote>\n<p>Well, it's not conformant - that's quite clear. You can make the OID the canonical URL, in which case it's not supported, it's required to be used. but the canonical URL must be used</p>",
        "id": 243826716,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624559177
    },
    {
        "content": "<p>It's probably best to reach out to the implementer community by whatever means we have to see if the 'bad' URL is already in use - probably by posting on <a class=\"stream\" data-stream-id=\"179240\" href=\"/#narrow/stream/179240-Announcements\">#Announcements</a> (with discussion directed elsewhere).  Any other places that seem likely to reach potential implementers would also be wise.  If we get no indications of use in the HL7 community, the URL looks obviously broken and IHE has clear recommendations to use something else, I think that gives us enough cover to make the change - though we should certainly list the other as a non-preferred alternate in the NamingSystem.</p>",
        "id": 243843408,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624567239
    },
    {
        "content": "<p>The majority of implementers are using the OID (XDS/XCA..). In the FHIR space there is likely lots of ONE specific code (C-CDA) being used.  I suspect that even in FHIR (DocumentReference) many are using the OID. So, if there is good reason to change, I think change is good. I just saw the difference and was not sure that difference was critical enough when a canonical URI is just a canonical URI. It has a relationship to a Reference, but is defined differently.</p>",
        "id": 243905633,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624622231
    },
    {
        "content": "<p>most will just look for the code and ignore the system.</p>",
        "id": 243905891,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624622401
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> can you send the announcement outreach? It is far more likely to get a response if one of you send it, then if I send it.</p>",
        "id": 243906137,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624622527
    },
    {
        "content": "<p>Can you share the text you'd like posted (maybe by PM)</p>",
        "id": 243914349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624627256
    },
    {
        "content": "<p>FYI <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> <span class=\"user-mention\" data-user-id=\"340004\">@Davera Gabriel</span> <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span>  Please add this External code system snafu to the list of HTA items and listings. I suspect this will be a changed canonical</p>",
        "id": 243923364,
        "sender_full_name": "Robert McClure",
        "timestamp": 1624631394
    },
    {
        "content": "<p>My personal opinion here is that the case for change is pretty weak, and the cost of change is always higher than you think (while a community may agree to the change, there will likely be data floating around for years that uses the old URI and thus any future code that touches that data will pay a cost).<br>\nAlso, the fact that you've got 'codesystem' in the URI, despite the 'ValueSet' part, should be enough for anyone who's looking and concerned to work things out, especially if the URI also resolves to something human-oriented that explains the situation.</p>",
        "id": 244088813,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1624833771
    },
    {
        "content": "<p>it's true that the cost of change is hard to measure. But it's for IHE to decide in this case, and let us know what they decide. If people complain, we're just going to refer them to IHE</p>",
        "id": 244123613,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624874596
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> it is not just for IHE to decide. This codesystem  URI was baked into the FHIR core long before IHE started to manage it in FHIR format. Prior to this IHE managed it with an OID.    I am not too worried about IHE, most use is as facade to XDS. There is a little MHDS experimentation, mostly in LMIC. I am more worried about the non-IHE uses driven by things like us-core and all the other XXX-core. I have no visibility into any of these XXX-cores (including us-core).</p>",
        "id": 244133901,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624881749
    },
    {
        "content": "<p>well, that means it's not just for IHE to execute, but ok, makes sense to decide to callboratively</p>",
        "id": 244138724,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624884412
    },
    {
        "content": "<p>We will put this on the HTA agenda for 7th July.  If IHE is the code system owner, it would be most helpful if an IHE representative could be present; I will presume that is you <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?  Even though it's coming very late to the party, this external code system should go through the proper code system identification and metadata process :)</p>",
        "id": 244156110,
        "sender_full_name": "Julie James",
        "timestamp": 1624891748
    },
    {
        "content": "<p>Yes. I have tried many many times.</p>",
        "id": 244223737,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624930097
    }
]