[
    {
        "content": "<p>Dear FHIR terminology community - <br>\nI am seeking guidance on the recommended value set to be used with the \"Procedure\" Resource (Procedure.code) in the case of a billable diagnostic test. <br>\nThe inquiry comes in the context of our work under Patient Care compiling an ophthalmology IG, and based on the following uncertainty:</p>\n<ul>\n<li>The value set defined for this purpose by the FHIR project is SNOMED-CT (<a href=\"http://hl7.org/fhir/ValueSet/procedure-code\">http://hl7.org/fhir/ValueSet/procedure-code</a>)</li>\n<li>However, diagnostic tests are billable and will therefore often be captured in an EHR by the relevant billable code (eg CPT)</li>\n</ul>\n<p>One specific example is performing an optical coherence tomography (OCT) scan of the retina, which a very commonly performed diagnostic test in the ophthalmology clinic. Multiple code systems could be utilised with equal relevance: <br>\ni) Billing code: this is reimbursed by CPT code 92134 (in the US) or MBS code 11219 (in Australia)..... <br>\nii) SNOMED CT:<br>\nCode    700070005<br>\nFully specified name    Optical coherence tomography of retina (procedure)<br>\niii) LOINC code - LP97035-7   OCT</p>\n<p>Any suggestions for how to provide the optimal implementable guidance for our IG and the developer community would be much appreciated.</p>\n<p>Thanks in advance,<br>\nAsh</p>\n<p><span class=\"user-mention\" data-user-id=\"196943\">@Warren Oliver</span> <br>\n<span class=\"user-mention\" data-user-id=\"192135\">@Stephen Chu</span> <br>\n<span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> <br>\n<span class=\"user-mention\" data-user-id=\"197598\">@Régis Deshayes</span> <br>\n<span class=\"user-mention\" data-user-id=\"197102\">@Alexander Gogol</span></p>",
        "id": 236102448,
        "sender_full_name": "Ashley Kras",
        "timestamp": 1619393876
    },
    {
        "content": "<p>Have you looked at the US Core profile for Procedure?</p>",
        "id": 236112754,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619404687
    },
    {
        "content": "<p><a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-procedure.html\">https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-procedure.html</a></p>",
        "id": 236112768,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619404713
    },
    {
        "content": "<p>Is this a clinical record or an administrative record of the procedure?</p>",
        "id": 236116689,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1619409313
    },
    {
        "content": "<p>Very much appreciate your assistance and quick response <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ! <br>\nAs a quick follow up, which relates to <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> 's question - <br>\nThis information may be captured in either admin or clinic contexts and hence may reference either/any of the above code systems (and its not necessarily the case that 'clinically' captured data would not natively map to a billing code, or visa versa)...<br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - is there somewhere you could point to an example of how we would optimally enable/accommodate exchange of either/both code systems? Thanks in advance!</p>",
        "id": 236156065,
        "sender_full_name": "Ashley Kras",
        "timestamp": 1619436012
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"262202\">@Ashley Kras</span> Since this is for a diagnostic test, the guidance in Boundaries and Relationships for Procedure is relevant:</p>\n<blockquote>\n<p>Note that many diagnostic processes are procedures that generate Observations and DiagnosticReports. In many cases, such an observation does not require an explicit representation of the procedure used to create the observation, but where there are details of interest about how the diagnostic procedure was performed, the Procedure resource is used to describe the activity.</p>\n<p>Some diagnostic procedures might not have a Procedure record. The Procedure record is only necessary when there is a need to capture information about the physical intervention that was performed to capture the diagnostic information (e.g. anesthetic, incision, scope size, etc.)</p>\n</blockquote>\n<p>So you can use the Procedure resource if you need it, but you may not actually need it for a diagnostic test.  Instead, it might be appropriate and sufficient to use DiagnosticReport and associated Observations for the results (and ServiceRequest for the order).</p>",
        "id": 236166788,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1619441198
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - appreciate the info - have used DiagnosticReport as well in exactly the way &amp; context you describe; there are other situations where it makes more sense to reference the diagnostic test as a standalone, which is where the Procedure Resource has come into it</p>",
        "id": 236179279,
        "sender_full_name": "Ashley Kras",
        "timestamp": 1619445882
    },
    {
        "content": "<p>Observation.code and Procedure.code are CodeableConcepts - send as many Codings as you need within that, each reflecting an encoding of the concept in the code system you wish.</p>",
        "id": 236217275,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619459977
    }
]