[
    {
        "content": "<p>STU3's PlanDefinition resource defines \"type\" as type Coding with a required PlanActionType value set.   The plandefinition-exclusive-breastfeeding-intervention-01 (through -04) examples do not include the system URI . Example <br>\n    {<br>\n          \"title\": \"Notify the provider to sign the order.\",<br>\n          \"textEquivalent\": \"A Breastfeeding Readiness Assessment is recommended, please authorize or reject the order.\",<br>\n          \"type\": {<br>\n                \"code\": \"create\"<br>\n          },<br>\n                ...</p>\n<p>Is this valid?  Do we know whether \"create\" came from the  <a href=\"http://hl7.org/fhir/ValueSet/action-type\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/action-type\">http://hl7.org/fhir/ValueSet/action-type</a> value set or somewhere else?</p>",
        "id": 153856884,
        "sender_full_name": "Harold Solbrig",
        "timestamp": 1479162844
    },
    {
        "content": "<p>It is indeed legal for Codings to not specify a system.  They're only partially computable, but that may meet some use-cases.  That said, the choice of Coding as a data type is odd.  I would expect translations to be possible, thus necessitating CodeableConcept.  Thoughts <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 153856888,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479165911
    },
    {
        "content": "<p>The binding is actually supposed to be extensible there (it is in RequestGroup.action.type). As far as why Coding instead of CodeableConcept, it seemed unnecessary to go with a full coding, when all I need is an extensible list of types.</p>",
        "id": 153856996,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1479234584
    },
    {
        "content": "<p>So the STU3 \"Required\" is an error?</p>",
        "id": 153856999,
        "sender_full_name": "Harold Solbrig",
        "timestamp": 1479235210
    },
    {
        "content": "<p>Yes, otherwise it could just be a code. Only reason for it to be a Coding is to support the extensible binding.</p>",
        "id": 153857000,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1479235275
    },
    {
        "content": "<p>If it's extensible and different systems could choose different extensions, then you'll invariably end up with multiple ways to say the same thing and thus a need for translations.  We only use Coding instead of CodeableConcept where the notion of translations makes no sense.</p>",
        "id": 153857007,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479235865
    }
]