[
    {
        "content": "<p>Based on a discussion during the Connectathon, I'll start a thread here for discussion.  Topic is: What use cases exist for a FHIR server applying terminology based mutations to resources?</p>\n<p>Examples:</p>\n<ul>\n<li>Client requests the FHIR server apply mappings from a proprietary code system to LOINC when returning lab Observations.  Assume deterministic concept mappings exist between the proprietary system and LOINC. The server returns Observations with an additional code.coding for the LOINC equivalent concept.</li>\n<li>Client provides a ValueSet of SNOMED-CT concepts and asks that all Observations include codings from this set in the code.coding list so that a client could easily group observations for aggregation/trending.  For example, the set may include a number of Body Structures, and observations coded with more granular concepts would retain those original codes AND including the more general codes from the set as appropriate.</li>\n</ul>",
        "id": 153905361,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1504983887
    },
    {
        "content": "<p>lots of use cases like that</p>",
        "id": 153905363,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504983977
    },
    {
        "content": "<p>Sure. No operations as of yet. Step 1 in creating them is collecting use cases, yes?</p>",
        "id": 153905365,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1504984053
    },
    {
        "content": "<p>sure</p>",
        "id": 153905374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504984356
    },
    {
        "content": "<p>Sounds like you have some in mind? ;)</p>",
        "id": 153905383,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1504984700
    },
    {
        "content": "<p>well, there's a profusion of stuff here - isomorphic transforms, filling out translations, reducing semantic granurality, fixing broken references, retagging security labels, improving html</p>",
        "id": 153905397,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504985069
    },
    {
        "content": "<p>this is kind of ties into the conversation of how to group for the lastN operation for Obs</p>",
        "id": 153906299,
        "sender_full_name": "Eric Haas",
        "timestamp": 1505157220
    }
]