[
    {
        "content": "<p>While working with the resource \"Observation oxygen-saturation \", I believe that there is a wrong annotation.  The  observation code should be changed to \"20564-1 - Oxygen saturation in blood\"  - representing a  vital sign measurement in a more generic way - according to 1.2.276.0.76.10.4031 .</p>",
        "id": 153970509,
        "sender_full_name": "Heike Dewenter",
        "timestamp": 1529416363
    },
    {
        "content": "<p>I think you are talking about this <a href=\"http://build.fhir.org/oxygensat.html\" target=\"_blank\" title=\"http://build.fhir.org/oxygensat.html\">Observation profile</a>.  This issue has gone undergone extensive committee discussion both in FHIR and CCDA.  The vital sign spO2 is defined by the US Meaningful use 2015 Clinical Common data set and is a method based observation.   If you want to represent a laboratory measure then the above LOINC would be appropriate.</p>",
        "id": 153970552,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529422532
    },
    {
        "content": "<p>US meaningful use shouldn't be a primary driver of a profile with universal applicability.  The question is what is the appropriately broad LOINC code that encompasses the scope of the vital sign.  If that happens to align with the US meaningful use code, great.  If not, both can be sent in an instance if need-be.</p>",
        "id": 153970597,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529434484
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> here. I was not a participant in the discussions that led to the method-specific code for O2 saturation in the US Core and Argonaut vital sign list. I for one think this and the same for head circumference are a problematic mistake, <strong>particularly</strong> with the <code>Extensible</code> binding which means you <strong>SHALL</strong> map a vital sign observation using a different method to this specific method LOINC code. Think how that play out in ICU patients getting regular arterial blood gas observations. I'd be happy to help improve this for the base resource if that is the best solution.</p>",
        "id": 153970851,
        "sender_full_name": "Robert McClure",
        "timestamp": 1529518624
    },
    {
        "content": "<p>Technically, extensible says that \"if your concept is covered by one of the concepts inside the value set, you must use it\".  If the concepts are overly narrow, you have the reverse problem.  Someone who wants to send a concept of \"Head circumference, ultrasound\" or \"Head circumference, no method specified\" would NOT be expected to use \"Head circumference, tapemeasure\", which means that rather than getting all head circumferences grouped consistently, you're inviting for non-consistency.</p>",
        "id": 153970866,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529521141
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Yes, that is the presumed interpretation of the words \"covered by\" but for some, that might not be clear. We often find people asking if they are expected to map to a different code that only partially matches - if they even ask. I've added a GForge ticket <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17394\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17394\">17394</a></p>",
        "id": 153970887,
        "sender_full_name": "Robert McClure",
        "timestamp": 1529525983
    },
    {
        "content": "<p>link to this issue on argonaut channel to get implementer feedback: <a href=\"#narrow/stream/20-argonaut/subject/US.20Core.20vital.20signs.20code.20for.20SpO2/near/160509\" title=\"#narrow/stream/20-argonaut/subject/US.20Core.20vital.20signs.20code.20for.20SpO2/near/160509\">https://chat.fhir.org/#narrow/stream/20-argonaut/subject/US.20Core.20vital.20signs.20code.20for.20SpO2/near/160509</a></p>",
        "id": 153971055,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529644037
    },
    {
        "content": "<p>I personally think that the intent of the profile is clear: head circumference by eany method, and o2 sat by any method.</p>",
        "id": 153971085,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529669496
    },
    {
        "content": "<p>I agree.  I think we should be consistent and use the methodless (\"any method\") codes throughout.  And that also applies to \"Body height\" (as \"Body length\" is actually \"Body height --lying\") .  If the more specific codes also are needed (e.g. in pediatrics) they can be sent as additional translation codes.</p>",
        "id": 153971088,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1529670280
    }
]