[
    {
        "content": "<p>Creating this topic to continue the discussion originally begun on the HAPI stream at <br>\n<a href=\"https://chat.fhir.org/#narrow/stream/hapi/topic/codeSystem.20.26.20valueSet.20\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/hapi/topic/codeSystem.20.26.20valueSet.20\">https://chat.fhir.org/#narrow/stream/hapi/topic/codeSystem.20.26.20valueSet.20</a><br>\nand continued on the Vocab WG conference call on Thursday (July 7).   </p>\n<p>Notes from the Vocab call minutes include:<br>\n#10277 - Discussion/revisit expansion profile resource<br>\nThis item is about the flags at the bottom of the expansion profile.  Michael Lawley feels that leaving these in the expansion profile will lead to an explosion of permutations of the profiles.   Rob McClure spoke about his seeing the need and sense of breaking these out of the expansion profile, but it is not clear if they should be in the definition, or a separate set of arguments to the service.  Ted spoke about how he sees the issue, and what is controlling and what is persisted as something the documents the expansion resource.  We had an robust discussion about this resource and the kinds of operations needed to expand value sets, and what has to be in the expansion and how it may and maybe should differ from what is in the VSD.  Jim, Rob M, and Ted all agree that it should be absolutely forbidden that anything that is not explicitly in the expansion as per the VSD be included as some kind of addition. There seemed to be agreement that the parameters used to subset the expansion from what would 'normally' be in it from the VSD be documented in the metadata of the expansion itself.   Rob H is in agreement with all the concerns expressed.    It needs to be explicit that adding to the set of codes in the expansion is neither the intent nor should it be permitted in any way.  This is probably solved with improved documentation.</p>\n<p>The tracker for this is <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10277\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10277\">GF#10277</a>.</p>",
        "id": 153837364,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1468266872
    },
    {
        "content": "<p>\" all agree that it should be absolutely forbidden that anything that is not explicitly in the expansion as per the VSD be included as some kind of addition\" - this seems off-topic to me - none of the flags proposed do this, and I don't know why it was brought up?</p>",
        "id": 153837366,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468268260
    },
    {
        "content": "<p>I think we should say that the last 7 elements in ExpansionDefinition can also be passed as parameters to an expansion operation, and if they are, they override the value specified in the ExpansionProfile, if one is nominated</p>",
        "id": 153837370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468269823
    },
    {
        "content": "<p>I agree that the additions isn't really an issue, as you're right, nothing in the resource as proposed does this.  But there was concern expressed that, unless it was clearly enough stated, and even better specifically prohibited, that somebody might still try to do that.  So that's why it was brought up (my take on that, anyway).</p>\n<p>The sense on the vocab call was that there is a need and we ageed with your second point regarding the last 7 elements as parameters on $expand, and that they would override the values  in ExpansionProfile (if EP is present).</p>",
        "id": 153837378,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1468270422
    },
    {
        "content": "<p>I would add that any expansion parameters supplied in the $expand like this should be reflected in the list of parameters in the expansion result.</p>",
        "id": 153837781,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1468372644
    },
    {
        "content": "<p>Agree, <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> </p>",
        "id": 153837800,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1468374075
    },
    {
        "content": "<p>ok, so eVote on this:<br>\n- take the ExpansionProfile elements includeDefinition, includeInactive, excludeNested, excludeNotForUI, excludePostCoordinated, displayLanguage, limitedExpansion, and make them allowable as parameters on $expand<br>\n- if present, they override whatever some from the explicit or implicit profile<br>\n- if present, they SHALL be in the .expansion.parameters<br>\n- review the documentation on each to be clear that mau operate to exclude codes from the expansion, not inject them</p>",
        "id": 153837810,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468374319
    },
    {
        "content": "<p>Rob, you want to open that on the vocab list?</p>",
        "id": 153837811,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468374332
    },
    {
        "content": "<p>yes, I think that works<br>\nI need to refresh my recollection of what we said our procedures need to be for it<br>\nthe issue that I can think of might be the minimum vote period was that we specified (it's probably a week)</p>",
        "id": 153837820,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1468374530
    },
    {
        "content": "<p>that's still quicker than waiting for the call</p>",
        "id": 153837822,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468374565
    },
    {
        "content": "<p>yes, but only by a couple of days - if that's enough, then great</p>",
        "id": 153837828,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1468374763
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> will be amused to know that I am now dependent on having heirachy as a flag on the $expand operation inside the build tool</p>",
        "id": 153839930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468978778
    }
]