[
    {
        "content": "<p>I recently came across this Lancet paper<br>\n<a href=\"https://www.thelancet.com/journals/landig/article/PIIS2589-7500(20)30244-2/fulltext\">Use of LOINC for interoperability between organisations poses a risk to safety</a></p>\n<p>which was a response to this paper:<br>\n<a href=\"https://www.thelancet.com/journals/landig/article/PIIS2589-7500(19)30196-7/fulltext\">Effective coding is key to the development and use of the WHO Essential Diagnostics List</a></p>\n<p>The original authors replied with<br>\n<a href=\"https://www.thelancet.com/journals/landig/article/PIIS2589-7500(20)30247-8/fulltext\">Use of LOINC for interoperability between organisations poses a risk to safety - Authors' reply</a></p>\n<p>So, what do you think? Does the use of LOINC between organizations pose a risk to safety?</p>",
        "id": 250030872,
        "sender_full_name": " Bob Milius",
        "timestamp": 1629399281
    },
    {
        "content": "<p>any communication between organizations poses a risk to safety. If it's not done right.</p>",
        "id": 250042210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629403581
    },
    {
        "content": "<p>Absolutely and free text is obviously more risky that structured, coded data. From a communications (and implementer) viewpoint, the authors themselves fail to make a clear distinction between the coding of the observation type and the result(s) of that observation.</p>",
        "id": 250056643,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1629411689
    },
    {
        "content": "<p>The point of the paper is that LOINC in particular poses a greater risk to safety when used for interoperability between organizations -- greater risk than other standards such as SNOMED and ICD-10. I don't think I agree with this, and until there's a good publicly available alternative it's what we have.</p>",
        "id": 250485569,
        "sender_full_name": " Bob Milius",
        "timestamp": 1629812213
    }
]