[
    {
        "content": "<p>Hi, Norway has a national coding system that includes 4 codes for Encounter.class. We can easily map to IMP and AMB but the Norwegian definition of \"day treatement\" is restriced to not include overnight stay. Is it ok to map to SS (less than 24 hours - which could include an overnight stay) or would it be better to extend a national value set with a code with a semantic definition that specifies no overnight stay?</p>",
        "id": 264973931,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1639553772
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> I think I would create a new \"day treatment\" code (in a new code system) and include it in your own value set bound to Encounter.class.  You should also be able to use a code system supplement on v3-ActCode to add a relationship to make it a subtype (child) of 'SS'.  And ultimately the best may be to submit a UTG proposal to add a new code for 'DT' (\"day treatment\") to the v3-ActCode code system - then you wouldn't need to add and maintain the new code and value set separately.  Those are my thoughts on it at the moment.</p>",
        "id": 265003102,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1639571864
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - that sounds good. Very good idea to place the new code as a child of of SS <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> . Ill see if I can get a proposal submitted. <br>\nOne follow-up question. In Norway the national standardized code system for this has 4 values whereof two are overlapping 1:1 with SetActEncounterCodes. Is it best practice to create a value set consisting of these 4 codes (and leave out the ActSetEncounterCodes we are not using), or would it be better that the  national value set consist of all the codes in ActSetEncounterCodes + our to extra codes?</p>",
        "id": 265004192,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1639572432
    },
    {
        "content": "<p>I guess that's probably up to you, which way you prefer to go.  But my inclination is that it's generally going to be best to use international standard codes (whether HL7 or SNOMED CT or anything else) when you can and supplement them with local (national) codes if and when you need to.  So I think your latter suggestion is what I would probably do, and map from wherever your national codes are being used (in other systems?) to the international standard codes as is necessary.  But if you have well established national codes and practices and all or most of your systems are using them, then maybe that would be a reason to do it the other way.</p>",
        "id": 265006560,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1639573519
    },
    {
        "content": "<p>Thanks for input <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  - it is up for discussion in TSC tomorrow. Lets see what we ends up with.</p>",
        "id": 265007889,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1639574192
    },
    {
        "content": "<p>What aspect is being discussed in TSC?</p>",
        "id": 265009538,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1639574971
    },
    {
        "content": "<p>Both questions you have commented on (HL7 Norway TSC) . For mapping of day treatment I expect we will follow your recommendation. As we have quite clear national standardization  on 4 codes for Encounter.class there may be some discussion on whether it is necessary to include the SetActEncounterCodes that are currently not in use in Norway.</p>",
        "id": 265015137,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1639577496
    },
    {
        "content": "<p>Not being aware that there was an HL7 Norway TSC, I had assumed you were referring to the HL7 Int. TSC - this definitely makes more sense. :)  And I agree about likelihood of needing the discussion on the Encounter.class codes, and that's why I wasn't wanting to be too prescriptive about the \"right\" way to do it.</p>",
        "id": 265047165,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1639590426
    }
]