[
    {
        "content": "<p>I used to think that server could apply its own (page) count if the count parameter from client request is \"unreasonable\". For example, if server has its default page count 500 and client requests $expand with count=5000, server could just return 500 per page. I re-read the $expand operation again and I don't find anywhere says that server could apply its own page count or could NOT apply its own page count. So what is the expectation?</p>",
        "id": 187003656,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1580401615
    },
    {
        "content": "<p>I was pretty sure the count parameter was advisory, but this is the most relevant  text I found (at the bottom of <a href=\"https://www.hl7.org/fhir/operation-valueset-expand.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/operation-valueset-expand.html\">https://www.hl7.org/fhir/operation-valueset-expand.html</a>):</p>\n<blockquote>\n<p>Servers are not obliged to support paging, but if they do, SHALL support both the offset and count parameters.</p>\n</blockquote>\n<p>One way to read this is that a server that behaves as you describe is perfectly ok, but PERHAPS cannot be described as \"supporting paging\" :-)</p>\n<p>On a practical level, if a client assumes that a result of &lt; the count parameter implies the last page, then you'll not have a good experience.  We have a default page size for Ontoserver and a max page size.  If a client asks for more than the max page size then an error is returned.  If they ask for more (or less) than the default, then we honor their request.</p>",
        "id": 187060035,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1580451906
    },
    {
        "content": "<p>server has a right to protect itself against requests that ask too much</p>",
        "id": 187060154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580452137
    },
    {
        "content": "<p>Sure, but as a client, if I ask for count = n in the expansion and I get k items where k is less than n, is that okay (when offset + k &lt; total), or must a server protect itself by returning an error (eg too costly).</p>",
        "id": 187140026,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1580519725
    },
    {
        "content": "<p>I don't think you need the error (see attached) <a href=\"user_uploads/10155/JaOT88-W7QRgdtCqOAp4YfVY/pasted_image.png\" target=\"_blank\" title=\"user_uploads/10155/JaOT88-W7QRgdtCqOAp4YfVY/pasted_image.png\">pasted image</a> text in yellow. Not sure the text in blue is safe, but that's a different issue.</p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/10155/JaOT88-W7QRgdtCqOAp4YfVY/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"user_uploads/10155/JaOT88-W7QRgdtCqOAp4YfVY/pasted_image.png\"></a></div>",
        "id": 187356951,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1580822142
    },
    {
        "content": "<p>This is text for the <code>_count</code> parameter and paging in Bundles representing Search results.  This is not the same as the <code>count</code> parameter for <code>ValueSet/$expand</code>, although it's arguable that the semantics / behaviour should be aligned, especially if this change proposal to support a \"next\" link gains traction <a href=\"https://jira.hl7.org/browse/FHIR-25786\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-25786\">https://jira.hl7.org/browse/FHIR-25786</a></p>",
        "id": 187405289,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1580853703
    }
]