[
    {
        "content": "<p>Has someone already implemented the SNOMED CT to ICD-10 extended map refset into ConceptMap resource? <br>\nWe don't understand which elements of ConceptMap to use in order to represent the attributes mapGroup and mapPriority of the refset.<br>\nThanks for your advices.</p>",
        "id": 178851995,
        "sender_full_name": "François Macary",
        "timestamp": 1571836593
    },
    {
        "content": "<p>where is the source for this? What is mapGroup and mapPriority?</p>",
        "id": 178876674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571851897
    },
    {
        "content": "<p>The ConceptMap resource has very simple semantics.  There is nothing in it that corresponds to the complexity of SNOMED's ICD-10 map.<br>\nIf you wanted to operationalise this map in the context of FHIR, then I think you'd need to look to the FHIR Mapping Language</p>",
        "id": 178903296,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1571870135
    },
    {
        "content": "<p>More details to my question for <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> :  SNOMED International specifies a particular kind of refset called \"extended map\", which is used by the SNOMED CT &gt; ICD map.  For a given source concept, candidate targets are organized in groups, with priorities defined within each group. The specification is there: <a href=\"https://confluence.ihtsdotools.org/display/DOCRELFMT/5.2.10+Complex+and+Extended+Map+Reference+Sets\" target=\"_blank\" title=\"https://confluence.ihtsdotools.org/display/DOCRELFMT/5.2.10+Complex+and+Extended+Map+Reference+Sets\">https://confluence.ihtsdotools.org/display/DOCRELFMT/5.2.10+Complex+and+Extended+Map+Reference+Sets</a> <br>\nThanks <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  for the reference to the FHIR mapping language. We'll look into it. Our initial intent was to implement this map as an instance of ConceptMap resource. Another possibility would be to build the extensions we need within this resource, and propose to complement this resource in R5. The resource type does not seem so far from the Snomed extended map refset specification.  Any thoughts against that?</p>",
        "id": 178949884,
        "sender_full_name": "François Macary",
        "timestamp": 1571922747
    },
    {
        "content": "<p>well, after reading the documentation, this is my take:</p>\n<p>- mapGroup = a set of ConceptMap.group.element.target<br>\n- mapPriority = implicit in the order of ConceptMap.group.element.target, but good to make it explicit with an extension<br>\n- mapRule = an extension on ConceptMap.group.element.target of type Expression (though there's no details about this is made computable)<br>\n- mapAdvice = ConceptMap.group.element.target.comment</p>\n<p>I would not think of this as a suitable thing for StructureMap</p>",
        "id": 178976692,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571938451
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> .  We'll follow this path.  Our main issue of understanding was about mapGroup.<br>\nA concepts that maps systematically to two ICD-10 codes will have two  map groups, each one containing a single target.  <br>\nExample:  385513001|Firework burn of skin (disorder)| maps to  T30.0 |Burn of unspecified body region, unspecified degree<br>\n)| and W39 |Exposure to inanimate mechanical forces, discharge of firework|.<br>\nTherefore, 2 occurrence of  element with code 385513001, the first one with target T30.0 and the second one with target W39.<br>\nFYI, the grammar for map rules is in the technical guide for the map to ICD-10: <br>\n<a href=\"https://confluence.ihtsdotools.org/display/DOCICD10/Appendix+A%3A+mapRule+Grammar+and+Formatting\" target=\"_blank\" title=\"https://confluence.ihtsdotools.org/display/DOCICD10/Appendix+A%3A+mapRule+Grammar+and+Formatting\">https://confluence.ihtsdotools.org/display/DOCICD10/Appendix+A%3A+mapRule+Grammar+and+Formatting</a></p>",
        "id": 179225021,
        "sender_full_name": "François Macary",
        "timestamp": 1572264916
    },
    {
        "content": "<p>Note my response was mostly wrt the issue of mapRule and making it computable. ConceptMap has no mechanism for this and I'd be interested in how this might be done natively in FHIR</p>",
        "id": 179292364,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1572312500
    },
    {
        "content": "<p>well in this case you'd just reproduce the snomed language and meaning. I don't know if that would suit us.... I expect it to be too bound to snomed semantics. The grammar doesn't tell me how it works</p>",
        "id": 179292598,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572312951
    },
    {
        "content": "<p>exactly - syntax but no operational semantics, and for it to work, you need to know how it binds to the information model (ie the FHIR resources)</p>",
        "id": 179295159,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1572316512
    },
    {
        "content": "<p>yes so maybe we want to do something about, but the depends/produces probably accounts for most of the actual functionality</p>",
        "id": 179297807,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572320418
    }
]