[
    {
        "content": "<p>Does anyone disagree with this statement:</p>\n<p>\"When publishing value sets in the core FHIR specification, SNOMED CT expansions should not include inactive concepts\"</p>\n<p>with a follow up question: if a SNOMED CT value set enumerates an inactive concept, does the build tool ignore these, or throw an error?</p>",
        "id": 153852215,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475801348
    },
    {
        "content": "<p>I would argue that if inactives should be excluded, then the ValueSet definition should explicitly exclude them</p>",
        "id": 153852220,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1475803090
    },
    {
        "content": "<p>I agree with Michael regarding explicit exclusions</p>",
        "id": 153852221,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1475803147
    },
    {
        "content": "<p>why did you define the capability in ExpansionProfile then?</p>",
        "id": 153852225,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475803663
    },
    {
        "content": "<p>Are expansion profiles in use for publishing value sets in the core FHIR spec?</p>",
        "id": 153852228,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1475803881
    },
    {
        "content": "<p>yes they are now, and I was going to use them to do what IHTSDO wants</p>",
        "id": 153852229,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475803912
    },
    {
        "content": "<p>In that case, if it's clear which expansion profile is being used to produce the expansion for the FHIR core spec, then I don't feel as strongly about explicit exclusions in the value set definition. However, some policy or guidance may be necessary for implementers expanding the value set separate to the FHIR spec.</p>",
        "id": 153852231,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1475804131
    },
    {
        "content": "<p>(sorry, I've been out...) From the VSD spec:<br>\n6.2.2 ActiveOnly<br>\nDefinition: include only ACTIVE Concept Representations in the Value Set Expansion Code Set<br>\nDescription: This attribute flag indicates if “only active” Concept Representations should be included in the resulting Value Set Expansion Code Set when executing the CLD query. An active Code System Version concept is identified by the “activity status” which is meant to indicate if the concept may be used for data collection and recording at the time the Code System Version is the currently active Code System.Usage Notes: The default is \"FALSE\" which means that all concepts that match the CLD in the Code System version used to determine the Value Set Expansion Code Set will be returned. Any Code System concept attribute that represents activity status should be ignored if ActiveOnly = FALSE. If a Code System has no concept attribute that represents activity status, then all concepts should be considered to have an activity status = “ACTIVE”. It is assumed that a concept activity status of “DEPRECATED” or “RETIRED” or “INACTIVE” all represent a status that is NOT ACTIVE. This attribute is to be implemented independent of “LockedDate” such that if LockedDate is set, then this attribute defines if only active concepts or all are placed into the Value Set Expansion Code Set.<br>\nData Type: BL Cardinality: 1..1</p>\n<p>In VSAC the behavior is to only include ACTIVE concepts and we have a work-around to include INACTIVE concepts in an expansion. The plan is to implement the use of \"ActiveOnly\" as part of our expression-based CLD work. Also, when one or more specific inactive concepts are needed in the expansion, you can define a clause of the CLD to include a specific code from a specific code systyem version. Then that code is always in the expansion.</p>",
        "id": 153852464,
        "sender_full_name": "Robert McClure",
        "timestamp": 1476108070
    },
    {
        "content": "<p>thanks for that. you'll be glad to know that FHIR works the same way</p>",
        "id": 153852489,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476141110
    },
    {
        "content": "<p>but I don't believe it actually answers my original question </p>",
        "id": 153852490,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476141125
    },
    {
        "content": "<p>I think it comes down to the conceptual definition of the ValueSet.  If this includes inactive codes then fine, but if it doesn't, then that should be explicitly expressed as part of the ValueSet definition.<br>\nMy understanding of the 'active only' capability from expansion profiles is when the client has additional requirements relating to context of use.</p>",
        "id": 153852503,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1476143168
    },
    {
        "content": "<p>So, ultimately, I disagree with the statement.  If the ValueSet doesn't itself exclude the inactives, then I'd like to understand an explicit justification for why the core spec should exclude them.</p>",
        "id": 153852504,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1476143315
    },
    {
        "content": "<p>cause IHTSDO asked me to do that, though I don't believe I have that written down</p>",
        "id": 153852505,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476143394
    },
    {
        "content": "<p>given that these are almost all example value sets, I don't have a strong feeling either way</p>",
        "id": 153852506,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476143441
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> The Content Logical Definition part of a value set definition defines what codes are in the expansion. ACTIVEONLY is an attribute of the CLD. I'm completely confused by your confusion about if actives are in or out - it should be explicelty stated in every CLD. Graham has said FHIR does it this way. So I suppose to use your words \"the conceptual definition\" of the value set expansion content will clearly say include or don't include inactives based on the code system version to be used. Given that you are referring to an expansion profile, ActiveOnly is in the wrong place?</p>",
        "id": 153852708,
        "sender_full_name": "Robert McClure",
        "timestamp": 1476295215
    },
    {
        "content": "<p>sounds like agreement to me, <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> and <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>. As things stand, I have 2 choices for implementing the policy: setting active-only in all the value sets (and policing that everyone does all the time) or setting active-only in the expansion profile I use. </p>",
        "id": 153852710,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476300728
    },
    {
        "content": "<p>if you don't think that the expansion profile should be able to say active-only, then that's something to discuss</p>",
        "id": 153852711,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476300752
    },
    {
        "content": "<p>but I don't feel as though I'm closer to agreement about my first question: what should our policy be? </p>",
        "id": 153852712,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476300784
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"robert@healthlinkages.com\">@Robert Barkovich</span> McClure I was trying to separate intent from the expression of the intent.  I'm not familiar with a formal definition of CLD, so I avoided the term.</p>",
        "id": 153852739,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1476309177
    },
    {
        "content": "<p>Grahame, I'd be happy with a policy that inactives shouldn't be in the generated docs, but I would encourage an approach that involved including that constraint in the CLDs where appropriate, but also incorporating a check on all expansions during the generation phase to catch any omissions</p>",
        "id": 153852742,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1476309539
    },
    {
        "content": "<p>well, right now, as has been mentioned, includeInactive in FHIR (related to but obviously not the same as ActiveOnly in VSD) is only present in the ExpansionProfile and the $expand operation<br>\nyou can't say anything about the activity status directly in the CLD (ValueSet.compose) in FHIR (it's not in the base ValueSet resource or the \"standard\" valueset extensions) - again, that's obviously different from VSD<br>\nthe default behavior of FHIR and VSAC (include only active concepts) is different from the default specified in VSD (ActiveOnly = false)<br>\nso do we need to consider aligning these more closely?<br>\nit might not be necessariy to do that as it all should be readily transformable, but more consistent behavior could helpf reduce confusion</p>",
        "id": 153852745,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476311887
    },
    {
        "content": "<p>would be a filter in FHIR ValueSet</p>",
        "id": 153852750,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476312177
    },
    {
        "content": "<p>also, <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>'s quote from VSD that \"It is assumed that a concept activity status of “DEPRECATED” or “RETIRED” or “INACTIVE” all represent a status that is NOT ACTIVE\" makes me realize that we probably have an issue with \"deprecated\"<br>\nthe \"deprecated\" status in V3 (and the similar \"discouraged\" status in LOINC) is intended to represent concepts that are still considered to be \"active\", but are recommended not to be used (at least for new development) and, in V3, are flagged for future inactivation<br>\nthis also came up in the context of the FHIR certification test on a question that I wrote - for that we were in agreement (at least at the time) that the \"deprecated\" codes were still considered as \"active\" for determining the contents of the value set expansion<br>\nbut the VSD spec states it otherwise<br>\nand, whichever way we decide, we probably haven't yet stated it clearly enough in FHIR what the behavior is supposed to be</p>",
        "id": 153852751,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476313062
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> right - we should be able to use a filter on a status property to exclude inactive concepts, although that's probably not as straightforward as you would like for it to be<br>\nbut I don't see a way to do the reverse of explicitly including inactive concepts without using the includeInactive parameter (which isn't part of the CLD)</p>",
        "id": 153852752,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476313464
    },
    {
        "content": "<p>yes, HL7 is clear that deprecated != inactive. Rob M can just align with that. </p>",
        "id": 153852753,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476313537
    },
    {
        "content": "<p>agree that life is never as simple as we'd like it to be</p>",
        "id": 153852754,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476313548
    },
    {
        "content": "<p>agree - but we just published VSD with it the other way :-(</p>",
        "id": 153852755,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476313584
    },
    {
        "content": "<p>other way in which regard?</p>",
        "id": 153852756,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476313743
    },
    {
        "content": "<p>in regard to VSD explicitly stating (in the quote Rob M. gave) that the assumption is that a concept activity status of “DEPRECATED” represents a status that is NOT ACTIVE</p>",
        "id": 153852757,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476313879
    },
    {
        "content": "<p>oops. we will ignroe than and get VSD revised in the future</p>",
        "id": 153852758,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476313914
    },
    {
        "content": "<p>yes, that seems to be what we need to do</p>",
        "id": 153852759,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476313934
    },
    {
        "content": "<p>Yes, we need to change VSD it seems. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  can you enter a STU issue for that here <a href=\"http://www.hl7.org/dstucomments/showdetail.cfm?dstuid=189\" target=\"_blank\" title=\"http://www.hl7.org/dstucomments/showdetail.cfm?dstuid=189\">http://www.hl7.org/dstucomments/showdetail.cfm?dstuid=189</a></p>",
        "id": 153852789,
        "sender_full_name": "Robert McClure",
        "timestamp": 1476383625
    },
    {
        "content": "<p>Done.<br>\n<a href=\"http://www.hl7.org/dstucomments/showdetail_comment.cfm?commentid=1109\" target=\"_blank\" title=\"http://www.hl7.org/dstucomments/showdetail_comment.cfm?commentid=1109\">http://www.hl7.org/dstucomments/showdetail_comment.cfm?commentid=1109</a></p>",
        "id": 153852876,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476477764
    },
    {
        "content": "<p>Discovered issue.. IHTSDO have asked me to ensure that the FHIR build process only uses codes from SNOMED international. I've just done the infrastructure work to do that, and discovered that the following valuesets from the main FHIR build use SCT-US specific content:</p>",
        "id": 153852908,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476585452
    },
    {
        "content": "<p>consistency-type, entformula-type, supplement-type, texture-code</p>",
        "id": 153852909,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476585456
    },
    {
        "content": "<p>all of these are on NutritionOrder. <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> I am not sure what to do about this...?</p>",
        "id": 153852910,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476585486
    },
    {
        "content": "<p>discovered issue around includeInactive: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12279\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12279\">GF#12279</a></p>",
        "id": 153852913,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476612758
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> A lot of new nutrition content was added to the US extension and hasn't made it (yet) into the International Edition.  If you can't use content from the US (and other) extensions, then I guess you'll have to pull these value sets.  But maybe this is something that we can work out further in Wellington and come up with a satisfactory solution.</p>",
        "id": 153852916,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476631717
    },
    {
        "content": "<p>what kind of solutions could there be?</p>",
        "id": 153852920,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476650633
    },
    {
        "content": "<p>defintely agree on renaming includeInactive to excludeInactive</p>",
        "id": 153852926,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1476658831
    },
    {
        "content": "<p>also, FYI: <a href=\"http://hl7-fhir.github.io/snomedct-usage.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/snomedct-usage.html\">http://hl7-fhir.github.io/snomedct-usage.html</a></p>",
        "id": 153852958,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476679928
    },
    {
        "content": "<p>we have to take em out.  I'll let margaret know</p>",
        "id": 153853007,
        "sender_full_name": "Eric Haas",
        "timestamp": 1476726040
    },
    {
        "content": "<p>Since the page states \"Note that this page only lists those codes used by the international FHIR specification\", then we do have to remove them.  But we may need some further thinking and policies about when and how we can use codes from national (and potentially other) extensions.  The simplest answer I'm sure is \"in appropriate realm specific IGs\" - and if that's adequate to meet the needs, then there's probably not an issue.</p>",
        "id": 153853008,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476726788
    },
    {
        "content": "<p>IHTSDO have said that we can leave them in, for now at least. So no need to take them out for STU3</p>",
        "id": 153853012,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476733784
    },
    {
        "content": "<p>where do we say that?</p>",
        "id": 153853013,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476733803
    },
    {
        "content": "<p>the second sentence in the SNOMED CT in FHIR page<br>\n<a href=\"http://hl7-fhir.github.io/snomedct-usage.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/snomedct-usage.html\">http://hl7-fhir.github.io/snomedct-usage.html</a></p>",
        "id": 153853015,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476733969
    },
    {
        "content": "<p>ah ok. well, we can change that. </p>",
        "id": 153853016,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476733998
    },
    {
        "content": "<p>right, we can change it<br>\ninteresting that they said we can leave them in<br>\nthat sounds good - presumably we need to identify when extension content is included (and/or the edition used)?</p>",
        "id": 153853017,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1476734194
    },
    {
        "content": "<p>they said we could leave them in for now, as a procedural issue. </p>",
        "id": 153853019,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476734578
    },
    {
        "content": "<p>I didn't ask for permanent approval </p>",
        "id": 153853020,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476734585
    }
]