[
    {
        "content": "<p>I am curious about the real-world experience of using SNOMEDCT expressions. This stream was recommended as a good place to ask. Could anyone share if you know of systems/groups that are routinely using expressions, especially in transactions across systems? I'm curious to see how their exchange works and how well/if expressions are being used in real-time. Much appreciated!</p>",
        "id": 260425578,
        "sender_full_name": "Bret H",
        "timestamp": 1636128305
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> <span class=\"user-mention\" data-user-id=\"270794\">@Suzy Roy</span></p>",
        "id": 260441874,
        "sender_full_name": "Robert McClure",
        "timestamp": 1636135207
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span>  I'll take an initial pass at it and will say that I think you will find that the answer is largely no - that there is not much use  (especially routine use) of SNOMED CT expressions for real-time data exchange, especially across systems.  My understanding is that University of Nebraska (Jim Campbell and others) does use them, but I think that's internal use in essentially an \"expression library\" approach (if I'm recalling the details correctly).  I'm sure that <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> will have some thoughts and likely many more details.</p>",
        "id": 260456439,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1636142146
    },
    {
        "content": "<p>it's possible to use them in FHIR, transparently - if you're careful to use a terminology server consistently, the a snomed code is just a list of characters, and only the terminology server needs to know anything about it. But terminology servers don't fully support expressions yet (I believe from discussing with Michael, who's furthest ahead on this), so that this possiblity is theory not practice at this point</p>",
        "id": 260465452,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636146810
    },
    {
        "content": "<p>The other possibility is to pre-define enumerated expressions that convey your concepts and have everyone just use those as if they were stand-alone codes.  (Much as may implementations do with post-coordinated UCUM expressions like \"cm\" and \"mL\".)</p>",
        "id": 260466256,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636147223
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - that's similar to the \"expression library\" approach.  One thing to keep in mind is that determining true equivalence now with SNOMED CT will generally require description logic classification - rather than relying on string matching or simpler \"normal form\" approaches.</p>",
        "id": 260466863,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1636147641
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> makes a key point about the classification requirement.  IMO, the distinction between post-coordinated and pre-coordinated concept creation has narrowed to the extent that a common set of tooling is required and the logical progression (in my eyes, anyway :)) is for that tooling to assign SCTIDs to post coordinated concepts and reduce the massive adoption barrier that's created by the use of expressions as codes.</p>",
        "id": 260471821,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1636150934
    },
    {
        "content": "<p>Thanks all. I appreciate your insight and thoughts. It will be interesting to hear what <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  has to say. <br>\nYou all rock! <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 260521646,
        "sender_full_name": "Bret H",
        "timestamp": 1636214980
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  but does that mean we could have messages where pre or post-coordination is used - requiring local logic when processing incoming transactions to handle both? </p>\n<p>Personally, I like the specificity of a post-coordinated model but that's mainly because that means as a developer I feel like I should be able to rely (more or less) on the message to tell me what the code means rather than use a terminology server to calculate the meaning (but  a terminology server would be needed for other purposes - no getting away from it : ^ ) - such as understanding the codeded meaning of the data elements).  Both approaches have their benefits and drawbacks. What interests me in the SNOMEDCT expression model is the ability to send specific meanings through coding the data elements as well as the value.</p>",
        "id": 260522125,
        "sender_full_name": "Bret H",
        "timestamp": 1636215532
    },
    {
        "content": "<p>Hi Brett, I think the others have covered most points.  I would concur with <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> s answer regarding <strong>exchange</strong> of expressions.  From what I've seen, the majority of the use of them is either in theoretical exercises, academic/research settings, or closed environments, that is, where the producers and consumers of the expressions are the same group.  A common case there is secondary data use where expressions are constructed from free text using NLP techniques.</p>",
        "id": 260537234,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1636234339
    },
    {
        "content": "<p>If you're looking for advice on using them, my first response would be \"don't\", followed by \"what problem are you trying to solve?\"<br>\nIn many many cases, it is far simpler and more robust to deal with multiple codes / composition at the information model level. This is because the reasoning is simpler (classification not needed) and the use-cases are often ones of relatively simple refinement.</p>\n<p>Ultimately, the real value of post coordination comes from the subsumption relationships that can be inferred by the classifier.  If you're <br>\nnot looking to get that kind of value then it's likely that \"post coordination\" is really just being used as a convenient syntax for aggregating multiple codes together in a single field.</p>",
        "id": 260537921,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1636235182
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  et al. Appreciate you taking time out for this brief foray. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 261284502,
        "sender_full_name": "Bret H",
        "timestamp": 1636737998
    }
]