[
    {
        "content": "<p>The FHIR project now has it's own SNOMED namespace. Technically, the namespace is issued to me, but it's dedicated use is internal support for FHIR project publishing, and we will not be defining concepts in it that have any use outside of FHIR itself (it's not an escape from the HTA). </p>",
        "id": 153854789,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477782785
    },
    {
        "content": "<p>The namespace value is 1000201</p>",
        "id": 153854790,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477782806
    },
    {
        "content": "<p>Technically, so far as I can see, there's no reason for anyone other than me and one or 2 other toolsmiths to even know about it, but it may become visible outside the SCT specific tooling, so I am letting everyone know in the interests of transparency</p>",
        "id": 153854791,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477782874
    },
    {
        "content": "<p>I remain confused (as with CIMI) if any concepts created in the namespace will ever be included in health care data instances. I take what you say here to mean NO, they will NEVER be in an instance of FHIR data. Honestly I don't quite understand how that can be true but would like to understand. As for why that concerns me, if FHIR (1000201xx..)  concepts do show up in instance data, then FHIR must publish the extension and HTA is in fact a part of the process. At least that is how I understand it.</p>",
        "id": 153854798,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477845015
    },
    {
        "content": "<p>I didn't get the namespace from HTA, so technically, HTA isn't part of the process. </p>",
        "id": 153854805,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477858814
    },
    {
        "content": "<p>but they should not show up in instance data; the use of it is intended to be confined to metadata, and inferred relationships when classifying concepts across editions</p>",
        "id": 153854806,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477858871
    },
    {
        "content": "<p>this is very different in intent to CIMI</p>",
        "id": 153854807,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477858895
    },
    {
        "content": "<p>Actually as long as FHIR is in HL7 and we are talking about an external code systm then HTA is involved. HTA will never hand out namespaces - IHTSDO does that. The two issues (HTA's involvement in things and you obtaining a namepsce) don't interact. If FHIR plans on publishing content, HTA is involved. If FHIR wants to use SCT - particularly multiple editions of SCT - then HTA is involved.</p>",
        "id": 153854911,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477935159
    },
    {
        "content": "<p>Grahame, can you give some specific examples of concepts we might define within this namespace?</p>",
        "id": 153854915,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1477936022
    },
    {
        "content": "<p>presnetly, I define one nodule, and one relationship type, and about 25000 relationships, and I update the module dependency map. Primarily I have the namespace for internal purposes. I'll be surprised if anyone other than an SCT toolsmith notices it</p>",
        "id": 153854922,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477937021
    },
    {
        "content": "<p>and I can't think of anything else that we might define in it. </p>",
        "id": 153854924,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477937058
    },
    {
        "content": "<p>If it stays restricted to that then I agree (for now) that this is not something FHIR/HL7 would publish as it's for terminology service use only. Is that how you see it?</p>",
        "id": 153854925,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477937152
    },
    {
        "content": "<p>Although if multiple FHIR terminology servers need to all do this, then we do need to think about how that gets propagated. Might essentially be \"publishing\" and I'm sure that IHTSDO woud have a comment. But am I on a side path here?</p>",
        "id": 153854926,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477937263
    },
    {
        "content": "<p>I agree it's an internal terminology service thing. The problem it is getting at - cross edition support - is absolutely a problem for any users of SCT in the consumer space, and IHTSDO took on a task to address this last week. It may be that my use of this is only transitory until IHTSDO come up with a lasting solution</p>",
        "id": 153854932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477937678
    },
    {
        "content": "<p>So, to be clear, the SCTID for the module you're using for this cross-version edition will never be exposed?  Specifically, we should never see it in a version URI?</p>",
        "id": 153854955,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1477963748
    },
    {
        "content": "<p>ummmm</p>",
        "id": 153854963,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477979565
    },
    {
        "content": "<p>that's one place where you will see it, in that if you make a query against my server, and do not specify which edition, I'll respond with my custom edition </p>",
        "id": 153854964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477979634
    },
    {
        "content": "<p>So then we'd need to be able to look up that concept to get its Display text etc, and it will (possibly) bleed out into various FHIR resources that are populated with (versioned) codes from your server.</p>",
        "id": 153855070,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1478056681
    },
    {
        "content": "<p>yes it might bleed out in version URIs</p>",
        "id": 153855071,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478056949
    }
]