[
    {
        "content": "<p>This has probably been done to death; but is there any guidance on the legals around SNOMED content publishing in IGs without SNOMED license agreement signup?   Specifically - is there a  speciifc number of codes okay to publish in a ValueSet (partial listing of relevant content) that is documented somewhere; and also is there any restriction on publishing smaller subsets of SNOMED as complete ValueSets if total count is less than 'allowed number'</p>",
        "id": 207485885,
        "sender_full_name": "Brett Esler",
        "timestamp": 1597894913
    },
    {
        "content": "<p>it depends on your context.</p>",
        "id": 207486907,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597896630
    },
    {
        "content": "<p>if you are publishing as an affiliate, and the country has a license to use SNOMED, then you are able to publish any amount of SNOMED CT content from the affiliate distribution (e.g. AU, in your case). You do need formal agreements with the national release office - in this case, the chair of HL7 Au should sign the SNOMED usage license with the agency. You will need to include whatever copy right statement in the value set that is made appropriate by the agreement with the national release office.</p>\n<p>If you are publishing on behalf of HL7 International, then by agreement between HL7 intl and Snomed, you may publish codes from the international distribution of SNOMED CT, along with a required copy right statement.</p>\n<p>If you do not fit into one of these 2 categories, then you either need to make your own agreements with Snomed, or you are only able to use content from the Global Patient Set, which is licensed free to use</p>",
        "id": 207487038,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597896884
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  is this in documentation somewhere so I can point legal reps at it?  <span class=\"user-mention\" data-user-id=\"192174\">@Danielle Tavares</span>  <span class=\"user-mention\" data-user-id=\"192270\">@Rob Eastwood</span>  <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span></p>",
        "id": 207510515,
        "sender_full_name": "Brett Esler",
        "timestamp": 1597921312
    },
    {
        "content": "<p>I don't think it's documented anywhere - that's distilled out of a set of documentation across hl7 and snomed.</p>",
        "id": 207510688,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597921472
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 207578153,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1597959956
    }
]