[
    {
        "content": "<p><a href=\"http://tx.fhir.org/r4\" target=\"_blank\" title=\"http://tx.fhir.org/r4\">tx.fhir.org/r4</a> says it has 2,411 ValueSets.  When I download the <a href=\"https://www.hl7.org/fhir/downloads.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/downloads.html\">fhir definitions JSON zip</a> I find only 1,316 (v2-tables.json:428, v3-codesystems.json:216, valuesets.json:672).</p>\n<p>Where do the rest of the ValueSets come from?</p>",
        "id": 169135257,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1561642727
    },
    {
        "content": "<p>The tx server has additional sources beyond the FHIR spec - there are separate import capabilities for SNOMED CT editions, LOINC, RxNorm, ICD variants and a few others, plus support for additional code systems and value sets in the separate fhir.tx.support package.  I haven't tallied it up, but I expect that would account for the difference.</p>",
        "id": 169150806,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1561653238
    },
    {
        "content": "<p>SNOMED CT?  I would  not have thought any data from SNOMED CT could be public.  (Here at NLM, we wanted to make a small subset of just the codes public, and couldn't get permission.)</p>",
        "id": 169161966,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1561660439
    },
    {
        "content": "<p>SNOMED CT aside, would there be any objection to our copying the rest of the data to our own public (HAPI) server, which runs over https?</p>",
        "id": 169162154,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1561660558
    },
    {
        "content": "<p>One answer is that the end user is responsible to have the proper license(s) in place, and there's not a general easy way to copy the content wholesale (at least for larger terminologies).  I'm sure that at least a significant part of the content can be copied, but I'm not sure exactly what licensing agreements/arrangements <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> has in place.  It's probably best to ask him directly about that, depending on exactly what you want to do.  Another question is how would you intend to do the copying?  Besides the general REST capabilities for CodeSystem and ValueSet resources, HAPI has a limited set of specific terminology loaders (different from the <a href=\"http://tx.fhir.org\" target=\"_blank\" title=\"http://tx.fhir.org\">tx.fhir.org</a> set) for a few well-known terminologies.</p>",
        "id": 169164519,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1561661985
    },
    {
        "content": "<p>I'm not exactly sure why <a href=\"http://tx.fhir.org\" target=\"_blank\" title=\"http://tx.fhir.org\">tx.fhir.org</a> has that many more value sets than the core spec. I upload a few value sets as well (e.g. out the package fhir.support.tx) and from a numebr of IGs, but I'm sure that's not 900 or so.</p>",
        "id": 169172576,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561667415
    },
    {
        "content": "<p>mostly it has additional code systems</p>",
        "id": 169172596,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561667428
    },
    {
        "content": "<blockquote>\n<p>and there's not a general easy way to copy the content wholesale (at least for larger terminologies).  </p>\n</blockquote>\n<p>A solution would be support bulk export of value sets. That was on my list for connectathon.</p>",
        "id": 169228776,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1561731748
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> do you need something other than _search and the resulting Bundle?</p>",
        "id": 169268755,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1561762091
    },
    {
        "content": "<p>I realised what the gap is - the. V2 and v3 value sets are not in the definitions</p>",
        "id": 169279570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561778889
    },
    {
        "content": "<p>I recommend you use the package instead - much simpler</p>",
        "id": 169279573,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561778908
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> This is to use bulk data export to get big chunk of value sets from one server. The request would look like</p>\n<div class=\"codehilite\"><pre><span></span>GET [base]/$export?_type=ValueSet&amp;_typeFilter=[value set search criteria]\n</pre></div>\n\n\n<p>In stead of one Bundle, the output is  an array of value set in ndjson format.<br>\nThis is just my thought. It WAS on my connectathon to-do list.<br>\nOne drawback for the current bulk data export is it does NOT provide a way to run $expand operation. I raised that issued on May ballot.</p>",
        "id": 169356463,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1561933334
    }
]