[
    {
        "content": "<p>I heard much noise around status of standards during the last HL7 WGM: active/inactive/archived, normative/withdrawn/retired (but still available on the website), published/balloted/released. Time for a consistent approach across artefacts?</p>",
        "id": 157308782,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548970613
    },
    {
        "content": "<p>you know, we could publish a code system with all the standards in it. Each would be a concept with it's own status (and a property for published location), and we could define relationships between them....</p>",
        "id": 157310028,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548971467
    },
    {
        "content": "<p>(relationships: depends-on, next-version, replaces, competes-with, makes-a-mockery-of)</p>",
        "id": 157310149,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548971552
    },
    {
        "content": "<p>That sounds more like an ontology of standards now. Great people worked on that - and didnt succeed. Scope-creep of the topic, so I withdraw my comment... ;-)</p>",
        "id": 157311363,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548972504
    },
    {
        "content": "<p>hmm. I confess to the scope creep but didn't intend to make you withdraw</p>",
        "id": 157311411,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548972553
    },
    {
        "content": "<p>So I rephrase it: Attempt harmonization with Ted and Austin on that issue. HL7 TSC topic.</p>",
        "id": 157311672,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548972736
    },
    {
        "content": "<p>Hmm.  Are you referring to a TSC discussion that has happened - or is going to happen?</p>",
        "id": 157311855,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1548972881
    },
    {
        "content": "<p>Has it happened? I am not so close to TSC. All I noted is that: The current debate on \"status of standards\" is a potential source of confusion for implementers. We should fix that. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  I followed your skype discussion today on balloted-but-not-quite-released artefacts earlier today.</p>",
        "id": 157312145,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548973111
    },
    {
        "content": "<p>Right.  Feel free to chime in on the \"not yet released\" artifacts, too.</p>",
        "id": 157312249,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1548973202
    },
    {
        "content": "<p>I don't want to follow the road to standard ontologies here. From my work in CEN and ISO I became aware of their \"state machine\" for standard artifacts. While this is not IT-specific, but also for standards on nuts and bolts, it might be useful here: <a href=\"https://www.iso.org/stage-codes.html\" target=\"_blank\" title=\"https://www.iso.org/stage-codes.html\">https://www.iso.org/stage-codes.html</a> - just to assess the potential scope of the question on the table.</p>",
        "id": 157313296,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548974040
    },
    {
        "content": "<p>The TSC discussion was driven by the fact that there are a number of specifications that - from an ANSI perspective are \"dead\", but from an implementer perspective are \"very much alive\".  HL7 needed a way to differentiate those.  The case in point is CCDA.  It's an expired STU.  There is no bandwidth to go through the effort to take it to normative and the reality is that US Regulation points to the STU version.  Any substantive changes needed to get the normative one approved would be ignored by the community - and the chances of getting it approved with no substantive changes would be slim given that there are known places where it's \"broken\".  So the TSC wanted a label they could stick on it that would give implementers the confidence it wasn't going to go poof, while still not treating it as a proper/maintained standard.</p>",
        "id": 157315904,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548976467
    },
    {
        "content": "<p>What threw me off a bit is that the topic heading is \"CodeSystem concept status property\", but what we are talking about now is the status of the standards themselves - both potentially important but definitely different topics.</p>",
        "id": 157317271,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1548977897
    },
    {
        "content": "<p>Relabeled</p>",
        "id": 157318331,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548979131
    },
    {
        "content": "<p>this would be nice.  ASTM has many specifications that security use, but their whole healthcare group has gone silent and thus everything has been withdrawn as ASTM can't maintain without a workgroup. For example the Digital Signature purpose-of-signature that is referenced in many healthcare standards including FHIR. The vocabulary is still very applicable and useable in a state that is frozen.</p>",
        "id": 157353997,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549029239
    }
]