[
    {
        "content": "<p>We've recently been looking at running replicated instances of our terminology server behind a load balancer.<br>\nIn this mode, $closure is a problematic operation because it is stateful, but the key for that state (the name parameter) is burried inside the body of the POST request.  If this were pulled out into the URL itself, e.g., as [base]/$closure/{name} then it would be vastly simpler to ensure that the load balancer was directing the closire table operations to the correct replicated instance (and therefore no need to share this state across instances)</p>",
        "id": 153844565,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1471836210
    },
    {
        "content": "<p>you wouldn't put all closure operations on the same server?</p>",
        "id": 153844570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471850730
    },
    {
        "content": "<p>Less likely to be a problem if Web Servers and DB Servers are on separate physical tiers - the 'classic' architecture for handling client session state in load-balanced distributed apps.</p>",
        "id": 153844577,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1471854261
    },
    {
        "content": "<p>closure for us is not persistent state, only in-memory<br>\ndirecting all $closure operations to a single instance (in the load balancer) would almost work, but fails for $closure inside a batch operation</p>",
        "id": 153845116,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1472129603
    },
    {
        "content": "<p>actually, batch is pretty bad for any kind of front-end that wants to inspect request traffic and do stuff</p>",
        "id": 153845117,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1472129667
    },
    {
        "content": "<p>yes. I don't see how you can make $closure not persistent</p>",
        "id": 153845153,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472159648
    },
    {
        "content": "<p>It would be interesting to read <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> on the topic of implementing batch operations in a load-balanced environment as his FHIR servers are hosted on Microsoft Azure.</p>",
        "id": 153845169,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1472167067
    },
    {
        "content": "<p>The issue with batch is not so much a load-balance problem as one of request filtering through an API Gateway</p>",
        "id": 153846629,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1473211226
    }
]