[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> : when we did the analysis on implicit concept maps last week, we missed something: in order to build the implicit concept map, you need to know the Canonical URL for the target system. I don't know where that could come from</p>",
        "id": 153859754,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480631954
    },
    {
        "content": "<p>Can I suggest a either a well-known annotation reference set (or a well-known FHIR concept map) that links the (map) reference set id to the target code system URL?</p>",
        "id": 153859884,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1480677851
    },
    {
        "content": "<p>that seemed like the rational way to go about it to me, but how do you define a well known reference set id? Is this something that should be done through HL7, or through the national release centre here in Aus?</p>",
        "id": 153859983,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480705335
    },
    {
        "content": "<p>If it's to be done as a reference set (which seems like the \"right\" way to do it since this is information about IHTSDO artifacts), then I think the the Core release should define the reference set and extensions can add their own additional rows for any of their additional local maps.</p>",
        "id": 153860327,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1480897157
    },
    {
        "content": "<p>that's the SNOMED CT core release?</p>",
        "id": 153860330,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480897256
    },
    {
        "content": "<p>Yes.  Since I cannot make a content request directly to IHTSDO, I have just sent one to ADHA requesting that it be added to SNOMED CT core</p>",
        "id": 153860345,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1480898010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> - ball back in your court. Thanks</p>",
        "id": 153860348,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480898190
    },
    {
        "content": "<p>Core would likely publish it in the July 2017 release. Perhaps Australian or other NRC can create/issue SCTID for refset and then start the promotion process to core so it gets published 20170731 there.</p>",
        "id": 153860543,
        "sender_full_name": "Guillermo Reynoso",
        "timestamp": 1480915514
    },
    {
        "content": "<p>Sorry, I've been on leave. Yes we could add this to our extension and then promote it to the International release. <span class=\"user-mention\" data-user-id=\"192021\">@Matt Cordell</span> we can discuss getting it into SNOMED CT-AU</p>",
        "id": 153865606,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1483572236
    }
]