[
    {
        "content": "<p>We'd like our extensions to be easy to look up and understand. One way to do that would be to use Observations, which we do when the subject is a Patient. But for an Immunization, that seems out of line. </p>\n<p>We are considering using the terminology resources defined for V2 (LOINC code for Vaccine Information Statement date, e.g.). This means creating a complex extension with a fixed element for the code. Seems legal.</p>\n<p>But once the semantics go in the code, we've kind of reinvented V3 Observation, and we might just leave the code open in the extension, fixing it in specific profiles. Does that prospect cause fear and loathing, or joy?</p>",
        "id": 201734207,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1592922996
    },
    {
        "content": "<p>Vaccine Information Statement date seems like it's the same as Immunization.recorded, so you probably shouldn't be using an extension at all.  Extensions are already relatively easy to look up and understand - they're identified by URL which should generally resolve to a definition (and ideally a web page) that provides a full description of the content.  It would be completely inappropriate to turn all extensions into complex extensions just so you can convey a code that is redundant with the meaning conveyed by the URL.  If you want to specify a code, put it in the definition of the extension, not in the instance.  (So definitely loathing :&gt;)</p>",
        "id": 201739207,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592925237
    },
    {
        "content": "<p>Fair enough. \"Put the definition in the extension\": i.e., in a mapping? I'd like the equivalence to be computable. (Looks like in this case VIS will be supported by R5 Immunization.education.reference &amp; publicationDate)</p>",
        "id": 201751678,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1592930927
    },
    {
        "content": "<p>I don't think Immunization.recorded is redundant with the VIS provided date. You might be able to make an argument that Immunization.occurenceDateTime should be the same as the VIS provided date (you should get educational materials when you get the shot), but they really are different concepts.</p>",
        "id": 201753633,
        "sender_full_name": "Craig Newman",
        "timestamp": 1592931881
    },
    {
        "content": "<p>StructureDefinition.snapshot.element[0].concept contains the 'code' that represents the overall structure</p>",
        "id": 201784823,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592947148
    },
    {
        "content": "<p>(If there is one, and if anyone has bothered to declare it.)</p>",
        "id": 201784865,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592947171
    }
]