[
    {
        "content": "<p>I want to restrict operation parameters for $expand operation. Currently, I create a OperationDefinition instance and set other parameters as 0..0. With introduction of TerminologyCapabilities resource, I can also do this in TerminologyCapabilities.expansion.parameter. Which one is the correct/expected way to achieve this?</p>",
        "id": 153989830,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1534871384
    },
    {
        "content": "<p>I'm not sure if I understand exactly how you are using OperationDefinition here, so if you could elaborate on it a bit that would be good.  TerminologyCapabilities is used to declare and reflect what the server can and will do, but it isn't used to control the behavior of the server.  Let me know if I'm misunderstanding part of what you are saying or asking</p>",
        "id": 153989832,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534872080
    },
    {
        "content": "<p>Let's say my server only process filter parameter for $expand operation. All other $expand parameters are ignored by server. I can create a instance of OperationDefinition, \"filter-only-expansion\", which has base url as \"base\": \"<a href=\"http://hl7.org/fhir/OperationDefinition/ValueSet-expand\" target=\"_blank\" title=\"http://hl7.org/fhir/OperationDefinition/ValueSet-expand\">http://hl7.org/fhir/OperationDefinition/ValueSet-expand</a>\" and all other parameters with max = 0 except filter. Then in CapabilityStatement, I put this instance in the place of Valueset-expand operation:</p>\n<div class=\"codehilite\"><pre><span></span>    &quot;operation&quot;:[\n   {\n      &quot;name&quot;: &quot;Valueset-expand&quot;,\n      &quot;definition&quot;: &quot;fileter-only-expansion&quot;\n   }]\n</pre></div>\n\n\n<p>In this way, I can define my operation for $expand.<br>\nTerminologyCapabilities can do the same with expansion.parameter whose summary says \"Supported expansion parameter\".<br>\nMy understanding is that CapabilitiesStatement is required. So I have to define my own filter-only-operation. Then what is the use case for TerminologyCapabilities.expansion.parameter ?</p>",
        "id": 153989837,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1534874736
    },
    {
        "content": "<p>I probably should study this a bit further, but I understand better now what you are asking and I agree that these \"capabilities\" do overlap, and that it is required to have the reference to the OperationDefinition in CapabilityStatement to declare the supported API.  TerminologyCapabilities does not describe the API, but it does declare all of the terminology capabilities together in one place.  It seems to me that both could be useful.</p>",
        "id": 153989853,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534879737
    },
    {
        "content": "<p>Obviously, the Terminology Capabilities resource is still experimental, but I don't think that it should replicate operation definitions that are already mandated elsewhere, and I note that it's  only the expansion element that contains a parameter element.</p>",
        "id": 153989867,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1534883438
    },
    {
        "content": "<p>I can't think what I was doing there. The only thing that would be useful at terminology capabilities level would be to declare expansion parameters per code system</p>",
        "id": 153989876,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534884539
    },
    {
        "content": "<p>Maybe everything in the resource definition from expansion downwards should be placed within the codeSystem element?</p>",
        "id": 153989885,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1534886983
    },
    {
        "content": "<p>well, strictly, none of them should. what would it mean to expand a value set that cross code systems, if the server claims the parameters are different for the code systems?</p>",
        "id": 153989887,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534887104
    },
    {
        "content": "<p>Isn't this about what parameters are returned in the expansion, not about operation parameters</p>",
        "id": 153989896,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534888342
    },
    {
        "content": "<p>no. it's about what parameters the server actually implements. To Yunwei's point.... the server might describe parameters it doesn't implement, but this is a pretty edge case thing to do</p>",
        "id": 153989912,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534889364
    }
]