[
    {
        "content": "<p>At the Roundtable in Cologne, we introduced two methodology items that were related to terminology.  I agreed to write up some proposed formal methodology related to them.  I have finally done so.  Opinions/discussion welcome:<br>\n<a href=\"http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources#What_coded_data_type_should_be_used.3F\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources#What_coded_data_type_should_be_used.3F\">http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources#What_coded_data_type_should_be_used.3F</a><br>\n<a href=\"http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources#What_should_the_binding_strength_be.3F\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources#What_should_the_binding_strength_be.3F\">http://wiki.hl7.org/index.php?title=FHIR_Guide_to_Designing_Resources#What_should_the_binding_strength_be.3F</a></p>",
        "id": 153974810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531349122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> <span class=\"user-mention\" data-user-id=\"191968\">@Ioana Singureanu</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153974812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531349157
    },
    {
        "content": "<p>Nice work.<br>\nConsider moving the final note, starting \"The use of required and extensible bindings...\", to before <strong>Preferred</strong>.</p>",
        "id": 153974822,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1531354250
    },
    {
        "content": "<p>Done</p>",
        "id": 153974832,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531357939
    },
    {
        "content": "<p>Well done. I think you need a bit more on when Coding should be used. I don't see a distinction described, it seems to be outright discouraged completely. or is that your intent</p>",
        "id": 153974883,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531398578
    },
    {
        "content": "<p>The first sentence of your binding strength section is muddled <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153974884,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531398594
    },
    {
        "content": "<p>Item 3 of \"Required\". Should you insert the word \"acceptable\" in the sentence --  \"This mapping may involve some _acceptable_ loss of granularity.\" ?</p>",
        "id": 153974885,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531398934
    },
    {
        "content": "<p>for CC I think this should be added to this bit...  ` for non-required bindings, allows for text only representation instead when no code is available'</p>\n<p>\" also provides for text representation to convey what the data enterer actually saw/typed, which is particularly useful when more detail is required than is possible with a code.\"</p>",
        "id": 153974922,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531403276
    },
    {
        "content": "<p>I think Coding use case was nailed.   its the hardest to use maybe add Q.item.choice.valueCoding as an example?</p>",
        "id": 153974924,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531403551
    },
    {
        "content": "<p>Re preferred  - The only reason I make an binding preferred is because could not get consensus to make it extensible.  So I would define it as a set up concepts considered for extensible binding but lacking sufficient consensus to become extensible.    Since there is no way to enforce it should be noted that the extra effort to create a preferred vs example may not be justified.</p>",
        "id": 153974927,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531404506
    },
    {
        "content": "<p>(People love making bindings preferred, especially if they have no skin in the game.  Its a feel good binding.)</p>",
        "id": 153974928,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531404836
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I've added a bit more on Coding, but yes the gist is that it's discouraged.<br>\nRevamped the first sentence<br>\nI don't want to add \"acceptable\" because that's hugely subjective.  The \"minimum\" is established by the previous bullet which sets the objective of granularity for useful interoperability for most usecases<br>\nAlso added something explicit for support across countries</p>",
        "id": 153974941,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531407429
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  added something about text only.  Made it more generic as it's not just required bindings that can limit it.  There are rules for extensible too.<br>\nI'm not sure that Q.item.choice.valueCoding would necessarily help people.  I didn't find any examples of usage that I felt would add more clarity than confusion<br>\nIn terms of preferred, I think \"consensus\" isn't a driving part of the definition.  If you can come up with a value set that covers the space, is freely available and that everyone can reasonably map to, then from a methodology perspective it <em>should</em> be required/extensible.  The question is whether there's consensus on whether it's reasonable to map.  I did add some language about consensus in the face of multiple suitable value sets.<br>\nI disagree that Preferred is only feel good.  It sets a target for those who want to maximize interoperabilty.  If you map to and from the preferred value set you'll get much better interoperability than going your own way.  Setting that expectation is useful for the community.  I've added a note to that effect</p>",
        "id": 153974945,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531408602
    },
    {
        "content": "<p>(Thanks both for the feedback)</p>",
        "id": 153974946,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531408613
    },
    {
        "content": "<p>Thanks for updating this Lloyd.  Methodology and real world limitation do sometimes clash. I'm not sure whether is appropriate to document, but am sharing my experience.</p>",
        "id": 153974948,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531409368
    },
    {
        "content": "<p>Understand that the real world always intervenes :)</p>",
        "id": 153974950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531409418
    },
    {
        "content": "<p>Type<br>\nVery good; case statement is a nice heuristic.<br>\nissue: \"The work group does not see a likelihood for 'most' systems to need to convey alternate...\"<br>\nI think it needs to be pretty well locked down for this. <br>\n\"The work group believes it is extremely unlikely that other values will be required by more than a few systems, and less likely their partners will share this need.\"<br>\nWould an example help; e.g., \"a status that tells me whether a condition should appear on an active problem list (active), a history (inactive), or only an audit report (error) seems like a good candidate for a 'code.' A status that delves into clinical distinctions of remission vs. resolution or levels of control will require more flexibility.\" (this example pending wg resolution, next week I hope)</p>\n<p>Strength<br>\nI don't know if this is the place to do it, but I can't find explicit guidance around binding strength and versions. Some of this text suggests that a (normative) binding to an unversioned value set implies that the set cannot change, but the value set design says that unspecified version just means \"get the latest.\"</p>",
        "id": 153975162,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1531499167
    },
    {
        "content": "<p>If the data type for a fixed binding is \"code\", you're locked to the version as it was published in the same release as the structure definition.  However, it would be good if the tooling made that explicit - can you submit a change request?</p>\n<p>In terms of CodeableConcept, I'd say the heuristic is \"follow the 80% rule\" - if most systems are going to need translations or text, make it a CodeableConcept.  But if it's not that common to need to share additional granularity/alternate representations, 'code' is fine.</p>",
        "id": 153975187,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531508195
    },
    {
        "content": "<p>OK: <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17480\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17480\">17480</a></p>",
        "id": 153975194,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1531509939
    },
    {
        "content": "<p>Minor omission - need to add the word 'to':<br>\nThe Coding data type should <em>only</em> be used when the intention is to reference a specific code from a code system ...</p>",
        "id": 153975258,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1531571539
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Also agree this is good. It is missing one important thing that is a general item with a big impact (Jay alluded to this in his comment): We bind to value set definitions, but people actually use value set expansions. I think a section on this is really important. I don't have the text to suggest at this moment but will work on it. Perhaps in addition to a general section, we should also add a sentence in the Note section for Required and Extensible on the impact of version changes (value set definition and code system) to the usable expansion. I'm interested in what the folks on this thread already assume should be happening in this space - I suspect we are not yet all in synch.</p>",
        "id": 153975443,
        "sender_full_name": "Robert McClure",
        "timestamp": 1531746131
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>, I've added some wording in the data type choice section that addresses this.  Special behavior around expansions is only driven by the 'code' data type.  It's not influenced by binding strength.</p>",
        "id": 153975606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531783081
    },
    {
        "content": "<p>If you have a fixed binding for a CodeableConcept, the value set expansion is not locked.</p>",
        "id": 153975607,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531783114
    },
    {
        "content": "<p>(One of the reasons why the use of the 'code' data type is important...)</p>",
        "id": 153975608,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531783131
    },
    {
        "content": "<p>That's fine for the data type section, but we also need to make it crystal clear in the binding strength section that all bindings, including 'Required', do not lock the value set expansion to a specific member set unless both the value set definition version and the code system version are also specified somehow in the specification.</p>",
        "id": 153975796,
        "sender_full_name": "Robert McClure",
        "timestamp": 1531845956
    },
    {
        "content": "<p>Could be multiple value set versions and code system versions.  But whether the value set is locked or not has no impact on the selection of binding strength or data type beyond what was added to talk about 'code'.  We could add a new section on the design of the value set to be bound (which can talk about extensional vs. intensional, lockedDate, version-specific references, etc.  And I don't know that we have specific methodologic guidance to offer here yet...</p>",
        "id": 153975818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531853168
    }
]