[
    {
        "content": "<p>To help us manage the different terminology assets that we have, we are currently proposing to append the resources with Meta tags to act as a \"category\" for the resource.<br>\nI see that both Code System and Value Set both have an element called \"usageContext\" - looking at it more closely, is this the intended use for this element? <br>\nThe element is currently marked as \"Trial Use\" - how stable is this with regards to R5?</p>",
        "id": 211512348,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1601308958
    },
    {
        "content": "<p>The only guidance I can give is that found noted regarding the <a href=\"http://build.fhir.org/metadatatypes.html#UsageContext\">UsageContext dataType</a> and I assume you already looked there, it's pretty wide open. But it does expect a code-value pair. Would the information noted on that data type align with what you want?</p>",
        "id": 211539376,
        "sender_full_name": "Robert McClure",
        "timestamp": 1601321783
    },
    {
        "content": "<p>this is on all definition resources. I think it's pretty stable - it's certainly widely used now. It's not normative because we didn't have that much use back then, and there's challenges around deciding how tight the vocabulary binding will be.</p>",
        "id": 211546148,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601324978
    },
    {
        "content": "<p>I haven't heard anyone raising issues with the structure</p>",
        "id": 211546178,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601324994
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I don't have any issues with the structure, it's just whether the \"tagging\" of the resources should be an intrinsic part of the resource or metadata. If we bring the tags within the resource it means when they are allocated (or change) then the resource will change version and that has consequences for us.</p>",
        "id": 211549822,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1601326885
    },
    {
        "content": "<p>I think you're answering your own question.  You would use usageContext if the tagging is a definitional characteristic of the resource.  You would use Meta.tag if it is instead just your local categorisation.</p>",
        "id": 211690951,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1601417144
    }
]