[
    {
        "content": "<p>Can we introduce a translation when defining a valueset? <br>\nFor example if we have a code #123 \"anytest\" but in an IG we want to add the translation for that code in pt-PT \"umtestequalquer\"<br>\nIs this legal?</p>",
        "id": 235554904,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619028140
    },
    {
        "content": "<p>First, do you mean can you provide an alternative description that uses a different language that is a <strong>translation</strong> for the code system provided description, then yes you can do that. The translated description is only valid for that value set.If you are talking about providing a <strong>mapping</strong> to a different code system, that is what conceptmap resource is for.</p>",
        "id": 235559810,
        "sender_full_name": "Robert McClure",
        "timestamp": 1619030104
    },
    {
        "content": "<p>I'm talking about the first one - the same code that is published in SNOMED but there is no local translation yet - while we trigger the process to make those translations part of the national SNOMED release, we can also have an IG that exposes the code and the local translations.</p>",
        "id": 235813534,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619171023
    },
    {
        "content": "<p>so in defining our valueset, we can add a new .designation to add a new translation, right?</p>",
        "id": 235813681,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619171108
    },
    {
        "content": "<p>we use the ValueSet approach for translation the concept into different languages <a href=\"http://fhir.ch/ig/ch-epr-term/ValueSet-DocumentEntry.practiceSettingCode.html\">example</a>, the other approach would be to define them in a <a href=\"https://www.hl7.org/fhir/codesystem.html#supplements\">CodeSystem supplement</a>, however I don't have yet any experience how that works with publishing ig's</p>",
        "id": 235825075,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1619177474
    },
    {
        "content": "<p>Yes, and you should use the designation.language for your translation</p>",
        "id": 235994449,
        "sender_full_name": "Robert McClure",
        "timestamp": 1619289748
    }
]