[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Suppose I want to contribute language translations for FHIR CodeSystems: where do I start? I know/knew what to do for V2/V3, but the FHIR CodeSystems do not appear to live in the GitHub source.</p>",
        "id": 158527299,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550149485
    },
    {
        "content": "<p>they do live in the source</p>",
        "id": 158603569,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550225102
    },
    {
        "content": "<p>there's 2 kinds of sources for the code systems - literal code system resources, and special ones in spreadsheets. What is a code system you want to provide translations for?</p>",
        "id": 158603602,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550225149
    },
    {
        "content": "<p>To start with the most common ones like AdministrativeGender, and the ones that have a required binding in resources we use</p>",
        "id": 158698949,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550329403
    },
    {
        "content": "<p>I'm trying to counter vendors that claim the don't have access to translations and so they cannot offer them to their users but all in all it's just more convenient for implementers to have them distributed in the core with Dutch rather than have every vendor do it themselves.</p>",
        "id": 158699042,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550329542
    },
    {
        "content": "<p>that code system is defined in bindings.xml, which is a spreadsheet. There's a syntax for defining language translations in the syntax, but I think it's time that we started using the FHIR machinery there</p>",
        "id": 158743589,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550409918
    },
    {
        "content": "<p>if you add a code system supplement named administrative-gender-[lang].xml (or .json) to the /terminologies directory with a canonical URL and id matching that file name, I'll update the tool to pick up the supplement</p>",
        "id": 158743645,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550410078
    },
    {
        "content": "<p>really, I should decompose all of the contained value sets / code systems out of bindings.ini</p>",
        "id": 158743707,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550410195
    },
    {
        "content": "<p>I've added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20401\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20401\">GF#20401</a>. Working on testing the supplement right now</p>",
        "id": 158821548,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550516405
    },
    {
        "content": "<p>So far I cannot get it build into anything in the publish folder. No error either. My expectation would be a link from the CodeSystem it supplements. Could a tooling issue be at play, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 158827318,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550522278
    },
    {
        "content": "<p>Should you want to try: I've attached the supplement the way I thought it would have worked to <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20401\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20401\">GF#20401</a>.</p>",
        "id": 158828577,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550523562
    },
    {
        "content": "<p>ok. Tooling doesn't support it at the moment - I'll have to do some work to pick it up and publish it</p>",
        "id": 158840719,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550538550
    },
    {
        "content": "<p>For the shorter term, we could have a look at my interpretation of what a supplement is supposed to look like. I've made a few assumptions after reading the spec that might not hold. Example:</p>\n<p>I've translated every single thing about the concepts. display, definition, extension comment. I've done this by just adding the translation in the same elements as the original codesystem, but added CodeSystem.language = 'nl-NL' to indicate that the whole supplement is \"Dutch as used in The Netherlands\"</p>",
        "id": 158912368,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550605415
    },
    {
        "content": "<p>Any explanation why you didn't use CodeSystem/concept/designation here? Even if  this might just be just a transfer file, to be integrated later in the \"source of truth\".</p>",
        "id": 158914496,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1550606743
    },
    {
        "content": "<p>My suggestion would be to separate translation of concept/designation from translating codeSystem metadata like definition here. Different peopel working on it, different workflow, different use case . One might also want to add metadata in a specific language <em>without</em> providing language-specific designations. Designations could also be audio files, images, videos... Metadata probably not.</p>",
        "id": 158915212,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1550607267
    },
    {
        "content": "<p>BTW: can a \"formal definition\" even be translated into another language? This is debatable, at least, unless we use formal logic languages for the definitions. Keep it simple.</p>",
        "id": 158915467,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1550607477
    },
    {
        "content": "<p>One way out of this would be to \"qualify\" translated formal definitions away from the \"real definitions\" in a similar fashion like display is different from designation. display always uses the original display value from the codeSystem origin.</p>",
        "id": 158915734,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1550607711
    },
    {
        "content": "<p>Well as this was my very first experience with a CodeSystem supplement I'm on a learning curve. I'm open to using designations for display if that is what should have been done. It was unclear to me from the specification.</p>\n<p>As for the separation of concern: the nature of a supplement is that it is an artifact under its own governance. It may be merged into the CodeSystem it supplements, but until that day it acts as separate entity. It would very much like the Dutch supplements to be part of the core CodeSystems, because it is my expectation that no one will find them or know how to handle them otherwise. The outcome is currently unspecified.</p>\n<blockquote>\n<p>One might also want to add metadata in a specific language without providing language-specific designations. </p>\n</blockquote>\n<p>Yes, that is what a supplement aims to do too and there is actually a fine example in the core spec to that end. I would have appreciated a translation example too so I was less in the dark there. Maybe my efforts for Dutch could lead to a proper example if anything.</p>\n<blockquote>\n<p>BTW: can a \"formal definition\" even be translated into another language? </p>\n</blockquote>\n<p>In SNOMED CT the formal definition is the hierarchy and the FSN. You can translate those too right, so why not? With CodeSystems and supplements it is always clear that the source-of-truth definitions are in the CodeSystem. Supplements should not override any semantics from the CodeSystem it supplements, but if they do it is clear which one is leading. Same is true in SNOMED CT extensions I'd say</p>",
        "id": 159051454,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550740078
    },
    {
        "content": "<p>It's always preferable to incorporate translations, properties, etc. in the source code system - but there's lots of reasons why the maintainer of a code system may not want to take that on.  Supplements provide a work-around when the author of the code system doesn't want to/can't maintain the extra stuff.  The meaning always comes solely from the CodeSystem.</p>",
        "id": 159078547,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550764267
    },
    {
        "content": "<blockquote>\n<p>In SNOMED CT the formal definition is the hierarchy and the FSN.</p>\n</blockquote>\n<p>That's an interesting call.  Technically (i.e., as per the spec) the \"meaning\" of a SNOMED CT concept comes from its FSN.  The associated modelling (hierarchy and properties defined via the Description Logic axioms) are \"only\" approximations; they may be incomplete or even just wrong. In fact for some sub-hierarchies (qualifier value) the meanings are deliberately context (usage)-specific.<br>\nFrom a purist sense then, it would be incorrect to have a translated FSN. From a pragmatic perspective, however, SNOMED does support translated FSNs.</p>",
        "id": 159560169,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1551307080
    },
    {
        "content": "<p>+1 for pragmatism then :-)</p>",
        "id": 159961469,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1551742137
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> when a supplement contains translations: this will be the first thing someone that cares about the translation looks at and consider it truth. The same way that translations of EULAs work: the master language/CodeSystem is the ultimate truth in case of doubt.</p>\n<p>It probably doesn't even matter whether or not the translation is in the CodeSystem itself or in a supplement. The Dutch/Japanese/Russian/... reader will consider the translation before the original language.</p>",
        "id": 159961650,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1551742284
    },
    {
        "content": "<p>well, I encountered some doctors who wanted to look at the verbatim narrative of their colleagues first, regardless of their original language. But that might be an exception.</p>",
        "id": 159964335,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1551744893
    },
    {
        "content": "<p>Depends a number of variables probably. Background knowledge of the doctor, how much time he has on his hands, the seriousness of the patient condition, ... When I look at the Dutch Apache license: I'm glad a I got through that and really don't want to reread in English. If I'm diagnosed with cancer in Spain: I'll get a dictionary and go through my Spanish doctors scribblings word for word regardless of a SNOMED CT codified Dutch translations right next to it.</p>",
        "id": 160519394,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1552339562
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> did you end up building any example CodeSystem supplements with translations? (that you can share)</p>",
        "id": 165015073,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1557173749
    },
    {
        "content": "<p>I added it to the ticket <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20401\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20401\">GF#20401</a> I believe</p>",
        "id": 165015412,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1557173966
    },
    {
        "content": "<p>Note there's a small error in the attachment: the content field should be <code>supplement</code> not <code>complete</code> (I'd comment on the ticket but I can't log in just at the moment)</p>",
        "id": 165018395,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1557176325
    },
    {
        "content": "<p>how can we contribute a pt-BR translation of this codesystem? <a href=\"https://terminology.hl7.org/3.0.0/CodeSystem-v2-0131.html\">https://terminology.hl7.org/3.0.0/CodeSystem-v2-0131.html</a></p>",
        "id": 272437606,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645208295
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"461422\">@Carlos Augusto Lima de Campos</span></p>",
        "id": 272437680,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645208339
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> ?</p>",
        "id": 272540386,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645302216
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <span class=\"user-mention\" data-user-id=\"461422\">@Carlos Augusto Lima de Campos</span> I think you should submit a UTG proposal and request adding the Brazilian Portuguese descriptions.  I don't know if we have any policy about which and how many languages should be included, and how that will work with the publication, but submitting and working through the approval and application of the UTG proposal I assume may generate some discussion on that.</p>",
        "id": 272540787,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1645302641
    },
    {
        "content": "<p>We have several German translations of some concepts, as they have been published in the v2 standards for many years.   We had a long discussion on the topic of such non-english language translations strings at a face to face WGM several years ago; a policy was not arrived at during that discussion.    The best way at the current time is as Rob H says: put in a UTG ticket to add them.</p>",
        "id": 272544615,
        "sender_full_name": "Ted Klein",
        "timestamp": 1645306995
    },
    {
        "content": "<p>I was expecting UTG to have its own Jira project but I can't find it in the dropdown.. Is this a FHIR ticket as usual (in which case I don't see UTG in the artifacts)?</p>",
        "id": 272575058,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645343995
    },
    {
        "content": "<p>I would think that we should do these with supplements (unlike the german ones which aren't due to grand-fathering issues)</p>",
        "id": 272585168,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645355714
    },
    {
        "content": "<p>Happy to move these German translations to supplements. This has been an outstanding task for HL7 Germany for a long time. It would be great if there was some documentation about what would be expected and where / how to submit content.</p>",
        "id": 272589400,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1645360283
    },
    {
        "content": "<p>We can try to initiate a supplement (for PT translation).  Where do we submit these supplements? </p>\n<ul>\n<li>To the core spec? We still need a Jira - against which part of the spec?</li>\n<li>To UTC? Where is that residing?</li>\n</ul>",
        "id": 272598591,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645370775
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/projects/UP/issues/\">https://jira.hl7.org/projects/UP/issues/</a></p>\n<p>NOTE: That it's not as simple as just raising an issue.  You need to raise the change request and then provide the actual files to make the change: <a href=\"https://confluence.hl7.org/display/VMAH/Vocabulary+Maintenance+at+HL7\">https://confluence.hl7.org/display/VMAH/Vocabulary+Maintenance+at+HL7</a></p>",
        "id": 272608555,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1645381993
    },
    {
        "content": "<p>I think using supplements for this makes sense - in FHIR.  But this is a V2 code system.  The UTG process and THO publication should be able to handle adding these descriptions as a supplement, because it uses the FHIR IG machinery.  But if there is expectation of using this in V2, then I'm thinking this isn't going to work - at least not yet, until V2 implementations are using FHIR terminology services to meet their terminology needs.</p>",
        "id": 272701215,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1645456677
    },
    {
        "content": "<p>what is the adoption process for v2 implementations of UTG?</p>",
        "id": 272743404,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645484953
    },
    {
        "content": "<p>is there a process to generate the v2 database from UTG?</p>",
        "id": 272743420,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645484967
    }
]