[
    {
        "content": "<p>Lloyd has just pointed out to me (though he didn't realise the implications) that I made an unapproved breaking change to the value set resource. in my defense... it was late and I was tired....</p>",
        "id": 153985767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534165994
    },
    {
        "content": "<p>you can see the change here: <a href=\"http://services.w3.org/htmldiff?doc1=http%3A%2F%2Fhl7.org%2Ffhir%2F2018May%2Fcodesystem-filter-operator.html&amp;doc2=http%3A%2F%2Fbuild.fhir.org%2Fcodesystem-filter-operator.html\" target=\"_blank\" title=\"http://services.w3.org/htmldiff?doc1=http%3A%2F%2Fhl7.org%2Ffhir%2F2018May%2Fcodesystem-filter-operator.html&amp;doc2=http%3A%2F%2Fbuild.fhir.org%2Fcodesystem-filter-operator.html\">http://services.w3.org/htmldiff?doc1=http%3A%2F%2Fhl7.org%2Ffhir%2F2018May%2Fcodesystem-filter-operator.html&amp;doc2=http%3A%2F%2Fbuild.fhir.org%2Fcodesystem-filter-operator.html</a></p>",
        "id": 153985768,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534166018
    },
    {
        "content": "<p>I renamed the <em>code</em> descendent-of  to descendant-of</p>",
        "id": 153985769,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534166030
    },
    {
        "content": "<p>this is a correct spelling fix, but the task under which I did that was an auto-approved typo fix, They don't apply to codes, only to narrative.</p>",
        "id": 153985770,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534166061
    },
    {
        "content": "<p>my error to accept a general search and replace...</p>",
        "id": 153985771,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534166075
    },
    {
        "content": "<p>Does vocab want to stay with the spelling corrected code, or revert to the original spelling?</p>",
        "id": 153985773,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534166107
    },
    {
        "content": "<p>I would vote for staying with the corrected spelling if we can.</p>",
        "id": 153985781,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534168129
    },
    {
        "content": "<p>Also agree that this should be approved with the correct spelling. Any idea of the technical impact to implementers and do we need to mitigate in some way? Give notice?</p>",
        "id": 153985796,
        "sender_full_name": "Robert McClure",
        "timestamp": 1534170839
    },
    {
        "content": "<p>well, I need to note the change in the list of substantive changes</p>",
        "id": 153985870,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534186888
    },
    {
        "content": "<p>There are a few other places that \"descendent\" is showing up (and it is a legitimate word, but it's an adjective rather than a noun).  I see it currently in fhirpath.md, codesystem/loinc.xml, v3/source.xml, v3/source_nl, v3/OID_Report.csv.  It's also in a few places in release2 and release3, but that shouldn't matter.  And it's also in spelling/english.dic.  I'm assuming that likely it should be removed from the dictionary to be able to catch the misspelling, and \"descendant\" is already there.  Happy to make a tracker and fix those if you want.</p>",
        "id": 153985893,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534190976
    },
    {
        "content": "<p>we can't fix it in codesystem/loinc.xml, v3/source.xml, v3/source_nl, v3/OID_Report.csv</p>",
        "id": 153985922,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534193823
    },
    {
        "content": "<p>or in release2 or release3</p>",
        "id": 153985923,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534193833
    },
    {
        "content": "<p>good to fix in fhirpath.md</p>",
        "id": 153985924,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534193846
    },
    {
        "content": "<p>Technically it's not a mis-spelling, it's only a less common spelling according to the various dictionaries I've looked at (but possibly skewed sample as I started my search with -ent)</p>",
        "id": 153985934,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534196483
    },
    {
        "content": "<p>In what I saw the most common understanding seemed to be that 'descendent' is generally (but not absolutely) considered to be the adjective (i.e. \"the descendent concepts\") and quite a bit less commonly used, and 'descendant' is the noun (i.e. \"the descendants of the concept\"), which is almost certainly what we were intending.  So you can kind of construe 'descendent ' to work, but being consistent with 'descendant' would seem to be best when we can do it.</p>",
        "id": 153986008,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534202626
    },
    {
        "content": "<p>Fixed spelling errors is among the things that made V3 so hard to work with. Your V3 wire format would change every release because of it, even if nothing else changed. <br>\nThis fix will add another if/then/else to systems that want to stay compatible with R4 and as much as possible before that. It will become ever more important to have the FHIR version pointed out in the meta to at least 'see' which version of ValueSet you are dealing with. Unfortunately there is some tool lag there, and at least until about a month ago a number would trip over that because the version profile string would not resolve.</p>\n<p>So in short: I'm not thrilled about breaking spelling fixes, especially if the thing that is fixed is not truly wrong or misleading, i.e. if the fix is for beautification.</p>",
        "id": 153986214,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1534223883
    },
    {
        "content": "<p>This would be the only breaking change to the value set wire format</p>",
        "id": 153986237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534231267
    },
    {
        "content": "<p>same for codeSystem.</p>",
        "id": 153986238,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534231306
    },
    {
        "content": "<p>that's enough to make me want to undo the change, and live with the spelling mistake</p>",
        "id": 153986239,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534231321
    },
    {
        "content": "<p>.. given that we can pretend it's not truly a spelling mistake ;-)</p>",
        "id": 153986241,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534231424
    },
    {
        "content": "<p>Somewhat related: is it possible to make the version strings in profile resolve? I think that would help tools that now trip over that. E.g.</p>\n<p><a href=\"http://hl7.org/fhir/3.0/StructureDefinition/ValueSet\" target=\"_blank\" title=\"http://hl7.org/fhir/3.0/StructureDefinition/ValueSet\">http://hl7.org/fhir/3.0/StructureDefinition/ValueSet</a></p>",
        "id": 153986242,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1534231521
    },
    {
        "content": "<p>it's on my task list but it's not critical for getting to ballot</p>",
        "id": 153986278,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534247426
    },
    {
        "content": "<p>it will happen though</p>",
        "id": 153986279,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534247445
    },
    {
        "content": "<p>ok. so Rob H &amp; Peter J voted for staying with the corrected spelling. I vote to go back to the wrong spelling, as does Alexander H. No other feedback - is there any chance we can close this out today? </p>\n<p>If I don't get any feedback, I'll use Product Directory perogative and reverse it as an unapproved changed that is breaking, and to normative content</p>",
        "id": 153986533,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534282470
    },
    {
        "content": "<p>I have a preference to fix it, but I'm not sure I count.  The fact it creates a conversion issue from R3 to R4 isn't a huge reason for me given there are other breaking changes.  Obviously if this was discovered later, we'd have had to live with it, but it was discovered in time and has already been fixed.  Breaking it again seems inappropriate.</p>",
        "id": 153986549,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534283605
    },
    {
        "content": "<p>Although I don't really have a horse in this race, I'll second Lloyd's position. We've responded to other objections about breaking changes by pointing out that DSTU/STU means things can break, and no compatibility is promised. And, if you are migrating resources from STU 3 to R4, this is going to be one of the easiest breaking changes to code for. My opinion is that we should change, and now is the opportunity to do it. </p>\n<p>(And maybe we should put an element name spell checker into the build to catch this earlier next time. <span class=\"emoji emoji-1f609\" title=\"wink\">:wink:</span> )</p>",
        "id": 153986552,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1534283965
    },
    {
        "content": "<p>We have done spell-checking on element names.  Doing on terminology is...painful</p>",
        "id": 153986554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534284024
    },
    {
        "content": "<p>Ah, right. Ouch.</p>",
        "id": 153986556,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1534284116
    },
    {
        "content": "<p>I've kind of been on the fence here...but it would be best for the spec to be consistent in its spelling and breaking changes are expected between STU3 and R4 (looking at our Ontoserver code there's about 6 lines that will need fixing and a dozen or so ValueSets, all of which are trivial), so if pushed I'd say make the fix</p>",
        "id": 153986558,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534284408
    },
    {
        "content": "<p>Lloyd mentions that are other breaking changes. Grahame mentioned this would be the only breaking change for ValueSet. I was also under the impression that ValueSet at FMM 5 would be more stable than other parts of STU3 &gt; R4. The fact that we are going to R4 doesn't open up every resource equally for breaking changes, does it?</p>\n<p>Sure it's tempting to fix a beautification issue, descendent-of is lesser common but legal English, but my day-to-day V3 work tells me that beautification is usually not worth a breaking change.</p>",
        "id": 153986572,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1534287583
    },
    {
        "content": "<p>If you consider \"descendent\" to be an adjective (which seems to be the majority view), then \"descendent of\" wouldn't be legal English.</p>",
        "id": 153986604,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534290795
    },
    {
        "content": "<p>Change it. But I too am not as affected as others</p>",
        "id": 153986624,
        "sender_full_name": "Robert McClure",
        "timestamp": 1534294236
    },
    {
        "content": "<blockquote>\n<p>The fact it creates a conversion issue from R3 to R4 isn't a huge reason for me given there are other breaking changes</p>\n</blockquote>\n<p>no other breaking changes for valueset and code system. Most other substantive changes back apply to value set.. this would mean that we can't have a common value set editor for r3/r4.... I think that some of you that say 'I am not affected' haven't thought this through</p>",
        "id": 153986646,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534296915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - I'd be happy if you made a Product-based call on this. That should override individual desires to fix a relatively minor grammatical error that probably wouldn't even make the top 500 modern offences against the English language.</p>",
        "id": 153986683,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1534302983
    },
    {
        "content": "<p>I think I'm going to. if nothing else, on procedural grounds, to save the ballot. I will launch the ballot with an explicit call for comments on breaking changes. And this will be the only breaking change on ValueSet (we have a couple on $expand). as such, existing implementers get to call on it; I would expect it will be negative... and so the ballot fails</p>",
        "id": 153986685,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534303403
    },
    {
        "content": "<p>though the committee overrules either way in the end... but I'm not hearing a strong opinion either way from the participants here or the co-chairs. So ping just in case committee wants to take the issue up or just accept the my product directors decision:<br>\n<span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191944\">@Russ Hamm</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"192038\">@Heather Grain</span> (+ <span class=\"user-mention\" data-user-id=\"191926\">@Joel Schneider</span> <span class=\"user-mention\" data-user-id=\"195650\">@Reuben Daniels</span> - incoming chairs I think it was)</p>",
        "id": 153986687,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534303596
    },
    {
        "content": "<p>I'm not sure I exactly followed what you said before - I think at first you said that you're going to make a product-based call on procedural grounds to save the ballot (which I presume means back out the change), and then you said at the end that \"this will be the only breaking change on ValueSet ... I would expect it will be negative ... and so the ballot fails\" (which sounds to me like you're leaving the change in and predicting what will happen).  So if you can clarify which yoiu meant, that would be helpful.  You're also asking the Vocab co-chairs (which I think is good).  Joel and Reuben are nominees rather than incoming yet - but I agree that they should be included.  I don't feel like I can say for sure which is the \"right\" choice.  My bias is to try to fix things and make them right - but only when it's reasonable to do so, which is the hard part.  I will say that if we're \"afraid\" (so to speak) to fix relatively small things like this even before we've actually gone normative, it makes the thought cross my mind that maybe we're pressing too hard to get to normative on this too fast.  But I also know why we want to get there and that there's potentially a significant cost to not getting there soon enough.  So I will be slightly disappointed if you back out the fix, and I expect that we may still want to change it in the future (which will be even more painful to decide), but I certainly can live with the decision either way.</p>",
        "id": 153986698,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534304914
    },
    {
        "content": "<p>careless verb tense on my part:</p>\n<blockquote>\n<p>this <em>would</em> be the only breaking change on ValueSet ... I would expect it will be negative ... and so the ballot fails</p>\n</blockquote>",
        "id": 153986701,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305024
    },
    {
        "content": "<p>that makes it clearer - thanks</p>",
        "id": 153986702,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534305163
    },
    {
        "content": "<p>I will summarise:</p>\n<ul>\n<li>we detected a breaking change introduced to a normative candidate that was made by an editor by mistake</li>\n<li>that editor happens to be me, but that shouldn't (nor has it,  I think) made any difference to process, which is:</li>\n<li>consult the committee to see whether the committee has a strong opinion that the change should <em>not</em> be reversed and intend to authorise it retrospectively</li>\n<li>in the absence of strong endorsement of the change by committee, reverse the change</li>\n<li>the committee can appeal the process - though I think it's reasonable, or rule on the change itself</li>\n</ul>",
        "id": 153986703,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305199
    },
    {
        "content": "<p>Based on our compatibility rules, the only case where we could make this fix after normative is if we had strong evidence that it hadn't actually been implemented and correcting it wouldn't impact the community - which is definitely not the case here.</p>",
        "id": 153986704,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534305253
    },
    {
        "content": "<p>oops. mssed a rather significant 'not' in there - edited to correct it</p>",
        "id": 153986705,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305253
    },
    {
        "content": "<p>yes that is clearly the case; don't fix now, never fix. There's no question about that</p>",
        "id": 153986706,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305278
    },
    {
        "content": "<p>If we don't fix it now, it will never be fixed.  (And any equivalent changes we haven't detected yet will also never be fixed.)</p>",
        "id": 153986707,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534305278
    },
    {
        "content": "<p>yes that too</p>",
        "id": 153986708,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305291
    },
    {
        "content": "<p>what I really don't like the most the way it is currently is that we're inconsistent - in some places we have descendant, and in others it's descendent (even though we intend for them to mean the same thing) - I don't think that's a good situation</p>",
        "id": 153986709,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534305298
    },
    {
        "content": "<p>but we'll never be able to do anything about that</p>",
        "id": 153986710,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305303
    },
    {
        "content": "<p>if I reverse the change, I'd note the spelling issue explicitly against the definition of the concept</p>",
        "id": 153986711,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305334
    },
    {
        "content": "<p>(and why it's being left, I presume?)</p>",
        "id": 153986712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534305360
    },
    {
        "content": "<p>y</p>",
        "id": 153986713,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305374
    },
    {
        "content": "<p>it's obviously good to note it, but I think it still will tend to be confusing and somewhat difficult to remember which one to use where</p>",
        "id": 153986714,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534305428
    },
    {
        "content": "<p>that's the grounds for changing it. yes. But if the committee wants to do that, it has to be very positive that making r3 value set not compatible with R4 value set is worth it. And I posit that we'll be carrying R3 profiling - and value sets- for a long time....</p>",
        "id": 153986715,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305498
    },
    {
        "content": "<p>and as product director, I care about the functionality of that area. We are not richly endowed with tools, and the IG editors will certainly support the notion that changing the conformance resources introduces a lot of pain.</p>",
        "id": 153986717,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305591
    },
    {
        "content": "<p>I don't feel that fixing this spelling mistake (which is a little equivocal) is a good investment on our part</p>",
        "id": 153986718,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534305647
    },
    {
        "content": "<p>again, to be clear now that I've thought about it a bit more, I care much more about the consistency in using the word than I do about which variation is actually the \"correct\" spelling</p>",
        "id": 153986723,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534305893
    },
    {
        "content": "<p>so reverse all the uses associated with the concept, and add a note to the concept...</p>",
        "id": 153986727,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534306031
    },
    {
        "content": "<p>and I agree it's true that R3 will be around a long time, but I think we all expect that R4 and then R5 or whatever we might have will be around even longer<br>\nand we do have the inter-version converters and have invested considerable effort in making them robust - and I think we could use ConceptMap for this (as well as other logic that could be applied)<br>\nbut I'm not really trying to advocate against your position, and I don't think I have much more to say on it</p>",
        "id": 153986731,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534306275
    },
    {
        "content": "<p>I will say one more thing, though - leaving inconsistencies like this in the spec (when we know they are there) to me makes us seem sloppy, at best (which isn't good)</p>",
        "id": 153986738,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534306822
    },
    {
        "content": "<p>It's an interesting dilemma.  Not fixing it amounts to treating the R3 (mis)spelling as normative, but removing the <code>descendent-of</code> code makes filter-operator into a misbehaving code system for those who have implemented it under R3.</p>\n<p>Is there any possibility a <code>descendant-of</code> code, synonymous with <code>descendent-of</code>,  could be added to the R3 filter-operator code system?  Is this intended to be a versioned or versionless code system?</p>\n<p>It seems we haven't yet identified anyone directly impacted by removal of the <code>descendent-of</code> code defined in R3.  Should that be a consideration?</p>",
        "id": 153986763,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1534312491
    },
    {
        "content": "<p>impacted: any tool that edits value sets or uses them (anyone in the IG publication business). value set authorities like VSAC, Art-Decor... Right now, they could have a single repository... but not with this change</p>",
        "id": 153986766,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534314001
    },
    {
        "content": "<p>adding a synonym? interesting idea... but I'm not sure how that plays out</p>",
        "id": 153986767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534314047
    },
    {
        "content": "<p>Based on the discussion so far (and particular the points made by Rob H, Lloyd And Michael L), I lean towards making the fix now.</p>",
        "id": 153986781,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1534322566
    },
    {
        "content": "<p>R3 was STU, breaking changes are part of the known risk in implementation. Yes, it was maturity level 5, but that doesn't preclude it from breaking changes until it goes normative (as far as I know). Though I am squeamish about the inconsistency of leaving other instances in the descendent-of state, not fixing this one because we can't fix the others doesn't seem right either. So, based on the discussion thus far, I vote to make the change now.</p>",
        "id": 153986826,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1534332626
    },
    {
        "content": "<p>As for ART-DECOR: we don't store as FHIR ValueSet. We generate. In the generation process I can switch to using descendant-of. It's doable if the meta.profile versioning system works so ValueSets on GitHub for example where they live as files can have version markers. Without working version markers, tools will have a harder time figuring out what's what.<br>\nMy fear is that we will have broken tooling for months to come over a spelling error in a code. Codes should not be treated as readable strings. That's what I like about OIDs and hold against URIs, and that's what I like about numeric/mnemonic codes and hold against readable codes. You should never have to discuss spelling errors in technical designators. Once issued they \"are\".</p>",
        "id": 153987061,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1534360372
    },
    {
        "content": "<p>Good points from <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> about codes as surrogate and immutable identifiers. As such one could argue that natural language spelling considerations simply don't apply to such identifiers.</p>",
        "id": 153987107,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1534367366
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> - would you release a second version of your value set editor for this change?</p>",
        "id": 153987108,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534367374
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> that's why I should never have made the change. I regret doing so now. <span class=\"emoji emoji-1f61e\" title=\"disappointed\">:disappointed:</span></p>",
        "id": 153987110,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534367415
    },
    {
        "content": "<p>well, maybe it's actually more appropriate to regret not using meaningless identifiers for codes<br>\nbut maybe there are sufficient advantages that we don't actually regret have chosen to use meaningful strings for codes - but the fact that we did does tend to lead to the occurrence of situations like this, as Alexander said</p>",
        "id": 153987118,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534367709
    },
    {
        "content": "<p>After discussion w/ Grahame and some digging, this is not actually a spelling \"error\".  There's a common spelling and a less common spelling.  Both are permitted.  I'm therefore less enthusiastic about making the change.</p>",
        "id": 153987119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534367722
    },
    {
        "content": "<p>the problem is more of the inconsistency in use (we have it both ways) rather than which is the \"correct\" spelling</p>",
        "id": 153987120,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534367794
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> do you think that VSAC will support R3 value sets, or R4 value sets, or both, if we make this change?</p>",
        "id": 153987121,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534367794
    },
    {
        "content": "<p>we could make them all consistently \"descendent\" if we wanted to (not sure why we would), but to do that some would still need to change</p>",
        "id": 153987122,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534367884
    },
    {
        "content": "<p>We've just had a discussion on this at the FMG meeting. Our leaning is to go with the original spelling, on the grounds that it is not \"wrong\" - it's just not as \"right\" as the corrected one, and that the downstream impacts of making the change significantly outweigh the value in making it. (There's no perfect answer unfortunately).</p>",
        "id": 153987123,
        "sender_full_name": "David Hay",
        "timestamp": 1534367901
    },
    {
        "content": "<p>especially given that this is a Normative candidate...</p>",
        "id": 153987124,
        "sender_full_name": "David Hay",
        "timestamp": 1534367928
    },
    {
        "content": "<p>Rob - every other use of the word that we have is narrative only. This is the only place where change means anything</p>",
        "id": 153987125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534367942
    },
    {
        "content": "<p>Our hope is that ballot voters will appreciate this position...</p>",
        "id": 153987126,
        "sender_full_name": "David Hay",
        "timestamp": 1534367955
    },
    {
        "content": "<p>FMG also discussed asking TSC to rule on this if the vocab co-chairs do ask to keep the change</p>",
        "id": 153987127,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534367970
    },
    {
        "content": "<p>as for conversion code: yes, it's true that 'we' have ode to convert between resources. that is: I maintain open source java code to do so (and use it extensively in the IG publisher and validator). I also maintain structuremap conversion routines between the versions.</p>",
        "id": 153987129,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534367996
    },
    {
        "content": "<p>I'm not sure that they actually will in the long run, as I've mentioned - but we can see</p>",
        "id": 153987130,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534368004
    },
    {
        "content": "<p>right</p>",
        "id": 153987131,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534368018
    },
    {
        "content": "<p>few people can make use of those. In fact, I am only aware of 2 other groups using either at this point, though  more people make use of the structure maps as documentation</p>",
        "id": 153987132,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534368038
    },
    {
        "content": "<p>more to the point, ROb, how would you use my conversion code to manage this change? I think that's not an easy answer</p>",
        "id": 153987133,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534368062
    },
    {
        "content": "<p>I guess the answer to that depends on exactly what needs to be converted  between R3 and R4 - it seems likely doable for resource instances (but presumably the terminology conversion would need to be added - at least I don't recall that it is already there)<br>\nbut it obviously wouldn't automatically fix issues for tool developers</p>",
        "id": 153987141,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534368298
    },
    {
        "content": "<p>As soon as we update snapper to support R4, we would update the handling of this code; we already do this type of thing for DSTU2.1 STU3 changes</p>",
        "id": 153987144,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534368424
    },
    {
        "content": "<p>so you would support R4 only? or both? if you support both, how would you support it?</p>",
        "id": 153987146,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534368475
    },
    {
        "content": "<p>I think something similar to what Michael just said is likely to be true for others (but I can't speak for them)</p>",
        "id": 153987147,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534368481
    },
    {
        "content": "<p>I just thought a little bit more about what David said: \"Our leaning is to go with the original spelling, on the grounds that it is not \"wrong\".  So, if it actually was \"wrong\" (i.e. if it was a misspelling that isn't truly a word rather than an unintended and inconsistent actual word that was chosen, that FMG then would be in favor of making the change (even with the arguments that have been raised)?  That seems like a rather weak position to me.  If you could make the change in the one case I think you could do it in the other.  And, if not, don't make the change in either case - just treat the strings as if they were meaningless identifiers.</p>",
        "id": 153987148,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534369096
    },
    {
        "content": "<p>An alternative proposal along the lines of what Grahame's comment that \"every other use of the word that we have is narrative only\" might imply would be to change it to be \"descendent\" in all of the other places so it's consistent.  If we're not unhappy (enough) with the <em>not as \"right\"</em> word, then I think that would actually be better.</p>",
        "id": 153987152,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534369527
    },
    {
        "content": "<p>it's your desire for consistency that puts the degree of mis-spelling on the table</p>",
        "id": 153987154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534369664
    },
    {
        "content": "<p>From the English perspective I'm not fond of it, and I think it would seem slightly weird, but at least it would be consistently weird.  And maybe we could claim that the Australians say it that way. :)</p>",
        "id": 153987156,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534369755
    },
    {
        "content": "<p>or is it New Zealanders? :)</p>",
        "id": 153987157,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534369771
    },
    {
        "content": "<p>Sorry, I couldn't quite resist that.  My preference is for both consistency and \"correctness\" - but if we can't have both we could at least have one?</p>",
        "id": 153987159,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534369834
    },
    {
        "content": "<p>we can say that the product director uses it that way ;-)</p>",
        "id": 153987160,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534369893
    },
    {
        "content": "<p>ok - that makes sense :)</p>",
        "id": 153987161,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534369909
    },
    {
        "content": "<p>I keep thinking that I'm going to say only one more thing (and maybe this will be it) - but if we find ourselves feeling uncomfortable with changing to use \"descendent\" in the narrative references (and I don't know that we do) that might tell us something.</p>",
        "id": 153987162,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534370116
    },
    {
        "content": "<p>We support both by detecting the FHIR version in the server when you Create/Update the ValueSet and then adjusting accordingly</p>",
        "id": 153987174,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534372330
    },
    {
        "content": "<p>I'm quite liking the invocation of the \"meaningless identifier\" angle; change the human facing description/display but leave the code itself alone.</p>",
        "id": 153987176,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534372974
    },
    {
        "content": "<p>The various code libraries could then decide whether to expose the identifier or the label as the Enum name</p>",
        "id": 153987179,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1534373050
    },
    {
        "content": "<p>I hadn't quite thought of it going to that full extent, but that may make the most sense<br>\nanother example of why Cimino was right :)</p>",
        "id": 153987180,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534373249
    },
    {
        "content": "<p>At the end of this discussion, I like it, too (and I already agreed with the principle).  And we may end up wanting to go farther down the \"meaningless identifier\" road in the future.  I'm not quite sure how that fits with \"normative\", but if it's handled in the code libraries maybe that works.</p>",
        "id": 153987192,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534374328
    },
    {
        "content": "<p>Meaningless identifiers in instances for things that developers will need to write 'switch' statements on isn't reasonable.  I'd much rather have typos in the specs for 50 years than have something like this appear in the code <code>case '98746112': ....</code></p>",
        "id": 153987198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534375155
    },
    {
        "content": "<p>That makes some sense.  I think for code systems and value sets that are expected to be used in logic such as 'switch' statements the codes can be readable.  But we will still want to treat them from a terminology perspective as meaningless identifiers (as where we seem to be landing in this current discussion).  That's likely the best \"middle ground\" position that I can see.</p>",
        "id": 153987204,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534375710
    },
    {
        "content": "<p>they are meaningless identifiers if you don't speak english. And we say that you SHOULD always show the display not the code (except for debugging purposes)</p>",
        "id": 153987240,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534378777
    },
    {
        "content": "<p>agree</p>",
        "id": 153987241,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534378806
    },
    {
        "content": "<p>they are meaningful only in that they orient you to the specification directly.</p>",
        "id": 153987242,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534378807
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> RE: R3/R4 support - I'll need to ask but FHIR support in general has been tangential to other work, so not well resourced. If I had to guess, suspect they will migrate to R4 and leave R3 behind.</p>",
        "id": 153987660,
        "sender_full_name": "Robert McClure",
        "timestamp": 1534443548
    },
    {
        "content": "<p>where as if we don't make this change... it won't matter</p>",
        "id": 153987722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534446212
    },
    {
        "content": "<p>ok I rolled this change back.</p>",
        "id": 153987915,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534462550
    },
    {
        "content": "<p>based on earlier premises I argued differently, but I'm happy with where we landed<br>\nthe code is still a little weird with the \"wrong\" word, but as a meaningless identifier that doesn't matter</p>",
        "id": 153987927,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534463128
    },
    {
        "content": "<p>it's one of those 'least worst' types of outcomes</p>",
        "id": 153987928,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534463183
    },
    {
        "content": "<p>And a case study in why standards development is not for the feint of hart. Every letter kinda matters.</p>",
        "id": 153988149,
        "sender_full_name": "John Carter",
        "timestamp": 1534480652
    }
]