[
    {
        "content": "<p>We're implementing US Core 4 and wondering what to use as the URI for value sets hosted by VSAC. Is there a designated strategy?</p>",
        "id": 261849707,
        "sender_full_name": "Mary Dobbins",
        "timestamp": 1637183419
    },
    {
        "content": "<p>The base canonical is set by VSAC, so here's an example: <a href=\"http://cts.nlm.nih.gov/fhir/ValueSet/2.16.840.1.113883.3.526.3.1240\">http://cts.nlm.nih.gov/fhir/ValueSet/2.16.840.1.113883.3.526.3.1240</a></p>",
        "id": 261862218,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1637189463
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Do I have to use REST API to find this? Is it as simple as using the name space <a href=\"http://cts.nlm.nih.gov/fhir/ValueSet/\">http://cts.nlm.nih.gov/fhir/ValueSet/</a> with the value set OID? Thanks for your help, Bryn.</p>",
        "id": 261938031,
        "sender_full_name": "Mary Dobbins",
        "timestamp": 1637247492
    },
    {
        "content": "<p>Yes, use that canonical base with the value set OID and that is the canonical URL for the ValueSet. The great thing about that is that because of the way VSAC publishes their FHIR API, it is _also_ the resolveable URL for the ValueSet, if you just click the link it will take you there (you need to provide your VSAC API Key).</p>",
        "id": 261939903,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1637248291
    },
    {
        "content": "<p>Yes, got it, thanks much, Bryn!</p>",
        "id": 261975070,
        "sender_full_name": "Mary Dobbins",
        "timestamp": 1637262629
    },
    {
        "content": "<p>One word of caution: That cts standard structure is true for all value sets you obtain from VSAC. Sometimes VSAC includes a value set that was defined someplace else and as of this moment, they have ignored the other canonical url. It is my understanding they plan to support replicating the non-VSAC url sometime in the future but for now, when they do this they are in essence creating there own value set that is a clone. </p>\n<p>That sounds more concerning than it is because VSAC users must assume that if you find the value set in VSAC, VSAC is the source of truth, but that assumption is dangerous over the long term.</p>",
        "id": 262154805,
        "sender_full_name": "Robert McClure",
        "timestamp": 1637373024
    },
    {
        "content": "<p>We provided some documentation around using vsac <a href=\"https://www.hl7.org/fhir/us/core/terminology.html#using-value-set-authority-center-vsac\">here</a> for US Core.  Was that not helpful?</p>",
        "id": 262332562,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637594352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , sure that is helpful. But the issue I'm raising has to do with situations where a value set with the same name, same content, shows up in multiple places and one of them is VSAC. And when VSAC starts hosting other value sets, we need to make sure it all works correctly. So far, particularly given the way we decided to handle the aligned C-CDA-USCore approach to race-ethnicity, gender identity, and particularly birth sex there could have been a problem. But we found a way around it. </p>\n<p>So no need to make changes to the text you reference for now.</p>",
        "id": 262361632,
        "sender_full_name": "Robert McClure",
        "timestamp": 1637607096
    }
]