[
    {
        "content": "<ol>\n<li><a href=\"http://build.fhir.org/ig/HL7/UTG/CodeSystem-v3-Race.html\">http://build.fhir.org/ig/HL7/UTG/CodeSystem-v3-Race.html</a> (OID: 2.16.840.1.113883.5.104)</li>\n<li><a href=\"http://build.fhir.org/ig/HL7/UTG/CodeSystem-PHRaceAndEthnicityCDC.html\">http://build.fhir.org/ig/HL7/UTG/CodeSystem-PHRaceAndEthnicityCDC.html</a> (OID: 2.16.840.1.113883.6.238)</li>\n<li><a href=\"http://build.fhir.org/ig/HL7/UTG/CodeSystem-v2-0005.html\">http://build.fhir.org/ig/HL7/UTG/CodeSystem-v2-0005.html</a> (OID: 2.16.840.1.113883.6.238)</li>\n</ol>\n<p>The first doesn't use the same OID that is used in CCDA and FHIR (2.16.840.1.113883.6.238) the other 2 do but don't enumerate any codes.  Can somebody unpack this for me.</p>",
        "id": 242645695,
        "sender_full_name": "Eric Haas",
        "timestamp": 1623698026
    },
    {
        "content": "<p>ping on this? how do I escalate this to HTA?</p>",
        "id": 242809527,
        "sender_full_name": "Eric Haas",
        "timestamp": 1623797446
    },
    {
        "content": "<p>Here is my shot <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  :<br>\nThe official US CDC (ergo OMB) Race and Ethnicity (ie: both Race - big, and Ethnicity - small) unified code system has OID: 2.16.840.1.113883.6.238 and the source of truth is <a href=\"https://phinvads.cdc.gov/vads/ViewCodeSystem.action?id=2.16.840.1.113883.6.238\">at PhinVads</a>. THO (published versions and CI)  has all sorts of historical and current crap. </p>\n<ul>\n<li>The first item that has v3-race in the name is likely from MIF when we replicated stuff,  in this case creating a \"code system\" that is the Race part of Race and Ethnicity. Please do not use this if possble and we really should Depricate that - if we only had a way... </li>\n<li>The second is the real McCoy, is only a stub in THO because the SOT is phinvads as noted above. But yes, we need the actual codes to do things so it <em>should</em> be in <a href=\"http://tx.fhir.org\">tx.fhir.org</a>, or we should replicate content in THO to make it complete <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> ? </li>\n<li>The third is more old stuff, this time the V2 code system that was created to align with the V2 table (0005) that contained the CDC race and Ethnicity content. SInce that table was meant to be real CDCREC codes apparently they put in <em>the same real CDCREC OID</em> for the v2-0005 table code system. So this cluster has the v2 code system url but the OID from the real McCoy. Again - obviously - avoid using this like the plague and perhaps PA (<span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> ) will need help us to depricate this one and get V2 to use the proper code system. </li>\n</ul>\n<p>We love terminology! <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span></p>",
        "id": 242811884,
        "sender_full_name": "Robert McClure",
        "timestamp": 1623799313
    },
    {
        "content": "<p>thanks for the history.   I bring this up because US Core and <span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span>  guides are getting qa errors because the terminology serve can't find the codesystem. We removed the locally created code system from the current release of US Core ver 3.2.0 soon to be 4.0.0 since we are using VSAC and THO for the R&amp;E valuesets.   We are pushing to publish US Core ASAP and have a couple of options...</p>\n<ol>\n<li>We can put the code system back in US Core like in the current published version and maybe Sarah can use that for now.</li>\n<li><a href=\"http://build.fhir.org/ig/HL7/UTG/CodeSystem-PHRaceAndEthnicityCDC.html\">http://build.fhir.org/ig/HL7/UTG/CodeSystem-PHRaceAndEthnicityCDC.html</a> (OID: 2.16.840.1.113883.6.238) can be fixed to enumerate the codes if there is anything the US Core team can do facilitate this let us know.</li>\n</ol>\n<p><span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span>  and <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  FYI</p>",
        "id": 242817587,
        "sender_full_name": "Eric Haas",
        "timestamp": 1623804324
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> not all completely accurate.    The table 0005 had from HL7 Version 2.2 more than 25 years ago the top level concept software the hierarchy as required by the V2 messaging and V2 guides.   At that time CDC did not yet have a glimmer of PHINVADS, and I still have the email agreements= between CDC and Stan Huff/Jim Cimino et al to republish them for CDC.   They 'took them back' when PHINVADS was stood up.   If you look closely at the v2 table 0005 as of V2.9 and in THO, the content is informed BY A VALUE SET OF ONLY THOSE TOP LEVEL CODES.   The v2 mgt and publishing policy is that the underlying code system of the value sets where the table content is informed by a single code system is also published as implementers must populate the code system ID in the coded datatypes in V2 (which did not have identifiers for the value sets until 2.6).</p>",
        "id": 242823075,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623810114
    },
    {
        "content": "<p>I have agitated for YEARS that we need to have an agreement with CDC to publish the content for this that is needed by the HL7 implementation community for the HL7 standards, and now for load of <a href=\"http://tx.fhir.org\">tx.fhir.org</a> since PHINVADS does not (as of the last time I checked) have an effective usable FHIR API for the HL7 community to make use of.</p>",
        "id": 242823142,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623810196
    },
    {
        "content": "<p>We have relatively small effort to get this all straightened out and fixed, but we lack policy and will to do so, and lack decisions to make it so.</p>",
        "id": 242823193,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623810243
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>  - regarding the v2 table 0005 - Can you tell me what the elipses and \"see chapter 3\" means wrt additional content for that value set?  Yes, other than that the few codes are indeed the upper level categories but the elipses mean?</p>",
        "id": 242898429,
        "sender_full_name": "Robert McClure",
        "timestamp": 1623857705
    },
    {
        "content": "<p>It is going to be extraordinarily challenging to not swear here <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> ...sigh...the ellipses mean that I LOST the argument a year and a half ago with the v2 management and v2 publishing groups that fecal matter in the code systems to represent historical human-readable commentary in the pdf document of the Standard that is not and can not be actual terminology elements absolutely do not belong in there.    I removed it and was berated and lambasted because the content no longer reflected exactly what is in the v2 published table 0005 for nearly 3 decades.    As the vocabulary WG did not really want to get involved at that time, I was forced to put it back over my strenuous objections.  IMHO it absolutely should be removed and absolutely does not belong there.    Neither do the 5 codes which are top level categories from the CDC code system.  The second argument I argued and lost was that those numeric codes absolutely should not be in the underlying code system; the value set informing the table content should include those codes from the CDC code system.   But...in order for them to be rendered by the Publisher in the THO and IGs that reference this content, the value set could not be expanded as the CDC content is not in FHIR core nor <a href=\"http://tx.fhir.org\">tx.fhir.org</a> (as it is US only and there are many other issues with this code system wrt the international community).    The way it SHOULD be is that the content should be in a negotiated stub with content subset (only the five top level codes) like we do with SNODENT with a MOU between HTA and CDC, the HL7 code system should be retired with commentary that it was erroneous to support very old versions of v2 and is there in the retired section only for historical entertainment, and the value set should include the codes from the code system as it should.  HTA has not wanted to deal with this US-only stuff.  The very old version of the value set with the alpha characters (which were published once only 30 years ago in HL7 v2.0) should also be retired and the proper value set which is both accurate and correct and properly supports the needs of the US Realm be in THO.    Note that the pressure to keep these alpha codes was due to many vendor systems implementing the codes in the 1990 and 2000 US census forms even though OMB never formall published them as a code system.  But no one seems to want to be bothered to do these fixes, or even to understand the issues and solutions, much less do the work to make it right.   Good luck, Mr. Phelps.</p>",
        "id": 242947055,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623879753
    },
    {
        "content": "<p>if v2 is not using the actual code system, why don't we just give them their own fake code system, and fix it up for everyone else?</p>",
        "id": 242947970,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623880303
    },
    {
        "content": "<p>they are but they had insisted that I accurately reflect the ancient history in the THO code system.  Sigh.    IMHO some who is torqued about the issue should just put in a UTG UP ticket to fix it and the community consensus will make it so regardless of opinions of others.  :-)</p>",
        "id": 242955210,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623885351
    },
    {
        "content": "<p>remove old codes and document as ancient history saved for the archaeologists, and just create the stub for CDC codes and put on the HTA queue to work out the agreement and put a fork in it and move on. :-)</p>",
        "id": 242955300,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623885409
    },
    {
        "content": "<p>Much harder to get understanding and agreement than to just put in the fix. :-)</p>",
        "id": 242955354,
        "sender_full_name": "Ted Klein",
        "timestamp": 1623885464
    },
    {
        "content": "<p>let them have a THO code system, just a different one</p>",
        "id": 242956552,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623886434
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191982\">Ted Klein</span> <a href=\"#narrow/stream/179202-terminology/topic/US.20CDCREC.20codessystems.20in.20HTA/near/242955210\">said</a>:</p>\n<blockquote>\n<p>they are but they had insisted that I accurately reflect the ancient history in the THO code system.  Sigh.    IMHO some who is torqued about the issue should just put in a UTG UP ticket to fix it and the community consensus will make it so regardless of opinions of others.  :-)</p>\n</blockquote>\n<p>Thanks for explaining this convoluted and tortured history.  We ( US Core team ) will be following up on this...</p>",
        "id": 242960417,
        "sender_full_name": "Eric Haas",
        "timestamp": 1623889738
    },
    {
        "content": "<p>and USPS</p>",
        "id": 242961625,
        "sender_full_name": "Eric Haas",
        "timestamp": 1623890974
    }
]