[
    {
        "content": "<p>The CodeSystem.compositional element indicates whether the CodeSystem defines a post-composition grammar.  (The HL7 version 3 core principles document seemingly uses the term post-coordination rather than post-composition for this.)</p>\n<p>The FHIR documentation on <em>Using Codes in Resources</em> currently doesn't discuss usage of a post-composition grammar.<br>\n<a href=\"http://build.fhir.org/terminologies.html\" target=\"_blank\" title=\"http://build.fhir.org/terminologies.html\">http://build.fhir.org/terminologies.html</a></p>\n<p>Some questions about usage of post-compositional expressions in FHIR ...</p>\n<p>1. May post-compositional expressions be used in places where FHIR requires a coded value (code)?  If so, what binding strength should be used in cases where post-compositional expressions are allowed (required, extensible, etc.)?</p>\n<p>2. Is there a standard terminology service operation for validating post-compositional expressions?  If not, should there be one?</p>\n<p>3. Is it possible to use a post-composition grammar with a ValueSet that contains concepts from multiple code systems?</p>",
        "id": 153910851,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1506478239
    },
    {
        "content": "<p>Binding strength won't influence post-coordination support.  The value set will decide whether (and which) post-coordinated expressions are allowed.  To my knowledge, we don't have any \"core\" mechanisms to control that.  If you define a value set that says \"all SNOMED CT procedure codes with a body site of lung\", by default that means every pre-coordinated and every possible post-coordinated code that fits those criteria.  We probably should have extensions that provide more control.  There is an ability to have control over post-coordination when you generate an expansion using the ExpansionProfile resource, though there it's a \"include/exclude post-coordinated concepts\" - there's no fine-grained control that would support some types of post-coordination and not others.</p>",
        "id": 153910858,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506483405
    },
    {
        "content": "<p>it's a filter property for snomed - one property, on or off, because mostly that's how servers work - they either support it or dont</p>",
        "id": 153910902,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1506495108
    },
    {
        "content": "<p>Ok, post-coordinated expressions are allowed in coded values.</p>\n<p>Can the validity of a post-coordinated expression be verified using the ValueSet/$validate-code operation?</p>",
        "id": 153911001,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1506522537
    },
    {
        "content": "<p>Another way to phrase that is, would it be non-conformant if I implemented a ValueSet/$validate-code operation capable of validating a post-coordinated expression?</p>",
        "id": 153911010,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1506524065
    },
    {
        "content": "<p>if a code system defines a post-coordinated grammar, then the terminology servers should fully support that grammar if they claim to support the code system, and that would include properly understanding it in $validate-code.</p>",
        "id": 153911076,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1506546554
    },
    {
        "content": "<p>We're working on a new resource that allows a terminology server to declare it's capabilities, and that is expected to allow a server to declare that it supports a code system without implementing the grammar</p>",
        "id": 153911078,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1506546615
    },
    {
        "content": "<p>I don't think \"post-composition\" is the intended term (or even valid).  The phrase should be either \"compositional grammar\" or \"post-coordination grammar\", I believe, and we should fix the definition of CodeSystem.compositional to reflect that and avoid confusion.  If there is general agreement on that I can create a tracker.</p>",
        "id": 153911088,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1506548738
    },
    {
        "content": "<p>I agree with that</p>",
        "id": 153911095,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1506549394
    },
    {
        "content": "<blockquote>\n<p>We're working on a new resource that allows a terminology server to declare it's capabilities, and that is expected to allow a server to declare that it supports a code system without implementing the grammar</p>\n</blockquote>\n<p>It will be interesting to see what might be required to implement SCT Grammar.  At present, it's possible to place expression constraints as filters in ValueSet composition statements, display normalForm expressions as $lookup properties and validate post-coordinated expressions in codes...but I'm not sure what else?  I guess that it's possible to place expression constrains in the filter parameter that's passed to $expansion operation requests, but I'm not certain if that's good practice and/or we're still waiting for the SCT Query Language to be published (2018) before adding a dedicated parameter for requests based on that dialect.</p>",
        "id": 153911129,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1506558356
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> for the explanation of grammar support in $validate-code.</p>",
        "id": 153911135,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1506572349
    },
    {
        "content": "<p>My last question on this may be unusual ...</p>\n<p>Suppose I have 2 CodeSystem resources, both of which utilize the same post-coordinated grammar, and a ValueSet composed of codes from both of them.   Would it be valid to construct a post-coordinated expression composed of codes from both systems?  Would it be reasonable to expect the ValueSet/$validate-code operation to handle such an expression?  Would this only make sense under special circumstances (e.g. as a $validate-code \"extension\")?</p>",
        "id": 153911136,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1506572473
    },
    {
        "content": "<p>You could only mix and match across the code systems if the grammar of one or both code systems allowed that.  An example of where this occurs is the IETF language codes whose post-coordinated syntax includes codes from the ISO country code table.</p>",
        "id": 153911139,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506573916
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, that's good to know.</p>",
        "id": 153911241,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1506608105
    },
    {
        "content": "<p>and if they did define that, you'd be expected to support it if you supported the grammar</p>",
        "id": 153911999,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507009593
    }
]