[
    {
        "content": "<p>We're looking at using ConceptMap to exchange mappings between systems.  As part of this, we'd like to be able communicate 1) how often that mapping was used and 2) how recently the mapping was used.  Currently we're considering extensions on ConceptMap, but I'm curious if folks have ideas on either a better way to communicate this via FHIR, and if not, should I submit this as a GF ticket.  Calculated data like this sort of feels like an operation, however it would be much simpler to just use an extension, so I'm interested in thoughts on the question of \"purity\" vs. \"practicality\".</p>",
        "id": 169875905,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1562597323
    },
    {
        "content": "<p>Extensions seem like probably the way to go for this.  But usage statistics could potentially be applied quite broadly, so it might be good if there was a more general solution (than for ConceptMap alone).</p>",
        "id": 169878306,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1562599094
    },
    {
        "content": "<p>Can you explain more about what you mean by 1 &amp; 2 - specifically: a) are you looking for dynamic statistics aggregated by a specific terminology server, and b) by \"mapping\" do you mean a specific source-target pair within a ConceptMap, or at the ConceptMap level?</p>",
        "id": 170409657,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1562627065
    },
    {
        "content": "<p>In our system, we have an internal representation of a mapping table.  We also have some information about when that mapping table is used.  For example, if we are sending an HL7v2 ORU message, and we use our mapping table to map a procedure to a LOINC code, we could track that.  So internally, we have information about how often we map each procedure.  This can be used to help prioritize mapping.  We are now looking at using ConceptMap to communicate the mapping table to other parties, and want to include the frequency information so they can prioritize which procedures (for example) to map first.</p>",
        "id": 170468127,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1562689517
    }
]