[
    {
        "content": "<p>We're getting direction to use OIDs in FHIR to facilitate translation to/from CDA. Not crazy about it. Considering duplicating the coding in CodeableConcept, once with a system OID and once with a URL. Thoughts?</p>",
        "id": 250501681,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629818763
    },
    {
        "content": "<p>Using OIDs in FHIR is strongly discouraged.  First, CDA is going to <em>have</em> to translate from OIDs to URLs in all cases where an official URL has been defined (e.g. LOINC, SNOMED, UCUM, ICD, etc.).  As a result, the infrastructure to perform translation is going to have to exist regardless.  Second, the NamingSystem resource makes it easy to computably share and maintain the expected mappings.  Most importantly, FHIR moved from OIDs to URIs for a reason - OIDs suck for implementers.  They're hard to read, meaningless, impossible to look up and easy to get wrong.  Saving money on migration only to have ongoing costs to developers, testers, debuggers and everyone else who needs to look at the raw instances is rarely going to make sense in the long term.  Better to incur a bit of extra cost in the short term and save money in the long term.</p>",
        "id": 250502847,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629819247
    },
    {
        "content": "<p>Agree, agree, and agree. And I'll tell anyone who will listen. Meanwhile, would an opinion on the multiple codings be considered a concession?</p>",
        "id": 250513551,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629823889
    },
    {
        "content": "<p>Another tack: V3 data types stipulate that RUIDs must be OIDs or UUIDs, but also states \"HL7 also reserves the right to assign other forms of UIDs (RUID), such as mnemonic identifiers for code systems.\"</p>\n<p>What are the odds of HL7 exercising this right and admitting HTTP URLs?</p>",
        "id": 250513670,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629823928
    },
    {
        "content": "<p>Sorry, missed the bit with multiple codings.  There should only be one URI allowed for use for a given system.  Expressing the same coding with multiple URIs is non-conformant for anything that has an official URI and would certainly be strongly discouraged elsewhere.</p>",
        "id": 250522446,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629827615
    },
    {
        "content": "<p>The odds of it happening for any common public code system used internationally or in the U.S. is quite good.  For something like \"Hospital XYZ lab codes\", the odds are zero.</p>",
        "id": 250522596,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629827668
    },
    {
        "content": "<p>Well, maybe there should be one, but many have two. E.g., <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a> &amp; 2.16.840.1.113883.6.96.</p>",
        "id": 250523609,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629828120
    },
    {
        "content": "<p>if you have to put OIDs in the resources, then the extension <a href=\"http://hl7.org/fhir/StructureDefinition/iso21090-CD-codeSystem\">http://hl7.org/fhir/StructureDefinition/iso21090-CD-codeSystem</a> is there to use</p>",
        "id": 250524765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629828678
    },
    {
        "content": "<p><code>urn:oid:2.16.840.1.113883.6.96</code> would be non-conformant if it appeared in a FHIR instance.  The SNOMED code system MUST be identified with the \"<a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>\" URI if the instance is to be considered conformant.  There's no allowance for sending multiple codings with different systems.</p>",
        "id": 250526021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629829217
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179202-terminology/topic/Using.20Coding.20as.20a.20handy.20NamingSystem.20shortcut/near/250524765\">said</a>:</p>\n<blockquote>\n<p>if you have to put OIDs in the resources, then the extension <a href=\"http://hl7.org/fhir/StructureDefinition/iso21090-CD-codeSystem\">http://hl7.org/fhir/StructureDefinition/iso21090-CD-codeSystem</a> is there to use</p>\n</blockquote>\n<p>Hmm, I couldn't find that extension (the link you gave also doesn't work).</p>",
        "id": 250527870,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1629830048
    },
    {
        "content": "<p>no it hasn't been instantiated, but it's the correct extension to use</p>",
        "id": 250528941,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629830500
    },
    {
        "content": "<ol>\n<li>Interesting. Is that generalizable to any 21090 property? How is type resolved?</li>\n<li>By what criterion do we choose that rather than using two codings?</li>\n<li>\"The SNOMED code system MUST be identified with the \"<a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>\" URI if the instance is to be considered conformant.\" Because that's what's in SI's 'canonical' url property?</li>\n</ol>",
        "id": 250545430,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629837611
    },
    {
        "content": "<p>1 - leaving that to <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>...<br>\n2 - two codings isn't conformant, using an extension is? :)<br>\n3 - correct.  It's also the URL that appears here: <a href=\"http://build.fhir.org/terminologies-systems.html\">http://build.fhir.org/terminologies-systems.html</a></p>",
        "id": 250546258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629838008
    },
    {
        "content": "<p>yes it's generalisable, though many 21090 properties have direct FHIR maps, and aren't appropriate to use</p>",
        "id": 250546578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629838136
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> can you expand on what you mean?  I don't think there's any 'magic' that allows referencing 21090 extensions that haven't yet been defined.  So what I <em>think</em> you're saying is \"we've created extensions like this in the past, and it would be appropriate for us to define this one for that purpose\".  Is that accurate?<br>\nMy personal leaning is we might be better off defining a slightly less esoterically named extension that would work for both code systems and naming systems if we need to go through the work of defining one for use in R5 (and pre-adopting it in prior versions).  Would that make mores sense?</p>",
        "id": 250547561,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629838583
    },
    {
        "content": "<p><a href=\"https://hl7.org/fhir/iso-21090.html\">https://hl7.org/fhir/iso-21090.html</a> - is ambiguous about this. I intended that people could just use any of the implied extensions, and we'd describe things as they were useful, but the page doesn't actually say that. it implies it:</p>\n<blockquote>\n<p>At the present time, this profile is incomplete. It only contains extensions reflecting capabilities that have been explicitly identified as \"useful\" in the context of FHIR</p>\n</blockquote>",
        "id": 250547940,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629838781
    },
    {
        "content": "<p>it really feels like a dilbert thing: the standard implies that the unidentified extensions are implied to exist</p>",
        "id": 250548086,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629838826
    },
    {
        "content": "<p><a href=\"https://community.automox.com/t/favorite-dilbert-comic-strip/688\">https://community.automox.com/t/favorite-dilbert-comic-strip/688</a></p>",
        "id": 250548185,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629838866
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179202-terminology/topic/Using.20Coding.20as.20a.20handy.20NamingSystem.20shortcut/near/250546258\">said</a>:</p>\n<blockquote>\n<p>2 - two codings isn't conformant, using an extension is? :)</p>\n</blockquote>\n<p>Could be right, but it seems a little circular to me. What makes it nonconformant?</p>",
        "id": 250553721,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629841573
    },
    {
        "content": "<p>You'd be using a system URI other than the permitted one for that code system</p>",
        "id": 250555763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629842642
    },
    {
        "content": "<p>My reading of the 21090 section is \"we'll add more extensions as they're needed\", not that \"you're free to pretend that the extensions you want exist\".  So, if there's a desire to send the OID in addition to the approved URI, I think the next step is to submit a Jira issue and we'll figure out if we want to create a 21090 extension or a different extension.</p>",
        "id": 250556712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629843209
    },
    {
        "content": "<p>I totally and implicitly trust you. But I will need to argue, so I'm looking for some writing that says that this is not permitted, or not conformant, etc.  Does this writing exist?</p>",
        "id": 250561393,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629846200
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/terminologies-systems.html\">http://hl7.org/fhir/terminologies-systems.html</a> : If a URI is defined here, it SHALL be used in preference to any other identifying mechanisms.(2nd sentence)<br>\nAnd SNOMED is listed on that page.</p>",
        "id": 250563558,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1629847913
    },
    {
        "content": "<p>That helps. But it still doesn't say you can't have two.</p>",
        "id": 250574878,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629859583
    },
    {
        "content": "<blockquote>\n<p>The concept may be coded multiple times in different code systems (or even multiple times in the same code systems, where multiple forms are possible, such as with SNOMED CT).</p>\n</blockquote>",
        "id": 250575047,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629859849
    },
    {
        "content": "<p>Sure. It can be coded multiple times.  And it can be coded multiple times with SNOMED CT.  However <em>each time</em> it is coded, the URI defined for SNOMED CT must be used.  The line Jean quoted doesn't say \"one of the codings needs to use this URI\".  It says the URI SHALL be used.  The statement is evaluated on Coding.system, not at any higher level.</p>",
        "id": 250576163,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629861412
    },
    {
        "content": "<p>If you want to send the SNOMED OID along for the ride, you can certainly stick it in an extension, but you can't stick it in Coding.system and be conformant.</p>",
        "id": 250576185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629861471
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I honestly think you're overstating the case here. Let's consider this:</p>\n<div class=\"codehilite\" data-code-language=\"JSON\"><pre><span></span><code><span class=\"p\">{</span>\n  <span class=\"nt\">\"resourceType\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Condition\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"code\"</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">\"coding\"</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n      <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://snomed.info/sct\"</span><span class=\"p\">,</span>\n      <span class=\"nt\">\"code\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"39065001\"</span>\n    <span class=\"p\">},</span> <span class=\"p\">{</span>\n      <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"urn:oid:2.16.840.1.113883.6.96\"</span><span class=\"p\">,</span>\n      <span class=\"nt\">\"code\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"39065001\"</span>\n    <span class=\"p\">}]</span>\n  <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>",
        "id": 250576760,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629862262
    },
    {
        "content": "<p>technically, this is a coding represented once in snomed, and once in some other unknown coding system that just happens to look a lot like snomed ct.</p>",
        "id": 250576781,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629862301
    },
    {
        "content": "<p>if you look up the OID, you'll find SCT, along with the rule that if it's SCT then it's represented with <code>http://snomed.info/sct</code> - which it's not. So it's not SCT, and you don't recognise it. Unless you look it up. That feels like a schrodinger's paradox ;-)</p>",
        "id": 250576837,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629862376
    },
    {
        "content": "<p>so it's not that I disagree with Lloyd, I think it's just not right to state it so strongly.</p>",
        "id": 250576858,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629862415
    },
    {
        "content": "<p>really, this is much clearer:</p>",
        "id": 250576860,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629862420
    },
    {
        "content": "<div class=\"codehilite\" data-code-language=\"JSON\"><pre><span></span><code><span class=\"p\">{</span>\n  <span class=\"nt\">\"resourceType\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Condition\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"code\"</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">\"coding\"</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n      <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://snomed.info/sct\"</span><span class=\"p\">,</span>\n      <span class=\"nt\">\"code\"</span> <span class=\"p\">:</span> <span class=\"nt\">\"39065001\"</span>\n      <span class=\"nt\">\"extension\"</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n        <span class=\"nt\">\"url\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://hl7.org/fhir/StructureDefinition/iso21090-CD-codeSystem\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"valueCode\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"2.16.840.1.113883.6.96\"</span>\n    <span class=\"p\">}]</span>\n  <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>",
        "id": 250576993,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629862611
    },
    {
        "content": "<p>it has the serious advantage that if you don't know about the OID, and don't care, you won't notice, where as having a second coding will immediately cause confusion for anyone processing the data.</p>",
        "id": 250577009,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629862641
    },
    {
        "content": "<p>It has nothing to do with \"if you recognize it\".  If you have no clue what the code system is and blindly spit out the CDA OID with a urn:oid: in front of it, you're non-conformant.  The language doesn't say \"if you recognize what code system you're dealing with\".  It says \"If a URI is defined here\".  That's the only qualifier.  In reality, there'll be some systems that won't try to look up the OID or won't have the capacity.  Their FHIR instances will be non-conformant.  I don't think the spec gives any wiggle-room - and I don't think it should.  The extension example above meets the use-case and is fully conformant - aside from the fact that the extension isn't defined yet and thus is technically invalid, which is something we can fix.</p>",
        "id": 250577030,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629862683
    },
    {
        "content": "<p>\"SHALL be used\": I think the two-coding pattern does that. The level at which the SHALL is applied is not specified. This is a bit like an open world specification problem, where you can satisfy a requirement with one instance without securing that constraint to other instances. Lloyd's \"each time\" language makes sense, but if that's what's intended, I'd recommend the guidance use that language.</p>",
        "id": 250610009,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629893022
    },
    {
        "content": "<p>Funny how we've danced around this issue for years and then in this thread we seem to come to an approach that would allow a system to create and accept multiple identifiers for a code system <strong>if we clarify what extension can support this.</strong> I'm loving this and think it should also apply to the code system resource. <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span></p>\n<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> Can you submit a tracker?</p>",
        "id": 250612511,
        "sender_full_name": "Robert McClure",
        "timestamp": 1629894576
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> If you genuinely feel it's unclear, you could submit a change request for it to be clarified, but given that the existing language doesn't talk about CodeableConcept, doesn't talk about \"at least one Coding\" or provide any other suggestion that exceptions are allowed, I don't see how it could be interpreted any other way.  And it's certainly not something we'd want to enable.  Multiple codings are intended to represent multiple representations with different codes from the same system or different encodings from distinct code systems - not to allow the same code system to be identified multiple ways.  FHIR relies heavily on \"one system is always identified by one URL\".  That's not something we would want to relax.  The considerations around expediency of mapping between v3 and FHIR (and v2 and FHIR) were well considered when we designed the code and identifier data types as we did.</p>\n<p>As a rule, you shouldn't count on the OID being present in instances period.  If you start mandating that the OID-representation be included alongside the URL in instances to be willing to consume them, you're imposing a significant cost on all of your communication partners.  If you want to convert from FHIR back to CDA, the cost should be on your system alone.  It's not hard to look up the OID for a URI where those have been defined.  If you're dealing with local systems that might not have OIDs at all, the proper solution might be a foreign namespace extension in v3 rather than forcing the v3 overhead into FHIR systems.</p>",
        "id": 250625692,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629900732
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thanks, point taken. </p>\n<p>And thanks for the exposition, which I will advocate.</p>\n<p>I was writing a tracker, and I think the existing language is pretty good, but based on my misreading I think a note might help. </p>\n<p><a href=\"https://jira.hl7.org/browse/FHIR-33245\">https://jira.hl7.org/browse/FHIR-33245</a></p>\n<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  : I'm not sure I follow. Are you suggesting some language regarding using the extension on CodeSystem.url?</p>",
        "id": 250630176,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629902673
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> : And a question about the requirements underlying the design direction: If a CodeableConcept contains more than one coding, what is expected of the recipient? Must the recipient understand all of the codings? Use case 1: one ICD and one SCT; we expect them to be synonymous &amp; either is fine. Use case 2: one precise and one more general; do we have expectations?</p>",
        "id": 250630306,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1629902743
    },
    {
        "content": "<p>There's typically no expectation that a recipient understand <em>any</em> of the codings.  The codings don't have to be equivalent.  They have to be valid codings of the concept being represented.  They can have significantly different granularity.  E.g. You could have one code that says \"abdominal issue\" and another that says \"minor tear on left dorsal edge of appendix\" (if that's even a thing - a doctor I am not :&gt;)</p>",
        "id": 250638462,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629906477
    },
    {
        "content": "<p>Yeah - I think that's not a thing - but otherwise I agree. :)</p>",
        "id": 250641592,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1629907884
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'm interested in your take on the CDC standard practice of taking snapshots of HL7 codesystems/valuesets and including them in PHINVADs with new OIDs as their identifier.     See <a href=\"https://jira.hl7.org/browse/FHIR-33149\">https://jira.hl7.org/browse/FHIR-33149</a> .   In the VRDR current STU2 ballot IG, some codesystems are referred to by their HL7 URL <em>and</em> their PHINVADs OID ....sigh.</p>",
        "id": 250650326,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1629911795
    },
    {
        "content": "<p>Nothing stops people from creating whatever OIDs they like for HL7 code systems - but they <em>can't</em> use those as 'system' URIs in value sets.  They could say that they've created a different code system, in which case they can make up whatever URI they like.  In that case, they're conformant, but they're theoretically violating HL7 IP.  I'm not totally sure what license HL7 terminologies are licensed under, but I don't think it's the \"CC0\" license we use for the core spec, in which case cloning and re-identifying would be legally just fine.</p>\n<p>However, legally fine or not, from an interoperability perspective it's a horrible and profoundly counterproductive thing to do.  Given that VSAC is supposed to be helping to foster interoperability, it's certainly something that shouldn't happen.  <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> (when you're back from your travels)</p>",
        "id": 250669230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629919686
    },
    {
        "content": "<p><span aria-label=\"100\" class=\"emoji emoji-1f4af\" role=\"img\" title=\"100\">:100:</span> </p>\n<blockquote>\n<p>However, legally fine or not, from an interoperability perspective it's a horrible and profoundly counterproductive thing to do.</p>\n</blockquote>",
        "id": 251794045,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1630620529
    }
]