[
    {
        "content": "<p>I came across some data that uses <a href=\"https://www.who.int/medicines/publications/druginformation/innlists/en/\">International Nonproprietary Names for\nPharmaceutical Substances (INN) </a> to identify Medications. I'm not quite sure how to deal with this in FHIR and even whether this is considered an actual code system - I wasn't able to find a code system URL (or an OID for that matter) in the <a href=\"https://www.hl7.org/fhir/terminologies-systems.html\">FHIR list of code system</a>. Is there any guidance on this? <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> I saw you mentioning INNs used for identifying meds in Chile in another thread - how was this done?</p>",
        "id": 239375051,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621407221
    },
    {
        "content": "<p>it looks like a code system, but agree we've never described it</p>",
        "id": 239408831,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621425103
    },
    {
        "content": "<p>If there is neither a URL nor an OID for the system, is there any way to use these codes in a <code>CodeableConcept</code> (other than putting the label in <code>CodeableConcept.text</code>)? E.g. can one use a custom NamingSystem  resource to provide a \"placeholder ID\" (linking it to some description of the system) that can be used in the <code>CodeableConcept.coding.system</code> field?</p>",
        "id": 239428707,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621432784
    },
    {
        "content": "<p>You should make a request to the HL7 Terminology Authority to get the INN code system URL worked on.  They handle the process of working with external agencies to ensure we get it right.</p>",
        "id": 239434915,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1621434864
    },
    {
        "content": "<p>INN is an approach to designating products, not a code system (i guess it could be comparable to UCUM)</p>",
        "id": 239441986,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621437178
    },
    {
        "content": "<p>the WHO list of INNs may not be someone else's list of INNs</p>",
        "id": 239442065,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621437207
    },
    {
        "content": "<p>I think a NamingSystem would work</p>",
        "id": 239442166,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621437239
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> Sure, I could do that - how can I best contact the HL7 Terminology Authority? Given the comment from <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>, I suppose I would request them to consider a URL for the WHO set of INNs.</p>\n<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Looking a little more closely at <code>NamingSystem</code>, I'm not quite sure how it would actually work. I have to provide a unique ID in <code>uniqueId</code>. Given that no such ID is available externally, I would have to make up my own ID, e.g. a URL for INNs in a namespace I control and, I suppose, add a comment to the effect that this URL is used only within a particular scope due to the absence of a standard ID. Is that an acceptable approach?</p>",
        "id": 239450557,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621439843
    },
    {
        "content": "<p>as far as i know, INNs are not coded, so you do have to come up with the codes</p>",
        "id": 239454633,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621441377
    },
    {
        "content": "<p>and if you do, if those codes are not global, then you have to indeed use only within the agreed scope.</p>",
        "id": 239454830,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621441453
    },
    {
        "content": "<p>that's what I'd start with</p>",
        "id": 239454858,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621441462
    },
    {
        "content": "<p>I presume the HTA can trigger that discussion and procure codes</p>",
        "id": 239454920,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621441490
    },
    {
        "content": "<p>Products have names and they have codes/identifiers. It is normal to prescribe by code not by name, so I don't think we want to make codes for the names themselves. The INN can go in <a href=\"http://MedicinalProductDefinition.name\">MedicinalProductDefinition.name</a> with the fact that it is an INN in MedicinalProductDefinition.name.type (Type of product name, such as rINN, BAN, Proprietary, Non-Proprietary.)</p>",
        "id": 239455120,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1621441574
    },
    {
        "content": "<p>We can't stop people prescribing by name.<br>\nAlso we can't stop someone making an observation of the text \"headache\", instead of using a code.<br>\nIt's not ideal but it happens and it's ok. But we shouldn't start making codes for all the English words that can be used. That is what codes already do - they just are not being used in this case.<br>\nSo I am not sure we should encourage this by making a code system for INNs or any other name types, when there are already probably codes for these medications. Can we instead cross-reference to the medications that have these names?</p>",
        "id": 239457689,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1621442585
    },
    {
        "content": "<p>I assume that the requirement is to support INN prescription, not replace it by proper coding.</p>",
        "id": 239458332,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621442838
    },
    {
        "content": "<p>in that sense, we're stuck with text.</p>",
        "id": 239458364,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621442847
    },
    {
        "content": "<p>INN is a set of words that can be combined, hence my analogy to ucum.</p>",
        "id": 239458430,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621442873
    },
    {
        "content": "<p>given that INN prescription is a goal for some, and it won't go away soon for lack of alternatives, I can relate to a url that uniquely identifies \"the product is expressed in the INN space\"</p>",
        "id": 239458671,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621442970
    },
    {
        "content": "<p>the fun discussions <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> will be whether people use the latin expressions or german (or germanicized) forms of the names if there are any</p>",
        "id": 239458871,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621443053
    },
    {
        "content": "<p>and especially if some constructions may be latin or germanic (i.e. with or without spaces in between).</p>",
        "id": 239459232,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1621443197
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> <br>\nIn Chile we went with our own \"fake\" url for INN.</p>",
        "id": 239459521,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1621443311
    },
    {
        "content": "<p>also it was only used as a flat list.</p>",
        "id": 239460042,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1621443522
    },
    {
        "content": "<p>They later switched to ATC iirc</p>",
        "id": 239461030,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1621443893
    },
    {
        "content": "<p>INN is horrible because the \"codes\" are only names, as <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> mentioned, and every language has different terms</p>",
        "id": 239461241,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1621443967
    },
    {
        "content": "<p>Quite illuminating, thanks for all the feedback. What I gather from this is that the INNs seem more like a set of standardized display labels than an actual code system. In which case they seem like perfect candidates for <code>CodeableConcept.text</code>, but not for <code>CodeableConcept.coding</code>. If they are not available as code systems in actual clinical systems and there are no systematic mapping to other code systems, I imagine treating them as a real code system (and maybe even have to make up codes) will bring little value. In which case I'm also not sure that having a official URL would be  desirable.</p>\n<p>In my particular use case, I only encountered INNs used as codes for Medication in <code>CodeableConcept</code> fields in IPS medication list data that was quite roughly mapped to FHIR (as part of an ongoing project). So I think an entirely appropriate response here would be to ask the data provider to not use INNs as codes, but only as text (and ideally also add some codes from an existing code system, cf. writing \"headache\" as a free-text diagnosis).</p>",
        "id": 239553686,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621499528
    },
    {
        "content": "<p>From a quick look at one of the PDFs, I could see the use of the Latin names as the \"code\", a set of translations for various languages, as well as definitions.  Not far off a code system (for SUBSTANCES, not MEDICATIONS).<br>\nThe practical issues will be around governance -- e.g., does it ever happen that the Latin name is changed (which would amount to code retirement and replacement), is this recorded in a machine-readable way, etc</p>",
        "id": 239662242,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1621546150
    }
]