[
    {
        "content": "<p>The code systems that are currently in FHIR main spec that have canonical URLs are being removed from UTG. I've looked through them, and the following code systems have had changes made to them since the UTG ones were copied:</p>\n<ul>\n<li>CodeSystem/audit-event-type</li>\n<li>CodeSystem/condition-clinical</li>\n<li>CodeSystem/extra-security-role-type</li>\n<li>CodeSystem/subscription-channel-type</li>\n</ul>\n<p>I will update them in UTG directly, and there after, changes will be made via the UTG process.</p>",
        "id": 207355578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597793948
    },
    {
        "content": "<p>this brings me to the as yet unresolved problem of what the versions of those code systems should be in UTG. They are currently marked 4.2.0, which is the version of the FHIR core spec when they were copied from it. I don't think that this is a very useful version, and most of them are relatively simple example value sets. So I propose that I reset them all. Simple ones without any substantial investment, I'll make them 0.2.0, and ones where the community has invested in them will go to 1.0.0. (changes will be logged in history record). Thereafter, they should be subject to standard UTG versioning policy.</p>\n<p>Is anyone unhappy with this change? if so, why?</p>",
        "id": 207355709,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597794120
    },
    {
        "content": "<p>One question.  As the versions are incremented will there be a way to avoid having another version 4.2.0 sometime in the (likely very distant) future?  Or is that so distant and unlikely a possibility that we think we don't even need to worry about it?</p>",
        "id": 207399435,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1597839210
    },
    {
        "content": "<p>we can avoid it, but it does seem very far off to mw</p>",
        "id": 207403097,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597841628
    },
    {
        "content": "<p>should be easy to just skip over it (to 4.3.0 or 4.2.1) as long as someone remembers</p>",
        "id": 207463949,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1597872696
    }
]