[
    {
        "content": "<p>I'm trying to understand why some value sets are in FHIR and others are in THO but they are the same type.  Specifically, I'm looking at MedicationKnowledge Status codes which are in THO - type =Code with required binding.  But status codes for MedicationRequest status, MedicationDispense, MedicationUsage and MedicationAdmin  are in FHIR.  Is this a mistake?  How do we fix if it is?</p>",
        "id": 231385932,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616447655
    },
    {
        "content": "<p>It's a mistake.  The status codes should not be in THO.  As for how to fix, <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>?</p>",
        "id": 231388103,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616448691
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>?</p>",
        "id": 231389755,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1616449572
    },
    {
        "content": "<p>so what is the rule?   I have valuesets that have disappeared from FHIR, and others that are still there. I am not at all clear why some have moved and not others. AND the ones that have moved are so much harder to update.</p>",
        "id": 231390956,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616450175
    },
    {
        "content": "<p>Anything that's bound to 'code' must live in FHIR space.  Everything else that's not pure junk 'example' codes or low-maturity (FMM-1/2) code systems must live in THO.  Yes, it's harder.  That's the price of robust terminology governance and public review.</p>",
        "id": 231392067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616450747
    },
    {
        "content": "<p>Is it feasible to consider addition of some necessary terminology governance/management requiements to FHIR Terminology Services spec?</p>",
        "id": 231402203,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616456933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> can I just create this valueset in the FHIR build and then it can be removed from THO at a later date?  I'm trying to get changes made for the R5 ballot...</p>",
        "id": 231515868,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616522620
    },
    {
        "content": "<p>Sigh.    When R4 was being published as the current FHIR balloted standard, Grahame went through the value sets and changed the canonical URL for those that he felt were possible to be moved.     When THO content was imported, I was directing the import of the v3 coremif content and the v2 content, but Grahame manually moved the code systems and value sets that he had previously changed the URL for and I think some others but I have no idea which ones, and manually loaded them into the THO/UTG source of truth; I had nothing to do with it basically.   I have kvetched for almost 2 years that we need to verify what has been moved and what has not, and catch errors or items missed.    To my knowledge that effort on the part of FMG and FHIR-I has not been undertaken; if it has, I have not been told the result.   <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> if you are creating a value set whose canonical URL is rooted at <a href=\"http://terminology.hl7.org/ValueSet\">http://terminology.hl7.org/ValueSet</a> then it goes into THO via UTG.   If it is rooted in <a href=\"http://hl7.org/fhir\">http://hl7.org/fhir</a> or internal to a FHIR IG, it is my understanding that it goes into the FHIR ecosystem - but exactly where and how I am not clear on.</p>",
        "id": 231523827,
        "sender_full_name": "Ted Klein",
        "timestamp": 1616525720
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> the issue is that the value set I need to update is in THO but shouldn't be.  It is the status codes which are bound to \"code\" and as Lloyd indicated these must live in the FHIR space.  So back to my question.  Can I create the value system in FHIR with a canonical URL rooted in FHIR and then at some point it can be taken out of THO?</p>",
        "id": 231535086,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616529948
    },
    {
        "content": "<p>This really sounds like a lot of my issues are in here. Lloyd told me in another thread that a List was to be created to say which terminology UTG (THO?) is master for, leaving \"the rest\" for FHIR. I've been on recreating our OID registry that tries to connect system uris to OIDs in the HL7 OID Registry. It also recognizes that a very considerable part of those OIDs are actually defined inline in the ValueSets/CodeSystems/NamingSystems of the FHIR builds. I'm harvesting DSTU2/STU/R4 currently.</p>\n<p>Not really knowing what source of truth is, I'm currently running under these assumptions:</p>\n<ul>\n<li>UTG is the only place I trust for finding url/oid connections</li>\n<li>I'm trusting CodeSystem.identifier and ValueSet.identifier before trusting NamingSystem.uniqueId (I'm currently not looking for inconsistencies between the two in UTG, but I know for sure the FHIR Core Spec is inconsistent there)</li>\n<li>FHIR Core spec is the only place I trust for DSTU2, STU3, R4 contents of the CodeSystems and ValueSets, because those came out before UTG and I expect all reference implementations to run with official FHIR Core package, not UTG</li>\n</ul>\n<p>For R5 I really hope to see a more unified view. If people are interested in the resulting OID Registry (iso 13582 format), or interested in all the logic and exception I've had to make ... let me know. I'm filing UTG jira tickets on things that I think should be looked at when it concerns stuff at <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>.</p>",
        "id": 231543670,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616533550
    },
    {
        "content": "<p>It is my understanding that Code Systems that are used for value sets where the value set has a required binding to an element of type 'code' must be in the FHIR space, ie rooted in <a href=\"http://hl7.org/fhir\">hl7.org/fhir</a>; also the value set may not contain content from any other code system than that one.     I am not fully aware of a hard and fast rule that value sets must live in a particular place though - if they are built on only one code system and that system lives in the FHIR space then from my understanding where the value set is housed and maintained is not critical.  However I'll need Lloyd to clarify as I might well be mistaken here.   In the meantime, since it does live in THO, probably best to make a change through UTG for now until this is fully resolved; please paste the URL to the value set in question in the THO ci build so I can verify I am giving you the correct advice here.</p>",
        "id": 231544143,
        "sender_full_name": "Ted Klein",
        "timestamp": 1616533753
    },
    {
        "content": "<p>Well since profiles/resources bind to ValueSets, not CodeSystems, I would be amazed if a required binding on a 'code' datatype to a ValueSet is in UTG while the CodeSystem is in FHIR?</p>",
        "id": 231544375,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616533846
    },
    {
        "content": "<p>What Lloyd said was that - eventually - we'd have a process to propagate content from FHIR into a THO with a list to designate those things as \"read only\".  That hasn't happened yet and the 'code'-bound elements that are in THO are generally there in error.</p>",
        "id": 231544675,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616533927
    },
    {
        "content": "<p>In general, few FHIR value sets should be in THO - that should be a conscious decision that the value set is both shareable and amenable to maintenance outside the  FHIR ballot process.  Our focus has been on ensuring that code systems are in THO when it's appropriate for them to be.</p>",
        "id": 231544976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616534062
    },
    {
        "content": "<p>Alexander, thanks for doing all this.    Right now due to a variety of reasons I won't go into here, the content of THO (<a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>) maintained using the UTG process contains ONLY the tip of the master branch in the GitHub source of truth for the THO terminology.    Most of that terminology was only imported to GitHub in January 2020 so any content in FHIR prior to then was not imported; only the R4 content was imported, and ONLY the subset whose URLs were changed for the R4 publication to be rooted at <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> - all the other stuff stayed in the FHIR spec and continues to be maintained there.   Discussions are underway to move closer to full unification but we have a long way to go yet.    Right now, the THO content shown in the FHIR tabs for CodeSystems and ValueSets is both maintained in THO, and should reflect the R5 preview state - it has been advanced since R4.</p>",
        "id": 231545025,
        "sender_full_name": "Ted Klein",
        "timestamp": 1616534095
    },
    {
        "content": "<p>Ted is correct that the migration happened on a hurry-up basis with minimal review/validation, so it being a bit of a mess isn't super surprising.</p>",
        "id": 231545032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616534100
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> Note that UTG offers an STU3 download containing <a href=\"http://terminology.hl7.org\">http://terminology.hl7.org</a> uris instead of the then official <a href=\"http://hl7.org/fhir\">http://hl7.org/fhir</a> urls. That is one of the issues I filed.</p>",
        "id": 231545244,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616534184
    },
    {
        "content": "<p>Indeed.   Like in much of HL7, the QA review process has been done in a less than desirable completeness, but it is what it is.   Great idea to put in a UTG ticket pointing out noticed problems so at least they are listed somewhere centrally.</p>",
        "id": 231545274,
        "sender_full_name": "Ted Klein",
        "timestamp": 1616534203
    },
    {
        "content": "<p>Another one on the way is a list of V3 terminology without OIDs which for the V3 space is rather difficult.</p>",
        "id": 231545510,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616534297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> yes I believe that entry in the template control file is erroneous as the content is all post=R4.    Removing the template link generation control is on my list.     I do need to know from <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> though what the tooling does internally in terms of the combined package and the FHIR NPM package system content, as removing the link from the THO UI may still leave the misleading content in places where it will trip folks up.</p>",
        "id": 231545573,
        "sender_full_name": "Ted Klein",
        "timestamp": 1616534340
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> another goal (and we are woefully far away still due to not enough folks doing the work) is to properly track the identifiers for code systems.  Right now for those that have had their URLs changed (which we all know is a bad thing to do and have tried to avoid it at all costs, but the real world cares little about our tender sensibilities) we have put in quite a bit of effort to create NamingSystem resources in THO to track this.  There are two that I know of that had OIDs changed as well, and again it is on a list to be dealt with.  But this is a small subset and only for those codes systems generally from external terminology sources, and we are aware that it still has many gaps and errors to be addressed.  HTA is working on it.</p>",
        "id": 231546028,
        "sender_full_name": "Ted Klein",
        "timestamp": 1616534568
    },
    {
        "content": "<p>I aim to finish the work on the OID Registry later this week. I've used this for the past such and so years to generate NamingSystems, and drive connections in ART-DECOR. The only problem is: source of truth. Until last week I trusted the FHIR Core spec for source of truth. Little did I know there. This round I'm fixing around hundreds of connections that are wrong in the FHIR spec with UTG as primary base.</p>\n<p>If that work can help you in any way: happy to help. Let me know what/when/where.</p>",
        "id": 231546637,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616534838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> I'm not sure if you were asking Alexander or me for that information.  Here is the value set I'm referring to <a href=\"http://terminology.hl7.org/2.0.0/CodeSystem-medicationknowledge-status.html\">http://terminology.hl7.org/2.0.0/CodeSystem-medicationknowledge-status.html</a>. MedicationKnowledge.status (code/required) is bound to this value set.</p>",
        "id": 231556635,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616540140
    },
    {
        "content": "<p>I am very happy for the more formal governance of THO. But when that governance is opaque and freezes legitimate change requests... then that governance is broken. I am referring here to changes that Kathleen has asked for onbehalf of the security workgroup. I am also referring to the technical burden placed upon the proposer that is beyond governance.</p>",
        "id": 231799531,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616678824
    },
    {
        "content": "<p>In the old harmonization process, the technical burden was on those applying the changes - and that model wasn't sustainable.  The technical burden with UTG isn't really any different than making changes directly in FHIR - you need to know how to author the artifacts and you need to understand Git - so UTG vs. FHIR doesn't really change the technical burden that I've noticed.  UTG <em>badly</em> needs an automated notification process so that those who are on the hook to review content are regularly pinged about what's on their docket - so that the proponent doesn't have to rattle cages.  Are there other concerns?</p>",
        "id": 231800294,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616679109
    },
    {
        "content": "<p>If the GIT technical burden was the same as with IG and fhir core; I would be less worried. But it is a totally different system.</p>",
        "id": 231801901,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616679726
    },
    {
        "content": "<p>Not clear the difference between codes in FHIR core, in an IG, in UTG, or in HTA.</p>",
        "id": 231802103,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616679813
    },
    {
        "content": "<p>what is <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> vs <a href=\"http://tx.hl7.org\">tx.hl7.org</a>?</p>",
        "id": 231802300,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616679890
    },
    {
        "content": "<p><a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> is a website and official registry of HL7 codes.  <a href=\"http://tx.hl7.org\">tx.hl7.org</a> is the terminology server we use when validating and publishing (and includes all the content from <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>, everything from the FHIR core spec, SNOMED, LOINC, UCUM and a whole lot else.</p>",
        "id": 231808403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616681899
    },
    {
        "content": "<p>\"totally different system\" how?  Git is Git.  You're doing pull requests in both cases.  Where's the added complexity?  (Not saying there isn't any, I'm just not seeing it.)</p>",
        "id": 231808583,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616681956
    },
    {
        "content": "<p>I'm just dipping my toe into the UTG process so I'm not completely up to speed with everything, but the first thing I encountered is that by using a BitBucket server instead of just regular Github, there are many Git tools that won't work without paying for them.  This forces people who have experience with their Git tooling to either find a different tool or pay for the tool.  Not everyone is a command-line Git guru.  Is there some reason why UTG is not on the \"regular\" HL7 Github server?</p>",
        "id": 231813880,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616683615
    },
    {
        "content": "<p>Exactly.. the bitbucket complexity</p>",
        "id": 231815784,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616684207
    },
    {
        "content": "<p>I think that was because Jira had better integration with Bitbucket than with regular Git.  Didn't realize that stops you from using regular Git tools.  It's not supposed to...  <span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span> ?</p>",
        "id": 231817609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616684689
    },
    {
        "content": "<p>depends on your definition of \"regular\".</p>",
        "id": 231819274,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616685201
    },
    {
        "content": "<p>\"regular\" = tools used by committers within the FHIR community normally.  So things like TortoiseGit (which I know works with BitBucket) but also whatever Mac folks use</p>",
        "id": 231819805,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616685370
    },
    {
        "content": "<p>No commercial tools should be required</p>",
        "id": 231819831,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616685383
    },
    {
        "content": "<p>What tools are you trying to use that do not work with Bitbucket <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>, regardless of regular or irregular status?</p>",
        "id": 231820130,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1616685462
    },
    {
        "content": "<p>GitKraken, for instance, works with Bitbucket but not a Bitbucket server.  That requires you to pay for a pro or enterprise license.  There was another tool that I can't remember when I went to looking for a GitKraken alternative that also doesn't support BitBucket server but does support <a href=\"http://BitBucket.org\">BitBucket.org</a>.</p>",
        "id": 231821623,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616685856
    },
    {
        "content": "<p>SourceTree is the tool that is recommended for the integration with BitBucket in the documentation.</p>",
        "id": 231822099,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616686006
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191759\">Melva Peters</span> <a href=\"#narrow/stream/179202-terminology/topic/UTG.20or.20FHIR.3F/near/231822099\">said</a>:</p>\n<blockquote>\n<p>SourceTree is the tool that is recommended for the integration with BitBucket in the documentation.</p>\n</blockquote>\n<p>Right, thus my point that I either have to upgrade or switch.</p>",
        "id": 231823099,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616686309
    },
    {
        "content": "<p>I'll point out that this is a minor irritant and is probably not the essence of what John Moehrke was talking about.</p>",
        "id": 231823242,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616686341
    },
    {
        "content": "<p>it is not off topic...  I have very simple tools that I use for FHIR core and for IG builds... and I have to do something different with terminology</p>",
        "id": 231824156,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616686617
    },
    {
        "content": "<p>I would like to not have different processes. bitbucket is unusual.</p>",
        "id": 231824369,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616686700
    },
    {
        "content": "<p>What tools do you use for core and IG build <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> and what issues do you have using them w/ Bitbucket?</p>",
        "id": 231826397,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616687427
    },
    {
        "content": "<p>I think that's the wrong question Lloyd.  Why is UTG using Bitbucket when all the other IGs are hosted on HL7s Github?</p>",
        "id": 231827353,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616687762
    },
    {
        "content": "<p>I answered - Jira has better integration w/ BitBucket - and for UTG there was a need for tight linkage between Git and the Jira items</p>",
        "id": 231828725,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616688211
    },
    {
        "content": "<p>For regular tracker items, we have no integration at all.</p>",
        "id": 231828771,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616688226
    },
    {
        "content": "<p>There are some new Jira plugins that claim to provide 'pure' Git integration, which might be worth pursuing if BitBucket is causing significant grief.  Don't know how hard it would be to switch the application though.</p>",
        "id": 231828976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616688292
    },
    {
        "content": "<p>Alternatively, there might be some changes we can make with our Bitbucket implementation so that tools play more nicely with it</p>",
        "id": 231829067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616688321
    },
    {
        "content": "<p>Maybe most grief could be mitigated by using <a href=\"http://bitbucket.org\">bitbucket.org</a>, rather than bitbucket server. I develop certain things against <a href=\"http://bitbucket.org\">bitbucket.org</a> and everything works with any of my git clients including GitKraken and SourceTree (which is a free btw). I have one sincere problem with SourceTree which is that it refuses to remember I like tabs above windows, which is why GitKraken is what I mostly use, but even the oXygen Git client works fine with anything. I have no experience with BitBucket server so cannot help there. Only github, <a href=\"http://bitbucket.org\">bitbucket.org</a>, gitlab and some small ones.</p>",
        "id": 231968582,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616767106
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191759\">Melva Peters</span> <a href=\"#narrow/stream/179202-terminology/topic/UTG.20or.20FHIR.3F/near/231556635\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191982\">Ted Klein</span> I'm not sure if you were asking Alexander or me for that information.  Here is the value set I'm referring to <a href=\"http://terminology.hl7.org/2.0.0/CodeSystem-medicationknowledge-status.html\">http://terminology.hl7.org/2.0.0/CodeSystem-medicationknowledge-status.html</a>. MedicationKnowledge.status (code/required) is bound to this value set.</p>\n</blockquote>\n<p>You are pointing to the CodeSystem. Don't know if that matters for the question but didn't you mean <a href=\"https://terminology.hl7.org/2.0.0/ValueSet-medicationknowledge-status.html\">https://terminology.hl7.org/2.0.0/ValueSet-medicationknowledge-status.html</a>?</p>\n<p>In any case, if the assertion holds that FHIR code bound terminology has source of truth in FHIR, not in UTG/THO, then you would not be expected to go through UTG/THO processes for a change? So in fact the leading location for that ValueSet is in the FHIR spec and process would be through a Jira ticket?</p>",
        "id": 231971324,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616768079
    },
    {
        "content": "<p>Yes, I believe that both the value set and the code system should be in FHIR and not UTG for this and that changes can be managed via Jira Issue.  Still trying to figure out how to fix!</p>",
        "id": 231990895,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616774933
    },
    {
        "content": "<p>I would know how add a code in a CodeSystem or ValueSet once a motion was approved to do so, but I don't think I can help you on this governance issue:</p>\n<blockquote>\n<p>Can I create the value system in FHIR with a canonical URL rooted in FHIR and then at some point it can be taken out of THO?</p>\n</blockquote>",
        "id": 231993181,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1616775813
    },
    {
        "content": "<p>I'm still wondering what the answer to this question is:</p>\n<blockquote>\n<p>What tools do you use for core and IG build @John Moehrke and what issues do you have using them w/ Bitbucket?</p>\n</blockquote>",
        "id": 232702221,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1617251174
    },
    {
        "content": "<p>I am going to start to apply some changes to the Pharmacy resources.  One of the first things I will be doing is to add the MedicationKnowledge codesystem and value set to the FHIR Code build as it was pulled into UTG in error.  Unless I hear differently, I'll be starting this work in the next couple of days.  My next set of changes will be to add the example valuesets/codesystems that were move to THO back into the core build.  All of these will need to be removed from THO.  Should I submit change requests in UTG to have that done? <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 236736579,
        "sender_full_name": "Melva Peters",
        "timestamp": 1619726751
    },
    {
        "content": "<p>yes</p>",
        "id": 236739632,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619728026
    },
    {
        "content": "<p>Yes, agree with that.</p>",
        "id": 236741433,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1619728800
    },
    {
        "content": "<p>I have created the change request in UTG - <a href=\"https://jira.hl7.org/browse/UP-200\">https://jira.hl7.org/browse/UP-200</a> for the removal of MedicationKnowledge Status Codesystem and Value set.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - who will do the deletion?</p>",
        "id": 237524179,
        "sender_full_name": "Melva Peters",
        "timestamp": 1620231662
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Does FHIR-I or FMG have a policy about the canonical URL for the code systems in FHIR?   e.g. part of the import of CS: MedicationKnowledgeStatus  last year was that Grahame changed the canonical URL to be rooted at <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>; if it is 'moved' back into FHIR, does the URL need to be changed back to be rooted at <a href=\"http://hl7.org/fhir\">hl7.org/fhir</a>?</p>",
        "id": 237679117,
        "sender_full_name": "Ted Klein",
        "timestamp": 1620315117
    },
    {
        "content": "<p>I believe this one should not have been changed last year - all of the other status value sets are rooted in <a href=\"http://hl7.org/fhir\">hl7.org/fhir</a>.</p>",
        "id": 237683065,
        "sender_full_name": "Melva Peters",
        "timestamp": 1620316532
    },
    {
        "content": "<p>has to have a matching root URL; if it's moved back, it has to change</p>",
        "id": 237734732,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620337071
    },
    {
        "content": "<p>I have applied the change to move it back and have added a UTG change request to removed it from UTG.</p>",
        "id": 237734905,
        "sender_full_name": "Melva Peters",
        "timestamp": 1620337156
    }
]