[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9961\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9961\">GF#9961</a> asks for us to generate version specific value sets for v2 tables. I could do this... but I asked <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> about this, and got a response that makes me think this is not so easy. See the notes on the task</p>",
        "id": 153840753,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469345237
    },
    {
        "content": "<p>I think that the version specific value sets are not particular expansions, but particular enumerated value sets of codes. </p>",
        "id": 153840754,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469345265
    },
    {
        "content": "<p>and I think that they should have their own id and their own OID. </p>",
        "id": 153840755,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469345282
    },
    {
        "content": "<p>but given Ted's comments, does anyone have any comments about this?</p>",
        "id": 153840756,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469345293
    },
    {
        "content": "<p>I just posted a comment on the tracker item - asume we want the discussion to happen there and not Zulip? Or should I repost here?</p>",
        "id": 153841285,
        "sender_full_name": "Robert McClure",
        "timestamp": 1469632724
    },
    {
        "content": "<p>typically, discussion here, and post a reference to the topic in the task</p>",
        "id": 153841306,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469644159
    },
    {
        "content": "<p>Reposting here from <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9961\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9961\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9961</a><br>\nHonestly I'm not sure I'm following the specific issue that needs to be solved. I think this should be a topic on an upcoming Vocab call.<br>\nThat said, I suspect we'd all agree that Code systems have an identifier that is stable across all versions, and then they also are expected to have a version identifier that is unique within the scope of the code system. That means to identify a specific version of a code system you need both the code system id and the version id. If FHIR wants to create a particular URI for the combination of those two things that is fine with me although I'd much prefer that you could parse out the two elements - I think that is what we ae doing, correct?<br>\nFor Value Sets: we have approached value set definitions in the same way - an identifier that is stable across all versions, and a version identifier that is unique within the scope of the specific value set. <br>\nAs for Value Set Expansions: I hate to make this complicated but I'm just pointing out some things we've been inconsistent about. The VSD spec tries to clarify that a Value Set Expansion Code Set is what you get when you do an expansion based upon a value set definition (and the appropriate code system version.) VSD does not say what is included in that other than the list of \"codes\" from the code system but I think we will find that a preferred description and the code system version ID is also a good thing in the \"Value Set Expansion Code Set.\" Other code system (or eventually in FHIR, additional code system supplement) information can be added to the Value Set Expansion Code Set output based on specification in an expansion profile. As I see it the expansion profile determines what additional code information beyond the Value Set Expansion Code Set, is included in the expansion file that is the output of an $expand operation. I suspect what I'm calling \"the expansion output file\" is what FHIR simply calls \"an expansion,\" is that correct? <br>\nWhile an expansion output file can persist, is not a thing that changes over time therefore Expansion output files don't have versions, they just exist. An expansion output file should, without exception, include the value set id and version, and code system id and version that was used to generate it but I think they should have a unique id and it seems best to me if we made that a GUID, and not something that is the combination of the derivative value set ID, version, etc. This means that I have come to think that we would not expect \"the identifier\" for an expansion could be used to determine if one expansion output file is identical to another.<br>\nAll of that said, I'd love to discuss this and make sure we deliver all the functionality we need.</p>",
        "id": 153841499,
        "sender_full_name": "Robert McClure",
        "timestamp": 1469730920
    },
    {
        "content": "<p>I had not considered using the same value set url with different versions, but I think it makes sense. I'll do it that way</p>",
        "id": 153841514,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469733784
    }
]