[
    {
        "content": "<p>(I think the answer to this is no, but I'll ask anyway)   Is there a way to define a value set as the intersection of two other value sets? Alternatively, and specifically for SNOMED, is there a way to use filter criteria (or any other clever tricks) to define a value set as those concepts that are  common descendants (is-a hierarchy) from two or more given parent concepts?</p>",
        "id": 275643096,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647519509
    },
    {
        "content": "<p>Yes, there is.  ValueSet.compose.include.valueSet is 0..*, and the comments on compose.include state \"If one or more value sets are listed, the codes must be in all the value sets.\" - i.e. the include is the intersection of the specified value sets.</p>",
        "id": 275643712,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647519854
    },
    {
        "content": "<p>Rob, we have never used ValueSet.compose.include like that, and I don't think that is how FHIR interprets that element. For example, <a href=\"http://hl7.org/fhir/us/mcode/STU2/ValueSet-mcode-radiotherapy-technique-vs.html\">mcode-radiotherapy-technique-vs</a> is a value set composed of value sets, which in turn are made up of other value sets. The expansion is the UNION of all the concepts from all those value sets.</p>",
        "id": 275647597,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647521914
    },
    {
        "content": "<p>Looking on <a href=\"https://www.hl7.org/fhir/valueset-definitions.html#ValueSet.compose.include.valueSet\">this page</a>, the definition of that element says \"Selects the concepts found in this value set (based on its value set definition). This is an absolute URI that is a reference to ValueSet.url. <strong>If multiple value sets are specified this includes the union of the contents of all of the referenced value sets</strong>.\"</p>",
        "id": 275647975,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647522048
    },
    {
        "content": "<p>Tracking this down, the definition changed between 4.6.0 and 4.0.1. \"Union\" changed to \"intersection\". That's a HUGE difference, and not NOT backwards compatible AT ALL. As a normative resource, that won't fly.</p>",
        "id": 275648684,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647522285
    },
    {
        "content": "<p>Right.  Because that was a mistake in R4 (and earlier) documentation and wasn't the intent, and it's being being corrected in R5.  I think the Jira task is a technical correction - I can check that.</p>",
        "id": 275649114,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647522451
    },
    {
        "content": "<p>Ouch, ouch, ouch, ouch. No matter what the intent, that is huge breaking change. I don't think the intersection is the right intent anyway, but that's not even the issue. The issue is whether this is a breaking change on a NORMATIVE resource (YES IT IS).</p>",
        "id": 275649517,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647522608
    },
    {
        "content": "<p>If every existing non-ballot version of FHIR treats it as a union, and every existing FHIR tool treats it as a union, and every IG that has ever used it has it expanded as a union, then <em>why</em> change it?  What possible upside could justify all the breakage and confusion? It seems to me that we should treat it as the de-facto (or common-law) intent now -- and add in a different mechanism that supports the intersection intent.  I agree w/ <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> -- this is <em>for sure</em> a breaking change.</p>",
        "id": 275650792,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1647523222
    },
    {
        "content": "<p>This was addressed in <a href=\"http://jira.hl7.org/browse/FHIR-25179\">FHIR#25179</a> (and that issue is a CR, rather than a TC).  I agree that the change is breaking - and that isn't expected to happen with a normative resource (at least unless the entire community has agreed to the change).  The issue doesn't include much detail of how this change was justified, but the key part related to that I think is:</p>\n<blockquote>\n<p>Update:10/27/19: Grahame has confirmed that the definition of compose.include.valueset appears to be erroneous, when it was moved under compose.include (previously it was under compose), _ the definition was supposed to be updated </p>\n</blockquote>\n<p>The key question, I guess, is what to do now?</p>",
        "id": 275650836,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647523244
    },
    {
        "content": "<p>Ah.  I see.  <a href=\"https://www.hl7.org/fhir/valueset.html#compositions\">Other parts of the spec</a> say it is an intersection -- so we have contradictory definitions in different normative parts of the spec.  Fun!</p>",
        "id": 275651851,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1647523717
    },
    {
        "content": "<p>Correct.</p>",
        "id": 275651953,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647523764
    },
    {
        "content": "<p>On balance, I think the <a href=\"http://jira.hl7.org/browse/FHIR-25179\">FHIR#25179</a> resolution is likely still going to be the best course to take.</p>",
        "id": 275652904,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647524197
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 275653119,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647524289
    },
    {
        "content": "<p>I think the kicker, though, is that FHIR IG Publisher has not treated it this way at all.  For example, Mark's <a href=\"http://hl7.org/fhir/us/mcode/STU2/ValueSet-mcode-radiotherapy-technique-vs.html\">mcode-radiotherapy-technique-vs</a> that he links above has a single include with multiple value sets.  Not only does the expansion contain the union of those sets, but even the <em>generated narrative</em> describes it that way:<br>\n<a href=\"/user_uploads/10155/ayRvGc5HOfCZzVXTBS0jG4gv/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ayRvGc5HOfCZzVXTBS0jG4gv/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/ayRvGc5HOfCZzVXTBS0jG4gv/image.png\"></a></div>",
        "id": 275653232,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1647524349
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>?</p>",
        "id": 275653458,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647524431
    },
    {
        "content": "<p>I think the intent of treating it as an intersection makes sense, but when the spec is at odds with itself, and the reference implementation tooling (which is <em>required</em> for all HL7 publications) has taken a side already (for many years now) -- it makes sense to normalize to the position that has been widely practiced and enforced by official tooling.</p>",
        "id": 275653516,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1647524468
    },
    {
        "content": "<p>Possibly.  But that still means that we would have to change the further <strong>normative</strong> guidance on 'include' that contradicts this and carve out 'valueSet' as a special case, which also eliminates the possibly (at least without further additions or changes) of defining value sets based on the intersection of other value sets - which is what <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> is requesting.  I don't think that's a very easy choice to make, either.</p>",
        "id": 275654338,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647524805
    },
    {
        "content": "<p>non-breaking is to introduce a new word that does what you wanted intersection to do... thus leave intersection implemented as is 'commonly implemented today', which should be explained and warned against using.</p>",
        "id": 275654603,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647524916
    },
    {
        "content": "<p>One correction on the above -- the example I cited actually has 2 includes, with 1 value set in each. So UNION is the correct, expected behavior for that example. My mistake, mucho apologies for any confusion!</p>",
        "id": 275655140,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647525141
    },
    {
        "content": "<p>I have value sets defined in IPS which use 'valueSet' and 'filter' in a single include, and the Publisher and expansion behavior is intersection, as expected.  I will check further and see if I have any that use intersection of two (or more) value sets (I don't recall for sure whether I have that or not).</p>",
        "id": 275656832,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647525787
    },
    {
        "content": "<p>I've just created a test project that has a ValueSet w/ one include and two value sets.  The IG Publisher expands it as a <strong>UNION</strong>.  The generated narrative is a bit more ambiguous, but the expansion is definitely as union (<em>not</em> an intersection).  So it does seem that the IG Publisher is following <em>union</em> semantics even for multiple value sets in a single compose.include.  Here's the test project if you want to try it yourself: <a href=\"/user_uploads/10155/_dkyV8e3uJsq4ZhQm8xPI2fm/ValueSetIncludesValueSets.zip\">ValueSetIncludesValueSets.zip</a></p>",
        "id": 275659664,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1647526860
    },
    {
        "content": "<p>FWIW, Ontoserver has always (~7 years now) treated this as an intersection</p>",
        "id": 275660652,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1647527214
    },
    {
        "content": "<blockquote>\n<p>So it does seem that the IG Publisher is following <em>union</em> semantics even for multiple value sets in a single compose.include.  Here's the test project</p>\n</blockquote>\n<p>Good to know! Another relevant point would be whether this is actually being relied upon by any real implementation guides. Of course there could be others we are not aware of, but as Mark pointed out above there are more straightforward ways to get unions, so it's not clear that IG developers would have stumbled into this particular trap.</p>",
        "id": 275662834,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647528080
    },
    {
        "content": "<p>It is not uncommon as an IG author to ... simply throw things at the wall and see if it looks like what you need... the number of people that fully understand the power of the whole ecosystem is small... we can't always wait for one of the few FHIR gods to bless what we want to do... so if the tooling produces what we want, we go with it.</p>",
        "id": 275665889,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647529206
    },
    {
        "content": "<p>To Josh's point, someone could probably build a script to run through all the IGs in the registry (and CI), and find how many use this construct (single include w/ multiple value sets).  That would give us a better idea of the true impact such a change would have.</p>",
        "id": 275668747,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1647530224
    },
    {
        "content": "<p>My vote is that existing use weighs more than original intent</p>",
        "id": 275674507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647532158
    },
    {
        "content": "<blockquote>\n<p>simply throw things at the wall and see if it looks like what you need</p>\n</blockquote>\n<p>100%. My intuition is that people throwing things at the wall would be unlikely to reach this particular dark corner, but as Chris says it's a question that could be answered with real data. It'd be neat to have an openly published (i.e., pre-scraped) DB of every FHIR resource from every public IG, to facilitate this kind of analysis.</p>",
        "id": 275677941,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647533055
    },
    {
        "content": "<blockquote>\n<p>It'd be neat to have an openly published (i.e., pre-scraped) DB of every FHIR resource from every public IG</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Holy grail, you say?  Oh, I have one of those.  See <a href=\"https://www.medrxiv.org/content/10.1101/2022.03.09.22272163v1\">https://www.medrxiv.org/content/10.1101/2022.03.09.22272163v1</a>.  Let me do a bit of analysis and I can tell you the answer to that question...</p>",
        "id": 275703361,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647540525
    },
    {
        "content": "<p>So the answer is <strong>4</strong> value sets use multiple value sets in a single include, out of <a href=\"https://www.medrxiv.org/content/10.1101/2022.03.09.22272163v1\">125 IGs surveyed</a> that collectively contain 1124 value sets. They are:</p>\n<ol>\n<li><a href=\"http://fhir.infoway-inforoute.ca/io/psca/ValueSet/substanceandpharmaceuticalbiologicproductcode\">http://fhir.infoway-inforoute.ca/io/psca/ValueSet/substanceandpharmaceuticalbiologicproductcode</a></li>\n<li><a href=\"http://hl7.org/fhir/us/dental-data-exchange/ValueSet/dental-anatomy\">http://hl7.org/fhir/us/dental-data-exchange/ValueSet/dental-anatomy</a></li>\n<li><a href=\"http://hl7.org/fhir/us/qicore/ValueSet/qicore-negation-reason\">http://hl7.org/fhir/us/qicore/ValueSet/qicore-negation-reason</a></li>\n<li><a href=\"http://hl7.org/fhir/ca/baseline/ValueSet/vaccinecodes\">http://hl7.org/fhir/ca/baseline/ValueSet/vaccinecodes</a></li>\n</ol>\n<p>Here is the spreadsheet containing the data:<br>\n<a href=\"/user_uploads/10155/IzYkM83IC1VRhnuqV4mWKaWd/VALUE_SETS.xlsx\">VALUE_SETS.xlsx</a><br>\nI might be wrong, but it looks like all of these are intended to be unions.</p>",
        "id": 275706292,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647541912
    },
    {
        "content": "<p>Fabulous on so many levels, thanks <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> for the analysis. Are the analysis scripts open source too? The ones leading to the figures/tables in your manuscript?</p>\n<p><a href=\"/user_uploads/10155/rPldGAVUDFhuQDKoePRhmUy0/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/rPldGAVUDFhuQDKoePRhmUy0/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/rPldGAVUDFhuQDKoePRhmUy0/image.png\"></a></div>",
        "id": 275711511,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647544335
    },
    {
        "content": "<p>Yeah, agree that all of your identified examples seem to intend union semantics.</p>",
        "id": 275711797,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647544493
    },
    {
        "content": "<p>I haven't shared the notebooks (they are Python3). The code wasn't written for reuse, only for short-term tactical purposes. Certainly not in \"library-ready\" form.</p>",
        "id": 275711933,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647544559
    },
    {
        "content": "<p>now that I'm awake... I don't see that the tools treat this as a union. So far as I can see, it's treated as an intersection</p>",
        "id": 275719791,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647548248
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Take a gander at this: <a href=\"http://hl7.org/fhir/us/qicore/STU4.1/ValueSet-qicore-negation-reason.html\">http://hl7.org/fhir/us/qicore/STU4.1/ValueSet-qicore-negation-reason.html</a><br>\n<a href=\"/user_uploads/10155/vFhlt7zcok6seguGryYf_fcn/image.png\">image.png</a> <br>\nThe expansion is clearly a union.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/vFhlt7zcok6seguGryYf_fcn/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/vFhlt7zcok6seguGryYf_fcn/image.png\"></a></div>",
        "id": 275720601,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647548618
    },
    {
        "content": "<p>oh dear.</p>",
        "id": 275723952,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647549981
    },
    {
        "content": "<p>just like the specification is contradictory, so is the code.</p>",
        "id": 275724051,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647550035
    },
    {
        "content": "<p>when importing a value set, the code performs both a union and an intersection, in different places in the code.</p>",
        "id": 275724098,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647550059
    },
    {
        "content": "<p>I missed the union bit happening when I looked at the code. And the intersection bit is quite redundant when it happens after the union happens</p>",
        "id": 275724184,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647550090
    },
    {
        "content": "<p>but this is worse. <a href=\"http://tx.fhir.org\">tx.fhir.org</a> does not do this, only the validator does for internal simple value sets.</p>",
        "id": 275726204,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647550851
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> does your analysis also look at (single) valueset + filter or (single) valueset + concepts ?<br>\nFour valuesets from 1124 needing a technical correction does not seem too much of a problem?</p>",
        "id": 275737419,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1647556669
    },
    {
        "content": "<p>I could look at that, but I did not. I only looked at multiple value sets because that was the question on the table. However, the spreadsheet attached above has all the necessary data if you want to see for yourself.</p>",
        "id": 275743519,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647560776
    },
    {
        "content": "<p>Fortunately it looks like the demand for value set intersections, up until now, has been vanishingly small. Correcting those few cases where the intent was union but the implementation was faulty will not cause much damage.  This whole thread started because I have a case where intersections are necessary, and as a result of today’s discussion, it looks like we can clarify the spec, fix the tooling, and get the job done.</p>",
        "id": 275744063,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647561222
    },
    {
        "content": "<p>My panic about massive breakage was overblown. I apologize about that.</p>",
        "id": 275744199,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647561347
    },
    {
        "content": "<p>ok. So I've fixed the code. But given that the valueSets that <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> has identified (and thanks very much for doing excellent legwork) are published and in production, and I found at least one more value set like that that's not public, it's not very simple to 'correct' them.</p>\n<p>So what I've done is that when I'm processing value sets, I check the publication date. if the publication date is prior to the end of this month, the legacy rules apply. But for anything published from now on, the correct processing rules per the <a href=\"http://jira.hl7.org/browse/FHIR-25179\">FHIR#25179</a> task apply. <br>\n(For other toolsmiths (<span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> FYI), I use the package date in the npm package to decide this. Core packages don't have dates; I looked them up from here: <a href=\"http://hl7.org/fhir/directory.html\">http://hl7.org/fhir/directory.html</a>)</p>\n<p>In addition, anytime the validator sees a value set, it creates this warning:</p>\n<p><a href=\"/user_uploads/10155/1hymBBolP3t-1wh1Hdq-fJPr/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/1hymBBolP3t-1wh1Hdq-fJPr/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/1hymBBolP3t-1wh1Hdq-fJPr/image.png\"></a></div>",
        "id": 275750650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647567438
    },
    {
        "content": "<p>Do these \"legacy rules\" only apply in the context of the IG publisher?  We have people relying on the intersection semantics today; we need to avoid breaking things for them.</p>",
        "id": 275751394,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1647568335
    },
    {
        "content": "<p>I expect (and hope) that it will be limited to the IG Publisher context.</p>",
        "id": 275752231,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1647569228
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191447\">Mark Kramer</span> <a href=\"#narrow/stream/179202-terminology/topic/ValueSet.20defined.20by.20an.20intersection.20.3F/near/275706292\">said</a>:</p>\n<blockquote>\n<ol>\n<li><a href=\"http://fhir.infoway-inforoute.ca/io/psca/ValueSet/substanceandpharmaceuticalbiologicproductcode\">http://fhir.infoway-inforoute.ca/io/psca/ValueSet/substanceandpharmaceuticalbiologicproductcode</a></li>\n</ol>\n</blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179202-terminology/topic/ValueSet.20defined.20by.20an.20intersection.20.3F/near/275750650\">said</a>:</p>\n<blockquote>\n<p>But given that the valueSets that <span class=\"user-mention silent\" data-user-id=\"191447\">Mark Kramer</span> has identified (and thanks very much for doing excellent legwork) are published and in production.</p>\n</blockquote>\n<p>That valueset is currently in public comment. We can update if needed. </p>\n<p>(On a related note, I recall running into an issue where  we were defining a valueset A that included some specific concepts directly, and excluded valueset B which contained several of them. I can't remember if we were hoping for the include to override the exclude or vice versa, but found the result was the opposite of our expectations. If we defined valueset C that included the concepts, and then defined valueset A to include C and exclude B, the result differed.)</p>\n<p>(<span class=\"user-mention\" data-user-id=\"222582\">@Sheridan Cook</span> )</p>",
        "id": 275752524,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1647569586
    },
    {
        "content": "<p>yes they apply in that context</p>",
        "id": 275752591,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647569667
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> test cases are welcome for this part of the value set space</p>",
        "id": 275752605,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1647569692
    },
    {
        "content": "<p>Sure. Let me see if I can find or recreate the issue.</p>",
        "id": 275752688,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1647569789
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Thank you for the timely and clever fix. In the warning message, would it be possible to point out the difference between multiple value sets in one include, versus multiple includes with single value sets?</p>",
        "id": 275803185,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1647610720
    },
    {
        "content": "<p>ok</p>",
        "id": 277081483,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1648600363
    }
]