[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> Got a question for you. If a code system (or a supplement) has designations in a particular language, and a value set has designations but not for a the particular language, does the value set designation override the code system designation?</p>\n<p>I think it should, but what does ontoserver do?</p>",
        "id": 240869520,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622493613
    },
    {
        "content": "<p>I think the expansion should always provide the display in the language requested, if available. So this would suggest that the ValueSet does not override, but if you ask for includeDesignations, then you get all.</p>\n<p>However I don't know what Ontoserver does - our ValueSet designation support is limited.</p>\n<p>Michael</p>\n<p>Michael</p>",
        "id": 240870602,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1622494721
    },
    {
        "content": "<p>but if the value set specifies a designation, that's a high value thing - contextualised. So I'm not clear which is worse</p>",
        "id": 240872753,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622496542
    },
    {
        "content": "<p>Why not expect the ValueSet to have translations in that case?</p>",
        "id": 240874017,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1622497724
    },
    {
        "content": "<p>well, i think that would make perfect sense. But I'm not writing a value set, I'm working on my service...</p>",
        "id": 240876672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622500474
    },
    {
        "content": "<p>I think it's reasonable to prioritise language over alternate designations. If I have a ValueSet that imposes, for example, an alternate spelling of a term in English, I wouldn't want that to affect an $expand that specifies Greek as it's displayLanguage</p>",
        "id": 240883305,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1622508427
    },
    {
        "content": "<p>In theory, I would treat ValueSet designations the same way as a CodeSystem supplement</p>",
        "id": 240883377,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1622508484
    }
]