[
    {
        "content": "<p>Hi. Continuing a conversation I had with Grahame where we reached a number of conclusions and left 2 items open on the topic of ValueSet expansion and the expectation on certain properties.</p>\n<p>Here's the conclusion so far. On a ValueSet expansion:<br>\n- <a href=\"http://ValueSet.id\" target=\"_blank\" title=\"http://ValueSet.id\">ValueSet.id</a> -- leave empty unless one can retrieve the exact same expansion under that id<br>\n- ValueSet.identifier -- SHALL be that of the master ValueSet, usually the definitional ValueSet, but in rare cases it could be that the definition is not available in the FHIR realm and so only an expansion is available<br>\n- ValueSet.url -- SHALL be that of the master ValueSet, usually the definitional ValueSet, but in rare cases it could be that the definition is not available in the FHIR realm and so only an expansion is available<br>\n- ValueSet.expansion.identifier -- SHOULD be a uuid to allow receivers to track a particular expansion (I would prefer SHALL here)</p>",
        "id": 153839671,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1468943900
    },
    {
        "content": "<p>So here's the thing where we did not reach agreement yet. On any resource we have, that carry .url and .identifier, they point to the object they are on. However when we talk about ValueSet expansions they point to the master ValueSet that the expansion was generated from.</p>\n<p>Grahames argueing that the master ValueSet holds the idea behind the expansion and .url and .identifier always point to the underlying idea so there is no inconsistency.</p>\n<p>I'm having trouble agreeing with that so I would like to poll for opinions here. Maybe I'm wrong, maybe I'm not. Please share.</p>",
        "id": 153839672,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1468944148
    },
    {
        "content": "<p>Questions about ValueSet.expansion.identifier. Is it unique per $expand operation? In order to do that, the server need to track/save all $expand operations. But for how long? For example, if the client submit a operation ValueSet/23/$expand?filter=\"abc\" today and then the client submit the same operation one week later, should the server return the same expasion.identifier? </p>",
        "id": 153839725,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1468949898
    },
    {
        "content": "<p>There is no guidance on that here: <a href=\"http://hl7-fhir.github.io/valueset-operations.html#expand\" target=\"_blank\" title=\"http://hl7-fhir.github.io/valueset-operations.html#expand\">http://hl7-fhir.github.io/valueset-operations.html#expand</a>. There is exactly 1 sentence that could lead you to believe that in most cases every expansion is unique: \"The value set expansion returned by this query should be treated as a transient result that will change over time (whether it does or not depends on how the value set is specified), so applications should repeat the operation each time the value set is used.\"</p>\n<p>The other notion is that expansion.identifier is likely a uuid, so that sort of resolves the issue of uniqueness</p>",
        "id": 153839735,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1468953152
    },
    {
        "content": "<p>In OID terms you could just keep numbering under a branch. Whether you have one branch for all expansions or a branch per ValueSet is server discretion</p>",
        "id": 153839737,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1468953224
    },
    {
        "content": "<p>You could file a tracker item for guidance. You could also see if a ConformanceProfile would be a suitable place for clients to find out server behavior for expansions. Or maybe ExpansionProfiles are a better place but I've not yet read what they do</p>",
        "id": 153839738,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1468953350
    },
    {
        "content": "<p>I think that if I were building a server I would keep static expansions handy for extensional and occasional expansional ValueSets and update them as I update the master ValueSet. For intentional ValueSets I would probably decide on a case by case basis.</p>",
        "id": 153839739,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1468953736
    },
    {
        "content": "<p>my server - and others - cache the results of $expand pretty aggresively. If you ask for the same expansion again, you'll get the same expansion. with the same <a href=\"http://expansion.id\" target=\"_blank\" title=\"http://expansion.id\">expansion.id</a>. </p>",
        "id": 153839746,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955431
    },
    {
        "content": "<p>the rule is simple: <br>\n- if the <a href=\"http://expansion.id\" target=\"_blank\" title=\"http://expansion.id\">expansion.id</a> is the same, the content of the expansion in the resource must be a perfect match. <br>\n- if the <a href=\"http://expansion.id\" target=\"_blank\" title=\"http://expansion.id\">expansion.id</a> is different, the content of the expansion may or may not be the same as any other expansion</p>",
        "id": 153839747,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955482
    },
    {
        "content": "<p>I think that answers Yunwei's queation, and I'd be happy to make more clarity on that </p>",
        "id": 153839748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> : you keep using this phrase: \"On any resource we have, that carry .url and .identifier, they point to the object they are on\"</p>",
        "id": 153839749,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955600
    },
    {
        "content": "<p>but this is not true. Take Patient, for instance; there can be multiple different patient resources, from diffrerent servers, with very different details , but they all have the same identifier, because they all describe the *same underlying idea*. </p>",
        "id": 153839750,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955656
    },
    {
        "content": "<p><a href=\"http://reosurce.id\" target=\"_blank\" title=\"http://reosurce.id\">reosurce.id</a> is the thing that points to the object</p>",
        "id": 153839751,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955701
    },
    {
        "content": "<p>I think I can finally follow that for .identifier. A person under SSN 12345 may have records in many EHRs. I'm not there yet for canonical URL, but if .url like you said is about that same \"idea\" then the same logic would apply</p>",
        "id": 153839759,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1468956214
    },
    {
        "content": "<p>Both URL and identifier are version-independent identifiers.  It's quite possible for there to be multiple instances on a server that share the same URL and business identifier for most/all conformance resources - that's why we have a business \"version\" element.  The tricky part here is that for an expansion, you might be talking about the same business version too - and we haven't talked about what happens if you find multiple instances on the same server that share both business identifier/canonical URL *and* business version.  So I think it makes sense for the value set resource to talk about that piece.</p>",
        "id": 153839827,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468965886
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> approach. I'm not following <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> situation...</p>",
        "id": 153839845,
        "sender_full_name": "Robert McClure",
        "timestamp": 1468967541
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I was just saying that having multiple instances on a server that share the same business identifier and canonical URL will be common (so that's not an issue), but having multiple instances that also share the same \".version\" value will be uncommon, so having some extra documentation on the ValueSet resource that discusses that (and points you to look at .expansion.id to disambiguate) would be useful.</p>",
        "id": 153839883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468969170
    },
    {
        "content": "<p>that's logically part of the documentation around persisting expansions</p>",
        "id": 153839884,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468969300
    },
    {
        "content": "<p>Since we seem to be reaching more and more conclusions and since my holiday starts a day from today: what to do with the tracker item that is in desparate need of more targeted text? <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> are you taking on to update that with what we came up here, or shall I? <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10375\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10375\">GF#10375</a></p>",
        "id": 153840036,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1469043451
    },
    {
        "content": "<p>well, let's just a dd areference to this topic to the task</p>",
        "id": 153840080,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469051313
    },
    {
        "content": "<p>Done</p>",
        "id": 153840208,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1469079675
    },
    {
        "content": "<p>thx</p>",
        "id": 153840209,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469079892
    },
    {
        "content": "<p>*.url is badly named (IMO) - it is not a Location, it is an Identifier - as I understand things, the \"URLness\" is actually a statement about its type</p>",
        "id": 153841376,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1469661066
    }
]