[
    {
        "content": "<p>I'm creating some Vital Signs profiles. We are following the HL7 base standard and implementing the \"magic codes\", however, we use SNOMED CT as our terminology rather than LOINC. The plan is to have a SNOMED equivalent to the LOINC \"magic code\", as well as allow a more details SNOMED expression. So, for example, a <br>\nBody weight vital sign <br>\nWILL HAVE a LOINC code 29463-7 , <br>\nWILL HAVE a SNOMED equivalent of 27113001, <br>\nand MAY HAVE a more specific SNOMED concept of 424927000 | Body weight with shoes. <br>\nOn the profile I want to make it as obvious as possible that you MUST have the LOINC code and the SNOMED equivalent - what's the best method to achieve this? For example by introducing mandated slices for LOINC &amp; SNOMED? Having the code bound to LOINC for the \"magic value\" as Extensible &amp; having a SNOMED slice? Just have some guidance against the code?<br>\nWhat I would really like is for instances to be computably checkable against the profile definition.</p>",
        "id": 154008543,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1539356549
    },
    {
        "content": "<p>It sounds like the best way to do what you are wanting is to have the mandated slices on Observation.code.coding for LOINC and SNOMED, with also an optional slice for the SNOMED expression.  The LOINC slice could have a required binding to the observation-vitalsignresult value set, which would allow only one of the \"magic value\" LOINC codes to be used, and then the SNOMED slices could be bound as you think is most appropriate.  I'm not thinking that we have an easy way to make a binding for the SNOMED slices that either requires a SNOMED pre-coordinated code or a compositional expression but does not allow both, but you may not need to go that far with it (we could at least exclude, but not require, compositional expressions in ValueSet/$expand, but not in ValueSet.compose).  That's my take.</p>",
        "id": 154008551,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1539358011
    },
    {
        "content": "<p>I think the technical details of how to say this are best discussed here: <a href=\"#narrow/stream/23-conformance\" title=\"#narrow/stream/23-conformance\">https://chat.fhir.org/#narrow/stream/23-conformance</a></p>",
        "id": 154008596,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539369737
    },
    {
        "content": "<blockquote>\n<p>WILL HAVE a LOINC code 29463-7 , WILL HAVE a SNOMED equivalent of 27113001, <br>\nand MAY HAVE a more specific SNOMED concept of 424927000 | Body weight with shoes. </p>\n</blockquote>\n<p>no other codes allowed? and really patient has to wear shoes?</p>",
        "id": 154008597,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539369844
    }
]