[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span>:</p>\n<blockquote>\n<p>There's absolutely NO EXCUSE for a system designed to support FHIR to have an easily accessible CSV distribution mechanism for value sets, BUT not to have a FHIR ValueSet distribution mechanism</p>\n</blockquote>\n<p>If you're referring to VSAC - I think you are - then they do have a FHIR API, but I can't make use of it, because it's password protected. I've asked for some arrangements to access the VSAC API so that we can leverage it but nothing has come of it yet</p>",
        "id": 205188958,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595901331
    },
    {
        "content": "<p>I'm actually referring to a different system, and the people who know the system know of my complaint.  VSAC has other problems, including basically no funding for any sort of infrastructure support to even respond to your feedback (or mine).  I've had several interesting e-mail conversations, but basically, it boils down to \"no budget\".</p>",
        "id": 205198091,
        "sender_full_name": "Keith Boone",
        "timestamp": 1595912008
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> asks</p>\n<blockquote>\n<p>the FHIR API provided by VSAC returns value sets with the following canonicals: <a href=\"http://cts.nlm.nih.gov/fhir/ValueSet/{oid}\">http://cts.nlm.nih.gov/fhir/ValueSet/{oid}</a>. Why does the VSAC package redefine the canonical?</p>\n</blockquote>",
        "id": 208279255,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598563911
    },
    {
        "content": "<p>in response to my message that:</p>",
        "id": 208279266,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598563918
    },
    {
        "content": "<blockquote>\n<p>we have a VSAC package now. To use it, you need something like this in your IG dependencies:<br>\nValue set canonical URIs are <a href=\"http://vsac.nlm.nih.gov/fhir/ValueSet/{oid}\">http://vsac.nlm.nih.gov/fhir/ValueSet/{oid}</a></p>\n</blockquote>",
        "id": 208279366,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598563963
    },
    {
        "content": "<p>The answer is that my records said otherwise, and I could get the API to run. Maybe I shouldn't have been in such a hurry.</p>",
        "id": 208279402,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598564003
    },
    {
        "content": "<p>so it looks like I should change the canonical to <code>http://cts.nlm.nih.gov/fhir/ValueSet/{oid}</code> but I don't want to change it more than once so I'm checking here to see if anyone knows a reason not to use the what vsac are using on their API (which has some experimental-ness to it)</p>",
        "id": 208279513,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598564070
    },
    {
        "content": "<p><code>cts.nlm...</code> looks like a system URL and <code>vsac.nlm...</code> looks like an institutional URI, and thus to be preferred; URIs should normally reflect the governing entity.<br>\nBut it's ultimately that entity's call.</p>",
        "id": 208921113,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1599109180
    },
    {
        "content": "<p>I'm not 100% sure, but I think <a href=\"http://cts.nlm.nih.gov\">cts.nlm.nih.gov</a> is: Clinical Terminology Services at the National Library of Medicine at the National Institute of Health.  I suppose it allows NLM to go beyond the scope of just VSAC in the service.  For me, my main concern was that NLM had already established the cts.nlm variant of the canonical, so I would prefer to not have a competing canonical hanging around.</p>",
        "id": 208956082,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1599134631
    },
    {
        "content": "<p>ok I release v0.2.0 of the vsac package with more vsac value sets in it - though not all of them. These have corrected canonical URLs</p>",
        "id": 209064847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599206015
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> VSAC FHIR representations of value sets should all have a canonical of <a href=\"http://cts.nlm.nih.gov/fhir/ValueSet/{oid}\">http://cts.nlm.nih.gov/fhir/ValueSet/{oid}</a>. Are you saying you found different, or was it that you guessed different?</p>",
        "id": 209574241,
        "sender_full_name": "Robert McClure",
        "timestamp": 1599688958
    },
    {
        "content": "<p>poor record keeping on my part, yes</p>",
        "id": 209575557,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599689938
    }
]