[
    {
        "content": "<p>During our ValueSet Expansion call today we were wondering what existing FHIR Terminology server implementations are using to populate <a href=\"http://hl7.org/fhir/extension-valueset-expansionsource.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-valueset-expansionsource.html\">http://hl7.org/fhir/extension-valueset-expansionsource.html</a>. We think this should be some sort of direct link to the actual physical versioned value set definition that was used to create the expansion. Can someone that has implemented this (or plans to) comment?</p>",
        "id": 161780108,
        "sender_full_name": "Robert McClure",
        "timestamp": 1553618577
    },
    {
        "content": "<p>What is the difference between this extension and ValueSet.url property?</p>",
        "id": 161785581,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1553622052
    },
    {
        "content": "<p>ValueSet.url is the canonical identifier for the value set.  expansion-source is the URL of the terminology server that provides authoritative expansions.</p>",
        "id": 161787520,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553623253
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 161788369,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1553623784
    },
    {
        "content": "<p>The definition of the extension says \"The logical URL of the ValueSet definition that was used to generate this expansion.\"<br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> you mean it should be the url of the server not of the value set?</p>",
        "id": 161789415,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1553624499
    },
    {
        "content": "<p>Yeah, that definition makes absolutely no sense to me.</p>",
        "id": 161789754,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553624776
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 161789765,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553624784
    },
    {
        "content": "<p>I have not implemented this, and I'll be surprised if anyone else, since it's a real corner case that arose from the VSD project. I think the definition is broken in that it should say 'literal URL' not logical URL</p>",
        "id": 161802430,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553634124
    },
    {
        "content": "<p>value set definitions don't have independent urls<br>\nit would be the canonical url of the value set (ValueSet.url) that contains the 'compose' that the expansion was generated from<br>\nand it's not needed except in the case of a \"bare\" expansion which is persisted and distributed without the compose (not generally good practice, imo, but not explicitly disallowed)<br>\nI think actually, if this is done at all, the canonical url should be the same both with and without the 'compose' present, so if we did that then it doesn't seem like there would be a need to have the extension<br>\nmaybe I'm forgetting something from our earlier discussion, but if I am I can't remember what it is :)<br>\nthe extension documentation at present doesn't offer any useful explanation</p>",
        "id": 161811435,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1553641678
    },
    {
        "content": "<p>the thing was if the value set had moved from it's canonical url</p>",
        "id": 161825608,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553657456
    },
    {
        "content": "<p>As I alluded to in my OP, I'd agree with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> that what makes sense to me, FWIW, is this would be the \"Literal url\" of the specific resource instance used to create the expansion. Of course, that should be a versioned instance of the value set.  I'll note, this is not the \"trusted -expansion\". If that suggestion doesn't fly, then I'd be ok with expansionSource holding a <em>versioned</em> canonical url for the value set resource actually used to generate the expansion.</p>",
        "id": 162076739,
        "sender_full_name": "Robert McClure",
        "timestamp": 1553887518
    },
    {
        "content": "<p>the value set already has url + version in it; no need to repeat that somewhere. I think it's the literal source not the canonical url</p>",
        "id": 162076838,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553887624
    },
    {
        "content": "<p>What is the difference between literal source and canonical url?</p>",
        "id": 162140663,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1553982903
    },
    {
        "content": "<p>canonical URI is fixed in the resource and doesn't change as you move it around. Literal URL is where you actually got it from - which might be some repository or cache</p>",
        "id": 162150950,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553999465
    },
    {
        "content": "<p>e.g. I can get R3 canonical http:/hl7.org/fhir/ValueSet/yesnomaybe from  the literal location http:/hl7.org/fhir/STU3/ValueSet/yesnomaybe</p>",
        "id": 162150997,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553999524
    },
    {
        "content": "<p>Agree with Grahame and Rob, that Valueset-expansionSource would be the \"Literal url\" of the specific resource instance used to create the expansion</p>",
        "id": 162548042,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1554398804
    }
]