[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and I have a disagreement.  He believes that if a CodeSystem instance has a content type of 'example' it means that the codes it declares aren't necessarily even real codes of the code system.  I don't understand why that would ever make sense.  I believe that the codes in a CodeSystem instance (whether complete, fragment, supplement or example are <em>always</em> valid codes.  What makes a CodeSystem instance is that it's just a small semi-random subset of valid codes (unlike fragment which is a complete set of codes of a specific subsection of a code system, supplement which only lists the codes its supplementing, and complete which lists everything.</p>\n<p>Does anyone else thing that the codes where the content is only 'example' don't have to actually be valid codes from the code system in question?</p>",
        "id": 270873658,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644129271
    },
    {
        "content": "<p>The definition in the <a href=\"http://hl7.org/fhir/codesystem-codesystem-content-mode.html#codesystem-content-mode-example\">R4 specification</a> states that...</p>\n<blockquote>\n<p>A few representative concepts are included in the code system resource. There is no useful intent in the subset choice and there's no process to make it workable: it's not intended to be workable</p>\n</blockquote>\n<p>That suggests to me that it's the subset of concepts that aren't workable, not that the individual example concepts can be bogus. If the intent is to permit the inclusion of invalid concepts, maybe it should say a 'few random example or bogus concepts', rather than 'representative' which conveys some degree of meaning.</p>",
        "id": 270879124,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1644137778
    },
    {
        "content": "<p>right. Some degree of meaning, but 'representative' does not require them to be valid</p>",
        "id": 270910932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644180532
    },
    {
        "content": "<p>the core of this issue is that when the validator encounters a code from an example code system (not an example binding), it puts a warning - not an error - against the code saying that because the code system is incomplete, the validator can't be sure that this is a valid code. This is something that we agreed during the UTG development work. I think it's the right thing to do too, but Lloyd strongly disagrees - if it's in the example codes, then it's known to be valid. I don't see that the language says that.</p>\n<p>This was caused by the fact that an Hl7 defined code system has content = example in THO. I'm not at all clear what that means if it doesn't mean 'these are the kind of concepts you might see in a code system like this'.</p>",
        "id": 270911038,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644180690
    },
    {
        "content": "<p>the code system should not be an example, so I think that the validator is doing the right thing here</p>",
        "id": 270911045,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644180706
    },
    {
        "content": "<p>We're talking about a <em>real</em> code system here.  E.g. SNOMED, LOINC, UCUM, whatever.  However, we're <em>not</em> exposing the entire code system, just some examples.  Why would we allow them to be invalid codes?</p>\n<p>If you're wanting to define fake codes, then define a real code system - with content=complete and flag it as 'experimental' and ideally put \"example\" in the canonical URL.</p>",
        "id": 270914622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644185214
    },
    {
        "content": "<p>There shouldn't <em>ever</em> be an 'example' instance of a code system that doesn't correspond to a real full-fledged code system.  The whole point is to expose a limited subset of the 'real' codes when it's not practical to show all of them.  Perhaps because of licensing issues, perhaps because of volume issues.</p>",
        "id": 270914710,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644185295
    },
    {
        "content": "<p>What is the point of a code system whose codes aren't real codes?</p>",
        "id": 270914723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644185317
    },
    {
        "content": "<p>Then why have the content type 'example' in the first place if you have rule that states that if the url of the codesystem starts with <code>http://example.com/...</code>then some special rule apply?</p>",
        "id": 270914843,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644185470
    },
    {
        "content": "<p>to me, the codes can be real or not. It does not matter because:</p>\n<blockquote>\n<p>it's not intended to be workable.</p>\n</blockquote>",
        "id": 270915201,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644185907
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179202-terminology/topic/What.20are.20'example'.20code.20systems/near/270914723\">said</a>:</p>\n<blockquote>\n<p>What is the point of a code system whose codes aren't real codes?</p>\n</blockquote>\n<p>The very first CodeSystem resource that I created was a pure example, with no intention for it to be used for any other purpose. It contained 4 valid concepts - but all identified with fabricated codes and I set the CodeSystem.experimental property to true. However, I didn't set the content type to example as it was conceptually complete (i.e. contained all 4 NZ regions), but perhaps I should have done so?</p>",
        "id": 270915957,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1644187158
    },
    {
        "content": "<p>no that's an example code system with complete content, not a code system with example content (which implies to me that there's real content out there somewhere)</p>",
        "id": 270916032,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644187271
    },
    {
        "content": "<p>though perhaps, with this subject, it's the truth that's out there.</p>",
        "id": 270916035,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644187285
    },
    {
        "content": "<p>somewhere</p>",
        "id": 270916036,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644187287
    },
    {
        "content": "<p>We can create example codes systems with 'complete' content.  We do it regularly.  And we can strictly validate against those example code systems.  We also need CodeSystem instances for validation purposes that don't contain a complete set of codes - or even a complete 'area' of a code system, but which are sufficient to validate a set of examples or to give implementers an idea of the kinds of codes that exist without exposing details of the code system.  That is what we defined the 'example' contentType for.  </p>\n<p>I haven't yet heard a use-case for having a code system that contains codes that can't safely be validated against that code system.  <em>Why</em> would we want to do that?</p>",
        "id": 270918731,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644191284
    },
    {
        "content": "<p>Maybe 'sample' is a better name for  codesystem-content-mode 'example' under Lloyd's interpretation.</p>",
        "id": 270919874,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1644192916
    },
    {
        "content": "<p>It's normative, so hard to change the name now.  Though we can still clarify the definition.</p>",
        "id": 270920111,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644193264
    },
    {
        "content": "<p>we can add a code. I'm just pointing out that Lloyd's definition is wishful thinking. Maybe reasonable wishful thinking, but nevertheless, the validator has to go by what's written</p>",
        "id": 270920850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644194383
    },
    {
        "content": "<p>The text \"A few representative concepts are included in the code system resource. \" uses <strong>concepts</strong> rather than <strong>codes</strong> . A super close reading would say it does not require the codes to be representative, just the concepts.</p>",
        "id": 270921076,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1644194679
    },
    {
        "content": "<p>What's written in no way says that the codes don't have to be valid - that's your interpretation.  And it's an interpretation that doesn't seem to be driven by any actual requirement...</p>",
        "id": 270923935,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644198777
    },
    {
        "content": "<p>No one has disagreed with your statement of what HL7 wants to do,  but no one has agreed with your interpretation of what's allowed.</p>",
        "id": 270932407,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644209376
    },
    {
        "content": "<p>I think if you profile and wish to have a binding that indicates meaningful codes, then I thought 'preferred' would be used. That would say that the codes are real, and valid, and that you could have other codes used alternatively to the ones provided. It is a tighter binding but allows example to keep example's loose definition (unreliably representing true/valid codes).  Seems to be a choice based on the what the profiler is wishing to say.</p>",
        "id": 270933108,
        "sender_full_name": "Bret H",
        "timestamp": 1644210197
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - I haven't heard anyone agree that the codes in an 'example' content don't have to be valid codes.  And I think Peter and Richard have both indicated that they need to be valid codes.</p>",
        "id": 270996961,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644248626
    },
    {
        "content": "<p>To be clear here, we are discussing what does it mean when a code system resource has CodeSyste.content=example. Nothing more. </p>\n<p>Understanding that this may be considered by some as revisionist, but I think .content=example has no useful meaning. </p>\n<ol>\n<li>If you are making a \"test\" or example code system with made up content that you are not doing real work with, then set codesystem.experimental = T.  I assume in these cases you would want to see content=complete. I see no additional value in using something different in this case but am open to justifications on how this should not be true. Given we are talking about publisher changes no matter what, saying \"that is not how the publisher works\" is not sufficient. <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>'s code system should be one of these.</li>\n<li>I do agree with Lloyd that within the FHIR ecosystem, if you publish a codesystem resource, you have \"made\" a real code system representation and any concepts included should be considered real concepts in the code system and they should validate normally. </li>\n<li>I disagree with Lloyd's presumption that a content=fragment is expected to be a well-formed subset or sub-hierarchy of the code system. A fragment is what it says, a not-complete set of concepts from the code system. To my mind \"example\" subsets of code systems maintained elsewhere are not example code systems, they are fragments of a code system defined elsewhere (potentially as a FHIR resource, but not necessary.) Again, if you point to that resource for validation, if the code exists, it validates. If it does not, then warning is appropriate. </li>\n<li>Given the above, Id assume that all existing FHIR code system resources with content=example are likely either experimental plus complete, or are fragments. There is no need for content=example. let's remove the problem by fixing our content.</li>\n</ol>",
        "id": 271009891,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644253751
    },
    {
        "content": "<blockquote>\n<p>Peter and Richard have both indicated that they need to be valid codes</p>\n</blockquote>\n<p>OK. I misread Peter but Richard says:</p>\n<blockquote>\n<p>A super close reading would say it does not require the codes to be representative, just the concepts</p>\n</blockquote>",
        "id": 271021814,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644258567
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> well, the problem with that is that example is normative. And also, content = example is orthogonal to code system = experimental. The content is an example if (a) the details haven't been worked out yet or (b) we haven't worked out what subset of a real code system are going to be included, so we just putting some 'representative' examples in.</p>\n<p>Obviously the key word here is 'representative'.</p>",
        "id": 271022165,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644258690
    },
    {
        "content": "<p>Let's talk about the use-cases:</p>\n<ul>\n<li>we have a use-case for subsets of codes where the subset represents a logical \"partition\" of the set of codes.  This might be for maintenance reason (different partitions maintained by different groups), size reasons (we only care about procedure codes, not other codes, so want to publish a lighter weight version to save bandwidth/storage/memory), or licensing (we distribute the 'free' codes as a separate distribution so that those can be easily downloaded/used).  In all of these cases, for a particular use, the codes in the partition are 'sufficient and useful' for real-world validation</li>\n<li>we have a use-case where we can't/don't want to distribute the whole set of codes (typically size or licensing), but we want to a) give an idea of the kinds of codes that exist in the system and/or b) want to be able to validate the codes in our example instances.  However, the set of codes is NOT sufficient to use to validate instances in any real-world production environment.  (You might get lucky and be able to validate a few codes you see in production, but you couldn't count on validating many/any</li>\n</ul>\n<p>Those are not the same use-case and it's useful to distinguish which you have.  The first are useful for production terminology servers to have if they don't have the full code system available.  The latter are only useful for 'publication' terminology servers.  They have essentially no utility for production servers.</p>\n<p>We have <em>no</em> use-case for a code system that represents a subset of codes from another code system, where that subset of codes aren't expected to actually be valid codes from the base code system.  It may be that the current wording of 'example' doesn't specifically exclude that scenario, but given that there's zero value in that scenario, it seems reasonable to close that loophole and make it explicit that's not allowed.</p>",
        "id": 271023030,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644259077
    },
    {
        "content": "<p>If you have a code system where the details aren't worked out yet, then the status is 'draft' and the content is 'complete'.  If you haven't worked out what subset of codes you're going to include, that's fine.  It can still be 'draft' and can be 'example', but the codes that you've included (for now) darn well better be valid codes.</p>",
        "id": 271023190,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644259169
    },
    {
        "content": "<blockquote>\n<p>There is no need for content=example</p>\n</blockquote>\n<p>I agree. What would it even mean if it ended up in production?</p>",
        "id": 271028953,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644261699
    },
    {
        "content": "<p>If the only thing you have for a code system is a content='example' instance, then you'd be able to validate a tiny subset of codes.  It's not super useful, but it's better than nothing.  It's certainly not 'dangerous' to have it in production.  (Or at least, it won't be so long as we agree that content=example doesn't mean that the codes can be invalid.)</p>",
        "id": 271043637,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644268985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> - are you suggesting that the two use-cases I described aren't useful ones to disambiguate?</p>",
        "id": 271043671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644269009
    },
    {
        "content": "<p>I'm saying that having content=example is a scenario I have never experienced the need for. Your first use case sounds like the use of fragment would fit. The second case I don't get. We're building specs here - hence 'giving and idea' doesn't really make the cut.</p>",
        "id": 271045474,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644269882
    },
    {
        "content": "<p>When using the status instead with the value 'draft' you're indicating that you are in the process of finding out what the contents are</p>",
        "id": 271047332,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644270567
    },
    {
        "content": "<p>That is a better way to signal the intention, IMHO.</p>",
        "id": 271047371,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644270598
    },
    {
        "content": "<p>Let me flesh out the second scenario a bit.  We have a spec that references X12 codes.  X12 requires a license to access their terminologies.  However, they give us permission to publish 10 codes that show the breadth and level of detail that implementers can expect, and we can create validatable examples so long as we stick to those 10 codes.  A license is till needed to use those codes in real systems.  That's the sort of use 'example' was envisioned for.</p>",
        "id": 271048268,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644271060
    },
    {
        "content": "<p>It sounds like 'sample' would have been a better pick than 'example' - but my native tounge is not english so I might be wrong. Anyways - I haven't encountered such a case myself before. I see the problem, but I don't think the solution is the right one. If a clientt of mine had made such a request (me defining an interface with such terminology constraints), I would have had the customer to go talk to the X12 guys to find out what the real issue is/was.</p>",
        "id": 271050033,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644271914
    },
    {
        "content": "<p>Since you have been given the permission to use 10 of the codes it sounds like you have done exactly that</p>",
        "id": 271050163,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644271971
    },
    {
        "content": "<p>The issue is real.  There's no way X12 will let us expose all of their codes in a FHIR publication.  That's not going to change.  They could theoretically let us expose 10 or so codes.  content=example is <em>only</em> really useful on the publication side of things.  It's not something I'd ever expect to see used or sought on the implementation side.</p>",
        "id": 271051293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644272345
    },
    {
        "content": "<p>On the implementation side, you'd have to use a terminology server that was licensed and that enforced that its users were licensed.  And then you'd have access to a 'complete' code system.</p>",
        "id": 271051344,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644272384
    },
    {
        "content": "<p>Have you had the need for any other cases besides X12?</p>",
        "id": 271051769,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644272600
    },
    {
        "content": "<p>The use-case would hold for any proprietary terminology or situation where the full terminology wasn't available in computable form, but you wanted to expose a subset of it in FHIR to help in the review of a spec.</p>",
        "id": 271055710,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644274672
    },
    {
        "content": "<p>Yes, but have you encountered it elsewhere?</p>",
        "id": 271086866,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644302183
    },
    {
        "content": "<p>I agree that the need for a subset of codes made available as a sample subset is definitely real. We are working with a code system used to describe social services - 211LA - where providing a sample we can display and include in specs may be all we get. But identifying this as \"Example\" is not useful as a content description where as it is <strong>exactly</strong> the same as a fragment because <em>it is a fragment</em> that happens to also be, in this case, an IP-defined sample of the full set. I agree with Lloyd's use cases but I see no justification for the use of \"Example\" as a content type, normative or not. The idea that you have a sample set that is restricted due to IP would - must - be noted in the copyright section. So I have not heard a single compelling reason to use \"Example\" content designation. In fact, it is confusing and burdensome because you have to treat it as a fragment.</p>",
        "id": 271127557,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644327294
    },
    {
        "content": "<p>The need for sample (I like that word for use-case 2 as well), is real for specifications that are more general-use. They would be unacceptable for specifications that are specific to a policy space (like a regional deployment committee). This distinction is what I think is the difference in perspective between Lloyd and Jens.</p>",
        "id": 271138106,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644331604
    },
    {
        "content": "<p>true made-up codes are also equally only going to be useful in higher level specifications, and would be totally unacceptable in a regional deployment specification. But I do think that there are cases where a fully made-up set of codes is used is a very high level specification. Certainly would be true with logical models.  But I think this valueSet would need to be very well marked to show that it is not production worthy in any way, and would never be used to validate. This last clause is the hard one, but is important. I am sure we all have seen someone using purely made-up codes in a production system, because that code was part of an example.  -- is this type of valueSet part of the discussion?</p>",
        "id": 271138759,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644331862
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> The difference is really the scope of the sample.  \"Example\" is a sample of codes intended for human review and to support publishing, but nothing else.  \"Fragment\" is a sample intended to be sufficient for production use where all that's needed is a particular subset.  I think that differentiating between those two is useful to real-world systems.</p>\n<p>Note that value sets aren't impacted by complete vs. fragment vs. example code systems.  ValueSets are defined against the 'system' in general.  The terminology server will grab the 'complete' code system if it can.  If it can't, it'll grab fragments or, worst case, examples.  In the latter two cases, it can determine that codes are valid, but it can't determine that codes are invalid.  Value sets are never defined as specifically being against a fragment or example CodeSystem instance.  However, the expansions may end up being generated against one.</p>",
        "id": 271140479,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644332604
    },
    {
        "content": "<p>(or more)</p>",
        "id": 271140485,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644332607
    },
    {
        "content": "<p>I get the <code>restricted due to IP</code>-argument - I just haven't encountered it. Is it a very US-specific thing?</p>",
        "id": 271176290,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644347311
    },
    {
        "content": "<p>Not necessarily.  Organizations anywhere can be pretty sensitive around the use of their IP.  Obviously, there are some challenges around restricted IP when its mandated for use in information sharing, but it happens.  I'm not familiar with any specific examples in Canada (where I'm from), but that doesn't mean there aren't any.  I'm sure there are examples in other corners of the world.  Quite frankly, 10 years ago, there could have been similar issues with someone else publishing HL7's v2 codes.</p>",
        "id": 271184138,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644351084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> it might make it easier for you if you think an 'example' as an unauthorised fragment in your context. But critically, we have not said that the representative codes in the example SHALL be valid codes in the actual code system</p>",
        "id": 271185011,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644351507
    },
    {
        "content": "<p>MedDRA is international and requires a subscription to access their codes.</p>",
        "id": 271190709,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1644354262
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> We also haven't said they're allowed not to be.  You could infer either way from reading the definition.  And there's <em>no use-case</em> for them to not be valid codes.  So, given that the definition isn't super clear, the use-case we're aware of requires valid codes and we're not aware of a use-case that requires invalid codes, why don't we seek opinions from implementers about whether they ever use content='example' to refer to an existing code system and list codes that aren't actually valid codes?  If no-one says they do that, then we can reasonably 'clarify' the description to make clear the expectation that the codes must be valid.</p>",
        "id": 271196274,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644357072
    },
    {
        "content": "<p>I think there are times when there is a need for a ValueSet / CodeSystem that is purely made-up codes. Especially with logical models. The higher the model the more likely.. I think.</p>",
        "id": 271196431,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644357155
    },
    {
        "content": "<blockquote>\n<p>And there's no use-case for them to not be valid codes</p>\n</blockquote>\n<p>You haven't made that case. You've consistently demonstrated that <em>we</em> don't have a use case, not that there is no use case. </p>\n<blockquote>\n<p>why don't we seek opinions from implementers about whether they ever use content='example' to refer to an existing code system and list codes that aren't actually valid codes</p>\n</blockquote>\n<p>I'm good with that. If we say that the intent of 'representative' is that the codes must be valid, not merely illustrative, and that we are aware that this is subject to interpretation, and so we're seeking implementer feedback for whether this would be very widely regarded as a clarification, not a substantive change, then that's procedurally ok, at least.</p>",
        "id": 271196640,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644357266
    },
    {
        "content": "<p>Sure.  But that's a CodeSystem with content=complete.</p>",
        "id": 271196651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644357272
    },
    {
        "content": "<p>and experimental = true too</p>",
        "id": 271196681,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644357286
    },
    {
        "content": "<p>right.</p>",
        "id": 271196697,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644357293
    },
    {
        "content": "<p>I might be thinking more about example scenarios using purely made-up codes. If that is out-of-scope then I appologize. But I think we even have cases for use of made-up (clearly made-up) organizational structural roles, so that an element can have some binding, because some binding is needed.</p>",
        "id": 271196700,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644357295
    },
    {
        "content": "<p>And ideally, url containing the word \"example\"</p>",
        "id": 271196723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644357307
    },
    {
        "content": "<p>You can also just use a code system with a URL based in \"<a href=\"http://example.org\">http://example.org</a>\" and the validator will happily take whatever you wish.</p>",
        "id": 271196831,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644357351
    },
    {
        "content": "<p>right, that is what I would tend to do with purely made-up codes. if that is all that is necessary, then fine.</p>",
        "id": 271196925,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644357382
    },
    {
        "content": "<p>when this is all figured out... would be nice if there was a logic diagram drawn up with conclusions for each branch.</p>",
        "id": 271197098,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644357482
    },
    {
        "content": "<p>I think what is going with the desire for Example content is that Fragment is IMO too narrowly defined, yet it is Normative tho so we're stuck. </p>\n<p>There are <strong>M A N Y</strong> code system resource instances out there that are not complete, yet are not \"a curated subset released for a specific purpose under the governance of the code system steward, and that the intent, bounds and consequences of the fragmentation are clearly defined in the fragment or the code system documentation.\" I think the requirement for steward curation of a Fragment is overly demanding and <strong>not</strong> followed by FHIR server implementers.  I'd be very interested in understanding how you all implement code system resources that are not complete. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> do you have any code system resources in your server that are marked Fragment content but not curated? If so, how is that justified? Are you assuming that anything not officially curated by the authority is an Example? </p>\n<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  Is every code system resource you store that is marked as \"Fragment\" officially curated and defined by the steward?</p>",
        "id": 271310913,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644426230
    },
    {
        "content": "<p>No, I know of a some where that is not the case - and 'fragment' has intentionally been used in a broader sense (mainly because that was what was needed and there really wasn't any other obvious way to do it).  There are some of those in <a href=\"http://tx.fhir.org\">tx.fhir.org</a>.  There has been at least a little discussion (somewhere?) about the need to broaden the definition and understanding of 'fragment' to be more realistic for most potential uses.</p>",
        "id": 271312880,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1644426929
    },
    {
        "content": "<p>Even if we broaden the definition of 'fragment', is there utility in differentiating between fragments that are intended for publication purposes only (i.e. a smattering of example codes) vs. fragments that are truly a \"curated subset released for a specific purpose with clearly defined intent, bounds and consequences\" defined that are intended to support implementation (whether managed by the code system steward or not)?  My assumption was that terminology servers would care about that difference.  If they don't, I'm happy to deprecate 'example' and clarify that fragment can be broader.</p>",
        "id": 271318036,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644428639
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I do not know the answers to your question because I only provide infrastructure. it's the code system authors who make those decisions. I have never authored a code system with content = fragment or example.</p>",
        "id": 271339416,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644437039
    },
    {
        "content": "<p>but note this:</p>\n<blockquote>\n<p>Are you assuming that anything not officially curated by the authority is an Example?</p>\n</blockquote>\n<p>You switched words there, and it matters. The curation does not have to be by the authority.</p>",
        "id": 271339601,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644437093
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191503\">Robert McClure</span> <a href=\"#narrow/stream/179202-terminology/topic/What.20are.20'example'.20code.20systems/near/271310913\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191364\">Peter Jordan</span> <span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <span class=\"user-mention silent\" data-user-id=\"191343\">Michael Lawley</span>  Is every code system resource you store that is marked as \"Fragment\" officially curated and defined by the steward?</p>\n</blockquote>\n<p>There aren't any CodeSystem resources on my server where content=fragment. The closest is UCUM, where content=non present, but it's effectively supporting the subset of common UCUM Codes. My understanding is that it can't be defined as a fragment unless the concepts are in the resource -but happy to be corrected if that's not true. :)</p>",
        "id": 271353791,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1644444084
    },
    {
        "content": "<p>My understanding is that only the CodeSystem owner is allowed to produce a fragment. Hence if you want to produce a snomed CodeSystem resource with just a few codes (IP constraint), then you need to use example.</p>",
        "id": 271355003,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1644444641
    },
    {
        "content": "<p>I am struggling to come up with a use case where you'd have example codes that were not valid codes.<br>\nAnd, I would not be surprised if validation treated all example codes as valid; they are supposed to be representative after all <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> observation about concept vs code notwithstanding.</p>",
        "id": 271355547,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1644444908
    },
    {
        "content": "<p>Now, having just written this I am recalling the many occasions where I scribble down 'snomed' examples with codes like 12345678.<br>\nStill, I might want my validation to say ok, but include an additional warning that the code system itself is \"suspect\"</p>",
        "id": 271356004,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1644445114
    },
    {
        "content": "<p>Why would you want validation to say 'ok'??</p>",
        "id": 271364431,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644449993
    },
    {
        "content": "<blockquote>\n<p>My understanding is that only the CodeSystem owner is allowed to produce a fragment</p>\n</blockquote>\n<p>no. And this is important, and the language was chosen carefully. A code system can only be labelled a fragment if the code system 'owner' publishes it themselves, or defines a process by which other organisations can do that</p>",
        "id": 271372850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644455160
    },
    {
        "content": "<p>can a recommendation on how to include in an IG an example codesystem be expressed in detail? Just tried to use content = #example and get errors from the IG publisher. Is there a project that has done this properly?</p>",
        "id": 271449518,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644507875
    },
    {
        "content": "<p>You don't want content=example for example code systems.  If you're making up an example code system, content should be \"complete\", URL should reflect that it's an example-only (I like \"example-do-not-use\" as part of the URL), and experimental should be true.</p>",
        "id": 271455423,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644510165
    },
    {
        "content": "<p>so what is content=example used for?</p>",
        "id": 271459224,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644511743
    },
    {
        "content": "<p>in this thread <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> indicated content=example... so I presumed that was the recommendation.</p>",
        "id": 271459806,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644512002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> My position on this is Example as a content type <strong>is not needed</strong> because, and Lloyd is now coming to the same conclusion, if you make up a code system resource with codes in it to be used as \"example ideas\", then your \"example\" code system is \"content = complete\" and it is my opinion that you should also set \"experimental = T\". I'd support including \"example\" in the defining url so its intended use is clear, as Lloyd has requested. </p>\n<p>I say this in part because, as others have also noted, \"content = fragment\" is already used in a broader way, in <a href=\"http://tx.fhir.org\">tx.fhir.org</a> and I suspect other places such as IGs, to mean \"just a subset of the full code system.\" I see no need to identify that that subset is \"officially curated by the steward\" (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , that is the wording and it's pretty restrictive) and have not heard any use case to support keeping it worded that way.</p>",
        "id": 271485360,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644522879
    },
    {
        "content": "<p>so then we should not have any content=example in THO?</p>",
        "id": 271487028,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644523603
    },
    {
        "content": "<p>for example endpoint service type codes that I am trying to use today... but get a constant error from the IG publisher... because in THO it is marked as content=example<br>\n<a href=\"https://terminology.hl7.org/3.0.0/CodeSystem-service-type.html\">https://terminology.hl7.org/3.0.0/CodeSystem-service-type.html</a></p>",
        "id": 271487290,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644523726
    },
    {
        "content": "<p>yes that code system is driving all this because it shouldn't be content = example.</p>",
        "id": 271488983,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644524559
    },
    {
        "content": "<blockquote>\n<p>\"officially curated by the steward\" </p>\n</blockquote>\n<p>That is not the wording. I've already said that several times. It's \"curated by someone, under the rules approved by the code system owner\"</p>\n<p>So we don't sanction publishing bootleg fragments of SCT, for instance.</p>",
        "id": 271489113,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644524628
    },
    {
        "content": "<p>content = example would be for code systems that really exist, but can't be published. X12 code systems, or CPT, where we have permission to publish examples with a few codes</p>",
        "id": 271489217,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644524667
    },
    {
        "content": "<p>the code system is not an example, but the concepts provided aare.</p>",
        "id": 271489248,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644524681
    },
    {
        "content": "<p>this is a real use case, and I don't see why it should go away. The discussion is about whether, in that case, the 'representative codes' are required to be actually valid codes or whether they can just represent the kind of codes you might find</p>",
        "id": 271489343,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644524736
    },
    {
        "content": "<p>I think we do need a way to define useful code system 'fragments' that are \"user defined\" - not only ones that are specifically created by the code system owner.  Even if they are created \"under the rules approved by the code system owner\", that's not particularly helpful if the code system owner hasn't actually created any rules for this - unless there is also a clause that states something like \"if the code system owner has not defined rules for the creation and use of fragments of the code system, then users may define and use fragments that meet their specific needs\".  It seems like this is something that shouldn't be entirely (and probably often unnecessarily) prohibited.</p>",
        "id": 271491349,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1644525822
    },
    {
        "content": "<p>I think that's taken for granted, in practice, but it would be good to say that somewhere</p>",
        "id": 271493948,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644527036
    },
    {
        "content": "<p>If we were to have an content=example in THO, it would be something like \"here are 10 of the 1000+ codes from X12 codesystem 123\" - in the event we were to ask for permission to do that and they gave it.  There should <em>never</em> be a CodeSystem where the canonical URL is from <a href=\"http://hl7.org\">hl7.org</a> that has a content other than 'complete'.</p>",
        "id": 271496190,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644528061
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179202-terminology/topic/What.20are.20'example'.20code.20systems/near/271487290\">said</a>:</p>\n<blockquote>\n<p>for example endpoint service type codes that I am trying to use today... but get a constant error from the IG publisher... because in THO it is marked as content=example<br>\n<a href=\"https://terminology.hl7.org/3.0.0/CodeSystem-service-type.html\">https://terminology.hl7.org/3.0.0/CodeSystem-service-type.html</a></p>\n</blockquote>\n<p>here is one</p>",
        "id": 271496265,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644528112
    },
    {
        "content": "<p>Right.  I've submitted a tracker item for PA to get that one fixed</p>",
        "id": 271517728,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644541436
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Stamping your feet and saying fragments are special 1) does not make it so in the community of practice, and 2) still has <strong>no</strong> demonstrated value - you've not proven your point by repeated saying it. There is no value in creating one subset of existing codes as Example, and another as Fragment.  You have not made the case. What is a user supposed to do with a code system example that they are not to do with a fragment, or with a fragment that can not be done with an example?</p>\n<blockquote>\n<p>content = example would be for code systems that really exist, but can't be published. X12 code systems, or CPT, where we have permission to publish examples with a few codes</p>\n</blockquote>\n<p>I see no useful distinction in this use case. It is a fragment. The IP dictates the reusability <strong>as it aways has</strong>, not the content type. If you publish any codes, follow the IP - always.</p>",
        "id": 271637556,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644613951
    },
    {
        "content": "<p>what I've been 'stamping my feet about' is that fragments are not necessarily curated by the code system owner, since you keep saying that but the standard is not saying that</p>",
        "id": 271638334,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644614326
    },
    {
        "content": "<p>for me, the difference is in intent: a fragment is meant to be useful for some use case, comprehensive. For instance, an edition distribution of SCT. Consult the document, check the intent of the fragment, go ahead and use it for the intent. In production.</p>\n<p>An example, on the other hand, makes no claim of suitability for any use in production at all. Here's some example codes for this code system. The intent is clear: if you want to use this code system for anything, you need to go and find usable content. </p>\n<p>I think that's a pretty big difference. Of course, people could make a mess of that by mislabelling their intent, but that doesn't mean that we can't differentiate the ideas</p>",
        "id": 271638622,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644614483
    },
    {
        "content": "<blockquote>\n<p>If you publish any codes, follow the IP - always.</p>\n</blockquote>\n<p>Sure. but we have code systems for which the IP is \"you can publish a few examples so people understand how it's used, but you can't publish more than that\"</p>",
        "id": 271638754,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644614539
    },
    {
        "content": "<p>I understand you are focused on <em>usability in production systems</em> as the value proposition but I'm struggling to understand how that is really useful. Are you are saying that a production server, when given multiple resources to choose from for the same code system would  not pick a resource to use that is content example and instead go searching for one that is complete or a fragment, and if there are multiple, pick the one with the largest set of concepts? What if the bigger one is content = example? ignore it? I think the question of what code system resources should production servers copy into their environment is a much more complicated question then this, and example <em>would still have real concepts</em> just like a fragment, ie, it's a distinction without a difference. If the FHIR server is using a TS and wants to know, is the code system you have an example or fragment - why does it matter??</p>",
        "id": 271640995,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644615230
    },
    {
        "content": "<p>yes it would ignore it, and I would think that a production server would start with a rule that content = example resources are not loaded.</p>",
        "id": 271642436,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644616063
    },
    {
        "content": "<p>but yes, it's in general much more complicated than that. And content = example is a statement of intent, I agree, and so it's less absolute than the difference between not-present, fragment and complete. Sure.</p>",
        "id": 271642571,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644616128
    },
    {
        "content": "<p>The main difference is that if a TS understands the scope of the fragment and of the value set, it can (in some cases at least) make a positive assertion of \"this code is not valid\".  E.g. if you have a fragment that is all SNOMED procedure codes from the U.S. and you have a value set that is \"all U.S. SNOMED codes that are specializations of heart surgery\" (forgive the example), then if a code is sent and isn't found in the code system, you know it's not valid against the value set, even if you can't definitively say it's not a valid SNOMED code overall.  On the other hand, if you had a content=example code system, you can't make any assertions at all about a code that isn't found because there's no logical organization to the subset of codes you have.</p>\n<p>That said, we don't have a computable mechanism right now that expresses the basis for a fragment - that would need to be passed as an extension.  So executing this sort of logic would require TS knowledge that isn't represented in the FHIR artifacts.  That said, the main place we use fragments right now - SNOMED, the TS servers absolutely have the metadata about what regional edition the fragment represents - and have the same data available when deciding expansions, so they <em>can</em> make exactly the kinds of logical decisions I describe in the previous paragraph.</p>",
        "id": 271651671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644621453
    },
    {
        "content": "<blockquote>\n<p>That said, we don't have a computable mechanism right now that expresses the basis for a fragment</p>\n</blockquote>",
        "id": 271663267,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644632215
    },
    {
        "content": "<p>ValueSet.useContext</p>",
        "id": 271663273,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644632225
    },
    {
        "content": "<p>ValueSet.useContext would convey \"Procedure codes in Canada\" how, exactly?</p>",
        "id": 271663360,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644632351
    },
    {
        "content": "<p>Folks, For a group that frequently evokes \"that is not how systems do it now\" defense to justify maintaining the use of an approach that we'd like to change, this seems pretty hypocritical to demand alignment with a imagined use case that is not supported by existing systems. I'd like to hear details on existing application designs that use this content type to accomplish something meaningful. If none exist, let's get rid of it.</p>",
        "id": 271697061,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644684118
    },
    {
        "content": "<p>silly you... that rule only applies to those not named Lloyd.</p>",
        "id": 271703869,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644692034
    },
    {
        "content": "<p>what about that approach isn't used now? Anyway:</p>\n<blockquote>\n<p>ValueSet.useContext would convey \"Procedure codes in Canada\" how, exactly?</p>\n</blockquote>\n<p>Jurisdiction = Canada<br>\nusage.code = element, usage.valueCodeableConcept = fhir:Procedure.code</p>",
        "id": 271707192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644696227
    },
    {
        "content": "<p>on this subject, <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> has just pointed me at this:</p>",
        "id": 271897941,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644877220
    },
    {
        "content": "<p><a href=\"https://terminology.hl7.org/CodeSystem-icpc-DAN.html\">https://terminology.hl7.org/CodeSystem-icpc-DAN.html</a></p>",
        "id": 271897959,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644877229
    },
    {
        "content": "<p>this is a code system published at <a href=\"http://terminology.hl7.org/CodeSystem/icpc-DAN\">http://terminology.hl7.org/CodeSystem/icpc-DAN</a> that claims that it is the authoritative publication, canonical URL <a href=\"http://terminology.hl7.org/CodeSystem/icpc-DAN\">http://terminology.hl7.org/CodeSystem/icpc-DAN</a></p>",
        "id": 271898005,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644877266
    },
    {
        "content": "<p>but it also says, Content = not-present. This combination is wrong. The intent of not-present is that you look somewhere else for the content. but there is nowhere else if that's the authoritative source. </p>\n<p>note that I'm not saying it's <em>invalid</em>. It meets the definitions, but it's not a useful way for us to use THO.</p>",
        "id": 271898218,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644877366
    },
    {
        "content": "<p>and I don't think that should be the right canonical URL anyway for Danish ICPC. I'm proposing that they should ask for this to be removed, and publish it correctly in the danish IG</p>",
        "id": 271898282,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644877400
    },
    {
        "content": "<p>I still need a way to refer to the origin as the ICPC I bring to the DK IG is a supplement. It doesn't introduce new codes - but it introduces translations</p>",
        "id": 271898711,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644877635
    },
    {
        "content": "<p>So I need a correct canonical URL that I can refer to and I expect that to point to a valid codesystem with ALL the content</p>",
        "id": 271898771,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644877671
    },
    {
        "content": "<p>not just the 'dummy' one's that are listed on <a href=\"https://terminology.hl7.org/codesystems.html\">https://terminology.hl7.org/codesystems.html</a></p>",
        "id": 271898845,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644877705
    },
    {
        "content": "<p>it doesn't need to 'point' to. We could put the base ICPC in <a href=\"http://tx.fhir.support\">tx.fhir.support</a>, for instance, and just put the no-content definition of it in THO. And then it will all just work</p>",
        "id": 271899481,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644878062
    },
    {
        "content": "<p>also if the DK codesystem is a supplement?</p>",
        "id": 271899759,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644878225
    },
    {
        "content": "<p>I didnt read your entire message</p>",
        "id": 271900706,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644878809
    },
    {
        "content": "<p>Your approach sounds like it would work</p>",
        "id": 271900719,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644878823
    },
    {
        "content": "<p>I still dont understand why THO just dont fix it</p>",
        "id": 271900746,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644878848
    },
    {
        "content": "<p>THO has plenty of governance. you'll need to create a change request and shepherd it through the process</p>",
        "id": 271900838,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644878898
    },
    {
        "content": "<p>If it cannot get rid of the current pile of empty (unusable) codesystems im starting to fail in understanding what the governance is good for</p>",
        "id": 271901270,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644879176
    },
    {
        "content": "<p>Governance is also deprecating unused items IMHO</p>",
        "id": 271901409,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644879261
    },
    {
        "content": "<p>it can get rid of it. But you have to go through the process. That's what governance is good for ;-)</p>",
        "id": 271901448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644879284
    },
    {
        "content": "<p>Dont THO initiate spring cleaning themselves?</p>",
        "id": 272035939,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644958273
    },
    {
        "content": "<p>I think the answer is pretty much no. In principle, the committee should, but it's overwhelmed by work as usual</p>",
        "id": 272036967,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644958759
    },
    {
        "content": "<p>note that THO got caught by the great IG purge, as we killed a bunch of ci-builds that were part of their maintenance...</p>",
        "id": 272038090,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644959210
    },
    {
        "content": "<p>I'm unsure how to address the start of a cleaning. Would a task directed at HTA at <a href=\"https://jira.hl7.org/projects/HTA/summary\">https://jira.hl7.org/projects/HTA/summary</a> be the correct way?</p>",
        "id": 272082911,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644997933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196635\">@Jessica Bota</span></p>",
        "id": 272082947,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644997972
    },
    {
        "content": "<p>Given that it relates to an external code system, it should be raised to the HTA. <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> , please enter a task directed at HTA in the Jira project you linked above. I will also follow up with HTA so that it can be discussed on an upcoming call. </p>\n<p>Changes related to external content do not fall on the the implementer community, but is handled by the HTA via Pro Forma UTG tickets. Reuben and I have generally been pushing through the changes.  HTA just went through a huge process of 'spring cleaning' and retired loads of erroneous entries before the THO 3.0.0 release. </p>\n<p>CC: <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span></p>",
        "id": 272120642,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1645020792
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196635\">@Jessica Bota</span> - here you are: <a href=\"https://jira.hl7.org/browse/HTA-75\">https://jira.hl7.org/browse/HTA-75</a></p>",
        "id": 272124877,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1645022751
    }
]