[
    {
        "content": "<p>In order to submit a change request against a FHIR spec, v2 spec, CDA spec or any other FHIR specification, the only requirement is that users register for a Jira account (which in turn requires that they show they're a real human being and unlikely to be a spammer).  However, apparently UTG isn't set up the same way.  It certainly <em>could</em> be quite easily.  <span class=\"user-mention\" data-user-id=\"196635\">@Jessica Bota</span> mentioned that the UTG task force was contemplating allowing requests to only be submitted by HL7 members.  I think that's a really bad idea for a few reasons:</p>\n<ul>\n<li>Our standards are intended for use by <em>everyone</em>, not just HL7 members.  Only allowing changes from members is counter-productive, creates a barrier to adoption of our standards, and in the end, harms interoperability.</li>\n<li>it's in our interest to ensure that when our specifications (or the terminology infrastructure they rely on) are deficient in any way (erroneous, missing important content) that the issue be addressed as quickly as possible. </li>\n<li>As an organization, we don't even have a clue who our members are, nor do we have any automated mechanism to find out.  We know who our <em>voting</em> members are, but there are thousands of affiliate and organizational members who are \"members\" in terms of other rights such as education discounts.  When people sign up for WGMs, staff does a manual check.  That's not viable for Jira.</li>\n</ul>\n<p>Yes - there are costs to processing terminology change requests.  There are costs to processing <em>all</em> change requests.  However, that's the business we're in.  If we're going to seek revenue, it absolutely shouldn't be through creating barriers to processes that are essential to standards implementation.</p>\n<p>I would very much like the UTG process to be opened up to anyone - just as the specification change request process is.  What will it take to make that happen?<br>\n<span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191808\">@Wayne Kubick</span></p>",
        "id": 236747350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619730776
    },
    {
        "content": "<p>I also want to tag <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> . To be clear, I don't think any official decisions have been made on this just yet and I want to thank you for laying out your feedback for the UTG task force to consider.</p>",
        "id": 236747756,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1619730900
    },
    {
        "content": "<p>Other standards organizations look to HL7 vocabulary, thus will have improvement requests -- (e.g. IHE, DICOM)</p>",
        "id": 236749095,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619731225
    },
    {
        "content": "<p>This has been discussed and the original intent was to follow the harmonization process, which was restricted to members only. I'd like a dialogue to occur here to help clarify how this should change because TSC has a task force I lead to evaluate this sort of thing and at present, we were going to keep the requirement of HL7 membership to vote. I'll note that I think <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is suggesting something even more broad, which is to allow any JIRA user to <strong>submit</strong> a proposal (and obviously vote.) Is that correct? Time to have folks weigh in here to sway to report to TSC.</p>",
        "id": 236753907,
        "sender_full_name": "Robert McClure",
        "timestamp": 1619733556
    },
    {
        "content": "<p>no, I think Lloyd was saying that any JIRA user can <em>submit</em>.  That doesn't necessarily include voting, unless I'm missing something.</p>",
        "id": 236754146,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1619733670
    },
    {
        "content": "<p>Submit means they have to be able to create the proposal that changes HL7 content. If they can <em>submit</em> they should be able to vote.</p>",
        "id": 236754572,
        "sender_full_name": "Robert McClure",
        "timestamp": 1619733890
    },
    {
        "content": "<p>Not necessarily.  We allow anyone who wants to submit changes to HL7 standards, but only those who are members or pay for the privilege can vote.</p>",
        "id": 236758883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619736432
    },
    {
        "content": "<p>But it's important to accept feedback from anyone who has it in terms of what changes are desired.</p>",
        "id": 236759015,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619736486
    },
    {
        "content": "<p>You want that as frictionless as you can get it.</p>",
        "id": 236759046,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619736505
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> It makes no sense to have people go through the work of submitting a UTG proposal <strong>that changes content - not the same as a JIRA issue</strong> and not let them vote.</p>",
        "id": 236764888,
        "sender_full_name": "Robert McClure",
        "timestamp": 1619740343
    },
    {
        "content": "<p>I don't understand.  Jira issues absolutely result in changes to content.  A few even include pull requests against the base spec, though we don't set that as a bar the way UTG does.  Why does submitting a change mean that you get to vote on whether it's adopted or not?  I think we probably want to keep voting controlled - if voting were 'free', then it's too easy for an organization to tell their employees \"everyone vote for this\".  But there's not much risk about everyone in their organization being able to submit requests for change if they find an issue.</p>",
        "id": 236766862,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619741647
    },
    {
        "content": "<p>I don't think I misunderstood, but as per my directive from TSC, Austin, and Wayne both Submitter and Reviewer (voting) privileges were to be restricted to HL7 members.  I agitated against that but was overruled.    I think I recall that they begrudgingly agreed that upon request to TSC (or maybe Wayne?  cannot recall) that in special cases other folks can be granted permission (like the balloting works now).    I'll contact Wayne and verify I do not have it wrong, and ask him about the process for others; if they insist it to be locked down, then you and I need to make a compelling case for it to be open.   I have a request from a Brian Reinhold and he is not in the membership database; until I verify with Wayne I have not yet sent an email to him denying his request.</p>",
        "id": 236768775,
        "sender_full_name": "Ted Klein",
        "timestamp": 1619743038
    },
    {
        "content": "<p>I would very much support anyone being able to submit and restrict the voting only.</p>",
        "id": 236768837,
        "sender_full_name": "Ted Klein",
        "timestamp": 1619743091
    },
    {
        "content": "<p>Adding <span class=\"user-mention\" data-user-id=\"279658\">@Austin Kreisler</span> to the thread</p>",
        "id": 236771995,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619745705
    },
    {
        "content": "<p>One major issue is that people have long been able to submit changes to FHIR-based terminology by submitting tracker items against FHIR.  If UTG change requests are limited to members only, we may need to re-think hosting FHIR terminology in UTG.</p>",
        "id": 236772114,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619745800
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> You seem to be confused in assuming that a UTG proposal equates to logging a JIRA issue, they are not the same thing. A UTG proposal is literally creating the change in real HL7 content. This equates to the result of making the required change that is the <em>resolution of a JIRA issue.</em> There is no equivalent to \"logging a JIRA issue\" for UTG where the result is someone else - a volunteer? - actually makes the content bitbucket changes. Ted created UTG to remove that need - if the change is needed then a person with content creation responsibility has to make the proposal.</p>",
        "id": 236969430,
        "sender_full_name": "Robert McClure",
        "timestamp": 1619878035
    },
    {
        "content": "<p>I'm not assuming they're exactly the same.  I'm simply saying that being able to submit a change (even if you're submitting the pull request that drives it) in no way implies you should be able to vote to approve that change.  We want anyone who wants to be able to submit changes.  We <em>don't</em> want anyone who wishes to be able to vote.  Right to vote is what drives membership.  It also gives us some sort of base for determining quorum.</p>",
        "id": 236979913,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619885354
    }
]