[
    {
        "content": "<p>I noticed that the core spec contains an explicit CodeSystem resource for SNOMED CT (with content set to \"not-present\", of course) but none for e.g. LOINC. Indeed, the <a href=\"https://www.hl7.org/fhir/r4/snomedct.html\">spec page on using SNOMED with FHIR</a> says: \"This specification publishes a canonical SNOMED CT CodeSystem resource.\" Does someone know what the reason behind that (SNOMED but not LOINC etc.) is?</p>\n<p>Background for this question &amp; practical impact: I have been debugging a validation service based on HAPI JPA starter. I was puzzled to see that when neither LOINC nor SNOMED was loaded, value sets of LOINC codes caused errors upon expansion but not those with SNOMED codes. I tracked it down to the fact that the expansion logic found the CodeSystem resource for SNOMED from the core spec and hence thought it could expand. That is likely to be a topic of a separate HAPI thread soon <img alt=\":hapi:\" class=\"emoji\" src=\"https://zulip-avatars.s3.amazonaws.com/10155/emoji/images/13574.png\" title=\"hapi\">. but I wanted to understand the general backgorund first.</p>",
        "id": 249971384,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1629372183
    },
    {
        "content": "<p>Agreement with LOINC that they'd publish that, not us, but there's no agreement about that with Snomed (though there might be in the future)</p>",
        "id": 249973210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629373166
    },
    {
        "content": "<p>Ah, OK. So do I understand it right that</p>\n<ol>\n<li>the ideal would be that the FHIR spec itself would not contain any CodeSystem resources for external code system (those being published instead by the maintainers directly), and</li>\n<li>we're not there yet so the FHIR spec currently contains canonical CodeSystem resources for external systems in some?/all? cases where the maintainers do not yet publish them themselves</li>\n</ol>",
        "id": 249985462,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1629379494
    }
]