[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215603\">@Sean Mahoney</span>  I am trying to determine the correct search behavior when the _include=Organization:partof is used in a search on Organization. </p>\n<p>Should the _included record be added to the Page of the Bundle if the Organization resource has already been returned in that Page of the bundle. </p>\n<p>The FHIR Specification says:  When search results are paged, each page of search results should include the matching includes for the resources in each page, so that each page stands alone as a coherent package.</p>\n<p>Would this mean that if I returned a search as a series of pages then I would include the referenced Organization.partof record if the Organization was NOT already included in the returned Page.</p>\n<p>And If my search returns only a single page of results if the referenced Organization.partof record is already included in the original search criteria then it would NOT be added as an include...</p>\n<p>It is not clear from the specification whether _included resources should be added to the bundle or whether the page of the bundle needs to be evaluated to determine if the Organization.partof record is already incorporated into the entries in that page of the bundle.</p>\n<p>The reason for this question is that we are trying to determine the correct behavior as part of a certification test for Plan-Net.</p>\n<p><span class=\"user-mention\" data-user-id=\"233860\">@Matthew Mosier</span></p>",
        "id": 269583617,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1643295265
    },
    {
        "content": "<p>Addressed here, the included resource would NOT be added if it already exists on the page as a match: <a href=\"#narrow/stream/179166-implementers/topic/duplicates.20with.20_include\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/duplicates.20with.20_include</a></p>",
        "id": 269589583,
        "sender_full_name": "Paul Church",
        "timestamp": 1643297589
    }
]