[
    {
        "content": "<p>I received the following question regarding compliance:    <br>\n<em>We are currently working towards building provider directory for Interoperability and trying to determine For CMS compliance which are the resources we need to work on. Will practitioner, Organization and Location be enough?</em></p>",
        "id": 223539435,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1611248808
    },
    {
        "content": "<p>As far as I know CMS has not published compliance requirements.   The details in the interoperability rule call for a small number of fields, as well as the ability to provide a report on the mix of pharmacies by type.   The implementation guide requires support for all profiles, and their associated search parameters, specified includes/rev_includes, and chaining and so forth.   See <a href=\"http://hl7.org/fhir/us/davinci-pdex-plan-net/STU1/CapabilityStatement-plan-net.html\">http://hl7.org/fhir/us/davinci-pdex-plan-net/STU1/CapabilityStatement-plan-net.html</a> </p>\n<p>Beyond just 'checking the box', the purpose of the IG is to make the information in a payer's directory searchable by members through 3rd party applications.   The full collection of profiles is necessary to achieve searchability.</p>",
        "id": 223558389,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1611257213
    },
    {
        "content": "<p>You need practitioner role and organizational affiliation as well. This will allow you to represent network and specialty/role.</p>",
        "id": 223769558,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611430467
    },
    {
        "content": "<p>At a minimum, based upon my understanding.</p>",
        "id": 223769584,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611430487
    },
    {
        "content": "<p>CMS says - \"The Provider Directory API must be publicly available and exclude the security protocols related to user authentication and authorization and any other protocols that restrict the availability of this information to particular persons or organizations\" - how do you expose these APIs? Do you keep it fully open without any security measurements?</p>",
        "id": 243238259,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1624092687
    },
    {
        "content": "<p>Public access (just like the FHIR reference servers)</p>",
        "id": 243253507,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1624114358
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span></p>",
        "id": 243257312,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1624120184
    },
    {
        "content": "<p>That is right, though I can't imagine you would run afoul if you implemented measures to avoid Dos/DDoS or bad actors. Just no auth, no need to sign up for access or to get the endpoint address and the documentation posted publicly and openly.</p>",
        "id": 246017350,
        "sender_full_name": "Corey Spears",
        "timestamp": 1626295327
    }
]