[
    {
        "content": "<p>In working with our regulatory team to sort through the CMS rule for Provider Directory, it seems that there is a requirement to support cultural and linguistic capabilities for providers. Given this information, we have a couple of questions:<br>\n1) Is there a reason that this is not specified as a mandatory requirement in the PDex IG?<br>\n2) Is there an extension available in an applicable resource where this information can be stored?</p>\n<p>cc: <span class=\"user-mention\" data-user-id=\"356642\">@Chetan Jain</span></p>",
        "id": 215651661,
        "sender_full_name": "David Clowers",
        "timestamp": 1604530555
    },
    {
        "content": "<p>See the communication field and communicationproficiency extension in <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-Practitioner.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-Practitioner.html</a>.  They are MS 0..1.    If you have 'em, you are supposed to provide 'em.</p>",
        "id": 215653587,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1604531968
    },
    {
        "content": "<p>Thanks Saul. But communicationproficiency extension covers only language proficiency. What about cultural competency ? Isn't it should be captured separately?</p>",
        "id": 215677987,
        "sender_full_name": "Chetan Jain",
        "timestamp": 1604561247
    },
    {
        "content": "<p>The only place I see that addresses cultural competence is the accessibility extension to Plannet-Location, that has an accessibility code for 'cultural competence'.</p>",
        "id": 215731443,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1604591778
    },
    {
        "content": "<p>You are right but that's for Location accessibility. I don't think same can be used for Practitioner.  Is there a need to define another extension at PeDex IG level ?</p>",
        "id": 215811495,
        "sender_full_name": "Chetan Jain",
        "timestamp": 1604646109
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Bumping Chetan's question above. ^</p>",
        "id": 216268094,
        "sender_full_name": "David Clowers",
        "timestamp": 1605039491
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span>   </p>\n<p>We are pretty much frozen on IG content modulo finding the gross mistakes that people graciously (?) keep discovering.   My take, subject to Bob's insight, is that this will need to keep for the next cycle.   </p>\n<p>Can you please submit a Jira tracker against the IG?</p>",
        "id": 216275446,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1605042885
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <br>\nThanks Saul for update. Wondering if 1/1/21 release can pass the CMS rules without meeting this requirement?</p>",
        "id": 216312629,
        "sender_full_name": "Chetan Jain",
        "timestamp": 1605077184
    },
    {
        "content": "<p>Quote from the CMS final rule <br>\n\"The MA plan’s network of contracted providers, including names, addresses, phone numbers, and specialties, updated no later than 30 calendar days after the MA organizations receives provider directory information or updates to provider directory information; and<br>\nFor an MA organization that offers an MA-PD plan, the MA-PD’s pharmacy directory, including the pharmacy name, address, phone number, number of pharmacies in the network, and mix (specifically the type of pharmacy, such as “retail pharmacy”) updated no later than 30 calendar days after the MA organization receives pharmacy directory information or updates to pharmacy directory information.\"</p>\n<p>No mention of cultural competence -- the IG should pass CMS  rules as is.  </p>\n<p>BTW: The use of cultural competency at the location level is appropriate because in many/most cases this may involve more than just the capability of a single provider.</p>",
        "id": 216334852,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1605094883
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span>  <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> !!  <br>\nLocation competency is about accessibility which applies to all the practitioners operating at that location. Having at practitioner level, can allow us to track at individual practitioner level. Please see if this can be included in next cycles  and share the Jira if possible.</p>",
        "id": 216455142,
        "sender_full_name": "Chetan Jain",
        "timestamp": 1605179819
    },
    {
        "content": "<p>I recommend that you create the Jira issue so that it will express precisely what you want, and to make it easier for you to track.</p>",
        "id": 216476648,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1605192172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Couple of follow-up questions here:<br>\n1) Can you provide a link to the instance of Jira where we can log this?<br>\n2) There is an off-cycle Connecathon going on this week that has a CMS Q/A session where we could potentially get CMS feedback on this topic. However, I've only seen tracks/information for CARIN BB. Do you know if there is a plan to cover any DaVinci information during the sessions this week?</p>",
        "id": 217139644,
        "sender_full_name": "David Clowers",
        "timestamp": 1605709175
    },
    {
        "content": "<p>1) <a href=\"http://jira.hl7.org\">jira.hl7.org</a>.  you want to create the  issue in the 'FHIR Specification Feedback (FHIR)' project, and select the 'US Davinci PDEX Plan Net (FHIR)' specification.<br>\n2) Today's connectathon is CARIN, not DaVinci, so it should be CARIN only.   There are enough CMS-directed question about CARIN stuff to keep us busy during that session.   The STU1 IG isn't going to change at this point, so your question is really for subsequent refinement of the IG, IMHO.</p>",
        "id": 217159105,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1605716720
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"337701\">@David Clowers</span> <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> <br>\nHave created jira issue to track this further - <a href=\"https://jira.hl7.org/browse/FHIR-29767\">https://jira.hl7.org/browse/FHIR-29767</a></p>",
        "id": 217386141,
        "sender_full_name": "Chetan Jain",
        "timestamp": 1605869570
    }
]