[
    {
        "content": "<p>Question regarding using NUCC taxonomy codes to search on/populate the HealthcareService.specialty attribute:</p>\n<p>Our source system provides certain search filters based on services offered by pharmacies stored in our database.</p>\n<p>About half of these map to existing NUCC taxonomy codes (e.g. 'Long Term Care Pharmacy', 'Indian Health Service/Tribal/Urban Indian Health (I/T/U) Pharmacy', etc.).</p>\n<p>However, some of the search filters offered by our source system do not map cleanly to NUCC taxonomy codes. For instance, we have search filters for 24-hour pharmacies, pharmacies offering e-prescribing, etc.</p>\n<p>Is there a recommended way of setting up search parameters and attributes to accept custom values for services that do not fit in the existing NUCC taxonomy code list?</p>",
        "id": 228857862,
        "sender_full_name": "David Clowers",
        "timestamp": 1614895088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"231038\">@Gail Kocher</span> </p>\n<p>Hi <span class=\"user-mention\" data-user-id=\"337701\">@David Clowers</span> -  My take is that these other characteristics are properties of pharmacies, not distinct specialties. (By cc to Gail who is an author of the IG and active on NUCC).   For example, a compounding pharmacy could be 24 hr.   My take is that these properties don't currently fit in the provider directory, but should be points of discussion for a future revision.  I suggest adding a Jira tracker for this against the Plan-Net IG.   None are currently planned, but that is because there hasn't been much feedback pointing to deficiencies.  Trust me, the IG isn't perfect by any means!</p>\n<p>If you incorporate this data into your directory in a non-standard way, might not expect to find it and would ignore it.   The idea of the Plan-Net IG is to set expectations so that a client application could be developed that would be successful finding services across all payers' directories.   If you added a search non-standard search parameter, it would likely not be used by clients.</p>",
        "id": 228959970,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1614953694
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Thank you for your detailed response. Is there some other HealthcareService attribute that could be used to search on these custom filters?</p>",
        "id": 229021743,
        "sender_full_name": "David Clowers",
        "timestamp": 1614977165
    },
    {
        "content": "<p>24hr can be represented using the availableTime fields.<br>\nHealthcareService has a MS comment field that might be the best place for e-prescribing.<br>\nNeither of these are searchable through the IG's required API.</p>",
        "id": 229025411,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1614978629
    },
    {
        "content": "<p>Thank you. I will take another look into how we can properly implement these into searches (if at all).</p>",
        "id": 229124290,
        "sender_full_name": "David Clowers",
        "timestamp": 1615060654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"337701\">@David Clowers</span>  sorry for the delay in responding on this. <br>\nThe taxonomies available for pharmacies in the NUCC code set were established by working directly with the pharmacy industry. Of the examples noted, I would comment as follows:</p>\n<ul>\n<li>24-hour - this is the available time for the pharmacy provider. I would look at heatlhcareservice.availableTime.allday </li>\n<li>e-prescribing is another characteristic not a specialty of the pharmacy. Frankly most all pharmacies unless very rural with limited telecommunications access should have e-Rx capabilities. I agree with Saul that this might be something for healthcareservice.type in the future</li>\n</ul>",
        "id": 229743939,
        "sender_full_name": "Gail Kocher",
        "timestamp": 1615410151
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"337701\">@David Clowers</span> : Adding two cents from another PBM view: We mapped the NCPDP \"Services\" (Data Q file) to HealthcareService.characteristic (an unbound codeableConcept allowing us to reference NCPDP codes). This is for things like eRx, Immunizations, OnSite Clinic, DME, Compounding (separate from  a taxonomy code).  There isn't a search parameter for it, but can be filtered on the receiving end.  </p>\n<p>For 24 hour, we use the Location hours of operation.</p>",
        "id": 229751517,
        "sender_full_name": "Kate Dech",
        "timestamp": 1615413046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"231038\">@Gail Kocher</span> <span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span> Thanks for this additional information. We will look into using the characteristic field for some of this filtering.</p>",
        "id": 230045865,
        "sender_full_name": "David Clowers",
        "timestamp": 1615562365
    },
    {
        "content": "<p>Semi-related topic here - the HealthcareService resource has 'name' as a supported search parameter and attribute:</p>\n<p><a href=\"http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/SearchParameter-healthcareservice-name.html\">http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/SearchParameter-healthcareservice-name.html</a><br>\n<a href=\"http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-HealthcareService-definitions.html#HealthcareService.name\">http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-HealthcareService-definitions.html#HealthcareService.name</a></p>\n<p>However, it's not terribly clear what type of data should go here. In all of the examples, it's simply defaulted to 'PlannetHealthcareService':</p>\n<p><a href=\"http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-HealthcareService.profile.json.html\">http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-HealthcareService.profile.json.html</a></p>\n<p>What data is this attribute meant to represent?</p>",
        "id": 230423315,
        "sender_full_name": "David Clowers",
        "timestamp": 1615844630
    },
    {
        "content": "<p>Bump. ^</p>",
        "id": 230596957,
        "sender_full_name": "David Clowers",
        "timestamp": 1615931450
    }
]