[
    {
        "content": "<p>Folks,</p>\n<p>I've been looking for guidance on using Locations to define a jurisdiction that I can use as a CoverageArea for an InsurancePlan. I haven't found much. Logically, I would assume that I can define a Location with just a state attribute for Insurance Plans that cover a single state. I can also define multiple Locations, each with a state and district, for Insurance Plans that cover counties with a state. </p>\n<p>However, I've found that logic and specifications don't always mix. Is there some guidance or explicit definition of requirements for accomplishing this goal?</p>\n<p>I'm also concerned that searching by district may not be supported. I can't find anything that clearly defines the supported chained search parameters  for an InsurancePlan.coverageArea (a Location).</p>\n<p>Any help on this is appreciated ... Charlie</p>",
        "id": 216280640,
        "sender_full_name": "Charlie Filkins",
        "timestamp": 1605045611
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"283867\">@Charlie Filkins</span> ,<br>\nSee the examples in the IG.  This one does what you are trying do with a coverage area.<br>\n<a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/InsurancePlan-AcmeQHPBronze.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/InsurancePlan-AcmeQHPBronze.html</a><br>\nIt uses both the address and an attached geoJSON to define the state of CT.</p>\n<p>Searching by district isn't directly supported.  The closest that can be achieved in the current search interface is searching by a set of zipcodes.<br>\nThat would get you in the ballpark, and a client could filter it further using geographic filters.   We basically split the work between the server and the client intentionally in order to minimize initial server implementation burden.</p>",
        "id": 216353800,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1605105596
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Thanks for the quick response. I guess we've got some work to do here.</p>",
        "id": 216510043,
        "sender_full_name": "Charlie Filkins",
        "timestamp": 1605206468
    }
]