[
    {
        "content": "<p>Is it possible to relax the <em>HealthcareService.delivery-method.type</em> binding or add an \"unknown\" concept to the <em>DeliveryMethodVS</em>?<br>\nCurrently it's too restrictive and does not allow to use the <a href=\"https://www.hl7.org/fhir/extension-data-absent-reason.html\">DAR</a> extension.</p>",
        "id": 257247953,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1634062525
    },
    {
        "content": "<p>Shamil, It was previously decided that delivery method was a critical piece of information for provider directory. Allowing Data Absent Reason options will not be helpful to users. We will discuss again how to best handle these situations.</p>",
        "id": 257577897,
        "sender_full_name": "Sean Mahoney",
        "timestamp": 1634234267
    },
    {
        "content": "<p>Most virtual visits began in 2020 and majority of the healthcare ecosystem did not care about it before. Also, from the payer standpoint, it was billed the same way. With that fact some EMR data models do not support it, at least one particular EMR I’m dealing with do not track it and they are puzzled now how to substitute the delivery method to be compliant.<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-34140\">FHIR-34140</a></p>",
        "id": 257846161,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1634404193
    },
    {
        "content": "<p>Shamil, we will discuss this situation and provide guidance soon on this.</p>",
        "id": 258402656,
        "sender_full_name": "Sean Mahoney",
        "timestamp": 1634748770
    },
    {
        "content": "<p>Shamil, we are putting a change request to make delivery method optional. Would that meet your requirements?</p>",
        "id": 258979967,
        "sender_full_name": "Sean Mahoney",
        "timestamp": 1635177384
    },
    {
        "content": "<p>Yeah, that will work. Thank you.</p>",
        "id": 259291316,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1635361792
    },
    {
        "content": "<p>I see that the IG is updated but an attempt to validate a <em>HealthcareService</em> resource instance without the <em>delivery-method</em> extension by the FHIR Validator failed with:<br>\n<code>HealthcareService.extension:deliverymethod: minimum required = 1, but only found 0 (from http://hl7.org/fhir/us/davinci-pdex-plan-net/StructureDefinition/plannet-HealthcareService)</code></p>\n<p>I wonder why the FHIR Validator is not taking the updated StructureDefinition from the package. Is it cached somewhere?</p>",
        "id": 265188289,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1639675214
    },
    {
        "content": "<p>The current version has a minimum cardinality of 1. The CI build (which will shortly going through an STU update peer review) has relaxed this to 0. Until that is published, I believe the validator will continue to use the latest published by default.</p>",
        "id": 265237492,
        "sender_full_name": "Corey Spears",
        "timestamp": 1639699242
    }
]