[
    {
        "content": "<p>Hello - simply adding an exchange I had with Saul earlier. Sorry I did not start the stream here in the first place (new to Zulip).  </p>\n<p>My question: I assume the PDEX Plan-It Provider Directory IG (in support of the CMS Interop Rule) will support the transmission of dental provider network info - would you agree?</p>\n<p>Saul Kravitz3:07 PM Response:</p>\n<p>On the face of it, it should work.<br>\nThe specialty list includes dental specialties -- <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/ValueSet-IndividualSpecialtyAndDegreeLicenseCertificateVS.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/ValueSet-IndividualSpecialtyAndDegreeLicenseCertificateVS.html</a><br>\nThe high level service categories include dentistry -- <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/ValueSet-HealthcareServiceCategoryVS.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/ValueSet-HealthcareServiceCategoryVS.html</a></p>\n<p>What would cause it to fail as a dental provider network directory?</p>",
        "id": 213227422,
        "sender_full_name": "Henry Perretta",
        "timestamp": 1602629679
    },
    {
        "content": "<p>Responding to Saul's question at end of above: I actually don't know what would cause Plan-Net to fail in support of dental providers -  looks goods to me!</p>",
        "id": 213227578,
        "sender_full_name": "Henry Perretta",
        "timestamp": 1602629806
    },
    {
        "content": "<p>Does anyone know - or have a perspective on - the following: The CMS Rule on the Director is vague on this point.  Question: per the RULE - come 7/1/2021, do payers have to include dental providers via the directory API? (I know that Plan-Net will SUPPORT dental providers - I'm trying to see if the Rule itself requires it (or at least are we generally assuming the Rule requires dental providers in the Directory API).  Does anyone have a feel for this? tks</p>",
        "id": 214259805,
        "sender_full_name": "Henry Perretta",
        "timestamp": 1603409482
    }
]