[
    {
        "content": "<p>Question from a friend:</p>\n<div class=\"codehilite\"><pre><span></span><code>Related documentations at: https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-Endpoint.html and https://www.hl7.org/fhir/endpoint.html\n\n1.    These resources have endpoint in the data model:\n\nOrganization\nPractitionerRole\nHealthcareService\nOrganizationAffiliation\nLocation\nInsurancePlan\n(Practitioner data model don’t have endpoint data field)\n\n2.    These resources supposed to have search by endpoint parameter:\n\nOrganization\nPractitionerRole\nHealthcareService\n\n(The second link above says:\n\n This is not a description of details of the current system, as found in CapabilityStatement, but of another (potentially external) system.\n\nbut it also says\n\nThe endpoint is distinct from a capability statement in that the CapabilityStatement statement describes the entire capability of a server (and in the metadata case, just this server). Where the endpoint resource describes the technical details for how to connect, and for what purposes (which could be a small sub-set of the server&#39;s capabilities, and might not be a FHIR endpoint).\n\n\nAny guidance on the below will be greatly appreciated:\n\nIs it applicable and required for our provider FHIR directory service to implement this endpoint?\nWhat kind of information should be included in this resource in our case?\nOne thought I had was to expose this endpoint with one object for each of the endpoints (including the davinci-plannet profile links) – does it make sense?\nWhy is it not included in Practitioner &amp; included in other resources?\nWhy only 3 of the resources included for search by endpoint?\n ```\n.\n</code></pre></div>",
        "id": 207265319,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1597760618
    },
    {
        "content": "<p>All resources/profiles except for Practitioner (and EndPoint) have Endpoint references.<br>\nAll resources that have an Endpoint reference, have an endpoint search requirement, except for InsurancePlan. (see <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/CapabilityStatement-davinci-pdex-plan-net.html#resource--details\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/CapabilityStatement-davinci-pdex-plan-net.html#resource--details</a>).   That maybe an error of omission.<br>\nThe reason for these search parameters is to support _includes and _revIncludes.  I doubt anybody will do a search trying to find an instance that uses a particular endpoint.   The intent is to retrieve an instance AND its associated endpoint.</p>\n<p>Supporting the Endpoint profile is required.  <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/CapabilityStatement-davinci-pdex-plan-net.html#endpoint\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/CapabilityStatement-davinci-pdex-plan-net.html#endpoint</a></p>\n<p>The Endpoint is there to support a digital endpoint of some type.   For instances that lack an associated endpoint, don't include one.<br>\nSee the examples in the IG.</p>",
        "id": 207266293,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1597761068
    },
    {
        "content": "<p>Hi Saul - Thanks for your question, but I will need some help answering it.  I'm new to the Da Vinci and FHIR resources within the last month so I'm still trying to figure out what an endpoint is used for.  I will ask my coworker @Kate Dech to respond to your question based on her knowledge and experience.</p>",
        "id": 207268172,
        "sender_full_name": "Annette Kuball",
        "timestamp": 1597761941
    }
]