[
    {
        "content": "<p>We can split this up if the stream is too broad, but I thought it would be good for people to have an opportunity to discuss topics outside of work group meetings. </p>\n<p>I have a few topics that I have questions about: </p>\n<p><strong>1.) The endpoint resource</strong>: I am struggling to understand how a published endpoint (e.g. a Organization, PractitionerRole, or Location endpoint) would provide functional use. I would imagine that any published endpoint would need to adhere to an IG in order to receive data in a manageable format and to respond in a predictable way to submitted data. Could this be addressed in a future iteration of the IG? </p>\n<p><strong>2.) Overlap of Organization, Practitioner, and PractitionerRole resources between CARIN BB and PlanNet IGs</strong>: Since CARIN BB is utilizing US core profiles but the PlanNet IG is further constraining these resource types it is likely that many implementers will reuse these resources between the two IGs. One implementation that I am pondering is to reference a specific instance of a practitioner, organization, or practitionerRole within claims data. I am curious if others have thoughts on how these three resources (or perhaps others) can be shared between the two IG's given that PlanNet will impose more strict restrictions on the profiles than the restrictions present in US Core. </p>\n<p><strong>3.) Status restriction of active only on profiles</strong>: Does this restriction extend to the \"active\" boolean flag? Could this be handled through search rather than through profile constraints? The reason behind this suggestion is that a search restriction would allow the profile assertions to remain valid regardless of status. My thought was that claims data would reference the same resources that are delivered through the PlanNet IGs since payers are required to implement both IGs at the same time. Constraining the PlanNet resources to only Active statuses seems like it may limit the versatility of resources that contain the profiles defined in PlanNet. </p>\n<p>Let me know if any of my questions need clarification or if I am missing anything.</p>",
        "id": 192607787,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1585786069
    },
    {
        "content": "<p>Hi Josh,<br>\nYour points #2 and #3 seem to conflate the way that you would manage the data internal to your enterprise, with they way you would present the data for different use cases.   To use an MVC analogy, you would need your model to support both use cases (and probably many more), but present two different views, one for members in a directory, and one for members as claims dat#<strong>R3/R4 Conversion work</strong> <br>\nre #1:  I agree that IG and the limited examples leave a lot of questions regarding how one would use this resource unanswered.  I'll try to elucidate with help from <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span></p>",
        "id": 192685845,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1585842469
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> , I will continue to think this through. I am inclined to agree and I may have to modify my presuppositions i came into this project with.</p>",
        "id": 192701718,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1585849524
    },
    {
        "content": "<p>Question from some others: Would we ever communicate a provider who does not show in a health plan provider directory, who is otherwise active? There are mechanisms where an active provider can request to be omitted from the health plan directory (not sure at this time why a provider would do this).</p>",
        "id": 192702079,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1585849682
    },
    {
        "content": "<p>This question sounds like (for those of you old enough to remember phone books):   Would we ever call an unlisted number? <br>\nYes, but we had to get the phone number through an informal channel.</p>",
        "id": 192838994,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1585935312
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> , minor question, should we have MustSupport flags on Practitioner for Address, Contact, and BirthDate? The health plans may have this info but they would not make it publicly available. I mention contact/address since it is defined as a home address for a Practitioner. Birthdate seems like an unnecessary exposure of PII.</p>",
        "id": 195073948,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1587654109
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> ,     Good questions.  Will get back to you.<br>\nYou mean Practitioner.telecom, right?  (There is no Practitioner.contact)....<br>\n<span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span></p>",
        "id": 195076536,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1587655051
    },
    {
        "content": "<p>Yes, telecom, sorry.</p>",
        "id": 195076663,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1587655096
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-26941\" title=\"https://jira.hl7.org/browse/FHIR-26941\">https://jira.hl7.org/browse/FHIR-26941</a></p>",
        "id": 195463678,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1588015486
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> and <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span>, on the accessibility extension (<a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-accessibility.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-accessibility.html</a>) there is a broken link for the accessibility valueset (<a href=\"http://hl7.org/fhir/uv/vhdir/ValueSet/accessibility\">http://hl7.org/fhir/uv/vhdir/ValueSet/accessibility</a>).</p>\n<p>I wanted to make sure someone knew about this. Thanks!</p>",
        "id": 199659804,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1591209883
    },
    {
        "content": "<p>I am also not sure of the purpose of the newpatientprofile specified here: (<a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-newpatientprofile.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-newpatientprofile.html</a>). Is the idea to just provide a free form string of text describing the conditions under which a new patient will be accepted?</p>",
        "id": 199660419,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1591210211
    },
    {
        "content": "<p>Re: broken link.   ALready fixed.   Will be visible next time the CI build is published.  Thanks for pointing it out.</p>\n<p>Re newpatientprofile:  Based on discussions that happened long before my time as part of the VhDir definition, a decision was made not to attempt to provide a structured definition of the new patient criteria.  Some  of those criteria would be evident in the associated health care service.  For example, a pediatrics service obviously wouldn't target geriatric patients.   This is on our agenda for the Thursday VS meeting...if we get to it.</p>",
        "id": 199669589,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1591214531
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> , One more for you. Are we removing the Must support on Organization.Qualification or redoing the codeset? The codeset is using taxonomies when Licenses and other qualifications seem more relevant to an organization.</p>",
        "id": 199699186,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1591237610
    },
    {
        "content": "<p>Yes, MS will be removed on the qualification extensions, AND VS will be redone.<br>\nThe VS is currently  NUCC Provider Taxonomy (- a couple of rogue codes) + DegreesLicensesAndCertificates (http://terminology.hl7.org/CodeSystem/v2-0360|2.7)...subject to change by Gail and Rob.</p>",
        "id": 199743354,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1591276038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> and <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> : Removing qualification extension and references to it from Organization and Practitioner seems like a good move. If we do this, how will we represent the status of the qualification or the states that the qualification is valid?</p>",
        "id": 199767814,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1591285977
    },
    {
        "content": "<p>Must Support will be dropped.   Extension will remain.</p>",
        "id": 199774562,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1591288727
    },
    {
        "content": "<p>Going through this old thread now because we are implementing FHIR server for a client. The use case is to exclude certain providers from showing up in the provider directory. We would like to use the active flag on the plannet profiles to set to false. It appears you have mandated to have this contain a \"True\" always. Is there a workaround? Appreciate the help. <span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span></p>",
        "id": 235560218,
        "sender_full_name": "Sudheesh Thuruthiyil",
        "timestamp": 1619030282
    },
    {
        "content": "<p>Please create new issues with the subject line expressing a summary.</p>",
        "id": 235692621,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1619103492
    }
]