[
    {
        "content": "<p>There is an NPI Registry for practitioners. Is there something similar for Healthcare Services / Locations?</p>",
        "id": 226459635,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1613436238
    },
    {
        "content": "<p>I am not aware of such a registry.<br>\n<span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> <span class=\"user-mention\" data-user-id=\"231038\">@Gail Kocher</span></p>",
        "id": 226516960,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1613484710
    },
    {
        "content": "<p>What would be the source for the test data to generate Healthcare Services? And what is the source in the real life. CDA documents are pretty limited in this regard.</p>",
        "id": 226524977,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1613488393
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192195\">@Shamil</span> Not sure I understand your question.<br>\nIn our reference implementation, we created services for each organization.   reference the information on the last connectathon for pointers to sample data generation code, reference client and server.   All open source.</p>",
        "id": 226544753,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1613495804
    },
    {
        "content": "<p>Since CMS-1500 has a field for the Service Facility NPI, I was hoping there is some lookup service for that.</p>",
        "id": 226549473,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1613497752
    },
    {
        "content": "<p>All NPIs are issued by the National Plan &amp; Provider Enumeration System (NPPES), so any NPI sent in the Service Facility on a claim would also be found in the NPI registry</p>",
        "id": 226573935,
        "sender_full_name": "Gail Kocher",
        "timestamp": 1613508431
    },
    {
        "content": "<p>Right, I've just noticed that it returns facilities as well.  And, yet another question, since resulted facilities are missing new patient, delivery methods, accessibility,  should I contact facilities directly using EndPoint provided there to retrieve portion of info for extensions or what would be the source in the real life scenario?</p>",
        "id": 226769414,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1613628654
    }
]