[
    {
        "content": "<p>Hi,  network profile is indicating \"Partof\" 1..1 cardinality.  This differs from Organization.Partof 0..1.  Since Network is based on Organization is there a reason that they are not consistent.  What values are you expecting in Network.Partof attribute.  Network in the provider directory context is the connection between insurance plan and provider records.</p>",
        "id": 234493004,
        "sender_full_name": "Kristin Ashby",
        "timestamp": 1618404899
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"309437\">@Kristin Ashby</span>  The partOf organization in the network profile is \"The organization that manages this network\".</p>",
        "id": 234517308,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1618413140
    },
    {
        "content": "<p>Thank you Saul,  I was not asking about the definition.  I was checking about the difference in the cardinality between Network and Organization.  Network is 1...1 while Organization is 0...1.</p>",
        "id": 234708119,
        "sender_full_name": "Kristin Ashby",
        "timestamp": 1618503842
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"309437\">@Kristin Ashby</span> yes, in the Network profile, the partOf is required.</p>",
        "id": 236178025,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1619445454
    },
    {
        "content": "<p>A Network refers to a healthcare provider insurance network. A healthcare provider insurance network is an aggregation of organizations and individuals that deliver a set of services across a geography through health insurance products/plans. A network is typically owned by a payer.</p>\n<p>In the PlanNet IG, individuals and organizations are represented as participants in a PLan-Net Network through the practitionerRole and Plan-Net-organizationAffiliation resources, respectively.</p>\n<p>Question:<br>\n1.Do we create one PlannetNetwork profile for Medicaid? Yes, and by extension the Plannet Insurance profile.<br>\nIf so, how do we identify Medicaid for the data elements needed to create the PlannetNetwork profile (which is based on the Organization profile)?</p>\n<p>For example, Organization ID.<br>\nMedicaid does not have a provider ID. How do we identify Medicaid?</p>",
        "id": 254583150,
        "sender_full_name": "Anil Samuel",
        "timestamp": 1632422199
    },
    {
        "content": "<p>Anil, I have read your questions and I am putting together answers to your questions. It might take a few days to give a comphrensive answer and accurate guidance.</p>",
        "id": 255246526,
        "sender_full_name": "Sean Mahoney",
        "timestamp": 1632846657
    },
    {
        "content": "<p>Anil, please see answers to your questions below. <br>\nQ1.  A state should have one FFS PlannetInsurancePlan instance. In addition, one PlannetNetwork instance would be created for each network of providers and organizations within a state’s FFS Medicaid program. The PlannetInsurancePlan would have a reference to each network of providers participating in that plan (for different benefits and geographic coverage areas, etc.).<br>\nQ2. The Medicaid Agency would be identified through the InsurancePlan resource. The PlannetInsurancePlan.OwnedBy field would reference the Medicaid Agency Organization Resource (e.g. ‘Virginia Medicaid Program’). The PlannetInsurancePlan.Type field would be set to ‘Medicaid’</p>",
        "id": 255572966,
        "sender_full_name": "Sean Mahoney",
        "timestamp": 1633008315
    }
]