[
    {
        "content": "<p>Within the Practitioner Profile there are references to Organization - Is there an assumption that Organization Profiles need to be built out for Qualification.identifier.assigner, Qualification Issuer, and Identifier Assigner? <br>\nQualification.identifier.assigner and Identifier Assigner both have the same comment:  Comments <br>\n\"... may omit the .reference element and only contain a .display element reflecting the name or other textual information about the assigning organization.\" <a href=\"http://hl7.org/fhir/R4/datatypes-definitions.html#Identifier.assigner\">http://hl7.org/fhir/R4/datatypes-definitions.html#Identifier.assigner</a><br>\nYet Qualification Issuer does not have the same comment.  Need helping understanding how to present Qualification Issuer? Can I follow the same comments from Qualification.identifier.assigner and Identifier Assigner?</p>",
        "id": 197219475,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1589240650
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span></p>",
        "id": 197310302,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1589304656
    },
    {
        "content": "<p>Hi Jason, </p>\n<p>Based upon what I heard, for this IG anything flagged with Must Support means that if you have the data you must provide it. So if you know the organization that assigned the qualification associated with a Practitioner it is expected that you provide it. This IG references the base version of Organization, so that does leave things open in terms of what data you provide about the organization.</p>",
        "id": 197353365,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1589326436
    },
    {
        "content": "<p>The attributes that are in question are not flagged as Must Support or have a card of 1..1.  I questioning the definition variation between the three attributes.</p>",
        "id": 197394886,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1589366690
    }
]