[
    {
        "content": "<p>When implementing data that is specific to pharmacies, is there a requirement to aggregate pharmacy data into the rest of the provider data, or even have them in the same instance or part of the same dataset? The reason I ask is that, for our solution, our Provider Directory and Pharmacy Directory data come from two different sources, which, for architectural reasons, makes it difficult for us to utilize the same endpoints for both. We're wondering then if we can have separate domains/endpoints for provider versus pharmacy directory in order to segregate the data, e.g.:<br>\n<a href=\"https://api.providersolution.net/Organization\">https://api.providersolution.net/Organization</a><br>\n<a href=\"https://api.pharmacysolution.net/Organization\">https://api.pharmacysolution.net/Organization</a></p>",
        "id": 219387186,
        "sender_full_name": "David Clowers",
        "timestamp": 1607542700
    },
    {
        "content": "<p>Is there any requirement that this violates, or is this simply an implementation decision that is left up to the team to decide?</p>",
        "id": 219387289,
        "sender_full_name": "David Clowers",
        "timestamp": 1607542747
    },
    {
        "content": "<p>Thoughts:<br>\n1) There would be some redundancy between the two endpoints, since InsurancePlans and Networks would need to live in both<br>\n2) Naive suggestion: Could you implement as two endpoints under the covers and just route queries to both endpoints merging the results?</p>\n<p>My initial take is that this would be a barrier to interoperability since a client would need to know about two separate endpoints and figure out when it was supposed to query each one.</p>",
        "id": 219389305,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1607543750
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Thanks, we're looking into this as a possibility. When we're trying to separate data by typical provider versus pharmacy, using Organization as an example, which one of these categories should each fall into? I'm assuming a typical provider would be either fac or prvgrp, whereas pharmacy would be atyprv.<br>\n<a href=\"http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/ValueSet-OrgTypeVS.html\">http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/ValueSet-OrgTypeVS.html</a></p>",
        "id": 220050340,
        "sender_full_name": "David Clowers",
        "timestamp": 1608070342
    }
]