[
    {
        "content": "<p>The plannet Network profile as mentioned in the IG is based on US Core Organization, but there is a line mentioned in the documentation itself ;<br>\nThe Network profile is based on USCore Organization, since there was no contradiction between the USCore profile and the Plan-Net requirements. However, the NPI and CLIA identifier types, which are Must-Support, are clearly intended for provider organizations only and are not expected to be populated for other organization types.</p>\n<p>so how is it feasible to inhert the network profile from US Core Organization where the NPI and CLIA are MUST SUPPORT?</p>",
        "id": 232556522,
        "sender_full_name": "Chetana Nayyar",
        "timestamp": 1617180898
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"343995\">@Chetana Nayyar</span> .   Good question. There is no contradiction between the US-Core base for the network profile and the statement in the profile <a href=\"http://hl7.org/fhir/us/davinci-pdex-plan-net/StructureDefinition-plannet-Network.html#implementation-guidance\">documentation</a> that NPI and CLIA identifiers are not expected for organizations that are not providers.</p>\n<p><a href=\"http://hl7.org/fhir/us/davinci-pdex-plan-net/implementation.html#must-support-1\">Must support != required</a>.  Basically MS means you have to be capable of producing it (server) and consuming it(client), and must produce it if it is available.  If the data is not available, the server need not make excuses -- just don't provide it.</p>",
        "id": 232594863,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1617198831
    },
    {
        "content": "<p>Hi Saul - is it possible then to remove the must support indicators on these identifier types within the Network profile?  telecom.rank is must support on the Organization profile but not on the Network profile so I assume there is some leeway for customizing that by profile?</p>",
        "id": 232646604,
        "sender_full_name": "Kate Dech",
        "timestamp": 1617217351
    },
    {
        "content": "<p>Yes, not sure why telecom.rank is MS in Plan-Net-Organization, but not in Plan-Net-Network.</p>",
        "id": 232655687,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1617220814
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span> I recorded it for the future.   <a href=\"https://jira.hl7.org/browse/FHIR-31674\">https://jira.hl7.org/browse/FHIR-31674</a></p>",
        "id": 232670003,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1617227058
    }
]