[
    {
        "content": "<p><strong>DaVinci PDEX Plan Net STU1 Update Peer Review</strong></p>\n<p>The DaVinci PDEX Plan Net project has determined that certain changes should be applied to update the STU1 specification to better meet market needs and therefore have sought and received HL7 Financial Work Group approval to hold a peer review of the intended changes.</p>\n<p>Specification Location:</p>\n<p>The changes have been applied to the version of the specification located in the continuous build at: <a href=\"http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/\">http://build.fhir.org/ig/HL7/davinci-pdex-plan-net/</a> . Note that no changes will be permitted to the continuous build during the peer review.</p>\n<p>Scope:</p>\n<p>The scope of the review is limited to the specific changes made to this version of the specification and listed on the home page of the specification in section 1.1.1 </p>\n<p>Changes for the STU Update (since V1.0.0 - STU1). Jira tickets related to any other portions of the specification may be considered for a later update or ballot.</p>\n<p>Voting and comments:</p>\n<p>The peer review is open to any interested party who may indicate via email with the subject: \" DaVinci PDEX Plan Net STU Update Peer Review\" to \" <a href=\"mailto:benoit.schoeffler@almerys.com\">benoit.schoeffler@almerys.com</a>\" &lt; <a href=\"mailto:benoit.schoeffler@almerys.com\">benoit.schoeffler@almerys.com</a> &gt;,\"jeffbrown@ <a href=\"http://mitre.org\">mitre.org</a>\" &lt;<a href=\"mailto:jeffbrown@mitre.org\">jeffbrown@mitre.org</a>&gt; whether they vote Affirmative (support the update) or Negative (oppose the update). You may also submit a Jira ticket for any changes/corrections which you think should be considered for the material being updated.</p>\n<p>Peer Review Period:</p>\n<p>The peer review will be conducted between 11PM eastern Tuesday December 21 2021 and 11PM eastern Sunday January 9 2022. The Financial Management committee will consider the results of the peer review at a regular conference call meeting after the close of the peer review to determine the next steps with respect to the specification update.</p>\n<p>Thank you for your consideration and participation in the peer review.</p>",
        "id": 265810547,
        "sender_full_name": "Corey Spears",
        "timestamp": 1640183165
    }
]