[
    {
        "content": "<p>Good morning! I'm new to all of this and I'm working on the provider API mapping and have a question on Resource Profile: Plan-Net location – specifically the Location.identifier.  It indicates this is a unique code or number identifying the location to it’s users.  The location type has a codeable concept (required) but yet the codes do not match what we would expect to be a location.  They contain codes such as TIN, NPI, Driver’s license, etc.  These are not generally associated to a provider location.  I’m not sure what we are missing here, but it doesn’t seem to make sense? </p>\n<p>Overall, the provider API profiles seem really extensive for provider directory.  Are all of these profiles actually ‘required’?  We have minimal provider directory datasets and want to meet the requirement, but some of these just don’t seem to make sense - are we missing something?\"</p>",
        "id": 217295742,
        "sender_full_name": "Nicole Naegeli",
        "timestamp": 1605803836
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"365695\">@Nicole Naegeli</span> <br>\nLocation.identifier is not a required (min cardinality 1) or MustSupport element.</p>\n<p>The capability statement sets the conformance requirements.   You must support all of the profiles.<br>\nPlease look through the examples and 'patterns' as described in <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/implementation.html#Representing\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/implementation.html#Representing</a>   .  My guess is that you will need all of the profiles except, perhaps for Endpoint.</p>\n<p>If you have no data that uses a particular profile, the minimum support on the server side would be the ability to respond to the API search parameters with a response indicating that there are no instances satisfying the query.</p>",
        "id": 217305540,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1605808016
    }
]