[
    {
        "content": "<p>Picking up conversation started <a href=\"#narrow/stream/179166-implementers/topic/Question.20on.20Provider.20Directory.20.20Location.20API.2E\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Question.20on.20Provider.20Directory.20.20Location.20API.2E</a></p>\n<p>Question from <span class=\"user-mention\" data-user-id=\"317580\">@Nagarjuna Sanivarapu</span> :<br>\n<span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> , <span class=\"user-mention\" data-user-id=\"305230\">@Suma Addagadde</span> <br>\nWhen Payer Implementing FHIR, sourcing data from two different vendors(as native FHIR API'S) for Provider and Pharmacy directory, what is the best way to determine and route the \"Location\" resource request to specific vendor when third party app doesn't pass \"_has:OrganizationAffiliation:location:role=pharmacy or hosp\" in the request. Can we enforce \"has:OrganizationAffiliation:location:role\" as required search parameter in our capability statement for third party app?</p>",
        "id": 225058527,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1612376758
    },
    {
        "content": "<p>Just clarifying your question.  You have a Plan-Net endpoint that is simply a front-end for two vendor FHIR Endpoints, one for Pharmacy and one for non-pharmacy Providers.   I think your question is if  a query is received &lt;plan-net-base&gt;/Location/_id=&lt;&gt;. or &lt;plan-net-base&gt;/Location?&lt;something&gt;, how can you know which of the vendor endpoint should respond to the query.   Did I get it right?</p>\n<p>Your suggestion is to route Location queries that have an associated pharmacy (or hospital) Organization Affiliation to the Pharmacy endpoint, and the others to the non-Pharmacy endpoint.   Right?</p>",
        "id": 225059293,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1612377046
    },
    {
        "content": "<p>Thanks Saul. Yes that is correct, will the plan be deviating from IG and create compatibility issues with 3rd party?</p>",
        "id": 225062607,
        "sender_full_name": "Nagarjuna Sanivarapu",
        "timestamp": 1612378282
    },
    {
        "content": "<p>Your proposal won't work.   Querying a location by _id or any of its other search parameters without any reverse chaining constraint is required and expected.  Clients have an expectation that your implementation supports the SHALL capabilities in the IG, and when you deviate from that you will break clients.   For example, an expected use case is a client that has cached the directory content will return to check if the lastUpdated date on an instance has changed.</p>\n<p>I don't know how to address this challenge.  Perhaps others on this stream have ideas.<br>\nPerhaps you could pass the query to both vendor endpoints and merge the results?<br>\n<span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span></p>",
        "id": 225065460,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1612379437
    },
    {
        "content": "<p>Thanks Saul for the response. Just to clarify,  we are certainly supporting the SHALL capabilities in the IG.  in addition,  we are making the _has:OrganizationAffiliation:location:role search criteria as mandatory to help us distinguish pharmacy and provider directory requests.   It is similar to having 2 different endpoints for Provider and Pharmacy directory requests.  We are facing the challenge of having to consolidate responses from 2 vendors and also support FHIR pagination.   This ability to have seperate requests for Provider and Pharmacy will greaty simplify our implementation.   Appreciate any guidance on this.</p>",
        "id": 225099470,
        "sender_full_name": "Suma Addagadde",
        "timestamp": 1612395390
    },
    {
        "content": "<blockquote>\n<p>making the _has:OrganizationAffiliation:location:role search criteria as mandatory </p>\n</blockquote>\n<p>Not all Location queries to the Pharmacy info will have this qualifier.  So I would say that all Location queries having this qualifier should probably go to the pharmacy vendor.  But queries lacking this qualifier may also need to go to pharmacy vendor.</p>",
        "id": 225100141,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1612395875
    },
    {
        "content": "<p>Thanks Saul</p>",
        "id": 225256109,
        "sender_full_name": "Suma Addagadde",
        "timestamp": 1612494668
    }
]