[
    {
        "content": "<p>Question from <span class=\"user-mention\" data-user-id=\"337176\">@Sudheesh Thuruthiyil</span> :<br>\n<code>The use case is to exclude certain providers from showing up in the provider directory. We would like to use the active flag on the plannet profiles to set to false. It appears you have mandated to have this contain a \"True\" always. Is there a workaround? Appreciate the help.</code><br>\n<span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span> <span class=\"user-mention\" data-user-id=\"215603\">@Sean Mahoney</span></p>",
        "id": 235590756,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1619043216
    },
    {
        "content": "<p>As I recall the IG is only meant to expose active directory data to support live search/retrieval. There is not a mechanism to purge/hide information. Rather than set active to false I believe the intent was to omit inactive data.</p>",
        "id": 235607619,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1619055668
    },
    {
        "content": "<p>Provider DIrectory IG is intended to present only active elements.<br>\nThere is no provision for versioning, marking as deleted/deprecated.  Any data returned by the API should be active, thus the requirement for active=True.</p>",
        "id": 235671278,
        "sender_full_name": "Sean Mahoney",
        "timestamp": 1619096119
    },
    {
        "content": "<p>Thanks for your responses. We are also using FHIR for storage of provider directory data and would have been nice to assign active/inactive flags so we could use  this in the search/retrieval process of the API. Payers have many other business scenarios where they dont want to list their entire providers on a directory.</p>",
        "id": 235718929,
        "sender_full_name": "Sudheesh Thuruthiyil",
        "timestamp": 1619113380
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"337176\">@Sudheesh Thuruthiyil</span> <br>\nNothing prevents you from doing that.  However, all of the data served up through the API for members  must have active = true.</p>",
        "id": 235724675,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1619115620
    }
]