[
    {
        "content": "<p>OK, Denmark - there is an ongoing discussion on whether to use FHIR or CDA on a more national level. I'm all in for using FHIR, but I would like to hear some of the arguments for choosing CDA instead. Are there any such arguments present among you guys?</p>",
        "id": 153861512,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1481101045
    },
    {
        "content": "<p>I know I should keep out of this... but I am the CDA expert for the national program here in Australia.... happy to provide commentary if you want. I invented FHIR because I could see where a CDA based national program was heading</p>",
        "id": 153861557,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481107534
    },
    {
        "content": "<p>Jens, to me this is currently a question about the maturity levels (or lack thereof) of the clinical resources. Once those are mature I wouldn't hesitate to recommend new implementers of eDocuments to use FHIR instead of CDA. But right nowm just because of the overall maturity level of the standard, CDA is still the name of the game. It'll take a few years for FHIR to overtake the functionality/maturity that's curently present with CDA R2.</p>",
        "id": 153862744,
        "sender_full_name": "René Spronk",
        "timestamp": 1481297041
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  So for greenfield projects, you would still consider CDA?</p>",
        "id": 153862748,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1481298616
    },
    {
        "content": "<p>and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> your comments are always welcome ;)</p>",
        "id": 153862749,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1481298969
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> Yes. As always it depends on the exact use case - if you only need 'level 2' CDA documents, or CDA with a NonXMLBody option, you might as well use FHIR documents if it suits the context. For CDA we've had to wait for 10 years before we had the proper tooling to express constraints and to do strict validation and code generation. With FHIR this comes out of the box. So the main factors are a) installed base (be conservative: do what the others are already doing) and b) maturity of the spec.<br>\nI'll go as far to state that for complex <em>clinical</em> data, (when solely looking at the HL7 suite of standards) HL7 v3 is currently still the best option. Not the easiest option mind you, so I'm looking forward to the point in time where FHIR wil allow for capturing the same level of complex clinical data. My guess is that it'll take about 3 years for us to reach that point. </p>",
        "id": 153862753,
        "sender_full_name": "René Spronk",
        "timestamp": 1481301455
    },
    {
        "content": "<p>perhaps my experience is too coloured by the Australian experience.... if you want to build a national system that is a merely a big bucket of documents, that users can only use by reading the documents, then CDA level 1 is a good choice. </p>\n<p>if you find yourself talking about data... it's *hard* work to build data flows, consistent semantic reasoning, useable validation. That's because of the way CDA works for data, and the essential document-ness of the whole thing. </p>\n<p>It *can* be done. But I think that FHIR is already a better choice, except purely for the maturity part of it. if you're going to do that much work, build it on APIs and OAuth, and you'll get a lot more bang for your buck. Here in Australia we would have got far more outcomes at 10% of the cost if we'd just used PDF</p>",
        "id": 153862767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481310125
    },
    {
        "content": "<p>I see just as much value in adaptation as in 'maturity' - maybe even more in adaptation, and it might be a discussion for itself to determine what a 'mature' standard is. <span class=\"user-mention\" data-user-id=\"191555\">@Christian Jeppesen</span> , <span class=\"user-mention\" data-user-id=\"193136\">@Christian Jonigkeit</span> , <span class=\"user-mention\" data-user-id=\"192477\">@Thor Schliemann</span> do you guys have anything you would like to add to the discussion?</p>",
        "id": 153863110,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1481535946
    }
]