[
    {
        "content": "<p>MedCom has started its initiative to modernize the danish infrastructure including remodelling the MedCom messages. On the first meeting we looked at the inital structure and business demands. One of the outcomes was the following: <a href=\"https://simplifier.net/danishnationalprofil/vansbundle\" target=\"_blank\" title=\"https://simplifier.net/danishnationalprofil/vansbundle\">https://simplifier.net/danishnationalprofil/vansbundle</a> - a rough and preliminary start ;)</p>",
        "id": 153956451,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1525701711
    },
    {
        "content": "<p><span class=\"emoji emoji-1f389\" title=\"tada\">:tada:</span></p>",
        "id": 153956452,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1525701726
    },
    {
        "content": "<p>During summer we have been busy at MedCom, with lots of other activities, but from september 17. we allocate ressources for the next step of a POC for Danish messaging. We plan to have a first version running before e-sundhedsobservatorium conference and FHIR DevDays in Amsterdam. More news after the 17.</p>",
        "id": 153994876,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1536509117
    },
    {
        "content": "<p>Looking forward to hear more from you guys - and btw - maybe some valuable input regarding questionnaires: <a href=\"http://www.healthintersections.com.au/?p=2835\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2835\">http://www.healthintersections.com.au/?p=2835</a></p>",
        "id": 153997191,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1537033563
    },
    {
        "content": "<blockquote>\n<p>During summer we have been busy at MedCom, with lots of other activities, but from september 17. we allocate ressources for the next step of a POC for Danish messaging. We plan to have a first version running before e-sundhedsobservatorium conference and FHIR DevDays in Amsterdam. More news after the 17.</p>\n</blockquote>\n<p>So where are the news <span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span>  ;) it's the 18th.</p>",
        "id": 153997518,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1537249888
    },
    {
        "content": "<p>Yesterday we found the first version of a FHIR ClinicalEmail, from before the summer holidays, and took a closer look at it. We identified the extra fields needed, and will add these during the near future. MedCom has a full trial simplifier version from september 17. and until end october, and we want to analyze if it can fulfill all our needs for online documentation.  We continue the work and will make a status update september 27. Stay tuned</p>",
        "id": 153997704,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1537294202
    },
    {
        "content": "<p>Let me know if there is anything I can assist you with</p>",
        "id": 153998145,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1537368810
    },
    {
        "content": "<p>MedCom has so far not understod the meaning of \"F\" in FHIR, but this year 2020 will be the year where we speed up. During spring we will profile the first two MedCom messages - \"Clinical Email\" and notification of  hospital admission/discharge. First versions will be presented at the first project workshop January 22. Between the two first workshops, until May 2020, we expect to finalize the two messaging profiles, and in parallel establish some danish national core ressources. We invite all with interest to follow the proces here in Zulip, and join in the work for the commen goal.</p>",
        "id": 185745802,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1579123454
    },
    {
        "content": "<p>FHIR Messages ? Will you be using GraphDefinition as well?</p>",
        "id": 185793417,
        "sender_full_name": "René Spronk",
        "timestamp": 1579162100
    },
    {
        "content": "<p>it will most likely be fhir messaging - what would the take be on GraphDefinition in that context?</p>",
        "id": 185897414,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1579250947
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span></p>",
        "id": 185897538,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1579251061
    },
    {
        "content": "<p>It all depends on how one wishes to do the profiling - profiling a complex structure using StructureDefinitions only is possible, as long as one regards the message structure as a tree with outbound references between the nodes in the tree. GraphDef allows one to define the overall structure of the message. You'd do so in conjunction with StrucDefs that each describe the constraints on a node in the graph.</p>",
        "id": 185905562,
        "sender_full_name": "René Spronk",
        "timestamp": 1579258849
    },
    {
        "content": "<p>I never really got much in touch with GraphDefinition - this could be an excuse to spend some time on it</p>",
        "id": 185919444,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1579270871
    },
    {
        "content": "<p>I never knew much about it - and then I volunteered to present a tutorial on it at the Amsterdam DevDays last year. Now I know a lot more about it, and I've proposed a revamp of its design - its maturity level is still relatively low.</p>",
        "id": 185920586,
        "sender_full_name": "René Spronk",
        "timestamp": 1579271683
    },
    {
        "content": "<p>Yes I heard it - I guess I'll have to revisit the video then ;)</p>",
        "id": 186012475,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1579382785
    },
    {
        "content": "<p>Great to hear, <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>, I would certainly like to go further into GraphDefinitions. If you have suggestions on how GraphDefinitions should be redesigned, I would like to know how and on what purpose. We haven't gone into it yet in MedCom, but it is on my bucketlist to do so, so I'm very curious, what you are up to?</p>",
        "id": 186112260,
        "sender_full_name": "Ole Vilstrup",
        "timestamp": 1579535016
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-25474\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-25474\">https://jira.hl7.org/browse/FHIR-25474</a> , a lengthy rationale can be viewed in my Amsterdam devDays presentation on the same subject (which can only be viewed by attendees of that Devdays).</p>",
        "id": 186178196,
        "sender_full_name": "René Spronk",
        "timestamp": 1579610203
    }
]