[
    {
        "content": "<p>There's a new kid in town ... and its waiting for input: <a href=\"https://simplifier.net/DanishNationalProfil/CrossSectoralAppointment\" target=\"_blank\" title=\"https://simplifier.net/DanishNationalProfil/CrossSectoralAppointment\">https://simplifier.net/DanishNationalProfil/CrossSectoralAppointment</a></p>",
        "id": 153873058,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1487790677
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191521\">@Michael Christensen</span> <span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span> <span class=\"user-mention\" data-user-id=\"191539\">@Torben M. Hagensen</span> <span class=\"user-mention\" data-user-id=\"192477\">@Thor Schliemann</span> <span class=\"user-mention\" data-user-id=\"192048\">@Jan Petersen</span> - i bedste FHIR ånd, ville det være fedt hvis vi kan starte debatten op her ang. aftaleprofilering for FHIR</p>",
        "id": 153873779,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1488192875
    },
    {
        "content": "<p>Jeg tænker på Composition, hvis FHIR aftalen skal persisteres som et dokument, sammenlignelig med den nye CDA for aftaler. Skal aftalen udveksles mellem to systemer, ser jeg ikke samme behov for en Composition. Er brug af Composition ikke FHIR måden at lave CDA på?</p>",
        "id": 153873784,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1488193487
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191522\">@Jesper Langfeldt Hagen Haffgaard</span> og <span class=\"user-mention\" data-user-id=\"191555\">@Christian Jeppesen</span> - Jeres input vil være velkommen. Vil en composition ikke være den løsning, som giver den mest anvendelige profil på ressourcerne? Jeg tænker, at en løsning med contained references vil skabe en meget snævert anvendelig profil..</p>",
        "id": 153873793,
        "sender_full_name": "Torben M. Hagensen",
        "timestamp": 1488197661
    },
    {
        "content": "<p>Det afhænger vel også af hvilken arkitektur man ligger for dagen ... Hvis det skal være meget self-contained og beskedorienteret, så er dokumentparadigmet vel som sådan udmærket til dette og dermed med er composition god løsning</p>",
        "id": 153873794,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1488199090
    },
    {
        "content": "<p>Det vigtigste her er vel, at Appointment profilen er selvstændig. Det giver så mening, at vi yderligere forholder os til, hvordan vi vil udveksle Appointments, når vi bruger dokumentparadigmet (Composition+Appointment+...) og når vi bruger beskedparadigmet (Bundle+MessageHeader+Appointment+...).</p>",
        "id": 153873969,
        "sender_full_name": "Jesper Langfeldt Hagen Haffgaard",
        "timestamp": 1488267971
    },
    {
        "content": "<p>Så sandt <span class=\"user-mention\" data-user-id=\"191522\">@Jesper Langfeldt Hagen Haffgaard</span> </p>",
        "id": 153873970,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1488268097
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span> , hvilken arkitektur knytter der sig til aftaledeling? Er det en genvisitering af et IHE XDS setup? eller er der tale om noget andet?</p>",
        "id": 153873971,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1488268168
    },
    {
        "content": "<p>Den eneste arkitektur der er fastlagt på nuværende tidspunkt, er den for CDA udgaven, der bliver IHE XDS. Hvor langt vi ønsker at gå af FHIR sporet, og hvilken arkitektur der skal anvendes, vil være spørgsmål til debat på det fjerde møde i rækken for aftaleprojektet. Vi holder et internt MedCom summemøde mandag d. 6/3, for at \"tænke tanker\". Det vil være fint at begynde med Appointment profilen, og senere afgøre arkitekturen hvormed aftalen udveksles.</p>",
        "id": 153874491,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1488485416
    },
    {
        "content": "<p>Mark the date at 7th of June - we'll be profiling danish FHIR profiles in Aarhus, DK. Let us know if you would like to participate for this all day event</p>",
        "id": 153886714,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1493765558
    },
    {
        "content": "<p>We will show up from MedCom, and look forward to the day in Aarhus (my hometown). Great initiative - going to be fun.</p>",
        "id": 153890417,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1495131026
    },
    {
        "content": "<p>Solen skinner og det er sommer i Danmark, men noget mangler. Nogle leverandører anvender FHIR, mens flere viser interesse. Tak til den danske SIG under HL7 affiliaten, for introduktionen til profilering, og promoveringen af FHIR generelt. MedCom kunne godt tænke sig at afprøve udveksling af en FHIR meddelelse, for at samle erfaringer hermed, og afprøve infrastrukturen. Samtidigt kunne de allerede igangværende projekter få konsolideret de danske profileringer, og vi kunne i Danmark begynde overvejelserne for en transitionen fra EDI mod FHIR for tværsektoriel interoperabilitet. Jeg tænker en start kunne være korrespondancemeddelelsen, måske mellem en kommune og en lægepraksis, men kom frisk med andre forslag. Jeg har lidt timer at kaste i projektet, og kan stå for afprøvningen. Vi har brug for jer, for at kunne  foretage profileringen. Hvem er med? Tænk gerne højt, hvordan I ser en afprøvning udført.</p>",
        "id": 153893967,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1497506203
    },
    {
        "content": "<p>Hej <span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span> - korrespondancemeddelelsen lyder som en fint sted at starte. Hvilken økonomi er der forbundet med det?</p>",
        "id": 153894695,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498043669
    },
    {
        "content": "<p>Hej <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> - forvent ikke guld og grønne skove, men jeg kunne spørge på en anden måde - hvad skal der til for at et par leverandører melder sig som pilot? Jeg tænker MedCom kan bidrage med at sprede budskabet om FHIR, og også lave mapning mellem formater. Derudover har vi tidligere honoreret konsulenter/leverandører for at foretage fx profilering.</p>",
        "id": 153895130,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1498252367
    },
    {
        "content": "<p>Her i efteråret laver MedCom en mindre pilotafprøvning af hvorvidt FHIR kan anvendes til  udveksling af beskeder. Hvem vil være med? Jeg tænker at den konkrete beskedtype aftales i forbindelse med e-obs 2017. Husk at tilmelde jer den arrangerede Hackathon. Jeg laver nok nogle bilaterale aftaler, men i den gode community spirit bør alle der ønsker det have muligheden for at deltage. Kom frisk.</p>",
        "id": 153903353,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1503468877
    }
]