[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192821\">@Martin Bellehumeur</span> </p>\n<p>After further discussions with <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>  yesterday, regarding topics and authorization as it pertains to websocket clients, I am putting , together a small document starting with the high-level sequence of events from launch through notification for the client application. Then following with a proposal that [hopefully] you can review/modify, and we can implement and test soon. I hope to have something to share before lunch here. I don't expect you to be able to do anything at that time, but i\"m hoping it will bring us to a point where we can back to implementation and testing of our prototypes some time next week. The big change I'm probably going to propose is that we implement some sort of interim authorization mechanism that will be easy to convert to OAuth when we validate the entire flow with the prototype.</p>",
        "id": 155034476,
        "sender_full_name": "George Kustas",
        "timestamp": 1547393230
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192821\">@Martin Bellehumeur</span>  - what do you think about starting out with OAuth right from the start in our prototype? I feel I can learn enough to implement something on the client side fairly soon. Doing the server side (AS) on my hub may be more challenging, but I will look into that too.</p>",
        "id": 155036142,
        "sender_full_name": "George Kustas",
        "timestamp": 1547395978
    },
    {
        "content": "<p>Well, I know just enough about oAuth to know that I need to really learn it.  There are a couple of node.js examples on the web and I was planning to start on that anyway.  I'll work on that this week.  Thanks for your efforts on FHIRcast!!</p>",
        "id": 155036964,
        "sender_full_name": "Martin Bellehumeur (Visage Imaging)",
        "timestamp": 1547397469
    },
    {
        "content": "<p>Yes, you and I are in the same position... I am going to do the same. Let's stay in  touch this coming week and maybe the two of us can come to some conclusions. I'm going to document some of the things we discussed on github issue #57. Mostly the challenges faced by Websockets, and the scenario where applications will be running on separate workstations (inability to do SMART/FHIR launch). The latter is unfortunate because it could solve the problem of sharing a topic (session id) with other clients. Talk to you next week, and thank YOU for all your work.  I still can't believe how prolific you are with your design, code and presentations. Do you ever sleep? :-)</p>",
        "id": 155037959,
        "sender_full_name": "George Kustas",
        "timestamp": 1547399068
    }
]