[
    {
        "content": "<p>Radiologists have been asking for a way to automatically populate their reports with prior exam information. That is, a simple text header at the top of their reports referencing the exam name, date, etc. The workflow for priors starts on the PACS - AFTER they open the image for study.  Right now FHIRCast is only being used to synchronize context (patient and study via accession). This requirement would need a new event - one that would occur after open-image-study, and would contain one or more additional studies to be interpreted by subscribers as \"priors\".</p>\n<p>There have been previous discussions in our community (somewhere) about using FHIRCast for non-context related purposes. Measurements, for example, which leads to another discussion about events for ANY kind of change in the current user session regarding Observation status. That is a another stream that I will start (or join) later. But for the purposes of this stream, I'd like to propose and get feedback on \"priors\".  If this isn't the right forum for the discussion <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>  I fully understand. Just let me know.</p>\n<p>The FHIRCast spec makes a brief mention of new, custom events and goes as far as defining a naming convention (reverse url). It also says that the event catalog must list the events. Is this the extent of adding a new event? Simply naming it and adding it to the Hub's event catalogue? Or must each new event be added to the specification? </p>\n<p>Finally,  I propose a new event, call it \"prior-imaging-studies\". The FHIR context would simply be an array of Imaging Study resources. </p>\n<p>Alternatively, we can consider another workflow to before defining a new event solely for priors: This would the use case of assigning additional exams/accessions (or removing exams) from the initial list of exams contained in the open-imaging-study event. Perhaps this new event could be used for this work flow as well as the priors workflow, where each study is tagged to indicate whether it is a prior, a study to be added, or a study to be removed. Sorry if I'm interchanging the terms \"exam\" and \"study\" improperly.</p>\n<p>I realize that additional details will need to be thought through - like validation of the current patient/study context (perhaps a parameter in the payload or part of the endpoint). But for now, I'd just like to get your feedback. <span class=\"user-mention\" data-user-id=\"194364\">@Leo Bergnéhr</span> <span class=\"user-mention\" data-user-id=\"194452\">@Bas van den Heuvel</span> <span class=\"user-mention\" data-user-id=\"194356\">@Will Maethner</span>  <span class=\"user-mention\" data-user-id=\"192821\">@Martin Bellehumeur</span></p>",
        "id": 165914870,
        "sender_full_name": "George Kustas",
        "timestamp": 1558110687
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"196152\">@George Kustas</span> , to clarify the workflow:</p>",
        "id": 166116315,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1558383448
    },
    {
        "content": "<p>the radiologist wants to see prior studies for the same patient to review their clinical history, right? Similarly, the radiologist may want to see recent Procedures or ... maybe the patient's problem list.</p>",
        "id": 166116320,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1558383452
    },
    {
        "content": "<p>I'd suggest that the reporting system should have access to the hub's FHIR server. Note that following the SMART launch, this occurs naturally. The reporting system can simply query the FHIR server over rest, upon receiving the <code>open-patient-chart</code> event for all of this type of clinical information for the current patient.</p>",
        "id": 166116321,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1558383454
    },
    {
        "content": "<p>What do you think?</p>",
        "id": 166116323,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1558383456
    },
    {
        "content": "<p>I don't see how that will work. The Radiologist chooses specific prior studies for review in the study he/she is working on. They actually open these studies in the PACS for comparison. It is these studies (not all previous studies for the patient) that they want included in the report (automatically). These priors may have been two days ago or two years ago.</p>\n<p>What you suggested could be helpful in other areas potentially. But that Hub method you suggest is not part of the FHIRCast specification - correct?</p>",
        "id": 166166841,
        "sender_full_name": "George Kustas",
        "timestamp": 1558441275
    },
    {
        "content": "<p>I am working on the actual data definition for including prior studies in the array of context portion of the JSON payload. In order to differentiate the prior(s) from the current study, I was considering a prior element to have a \"key\" : \"prior-study\" as opposed to the current study which is \"key\" : \"study\". I have a couple of basic questions:<br>\n1. Are the <strong>context </strong>, <strong>key</strong>,  <strong>resource </strong>and <strong>resourcetype </strong>elements (which FHIRcast uses to contain the actual resource) defined in the FHIR spec? I couldn't find that.<br>\n2. If they are defined, is there a list of valid key names? Meaning, can we just add a new name like \"prior-study\"?</p>",
        "id": 166263652,
        "sender_full_name": "George Kustas",
        "timestamp": 1558529312
    },
    {
        "content": "<p>I don't know where this discussion is currently, but my suggestion is that the PACS should be making the decision about relevant priors. It gets the \"study open\" and knows that when opening this type of study, for this radiologist, that certain filters should be applied when determining relevant prior imaging. I don't think that decision should be made outside of the viewer.</p>",
        "id": 166661110,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1558987222
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  I agree. The PACS \"owns\" the work list in almost all situations.</p>",
        "id": 167392084,
        "sender_full_name": "George Kustas",
        "timestamp": 1559743879
    },
    {
        "content": "<p>Except when there's no PACS involved! ;-)   [I keep thinking of the use case for EMR and related apps that do NOT include PACS systems.]</p>",
        "id": 167513566,
        "sender_full_name": "John Silva",
        "timestamp": 1559848734
    }
]