[
    {
        "content": "<p>Hey Friends - reviewing some github issues, I noticed that a number of implementers had perhaps reached consensus on <a href=\"https://github.com/HL7/fhircast-docs/issues/323\">creating encounter-open and encounter-close</a>. The justification is to simplify the scenario in which a user switches between encounters for the same patient chart, without ever closing that patient's chart.</p>",
        "id": 227481303,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1614105492
    },
    {
        "content": "<p>Overall, add encounter-open/close is straightforward and probably makes sense. The tricky part is that it would likely also make sense to deprecate the encounter element on patient-open/close.</p>",
        "id": 227481310,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1614105495
    },
    {
        "content": "<p>Any thoughts on this potential course of action? I wrote up a <a href=\"https://github.com/HL7/fhircast-docs/pull/355\">PR here</a>.</p>",
        "id": 227481315,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1614105496
    },
    {
        "content": "<p>I'm not sure I love how the events line up.  Specifically, since <code>encounter-close</code> says:</p>\n<blockquote>\n<p>User closed patient's medical record encounter context. A previously open and in context patient chart &amp; encounter is no longer open nor in context.</p>\n</blockquote>\n<p>it becomes a lot of work to process moving between encounters on the same patient.</p>",
        "id": 227495278,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1614110944
    },
    {
        "content": "<p>Good point. We can also make it easy and just say the encounter is closed.</p>",
        "id": 227566516,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1614156724
    },
    {
        "content": "<p>I feel like with the wording of Encounter-Open that it implies a Patient-Open at the same time.  Also, it only allows for one encounter to be open at a time with one patient.</p>\n<blockquote>\n<p>User opened patient's medical record in the context of a single encounter. Only a single patient and encounter is currently in context.</p>\n</blockquote>",
        "id": 227657182,
        "sender_full_name": "Catie Ladd",
        "timestamp": 1614194851
    },
    {
        "content": "<p>Good point - how does something like a comparison to a prior encounter work?</p>",
        "id": 227668501,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1614199264
    },
    {
        "content": "<p>I wonder whether we should provide such detail in the event description. It deviates from the event signaled by the event and does not make it clearer. The specification already states that the sender needs to be make sure the other  events (patient) also need to be send. </p>\n<p>The Encounter-open indicates an Encounter has been opened and is currently the \"selected\" encounter. A new Encounter-open means that another Encounter is the new selected resource. <br>\nAn Encounter-close signals that an Encounter has been closed. </p>\n<p>Multiple Encounters can be open at the same time, as long as they all refer to the same Patient. This use case relates to the more generic topic of multi-tab support, which we still need to resolve.</p>",
        "id": 227740188,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1614245603
    },
    {
        "content": "<p>Guys, I simplified the workflow description of <code>encounter-close</code> in response to Gino's feeedback.</p>",
        "id": 230510760,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1615901066
    },
    {
        "content": "<p>Catie, <code>encounter-open</code> does imply an already open patient record (this is in the same way that an dxreport-open implies an already open patient, right?)</p>",
        "id": 230510765,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1615901069
    },
    {
        "content": "<p>Bas, I really worry that an absence of a human-readable description of the event will make understanding an event more difficult for the typical reader ...</p>",
        "id": 230510877,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1615901121
    },
    {
        "content": "<p>Isaac, yes I think you're correct.  The wording sounded strange to me the other day, but looking at it again, it seems OK.</p>",
        "id": 230581160,
        "sender_full_name": "Catie Ladd",
        "timestamp": 1615924893
    }
]