[
    {
        "content": "<p>We're looking at FHIRCast to maintain Patient context, but we also want to maintain the search parameters like \"From-Date\" and \"To-Date\" across the subscribers. Would a Parameters FHIR resource in the \"context\" array be a good way to capture/maintain this information? Would using Parameters break any established rules in FHIRCast?</p>",
        "id": 163515028,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1555455664
    },
    {
        "content": "<p>Hey Ken, that's an interesting question.</p>",
        "id": 163581396,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1555521390
    },
    {
        "content": "<blockquote>\n<p>FHIRCast to maintain Patient context, but we also want to maintain the search parameters like \"From-Date\" and \"To-Date\" across the subscribers.</p>\n</blockquote>\n<p>Could you explain this a bit more? What do these dates represent?</p>",
        "id": 163581398,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1555521394
    },
    {
        "content": "<p>Overall, using the Parameters resources in the context of a notification would fit perfectly into FHIRcast.</p>",
        "id": 163581401,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1555521396
    },
    {
        "content": "<p>Thanks for the response.<br>\nWe want to be able to maintain a search range, so that across multiple subscribers, you can maintain the search range of \"from January 1st, 2018-Dec 31st, 2018\" using FHIRCast, so that each SMART on FHIR app will be updated w/ the appropriate search range and patient context, say, for a Drug Portlet as well as a Labs Portlet.</p>",
        "id": 163587408,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1555525248
    },
    {
        "content": "<p>Hey Ken, to summarize in different word -- the user's context in your driving application includes not only a patient but also a date range. When context events occur, you need this patient _and_ date range synchronized across all of the subscribing applications. Is that right? That makes sense and the Parameters resource would work well.</p>",
        "id": 163596066,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1555531320
    },
    {
        "content": "<p>The only caveat I can think of is -- when the patient doesn't change, but the date range does, do you need a custom event? Have you given this any thought, yet?</p>",
        "id": 163596133,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1555531356
    },
    {
        "content": "<p>Does FHIRCast always need to be event-driven? are changes in context allowed happen outside of a defined event? (is there a method to define/extend custom events?)</p>",
        "id": 163673455,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1555609495
    },
    {
        "content": "<p>Hey Ken, there is a method to define/extend custom events and FHIRcast is currently always event driven.</p>",
        "id": 163994347,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1556029485
    },
    {
        "content": "<p>The spec talks a bit about custom events in the <a href=\"http://fhircast.org/specification/May2019Ballot/#event-catalog\" target=\"_blank\" title=\"http://fhircast.org/specification/May2019Ballot/#event-catalog\">Event Catalog</a></p>\n<blockquote>\n<p>The name of the event SHOULD succinctly and clearly describe the activity or event. Event names are unique so event creators SHOULD take care to ensure newly proposed events do not conflict with an existing event name. Event creators SHALL name their event with reverse domain notation (e.g. org.example.patient-transmogrify) if the event is specific to an organization. Reverse domain notation SHALL not be used by a standard event catalog.</p>\n</blockquote>",
        "id": 163994408,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1556029549
    }
]