[
    {
        "content": "<p>It would be useful to have an id for which view or area something is being opened in.  That allows some information to be transmitted about where something is being opened/updated.  My suggestion is hub.viewId and that the recommended values are integers starting at 0, but to allow for other values.<br>\nA standard use might be:<br>\nimagingstudy.open<br>\nviewId: 0<br>\n...<br>\nto open in the 0/default position, and then for a comparison study:<br>\nimagingstudy.open<br>\nviewId: 1<br>\nto open in the second position.</p>\n<p>To allow communication more nuanced information something like:<br>\npatient.open<br>\nviewId: teachingFile.0<br>\nwhich would say this patient is being opened, but in this case it means as a teaching file, not as a regular view position (could be a relative, or a similar patient etc, application specific, but something they can describe in conformance statements)</p>",
        "id": 175560294,
        "sender_full_name": "Bill Wallace",
        "timestamp": 1568315026
    },
    {
        "content": "<p>Hey Bill, I'm trying to understand -- practically what would the different views be? I'm ignorantly imaging one view as the main activity (the default position) a second view perhaps as a sidebar activity, running alongside the main activity. Otherwise, I struggling to imagine other views. What would additional views be?</p>",
        "id": 175588563,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1568341507
    },
    {
        "content": "<p>Your example of a teachingView may be mixing the view or area with the authorization to request context changes.</p>",
        "id": 175588564,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1568341509
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>  Other views could be other tabs, for example, suppose one is reviewing a given patient, and a high priority case comes in.  Then, a second view might temporarily overlay the previous view  (set aside view 1).  Then, that one gets closed, and the user returns to the original case.<br>\nFor a study, imagine displaying an MG, with a relevant CT and a prior MG.  The primary view would be study viewId 0, while the CT might be view ID 2 and the MG viewId 1.    That becomes even more important as we add things like viewing multiple documents (say the report associated with study 1, and the report associated with study 2 to see what happened in the CT and prior MG).</p>",
        "id": 175638653,
        "sender_full_name": "Bill Wallace",
        "timestamp": 1568390819
    }
]