[
    {
        "content": "<p>During the connectathon, we talked through some of the differences between and a potential goal of harmonization of the <a href=\"https://www.hl7.org/concalls/CallDetails.aspx?concall=49745\">FHIRcast websockets</a> \"sub-protocol\" and that being introduced in <a href=\"https://build.fhir.org/ig/HL7/fhir-subscription-backport-ig/channels.html#websockets\">FHIR Subscriptions</a>. </p>\n<p>My take is that Subscriptions approach is more thorough, and also more complicated and more difficult to implement.</p>\n<p>cc / <span class=\"user-mention\" data-user-id=\"194452\">@Bas van den Heuvel</span>, <span class=\"user-mention\" data-user-id=\"243390\">@Catie Ladd</span> , <span class=\"user-mention\" data-user-id=\"379838\">@Eric Labadie</span> , <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span></p>",
        "id": 222753565,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1610646095
    },
    {
        "content": "<p>That sounds like a fair assessment.  We tried to keep implementation as simple as possible, but with the additional constraints:</p>\n<ul>\n<li>a single connection must support multiple subscriptions</li>\n<li>the server needs a way to periodically (as they determine) enforce authorization</li>\n<li>renewals should be allowed without reconnecting, to reduce the possibility of missed events</li>\n</ul>\n<p>Having done a naive implementation, it didn't feel <em>too</em> complex.  I can see becoming a bit more difficult when the websocket endpoint is disassociated with the token-generation endpoint, since you need to sort out a method of communication there.  But, in that architecture you need a mechanism to feed it notifications anyway and it is unidirectional - the websocket server doesn't generally* need to communicate back.</p>\n<p>*Unless the server wants to keep track of notification status and connected clients outside the websocket handler service and there isn't anything in place to do that already.</p>\n<p>With all of that said, I would be happy to discuss any revisions/ideas that could help them align better.</p>",
        "id": 222765358,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610650784
    },
    {
        "content": "<p>The main question here is whether the design rationales used by Gino also apply to FHIRcast. The main requirement is the first one: \"a single connection must support multiple subscriptions\". Is this a general requirement that needs to  be taken into account also by FHIRcast<br>\n?</p>",
        "id": 222766257,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1610651125
    }
]