[
    {
        "content": "<p>I just noticed this <a href=\"https://build.fhir.org/ig/HL7/sdc/StructureDefinition-sdc-questionnaire-optionalDisplay.html\">optionalDisplay extension</a> in SDC.  It allows a Questionnaire item to say whether the renderer can choose to omit that item.  What is the use case for that?  When would someone making a Questionnaire not care whether an item was shown or not shown?  Also, on what basis does the renderer decide whether to show optional items?</p>",
        "id": 203374918,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1594294357
    },
    {
        "content": "<p>The usecase was from CAP, where they define high-level questionnaires that local organizations are allowed to refine - including stripping out certain questions they don't feel are sufficiently useful/relevant.  The extension is intended to flag those they're allowed to yank on derivation.  If the use isn't clear from the description, feel free to submit a change request for us to boost the language</p>",
        "id": 203388062,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594303037
    },
    {
        "content": "<p>One additional use case I can relate to my works is that when I have a really long questionnaire, I would like to \"hide\" those already answered items from display but still keep those answers in QR. <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> We have talked about this before. Currently I use what you suggested by analyzing HTML tags. But I can see adding the omit=true for those already answered and trigger LHC to not displaying those.</p>",
        "id": 203389357,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1594303510
    },
    {
        "content": "<p>I don't see how this extension would help in that case, since it goes in the Questionnaire definition, which is independent of the QRs.</p>",
        "id": 203395614,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1594306426
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-27936\">J#27936</a></p>",
        "id": 203396970,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1594306932
    }
]