[
    {
        "content": "<p>Is there a way for a form renderer to know whether the list behind the Questionnaire \"options\" URL is short or long (without requesting a full expansion)?  I guess I am thinking of something like a \"count\" operation, though some lists perhaps won't have a complete count.</p>\n<p>The reason I am asking is that If the list is short, it might be convenient to fully expand the list and display the ValueSet as radio buttons, or as a drop-down list in which all items are visible.  If it is long, then it is preferable to use the filter parameter to a show only items that match what the user has typed (and not show anything until the user starts typing).</p>\n<p>If one can't get this information about a ValueSet, is there a way for the Questionnaire to indicate how the list should be shown (i.e., fully expanded or just showing what matches)?</p>",
        "id": 153991341,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1535481838
    },
    {
        "content": "<p>The <a href=\"http://build.fhir.org/valueset-questionnaire-item-control.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-questionnaire-item-control.html\">item-control</a> extension lets you indicate whether something should be checkboxes/radio-button or dropdown or auto-complete.  I think that sort of sets the expectation.  Nothing technically stops you from saying \"checkbox\" for a list of 100 items - but I've seen questionnaires that do exactly that .  So the notion of \"short\" vs. \"long\" is contextual and dependent on the designer.</p>",
        "id": 153991344,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535482380
    },
    {
        "content": "<p>True.  That should work, and is unexpectedly flexible.  Is there anything to prevent a Questionnaire from setting a question's itemControl to \"autocomplete\" when instead of options, \"option\" is used (specifying the choices directly in the Questionnaire)?</p>",
        "id": 153991348,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1535483832
    },
    {
        "content": "<p>Nope.  Technically there's nothing to stop you from using \"autocomplete\" when the item type isn't even a choice, though that would be nonsensical...</p>",
        "id": 153991350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535484002
    }
]