[
    {
        "content": "<p>When performing the structure map based $populate operation the intermediate result after the second step is a Bundle of Bundles.<br>\n(The sdc-questionnaire-sourceQueries extension contains a batch of queries. Each query returns a Bundle so the result is a Bundle of Bundles)<br>\nMy personal opinion is that when trying to create a StructureMap that is able to transform these results into a QuestionnaireResponse it seems quite difficult to create a StructureMap that operates on a Bundle of Bundles. (for example resolve references inside the Bundles)</p>\n<p>Are there any plans for the IG to make the process easier? It also seems somewhat asymetric to the $extract operation:<br>\nThe result of the StructureMap based $extract operation is a Bundle but the \"reverse\" StructureMap required to fill in the extracted data back into the questionnaireResponse needs to operate on a Bundle of Bundles.</p>",
        "id": 239226354,
        "sender_full_name": "Alexander Kreutz",
        "timestamp": 1621331430
    },
    {
        "content": "<p>I have not heard any such plans.  Do you have any ideas about what might make it easier?</p>",
        "id": 239230607,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621333799
    },
    {
        "content": "<p>It might be easier if the Bundle of Bundles can be flattened into one Bundle.</p>",
        "id": 239230938,
        "sender_full_name": "Alexander Kreutz",
        "timestamp": 1621333980
    },
    {
        "content": "<p>If they were flattened into one bundle then you wouldn't be able to split them to know which had come from which query.<br>\nYou might have some queries that had the list of active medications, another that had the conditions, and another with the list of relatedpersons.<br>\nand maybe another that had cancelled medications.<br>\nThese would then be addressible as to which query you had them from when trying to extract data from them.</p>",
        "id": 239235851,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621336763
    },
    {
        "content": "<p>When you're going the other way, it's a different problem that you're solving, and may not be the same server</p>",
        "id": 239235934,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621336807
    }
]