[
    {
        "content": "<p>For the (structure map based) $populate operation the IG says that a questionnaire-launchContext extension should be included to identify contextual information for the population process. </p>\n<p>a) May there be any kind of data in the launchContext or are there only some possible entries like patient or encounter defined somewhere? <br>\nb) The extension defines what information should be in the launchContext. If I have a backend server how is the actual launch context passed to the server? Is this only possible with authentication or is it possible to pass a launchContext to a public server?</p>",
        "id": 239224599,
        "sender_full_name": "Alexander Kreutz",
        "timestamp": 1621330581
    },
    {
        "content": "<p>The launch context information can be passed as arguments to the $populate operation</p>",
        "id": 239272912,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621351492
    },
    {
        "content": "<p>Actually, as I look for the change request that says we'll do that, I can't find it...  <span class=\"user-mention\" data-user-id=\"217312\">@Joee Garcia</span> <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> do you guys remember us agreeing to add arguments to the $populate operation to pass context variables?</p>",
        "id": 239274909,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621352201
    },
    {
        "content": "<p>The set of launch context options is going to be locked down as fixed.  Resolution for that is here: <a href=\"http://jira.hl7.org/browse/FHIR-22803\">FHIR#22803</a></p>",
        "id": 239274967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621352227
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179255-questionnaire/topic/.24populate.20-.20launch.20Context/near/239274967\">said</a>:</p>\n<blockquote>\n<p>The set of launch context options is going to be locked down as fixed.  Resolution for that is here: <a href=\"http://jira.hl7.org/browse/FHIR-22803\">FHIR#22803</a></p>\n</blockquote>\n<p>I think might have been superseded by <a href=\"http://jira.hl7.org/browse/FHIR-29664\">FHIR-29664</a>, which sets the <a href=\"http://build.fhir.org/ig/HL7/sdc/ValueSet-launchContext.html\">Questionnaire Launch Context </a> binding on \"name\" to \"extensible\".</p>",
        "id": 239292223,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621358457
    },
    {
        "content": "<p>EpisodeOfCare is not in that second tracker item - not sure what the invariant would be (best practice?) given that you have an extensible binding</p>",
        "id": 239293077,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621358775
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179255-questionnaire/topic/.24populate.20-.20launch.20Context/near/239274909\">said</a>:</p>\n<blockquote>\n<p>Actually, as I look for the change request that says we'll do that, I can't find it...  <span class=\"user-mention silent\" data-user-id=\"217312\">Joee Garcia</span> <span class=\"user-mention silent\" data-user-id=\"195344\">Paul Lynch</span> do you guys remember us agreeing to add arguments to the $populate operation to pass context variables?</p>\n</blockquote>\n<p>I am not sure, but the IG (under StructureMap population) does say, \"Include the questionnaire-launchContext extension to identify any contextual information that needs to be passed into the population process. \"  That would suggest it gets passed to $populate somehow.</p>",
        "id": 239293590,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621358987
    },
    {
        "content": "<p>could we add an additional launchContext parameter to the IN-Parameters of the <a href=\"http://build.fhir.org/ig/HL7/sdc/OperationDefinition-Questionnaire-populate.html\">$populate</a> operation? IN 0..1 launchContext : Parameters, this would then allow to specify the name and (resource or reference to resource) pairs to be provided.</p>",
        "id": 239310296,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1621365473
    },
    {
        "content": "<p>I want to propose these changes to the structure map based population:</p>\n<p>Changes to $populate definition:<br>\n1) Launch context should be an input parameter to the $populate operation<br>\nProposal: Add \"launchContext\" Parameter to $populate Operation (Type \"Parameters\", Cardinality 0..1)<br>\nFor discussion: Could the launchContext parameters just be direct additional parameters to the $populate operation?</p>\n<p>Changes to StructureMap based population:<br>\n2) Questionnaire resource should be an input to the structure map<br>\n3) Launch context should be an input to the structure map<br>\n4) \"subject\" parameter of populate operation should be an input to the structure map<br>\n5) \"content\" parameter resources of populate operation should be an input to the structure map<br>\nProposal: Change input to structure map. New input is a Bundle with the following entries:<br>\nEntry 1: The Questionnaire Resource that should be populated<br>\nEntry 2: The Parameters Resource passed to the $populate operation. (May contains launchContext, subject, content)<br>\nRemaining entries: The result of the source queries batch<br>\nFor discussion: Can the input somehow be flattened so that it is easier to handle? </p>\n<p>Remarks:<br>\n2) Including the Questionnaire Resource as input to the StructureMap allows to create StructureMaps that don't break if minor (non population related) changes are done to the source Questionnaire.</p>",
        "id": 239394702,
        "sender_full_name": "Alexander Kreutz",
        "timestamp": 1621417680
    },
    {
        "content": "<p>I thought that 1) was already approved somewhere (but not applied)<br>\n(but I definitely agree that it must be)</p>",
        "id": 239417138,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621428535
    },
    {
        "content": "<p>5) I would actually encourage that to be a new specific parameter for a specific StructureMap (reference or resource) rather than re-using the content, as that was intended to be input data, not mapping structure data.</p>",
        "id": 239417667,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621428746
    },
    {
        "content": "<p>2) Just curious why you'd want the Questionnaire definition to be passed through?<br>\nWhat would you be reading from it?</p>",
        "id": 239417764,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621428796
    },
    {
        "content": "<p>i think 2) is not necessary, <span class=\"user-mention\" data-user-id=\"410858\">@Alexander Kreutz</span> ? the knoledge how to create the qr response and link to the QR can be within the StructureMap</p>",
        "id": 239418306,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1621429050
    },
    {
        "content": "<p>That's what I was thinking, my expectation is that the structure map already has so much intimate knowledge of the Questionnaire that it's not going to rely on it for anything, and probably has way more detail than within it.</p>",
        "id": 239418576,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621429170
    },
    {
        "content": "<p>Well. With 2) you could copy the item.text from the Questionnaire to the QuestionnaireResponse but I am not sure someone will actually do it.</p>",
        "id": 239429075,
        "sender_full_name": "Alexander Kreutz",
        "timestamp": 1621432891
    },
    {
        "content": "<p>Launch context can be an input to the queries performed and whose results are included in the Bundle.  The only input possible to the StructureMap is a single resource instance.  StructureMap can't handle multiple inputs.  It transforms one model into another.  The source model is a Bundle of search response Bundles.  Why isn't it sufficient to have one of the searches expose the Patient or the user?</p>",
        "id": 239454712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621441412
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179255-questionnaire/topic/.24populate.20-.20launch.20Context/near/239454712\">said</a>:</p>\n<blockquote>\n<p>The source model is a Bundle of search response Bundles.  Why isn't it sufficient to have one of the searches expose the Patient or the user?</p>\n</blockquote>\n<p>agree that we need to have one source model for the StructureMap. we cannot get the input from the launchContext via source queries added (no Patient or user connection to the bundle), and would like to add the launchContext  to the source model. you mentioned that 'The launch context information can be passed as arguments to the $populate operation', is there a way we can add the launch context information to the source model?</p>",
        "id": 239477206,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1621450159
    },
    {
        "content": "<p>I suppose we could have other entries in the Bundle - the challenge would be identifying who/what they represented.  Maybe a Parameters resource in the Bundle?  Then you'd have the name of the parameter as well as the value.  Though all of that adds complexity.  We really don't think being able to query is sufficient?</p>",
        "id": 239484461,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621453315
    },
    {
        "content": "<p>I like the idea of the Parameter Resoruce in the Bundle (would correspond to the launchContext) but agree also that it adds complexity. For our usecase query is not sufficient, and as I understood the prepop with questionnnaireresponse discussed at the connectathon track today had a similar challenge that query is not sufficent.</p>",
        "id": 239485891,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1621453957
    },
    {
        "content": "<p>Can you explain why query is not sufficient?  Is the issue that the information passed in context isn't available for query?</p>",
        "id": 239498486,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621459626
    },
    {
        "content": "<p>yes, we would like to have the $populate operation implemented in the Form Manager <a href=\"http://build.fhir.org/ig/HL7/sdc/workflow.html\">step 4.2.2 in SDC Workflow: QR is prepopulated with EHR provided patient datat</a> which does not have query access to the Form Filler in our setup.</p>",
        "id": 239541084,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1621492153
    },
    {
        "content": "<p>It also seems wasteful to have to query for something that the form filler issuing $populate already has from the launchContext.</p>",
        "id": 239585670,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621515290
    },
    {
        "content": "<p>And the data going in to all populate techniques really should be the same (except for a parameter to force a specific structure map)</p>",
        "id": 239669325,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621550089
    },
    {
        "content": "<p>From today's resolution of <a href=\"http://jira.hl7.org/browse/FHIR-32644\">FHIR-32644</a>: \"Will update the $populate operation to allow launch contexts to be passed in.\"</p>",
        "id": 239669509,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621550175
    }
]