[
    {
        "content": "<p>here in Argonaut Questionnaire Land we have been working on an outline and sharing with the ONC PRO project.  Here is a draft proposal for the adapative q using a stateless model.</p>",
        "id": 153982188,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533486040
    },
    {
        "content": "<p><a href=\"https://docs.google.com/presentation/d/1avLKB_OVtwh_jg88si4JuTEEBpsbimGV4LY5rxMrh6I/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/presentation/d/1avLKB_OVtwh_jg88si4JuTEEBpsbimGV4LY5rxMrh6I/edit?usp=sharing\">https://docs.google.com/presentation/d/1avLKB_OVtwh_jg88si4JuTEEBpsbimGV4LY5rxMrh6I/edit?usp=sharing</a></p>",
        "id": 153982189,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533486245
    },
    {
        "content": "<p>I'm thinking passing the QR back and forth makes more sense than repeating the data in Parameter?   ...  thoughts</p>",
        "id": 153982190,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533486345
    },
    {
        "content": "<p>We need to agree on how the 'custom' QuestionnaireResponse points to the canonical URL of the official Questionnaire.  If we can do that, I think we can ditch Parameters entirely and just pass a QuestionnaireResponse that points to a contained Questionnaire which references the canonical URL.  First time around, the Questionnaire would be empty and the response would have no answers.  Thereafter, you'd alternate with one more question, then one more answer until such time as the QuestionnaireResponse comes back marked as 'complete' and the contained Questionnaire having no more questions.</p>",
        "id": 153982240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533513379
    },
    {
        "content": "<p>I was thinking an extension \"questionnaire\"  on item.</p>",
        "id": 153982248,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533514897
    },
    {
        "content": "<p>you need the scoring option parameter too and that is not part of QR.</p>",
        "id": 153982249,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533514962
    },
    {
        "content": "<p>I think the end would be when there are no Q returned just a score</p>",
        "id": 153982250,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533514997
    },
    {
        "content": "<p>The contained Questionnaire is built by the client.</p>",
        "id": 153982251,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515041
    },
    {
        "content": "<p>The server is just pumping out questionnaires and scores.</p>",
        "id": 153982253,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515064
    },
    {
        "content": "<p>The contained Questionnaire should be built by the server - it's passing back the next question</p>",
        "id": 153982254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515070
    },
    {
        "content": "<p>It's not multiple questionnaires</p>",
        "id": 153982255,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515076
    },
    {
        "content": "<p>It's one questionnaire that gets built up over the course of the questions</p>",
        "id": 153982256,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515092
    },
    {
        "content": "<p>One QuestionnaireResponse can <em>only</em> be for a single Questionnaire.</p>",
        "id": 153982257,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515105
    },
    {
        "content": "<p>The scores would be included as items in the QuestionnaireResponse</p>",
        "id": 153982258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515129
    },
    {
        "content": "<p>(if they're exposed - otherwise they'll just be extensions)</p>",
        "id": 153982259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515162
    },
    {
        "content": "<p>reporting scores is not part of Questionnaire its a separate observation right?</p>",
        "id": 153982260,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515226
    },
    {
        "content": "<p>Scores can be reported inside a QuestionnaireResponse</p>",
        "id": 153982261,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515431
    },
    {
        "content": "<p>The server needs to know which answer corresponds to which question - right.   To me is easier for me to think of them as separate Questionnaires, which they could even store them as.   I want to limit the scope of the service to a Black Box.</p>",
        "id": 153982262,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515433
    },
    {
        "content": "<p>not the decimal score, but the calculated scores from the answers.</p>",
        "id": 153982263,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515460
    },
    {
        "content": "<p>not sure what you mean</p>",
        "id": 153982264,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515477
    },
    {
        "content": "<p>The QuestionnaireResponse can only point to one Questionnaire.  All of the questions have to be from a single Questionnaire.</p>",
        "id": 153982265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515498
    },
    {
        "content": "<p>That Questionnaire is generated by the black box</p>",
        "id": 153982266,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515513
    },
    {
        "content": "<p>yes I know.  that is why you make up a contained Q.  but the service needs an identifier to know from where it came, and you can't assume it coming from a single FHIR questtionnaire.</p>",
        "id": 153982267,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515580
    },
    {
        "content": "<p>Each question has a definition - that tells you where it came from.</p>",
        "id": 153982268,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515611
    },
    {
        "content": "<p>that Is why I proposed an extension on the QR.item  that would link to the services Question identifier</p>",
        "id": 153982269,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515625
    },
    {
        "content": "<p>?</p>",
        "id": 153982270,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515639
    },
    {
        "content": "<p>where did definition come from</p>",
        "id": 153982271,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515650
    },
    {
        "content": "<p>QuestionnaireResponse.item has a linkId that links to the Questionnaire.item.  The Questionnaire.item has a definition that can point to the source</p>",
        "id": 153982272,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515670
    },
    {
        "content": "<p>The Questionnaire.item.definition points to a shared question definition that defines the meaning, type, allowed values, etc. for the question/group/etc.</p>",
        "id": 153982273,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515719
    },
    {
        "content": "<p>the service calculates the score and the logic based on the priors Q-A pairs.  The client needs to provide the Answers and an identifier back to the question.  That is the way it works now.</p>",
        "id": 153982274,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515769
    },
    {
        "content": "<p>All the service wants is an identifier.</p>",
        "id": 153982275,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515801
    },
    {
        "content": "<p>Answers by themselves are useless - you have to have the Questionnaire for the linkIds to mean anything.</p>",
        "id": 153982276,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515940
    },
    {
        "content": "<p>Regarding the scoring issue - that is something the service calculates.   either for the whole adaptive Q,  or for each Question, or an intermediate cumulative score.  These are not part of QR right?  They are represented as Observations.</p>",
        "id": 153982277,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515958
    },
    {
        "content": "<p>The scores should be in the QuestionnaireResponse</p>",
        "id": 153982278,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533515975
    },
    {
        "content": "<p>Lloyd McKenzie: Answers by themselves are useless - you have to have the Questionnaire for the linkIds to mean anything.</p>\n<p>Eric Haas: Regarding the scoring issue - that is something the service calculates. either for the whole adaptive Q, or for each Question, or an intermediate cumulative score. These are not part of QR right? They are represented as Observations.</p>",
        "id": 153982279,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533515996
    },
    {
        "content": "<p>If you were doing a standard (non-dynamic) form they would be, so not sure why a dynamic form would be any different.</p>",
        "id": 153982280,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533516002
    },
    {
        "content": "<p>(they would be in the QuestionnaireResponse, not Observations) - though you could of course extract the scores and other information from the QuestionnaireResponse into Observations after the fact if you wished.</p>",
        "id": 153982281,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533516057
    },
    {
        "content": "<p>You ought to be able to do the whole thing just passing a single resource (QuestionnaireResponse with contained Questionnaire) back and forth.</p>",
        "id": 153982282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533516117
    },
    {
        "content": "<p>5:39 PM<br>\nThe scores should be in the QuestionnaireResponse - That is news to me ...there is no place for calculated scores in QR is there?</p>",
        "id": 153982283,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533516123
    },
    {
        "content": "<p>SDC is defining extensions to define the calculations and can put the answers into the QuestionnaireResponse.item values</p>",
        "id": 153982284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533516176
    },
    {
        "content": "<blockquote>\n<p>SDC is defining extensions to define the calculations and can put the answers into the QuestionnaireResponse:</p>\n</blockquote>\n<p>Argonaut is not defining logic or calculations and for now will use Observations to record the scores.  But I think that is not a big deal for now.</p>",
        "id": 153982285,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533516200
    },
    {
        "content": "<p>If we didn't want to expose the values as items in the questionnaire, we could put extensions on the QuestionnaireResponse items for this purpose if there was a need to share the calculated values (e.g. if the calculation wasn't public)</p>",
        "id": 153982286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533516256
    },
    {
        "content": "<p>and I think is good discussion whether the service updates QR or the Client.   Will bring up on next Argocall, but I think  we still will need an extension on Q.item for the  service to Identify each question separately.   The contained questionnaire is made on the fly from a bank of Questions on their side so pointing the URL is useless.</p>",
        "id": 153982287,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533516617
    },
    {
        "content": "<p>What you actually have is a single base Questionnaire which corresponds to the black box.  It defines the \"instrument\".  The fact that multiple responses for different patients over time are all tied to that one \"instrument\" is what makes the results comparable - even though they'll have answered different subsets of questions - an perhaps totally custom questions.  You also have a Questionnaire that is created on the fly.  The 'definition' for each item has meaning within the black box.</p>",
        "id": 153982289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533516804
    },
    {
        "content": "<p>We need the URL from the black box.  Not sure if that can/should be the URL of the contained Questionnaire or not...</p>",
        "id": 153982290,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533516863
    },
    {
        "content": "<p>I read the Q.item.definition and the type is Reference(ElementDefinition).  How exactly does that tie in to a question?  Please give a concrete example because I am lost.  My black box is looking for a GUUID for Question 'foo' associate with answer \"bar\"  how does  <em>this</em> FHIR reference help?</p>",
        "id": 153982293,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533517354
    },
    {
        "content": "<p>.and my black box has lots of Adaptive Qs to choose from. So the black box is not the 'instrument\"  right?  there are several each corresponding to each set of questions?</p>",
        "id": 153982295,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533517466
    },
    {
        "content": "<p>When I refer to the black box, I'm referring to a particular adaptive questionnaire.  If you have one service that manages multiple questionnaires that's fine, but you're going to need to have a distinct URL for each adaptive questionnaire.</p>",
        "id": 153982297,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533517655
    },
    {
        "content": "<p>In FHIR, QuestionnaireResponse points to the particular question within a Questionnaire using linkId.  The Questionnaire then defines the common meaning of the question with a reference to an element definition.  That's done by uri.  (If you're working with STU 3, then you may need to do some creative implementation to align with R4)</p>",
        "id": 153982298,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533517778
    },
    {
        "content": "<p>Yes by black box I am referring to everything behind the operation endpoint.  Still unclear on the use of Q.item.definition.  If have a adaptiveQ with url = 'foo' it has three questions:   identified by q1 = \"foo1\",q2 = \"foo2\" and q3 =\"foo3'.  So we know that linkId links to the contained Q,  what would go into Q.item.definition for q1?  assuming  the adaptiveQ is not represented as a FHIR Questionnaire.</p>",
        "id": 153982304,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533519047
    },
    {
        "content": "<p>Some URI that corresponds to that particular question notion within the adaptive questionnaire black box</p>",
        "id": 153982310,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533519940
    },
    {
        "content": "<p>(such that answers that have the same definition are comparable)</p>",
        "id": 153982311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533519967
    },
    {
        "content": "<p>OK I am beginning to see it.  That is one deep and nonintuitive element and I don't know how to make it easier to understand.   I also think we will be stretching the definition a bit in this use case</p>",
        "id": 153982323,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533521134
    },
    {
        "content": "<p>also the guidance in R3 ( Q trumps ED)  is the opposite in R4 (ED trumps Q) is that intentional?</p>",
        "id": 153982340,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533521911
    },
    {
        "content": "<p>Thanks for the feedback was very helpful - will see what the group feedback is.... I'll mock up an example</p>",
        "id": 153982341,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533521966
    },
    {
        "content": "<p>I don't think the intention is that ED trumps Q in R4.  Where did you see language that suggested that?</p>",
        "id": 153982351,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533523179
    },
    {
        "content": "<p>here is an updated outline based on above with QR directly written to by the server:</p>",
        "id": 153982360,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533525321
    },
    {
        "content": "<p><a href=\"https://docs.google.com/presentation/d/12aStsVDmz_qTeIjUFYWYv8643FyULov0BcjpKpuPLvo/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/presentation/d/12aStsVDmz_qTeIjUFYWYv8643FyULov0BcjpKpuPLvo/edit?usp=sharing\">https://docs.google.com/presentation/d/12aStsVDmz_qTeIjUFYWYv8643FyULov0BcjpKpuPLvo/edit?usp=sharing</a></p>",
        "id": 153982361,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533525322
    },
    {
        "content": "<p>from the definition of item.definition in R4:\"This element is a URI that refers to an ElementDefinition that provides information about this item, including information that might otherwise be included in the instance of the Questionnaire resource. A detailed description of the construction of the URI is shown in Comments, below. <strong>If this element is present then the following element values SHALL be inferred from the Element Definition rather than from the corresponding elements of this Questionnaire resource instance:</strong>\"</p>",
        "id": 153982362,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533525416
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> When did we agree to that?  I don't think it's wise to say that you should ignore the information in the Questionnaire.  I'm fine with a SHALL saying they must be aligned, but having the Questionnaire express question text in French when the definition element says the same thing in English is totally reasonable...</p>",
        "id": 153982364,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533526740
    },
    {
        "content": "<p>On slide 6, rather than a boolean, just set the status of the QuestionnaireResponse to completed.</p>",
        "id": 153982396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533528573
    },
    {
        "content": "<p>Also, you might think about the situation where the questionnaire gets submitted but the answers are invalid.  In that case, I presume you'd send back an OperationOutcome?</p>",
        "id": 153982397,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533528617
    },
    {
        "content": "<p>On the initial request, I think you'd submit a blank QuestionnaireResponse with an empty Questionnaire with just the canonical URL - that way you're always passing the same argument to the black box.</p>",
        "id": 153982398,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533528667
    },
    {
        "content": "<p>OK that makes sense</p>",
        "id": 153982416,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533531507
    },
    {
        "content": "<p>I definitely edited based on a task where we said that you would default those elements from the definition, but that they would not override. I must have missed that text</p>",
        "id": 153982448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533538124
    },
    {
        "content": "<p>So we can/should just change it back?</p>",
        "id": 153982549,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533565893
    },
    {
        "content": "<p>yes I'll fix it</p>",
        "id": 153982771,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533587385
    }
]