[
    {
        "content": "<p>Hi. Sorry, asked this in #implementers before I realised there was a dedicated stream for #questionnaire. Can't see how to delete...? Anyway, this seems like the better place to ask my question:</p>\n<p>We provide digital forms for patients to fill in at home, then we add the responses into a FHIR API as QuestionnaireResponses for our healthcare provider clients to ingest. We want to enrich the data with information about the usage of our forms. For example: when was the form sent to the patient, when was the due date for responding, when did the patient respond, did they complete their response or give up, etc.</p>\n<p>I am trying to decide whether it is reasonable to treat the process of sending a digital form to a patient and getting their response as a special kind of \"Encounter\" (and so capturing these data points in that resource, with the QuestionnaireResponse linked), or whether it is more sensible to just add Extensions to QuestionnaireResponse to capture these extra data points.</p>\n<p>I'd really appreciate any other views on this, thanks.</p>",
        "id": 176742847,
        "sender_full_name": "Matthew Steer",
        "timestamp": 1569589064
    },
    {
        "content": "<p>For this kind of workflow take a look at Task. There are probably others, I'll will think about them.<br>\nIf you have the set of properties available would be helpful to choose.</p>",
        "id": 176745116,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1569590711
    },
    {
        "content": "<p>Thanks Brian, Task does look perfect. I simply wasn't aware of it - new to FHIR and there's nothing in QuestionnaireResponse that suggests it. I guess that might be the only drawback - there's no obvious way to navigate from the QResponse to the Task (i.e. I can't see anywhere to reference a Task from a QResponse resource). Would the normal approach be to say that the Task is \"contained\" in the QResponse?</p>",
        "id": 176746109,
        "sender_full_name": "Matthew Steer",
        "timestamp": 1569591492
    },
    {
        "content": "<p>Generally, the Task would point to the QuestionnaireResponse as an 'output'.  The Task would indicate if the patient agreed to do it (if they even have the option) and could capture that they refused (and why) when a QuestionnaireResponse wouldn't even exist</p>",
        "id": 176763592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569603256
    },
    {
        "content": "<p>I.e. the Task exists before the QuestionnaireResponse and might be the only thing that exists.</p>",
        "id": 176763622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569603289
    },
    {
        "content": "<p>'contained' is never to be used as a convenient packaging mechanism, but only when a referenced resource can't stand alone.  If you want to convey both the Task and QR, you can use a Batch or Transaction Bundle.</p>",
        "id": 176763670,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569603330
    },
    {
        "content": "<p>Got it. Thanks for the help <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>!</p>",
        "id": 176764125,
        "sender_full_name": "Matthew Steer",
        "timestamp": 1569603645
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> was servicerequest the other resource that could be used for the planning stage?</p>",
        "id": 176789174,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1569621139
    },
    {
        "content": "<p>ServiceRequest can be used to define an authorization or indicate that the questionnaire should be filled out on a repeated basis.  CarePlan is another option</p>",
        "id": 176801576,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569635325
    },
    {
        "content": "<p>ServiceRequest feels like a better fit, if only because QResponse natively supports referring to a ServiceRequest that triggered it. That feels a little more coherent than having to bundle a QResponse and a Task in order to keep the two linked.</p>",
        "id": 176916440,
        "sender_full_name": "Matthew Steer",
        "timestamp": 1569836057
    },
    {
        "content": "<p>ServiceRequest lets you identify what 'authorized/ordered' the completion.  CarePlan is in that list too.  Task is what lets you actually trigger the fulfillment and track the 'to do' item.</p>",
        "id": 176942610,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569857030
    }
]