[
    {
        "content": "<p>I am building a web site that will feature some FHIR Questionnaires with the data collected as FHIR Questionnaire Responses. This is a prototype using HTML and Python.</p>\n<p>According to the documentation at <a href=\"https://www.hl7.org/fhir/questionnaire.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/questionnaire.html\">https://www.hl7.org/fhir/questionnaire.html</a>, it appears that it might be difficult to retrieve the data out of the Questionnaire Resource as noted in the statement  \"However, data captured only in Questionnaires can be difficult to query after-the-fact. Queries against other Resources will not return data captured only in Questionnaires and querying against Questionnaires directly might not find all desired data\".</p>\n<p>Is this because the Questionnaire and Questionnaire Response do not have all of the search parameters enabled?  If using HAPI, is it possible to enable more search parameters above what the HAPI server provides by default?</p>\n<p>Another approach that I was considering is storing the data in a MongoDB  and then accessing it via the RESTFUL API. Will that turn out to be more work in the end as I will need to manually expose all of the Resources myself? </p>\n<p>Does HAPI come with enough \"built-in\" functionality in support of the Questionnaire and Questionnaire Response  to make the HAPI server  the easiest implementation?</p>",
        "id": 174420566,
        "sender_full_name": "Diane",
        "timestamp": 1567049422
    },
    {
        "content": "<p>The difficulty is that the meaning of data inside questionnaire responses is never consistent.  How do you query a particular question inside a particular group with a particular other question answer?  QuestionnaireResponses are mechanisms for raw data capture, but if you want standardized data query/comparison/analysis, you need to extract the information from the QuestionnaireResponses into the appropriate other resources (Observations, MedicationStatements, etc.)  You can take a look at the SDC implementation guide for information on how to do that.</p>",
        "id": 174421026,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567050218
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/HL7/sdc/\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/sdc/\">http://build.fhir.org/ig/HL7/sdc/</a></p>",
        "id": 174421081,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567050273
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"237340\">@Diane</span> On the other hand, if you don't care about combining/comparing data from two Questionnaires that are asking the same question (i.e. if the responses from each Questionnaire are going to be analyzed independently), then just storing the data as a QuestionnaireResponse is probably sufficient.</p>\n<p>If you do need to extract data into Observations, <a href=\"http://lhncbc.github.io/lforms/\" target=\"_blank\" title=\"http://lhncbc.github.io/lforms/\">LHC-Forms</a> has support for that via the <a href=\"http://build.fhir.org/ig/HL7/sdc/extension-sdc-questionnaire-observationLinkPeriod.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/sdc/extension-sdc-questionnaire-observationLinkPeriod.html\">observationLinkPeriod extension</a>.  I appears that I haven't updated the documentation on that; let me know if that is what you want to use &amp; do.</p>\n<p>The question of where to store it has more to do with what you do with the data once you have it.  If FHIR's RESTFUL API is sufficient, then I would recommend setting up a HAPI FHIR server.  (You could experiment with fake data at <a href=\"http://hapi.fhir.org/\" target=\"_blank\" title=\"http://hapi.fhir.org/\">http://hapi.fhir.org/</a>, and see if it meets your needs before investing the time of setting up your own.)</p>",
        "id": 174460651,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1567090021
    },
    {
        "content": "<p>Storing it is easy.  Searching against it, not so much.</p>",
        "id": 174468286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567095054
    },
    {
        "content": "<p>(Unless you're only storing one type of questionnaire)</p>",
        "id": 174468305,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567095074
    }
]