[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>  asked me to bring up this topic for discussion. </p>\n<p>For one section of our questionnaire, our intended design is to have the final question   auto-populated for the users (based on the answers to the previous questions and based on answers in items in the parent questionnaire) using an answerExpression.   However, there may be situations where the user didn't complete enough questions for the auto-populate to happen accurately. In that case, the users need to be able to answer manually, because the final question is mandatory (required).</p>\n<p>In addition, we want to make sure that the users don't randomly enter things other than from a default drop-down list. So, I had added a answerOption.valueCoding  to the item  to allow for the manual selection in cases where auto-population doesn't occur.</p>\n<p>Due to the constraint: \"An item cannot have an answerExpression if answerOption or answerValueSet is already present\",  the answerExpression and the answerOption are mutually exclusive so I can't have both the autopopulate and the ability to select from the drop-down on the same question.</p>\n<p>Paul has provided a suggested workaround where I can use an included valueSet in the answerExpression to be shown if the auto-populate doesn't occur.</p>\n<p>What is the intent of the constraint: \"An item cannot have an answerExpression if answerOption or answerValueSet is already present\"? Paul was also wondering why this constraint was created.</p>",
        "id": 261883464,
        "sender_full_name": "Diane",
        "timestamp": 1637207929
    },
    {
        "content": "<p>Population is handled by <code>initialExpression</code>, not <code>answerExpression</code>.  <code>answerExpression</code> just allows the dropdown to be dynamic instead of fixed.</p>",
        "id": 261932001,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637244820
    },
    {
        "content": "<p>So, I would place 2 extensions against the item?    The answerExpression  will  create the dynamic drop-down   and the initialExpression will populate the value from the parent questionnaire?</p>",
        "id": 261992051,
        "sender_full_name": "Diane",
        "timestamp": 1637270257
    },
    {
        "content": "<p>Answer3xpression yes, for dropdown values. If intended to change answer dynically from other questions, that's calculatedExpression.</p>",
        "id": 261994947,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637271648
    },
    {
        "content": "<p>InitialvalueExtension is just for setting the initial value prior to data entry, no expectation of change.</p>",
        "id": 261995016,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637271688
    }
]