[
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-25960\">J#25960</a> says that answerExpression \"would evaluate to a collection of Coding, integer, string, or other valid answer types.\"  Can that include ValueSet.expansion.contains (which is almost the same as a Coding, but not quite)?  I know we have answerValueSet, but if one has an expansion sitting in Questionnaire.contained, one could also use answerExpression to pull it in, and possibly filter it with FHIRPath \"where\" statements.</p>",
        "id": 210527556,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600439861
    },
    {
        "content": "<p>That certainly wouldn't be allowed right now.  You could submit a change request for us to consider allowing that</p>",
        "id": 210527778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600439964
    },
    {
        "content": "<p>Will do.  Are there any concerns about that?  I am writing code for answerExpression handling Coding, and as a test I am using a FHIRPath expression which actually give it the \"contains\" elements from a contained ValueSet expansion.  The field names match (system, code, display) so my processing code doesn't know those aren't really Codings.  I think it might be useful to make that support explicit rather than accidental, unless it causes a problem.</p>",
        "id": 210528557,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600440246
    },
    {
        "content": "<p>It doesn't fill me with joy, but I'm not violently opposed.  Would like to have a group discussion</p>",
        "id": 210528797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440350
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-28579\">J#28579</a></p>",
        "id": 210531307,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600441239
    },
    {
        "content": "<p>I'm curious what the c# engine would do with that.</p>",
        "id": 210595649,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600487425
    },
    {
        "content": "<p>I think I'll add support for resolve and a custom expression to return that...</p>",
        "id": 210595653,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600487449
    }
]