[
    {
        "content": "<p>Is there a way for answerExpression to be used to support a list that has scores associated with the items?</p>",
        "id": 210462528,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600384216
    },
    {
        "content": "<p>If the expression was CQL, couldn't that expression return a list of tuples?</p>",
        "id": 210501358,
        "sender_full_name": "David Winters",
        "timestamp": 1600425217
    },
    {
        "content": "<p>The ordinal extension is allowed in Coding I believe</p>",
        "id": 210514635,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600434229
    },
    {
        "content": "<p>Yes-- that's perfect.  Somehow I missed that.</p>",
        "id": 210526993,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600439593
    },
    {
        "content": "<p>Unless the QuestionnaireResponse contains the optional ordinalValue extension for the answer, there is no way for FHIRPath (or anything else) to get the value of a score for an answer that came from answerExpression.  So, if someone writes a Questionnaire that uses an answerExpression that resolves to scored Codings, it won't work unless the renderer generates a QuestionnaireResponse containing the ordinalValue.</p>",
        "id": 211198396,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600987378
    },
    {
        "content": "<p>I thought we'd agreed to define a function that would allow FHIRPath to go find the ordinal?</p>",
        "id": 211201004,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600989039
    },
    {
        "content": "<p>That's <a href=\"http://jira.hl7.org/browse/FHIR-22637\">J#22637</a>, which needs some implementation experience before being published.  The discussion for ordinalValue() assumed the scores would be sitting in the Questionnaire, which in this case they are not.</p>",
        "id": 211201143,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600989163
    },
    {
        "content": "<p>I didn't presume that they'd be in the Questionnaire - I figured they may need to be retrieved from the terminology server</p>",
        "id": 211201258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600989257
    },
    {
        "content": "<p>Okay, that sounds possible.  I still have not attempted adding in asynchronous AJAX calls into my variable/calculatedValue processing logic.</p>",
        "id": 211201760,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600989618
    }
]