[
    {
        "content": "<p>This question comes from the discussion about using .code instead of .display in fhirpath expressions at <br>\n<a href=\"#narrow/stream/179255-questionnaire/topic/answerOption.20as.20an.20expression.20result\">https://chat.fhir.org/#narrow/stream/179255-questionnaire/topic/answerOption.20as.20an.20expression.20result</a></p>\n<p>Can implementers use different display values (different from the code system included in the questionnaire)?</p>\n<p>Specifically, when a defined codeSystem is listed in answerOption.valueCoding.system, then values are used in the questionnaire as answerOptions, the code and the display elements must be used exactly as published.</p>\n<p>For example, if a questionnaire uses code system <a href=\"https://terminology.hl7.org/CodeSystem-v2-0238.html\">https://terminology.hl7.org/CodeSystem-v2-0238.html</a>  eventSeriousness, which has values of: </p>\n<div class=\"codehilite\"><pre><span></span><code>Code    Display\nY      Yes\nS      Significant\nN      No\n</code></pre></div>\n<p>can the implementer change the display text to something else like the below?</p>\n<div class=\"codehilite\"><pre><span></span><code>Code    Display\nY      Yes, definitely\nS      Significantly serious\nN      Not really\n</code></pre></div>\n<p>I went ahead and changed all of my expressions to use .code just to be on the safe side.</p>",
        "id": 274616797,
        "sender_full_name": "Diane",
        "timestamp": 1646778336
    },
    {
        "content": "<p>It depends.  Implementers can always derive a Questionnaire from another Questionnaire and 'tweak' things.  A simple example would be providing translations.  Another might be 'simplifying' the language.  Whether this is kosher or not depends on the rules set in the base Questionnaire.  It's also possible that, if you reference a value set defined as a separate resource, the value set might be updated or a given terminology server might expand it and use a different designation than a different terminology server.   If you want tight control, include the displays directly as options in the form or contained value sets and express licensing terms that prohibit translation/language alteration.</p>",
        "id": 274641348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646798452
    }
]