[
    {
        "content": "<p>Hi <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span>  I am trying to understand how to best handle the following scenario:</p>\n<ol>\n<li>You have a multiple choice question where the possible answers are defined by a ValueSet containing codes (e.g. from a standard system)</li>\n<li>For one reason or another, the <code>display</code> values for these codes are not appropriate/confusing to display to the user as answer texts/labels in the UI, so other texts need to be displayed</li>\n</ol>\n<p>For such cases, is there a standard way to capture the answer labels/texts that should be displayed? That is, some way of associating each code in the answer value set with a string (similar to how the <code>code</code> and <code>text</code> fields in a single <code>item</code> are linked together). One could of course have such a map outside FHIR (e.g. just in the UI), but it may e.g. be important for consumers of the data to know what exactly the user saw when choosing a given option.</p>",
        "id": 197403345,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1589372086
    },
    {
        "content": "<p>for our multiple language valuesets in questionnaires we use the designation/language directly in the valueset (e.g. <a href=\"https://github.com/hl7ch/covid-19-prom/blob/master/input/resources/questionnaire/coronascience-question-of-the-day-QD1.xml\">https://github.com/hl7ch/covid-19-prom/blob/master/input/resources/questionnaire/coronascience-question-of-the-day-QD1.xml</a>), maybe a similiar approach can be used in your use case?</p>",
        "id": 197404548,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1589372789
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span>, thanks for the tip! We actually already use designations for handling multiple languages. The problem is rather cases where the standard code display (even in the right language) simply does not fit, e.g. due to the way the question is formulated or because the display text is so technical that the (lay) user will not understand what it means. For instance (not a great example, but all I could think of right now): suppose we want to use LOINC LA6255-9 (\"Lives alone\") to encode housing situation. A natural way to pose the question might be \"What is your current housing situation?\" but \"Lives alone\" does not fit (grammatically) as an answer (whereas \"I live alone\" does).</p>",
        "id": 197407831,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1589374607
    },
    {
        "content": "<p>maybe add  a designation with a different use attribute?</p>",
        "id": 197413095,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1589376899
    },
    {
        "content": "<p>Ah right, interesting point! - I had forgotten that designations are more general. However, conceptually I would prefer the text &lt;---&gt; code association to be attached to the <code>Questionnaire</code> because the latter defines the context in which the association is used/is of interest. If a given answer code is used in multiple questions and/or questionnaires with different formulations, one would otherwise have to pile designations for different contexts into the CodeSystem.</p>",
        "id": 197437315,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1589386726
    },
    {
        "content": "<p>When you define a value set, you have the option of overriding the 'display' values (and designations) with valueset-specific values</p>",
        "id": 197442759,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589389018
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  ah, I was not aware of that - does that work for any code system? I was under the impression that the <code>display</code> values for standard systems like LOINC were considered part of the code system and should therefore be maintained. </p>\n<p>I suppose that would mean that if one wanted to know exactly which formulation was used for which question, one would have to generate a ValueSet for each unique set of display values?</p>",
        "id": 197458118,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1589395460
    },
    {
        "content": "<p>That's true of the value set machinery regardless of code system.  The challenge is that value sets are context-specific and the code system names are context independent.  Context independent names can have a negative impact on usability when you're in a context-specific circumstance.</p>",
        "id": 197461604,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589397008
    },
    {
        "content": "<p>The questionnaire question should ideally be tied to a single value set.  However, if there are language-specific designations, then it might not always be possible to know exactly what the user saw.</p>",
        "id": 197461745,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589397085
    },
    {
        "content": "<p>I see, right, it might not be possible to remove the last bit of ambiguity. Just to make sure I get this right: Is one is free to put essentially whatever one wants in <code>display</code> _in a ValueSet_ (or just the expansion?), even if the code is from e.g. LOINC or SNOMED?</p>",
        "id": 197508428,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1589435728
    },
    {
        "content": "<p>Yes, though you'll get a validation warning if it differs from a known representation in the code system or any code system supplements referenced by the value set.</p>",
        "id": 197553465,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589462924
    },
    {
        "content": "<p>OK, thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> &amp; <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> - learning something new every day here <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 197555293,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1589463702
    },
    {
        "content": "<p>Zulip is good for that :)</p>",
        "id": 197563400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589466722
    },
    {
        "content": "<p>Are Designations and the Translation Extension the preferred method to handle multi-lingual questionnaires (for  question text and answer text), as per Oliver's example above? If so, would be useful to have as a proper example (a well as a guidance section) in both Questionnaire as well as the SDC. Multilingual representation seems like it might be a common use case.</p>",
        "id": 206508772,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1597090989
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192143\">@Ken Sinn</span>  I would second that, we also work a lot with multi-language questionnaires. For a recent <a href=\"https://simplifier.net/guide/covid-19pre-testpatientassessment/home\">COVID-19 IG containing a screening questionnaire</a>, we took the approach of manually generating separate, language-specific versions (as indicated by the <code>language</code> element)  for the questionnaire &amp; the  expanded value sets with answer options (the latter generated from code systems with the added translations in designations). However, there may be preferable alternatives - as discussed in <a href=\"#narrow/stream/179202-terminology/topic/Designations.20vs.2E.20language-specific.20resources.20for.20VS.20and.20CS\">this terminology thread</a>,  such \"language-doubled\" resource copies is currently not really supported in IGs (e.g. I suppose IG tooling would not be able to handle it) and it was remarked that distributing expanded value sets could be brittle.</p>",
        "id": 206563498,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1597144845
    },
    {
        "content": "<p>the main terminology servers should get the language right in expansions</p>",
        "id": 206568265,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597148961
    },
    {
        "content": "<p>agree it would be good to add an example</p>",
        "id": 206568281,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597148973
    },
    {
        "content": "<p>want to contribute one?</p>",
        "id": 206568291,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597148981
    },
    {
        "content": "<p>If <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> agrees to the inclusion of his example from <a href=\"https://github.com/hl7ch/covid-19-prom/blob/master/input/resources/questionnaire/coronascience-question-of-the-day-QD1.xml\">https://github.com/hl7ch/covid-19-prom/blob/master/input/resources/questionnaire/coronascience-question-of-the-day-QD1.xml</a>, and if it accurately represents best practices around designations and the translation extension, then I think that would be a good example.</p>",
        "id": 206611579,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1597170122
    },
    {
        "content": "<p>you can sure use it, but i'm not sure about if it represent best practices</p>",
        "id": 206668155,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1597218810
    },
    {
        "content": "<p>Is there any guidance/preference on whether to use the designation on the CodeSystem vs ValueSet to provide alt language displays?</p>",
        "id": 206819563,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1597328039
    },
    {
        "content": "<p>well, it really depends on access and appropriateness. </p>\n<p>in general, if you are doing alternative language displays, you should define them in the code system just like you do with the native language displays. This way they are available where ever the code system is used </p>\n<p>But you might not be the publishing authority for the code system you are translating. Under this circumstance, you can use a code system supplement to provide the translations. This means that the language is in scope anywhere the supplement is made available. Unfortunately, support for supplements is not yet widespread </p>\n<p>You can fall back to putting them in the value set. This means that they are only available in the value set itself.</p>",
        "id": 206874080,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597354107
    },
    {
        "content": "<p>note that the reason you can provide a display in the value set is because in some circumstances, the general display for a concept is not appropriate. A good example is a curated list of virus codes from SCT. Every virus concept display will have lots of text about how it's about a virus - but that's true for every concept in the value set. So the value set should (for safety reasons) provide displays that remove all the spurious text</p>",
        "id": 206874336,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597354230
    },
    {
        "content": "<p>OTOH, it's very obvious that value set specific displays are dangerous: the could totally - or subtly - redefine the concept meaning</p>",
        "id": 206874419,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597354283
    }
]