[
    {
        "content": "<p>Hello everyone. <br>\nI have a probably small problem profiling a questionnaire-resource. I want to profile the Wound-Quality of Life-Questionnaire in forge R4.<br>\nWhat I did so far is:</p>\n<ul>\n<li>I made my own codesystem for questions and answers (there were no SNOMED-Codes and no LOINC-Codes) and uploaded it on simplifier</li>\n<li>I made a valueSet for the answers and uploaded it on simplifier.</li>\n<li>I sliced the item for the 17 questions.</li>\n<li>Each slice was given a code from my codesystem to identify the question.</li>\n<li>The answerOption.code of each slice was altered: The only possible value is a code. This code has to come from my valueSet (all questions have the same possible answers). <br>\nA reload in Forge resulted in slices on answerOption.code, I declared this slice \"closed\", as I do not want to allow any other answer-option-valuetype. </li>\n</ul>\n<p>When I tried to upload the profile on simplifier, I get the following result when I want to look at the resource: <br>\n\"The resource information may be incomplete due to the following issues:<br>\n    Invalid resource format: Type checking the data: Choice element 'valueSet' is not suffixed with a type.\"<br>\n(see <a href=\"https://simplifier.net/ui/publication/show?projectkey=PosiThera&amp;pubUrlKey=PosiTheraWundQoLQuestionnaire\" target=\"_blank\" title=\"https://simplifier.net/ui/publication/show?projectkey=PosiThera&amp;pubUrlKey=PosiTheraWundQoLQuestionnaire\">https://simplifier.net/ui/publication/show?projectkey=PosiThera&amp;pubUrlKey=PosiTheraWundQoLQuestionnaire</a>) </p>\n<p>I don't know what Simplifier wants to tell me. Can anyone please help me? Or tell me where to ask if not here?<br>\nThanks in advance.</p>",
        "id": 166443474,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1558697483
    },
    {
        "content": "<p>sounds like a version issue - but why are you profiling questionnaire? Usually, you would just write a questionnaire</p>",
        "id": 166443767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558697749
    },
    {
        "content": "<p>We are quite new to FHIR. We didn't know that it's unusual to profile a questionnaire...</p>",
        "id": 166443910,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1558697882
    },
    {
        "content": "<p>I just saw that in STU3 answerOption was option, probably that's the problem.</p>",
        "id": 166444161,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1558698063
    },
    {
        "content": "<p>if you are looking for a questionnaire editor, there are several out there</p>",
        "id": 166449262,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558702582
    },
    {
        "content": "<p>Profiling Questionnaire makes sense if you want to describe limitations on a collection of Questionnaires someone else is allowed to write (e.g. Answers can only be integers and booleans, Prefixes are mandatory, etc.)  But to author a specific questionnaire, you just create the Questionnaire instance - no need for a profile.</p>",
        "id": 166459536,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558709287
    }
]