[
    {
        "content": "<p>I think the purpose of allowing x-fhir-query expressions for calculatedExpression was for item type=reference.  However, I am not sure how that works.  An x-fhir-query will return a Resource (or a Bundle, or the result of an operation), but a Reference is basically a URI with a display string, and not the whole resource the URI points to.</p>",
        "id": 212823738,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1602249330
    },
    {
        "content": "<p>Right, but the drop-down would need to contain information about the referenced resource.  The extension we used to use to constrain what is pointed to was a query too</p>",
        "id": 212824529,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602249764
    },
    {
        "content": "<p>So, then the form renderer needs to construct a Reference from the returned Resource?  How does it know what to use for the display string?  Or is that up to the renderer?</p>",
        "id": 212825302,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1602250192
    },
    {
        "content": "<p>We provide guidance in the columns extension about what should go in the display.  In the absence of that, yes - it would be up to the renderer - or more specifically, the system that captures the response.</p>",
        "id": 212825486,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602250274
    },
    {
        "content": "<p>The choiceColumn extension controls what goes into the columns of a multi-column drop down list, which would be useful in displaying a list of resources, but I don't see how it controls the format (or the content) of what goes into Reference.display after the user picks an item.  Is that just up to the implementation?</p>",
        "id": 212827228,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1602251121
    },
    {
        "content": "<p>There's a property on that extension that indicates if the column value should go in the display</p>",
        "id": 212834512,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602254451
    },
    {
        "content": "<p>I missed that.  That's perfect!  Thanks.</p>",
        "id": 212834815,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1602254606
    }
]