[
    {
        "content": "<p>Has anyone implemented these as yet?<br>\n<a href=\"http://build.fhir.org/ig/HL7/sdc/StructureDefinition-sdc-questionnaire-candidateExpression.html\">http://build.fhir.org/ig/HL7/sdc/StructureDefinition-sdc-questionnaire-candidateExpression.html</a><br>\nBetter description is on this page (maybe we should copy some of this text onto the extension page itself)<br>\n<a href=\"http://build.fhir.org/ig/HL7/sdc/expressions.html\">http://build.fhir.org/ig/HL7/sdc/expressions.html</a><br>\n\"CandidateExpressions should rarely, if ever, declare a name element.\" was added to the bottom, and I came up with a great use for that property (and all expressions I'll be putting into my forms) where this is the name that I use from an expression library, so that I can manage them better. (this is kind of like the library extension)</p>",
        "id": 198164330,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1589960731
    },
    {
        "content": "<p>Could this candidate expression be a \"source\" for a group level item, and then the child items for the group as they are \"selected\" from the source then leverage the initialExpression to populate values from that selection?<br>\ne.g. Have a CandidateExpression on a group for \"Contacts\" for the patient, then the items in the group be name, contact number, relationship, then the selection could easily enable selecting a few from the record, then shoving into the responses.<br>\nOr select relevant medications and then read the name dose etc.</p>",
        "id": 198164586,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1589960919
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> - is that an allows use of the Expression data type?  I.e. just specify a name and have it looked up in a library?</p>",
        "id": 198211319,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589986980
    },
    {
        "content": "<p>Well, we haven't used it that way so far, but it's not an unreasonable thing to do. We currently do that quite a bit, we just do it a bit differently in that the \"expression\" element is the name of the expression in the library.</p>",
        "id": 198213219,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1589987739
    },
    {
        "content": "<p>And the reference points to the Library containing the expression.</p>",
        "id": 198213309,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1589987769
    },
    {
        "content": "<p>I think I prefer that approach.  It puts code in the code place and leaves name for human rendering</p>",
        "id": 198214693,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589988306
    },
    {
        "content": "<p>We introduced the media type <code>text/cql.identifier</code> to support that use case, it would make sense to do the same thing for the FHIRPath case, that would be the signal for the implementation to know that the expression was actually the id of a content element in the referenced library.</p>",
        "id": 198242944,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1590001433
    },
    {
        "content": "<p>I was still having the expression in the questionnaire (keeping things simple for the renderer), was just a use where I was having it as a management thing.</p>",
        "id": 198255591,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1590007850
    },
    {
        "content": "<p>I'll log tracker to remove the \"rarely provide a name\" text</p>",
        "id": 198255645,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1590007888
    },
    {
        "content": "<p>FHIR-27537</p>",
        "id": 198257928,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1590009110
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/HL7/sdc/expressions.html\">http://build.fhir.org/ig/HL7/sdc/expressions.html</a> says \"name allows the result of the expression to be referenced within other expressions.\"  I am not sure if that makes sense for candidateExpression, but if it did I would expect it to be defining a variable with the result of the candidateExpression expression.</p>",
        "id": 198260546,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1590010764
    },
    {
        "content": "<p>I created an example of trying out the <code>candidateExpression</code> on a group value<br>\n<a href=\"https://sqlonfhir-r4.azurewebsites.net/fhir/Questionnaire/pre-pop-test-candexpr\">https://sqlonfhir-r4.azurewebsites.net/fhir/Questionnaire/pre-pop-test-candexpr</a><br>\nDoes this make sense to anyone other than me (refer to the contacts item)</p>",
        "id": 198385162,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1590099970
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>, Looking at the related JIRA ticket for this: <a href=\"https://jira.hl7.org/browse/FHIR-27537\">https://jira.hl7.org/browse/FHIR-27537</a>... it seems that your example does not comply with the resolution on this ticket:</p>\n<p><em>Will change \"CandidateExpressions should rarely, if ever, declare a name element\" to \"CandidateExpresssion name can be used for documentation purposes, but will not be exposed for reference in other CQL or FHIRPath expressions</em>.  </p>\n<p>It references the candidateExpression name \"selectedContact\" in other FHIRPath expressions (ie for the  initialExpression \"%selectedContact.telecom.where(system='phone').first().value\")</p>\n<p>Which is correct? Can the \"name\" element be used as a reference or not? Can you clarify <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 203434919,
        "sender_full_name": "Joee Garcia",
        "timestamp": 1594325982
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>,   We discussed this issue in the SDC Meeting and have added a change request for it: <a href=\"https://jira.hl7.org/browse/FHIR-28081\">https://jira.hl7.org/browse/FHIR-28081</a>. Because of this, I've updated the sample questionnaire you submitted (questionnaire-fhirpath-prepop-candexpr) to use calculatedExpression for the child items instead of initialExpression (as initialExpression is only evaluated on initial load and calculatedExpression will work better when selecting/editing the answer linked to the candidateExpression)</p>",
        "id": 204138933,
        "sender_full_name": "Joee Garcia",
        "timestamp": 1594931561
    }
]