[
    {
        "content": "<p>Unlike in most other resources, the cardinality of the <code>identifier</code> element in QuestionnaireResponse is <code>0..1</code> rather than <code>0..*</code>. The label for this element says \"The Unique id for this set of answers\" so this seems to be a very deliberate choice. What was the reasoning behind this restriction?<br>\nFYI <span class=\"user-mention\" data-user-id=\"250685\">@Johannes Oehm</span> .</p>",
        "id": 241511369,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1622799388
    },
    {
        "content": "<p>No one's ever had a use-case for multiple identifiers on a single response.  Do you have one?</p>",
        "id": 241534129,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622813154
    },
    {
        "content": "<p>No, I was just curious <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>   I (maybe incorrectly) assumed that the general approach was allowing multiple identifiers and this seemed to be a deliberate divergence from that \"rule\". I suppose I thought a general argument for <code>0..*</code> would be that a resource might get passed around to different organizations that all want to attach their own identifier (or orgs may have e.g. an old and a new identifier systems and want to attach one of each). And that seemed to apply to QuestionnaireResponse as well. </p>\n<p>Is it rather that there's a general principle of aways picking the \"narrowest\" cardinality consistent with explicitly known use cases when defining a new resource &amp; that gives <code>0..1</code> for <code>QuestionnaireResponse.identifier</code>?</p>",
        "id": 241540484,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1622815818
    },
    {
        "content": "<p>We try not to make things repeat just on the possibility \"maybe someone could possibly do this\" but instead are driven by actual use-cases, because adding repetitions adds costs.  However, if there's a reasonable likelihood of multiple repetitions existing, then we'd boost the cardinality.</p>",
        "id": 241542701,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622816651
    },
    {
        "content": "<p>Certainly if anyone is aware of a use-case for multiple business identifiers for the same response, we'd love to hear it.</p>",
        "id": 241542783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622816687
    },
    {
        "content": "<p>Ok, thanks for the explanation <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> !</p>",
        "id": 241544983,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1622817525
    }
]