[
    {
        "content": "<p>There's a work flow that keeps coming up for me with different clients and implementers: </p>\n<p>When the client submits some change/transaction/complicated request to the server, the server would like to ask the client arbitrary questions about the submission before processing it. We have a language for asking arbitrary questions... a questionnnaire. So the API would look something like this:</p>\n<ul>\n<li>client makes a request</li>\n<li>server responds with an async redirect, and a HATEOS link to a questionnaire for the client to present to the user. </li>\n<li>client pre-populates the questionnaire per SDC if it wants</li>\n<li>client presents the questionnaire to the user</li>\n<li>once the user has completed the questionnaire, the client submits it to the async task location, and the server either <ul>\n<li>returns an error from processing the questionnaire, and the cycle restarts</li>\n<li>completes the task</li>\n<li>redirects to the task location while processing the task</li>\n</ul>\n</li>\n</ul>",
        "id": 153951260,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523044769
    },
    {
        "content": "<p>is anyone interested in this?</p>",
        "id": 153951261,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523045031
    },
    {
        "content": "<p>We're interested. It makes sense if you have a jurisdictional authority that needs to host a form for a local hospital to fill out. Then that local hospital can load the link to the questionnaire if there are capability issues at the local site in getting a questionnaire running and SDC compliant. Places the burden on the Form Manager <br>\nDifficulty is how to prepopulate a form hosted outside the hospital. Does that require patient data sent to the Form manager?</p>",
        "id": 153951632,
        "sender_full_name": "Alex Goel",
        "timestamp": 1523363820
    },
    {
        "content": "<p>the client pre-populates the form outside the hospital</p>",
        "id": 153951693,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523397412
    },
    {
        "content": "<p>Scheduling use case and <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  might be on board</p>",
        "id": 153951729,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523415250
    },
    {
        "content": "<p>I'm interested.</p>",
        "id": 153951739,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1523424229
    }
]