[
    {
        "content": "<p>In HTML, if you have a checkbox, and mark it required, the form is <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/checkbox\">not valid</a> unless the checkbox is checked.  Is that the intended behavior for FHIR Questionnaire boolean questions with required=true &amp; i itemControl set to 'check-box'?  I think in previous discussions we had said checkboxes conceptually have three states (true, false, and unanswered), in which case \"required=true\" should mean the answer is present and either true or false.</p>",
        "id": 210158464,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600189647
    },
    {
        "content": "<p>Right.  If you can't distinguish 'non-answered', then you have to treat the checkbox as answered</p>",
        "id": 210158646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600189722
    },
    {
        "content": "<p>I agree with this answer, and think should be documented.<br>\nOur renderer does put in false in not selected. If we care about the use making some form of action, but in a drop down, or a 3 value coding.<br>\nMany people don't think a checkbox is tristate, and don't interact with the control if the value looks correct. So is an answer.</p>",
        "id": 210188167,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600202789
    },
    {
        "content": "<p>I found <a href=\"http://jira.hl7.org/browse/FHIR-23019\">J#23019</a> (approved, change required).</p>",
        "id": 210191054,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600204155
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> I haven't been able to follow the threads here but could argue that you'd be needing actually 4 states from my experience:</p>\n<ol>\n<li>Yes (explicit - confirmed by observation, asserted by subject, provider, other)</li>\n<li>No (explicit - confirmed by observation, asserted by subject, provider, other)</li>\n<li>Unknown (positively asserted; e.g. preferred not to answer, masked etc.)</li>\n<li>Null (truly! and it is the default status unless an assumed/default value has been set).</li>\n</ol>\n<p>Also some questions would/coult not have an explicit No answer; I've encountered this back in 2000s when implementing a structure questionnaire for endoscopy reporting. I've been working with openEHR models at that time but it is completely applicable to FHIR structured content; the idea is real-world concepts can have explicit No whereas some abstract concepts cannot - full details explained in the attached paper (core concept vs non-core - might seem academic but actually it is a real-world clinical system implementation!)<br>\n<a href=\"/user_uploads/10155/5_hMnZXqXg3_qIh2RVEZtgbZ/Atalag_Yang_2010_From-openEHR-Domain-Models-to-Advanced-User-Interfaces.pdf\">Atalag_Yang_2010_From-openEHR-Domain-Models-to-Advanced-User-Interfaces.pdf</a> </p>\n<p>Hope I am not derailing this conversation!</p>",
        "id": 211560819,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1601333681
    },
    {
        "content": "<p>If you're wanting 'unknown', then you're no longer dealing with a boolean, and checkbox is no longer on the table as a control - you're looking for a set of radio buttons or a dropdown or something like that.</p>",
        "id": 211561828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601334346
    },
    {
        "content": "<p>Where we've had these explicit requirements, we also do the dropdown or radios, the subtleties of checkbox apart from yes/no is normally lost on users entering the information.</p>",
        "id": 211562794,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1601335074
    },
    {
        "content": "<p>I had implemented a 4 state checkbox back then - the clinicians found it very intuitive but I understand potential cognitive friction for broader use cases.</p>",
        "id": 211573329,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1601345154
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191420\">@Koray Atalag</span>  That is interesting.  Thanks for sharing that.  What did the checkboxes look like for the other two states?</p>",
        "id": 211771335,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1601477425
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179255-questionnaire/topic/Checkbox.20.26.20required/near/210158646\">said</a>:</p>\n<blockquote>\n<p>Right.  If you can't distinguish 'non-answered', then you have to treat the checkbox as answered</p>\n</blockquote>\n<p>So then, different form renderers producing QuestionnaireResponses for the same Questionnaire and the same user input, could have different numbers of \"answers\".   Is that a problem?  Something analyzing QuestionnaireResponse data, unless it knows what created the QuestionnaireResponse, would not be able to distinguish between \"false\" and \"unanswered\", and would not be able to accurately count the number of answered questions.   I suppose one could say that if such things were important, the Questionnaire should be be designed with answers lists rather than booleans.</p>",
        "id": 211772862,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1601478050
    },
    {
        "content": "<p>A QuestionnaireResponse item that isn't answered wouldn't have item.answer populated</p>",
        "id": 211774550,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601478651
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> We are discussing the case, per your previous comment, in which some form renderers only have a two-state checkbox and can't distinguish between \"unanswered\" and \"false\".</p>",
        "id": 211775265,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1601478865
    },
    {
        "content": "<p>If you're analyzing the data, you have to treat the presence of an answer as 'answered'.  Essentially the system behaves as one that 'defaults' the booleans to false and the user has to change if they disagree.</p>",
        "id": 211775969,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601479137
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> I'll send you a quick video</p>",
        "id": 211880143,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1601540012
    }
]