[
    {
        "content": "<p>How common comparators are needed for quantity values in forms?</p>\n<p>We want to simplify questionnaire-based forms and are considering skipping comparators (not allowing to enter comparator) for quantities where they are not needed.</p>\n<p>Do you think it should be \"opt-in\" (\"allow entering comparator for this quantity question\") or \"opt-out\" (\"don't allow comparator for this questionnaire item\"). Which scenario is more common in general?</p>\n<p>Also, what would be the standard way to indicate that given questionnaire item does not need a comparator / does need a comparator? So far we've only thought about using <a href=\"https://www.hl7.org/fhir/extension-questionnaire-fhirtype.html\">https://www.hl7.org/fhir/extension-questionnaire-fhirtype.html</a> or <a href=\"https://www.hl7.org/fhir/extension-questionnaire-basetype.html\">https://www.hl7.org/fhir/extension-questionnaire-basetype.html</a> (by setting either of them to \"SimpleQuantity\"). It sort of suggests \"opt-in\" behavior by default (quantity will have comparator input unless this extension is used to \"opt-out\").</p>\n<p>Other suggestions?</p>",
        "id": 221114597,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1609222580
    },
    {
        "content": "<p>Most questionnaires won't allow the use of Quantity at all.  Instead, they'll capture a decimal (and the units will be fixed) or they'll capture value and units as separate questions.</p>",
        "id": 221147323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609260290
    },
    {
        "content": "<p>How common it would be to allow choosing the unit to address different measurement systems (like \"lb\" vs \"kg\")? Or is \"lb\" vs \"kg\" really just the only example where this would make sense?</p>",
        "id": 221165293,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1609274680
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194996\">@Ivan Dubrov</span>  it is not only for different measurement systems, e.g. mmol/l or mg/dl. We use quantity often in our questionnaires, and I like your idea of SimpleQuantity when comparator isn't necessary.</p>",
        "id": 221261304,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1609377834
    },
    {
        "content": "<p>What I don't like about it is that it kind of uses \"standard\" extensions, but is not quite standard in the sense that it is pretty much arbitrary interpretation of baseType / fhirType extensions semantics. Maybe, it should be another <a href=\"https://www.hl7.org/fhir/valueset-questionnaire-item-control.html\">https://www.hl7.org/fhir/valueset-questionnaire-item-control.html</a> value instead.</p>",
        "id": 221262210,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1609378982
    },
    {
        "content": "<p>We have been trying not to conflate item-control (UI specification) with the semantics of the underlining data type. For instance -- we have an item-control DropDown that handles both picking from an inline set of answers or valueset (for an item type choice / code); as well as it handles picking from a FHIR query (for an item type of a reference).</p>",
        "id": 221292024,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1609423555
    }
]