[
    {
        "content": "<p>The <a href=\"http://hl7.org/fhir/R4/extension-questionnaire-itemcontrol.html\">itemControl extension</a> is meant for indicating how certain questions should be rendered (slider, table etc.). However, some of the options in the <a href=\"https://www.hl7.org/fhir/codesystem-item-type.html#item-type-open-choice\">associated, extensible code system</a> can seemingly clash with other entries in the <code>item</code> element. For instance, if I have set <code>item.repeats</code> = true and then add <code>itemsControl</code> with the code <code>radio-button</code>, we have an apparent contradiction since a radio-button UI-element only allows choosing a single option (though I suppose that one could render multiple sets of radio buttons...).</p>\n<p>Since the description of the extension says \"Different controls may be appropriate for different item types. \", I would take the approach that if there is an apparent contradiction that my UI cannot resolve, the non-extension element wins. So if I have <code>repeats</code> = true, I would ignore the request in the extension to render it as a radio-button. Does that sound sensible?</p>",
        "id": 243140077,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1624010493
    },
    {
        "content": "<p>For my implementation, if we got that case we would switch to check boxes.</p>",
        "id": 243290797,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624173553
    },
    {
        "content": "<p>We consider that's close enough to the intent.</p>",
        "id": 243290802,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624173593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> Thanks for the feedback, just make sure I understand you correctly: your implementation gives <code>repeats</code>  precedence over the extension in conflict cases, correct?</p>",
        "id": 243358828,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1624268218
    },
    {
        "content": "<p>It interprets a repeating radio as a set of check boxes (multi select radios)</p>",
        "id": 243359504,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624268637
    },
    {
        "content": "<p>A repeating drop list shows selected values in the text box portion.</p>",
        "id": 243359654,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624268719
    },
    {
        "content": "<p>It wouldn't be a bad idea for the SDC IG to give some guidance about that - i.e. that renderers should take the itemControl as a recommendation but are free to ignore it, substitute or even raise an error if what's requested is either nonsensical or unavailable.  (Typically proceeding with best effort is better than raising an error.)  <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>, do you want to submit a change request?</p>",
        "id": 243861863,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624579318
    },
    {
        "content": "<p>Yup, I opened <a href=\"https://jira.hl7.org/browse/FHIR-32979\">FHIR-32979</a>. However, as I think this problem is relevant even outside the context of SDC (e.g. I am not working with SDC), I put the ticket on the core spec &amp; Questionnaire for now.</p>",
        "id": 243885464,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1624607558
    }
]