[
    {
        "content": "<p>Da Vinci is looking to require SDC questionnaires for their DTR (Documentation, Templates and Rules) IG and are creating profiles on Questionnaire to reflect their specific requirements - specifically drawing on the rendering, behavior and expression population forms.  However, in all cases they've opted to make elements that SDC has marked as \"mustSupport\" optional (i.e. mustSupport=false).  This has me wondering about whether we should be loosening some of our expectations.  The specific profile elements they've opted to loosen - at least for now - are:<br>\n<strong>Rendering</strong>: displayCategory, entryFormat<br>\n<strong>Behavior</strong>: maxDecimalPlaces, maxOccurs, maxValue, minLength, minOccurs, minValue, ordinalValue, readOnly/expression, regex, repeats/expression, required/expression, text/expression, toggleExpression, usageMode, valueSet/expression<br>\n<strong>Population</strong>: itemPopulationContext, unit</p>",
        "id": 264175845,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638978961
    },
    {
        "content": "<p>Any thoughts?</p>",
        "id": 264175893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638978967
    },
    {
        "content": "<p>I think that if the core SDC spec makes too many of the newer/better/cooler features (such as toggleExpression or itemPopulationContext)of questionnaires optional, then there won't be as much uptake for those elements.  I think that part of the FHIR evolution is to gradually and continuously improve the core spec so that the elements will be ready and available for a variety of use cases.    Since Da Vinci seems to be able to adequately limit usage of elements using a profile, I don't see a need to change the SDC conformance expectations.  However, it might be interesting to discuss creating a standard SDC-lite profile, with the minimum required elements to make a minimally functioning questionnaire.</p>",
        "id": 264230922,
        "sender_full_name": "Diane",
        "timestamp": 1639002879
    },
    {
        "content": "<p>I will probably think about this some more, but for now there are two items on that list which catch my attention:</p>\n<ol>\n<li>displayCategory - I have it implemented, but feel that similar effects could be achieved with item controls (prompt, and help), and the new itemMedia extension.</li>\n<li>itemPopulationContext: as a lightweight, mobile filler I feel I should be able to be conformant even if I leave all the heavy-lifting of advanced population to the server. In essence, I want to be able to pull a Questionnaire and a corresponding QuestionnaireResponse from the server, populate the QR into the Questionnaire, present it in a high fidelity, dynamically updated rendition for filling, send the resulting QR back to the server and be conformant.</li>\n</ol>\n<p>Not on the above list, but also coming from the lightweight mobile filler scenario: 3 expression engines (network query, FHIRPath, CQL) is a lot. I have yet to come across a questionnaire where I needed the power of CQL.</p>\n<p>In conclusion: I wouldn't ask for an \"SDC-lite\" profile, but maybe something that offers a good set of functionality that can be implemented well on a mobile platform with limited compute power, limited network, limited application size, small screen (affecting support for some of the item-controls on group), and great support for different keyboard types. Plus maybe an ability to indicate that an attachment should come from the camera.</p>",
        "id": 264239009,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1639008119
    },
    {
        "content": "<p>The issue is that, right now, Da Vinci isn't conformant against the SDC profiles, it merely aligns with them.  Defining profiles that define a desired target doesn't necessarily buy much if the result is everyone goes off and defines their own profile.</p>",
        "id": 264262318,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639031771
    },
    {
        "content": "<p>Unless there's broad consensus on loosening things, we'll probably leave everything \"as is\" in this release.  However, in the next release, we should seriously consider a few levels of profiles to better allow systems to conform without doing 'everything'.</p>",
        "id": 264262358,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639031848
    },
    {
        "content": "<p>There's going to be levels of everything here...</p>",
        "id": 264412803,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1639123109
    },
    {
        "content": "<p>I'm working towards how to render and compare conformance for this.<br>\nSoncan know that out renderer/server can use questionnaire X. And also compare to alternative systems/renderers.</p>",
        "id": 264412859,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1639123173
    }
]