[
    {
        "content": "<p>In Questionnaire (and perhaps for FHIR in general), for example, the same extension or Coding may be repeatedly used within the same resource and these things are quite verbose and can significantly inflate (easily double) the size of the data, making it cluttered and hard to read. I'm wondering whether it's possible to introduce (if not already exists) something like contained entities, where you define an \"entity\" or element, like a coding (with system, code, display, etc.) that can be referenced within the resource where the specific element/entity is used? Of course the resource def would need to be updated to allow such local references. Because the entities are defined within the resource, it should be pretty simple to manage/process, and should not impact readability if not making it easier to read.  <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 168145317,
        "sender_full_name": "Xiaocheng Luan",
        "timestamp": 1560526350
    },
    {
        "content": "<p>That would reduce size but significantly increase complexity.  And in the end, what you'd really be doing is a less effective version of what compression algorithms already do really well.  The unit of re-use in FHIR is the resource.  In a few places there are abilities to reference re-useable chunks inside a resource - but those are part of the design of that specific resource and are explicitly called out.  There's no ability to \"point\" to a Coding already elsewhere in an instance and avoid repeating the system, code and display.</p>",
        "id": 168153975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560532447
    },
    {
        "content": "<p>Thanks for the response, I can see the point of simplicity and trade off, especially the unit of reuse argument, although repeating a structured data element value over and over again doesn't look very elegant.</p>",
        "id": 168316313,
        "sender_full_name": "Xiaocheng Luan",
        "timestamp": 1560782673
    },
    {
        "content": "<p>My experience with Fhir questionnaires doesnt feel like that's likely to occur.<br>\nIf you're referring to repeating the same set of options for multiple questions, then you create a valueset with those concepts and share that. Which is then able to utilise http caches too during execution, even further reducing overall bandwidth used.</p>",
        "id": 168358949,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1560816959
    },
    {
        "content": "<p>If you've got 100 questions which are coded as \"Strongly Agree\", \"Agree\", ... then you will end up repeating the codings in the instance a whole lot.  But in the grand scheme of things, that's not a typical occurrence.</p>",
        "id": 168364153,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560825053
    }
]