[
    {
        "content": "<p>Sorry if this has been discussed before but I couldn't find anything in relation to some of these questions.  </p>\n<p>From what I've seen the cqf-expressions extension is always at the item level.  At first blush this seems like a natural place for it to be but looking at it a bit further it also seems odd.   cqf-expression defines itself as providing the value for the element on which it appears but in this case it seems like it is being used to define the value for an element on a separate resource, QuestionnaireResponse.   Curious as to why the cqf-expression would not be used on  Questionnaire.item.initialValue  and Questionnaire.item.answerOption? </p>\n<p>Is there somewhere that defines the use and expectations of cqf-expression on Questionnaire.item?  Is the expression only used to gather to answer(s) to the item?  If it's the item is of type choice or open choice is the expression also considered to be the answerOption[x] list?  Is the expression expected to be the value for initalValue[x]. </p>\n<p>If the expression is not expected to represent the answerOption[x] list for choice and open-choice questions then I see the issue where someone accidentally removes a CQL derived value in a Questionnaire without a means to add it back in.</p>",
        "id": 205949329,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1596569185
    },
    {
        "content": "<p>cqf-expression is probably not what you want - take a look at the structured data capture IG (<a href=\"http://build.fhir.org/ig/HL7/sdc/\">http://build.fhir.org/ig/HL7/sdc/</a>) and look at the section on 'population'.  There are a number of Questionnaire-specific extensions that handle the semantic of 'appearing on Questionnaire, but intended to define values for use in the resulting QuestionnaireResponse'.</p>",
        "id": 205957127,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596573345
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  At the risk of making work for the DaVinci project,  all of their examples, as far as I can tell, use cqf-expression. I take it that those examples would more appropriately use the extensions defined under SDC.  <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> is there any intent on moving to the SDC extensions as they seem more appropriate.</p>",
        "id": 205958551,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1596574076
    },
    {
        "content": "<p>Nevermind, I see DaVinci is using the guidance from here <a href=\"http://hl7.org/fhir/R4/clinicalreasoning-knowledge-artifact-representation.html#documentation-template\">http://hl7.org/fhir/R4/clinicalreasoning-knowledge-artifact-representation.html#documentation-template</a> </p>\n<p>I also see that SDC is a viable alternative defined within the DaVinci documentation.</p>\n<p>I suppose that begs the initial questions I had regarding the use of cqf-expression in the manner described in the clinical reasoning module.</p>",
        "id": 206010897,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1596626906
    },
    {
        "content": "<p>The Clinical Reasoning documentation template approach uses cqf-expression because that was the intended extension to support that sort of capability, but the SDC approach is much more mature, and the cqf-questionnaire profile has been deprecated. The cqf-expression extension is still used to provide \"the value of the element on which it appears\", in particular we use that for describing dynamic test data (<a href=\"https://github.com/cqframework/opioid-cds-r4/blob/master/input/examples/encounter-example-rec-07-end-of-life-exclusion-prefetch.xml#L13\">example</a>).</p>",
        "id": 206021304,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1596633931
    },
    {
        "content": "<p>Also, SDC uses cqf-expression for a few things, per this tracker item: <a href=\"https://jira.hl7.org/browse/FHIR-25960\">https://jira.hl7.org/browse/FHIR-25960</a></p>",
        "id": 206022087,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1596634342
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  thanks, that makes sense, but I am not seeing the cqf-questionnaire profile as being labeled as deprecated.  In the latest R5 build it is still listed for 'Trial Use'.  Is it supposed to be labeled as deprecated?</p>",
        "id": 206024247,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1596635564
    },
    {
        "content": "<p>\"cqf-questionnaire profile has been deprecated\" Really? Wow. What is replacement for that profile?</p>",
        "id": 206024270,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1596635578
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214452\">@Rob Dingwell</span> After brief reading, I think answerExpression extension mentioned in <a href=\"https://jira.hl7.org/browse/FHIR-25960\">https://jira.hl7.org/browse/FHIR-25960</a> could be a direction to go. Or the combination of questionnaire-initialExpression, sdc-questionnaire-candidateExpression, and sdc-questionnaire-contextExpression could also be a good replacement.</p>",
        "id": 206030370,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1596638605
    },
    {
        "content": "<p>A question about questionnaire-initialExpression. <a href=\"http://build.fhir.org/ig/HL7/sdc/populate.html#expression-based-population\">Expression-based Population</a> states that \"This should always be a FHIRPath that resolves to an item of the appropriate type unless the element has a type of Reference, in which case the expression can be a FHIR query\". Why is CQL expression excluded here?</p>",
        "id": 206030754,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1596638780
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> I think that CQL was inadvertently left out of that portion of the documentation.  If you look here you will see that CQL is listed as well .  <a href=\"http://build.fhir.org/ig/HL7/sdc/expressions.html\">http://build.fhir.org/ig/HL7/sdc/expressions.html</a></p>",
        "id": 206032639,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1596639674
    },
    {
        "content": "<p>In general. yes. That is why I am confused by the wording \"should always be a FHIRPath\". Maybe there is a specific reason to exclude CQL. If so, I would like that to be clarified.</p>",
        "id": 206037236,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1596641536
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-28211\">https://jira.hl7.org/browse/FHIR-28211</a></p>",
        "id": 206056144,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1596650129
    },
    {
        "content": "<p>There was a change request for us to allow CQL in places that had previously only allowed FHIRPath.  It's possible that either hasn't been applied yet or this spot might have been missed.  <span class=\"user-mention\" data-user-id=\"217312\">@Joee Garcia</span> ?</p>",
        "id": 206084912,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596665925
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  Yes,  this same spot in the documentation has been raised and resolved  in <a href=\"https://jira.hl7.org/browse/FHIR-21391\">https://jira.hl7.org/browse/FHIR-21391</a> , but it has not been applied yet.</p>",
        "id": 206125416,
        "sender_full_name": "Joee Garcia",
        "timestamp": 1596710514
    }
]