[
    {
        "content": "<p>I would like to see if there is any standard defined to include multiple custom business rules and apply on item level and at <strong>Questionnaire</strong> level .<br>\nExample: 1. If <strong>Patient</strong> is living in NewYork then I need to show or hide the item. (The patient living location is not available in <strong>Questionnaire</strong>)</p>\n<ol start=\"2\">\n<li>I need to show set of items related to pregnancy if <strong>Patient</strong> Gender is Female and age is greater than 18. Both Gender and Age won't be available inside <strong>Questionnaire</strong>, how ever the data is available in the respective application when the <strong>QuestionnaireResponse</strong> is collected.</li>\n</ol>\n<p>Please note that, I have explored <strong>EnableWhen</strong> and <strong>EnableWhenExpression</strong> extensions, both of them works based on FHIR Path expressions, and the expression will be evaluated as and when we are filling out Questionnaire based on  answers selected. In our case, we would like to define some rules at Questionnaire, item level and they should be evaluated at runtime(NOT based on the answers selected from Questionnaire).</p>",
        "id": 222756040,
        "sender_full_name": "Rajesh B",
        "timestamp": 1610647037
    },
    {
        "content": "<p>The EnableWhenExpression is what you're looking for, which are evaluated at runtime, not sure what you mean in the last sentance.<br>\nThe expression can refer to anything, not just results to questions.</p>",
        "id": 222757064,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1610647405
    },
    {
        "content": "<p>To do that you would need to include the pre-population context information to be provided into the rendering so that the information was made available to the form as  a context variable, which is then available to the fhirpath engine.</p>",
        "id": 222757543,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1610647566
    },
    {
        "content": "<p>Note that enableWhen is driven only by questions answered in the context of this Questionnaire.  If you're wanting to display information conditionally based on data elsewhere in the patient's record, you could have auto-populated hidden questions.  You could also use the enableWhenExpression extension to make things conditional on a direct query, but the challenge there is that the validity of the questionnaire response could change over time.  E.g. a QuestionnaireResponse filled out a year ago might now say it's invalid because the patient no longer resides in New York, even though they might have at the time the response was completed.</p>",
        "id": 222764630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610650493
    },
    {
        "content": "<p>Hi Lloyd and Brian,</p>\n<p>Thanks for your response.<br>\nCan you please share any references/examples based on your response.</p>",
        "id": 222779047,
        "sender_full_name": "Rajesh B",
        "timestamp": 1610656066
    },
    {
        "content": "<p>For those specific examples, you might use launchContext to get a \"patient\" variable loaded with the Patient resource, and then use that variable in an expression (variable and/or enableWhenExpression) to get the address, gender, or birthDate.   An example of that is <a href=\"https://lforms-smart-fhir.nlm.nih.gov/v/r4/fhir/Questionnaire/54127-6-x\">https://lforms-smart-fhir.nlm.nih.gov/v/r4/fhir/Questionnaire/54127-6-x</a></p>",
        "id": 222799927,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1610666537
    },
    {
        "content": "<p>Hi Paul,<br>\n      LaunchContext only supports 4 resources like Patient,encounter,location and user.If we prefer to go with custom resources.How can we implement.Will there be any other approach alternative to launchcontext</p>",
        "id": 223264783,
        "sender_full_name": "Sravanti Cherukuri",
        "timestamp": 1611078636
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"381581\">@Sravanti Cherukuri</span> Please see the resolution of <a href=\"https://jira.hl7.org/browse/FHIR-29664\">https://jira.hl7.org/browse/FHIR-29664</a>, which is approved but not yet applied, and which changed launchContext a bit.</p>",
        "id": 223315157,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1611101558
    }
]