[
    {
        "content": "<p>When designing a Questionnaire that will be rendered in an app, we want to be able to return custom error messages (e.g. for specific items) in local language. Is there an extension for this? How is this currently handled? Thanks</p>\n<p><span class=\"user-mention\" data-user-id=\"366686\">@Jing Tang</span> <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 241384280,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1622723916
    },
    {
        "content": "<p>Where would the error message be displayed?  You could use <a href=\"https://hl7.org/fhir/R4/extension-cqf-calculatedvalue.html\">cqf-calculatedValue</a> on the <code>text</code> element of an <code>item</code> in the Questionnaire.</p>",
        "id": 241386154,
        "sender_full_name": "David Winters",
        "timestamp": 1622724851
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"195840\">@David Winters</span> the messages would be displayed on the UI .. in this instance it's an android app so under the field</p>",
        "id": 241392044,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1622727753
    },
    {
        "content": "<p>This would still need to map to some content string that could have different language options ...</p>\n<p>One solution, would be to have these be specified within the client application itself ... and they can be tailored by the implementer .. not within the Questionnaire itself</p>",
        "id": 241392256,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1622727861
    },
    {
        "content": "<p>AFAIK, there is no extension for this. I think it's a reasonable ask</p>",
        "id": 241394951,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1622729119
    },
    {
        "content": "<p>IIRC, we're talking about a message like <code>Incorrect date format. Please use the format yyyy-mm-dd</code>. I think the client might have some generic capabilities, but this could be an interesting extension when the messages are specific for a question.</p>",
        "id": 241395002,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1622729139
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Yes, that is correct. Thanks for adding that context :)</p>",
        "id": 241395569,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1622729373
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>, others - is this the first time this request comes up?</p>",
        "id": 241397742,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1622730287
    },
    {
        "content": "<p>You can have enableWhen (and the enableWhenExpression extension) turned on for 'display' items the same as questions and groups.  And you can have translations for display items the same as you can have for other elements.  That's what you can do within the Questionnaire design itself.  If you're wanting to change the messages spit out by the data entry tool in response to regular rules (e.g. typing characters in a numeric or date field, specifying a non-existent month, going over length limits, etc.), that's a problem for the tool and not something that would show up in the resource.  (It would also be independent of what Questionnaire you were filling out.)</p>",
        "id": 241400464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622731451
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> that makes sense. cc: <span class=\"user-mention\" data-user-id=\"366686\">@Jing Tang</span> <span class=\"user-mention\" data-user-id=\"356307\">@Kunjan Patel</span></p>",
        "id": 241477593,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1622769427
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks for the reply. I agree that for the most part, the error message for validation is nothing to do with the questionnaire itself. but i think there still are cases where the error message might be more tailored to the clinical setting and therefore should be provided by the questionnaire. i agree that a hidden display field can be used, but it does appear a bit \"hacky\", and depending on the UI it might not actually make sense (for example, maybe the validation message is part of your text input box to give the user the idea that the message is for the input, rather than the error message appearing as a totally separate item following the question and answer). if we already have the validation extensions, it seems to make sense to have error messages attached.</p>",
        "id": 242583429,
        "sender_full_name": "Jing Tang",
        "timestamp": 1623670386
    },
    {
        "content": "<p>When does are reported by the validation engine, they include the location of the question /answer with the error, and that message is usually highlighted beside the field.<br>\nWhen my server validates them, it includes the field text in the message too.</p>",
        "id": 242600646,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1623679186
    },
    {
        "content": "<p>E.g. Invalid date of birth value entered (17/17/2012)</p>",
        "id": 242600880,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1623679266
    },
    {
        "content": "<p>Or mandatory date of birth field missing</p>",
        "id": 242601030,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1623679323
    },
    {
        "content": "<p>yeah that makes perfect sense - but the error message isn't coming from the questionnaire right? i think what Lloyd proposed (using the hidden display item for custom error messages) would not be using the validation engine (or maybe you can have both, a validation engine that returns an validation error, and a custom message also displayed by showing an otherwise hidden field)</p>",
        "id": 242716935,
        "sender_full_name": "Jing Tang",
        "timestamp": 1623754793
    },
    {
        "content": "<p>I think those are your two options.  If you want complete control over what the message is, then use a 'display' item (possibly as a child of your Question) that conditionally appears based on rules you specify.  Otherwise, you can just specify the constraints and it'll be up to the rendering tool to decide how that gets displayed.  Good ones will highlight the relevant field(s) and provide user-friendly messages, but you can't necessarily count on consistency.</p>",
        "id": 243860826,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624578558
    },
    {
        "content": "<p>Obviously if you're controlling the data entry client, you can control the messaging.  But I don't think we can reasonably try to allow 'standardized' customization of messaging from third-party rendering tools.</p>",
        "id": 243860917,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624578619
    },
    {
        "content": "<p>I would fully recommend the fhirpath constraints from SDC if I wanted custom messages created, however incorporating entered data in those isn't described anywhere.</p>",
        "id": 243861255,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624578807
    },
    {
        "content": "<p>And showing a display field conditionally as an error message feels very weird, and won't look like other errors handled by the renderer...<br>\nOurs has multiple choices depending on host context - all done through information coming out as an OperationOutcome - even when internal in the browser.</p>",
        "id": 243861356,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624578875
    },
    {
        "content": "<p>The item.text can use an extension for CQL to define its content.  We've got a pending approved change request to add that.  That would give you your context-specific message.</p>",
        "id": 243862038,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624579472
    }
]