[
    {
        "content": "<p>I see  mention of Questionnaire questions that can be associated with Task/ServiceRequest.  I also see several fields that could be used to convey this, for example \"useContext\" , \"definition\" and some others, but would like to get some thoughts/suggestions from this group<br>\nThanks</p>",
        "id": 160334684,
        "sender_full_name": "Don Langlois",
        "timestamp": 1552086230
    },
    {
        "content": "<p>So you want an order to complete a questionnaire?</p>",
        "id": 160334810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552086339
    },
    {
        "content": "<p>yes, for example consults that can be both questionnaire and order</p>",
        "id": 160334935,
        "sender_full_name": "Don Langlois",
        "timestamp": 1552086455
    },
    {
        "content": "<p>Sorry just to clarify, our project requirement is to create a questionnaire for form rendering in a consumer application</p>",
        "id": 160335094,
        "sender_full_name": "Don Langlois",
        "timestamp": 1552086582
    },
    {
        "content": "<p>Task can be used to essentially create items on a to-do list, and one such possible item would be \"fill out form X\".  The Questionnaire would be passed as an 'input' for the Task.  Once done, the completed QuestionnaireResponse would be associated as an 'output'.</p>",
        "id": 160336411,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552087873
    },
    {
        "content": "<p>Or, a ServiceRequest can be created with patient as the performer, with servicerequest-questionnaireRequest reference to Questionnaire.  When I looked at these alternatives, the ServiceRequest seemed to fit better into a care planning scenario.</p>",
        "id": 160336625,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1552088142
    },
    {
        "content": "<p>ServiceRequest is an \"authorization\".  If you need a full-blown signed order, then ServiceRequest is what's needed.  If you just want to tell a patient (or provider) \"hey, it's time to fill out form X\", then Task is more appropriate.  I've added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20515\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20515\">GF#20515</a> asking OO to provide more clarity on this</p>",
        "id": 160337516,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552089015
    },
    {
        "content": "<p>Another situation where I find ServiceRequest a better fit is to use Timing, e.g. patient should complete PHQ-9 assessment Questionnaire every 2 weeks for the next 3 months.</p>",
        "id": 160338118,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1552089674
    },
    {
        "content": "<p>Right.  Though you might then spawn a Task for the patient each time they're supposed to fill out the form.</p>",
        "id": 160338352,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552089875
    },
    {
        "content": "<p>Thanks again everyone, wondering if i can pick your brains again? The following use case i see several ways to accomplish but wondering your thoughts on the following:</p>\n<p>Use case:</p>\n<p>User creates a form template for consumption by providers. The form could be a simple questionnaire or more complex questionnaire with an Order(ServiceRequest). The Consumers of the form have a few options based on their EMR integration:<br>\n1) Print the form and fill out manually<br>\n2) Load and render the form in EMR, populate then print out form<br>\n3) All managed in EMRs electronically</p>\n<p>As a form can contain simple questions or orders would it make sense to define Questionnaire.items.definition to reference a ServiceRequest and/or Task \"template\" that the consuming EMR would need to manage (or ignore if just printing)</p>\n<p>Thanks<br>\nDon</p>",
        "id": 160890016,
        "sender_full_name": "Don Langlois",
        "timestamp": 1552667148
    },
    {
        "content": "<p>The Questionnaire is a definition - it spans all patients and all time, so it couldn't point to a patient and time-specific resource like Task or ServiceRequest.  A QuestionnaireResponse could point to a Task or ServiceRequest and indicate that the response was created based on a particular order or task.</p>",
        "id": 160892206,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552668666
    },
    {
        "content": "<p>Thanks,<br>\nAgree, however a form creator could create their forms and store in repository for consumption by form users (at any point in time).  If the form template that the creator developed needs to inform the receiver that an order needs to be generated when it gets filled in, where could this be defined. </p>\n<p>A hypothetical example could be a MI Questionnaire with a section for CT Scan if question \"xyz\" is true.  The form itself is just a template at this stage, the form user/consumer when they retrieve and fill in the form would need to be informed that part of the Questionnaire needs to generate a ServiceRequest.</p>\n<p>Sorry hope my descriptions make sense :)</p>",
        "id": 160892762,
        "sender_full_name": "Don Langlois",
        "timestamp": 1552669100
    },
    {
        "content": "<p>So you're wanting to trigger the creation of orders based on questionnaire answers?  To do that properly, you'd probably be looking at a separate PlanDefinition that had triggers based on information in the QuestionnaireResponse.  I suppose you could shortcut that with an extension in the Questionnaire.</p>",
        "id": 160893995,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552669970
    },
    {
        "content": "<p>Not necessarily, that scenario was just used that as example.  The form could be a generic lab requisition that gets stored in repository as \"template\".  Users would retrieve the form and fill in required information but since the form is a requisition they need to generate an Lab Order.  Currently providers would just print it out once filled, however to send electronically would need way to inform system to create additional resources.</p>",
        "id": 160894494,
        "sender_full_name": "Don Langlois",
        "timestamp": 1552670352
    },
    {
        "content": "<p>Take a look at the Structured Data Capture implementation guide - it provides guidance for how to transform a QuestionnaireResponse into other FHIR resources.</p>",
        "id": 160894692,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552670471
    },
    {
        "content": "<p>Thanks</p>",
        "id": 160902093,
        "sender_full_name": "Don Langlois",
        "timestamp": 1552675400
    }
]