[
    {
        "content": "<p>Hi.</p>\n<p>Our use case is to request  a practitioner for information regarding a patient. We would like the requester to dynamically build a Questionnaire by selecting from a pre-defined pool of questions (or groups).</p>\n<p>After reading the spec. my understanding is that this can be done by implementing the questions as ElementDefinitions in StructureDefinitions, but there are no examples of this and I'm having a hard time understanding how this should be done.<br>\nIt also seems that defining questions as ElementDefinitions is completely different to defining them inline, and that the definition-reference only represents a global-identifier, since all the question's properties still have to be added to the questionnaire (and can even be different).</p>",
        "id": 230834566,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616059973
    },
    {
        "content": "<p>SDC is working to develop an operation that will allow a Questionnaire defined only with item.definition values to grab the relevant other metadata (question text, cardinality, etc.) from the associated definition and flesh out a 'full' Questionnaire.  Unfortunately it (and the examples that go with it) aren't done yet.</p>",
        "id": 230862624,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616074188
    },
    {
        "content": "<p>I've read the SDC IG and the topics describing auto 'populate' of the QuestionnaireResponse. Auto generation/population of items from definitions in a Questionnaire is not mentioned, but this is being worked on? Do you have any links, threads or info. regarding this?</p>\n<p>I understand that we have to implement the generation of 'full' Questionnaires from ElementDefinitions ourselves, as this is not something otherwise understood by the official validator. But I do not understand how a Question/Item should be modelled in a StructureDefinition, the only mentioning of ElementDefinition in the SD is as the type of the snapshot and differential properties, which from my understanding should be autogenerated and not edited manually.<br>\nIf someone could provide me an example on how to model a question as an ElementDefinition within a StructuereDefinition as <a href=\"https://www.hl7.org/fhir/questionnaire.html#definition\">described in the spec</a> that would be very much appreciated.</p>",
        "id": 230868097,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616076137
    },
    {
        "content": "<p>\"populate\" is different - that's about producing a QuestionnaireResponse.  The operation to 'expand' a Questionnaire currently just exists as a Jira ticket.</p>\n<p>In terms of how to represent a Question in a structure definition, you have a choice of pointing to an element in an existing resource or profile (using [canonicalUrl]#[elementId] or possibly [canonicalUrl]|[version]#[elementId]) or of defining a logical model - which can contain any arbitrary collection of data elements you like.  When you 'expand' the Questionnaire, you map elements as described <a href=\"http://build.fhir.org/questionnaire.html#definition\">here</a>.</p>",
        "id": 230870876,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616077157
    },
    {
        "content": "<p>Maybe I worded myself poorly, or there is something fundamental I have misunderstood.</p>\n<p>From the spec:</p>\n<blockquote>\n<p>The URL refers to an ElementDefinition in StructureDefinition</p>\n</blockquote>\n<p>Ok, if I look at <a href=\"https://www.hl7.org/fhir/structuredefinition.html#resource\">the structure of the StructureDefinition</a> I only see 2 properties of type ElementDefinition:  'snapshot' and 'differential'. Should the URL point to an entry of one of those?</p>\n<p>The spec then goes on to provide a list of URL examples e.g.:</p>\n<blockquote>\n<p><a href=\"http://hl7.org/fhir/StructureDefinition/Observation#Observation.comment\">http://hl7.org/fhir/StructureDefinition/Observation#Observation.comment</a></p>\n</blockquote>\n<p>Ok, I would expect 'comment' to be a property or the id of a property of type ElementDefinition, but it is not even part of the <a href=\"http://hl7.org/fhir/R4/observation.html#resource\">Observation - StructureDefinition</a>, what does it reference?</p>",
        "id": 230878187,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616079727
    },
    {
        "content": "<p>When you refer to an element, you're generally referring to the snapshot.  The differential describes the differences in that element between the current model and the base.</p>\n<p>You need to go look at the ElementDefinition data type to see 'comment' - and all of the other properties of an element</p>",
        "id": 230880641,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616080444
    },
    {
        "content": "<p>Ok, so the 'definition' property of an item within a Questionnaire is a reference to an entry of the 'snapshot' property of type ElementDefinition within a StructureDefinition.</p>\n<p>But I'm still confused.<br>\nUsing the provided example; <a href=\"http://hl7.org/fhir/StructureDefinition/Observation#Observation.comment\">http://hl7.org/fhir/StructureDefinition/Observation#Observation.comment</a>. This would point to the 'comment' property of the Observation's ElementDefinition, which is of type 'markdown' (not ElementDefinition). Is this just a bad example when used in context of Questionnaire items?<br>\n<a href=\"/user_uploads/10155/rQDGIn5-B77yWdLKlCeuhayd/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/rQDGIn5-B77yWdLKlCeuhayd/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/rQDGIn5-B77yWdLKlCeuhayd/image.png\"></a></div>",
        "id": 230884424,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616081638
    },
    {
        "content": "<p>Ah, I see what you're talking about now.  Yes, that example is broken.  (Observation.comment got renamed to Observation.note late in the process.)  Can you submit a change request for us to fix the example?</p>",
        "id": 230888621,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616082953
    },
    {
        "content": "<p>Sure, can do. EDIT: I do not have a Jira user and it says I need to contact an administrator. Is this something you can provide?</p>\n<p>Back to mye original question: To create a reusable Question definition I would have to create a StructureDefinition (SD) and generate the Snapshot using e.g. Forge or Shorthand. However, what will this SD consist of? So far I've done profiling of Resources , DataTypes, and Extensions to create SDs, but how would I go about creating a SD which only purpose is to describe a general Question to be used in Questionnaires.</p>",
        "id": 230894539,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616084387
    },
    {
        "content": "<p>If you go to <a href=\"http://jira.hl7.org\">jira.hl7.org</a>, you should be able to register for an account.  A human will review and make sure you seem like a real human being and will then approve your account.</p>\n<p>As I said, you have a choice.  You could point to an existing profile - e.g. the body temperature one in the core spec, and just refer to the Observation.value element.  However, in most cases you'll probably want to define one of your own so that you can have better control over the question text (and maybe other elements).  In addition to being used to define and profile resources, data types, and extensions, StructureDefinition also allows the definition of logical models.  With a logical model, you're free to define whatever elements you like in what ever order or organization you wish - no need to align with any FHIR-defined data types or resources.  Typically you'd define a logical model that contained all of the possible questions and then draw on those with your particular questionnaire.  However, having multiple StructureDefinitions with different subsets of questions or even a separate StructureDefinition per question would also be possible.</p>",
        "id": 230902546,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616087341
    },
    {
        "content": "<p>Ok, I guess I will have to read up on how to define and use a LogicalModel, as this is something I am not familiar with. Once I have something representing a question I will probably post it here to maybe get some sort of feedback that I am using the spec. correctly.</p>\n<p>Thanks a lot <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I very much appreciate your feedback.</p>",
        "id": 230912345,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616090847
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179255-questionnaire/topic/ElementDefinition.20for.20question.20pool/near/230870876\">said</a>:</p>\n<blockquote>\n<p>When you 'expand' the Questionnaire, you map elements as described <a href=\"http://build.fhir.org/questionnaire.html#definition\">here</a>.</p>\n</blockquote>\n<p>That mapping does not seem to include item.text.  Where is that pulled in from?</p>",
        "id": 230918294,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1616093261
    },
    {
        "content": "<p>ElementDefinition.label.  We have a change request to fix that in the documentation.</p>",
        "id": 230930327,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616098468
    },
    {
        "content": "<p>A couple of questions after having tried to create a LogicalModel and re-read the spec. with new insight.</p>\n<ol>\n<li>The spec. says that the 'item.type' should be deferred from 'ElementDefinition.type'. However, 'item.type' must be from the <a href=\"https://www.hl7.org/fhir/valueset-item-type.html\">item-type value-set</a>, while 'ElementDefinition.type' must be a <a href=\"https://www.hl7.org/fhir/valueset-defined-types.html\">fhir-defined-type</a>. How would someone model e.g. a question-group or open-choice?</li>\n<li>I have come to realize that I probably have misread the spec.. My understanding was that when using the 'item.definition' property it MUST reference an ElementDefinition. However, am I correct to now understand that this is only a suggestion/example? The URL can be a canonical-URL identifying a definition in some proprietary format?</li>\n</ol>",
        "id": 230996880,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616146914
    },
    {
        "content": "<p>If you go to <a href=\"http://jira.hl7.org\">jira.hl7.org</a>, you can easily request an account, but even without an account it will still let you search and browse issues.  If you search for \"item.definition\", you will see several resolved by unapplied issues-- some might be relevant.<br>\nRegarding #2, if you do something proprietary, it won't be interoperable with other systems.  (Also if, you are going to do that, it would be better to put it into a custom extension.)  Issue <a href=\"http://jira.hl7.org/browse/FHIR-23765\">FHIR-23765</a> says item.definition can also point to an ObservationDefinition (though  I don't know whether that helps you).</p>",
        "id": 231012511,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1616155683
    },
    {
        "content": "<ol>\n<li>Question groups would be elements that have child elements rather than a simple type.  Choice would be elements of type code/Coding/CodeableConcept.  Whether the choice is 'open' or not would be driven by the binding strength</li>\n<li>I don't see any language that says it can be anything else, and lots of language that's pretty clear it must be an ElementDefinition in a StructureDefinition.  What are you seeing that suggests otherwise?</li>\n</ol>",
        "id": 231020870,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616159976
    },
    {
        "content": "<p>Ok, so my first interpretation was correct; it MUST be a reference to an ElementDefinition within a StructureDefinition. It is pretty clear that it should be, but I guess what made me uncertain was the examples using LOINC codes which do not directly reference ElementDefinitions.<br>\nI mentioned this in my first post, but I believe adding examples of questions defined using ElementDefinitions to the specification would be very helpful.</p>\n<p>One more thing; how should 'item' Extensions be modeled in ElementDefinitions? '<a href=\"http://hl7.org/fhir/StructureDefinition/maxValue\">http://hl7.org/fhir/StructureDefinition/maxValue</a>' can be deferred from e.g. 'maxValueInteger', but what about '<a href=\"http://hl7.org/fhir/StructureDefinition/questionnaire-signatureRequired\">http://hl7.org/fhir/StructureDefinition/questionnaire-signatureRequired</a>' and others?</p>",
        "id": 231028851,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616163344
    },
    {
        "content": "<p>At present, we don't have specific guidance on those.  Probably the best solution is to allow all extensions that can appear on Questionnaire.item to also be allowed to appear on ElementDefinition.  Can you submit a change request for us to update them?</p>",
        "id": 231029306,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616163521
    },
    {
        "content": "<p>Sure</p>",
        "id": 231031498,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1616164343
    }
]