[
    {
        "content": "<p>Another question relating the questionnaires from an implementer: Would it be possible to make a particular answer (or a few) secure such that they can only be read by a narrow intended audience, perhaps those that the patient gives an access token to (by various methods).</p>\n<p>This means that a questionnaire could have a confidential section that the patient has confidence will only be read by their actual treating physician, not by anyone involved in the workflow</p>",
        "id": 272345339,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645145029
    },
    {
        "content": "<p>Would that (and hashing/salting) make sense as FHIRPath functions?</p>",
        "id": 272351391,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1645150234
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, this is a workflow that <span class=\"user-mention\" data-user-id=\"235060\">@Grey Faulkenberry</span> are actively considering on a project. In one of our Questionnaires, the first question asks how (or if) this can be shared. Based on the answer choice, we are tentatively planning to add <a href=\"https://www.hl7.org/fhir/security-labels.html\">security labels</a> to the questionnaire as a whole...though individual security tags was another option we had considered.</p>\n<p><span class=\"user-mention\" data-user-id=\"194192\">@Richard Stanley</span> I believe the means by which the security label would be applied (or whatever is applied to the individual question...) is being scripted via a FHIRPath function. That's our plan at least</p>",
        "id": 272353035,
        "sender_full_name": "John Manning",
        "timestamp": 1645151789
    },
    {
        "content": "<p>well, there's two parts of this - what's the instruction on the questionnaire response, and the other is, how do you ensure by secrets that people cannot ignore the instruction</p>",
        "id": 272389751,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645183432
    },
    {
        "content": "<p>Agreed.</p>",
        "id": 272400550,
        "sender_full_name": "John Manning",
        "timestamp": 1645190484
    },
    {
        "content": "<p>No capability defined right now.  Presumably we could define an extension that would allow the question to be flagged and define an extension for the answer to contain the 'encrypted' content.  Is it sufficient to hide the answers, or do we need to hide the fact that certain questions were answered at all or how many answers were provided?</p>",
        "id": 272413539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645197256
    },
    {
        "content": "<p>Also, we'd need some expertise on how to perform the encryption of very short elements distributed throughout a form in a 'secure' manner.</p>",
        "id": 272413599,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645197302
    },
    {
        "content": "<p>An alternative is to not encrypt anything, but instead have extensions that flag certain answers as sensitive - which would then cause the generic \"data filtering\" capabilities of the server to be enforced based on who queries the data.</p>",
        "id": 272413741,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645197364
    },
    {
        "content": "<p>(That's a technically simpler solution, provided that the patient trusts the server to control access - which is what we do everywhere else.)</p>",
        "id": 272413780,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645197395
    },
    {
        "content": "<p>I understand this question is coming up in the context of questionnaires, but do we think this is a unique set of requirements related to questionnaires as opposed to other aspects of the health record?</p>",
        "id": 272414472,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645197708
    },
    {
        "content": "<p>In other words, end to end encryption and granular element level access controls seem like helpful capabilities regardless of what FHIR resource you might be using to share information.</p>\n<p>In a closed ecosystem where you are just submitting the data to one organization and trusting them to manage it correctly internally (giving the right views to the right internal users), standardizing the implementation don't matter much because the patient can't really audit or verify what's happening on the inside and they have to trust the recipient to do the right thing.</p>\n<p>In more open architectures where data are being communicated across multiple boundaries and the originator has a good understanding of the identities and roles of end users in the target system, this analysis changes.</p>",
        "id": 272415018,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645197970
    },
    {
        "content": "<p>well, my analysis before this has been that end-to-end crypto is something that happens in the infrastructure, outside the resources, and not something we need to be particularly concerned with. E.g. the entire resource is secure, or not. Or an entire CDA document is token protected. The Australian national system can be used that way, and we've got experience with the design decisions and trade-offs involved.</p>\n<p>What's different about this case is that <em>some</em> of the content of the resource needs protection, but other parts of the resource need to be not protected. We haven't - to my knowledge - encountered this before. Questionnaire isn't unique in this regard, but it does feel more likely to be the subject of this question due the opportunity for semantic range of the content in a QR.  Also, unlike other resources, where the access controls are likely to be baked into the system, with Q/QR, the access controls would have to be based on metadata in the Q/QR</p>",
        "id": 272461375,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645220563
    },
    {
        "content": "<p>the case in question is mental health referrals, btw.</p>",
        "id": 272461449,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645220621
    },
    {
        "content": "<p>But is it an open ecosystem where the client filling out the questionnaire is going to be submitting it to one of many different provider systems, and knows the end-user public keys for all of the clinicians who might need to read the data? This is a very unusual context in my experience.</p>",
        "id": 272462957,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645221398
    },
    {
        "content": "<p>My question about whether the encryption needs to be only the answers, or whether the fact there were answers (and how many answers there were) was sensitive.  In either case, the encrypted extension and removal of the answers is going to play havoc with validation.</p>",
        "id": 272465123,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645222476
    },
    {
        "content": "<p>Perhaps modular Questionnaires could result in modular QuestionnaireResponses, and the high confidentiality response would have different security labels applied than the lower confidentiality response.</p>",
        "id": 272467016,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1645223396
    },
    {
        "content": "<p>Or the entire response is given high-confidentiality, but the derived Observations, etc. are given varying confidentiality.</p>",
        "id": 272467220,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1645223503
    },
    {
        "content": "<p>Yeah, the potential solution space here is vast. It's worth writing down assumptions about UX, information flow, and pre-coordination of trust relationships before solving this.</p>",
        "id": 272467351,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645223554
    },
    {
        "content": "<p>Maybe a mini-workshop on this topic.</p>",
        "id": 272467366,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645223563
    }
]