[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> and I were discussing whether a Questionnaire author should expect a form renderer to look in a contained ValueSet's \"compose\" element to determine the expansion.  In the case in question, the \"compose.include\" section directly listed a few codes, so it is technically not a challenge to figure out the expansion (unless there is also \"filter\").  However, the LHC-Forms renderer expects that for a contained ValueSet, one or more of the following is true:</p>\n<p>1) there is some FHIR context (e.g. provided by SMART on FHIR) that be queried to obtain the expansion<br>\n2) a preferred-terminologyServer extension is present to indicate where to get the expansion<br>\n3) the ValueSet itself contains the \"expansion\" element.</p>\n<p>I am curious as to what other people think about how a renderer should expect to get the expansion, and I think the documentation should be clarified on that point.</p>",
        "id": 243841378,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1624566314
    },
    {
        "content": "<p>The discussion was around entensionally defined valuesets. Extensionallydefined valuesets have the codes already in. In that case, and only in cases the valueset is only extensionally defined, the concepts in the expansion are(?) the same as the concepts in the compose.include</p>",
        "id": 243841748,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624566507
    },
    {
        "content": "<p>well, not entirely. A server doing $expand will check that the concepts actually exist</p>",
        "id": 243841990,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624566638
    },
    {
        "content": "<p>I don't know but perhaps the $expand may also bring designations in different languages if they exist..?</p>",
        "id": 243842092,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624566700
    },
    {
        "content": "<p>well, yes, you will (or should) get language support from a terminology server</p>",
        "id": 243842176,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624566729
    },
    {
        "content": "<p>From what I learned last week, the question for me is: does the author need to have any concerns about which type of valueset to populate?</p>",
        "id": 243842286,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624566800
    },
    {
        "content": "<p>I learned it's ok - and better - to pass everything through the $expand - but does this affect the author's expectations or actions?</p>",
        "id": 243842334,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624566825
    },
    {
        "content": "<p>In other words, is a questionnaire author expected to need expand such a valueset him/herself, or is that something for (whatever) toolchain?</p>",
        "id": 243849017,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624570012
    },
    {
        "content": "<p>My expectations would be if the expansion is there that should be used, otherwise send to terminology server.<br>\nAnd control dependant usage of filter parameter too.</p>",
        "id": 243857101,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624575776
    }
]