[
    {
        "content": "<p>How we can maintain an array of integers in a fhir extension of R4 version?</p>",
        "id": 233316042,
        "sender_full_name": "Nagarjuna Pechetti",
        "timestamp": 1617714884
    },
    {
        "content": "<p>You can't - in any version of FHIR.  If you want an array of integers, you'll have an array of extensions, each having a single integer value.</p>",
        "id": 233349004,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617726193
    },
    {
        "content": "<p>What is your use-case?</p>",
        "id": 233349018,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617726200
    },
    {
        "content": "<p>Thanks for the Reply <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>. My use-case is: I Have score for every answer option of type multiple answer question like Check-box in Questionnaire resource. Now for the answer options  I want to perform operations like Average of scores or Max/Min score of all the answers using Aggregates (<a href=\"http://hl7.org/fhirpath/#aggregates\">http://hl7.org/fhirpath/#aggregates</a>). I was able to write the valueExpression Extension to get the score individually, but not in a single extension to perform Aggregation. </p>\n<p>Is there any way that I can perform Aggregation when they are in separate Extension?</p>",
        "id": 233355808,
        "sender_full_name": "Nagarjuna Pechetti",
        "timestamp": 1617728983
    },
    {
        "content": "<p>If you have a score per answer, that sounds like you should be capturing an ordinalValue for each coded answer (there's a standard extension for that).  FHIRPath should be able to aggregate across all of the ordinalValue values</p>",
        "id": 233367713,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617734228
    },
    {
        "content": "<p>Aggregations simply operate against whatever's in the collection - and the collection is whatever's reachable with the path.</p>",
        "id": 233367775,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617734256
    }
]