[
    {
        "content": "<p>In Grahame's blog post coming out of the Boston session, he had a number of extensions.  The names of most of those extensions will need to change because they're scoped by questionnaire and all of those will start with \"questionnaire-\".  As I was going through doing that, I was wondering about changing the name of \"form-filler-parameter\" to \"questionnaire-context\".  Passing in these parameters won't necessarily only be relevant for form popluation.  It could also drive dropdowns for Reference parameters, or possibly enableWhen logic.  As well, this sort of behaves like the \"context\" that gets passed into CDS Hooks or SMART apps.  If anyone doesn't like the name change, please holler in the next 24 hours...</p>",
        "id": 153985196,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533960777
    },
    {
        "content": "<p>what would the definition be?</p>",
        "id": 153985198,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533960969
    },
    {
        "content": "<p>Resources that provide context for form completion that are used in form processing logic (pre-population, flow-control, drop-down selection, etc.) when completing a QuestionnaireResponse</p>",
        "id": 153985205,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533961537
    },
    {
        "content": "<p>context for form <em>completion</em> - can it be 'processing'? 'support'?</p>",
        "id": 153985217,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533963287
    },
    {
        "content": "<p>I'm ok with the name context</p>",
        "id": 153985218,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533963293
    },
    {
        "content": "<p>Resources that provide context for form processing logic (pre-population, flow-control, drop-down selection, etc.) when creating/displaying/editing a QuestionnaireResponse</p>",
        "id": 153985349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533998120
    },
    {
        "content": "<p>I also want to change populated-value to questionnaire-initialExpression.  It's taking the place of the initial.value element, so it would be good to keep the name aligned.</p>",
        "id": 153985354,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533999852
    },
    {
        "content": "<p>that's not so good for me because if it's attached to score, it's applied each time the score changes, not just choosing the initial value</p>",
        "id": 153985370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534005889
    },
    {
        "content": "<p>No, there's a different extension for that</p>",
        "id": 153985383,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534008378
    },
    {
        "content": "<p>One for initial value (for pre-pop) that can be overridden/changed by the user.  And one for calculated that will keep changing as other questions have their values change</p>",
        "id": 153985384,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534008415
    },
    {
        "content": "<p>right. but the extension for tieing the value to the item is the same</p>",
        "id": 153985389,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534009366
    },
    {
        "content": "<p>You had two different extensions in your blog - populate-value and questionnaire-calculated-value</p>",
        "id": 153985391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534009696
    },
    {
        "content": "<p>And I think it needs to be two different extensions.  The behavior is different</p>",
        "id": 153985392,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534009715
    },
    {
        "content": "<p>you have misinterpreted it then. The calculated value is the twin of variable, not populate-value</p>",
        "id": 153985393,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534009787
    },
    {
        "content": "<p>Why would you need another extension to calculate and not populate?</p>",
        "id": 153985394,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534009845
    },
    {
        "content": "<p>You need a different extension for initialValue vs. calculateValue for population.  The first can be overridden and doesn't change after a one-time determination.  The latter continuously changes and will overwrite anything the user changes it to (and thus will usually be marked read-only)</p>",
        "id": 153985396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534009909
    },
    {
        "content": "<p>because you calculate the score at the level where it has access to the sub-parts that affect the score, which is not necessarily the level at which the item lives. We had a big long discussion about that</p>",
        "id": 153985397,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534009935
    },
    {
        "content": "<p>there's no question you need a different extension</p>",
        "id": 153985398,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534009961
    },
    {
        "content": "<p>Right - but the calculation of the score is just another variable</p>",
        "id": 153985401,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534010314
    },
    {
        "content": "<p>We only need one variable extension - whether it's querying stuff or calculating stuff.  But we need two extensions for population.</p>",
        "id": 153985403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534010366
    },
    {
        "content": "<p>Ended up changing most of the extension names.  And it turns out we never actually approved the Boston proposal in a change request, so I've created one and applied it.  Proposed names can be seen here: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17665\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17665\">GF#17665</a></p>",
        "id": 153985410,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534011459
    },
    {
        "content": "<p>I think I'm ok with making the difference on the binding rather than on the variable.</p>",
        "id": 153985411,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534012018
    },
    {
        "content": "<p>The change to questionnaire-observationLinkPeriod in <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17665\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17665\">GF#17665</a> does not look right to me, or at least I disagree with comment next to it that says, \"because it's not creating a link, it's specifying a period\".  The point of questionnaire-observation-link as I understand it was to create a link to a particular Observation, and the period part was just the means of specifying which Observation.</p>",
        "id": 153985820,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1534175776
    },
    {
        "content": "<p>it is just specifying how long the look back period is</p>",
        "id": 153985828,
        "sender_full_name": "Eric Haas",
        "timestamp": 1534176505
    },
    {
        "content": "<p>The linkage is through the Questionnaire.item.code</p>",
        "id": 153985831,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534176885
    },
    {
        "content": "<p>Questionnaire.item.code does not specify that there is a link to an Observation.  It is the presence of the extension that indicates such a link exists and defines what the link is to.</p>",
        "id": 153985837,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1534178332
    },
    {
        "content": "<p>The extension indicates that the link exists, but it doesn't indicate what the link is to - that's done by the code.  The extension just communicates the duration</p>",
        "id": 153985843,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534179248
    },
    {
        "content": "<p>Well, since there can be multiple observations with the same code, I think the period is just as essential as the code in defining what the link is to.  Anyway, to get back to what my original comment said, I think that the comment in the ticket that says \"because it's not creating a link\"  is the part that I most object to.  Since you just wrote, \"The extension indicates that the link exists\", perhaps we can agree that that comment (about it not creating the link) will not show up in the description for the extension, and then I am okay with leaving the name as questionnaire-observationLinkPeriod.</p>",
        "id": 153985844,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1534180090
    },
    {
        "content": "<p>I wasn't planning to include anything that indicated it wasn't creating a link.</p>",
        "id": 153985886,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534189912
    },
    {
        "content": "<p>I think paul is right: the presence of the assertion about the link period implicitly defines that there is an operational link rather than this just a definition link</p>",
        "id": 153986065,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534209598
    },
    {
        "content": "<p>Understand.  It does establish the link, but the value is not the link.  Neither the old name nor the new one are super-intuitive about what the extension actually does...</p>",
        "id": 153986091,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534213196
    }
]