[
    {
        "content": "<p>If I you have question at that allows multiple selections (repeats=true, i.e. , checkboxes or a multi-select list), and observationLinkPeriod is set, should that be extracted as multiple Observations, or as one Observation with multiple components?  If the latter, then would Observation.code and the Observation.component.codes all have the same values (the question code)?</p>",
        "id": 167397710,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1559746906
    },
    {
        "content": "<p>It probably depends on the conventions for that Observation.  Typically, I'd say they should be separate Observations</p>",
        "id": 167397909,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559747016
    },
    {
        "content": "<p>I can't imagine general-purpose code that handles data extraction from a QuestionnaireResponses knowing about conventions for particular Observations.  It will be always one way or the other.  I am not pushing for using component, but the <a href=\"https://www.hl7.org/fhir/observation.html#gr-comp\" target=\"_blank\" title=\"https://www.hl7.org/fhir/observation.html#gr-comp\">section on Observation.component</a> says a use case is \"Representing multiple answers to a question\".</p>",
        "id": 167399123,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1559747743
    },
    {
        "content": "<p>It'd have to be determined by the questionnaire author and is driven by what's useful/typical for that particular Observation.</p>",
        "id": 167400191,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559748397
    },
    {
        "content": "<p>How would a Questionnaire author specify a preference as to whether the observationLinkPeriod extraction resulted in multiple Observations or multiple Observation.components?</p>",
        "id": 167400659,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1559748703
    },
    {
        "content": "<p>Using the \"Observation period\" approach, I don't think we provide any support for Observation.components at all - every repetition would have to be a separate Observation.  Using one of the other mechanisms would allow you to map to components and/or other elements.</p>",
        "id": 167412371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559756661
    }
]