[
    {
        "content": "<p>If I save a QuestionnaireResponse and its extracted Observations, HAPI FHIR does not allow me to then delete the QuestionnaireResponse unless I also delete the Observations (which are associated with the response via the \"derivedFrom\" field).  Is that really the desired behavior?</p>",
        "id": 166476139,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1558721209
    },
    {
        "content": "<p>I don't think so...  <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> ?</p>",
        "id": 166476334,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558721392
    },
    {
        "content": "<p>The public HAPI FHIR server does enforce referential integrity. This seems like good behaviour to me, why would you want to allow people to delete data that other data references?</p>\n<p>There is a setting in HAPI FHIR to disable this on self hosted servers though. </p>\n<p>I've been thinking it might be nice to have a \"delete and cascade\" function though to help with cleanup processes..</p>",
        "id": 166477713,
        "sender_full_name": "James Agnew",
        "timestamp": 1558722351
    },
    {
        "content": "<p>In the case, the reason is that I used a Questionnaire for the purpose of creating Observations, and then I wanted to delete the QuesionnaireRepsonse so it didn't show up in the client application.  However, I wanted to leave the Observations around for pre-popluation.  I am not sure this counts as a real use-case though.</p>",
        "id": 166478975,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1558723172
    },
    {
        "content": "<p>If you're intending to delete the QRs, why are you creating other resources with links to it though..? Wouldn't it make more sense to not create those links? Or to use canonical references instead?</p>",
        "id": 166486286,
        "sender_full_name": "James Agnew",
        "timestamp": 1558728741
    },
    {
        "content": "<p>The SDC spec (<a href=\"http://hl7.org/fhir/uv/sdc/2019May/extraction.html\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/sdc/2019May/extraction.html\">http://hl7.org/fhir/uv/sdc/2019May/extraction.html</a>) says \"Observation.derivedFrom - set to a reference to the QuestionnaireResponse\".   It looks like QuestionnaireResponses are not one of the resources that have canonical URLs (<a href=\"https://www.hl7.org/fhir/resource.html#canonical\" target=\"_blank\" title=\"https://www.hl7.org/fhir/resource.html#canonical\">https://www.hl7.org/fhir/resource.html#canonical</a>).</p>",
        "id": 166489084,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1558731057
    },
    {
        "content": "<p>I do wonder what the value of having 'derivedFrom' is if you're going to delete the questionnaire response</p>",
        "id": 166489987,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558731788
    },
    {
        "content": "<p>Well, I suppose it lets you know that a certain set of Observations were all generated from the same QuestionnaireResponse.</p>",
        "id": 166492635,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1558733771
    },
    {
        "content": "<p>why not keep the QR then?</p>",
        "id": 166492648,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558733794
    },
    {
        "content": "<p>I was trying to get rid of clutter.  After a lot of testing, my client was showing a large number of QuestionnaireResponses, about half of which had Observations.  I wanted to keep the Observations around for pre-population (for further demos and testing).  Anyway, I have now changed my delete process to delete any associated Observations first.  I just have to be careful not to delete the last QR of its type.</p>",
        "id": 166492904,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1558734025
    },
    {
        "content": "<p>so it's a limitation in the resource model. I want you only to show QRs that haven't been post-processed.... but post-processing recording is not a feature of the QR. I guess that I would use tags (Resource.meta.tag) for this use case</p>",
        "id": 166493000,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558734161
    },
    {
        "content": "<p>The other thing would be when you are Deleting that QR, scan for all those obs, then update them to remove the reference, or update it to derivedFrom.identifier (and maybe update display), rather than derivedFrom.reference.<br>\nThen delete the QR, this would give you the best of both worlds, still having the Obs, the \"logical link\" to the non existing QR, and noQR baggage.</p>",
        "id": 246302769,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1626494284
    }
]