[
    {
        "content": "<p>Is there an already existing FhirPath HL7 extension for Questionnaire.item for which I can use to add a feature to dynamically populate the Questionnaire based on the current run-time environment/context. The concept is similar to the intial attribute, but instead I want this to be a dynamic feature by using the data from other FHIR resources based on the current run-time environment/context of the Questionnaire.</p>\n<p>I found this: <a href=\"https://www.hl7.org/fhir/2017Jan/extension-structuredefinition-expression.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/2017Jan/extension-structuredefinition-expression.html\">https://www.hl7.org/fhir/2017Jan/extension-structuredefinition-expression.html</a>, but I can't find this in the official STU3 specification</p>",
        "id": 153970249,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529321991
    },
    {
        "content": "<p>You're trying to define a custom set of options for a 'choice' item or you're trying to define allowed values for a 'Reference' item?</p>",
        "id": 153970250,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529322715
    },
    {
        "content": "<p>I would like to do something along the lines of : <em>Questionnaire.item.fhirpath = \"Patient.name.select(given &amp; ' ' &amp; family)\"</em>, then based on that I would extract the data, based on some kind of context, and populate the answer in QuestionnaireResponse. Our scenario is probably an edge case, but I was wondering if there was an extension in the official extension registry that could kind of fit our scenario.</p>",
        "id": 153970261,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529325471
    },
    {
        "content": "<p>The quick answer is \"not yet, but we hope to have one in the next 1-2 months\".  Standardized mechanisms for populating a Questionnaire and for extracting data from a questionnaire, including scenarios like the one you listed, will be one of the discussion topics for DevDays this week and the SDC implementation guide will be trying to nail down that guidance before we lock things down for ballot in mid-August.</p>",
        "id": 153970262,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529325764
    },
    {
        "content": "<p>Great, thanks!</p>",
        "id": 153970263,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1529327067
    }
]