[
    {
        "content": "<p>I'm new to FHIRPath. I would be grateful if anyone could point me to some C# examples. Thanks in advance.</p>",
        "id": 214914401,
        "sender_full_name": "David Fallas",
        "timestamp": 1603931617
    },
    {
        "content": "<p>Usage in what way?</p>",
        "id": 214922887,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1603942275
    },
    {
        "content": "<p>This is likely way more complicated than you need given that it handles multiple versions concurrently, but might give some clues.<br>\n<a href=\"https://github.com/brianpos/FhirPathTester/blob/develop/WPF/FhirPathProcessor.cs\">https://github.com/brianpos/FhirPathTester/blob/develop/WPF/FhirPathProcessor.cs</a></p>",
        "id": 214922962,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1603942393
    },
    {
        "content": "<p>That project (well the UWP version) is the source for the app in the Windows App Store<br>\n<a href=\"https://www.microsoft.com/store/productId/9NXV8QDQ154V\">https://www.microsoft.com/store/productId/9NXV8QDQ154V</a></p>",
        "id": 214923033,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1603942514
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> - that gives me some clues to get started. </p>\n<p>What I am aiming for is comprehensive unit and integration testing of Questionnaire instances. Editing these can be challenging, and mistakes are easily made. I need tests that can reach into every nook and cranny to generate QuestionnaireResponse instances that contain all the correct default (Initial) values that the Questionnaire provides. My Questionnaire instances are not particularly complex but in some places can be up to 7 or 8 levels deep so inserting a new Item at level 6, with a choice of Initial values dependent on some condition elsewhere in the Questionnaire, can be fraught.</p>\n<p>I am hoping that FHIRPath will enable tests to programmatically traverse a target Questionnaire, enabling/activating disabled/inactive elements whilst progressively generating an appropriate QuestionnaireResponse as it goes.</p>",
        "id": 215010630,
        "sender_full_name": "David Fallas",
        "timestamp": 1603997030
    }
]