[
    {
        "content": "<p>Hallo everyone!</p>\n<p>The company i work for and me are new to FHIR. We want to build some questionnaires. I tried some things out, just with an editor and the LHC-Form App. I wrote the questionnaires just as json file and it worked pretty good. But in the meeting today they said we would need it \"real\" as own profil done with Forge. Im kind of confused because it seems not common to do it that way, but why? If i open Questionnaires Profil as new own profil (\"MyQuestionnaire\") in Forge i can slice the \"item\" in multiple items in the element tree and i could name them like our questions and so on. This way i could do for every questionnair we need an extra profil. Just like most nations do it for their own patient profils.</p>\n<p>Please tell me why its unusual to do so and whats the common way.<br>\nThank you!</p>\n<p>Important: We're not using a fhir server, because our system is already \"old\" and in use. We have our questionnaires already as html forms ready to fill out for the user. We are (for the moment) just updating our system to fhir conform terms to save patients data and answers fhir profile structured. For the patients data we're using the patients profil for our nation, but we're divided how to save the answers. In own written questionnair response profils or is there a \"better\" way?</p>",
        "id": 168497050,
        "sender_full_name": "Julia Schönmann",
        "timestamp": 1560943068
    },
    {
        "content": "<blockquote>\n<p>in the meeting today they said we would need it \"real\" as own profil done with Forge</p>\n</blockquote>\n<p>Which meeting? Not for questionnaire, anyway. There's few valid reasons to <em>profile</em> questionnaire with Forge.</p>",
        "id": 168499800,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560945871
    },
    {
        "content": "<p>just a small meeting in our company. as already said we are all new to fhir, sorry for the many questions.<br>\nSo theres no need for profiling questionnair and questionar-response? We could just use questionnair-jsons (\"resourceType\": \"Questionnaire\") ?<br>\nBut how to validate then \"foreign\" (from another system) questionnair answers?<br>\nAnd what are that few valid reasons for profiling with forge?</p>",
        "id": 168502854,
        "sender_full_name": "Julia Schönmann",
        "timestamp": 1560948564
    },
    {
        "content": "<p>there might be grounds for profiling question so that you can say rules that are common for all questionnaires. But mostly you just write a questionnaire...</p>",
        "id": 168503114,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560948746
    },
    {
        "content": "<p>Profiling the Questionnaire resource is appropriate if you want to set constraints on a bunch of Questionnaires.  E.g. \"Questionnaires from my organization never have answers of type Reference\" or \"In Questionnaires from my organization, 'text' is always mandatory\".  But you should NOT use profiling to define individual Questionnaires.  (If you did that, you'd actually be profiling QuestionnaireResponse and there'd be no need to have the Questionnaire resource at all.)</p>",
        "id": 168507142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560951598
    },
    {
        "content": "<p>You always need the Questionnaire  resource (definition) to be able to properly validate a QuestionnaireResponse resource, it's specific QR validation rules over standard core FHIR resource validation.<br>\nThis is usually done by resolving the quesitonnaire reference in the QR.</p>",
        "id": 168540168,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1560974066
    }
]