[
    {
        "content": "<p>Is there a best practice for frequency of balloting/IG publishing for Questionnaire/SDC IGs?   For instance, if every 6 months,  we add a few  questions to each of our questionnaires,  change the order of a few questions and add a new workflow diagram, do we go back for balloting/IG publishing every 6 months?   Or can/should we publish a CI build for the IG without balloting?</p>",
        "id": 257774675,
        "sender_full_name": "Diane",
        "timestamp": 1634336801
    },
    {
        "content": "<p>I think we can safely say that SDC is nowhere close to following any sort of best practice wrt balloting.  The ballot closed at the end of April, 2019 and we still haven't gotten the resulting version published yet.  I think a reasonable turn-around time is about 2 years, though I actually expect that SDC will go back to ballot in May 2022 with an objective of publishing by end of 2022 to get ballot review on the vast number of things we've introduced since that first ballot.  After that, I'd expect another publication about a year or so after that that migrates SDC to R5.</p>\n<p>In terms of your IG, as a rule you need to give implementers at least a year before you make any radical changes (so they can implement, provide feedback, you can make the changes, go through ballot, complete resolution and re-publish).  Doing all that in one year requires a pretty intense level of effort on everyone's part.  If you're just tweaking things, you can also look at using the STU update process.  That means going through peer review rather than balloting.  Your description of planned changes would definitely fall within the scope of what's allowed by an STU update.</p>",
        "id": 257775691,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634337453
    },
    {
        "content": "<p>And what is the correct usage of the CI build version?    Is the CI build a continuously evolving interim version between STU updates?</p>",
        "id": 257961072,
        "sender_full_name": "Diane",
        "timestamp": 1634517088
    },
    {
        "content": "<p>Yes</p>",
        "id": 257966245,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634522376
    },
    {
        "content": "<p>It represents the closest approximation of what the official release will look like in a few weeks</p>",
        "id": 257966265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634522398
    },
    {
        "content": "<p>Is there an ETA on the next SDC ballot? Searched the meeting notes but couldn't find much.</p>",
        "id": 271823672,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1644844353
    },
    {
        "content": "<p>SDC publication have a snapshot coming out today that'll be used by a couple of Da Vinci ballots.  Publication approval should go to TSC e-vote next Monday.  Actual publication should be in the next 2-3 weeks.  There's no scheduled ballot for a new release.  My guess is Sept. 2022 or possibly Jan 2023 cycle.</p>",
        "id": 271843176,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644853124
    },
    {
        "content": "<p>The next ballot will primarily be focused on review of content published as draft this cycle as well as some guidance on translations and one or two other things.</p>",
        "id": 271843298,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644853171
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Does this mean that STU3 has gone through ballot reconciliation and will be published in the next few weeks? In the FHIR registry, STU3 lists 2.7.0, which in the history of the IG references FHIR 4.0.0. Is this right?</p>",
        "id": 272024217,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1644952692
    },
    {
        "content": "<p>Yes, ballot reconciliation is complete.  The only thing we're waiting on is some publishing template issues.  3.0.0 of SDC will be based on 4.0.1 of FHIR core.</p>",
        "id": 272029907,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644955220
    }
]