[
    {
        "content": "<p>Hi guys, </p>\n<p>I am working on implementing a questionnaire for Glasgow Coma Scale (GCS).  While defining a profile for the same, I have integer values for the calculation of the scale. In that I want to limit the value for the fields (for example: Eye opening, Verbal response and Motor response). To limit these values I have a code in place for ex: answerOption[+].valueInteger = 1. </p>\n<p>Now while validation of the profile, the response from fhir does not throw error even for values out of the defined limits. Is there a way restrict the values and perform validation for profiles? </p>\n<p>Any help would be greatly appreciated. Thanks :)</p>",
        "id": 235513045,
        "sender_full_name": "Vedant Parikh",
        "timestamp": 1619013038
    },
    {
        "content": "<p>Typically for GCS, the answers should be Codings, not integers.  You'd use the 'coded ordinal' extension to capture their integer values.  The allowed list of codes would be constrained as option choices for the questionnaire.  (There are extensions to allow you to set min and max for truly numeric answers.)</p>",
        "id": 235526292,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619017483
    },
    {
        "content": "<p>BTW, The GCS exists as a LOINC panel, which you can get at <a href=\"https://fhir.loinc.org/Questionnaire/35088-4\">https://fhir.loinc.org/Questionnaire/35088-4</a>.  It will ask you for a login, but accounts are free and and you can get one at <a href=\"https://loinc.org/join/\">https://loinc.org/join/</a> .</p>\n<p>I think Lloyd is referring to the <a href=\"https://www.hl7.org/fhir/extension-ordinalvalue.html\">https://www.hl7.org/fhir/extension-ordinalvalue.html</a> extension.</p>",
        "id": 235528045,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619017883
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"407345\">@Vedant Parikh</span> I think the fastest way to accomplish what you are looking for is to go to <a href=\"https://lhcformbuilder.nlm.nih.gov\">https://lhcformbuilder.nlm.nih.gov</a> , hit the \"Add Item\" button, click \"Panel\", enter 35088-4. Hit Import. Save the questionnaire.</p>",
        "id": 235539486,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1619021981
    },
    {
        "content": "<p>Hi guys, </p>\n<p>Thank you very much for your inputs. My question is not specifically/limited to GCS.</p>\n<p>The ‘answerOption’ inherently should generate an error code(it should restrict input values other than defined) if the input values do not match any of the defined answer options. Could you please let me know if my assumption is wrong or why an error is not thrown for an input which is not defined.</p>",
        "id": 235550663,
        "sender_full_name": "Vedant Parikh",
        "timestamp": 1619026402
    },
    {
        "content": "<p>If you set the item.type to \"choice\", the user will have to select one of the codings provided.  They won't be able to enter something off the list.</p>",
        "id": 235576629,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619037260
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>  Thank you for your suggestion It has solved my problem. <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 235643012,
        "sender_full_name": "Vedant Parikh",
        "timestamp": 1619082234
    }
]