[
    {
        "content": "<p>I'm interested to know how administration of a questionnaire is initiated/triggered from EMRs or other existing operational health information systems. For example if a patient is eligible to be recruited to a program where certain questions are to be scheduled and delivered how would that Order be represented using FHIR. For a minimal use case I'm thinking of using a bundle with Patient and CommunicationRequest resources with some extensions to include things like baseline collection date and system specific Ids etc. Basically I though of putting everything not in Patient resource that would be visit/order specific into CommunicationRequest. Though, I suspect this resource would not be supported by many systems so I was thinking of perhaps using Encounter with some use case specific extensions. Obviously depending on the scope of exchange we might need to add other resources to capture provider, organisation, NOK etc.</p>\n<p>What's the best practice on this?</p>",
        "id": 216559532,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1605234755
    },
    {
        "content": "<p>To my knowledge, no EHRs currently support external systems asking users to complete questionnaires.  The Structured Data Capture IG and several Da Vinci IGs are trying to introduce such a mechanism, all using Task.  It'll probably take a while before that actually propagates into real production environments though.</p>",
        "id": 216565330,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605241019
    },
    {
        "content": "<p>Thanks for the heads up. In that case does my proposal make sense? We're needing to implement this on this side of Xmas.</p>",
        "id": 216575861,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1605253211
    },
    {
        "content": "<p>CommunicationRequest <em>shouldn't</em> be used for this.  You're not authorizing the disclosure of a type of information.  You're asking someone to fill out a form.  Typically there wouldn't be a Bundle - there'd just be a Task identifying a specific owner (who should do the work), the Task.for would indicate the Patient and one of the Task.inputs would identify the Questionnaire.  Task.executionPeriod would indicate when the form should be filled out.  The details of the Patient, Practitioner, etc. would be by reference rather than passed all at once.  (If you're in an environment where the receiver can't query those, then you may need to look at messaging, but messaging should never be a default choice if you can avoid it.)</p>",
        "id": 216615746,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605276833
    },
    {
        "content": "<p>Thanks Lloyd. Thinking about the actual semantics I'd say this is not a request or order for a patient to fill out a questionnaire. It is rather a request from EMR to our PROMs solution to add a particular patient to a predefined project. Once the patient is added to a particular project our system defines the questionnaires and the schedule by which they'll be sent out to the patients. In essence this is similar to the ADT A01 type of transaction.</p>\n<p>If I breakdown the actions I'm needing:</p>\n<ol>\n<li>Create a new Patient in ePROMs solution (ZEDOC) (if already exists then update)</li>\n<li>Add patient to an existing PROMs project (via an agreed Project Id)</li>\n<li>Set baseline data collection date</li>\n</ol>\n<p>It'd be fantastic to get thoughts on how to approach this requirement</p>",
        "id": 216979753,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1605604255
    },
    {
        "content": "<p>Right now, we have a couple of 'enrollment'-related resources, but those are currently specific to coverage/insurance rather than to programs in general, though personally I'd like to see them generalized.  (As well, there's a need to transition the notion of 'enrollment response' to just 'enrollment' because sometimes enrollment isn't driven by a request.)  </p>\n<p>You might start a discussion on the <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> stream because the program definition and enrollment piece isn't really Questionnaire-specific.</p>",
        "id": 217009934,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605623796
    },
    {
        "content": "<p>That's great, I was thinking about exactly the same resource but then realised the use case was for insurance. Another one that got my attention is the Measure resource, which includes PROMs in its type description. But I reckon this isn't for an action but rather definitional. I can see the enrolment concept would apply more broadly, for example including things like recruiting patients to a smoking cessation programs or blood glucose control mHealth interventions etc. Not sure if there's already a resource for it specifically but should also apply to patient recruitment to a clinical trial as well</p>",
        "id": 217052925,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1605642587
    },
    {
        "content": "<p>Measure is for defining what information should be collected - it has no notion of \"sign-up\".</p>",
        "id": 217054037,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605643085
    },
    {
        "content": "<p>You might experiment with EnrollmentRequest and response, and if they're \"close\", you can submit a change request to have their scope broadened</p>",
        "id": 217054125,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605643120
    },
    {
        "content": "<p>yeah makes sense, thanks</p>",
        "id": 217054412,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1605643239
    },
    {
        "content": "<p>I reckon for the time being I can create an an extension for baseline data collection date, which probably in the end will most likely not be part of resource proper anyways. The more I think about this I think it is worth having a dedicated resource for enrolling patients to a program that involves data collection points with certain semantics (e.g. pre-visit, baseline, post-op, 30days follow up etc.). Which I believe could be done via a repeating generic date element and through slicing these tags could be added. That's what I'd do with an openEHR archetype</p>",
        "id": 217055211,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1605643591
    },
    {
        "content": "<p>A new resource is definitely an option too.  We look forward to your feedback :)</p>",
        "id": 217055946,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605643937
    },
    {
        "content": "<p>Is their a way to order an assement (serviceRequest) and specify the output to be a questionnaire response.<br>\nOr would it be better to send a sdc questionnaire?</p>",
        "id": 217196621,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1605733525
    },
    {
        "content": "<p>Is it activity definition</p>",
        "id": 217196998,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1605733715
    },
    {
        "content": "<p>Projects I've been part of have typically modeled that as a Task with the Questionnaire specified as an input element</p>",
        "id": 217210410,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1605741788
    },
    {
        "content": "<p>ActivityDefinition would be if you want to describe the activity of prescribing a questionnaire, independent of a particular patient (so you could put that as a step in a PlanDefinition, for example).</p>",
        "id": 217210505,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1605741857
    }
]