[
    {
        "content": "<p>Does anyone know the difference between the Structured Data Capture (SDC) standards maintained by <a href=\"https://wiki.ihe.net/index.php/Structured_Data_Capture\">IHE</a> and <a href=\"http://hl7.org/fhir/us/sdc/\">FHIR</a>?  The backstory I’ve heard about two harmonious efforts both spun off by ONC in 2017 doesn’t seem to align with my observation that neither effort seems to reference the other very much in their online documentation and message boards.</p>\n<p>My initial take is that IHE seems more focused on implementing the various components in an SDC system (e.g., form filler, form manager, etc.) while FHIR is working more on being able to describe complex Questionnaires and their behaviors.  Can anyone shed some light on whether IHE and FHIR SDC are complementary, duplicative, or orthogonal?</p>\n<p>I’m also confused as to why <a href=\"https://simplifier.net/guide/sdconfhir/introduction\">this implementation guide</a> is necessary given the active work being done on SDC by the FHIR community.</p>",
        "id": 214596008,
        "sender_full_name": "David Winters",
        "timestamp": 1603729001
    },
    {
        "content": "<p>IHE's SDC uses a custom syntax to represent the Questionnaire &amp; response.  HL7's uses FHIR.  The capabilities of each spec have diverged</p>",
        "id": 214596265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603729105
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , that's unfortunate.  Does anyone know if a reconciliation is in the cards going forward?</p>",
        "id": 214596663,
        "sender_full_name": "David Winters",
        "timestamp": 1603729290
    },
    {
        "content": "<p>The IHE spec pre-dated the FHIR one by about a year and there were parts of the IHE community weren't enamored with the HL7 FHIR representation.  I'm not aware of any near-term plans for reconciliation.  Reconciliation would be hard given that the syntaxes are pretty different.</p>",
        "id": 214597192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603729496
    },
    {
        "content": "<p>(IHE uses the same structure for both representing the Questionnaire and the response, FHIR uses separate resources)</p>",
        "id": 214597424,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603729573
    },
    {
        "content": "<p>Okay, then that explains the purpose of the IHE SDC on FHIR IG: Get the IHE combined Questionnaire/QR structure into FHIR.  Interesting that it entails side-stepping FHIR QR and goes straight to Observation resources.</p>",
        "id": 214598066,
        "sender_full_name": "David Winters",
        "timestamp": 1603729802
    },
    {
        "content": "<p>So sort of a light-weight 'extraction' process.  (HL7 SDC has that, but supports extraction to much more than just Observations.)</p>",
        "id": 214600086,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603730598
    },
    {
        "content": "<p>Yup, I'm familiar with what's possible with HL7 SDC, but am coming up to speed on the IHE alternative.  Thanks for the help <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.</p>",
        "id": 214600357,
        "sender_full_name": "David Winters",
        "timestamp": 1603730707
    },
    {
        "content": "<p>is it possible that IHE has produced a FHIR version under Mobile Retrieve Form for Data Capture -- <a href=\"https://wiki.ihe.net/index.php/Mobile_Retrieve_Form_for_Data_Capture\">https://wiki.ihe.net/index.php/Mobile_Retrieve_Form_for_Data_Capture</a><br>\n<span class=\"user-mention\" data-user-id=\"221184\">@John Stamm</span> <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span></p>",
        "id": 214607080,
        "sender_full_name": "John Moehrke",
        "timestamp": 1603733478
    },
    {
        "content": "<p>Mr. Stamm is the best person to speak to this. My intent with mRFD was to profile mere SMART in IHE.</p>",
        "id": 214641586,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1603751577
    }
]