[
    {
        "content": "<p>Assume I have a Questionnaire that requests a patient to take a measurement with a personal health device. The answer might require that one insert the measurement from the device but it would be better if the answer could link to the Observation Resource(s) generated by the device. The question is how to do that. Would this be an acceptable way to do it?</p>\n<p>QuestionnaireResponse.item.answer.value[x]<br>\nQuestionnaireResponse.item.answer.item(n).valueReference</p>\n<p>The valueReferences would reference the logical id of the Observation Resources generated by the device. Is this okay or an abuse of the intention of the answer subitems?</p>",
        "id": 247452730,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1627475892
    },
    {
        "content": "<p>You can certainly use valueReference to point to an existing Observation, though the Questionnaire would need extensions to help guide the user to the correct already-persisted Observation.  That said, returning a link to an Observation would be unusual.  valueReference is more typically used to point to Practitioners, Locations, Organizations and other entities.  Also note that all you'd have is a Reference - if you received the QuestionnaireResponse you'd need to do a read on that endpoint (and have permission) to retrieve the Observation.</p>",
        "id": 247460695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627479961
    },
    {
        "content": "<p>You could also look at populating the answer to questions from the existing Observation</p>",
        "id": 247460808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627479993
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thanks for the quick response. I just wanted to know if the approach was a possible option. I also wanted to link a single question to multiple Observations (such as the BP and PR of a BP cuff or the SpO2 and PR of a pulse ox).</p>\n<p>I am not sure exactly how we intend to work this but the thinking was to place the QuestionnaireResponse in the same Bundle with the resources generated by a PHD connection. That way we would at least assure that the links (logical ids) would be properly configured when on the server. The downside at the moment is if another question asks for a measurement from a second device. Our infrastructure does not bundle resources from multiple connections - though I suppose we could.</p>",
        "id": 247472145,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1627485083
    }
]