[
    {
        "content": "<p>I know that some have some others implementing this type of behaviour too, can we discuss this again on the SDC call to see if there is scope to standardize it?<br>\n<a href=\"/user_uploads/10155/jsS3-HjwAVvS04biPlWXiKJf/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/jsS3-HjwAVvS04biPlWXiKJf/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/jsS3-HjwAVvS04biPlWXiKJf/image.png\"></a></div><ul>\n<li>itemcontrol - canvas</li>\n<li>using attachment as the datatype</li>\n<li>extension for the base image to use - attachment datatype</li>\n<li>extension to indicate if image should be background, or displayed beside it (beside for assessment where is cognitive to \"copy\" the image to the left)</li>\n<li>extension to indicate if the background should be included in the output (for discussion)</li>\n</ul>",
        "id": 256504973,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633566236
    },
    {
        "content": "<p>I don't understand using it as a background.  We do have extensions to have an 'image' for an item (question or display item)</p>",
        "id": 256513047,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633572669
    },
    {
        "content": "<p>As in the image above to draw on where the injuries were</p>",
        "id": 256564394,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633607668
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193971\">@Stoyan Halkaliev</span> was it you that had this (and the 3d version too)</p>",
        "id": 256564455,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633607708
    },
    {
        "content": "<p>The proposal there was to use SVG regions</p>",
        "id": 256573721,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633611969
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , yes, it was me. We did the 2D version with SVG regions, the 3D one is more custom, because there is no SVG for 3D. Sorry for missing the last couple of meeting. Will join today, but feel free to PM me. The idea was to have the SVG regions named after the answer options and have a rendering control that can show the SVGs. Since they would be from the same valueset, there is always the fallback to a combobox (for example) in case the rendering control is not available.</p>",
        "id": 256617077,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1633627651
    },
    {
        "content": "<p>Thanks Stoyan, that matches to my memory - now.<br>\nWe were looking at the more free-form style where it's a canvas for drawing on top of the image you had.<br>\nI'll draft up something as an example to compare.<br>\nDo you have an example public of one of your definitions?</p>",
        "id": 256659146,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633645311
    }
]