[
    {
        "content": "<p>Assume I have a group Item 1 and subItem 1.1. I want to mandate item 1.1 is required. Do I also need to set container group Item 1 as required?</p>",
        "id": 192711078,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1585854263
    },
    {
        "content": "<p>Yes</p>",
        "id": 192716787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585857049
    },
    {
        "content": "<p>I don't see that statement in the specification, and I am not sure why it should be so.  Obviously, the containing group must be present in the QR, but that is by necessity due to the structure of the QR for the required sub-item.</p>",
        "id": 192717617,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585857444
    },
    {
        "content": "<p>If the parent is optional, then if you exclude the parent, the child won't be included.  If you want to force inclusion of the child, you must force the inclusion of the parent</p>",
        "id": 192718358,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585857782
    },
    {
        "content": "<p>What I am saying is that if you require the child, you do not need to say anything about the parent.  It might be an error to set require=false on the parent, but if you you say nothing, then it is implicitly required by the child.</p>",
        "id": 192718810,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585857971
    },
    {
        "content": "<p>If require=false on the parent, then it's fine to have a questionnaire response that omits the parent and thus omits the child.  \"required\" is only evaluated within the scope of the parent, not the overall questionnaire.</p>",
        "id": 192720717,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585858849
    },
    {
        "content": "<p>You are saying it would \"fine \"to have required=false on the parent, and required = true about the child?  So, setting 'false' on the parent overrides the setting on the child?</p>",
        "id": 192723972,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585860468
    },
    {
        "content": "<p>Totally fine to have false on the parent and true on the child.  What that says is that if the parent is present, the child must be present.  It's not an override, it's that 'required' is always contextual</p>",
        "id": 192724311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585860613
    },
    {
        "content": "<p>The specification says required means, \"An indication, if true, that the item must be present in a \"completed\" QuestionnaireResponse.\"  If you apply to the child item, then if the child item says it is required, then it must be present.  There is no mention of a dependency of the required status of parent items.</p>",
        "id": 192724743,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585860841
    },
    {
        "content": "<p>Then we need to clarify the language.  It's absolutely intended to mean in the context of the parent.  Otherwise, the parent's cardinality would be irrelevant.</p>",
        "id": 192733651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585865417
    },
    {
        "content": "<p>Can you submit a change request?</p>",
        "id": 192733659,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585865425
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-26684\" title=\"http://jira.hl7.org/browse/FHIR-26684\">J#26684</a></p>",
        "id": 192747988,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585876065
    },
    {
        "content": "<p>Wait. I thought without required means required=false. Is that not?</p>",
        "id": 192805522,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1585921480
    },
    {
        "content": "<p>If you omit 'required', the meaning if missing is the same as if it was false</p>",
        "id": 192813710,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585924911
    },
    {
        "content": "<p>\"generally\"</p>",
        "id": 192853176,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585942157
    },
    {
        "content": "<p>I can't think of any exceptions...</p>",
        "id": 192853219,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585942187
    },
    {
        "content": "<p>I would have said that if an item is a group and has a child item that is required, then that group is \"required\" (i.e. it will show up in the QR) even if \"required\" is not explicitly set.  I think that is LHC-Forms' (lforms) behavior.  I think there is currently enough ambiguity in the spec to allow such an interpretation.</p>",
        "id": 192854794,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585943027
    },
    {
        "content": "<p>That's absolutely not true.  If the group isn't marked as required, it's not required - regardless of the required values of the children.  How would you expect a questionnaire to behave where the group explicitly says required=false when a child question is required=true?</p>",
        "id": 192855071,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585943168
    },
    {
        "content": "<p>required is definitely only in the context of the parent.</p>",
        "id": 192855087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585943178
    },
    {
        "content": "<p>I am really not sure what it means to say that a group is required, unless you mean the that items in the group are required.  I think \"required\" applies to items that are questions.</p>",
        "id": 192855608,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585943461
    },
    {
        "content": "<p>A group being required means that the group must have at least one repetition in the QR - and the group must have at least one child item in the QR.  It also means than any expectations around items contained within the group would come into play.</p>",
        "id": 192856008,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585943686
    },
    {
        "content": "<p>(i.e. required items)</p>",
        "id": 192856021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585943696
    },
    {
        "content": "<p>What if a group is required and no child items are required?</p>",
        "id": 192856461,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585943906
    },
    {
        "content": "<p>One of the child items must be present</p>",
        "id": 192861187,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585946517
    },
    {
        "content": "<p>If you have two question of type \"text\", A and B, with B a child item of A, and with A \"required\", then if the user fills out B but leaves A blank, should the form validate?</p>",
        "id": 237696913,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1620321839
    },
    {
        "content": "<p>No.  A required question means \"must have an answer\"</p>",
        "id": 237698635,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620322518
    },
    {
        "content": "<p>I am glad you think that.  However, the documentation for required says, \" if true, ... the item must be present in a \"completed\" QuestionnaireResponse.\"  In this case, A would appear in the QR because its child item (B) has an answer.</p>",
        "id": 237698893,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1620322619
    },
    {
        "content": "<p>Sounds like clarification is needed for items that are a 'question' - care to submit a change request?</p>",
        "id": 237699175,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620322749
    },
    {
        "content": "<p>Sure.  <a href=\"http://jira.hl7.org/browse/FHIR-32151\">FHIR-32151</a></p>",
        "id": 237700462,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1620323333
    },
    {
        "content": "<p>In my implementation, we've relaxed all the conditional stuff to warnings if the status in InProgress.</p>",
        "id": 238390819,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1620771903
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"195344\">Paul Lynch</span> <a href=\"#narrow/stream/179255-questionnaire/topic/item.2Erequired/near/237698893\">said</a>:</p>\n<blockquote>\n<p>I am glad you think that.  However, the documentation for required says, \" if true, ... the item must be present in a \"completed\" QuestionnaireResponse.\"  In this case, A would appear in the QR because its child item (B) has an answer.</p>\n</blockquote>\n<p>Late to the party... but I would say this scenario is not possible. In the QR, we can't have question A of type text with a child question B of type text, where A has no answer and B has an answer. In a previous discussion on nested items, Lloyd clarified that if a question is nested under another question (as opposed to nested under a group), then the corresponding answer(s) in the QR needs to be nested under the answer(s) to the parent question.</p>",
        "id": 239406502,
        "sender_full_name": "Jing Tang",
        "timestamp": 1621423899
    },
    {
        "content": "<p>That is correct.  You can't have a child question of a question with no answer because child questions are always children of an answer.</p>",
        "id": 239454074,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621441167
    },
    {
        "content": "<p>I am not saying Jing is wrong, but I don't follow Lloyd's reasoning.  Structurally, you could have item.answer.item.answer.valueString, without having item.answer.valueString.  But maybe some constraint was added to prevent that?</p>",
        "id": 239588144,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621516243
    },
    {
        "content": "<p>Also, if that were the case, then I think item.answer.value[x] should be 1..1.</p>",
        "id": 239589314,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621516687
    },
    {
        "content": "<p>I agree.  I don't know why it's not.  Can you submit a change request?</p>",
        "id": 239590071,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621516980
    },
    {
        "content": "<p>Sure, but I would like to understand better why that should be required.   Does it make something easier?  One can imagine a form where the main field for an item can be left blank, as long as one of the child fields is filled in, although I don't know whether it would be necessary to design a form that way.</p>",
        "id": 239590559,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621517171
    },
    {
        "content": "<p>Nesting happens beneath each answer.  What would a nesting mean if there wasn't actually an answer?</p>",
        "id": 239590976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621517344
    },
    {
        "content": "<p>item.answer.item says it is for collecting \"additional details\" about an answer.  But suppose you had a form with item.text = \"Practitioner name\", an then item.answer.items for phone number and address.  Maybe for one practitioner, the user cannot quite remember the name but does remember the practice name, address, and a phone number.  That would be useful information to collect, even without the answer to main item.  Of course, one could rearrange the form with the top level item being a group that said, \"Practitioner\", and then all the answers (including \"name\") are together under that.</p>",
        "id": 239594290,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621518594
    },
    {
        "content": "<p>If the first is a repeating question, how do you know what the address and phone number are for?  If it's not, why are they nested questions?</p>",
        "id": 239594664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621518737
    },
    {
        "content": "<p>A better example would be \"which of these conditions have you had?\" (answers are diabetes, hypertension, etc.) and child questions might be \"date diagnosed?  still active?\"</p>",
        "id": 239594844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621518834
    },
    {
        "content": "<p>That's really what 'child' questions are for.  And they'd be meaningless if there wasn't an answer for the parent.</p>",
        "id": 239594941,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621518862
    },
    {
        "content": "<p>It sounds like you are saying child questions are for the cases where the child question answers would be meaningless without an answer to the parent.  I don't have a reason to object to that, although I don't think it is a necessary to define it that way.  Anyway, it should be clarified in the specification.</p>",
        "id": 239630321,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621532030
    },
    {
        "content": "<p>Agree.  Are you willing to create a tracker item or do you want me to?</p>",
        "id": 239631201,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621532384
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-32665\">FHIR-32665</a></p>",
        "id": 239631997,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621532733
    }
]