[
    {
        "content": "<p>2 parts, the auther of the item answer, that should be in the SDC QR profile right?<br>\nThe other, is there an extension to link the prepop selected obs to the answer?<br>\nSo can know hasn't changed, and don't need to created another?<br>\nAnd should that even be a thing?</p>",
        "id": 261922072,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637239680
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> - were you intending to respond to an existing item?  I'm not following...</p>",
        "id": 261932201,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637244904
    },
    {
        "content": "<p>Sorry, late night post must have been half asleep.<br>\nWas asking if the item answer auther extension can be included in the SDC QR profile. (was looking for it and expected it there)</p>",
        "id": 261993119,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637270727
    },
    {
        "content": "<p>And also another question, if we use an observation to populate an item answer, is there an extension to reference that obs in the answer?</p>",
        "id": 261993310,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637270812
    },
    {
        "content": "<p>Is there an existing tracker item?</p>",
        "id": 262005588,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637277227
    },
    {
        "content": "<p>I haven't logged one yet, was just double checking something didn't exist already that I'd missed.<br>\nI was considering either <code>supportingInfo</code> (which didn't feel right) or <code>event-basedOn</code> extensions</p>",
        "id": 262006926,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637277978
    },
    {
        "content": "<p>I was actually asking about the author extension.  I don't think we have one for Observation either - though my general notion is that's best handled through Provenance</p>",
        "id": 262009349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637279680
    },
    {
        "content": "<p>Following the provenance track, if my form has 20 observations collated into it, then I'll have 20 provenance records?</p>",
        "id": 262132087,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637357082
    },
    {
        "content": "<p>Depends on the granularity of the assertions.  If you want to say \"This QR was populated by these 20 Observations\", you need one.  If you want to say \"Question 1 came from Questionnaire A and Question 5 and 7 came from Questionnaire B, etc., then you'll need 20 Provenances</p>",
        "id": 262160050,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637379563
    },
    {
        "content": "<p>Ah, then I'll be doing a custom reference extension. The provenance gives me nothing else for my usage. It's all in the one server from the one Organization.</p>",
        "id": 262181044,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637410703
    }
]