[
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/extension-rendering-markdown.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/extension-rendering-markdown.html\">https://www.hl7.org/fhir/extension-rendering-markdown.html</a> says it applies to \"Element ID string\".  Does that mean any string field in the Questionnaire resource definition could potentially use this markdown extension?  We could not find a direct reference to this extension in SDC, except via rendering-styleSensitive.</p>",
        "id": 164639643,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1556731307
    },
    {
        "content": "<p>The extension can show up on any string in any resource.  We haven't referenced it in SDC because we chose to use HTML exclusively if you want to add markup cababilities.  That said, there's also a proposal for R5 to change item.text from string to markdown in the core spec - which would eliminate the need for that extension on Questionnaire entirely.</p>",
        "id": 164640234,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556731757
    },
    {
        "content": "<p>Have we considered answers in markdown format for rich content?<br>\nCould we use the markdown or html extension on the string answer value there?<br>\nAnd maybe an item-control value(s) for <code>rich-text-md</code> and <code>rich-text-rtf</code>and/or <code>rich-text-html</code></p>",
        "id": 256483525,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633553893
    },
    {
        "content": "<p>I don't like the idea of the item.text being markdown outside the extension, as that implies more processing on every item which may not be intended/needed - I missed this change - don't like it.<br>\nMakes additional effort for all uses - and the QR.text would also need to change, which is hasn't</p>",
        "id": 256483654,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633553961
    },
    {
        "content": "<p>This was the original tracker issue for changing <code>Questionnaire.item.text</code> to markdown was:<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-20585\">https://jira.hl7.org/browse/FHIR-20585</a><br>\nWas voted on in May 2019 (which I missed)<br>\n<a href=\"https://confluence.hl7.org/display/FHIRI/FHIR+SDC+Minutes+CC+20190523\">https://confluence.hl7.org/display/FHIRI/FHIR+SDC+Minutes+CC+20190523</a><br>\nand only applied in March 2021 and I've only just noticed it now (as I've been too deep in R4/SDC)<br>\nThe original issue voters were <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> <span class=\"user-mention\" data-user-id=\"193152\">@Ye Wang</span> <span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span> <span class=\"user-mention\" data-user-id=\"193633\">@Robinette Renner</span> <br>\nMy concern is that with this is the additional overhead it adds to processing for every single question while rendering on mobile devices, and specifically where HTML is not being used such as native apps - for every single question/label.<br>\nThe existing R4 structure was equally as expressive, but had a clean way of knowing if you need to go to the complex rendering area.<br>\nOther parts of the core spec where markdown is used are not typically rendered in clinical contexts (conformance style resources with copyright/descriptions) or are a single field or 2, not every single item in the display.</p>",
        "id": 256659816,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633645722
    },
    {
        "content": "<p>I think support for markdown is still optional.  It can be displayed as plain text.  The documentation for data type markdown says, \"A FHIR string ... that may contain markdown syntax for optional processing by a markdown presentation engine....\"   The important words there are \"may\" and \"optional\".</p>\n<p>I do think the inconsistency between Questionnaire.item.text (markdown) and QuestionnaireResponse.item.text (string) should be fixed.</p>",
        "id": 256798409,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1633723730
    },
    {
        "content": "<p>The markdown processor that I use puts additional nodes around itself which messes with layout for just simple content. Which makes me want to pre pircess these questionnaires and put an extension with the plain text in it, which is painful.</p>",
        "id": 256901049,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633815821
    },
    {
        "content": "<p>It's extra processing at usage time that shouldn't be needed for most items.</p>",
        "id": 256901100,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633815848
    }
]