[
    {
        "content": "<p>We agreed to move a number of extensions (including several related to the population process) from the core spec to the SDC IG on the grounds tha that's where the use of those extensions are actionally defined.  We also defined the new extract and adaptive questionnaire operations in the SDC IG rather than the core spec for the same reason.  However, the populate operations remain in the core spec - with minimal guidance on how to use them.</p>",
        "id": 154014023,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540961399
    },
    {
        "content": "<p>We could (on our Thursday call - last chance) approve moving these operations out of the core spec and into SDC.  That would change their canonical URLs and would impact some of Grahame's code.  It may also impact other people's code.  (I believe Brian has implemented population, not sure about anyone else.)  The plus side is it puts all of the operations in the same spot and places them alongside the documentation of how to use them.  It also means that if we find we need to make changes to the populate operations based on testing at connectathons it's easier to do so in a timely fashion.</p>",
        "id": 154014025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540961530
    },
    {
        "content": "<p>If you have opinions on this move, please state them here and/or plan to come to the Thursday SDC call...</p>",
        "id": 154014026,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540961551
    },
    {
        "content": "<p>Does it need to change the canonical? That just seems random, and harder for things to move to/from the IG</p>",
        "id": 154014043,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1540974499
    },
    {
        "content": "<p>And effects implementations.</p>",
        "id": 154014044,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1540974516
    },
    {
        "content": "<p>I think with current IGPublisher processes, the answer is \"yes\".  And  I'd be nervous if the IGPublisher didn't enforce that because that makes it harder to control the <a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a> namespace and also means that resolution of the URL is unlikely</p>",
        "id": 154014073,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540994071
    },
    {
        "content": "<p>yes it does</p>",
        "id": 154014316,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541018037
    },
    {
        "content": "<p>On today's FMG call, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> had raised the possibility of canonical URLs potentially being kept the same for extensions that had been migrated.  Would that be feasible for these operations too?</p>",
        "id": 154014350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541021683
    },
    {
        "content": "<p>I would argue that only IGs from hl7 international can use their canonical, and prefer only international in scope.</p>",
        "id": 154014422,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541032442
    },
    {
        "content": "<p>Which would hopefully reduce that issue.</p>",
        "id": 154014424,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541032460
    },
    {
        "content": "<p>yes it would have to be published through HL7, and there would additionally be some constraints around lifecycles</p>",
        "id": 154014435,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541033586
    }
]