[
    {
        "content": "<p>So I want to say my Questionnaire profiles \"must support\" extension-questionnaire-allowedProfile on item. </p>\n<p>But item is nested - is there a way to specify this without going n item levels deep? </p>\n<p>Or do I need to assume than we are never going to have more than, say 3 nestings and explicitly add the \"must support\"s down those 3 levels?</p>",
        "id": 153989956,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1534896565
    },
    {
        "content": "<p>When you add a mustSupport to a recursive item, it automatically gets added to all levels</p>",
        "id": 153990435,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535037866
    },
    {
        "content": "<p>Perfect thanks!</p>",
        "id": 153990440,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1535038371
    },
    {
        "content": "<p>Actually - it's not just making an item \"must support\" - it's also the addition of the extension (which is must support) - is the addition of the extension also recursive?</p>",
        "id": 153990442,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1535038666
    },
    {
        "content": "<p>BTW <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> this is in relation to your ballot comment on HAI FHIR: \"The \"questionnaire-allowedProfile\" extension is only applied to the top-level Questionnaire.item, but should be allowed on any Questionnaire.item, Questionnaire.item.item, etc. in the hierarchy.\"</p>",
        "id": 153990445,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1535038883
    },
    {
        "content": "<p>Right now, there's no ability to differentiate \"this constraint only applies to this level\" vs. \"this constraint applies to all levels\".  We've come up with how this should work in principle, but the tooling doesn't do it.  So right now, it's all levels, all the time.</p>",
        "id": 153990449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535039279
    }
]