[
    {
        "content": "<p>Does anyone have a good diagram or a one pager that explains how SDC works, and what it achieves? I'm looking for something that I can share with non-techies - that is, clinical staff, patients, and even politicians</p>",
        "id": 238572795,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620873320
    },
    {
        "content": "<p>Hi Grahame - This blurb I wrote in the developing MCC IG might help: <a href=\"https://trifolia-fhir.lantanagroup.com/igs/lantana_hapi_r4/MCC-IG/fhir_questionnaire_and_questionnaireresponse_integration.html\">https://trifolia-fhir.lantanagroup.com/igs/lantana_hapi_r4/MCC-IG/fhir_questionnaire_and_questionnaireresponse_integration.html</a></p>",
        "id": 238573419,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1620873976
    },
    {
        "content": "<p>From my standard SDC overview slide:<br>\nStandardize/enhance capabilities of FHIR Questionnaires:</p>\n<ul>\n<li>Workflow</li>\n<li>Complex form rendering</li>\n<li>Complex form behavior</li>\n<li>Automatically populating forms</li>\n<li>Automatically extracting data from completed forms</li>\n<li>Adaptive forms</li>\n</ul>",
        "id": 238578735,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620879016
    },
    {
        "content": "<p>thanks</p>",
        "id": 238581783,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620882143
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179255-questionnaire/topic/Non.20Techie.20Explanation.20of.20SDC/near/238572795\">said</a>:</p>\n<blockquote>\n<p>Does anyone have a good diagram or a one pager that explains how SDC works, and what it achieves? I'm looking for something that I can share with non-techies - that is, clinical staff, patients, and even politicians</p>\n</blockquote>\n<p>I'm not sure if non-techies would actually care about how SDC works, so I would rather focus on what it achieves. I would actually resort to a bit of story telling, take a patient journey and show where structured data is captured and how that makes life better for all involved.<br>\nI am in now way affiliated with the company who wrote this, but I think this paragraph gives the idea what I think would work for non-techies:<br>\n==<br>\nWith thanks to the ever developing world of digitisation, new opportunities are also being made possible. Apps, e-mail surveys and electronic documentation make it possible to efficiently integrate the often still paper-based and personnel-intensive PROM survey into clinical routine. Whilst the validity of the &lt;redacted&gt; is of paramount importance, the way in which it is used in the healthcare setting should also be considered. With the integration of digital infrastructures offering such PROM sets into clinics’ own IT systems it can aid augmented feedback-loops, time efficiency and connectivity between care teams and patients. This could make it possible to take patient-centred objective evaluations of therapies and shared decision making a step further for the future of advanced care practices. </p>\n<p>Ultimately however, PROMs including the &lt;redacted&gt; are aids to the patient journey and the focus should always be the preferences and experiences of the patients themselves as they are the true arbiters of their own health and postoperative outcomes. Using PROMs as an assistant to  establish the patient’s true perspective on their treatment to inform better practices for the future is at the core of their use.<br>\n==</p>\n<p>For politicians, at least our MoH is now very much focussed on not being left behind and digitising the country for the benefit of their citizens (which are already summed up then in the patient-clinician story). Also the topic of using Real-World Evidence is becoming more prominent and would fit in nicely with the promise of SDC.<br>\nIn Europe, several countries are beginning to put chronic care into their standard of care, reimbursed by insurance, and that involves several standardised instruments, such as PHQ-9 or KCCQ-12 which translate very nicely into FHIR Questionnaires and onto the browsers and phones of the patients.</p>\n<p>Just my €0,02.</p>",
        "id": 238622932,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1620913541
    },
    {
        "content": "<p>happy to call what I what 'what is achieved' rather than 'how it works', but I was asked for a diagram. But thanks, I do like the story.</p>",
        "id": 238669652,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620934715
    }
]