[
    {
        "content": "<p>A few questions about populate, in conjunction with using LHC-Forms to render the Questionnaire. This is for a demo/proof of concept website. It is not for production.</p>\n<p>We are trying to find one source (not many different resources) to use as the source data for pre-populate of our multiple types of Questionnaires, if possible. </p>\n<ol>\n<li>With LHC-Forms, is it possible to pre-populate a Questionnaire based on information from a non-FHIR database (eg. mySQL)? The SDC IG at <a href=\"http://hl7.org/fhir/uv/sdc/2019May/populate.html\">http://hl7.org/fhir/uv/sdc/2019May/populate.html</a>  mentions using the REST interface, but I didn't know if the IG was only discussing FHIR REST queries.</li>\n</ol>\n<p>In looking at the example at <a href=\"https://sqlonfhir-r4.azurewebsites.net/fhir/Questionnaire/new-prepop\">https://sqlonfhir-r4.azurewebsites.net/fhir/Questionnaire/new-prepop</a>:</p>\n<p>&lt;entry &gt;<br>\n    &lt;fullUrl value=\"urn:uuid:785869a5-60d8-41d6-bdfa-7df0e4f48919\"/&gt;<br>\n    &lt;request &gt;<br>\n        &lt;method value=\"GET\"/&gt;<br>\n        &lt;url value=\"RelatedPerson?patient=pat2\"/&gt;<br>\n    &lt;/request&gt;<br>\n&lt;/entry&gt;</p>\n<p>It seems like I would need to put the database URL (and connection string?) into the fullURL value and then in url value, I would put the mySQL query such as \"SELECT employeeLastName FROM employees WHERE employeeID=1234 AND ...\"</p>\n<p>If the Questionnaire expects to receive back a FHIR resource (eg. Practitioner), then would I need to \"convert\" the results of the SQL query to a FHIR resource before LHC Forms can populate the Questionnaire?</p>\n<ol start=\"2\">\n<li>Instead of having the data in a separate mySQL database, could I collect and store the data in a repeating block using a Questionnaire and Questionnaire Response? Would FHIRPath-based Population work for a Questionnaire Response? I am unsure of this approach because the Questionnaire Response linkID, text and answer elements do not appear to be searchable (according to <a href=\"https://www.hl7.org/fhir/R4/questionnaireresponse.html\">https://www.hl7.org/fhir/R4/questionnaireresponse.html</a>).  Do the elements have to be searchable to use FHIRPath?</li>\n</ol>",
        "id": 233750608,
        "sender_full_name": "Diane",
        "timestamp": 1617927951
    },
    {
        "content": "<p>LHC-Forms only populates with data from a FHIR server.   Some renderers will make use of a $populate operation, which might talk to non-FHIR databases to get the data, but the $populate operation is something that would run on a server.  If you need to access non-FHIR data, you could either convert the data to FHIR, or check the list of <a href=\"https://confluence.hl7.org/display/FHIRI/SDC+Implementations\">SDC implementations</a> to see if something there implements $populate that you could use.  (However, note that LHC-Forms does not make use of $populate, because it does its own population.   I suppose we could add that a configuration option.)</p>\n<p>BTW, the current SDC IG URL is <a href=\"https://build.fhir.org/ig/HL7/sdc/\">https://build.fhir.org/ig/HL7/sdc/</a></p>\n<p>I don't know of any way to put SQL into a Questionnaire.</p>\n<p>To answer your question about FHIRPath, FHIRPath in a Questionnaire can access anything in the Questionnaire or QuestionnaireResponse.  The elements do not have to be searchable.</p>",
        "id": 233752176,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1617929148
    },
    {
        "content": "<p>It sounds like the easiest way to make the populate happen will be to use data  that is stored somewhere on the FHIR server, so that we can use LHC-Forms to do the populating and so that there will be less manipulating of the data to get it into FHIR format.   Since FHIRPath is compatible with the Questionnaire and QuestionnaireResponse elements,  that opens up a lot of options for us.</p>",
        "id": 233759500,
        "sender_full_name": "Diane",
        "timestamp": 1617935451
    },
    {
        "content": "<p>The driver to use FHIRPath rather than opening up to something like SQL is that there's no standard SQL layout, so any such system would be very limited to where it could get data - and any change to your database layout would break your questionnaires.  It doesn't mean it couldn't be done, but it would require a custom operation - or at least an extension of the 'standard' $extract.  It would also be outside the scope of the standard and would thus be less likely to be widely supported.</p>",
        "id": 233767207,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617943082
    }
]