[
    {
        "content": "<p>Is there the ability in the Adaptive Form to navigate backwards? For example if the UI shows a question but the user have the ability to go back to the previous question.</p>",
        "id": 240411721,
        "sender_full_name": "milton mitjans",
        "timestamp": 1622079621
    },
    {
        "content": "<p>Generally no.  There's an SDC extension that defines what sort of navigation is allowed, though I think we'd presumed it wasn't necessary for adaptive forms.  Issue is that if you change previous answers then all subsequent answers and questions are potentially invalidated.</p>",
        "id": 240439238,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622107247
    },
    {
        "content": "<p>Thank you, do you know a link to the SDC extension that defines the navigation?</p>",
        "id": 240478077,
        "sender_full_name": "milton mitjans",
        "timestamp": 1622126541
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/HL7/sdc/behavior.html#entryMode\">http://build.fhir.org/ig/HL7/sdc/behavior.html#entryMode</a></p>",
        "id": 240484903,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622129093
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"415911\">@milton mitjans</span> if you're curious about what the implementation for this looks like, I've recently added support for this extension in <a href=\"https://github.com/asbi-cds-tools/questionnaire-to-survey/blob/master/fhirConversionTools.js#L22\">questionnaire-to-survey</a>.</p>",
        "id": 241131767,
        "sender_full_name": "David Winters",
        "timestamp": 1622630435
    },
    {
        "content": "<p>Thank you!<br>\nIn the Adaptive flow; let's say that there have being 3 questions answered. Does the POST request to get the next question will need to have all 3 questions within the QuestionnaireResponse? I see that the questions themselves are on the contained Questionnaire but I'm not sure if the POST will also need to have the answers.</p>\n<p>Thanks!</p>",
        "id": 241341940,
        "sender_full_name": "milton mitjans",
        "timestamp": 1622686583
    },
    {
        "content": "<p>The POST will be the QuestionnaireResponse with all answers to date and a contained Questionnaire listing all questions.  There's no expectation that the server will track what's previously been asked, so all information must be present in the instance.  And at the end, the form needs to show all questions that were asked and all answers that were given.</p>",
        "id": 241342833,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622687810
    }
]