[
    {
        "content": "<p>I have a use case where we need a print version of the Questionnaire (not QuestionnaireResponse) to be sent by ordinary mail.</p>\n<p>As far as I see for many of the questionnaires it will not be possible to auto-generate a print version as there is not always a one-to-one between a digital version and a print version.</p>\n<p>So I am thinking of using a DocumentReference and Binary where the DocumentReference refers to the Questionnaire. The reference could also go the other way if that somehow makes more sense. The Binary could be a PDF or a HTML page representing the Questionnaire and would need to be maintained separately from the Questionnaire.</p>\n<p>So my question is, has anyone had this use case before, and if not is this something that should be brought into the SDC?</p>\n<p>(Looked through the SDC beforehand, but could not find anything. Hopefully I did not oversee anything)</p>",
        "id": 199064621,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1590691491
    },
    {
        "content": "<p>One possible solution would be to have the Questionnaire's narrative be an 'image' which references a contained binary for the PDF.  That way you only have to worry about one resource.  (If you'd like an example of that included in SDC, feel free to submit a change request...)</p>",
        "id": 199067744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590692910
    },
    {
        "content": "<p>Although it could be difficult to make a print version of some Questionnaires, I would think that if there were a print version of a particular form, one could make a Questionnaire version of it that could be printed.</p>",
        "id": 199501063,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1591108408
    },
    {
        "content": "<p>Another option would be to do something special like we do for binary, and support the Accept header?</p>",
        "id": 199563598,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1591138763
    },
    {
        "content": "<p>It's difficult to auto-generate, it usually looks pretty bad. For some questionnaires there's already a print version or it makes sense to create one since (in Norway) you are allowed by law to say that I do not use digital services. In those scenarios we would need to use ordinary mail and have a proper print version.</p>\n<p>Brian, are you thinking something like this:</p>\n<div class=\"codehilite\"><pre><span></span><code>Accept: application/octet-stream\nGET Questionnaire/12\n</code></pre></div>",
        "id": 199844159,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1591343150
    },
    {
        "content": "<p>or directly something like this:</p>\n<div class=\"codehilite\"><pre><span></span><code>Accept: application/fhir+pdf\nGET Questionnaire/12\n</code></pre></div>",
        "id": 199849623,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1591347124
    },
    {
        "content": "<p>In the tools presentation of the connectaton I've shown shorty our ReportDesigner, which basically takes care of the visual design and  binding of the questionnaire items, but right now it is saved in external (custom) XML structure, with only indirect connection to the questionnaire. I would very much like to have it at least in the repository somewhere, to properly reference it and for history management. </p>\n<p>We ware looking also at the binary resource, but it is too \"light\" for my taste, as I'd rather have something that can be referenced with cannonical and also support version property itself. That's why my current thinking is to have another Questionnaire that specifically contains the definition of the print layout (XML or whatever custom format), then use the <em>url</em> property to specify it is a print layout, use the <em>derivedFrom</em> to point which \"real\" questionnaire it is for (as it is cannonical), any of the other properties that might be handy, like <em>date</em>, <em>contact</em>, <em>publisher</em>, etc. The idea is, that the print version might have different publishing workflow and different people responsible than the questionnaire itself.</p>\n<p>How to only question I haven't decided yet is to where actually put the print layout. I see 3 options at the moment:</p>\n<ul>\n<li>extension on the print questionnaire</li>\n<li>one item, that is just a reference to a binary resource, which contains the print layout definition in any applicable format.</li>\n<li>one text item that contains the print layout definition (which is XML in my case)</li>\n</ul>\n<p>I will very much appreciate you comments on this. Thanx in advance.</p>",
        "id": 199851658,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1591348341
    },
    {
        "content": "<p>The reasoning for using <code>application/octet-stream</code> was that we do not know what kind of format it is, coulde be PDF, HTML or something completely else. I only know that I want to handle it as Binary.</p>",
        "id": 199861934,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1591355479
    },
    {
        "content": "<p>If we were going to support that, I think we'd want to nail down the format for interoperability purposes</p>",
        "id": 199881640,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591366296
    },
    {
        "content": "<p>Do you want only one format, or could there be more than one? We have been experimenting with both PDF and HTML</p>",
        "id": 200067776,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1591603643
    },
    {
        "content": "<p>My personal preference would be a single format unless we think there are multiple sub-usecases.</p>",
        "id": 200102759,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591625642
    },
    {
        "content": "<p>I was thinking for something more generic, that can be rendered to PDF or HTML (or Word file if needed).</p>",
        "id": 200140663,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1591642315
    },
    {
        "content": "<p>For example?</p>",
        "id": 200163318,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591655154
    },
    {
        "content": "<p>I was thinking about XSL-FO, but will need to research a little more. Will look into it (and possible alternatives) and will report here. Any pointers are welcome. Will check also  CSS3-page (<a href=\"https://www.w3.org/TR/css-page-3/\">https://www.w3.org/TR/css-page-3/</a>)</p>",
        "id": 200200185,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1591695012
    },
    {
        "content": "<p>Think about what most questionnaire authors would reasonably be able to provide - unless your expectation is that we'd generate the XSL-FO for them?</p>",
        "id": 200233516,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591711970
    },
    {
        "content": "<p>I am kind of going back to my initial request and trying to describe my use cases a little bit clearer. <br>\nThere are two use cases that do not directly affect formats.</p>\n<ol>\n<li>There is the use case where you want to send a printable form to someone through ordinary mail, they will fill it out and send it back to you, it might be OCR scanned.</li>\n</ol>\n<ul>\n<li>Here I need to be able to find the print version by ideally a reference on the Questionnaire to a DocumentReference or Binary.</li>\n</ul>\n<ol start=\"2\">\n<li>There is the use case where you want a printable version and merge it with the entries that the user filled out </li>\n</ol>\n<ul>\n<li>I think a reference to a DocumentReference or Binary would be perfectly fine here as well. Unless we want to describe how we merge those entries.</li>\n</ul>\n<p>For me just a reference to a Binary or DocumentReference would suffice, but using the narrative and an image as suggested pr. Lloyd is not something that I fancy too much.<br>\nBack to the \"known formats\" I could for example probe the DocumentReference/Binary and determine if I support that format or not.</p>\n<p>Then there is Stoyan's use case where as I understand want to describe the actual merging of the contents of the Questionnaire using something like XSL-FO. This could also be Adobe's FDF or XFDF</p>",
        "id": 200234551,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1591712357
    },
    {
        "content": "<p>If we <em>don't</em> want to use the narrative, we could have an extension that would let you point to a PDF or website.  Only challenge with that is that the narrative is <em>supposed</em> to be the human-readable version of the form.</p>",
        "id": 200235166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591712605
    },
    {
        "content": "<p>This is not a use case of a system that cannot understand FHIR, or only understands part of it. This is a system that understands FHIR and needs to invoke a process involving  sending a printable version of a Questionnaire to a patient by mail. I agree with the purpose of the narrative, but it seems error-prone in a process such as this.</p>",
        "id": 200239390,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1591714156
    },
    {
        "content": "<p>Do you want to submit a change request for us to define an extension?</p>",
        "id": 200242452,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591715165
    },
    {
        "content": "<p>Yes, I can do that. I'll create a draft extension and submit a CR.</p>",
        "id": 200244042,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1591715737
    }
]