[
    {
        "content": "<p>For our project's questionnaires, we have many, many questions where the initial value for Yes/No questions is preset to \"No\" in order to save time for the users using item.initial.value[x].   These work fine with the LHC Forms rendering. </p>\n<p>But, our IG is producing this error message:</p>\n<p>que-11: 'If one or more answerOption is present, initial[x] must be missing' </p>\n<p>So, I changed out the item.initial.value[x]  in the questionnaires to option.initialSelected. </p>\n<p>Now, I am finding out that LHC-Forms does not support option.initialSelected  per  <a href=\"https://github.com/lhncbc/lforms/blob/master/r4-support.md#not-yet-supported\">https://github.com/lhncbc/lforms/blob/master/r4-support.md#not-yet-supported</a></p>\n<p>The workaround is<br>\nanswerOption.initialSelected: For now you need to use item.initial.value[x] instead, despite the contraint that says, \"answerOption.empty() or initial.empty()\".</p>\n<p>but that doesn't validate in the IG because of que-11.</p>\n<p>At this point, I think the best solution for my project is:</p>\n<ul>\n<li>\n<p>Leave item.initial.value[x]  for the questions in the questionnaires that need to default to \"No\"  on our website since they work fine</p>\n</li>\n<li>\n<p>For the IG, replace initial[x] with option.initialSelected for the questions that need to default to \"No\" </p>\n</li>\n</ul>\n<p>Any other suggestions?   </p>\n<p>Is it permissible to set a default value of \"No\" via calculatedExpression since we can now treat calculatedExpression items as editable by the user?  I want the coding of \"No\",  not a string.</p>",
        "id": 273424617,
        "sender_full_name": "Diane",
        "timestamp": 1645995374
    },
    {
        "content": "<p>I think the solution is for LHCForms to add support for \"initialSelected\".</p>",
        "id": 273507668,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646062770
    },
    {
        "content": "<p>Thanks, Lloyd.   I am going to convert  the questionnaires in the IG to option.initialSelected.</p>\n<p><span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>    Heads up that if we have a next phase of our project, we will request support in LHC-Forms for option.initialSelected.</p>",
        "id": 273513676,
        "sender_full_name": "Diane",
        "timestamp": 1646064888
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179255-questionnaire/topic/que-11.20workaround/near/273507668\">said</a>:</p>\n<blockquote>\n<p>I think the solution is for LHCForms to add support for \"initialSelected\".</p>\n</blockquote>\n<p>I suppose, but why not allow initial.value[x] as long as it is present in the answerOptions?</p>",
        "id": 273514083,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1646065051
    },
    {
        "content": "<p>Because we didn't want two ways to say the same thing</p>",
        "id": 273514346,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646065155
    },
    {
        "content": "<p>Then wouldn't that have been better to remove the option.initialSelected?</p>",
        "id": 273541286,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1646076632
    },
    {
        "content": "<p>The advantage of answerOption.initialSelected is that you can just mark an answer in the list; you don't have to repeat the Coding (or whatever type) in initialCoding.</p>",
        "id": 273541587,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1646076764
    },
    {
        "content": "<p>At the cost of having 2 ways to do defaults, and this invariant</p>",
        "id": 273541988,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1646076954
    },
    {
        "content": "<p>Without initialSelected you would still need an invariant to require that initial[x] be in answerOption.</p>",
        "id": 273542157,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1646077026
    },
    {
        "content": "<p>I prefer using initial[x] always (which is what your current implementation does if I'm not mistaken)<br>\nOtherwise there are 2 ways to specify a coded initial value depending on if using answeroption, answer valueset or answerexpression</p>",
        "id": 273548306,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1646079848
    },
    {
        "content": "<p>Well, you could ask for us to revisit the original tracker on one of our calls</p>",
        "id": 273558357,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646084579
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-22686\">https://jira.hl7.org/browse/FHIR-22686</a>   is the original Jira item, which was reopened once before.   Didn't know that I was (re)opening a can of worms.  <span aria-label=\"fear\" class=\"emoji emoji-1f628\" role=\"img\" title=\"fear\">:fear:</span></p>\n<p>I have updated our Questionnaire definitions to initial[x]  for our website  and  answerOption.initialSelected for our IG.   To me,   initial[x]   and  answerOption.initialSelected are both equally nice to use.    initial[x]   is more intuitive because it is similar in syntax to initial value for other item types.  But, answerOption.initialSelected is more concise.  </p>\n<p>Maybe the que-11   invariant  should say that you can't use both initial[x]  and  answerOption.initialSelected   on the same item, but either one is acceptable.</p>",
        "id": 273570991,
        "sender_full_name": "Diane",
        "timestamp": 1646091937
    },
    {
        "content": "<p>Two solutions to the same problem helps no-one.  We should land on one mechanism and mandate it.  (Which is what we had done.)  We can choose to switch the answer, but we definitely shouldn't allow both.</p>",
        "id": 273571861,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646092596
    },
    {
        "content": "<p>I don't think changing the resolution will make a difference to form fillers that have implemented initial[x] support.  initialSelected is in R4 Questionnaire, so it needs to be supported.  (We haven't yet, but we should.)  If we revise the tracker item and remove initialSelected for R5, we will still need to support it for R4, and we'll need to continue to support initial[x] for R5.  So, from an implementation point of view, there are two ways of doing the same thing.  On the other hand, if we don't change the resolution and keep initialSelected, then support for that will still need to be added to LHC-Forms, but we are unlikely to remove support for initial[x] (on import -- we would not export it way).  However, for newly written form fillers, which only support initialSelected when answerOption is present, and not initial[x], there will be an advantage if the resolution stays as it is.</p>",
        "id": 273573656,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1646093732
    }
]