[
    {
        "content": "<p>[Copied over from Implementters]<br>\nI'm looking at a use case where a \"referrer\" can ask for a refferal to a care setting. The Care Setting returns a request for the information they require to complete the referral. I was thinking that the request for information would be a Questionnaire. However, rather than a QuestionnaireResponse, I would prefer a Message Bundle as the response to the Quesionnaire (containing Patient details, Condition details, History detailas &amp; whatever). I see from SDC (Structured Data Capture) spec this all seems possible. Could someone point me to a live public test FHIR server that has implmented the URL: [base]/QuestionnaireResponse/[id]/$extract operation, so I can test this out?</p>",
        "id": 250603116,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1629887941
    },
    {
        "content": "<p>The only mechanism that could produce a message Bundle from a Questionnaire would be the StructureMap extraction approach.  I don't know if there are any test servers that implement that, but you can test most of it by just working with StructureMap.  The FHIR validator will execute one.</p>",
        "id": 250623550,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629899807
    },
    {
        "content": "<p>Just loking down the StructureMap resource &amp; notice that the example <a href=\"http://hl7.org/fhir/R4/structuremap-supplyrequest-transform.xml.html\">http://hl7.org/fhir/R4/structuremap-supplyrequest-transform.xml.html</a> could do with an update, as it references SupplyRequest structures as they were in STU3. Is there a simple way to send in a corrected example?</p>",
        "id": 250742238,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1629968069
    },
    {
        "content": "<p>Submit a change request (using the \"propose a change\" link)</p>",
        "id": 250784304,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629989341
    }
]