[
    {
        "content": "<p>There is the extention <strong><em>questionnaire-optionExclusive</em></strong> which is defined as \"If true, indicates that if this answerOption is selected, no other possible answers may be selected, even if the item is a repeating question.\"</p>\n<p>The fhir spec lists <strong>Questionnaire.item.answerOption</strong> as the only place where <em>questionnaire-optionExclusive</em> is used.</p>\n<p>However, when a Questionnaire defines values sets within the <strong>contained</strong> section and not within the item (<em>answerOption</em>) how could an exclusive option be marked for a ValueSet?</p>\n<p>I didn't find any corresponding extension listed under <a href=\"https://www.hl7.org/fhir/2018Sep/valueset-extensions.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/2018Sep/valueset-extensions.html\">https://www.hl7.org/fhir/2018Sep/valueset-extensions.html</a>.</p>",
        "id": 154021583,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1543489107
    },
    {
        "content": "<p>That seems like a reasonable suggestion, but only in cases where that is always the case with the valueset, irrespective of where it is used.<br>\nPlease log a tracker for this (link at the bottom of the page of the spec)</p>",
        "id": 154021600,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543491300
    },
    {
        "content": "<p>So, in cases where it is NOT always the case with the ValueSet, would this mean that the ValueSet might be defined as contained (because it is re-used by several questions, for example) but in the one question where the <em>optionExclusive</em> is needed I would have to duplicate the definition of the ValueSet in form of serveral <em>option</em> elements (one with the <strong><em>questionnaire-optionExclusive</em></strong> extention attached to it)?</p>",
        "id": 154021616,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1543492854
    },
    {
        "content": "<p>For that usage, I think so. And typically I'd expect these aren't large sets af values too.</p>",
        "id": 154022391,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543786500
    },
    {
        "content": "<p>Whether it's contained or not doesn't really matter.  If we think that people are going to need this when using value sets rather than enumerated options, then I guess we'll have to expand the scope of optionExclusive to allow it to be referenced in either valueset or possibly codesystem.</p>",
        "id": 154024249,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544480487
    },
    {
        "content": "<p>And permit these extension values somehow coming out of the terminology sub-system.</p>",
        "id": 167633558,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559968191
    },
    {
        "content": "<p>Wanna submit a change request?</p>",
        "id": 167653695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560004858
    }
]