[
    {
        "content": "<p>On  the Questionnaire item is there an extension where it has a way to uniquely identify an answer for a choice type?</p>\n<p>For example: <br>\nitem: [ {id: .. , \"valueString\": \"yes\"}]<br>\nWe are thinking on using valueCoding like, where coding would the unique id</p>\n<p>\"valueCoding\": {<br>\n                              \"system\": \"../healthFactors\",<br>\n                              \"code\": \"1\",<br>\n                              \"display\": \"yes\"<br>\n                            }</p>",
        "id": 242394183,
        "sender_full_name": "milton mitjans",
        "timestamp": 1623440784
    },
    {
        "content": "<p>First, 'system' must always be a full URI.  It can't be relative.<br>\nCan you better explain your use-case for a unique id?  Typically if you're going to enumerate options, you're going to use valueCoding.  valueString is only for those situations where there's no associated code and you have no desire for there to be one.</p>",
        "id": 242396576,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623441975
    },
    {
        "content": "<p>Yes the system would be a full url, didn't expose it on the example. </p>\n<p>The use case is that we need to have the ability to map an answer to have the ability to :</p>\n<ol>\n<li>The client grab a \"text\" from a CDN system</li>\n<li>The server to identify the answer and map it to algorithm to calculate a \"score\" which is propietary</li>\n</ol>",
        "id": 242398944,
        "sender_full_name": "milton mitjans",
        "timestamp": 1623443418
    },
    {
        "content": "<p>The combination of QuestionnaireResponse.questionnaire, linkId, and the valueString should be unique and could serve as your unique id.</p>",
        "id": 242593414,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1623676035
    },
    {
        "content": "<p>Thanks Paul.</p>\n<p>If we have a Question like: </p>\n<p>How do you rate your visit?</p>\n<ul>\n<li>Good</li>\n<li>Bad</li>\n<li>Neutral</li>\n</ul>\n<p>If valueString is used as the unique id (with combination of questionnaire and linkId).  The answerOption could look like: <br>\n{  \"valueString\": \"good\"  }. The ID for \"good\" option would be something like questionnaireId.linkId.good. </p>\n<p>Is there a way we can define the actual String Displayed in UI for the value via another extension? </p>\n<p>Sometimes the text value can be grabbed from CDNs and also there might be use cases (on our side) where the text can change based on the UI Clients. For example some might choose \"Good\" while other \"Ok\" but the meaning / value (for scoring) would be the same.</p>",
        "id": 242722730,
        "sender_full_name": "milton mitjans",
        "timestamp": 1623758951
    },
    {
        "content": "<p>If you want the different strings to be treated the same, you probably want to work with a Coding instead of a string.  Then you could rely on Coding.code and let Coding.display vary for the same code.</p>",
        "id": 242740492,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1623767175
    },
    {
        "content": "<p>Agree with Paul.  Typically if you're going to use scores, you want codes (with an ordinalValue extension for the weight).  The Coding.display is what's expected to be displayed in the UI (though there can be exceptions, e.g. language translation).</p>",
        "id": 243860633,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624578416
    }
]