[
    {
        "content": "<p>I wanted to ask what the preferred way to group questionnaires together was. For instance, if I'm seeing a teenager for a clinic visit. Every time a teenager visits the clinic, we should ask them to complete the PHQ-9, GAD-7, and a trauma questionnaire. However, if, say, a toddler comes in, maybe I want to do a developmental screen for the child, and the PHQ-9 for the parent. So in all here, I have 4 questionnaire resources.</p>\n<ol>\n<li>PHQ-9</li>\n<li>GAD-7</li>\n<li>Trauma Questionnaire</li>\n<li>\n<p>Developmental Screen<br>\nI want to be able to have a single resource that references the others:</p>\n</li>\n<li>\n<p>Questionnaires for 3 months old (would reference Developmental Screen and PHQ-9)</p>\n</li>\n<li>Questionnaires for teenagers (would reference PHQ-9, GAD-7 and Trauma questionnaire)</li>\n</ol>\n<p>I could put together a list resource that contains them all, or a bundle, or a group, I guess. Or something else maybe? What is the prevailing wisdom for how to do this?</p>",
        "id": 235617914,
        "sender_full_name": "Grey Faulkenberry",
        "timestamp": 1619065518
    },
    {
        "content": "<p>Maybe a CarePlan with a few ServiceRequests to fill the Questionnaires?</p>",
        "id": 235709803,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1619109888
    },
    {
        "content": "<p>Can you explain the purpose of the grouping?  What behavior is a questionnaire (or questionnaireResponse) being in the group vs. not going to drive?</p>",
        "id": 235731548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619118456
    },
    {
        "content": "<p>It would be to define a group of questionnaires for a certain kind of visit, or for a certain age, for instance. So everytime a child has their 1 year well child visit, this group of questionnaires should be given. Or, for a transplant workup, you need to ask this set of questionnaires. Or if a patient is new to your clinic, they need to complete this set of questionnaires.</p>",
        "id": 235752940,
        "sender_full_name": "Grey Faulkenberry",
        "timestamp": 1619127727
    },
    {
        "content": "<p>And since you may want to use the same questionnaire in more than one type of visit, or you may add or remove questionnaires to a certain type of visit, it would be nice if you could define a questionnaire, and then specify when it would be used, and which other questionnaires would be used with it in that particular case.</p>",
        "id": 235753257,
        "sender_full_name": "Grey Faulkenberry",
        "timestamp": 1619127863
    },
    {
        "content": "<p>If the intention is to say \"these forms should be filled out in these circumstances\", that's a type of protocol, and the resource to use would be PlanDefinition.  That would allow you to define the set, as well as any pre-conditions on the asking of each one, any dependencies in terms of which should be completed first, which are optional vs. required, etc.</p>",
        "id": 235758182,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619130594
    },
    {
        "content": "<p>Aha! I think that's what I was looking for, thanks!</p>",
        "id": 236085052,
        "sender_full_name": "Grey Faulkenberry",
        "timestamp": 1619376246
    }
]