[
    {
        "content": "<p>Would like some input on the following tracker item:<br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13934\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13934\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13934</a></p>\n<p>If other users of Questionnaire think this is useful then FHIR-I will consider adding this to core.</p>",
        "id": 155352187,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1547745427
    },
    {
        "content": "<p>The use of Reference itself is pretty unusual.  Limiting query results to a profile is also pretty unusual.  It seems a stretch to think that the intersection of the two use-cases belongs in core...</p>",
        "id": 155358992,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547751350
    },
    {
        "content": "<p>Isn't there already an extension for a filter to apply? Then could just include _profile=blah there and job would be done?</p>",
        "id": 156328316,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1547767120
    },
    {
        "content": "<p>This should be there for things like restricting to only active practitioners etc</p>",
        "id": 156328350,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1547767153
    },
    {
        "content": "<p>The proposal is to escalate the existing extension into core</p>",
        "id": 156329779,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547768555
    },
    {
        "content": "<p>.type can be reference, which is defined as \"Question with a reference to another resources as an answer\".<br>\nI could see the question being \"Which patient does this apply to?\" or maybe \"which medication did you take?\"<br>\nIt is not enough to just say \"list all Patient resources\" or \"list all Medication\" resources... I have a hard time envisioning a scenario where .type = \"reference\" and you <em>don't</em> want to limit the results to a profile</p>",
        "id": 157618378,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1549383616
    },
    {
        "content": "<p>... unless the code \"reference\" is intended to be a reference to a profile. in which case the description is not sufficient and should be updated</p>",
        "id": 157618439,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1549383688
    },
    {
        "content": "<p>There's a variety of ways to limit - profile, filter query, target server, etc.  Not sure we can standardize on just one.  Having References is itself barely core.</p>",
        "id": 157618568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549383813
    },
    {
        "content": "<p>if that's the case, then <br>\n1. I don't understand the advantage of the extension<br>\n2. It isn't obvious in documentation on how to filter in the way I'm describing, and should be</p>",
        "id": 157618828,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1549384042
    },
    {
        "content": "<p>The extension allows for the filtering.  Agree we should improve documentation on what possible filtering options exist</p>",
        "id": 157619862,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549384938
    },
    {
        "content": "<p>then I would agree to a resolution of \"persuasive with mod\" that entails updating documentation to clarify this use-case...</p>",
        "id": 157629695,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1549392487
    }
]