[
    {
        "content": "<p>If a question defines questionnaire-unit (which is for computation purposes), shouldn't that unit normally be displayed?  And if so, why do we need the \"unit\" option for questionnaire-itemControl (which is for display purposes)?  I don't think you are going to one to 'kg' and the other to '[lb_av]'.</p>",
        "id": 178693547,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1571688735
    },
    {
        "content": "<p>[lb_av] is not exactly human-friendly.</p>",
        "id": 178694214,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571689189
    },
    {
        "content": "<p>I was referring to the units by their codes.  questionnaire-unit takes a coding, and so comes with a human-friendly \"display\" field which in that case should say \"pound\".</p>",
        "id": 178694697,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1571689421
    },
    {
        "content": "<p>Sometimes systems will have an element they want rendered that says the unit and won't bother specifying questionnaire-unit because they're not thinking about population/extraction</p>",
        "id": 178695161,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571689716
    },
    {
        "content": "<p>So, right now, they could either do that by adding an item that has the unit option of questionnaire-itemControl , OR they could specify it with a  questionnaire-unit  on the item that has that unit.  I don't see that it saves them effort to use questionnaire-itemControl over questionnaire-unit.</p>",
        "id": 178695452,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1571689886
    },
    {
        "content": "<p>Questionnaire-itemControl is used with a text item that's expected to be rendered to the user.  questionnaire-unit is something intended to be used by translation software - there's no expectation it would be rendered (and generally it shouldn't be as it could be redundant with text in the question).</p>",
        "id": 178708572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571699861
    },
    {
        "content": "<p>I guess I see that possible redundancy as less of an issue that the redundancy of specifying the same unit twice using two separate extensions (for display and computation).  Someone might change the unit in one place and forget to change the other.</p>",
        "id": 178765267,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1571757163
    },
    {
        "content": "<p>True, though there are a wide range of other ways to create inconsistency.</p>",
        "id": 178766495,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571757899
    },
    {
        "content": "<p>I don't think that is a good reason to not remove this potential inconsistency.  I also don't see how it hurts to show questionnaire-unit, even if the unit is already expressed in the question.  You would have something like:</p>\n<div class=\"codehilite\"><pre><span></span>Enter weight in kilograms: ______ kg\n</pre></div>\n\n\n<p>... which seems fine.  There is no problem with the user getting two reminders about the right unit to be using; it is a lot safer than assuming the question will have the unit included, or that the designer remembered to add a sub-item with itemControl unit.</p>\n<p>Unless I hear some compelling reason to keep both, I will submit a tracker item to remove itemControl unit, and to add language to questionnaire-unit to note that it is now for display as well as computational purposes.</p>",
        "id": 178886361,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1571858300
    },
    {
        "content": "<p>The main reason is that the display name for a coded unit isn't necessarily what you want to display to the end user</p>",
        "id": 178917642,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571887728
    },
    {
        "content": "<p>Possibly not, but at least in UCUM, there are reasonable display strings (e.g. \"pounds\" for code \"[lb_av]\").  In such cases, there is no need to require the Questionnaire to specify the unit in two places.  Perhaps itemControl unit could be kept for the cases where the Questionnaire designer wanted to override the unit's display string.</p>",
        "id": 178959374,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1571928408
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25178\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25178\">GF#25178</a></p>",
        "id": 179971612,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1572984560
    }
]