[
    {
        "content": "<p>If I want to use questionnaire-choiceColumn to indicate additional columns to show for an item's answerValueSet, it looks like I first need to do an $expand (maybe with filter) to get a list of N items, and then do an additional N CodeSystem $lookup queries to get the properties requested by the questionnaire-choiceColumn instances for each item.  The $lookup queries could be done in a batch, but with at least HAPI FHIR the queries within a batch seem to be processed in series, so that might not help much.  Is there a better approach?</p>",
        "id": 208250291,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1598549782
    },
    {
        "content": "<p>It looks like the better approach is waiting for this two-year old ticket to be addressed:  <a href=\"http://jira.hl7.org/browse/FHIR-17324\">J#17324</a></p>",
        "id": 208355140,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1598627535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - thoughts on how to nudge this one forward?</p>",
        "id": 208363296,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598631214
    },
    {
        "content": "<p>bring it up on <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a> but I think it's moved forward...</p>",
        "id": 208400509,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598652871
    },
    {
        "content": "<p>The relevant thread on <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a>  appears to be <a href=\"#narrow/stream/179202-terminology/topic/Extensions.20vs.20properties\">https://chat.fhir.org/#narrow/stream/179202-terminology/topic/Extensions.20vs.20properties</a>, which seems to have stalled.</p>",
        "id": 208618724,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1598910043
    },
    {
        "content": "<p>That's covered with R5, so is a \"how to express it with R4\" that's not obvious.<br>\nI've done something here for some more custom prepop work, but forgot about this extension, and would be really useful.<br>\nThe issue with backporting I was confused what to to with the name of the backbone element and child props.</p>",
        "id": 208621279,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1598911666
    },
    {
        "content": "<p>Happy to add this to the fhir connectathon if you want?</p>",
        "id": 208621339,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1598911690
    },
    {
        "content": "<p>I had not realized it was covered in R5, but I can see on <a href=\"http://build.fhir.org\">build.fhir.org</a> that ValueSet expansions now can contain properties which were requested by a $expand operation.  That is a big step forward.  (It is not everything I would like, but it is the most important part.) I am not sure how it could be backported to R4 except as something non-standard.  For R4,  I will plan to try the N $lookup queries and see how bad it is.</p>",
        "id": 208630599,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1598918313
    },
    {
        "content": "<p>If one is using the choiceColumn extension to show, in a list, both the coding display strings and their associated property values, then when the user makes a selection, what happens to the property values for the coding the user selected?</p>",
        "id": 211986713,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1601593430
    },
    {
        "content": "<p>Nothing.  They're not captured as part of the Coding in the answer, certainly.</p>",
        "id": 211995865,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601602558
    },
    {
        "content": "<p>Sometimes one might want to fill in other form fields with same data that was showing in the list columns for the selected item.  It would be nice not to have to fetch the data a second time.   Perhaps it can be cached internally somehow.</p>",
        "id": 212064367,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1601639902
    },
    {
        "content": "<p>You can hold onto that information in memory, but you can't persist it.</p>",
        "id": 212071348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601644015
    },
    {
        "content": "<p>I think that's what Paul was looking for. So we had a consistent behaviour.</p>",
        "id": 213861690,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1603152191
    },
    {
        "content": "<p>Brian and I were discussing whether the data from the choiceColumn columns could be stored as a variable on the item, or the parent's item, so that other fields in the form (e.g. the same row of a table, or child items) could access it via FHIRPath.</p>",
        "id": 239654011,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1621542385
    },
    {
        "content": "<p>I'm going to experiment with this to see if it works.</p>",
        "id": 239668483,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621549622
    }
]