[
    {
        "content": "<p>Is there a standard mechanism  used to indicate that a user clicked a \"skip this question\" button when taking a questionnaire?</p>\n<p>I want to record the fact that the user saw the question on the questionnaire, but chose not to answer it</p>\n<p>I guess I could add the question to the questionnaireresponse.item without an answer...but that seems kind of ambiguous</p>",
        "id": 172344103,
        "sender_full_name": "Kyle Neumeier",
        "timestamp": 1564781565
    },
    {
        "content": "<p>I don't know about a \"standard mechanism\", but one way to do that would be to have the \"skip question\" button be a checkbox that would be part of the Questionnaire definition (and so it would be sent back with the response).  You could use item.enableWhen to hide the other question with that checkbox was checked.</p>",
        "id": 172344788,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1564782225
    },
    {
        "content": "<p>Thanks. That's not a bad idea. But user could choose to skip a question with other answer types, like integer or free text for example. </p>\n<p>My problem might be pretty specific, unsure about that. So any ideas welcomed :)</p>",
        "id": 172344988,
        "sender_full_name": "Kyle Neumeier",
        "timestamp": 1564782405
    },
    {
        "content": "<p>I'm not sure how the data type of the question being skipped affects things.</p>",
        "id": 172345298,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1564782727
    },
    {
        "content": "<p>Hmm, had been thinking that you meant that I should just add a question.option with value = \"skip\".  But maybe you're saying I add a second question</p>",
        "id": 172345594,
        "sender_full_name": "Kyle Neumeier",
        "timestamp": 1564783076
    },
    {
        "content": "<p>You could have a question that allows an answer of \"answer\" or \"skip\" with a child question that actually captures an answer.  That said, in most cases, once the user submits the form, the presumption is that they've been presented with all of the 'enabled' questions and any without answers were skipped over.  (Though I suppose in some cases they might have been skipped over accidentally rather than on purpose.)</p>",
        "id": 172377453,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564784063
    },
    {
        "content": "<p>maybe another way of saying this is that the questions on this questionnaire are optional. User chooses not to answer a question.  Adding another answer for all optional questions seems heavyweight.</p>",
        "id": 172377917,
        "sender_full_name": "Kyle Neumeier",
        "timestamp": 1564784607
    },
    {
        "content": "<p>It's very heavy-weight.  More typical is you just omit an answer.  If the QuestionnaireResponse is marked as 'complete', it means the user has seen all the questions and answered all those they care to.</p>",
        "id": 172378026,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564784741
    },
    {
        "content": "<p>Ok, thanks, that makes sense. Took me a second to frame my question correctly. My initial question was overly complicated :)</p>",
        "id": 172378306,
        "sender_full_name": "Kyle Neumeier",
        "timestamp": 1564785010
    },
    {
        "content": "<p>I had a question along these lines as well--for an unanswered question, would the expected structure be an item node with no answer node, or an item node with an empty answer node, or should both be supported?</p>",
        "id": 223666426,
        "sender_full_name": "Cameron McKinney",
        "timestamp": 1611333735
    },
    {
        "content": "<p>A QuestionnaireResponse would not include items that do no have answers, unless those items had child items with answers.</p>",
        "id": 223668231,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1611334648
    },
    {
        "content": "<p>Understood--so the idea is that the reader of the QuestionnaireResponse would refer to the linked Questionnaire and already have information that questions were skipped because they would be in the Questionnaire but not the response?</p>",
        "id": 223674745,
        "sender_full_name": "Cameron McKinney",
        "timestamp": 1611337669
    },
    {
        "content": "<p>Right.</p>",
        "id": 223675800,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1611338154
    },
    {
        "content": "<p>I thought display items needed to be in the response too? (for supporting what display was shown to the user?)</p>",
        "id": 223868122,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1611564179
    },
    {
        "content": "<p>(I just updated me renderer to do this last week)</p>",
        "id": 223868141,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1611564197
    },
    {
        "content": "<p>We don't have a rule in SDC mandating it be there - though I agree it's good practice.</p>",
        "id": 223910326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611587647
    }
]