[
    {
        "content": "<p>I’ve a number of lab forms from different HAs related to the same domain and whereas they all different there are some commonalities between them especially with the typical demographic questions (e.g., person’s name, address, contact points, emergency contacts, etc.)</p>\n<p>Instead of repeating all of those in each and every Questionnaire, would it be useful to create it once and reuse in the same way as CDA section level templates? Has anyone done this and what you were using to \"glue\" smaller Questionnaires together? Will the Composition resource work here and if not can we extend the use of Composition to such case as well?</p>",
        "id": 183764649,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1576685837
    },
    {
        "content": "<p>We have an open item to talk about this, but there are complexities around uniqueness of linkIds, potential for evolution of referenced forms, how a QuestionnaireResponse should look when it's based on multiple Questionnaires, etc.  So it hasn't been landed yet.  You can follow <a href=\"http://jira.hl7.org/browse/FHIR-22356\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-22356\">J#22356</a> to see how it gets resolved</p>",
        "id": 183766371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576686959
    },
    {
        "content": "<blockquote>\n<p>We have an open item to talk about this, but there are complexities around uniqueness of linkIds, potential for evolution of referenced forms, how a QuestionnaireResponse should look when it's based on multiple Questionnaires, etc.  So it hasn't been landed yet.  You can follow <a href=\"http://jira.hl7.org/browse/FHIR-22356\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-22356\">J#22356</a> to see how it gets resolved</p>\n</blockquote>\n<p>There is no need for a single QuestionnaireResponse. There may be as many QuestionnaireResponses as original Questionnairies combined in a similar way (i.e., using the same Composition).</p>",
        "id": 183780853,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1576696546
    },
    {
        "content": "<p>If your purpose is to capture a set of data together, it's not going to work terribly well if your 'common' demographic responses are stored somewhere else.  (And if that was fine, then just define your individual questionnaires and fill them out independently).  If you define a single questionnaire where the contents include modules that are other questionnaires, you're generally going to want the results captured in a single instance.</p>",
        "id": 183782054,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576697292
    },
    {
        "content": "<blockquote>\n<p>then just define your individual questionnaires and fill them out independently</p>\n</blockquote>\n<p>This is certainly an option, the problem is to retrieve all QuestionnaireResponses related to a single \"paper\" form. That's where I started asking if there is a way to define a set of Questionnaires somehow (I'd prefer not to create yet another extension for that).</p>",
        "id": 183860875,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1576772568
    },
    {
        "content": "<p>That could be a request of some form like a servicerequest?</p>",
        "id": 184414382,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1577613735
    },
    {
        "content": "<blockquote>\n<p>That could be a request of some form like a servicerequest?</p>\n</blockquote>\n<p>No, the idea is to reuse Questionnaire \"templates\" or groups to build forms. I do not see how ServiceRequest may help there.</p>",
        "id": 184494579,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1577734118
    }
]