[
    {
        "content": "<p>Are there any examples on questionnaire population?<br>\nI've looked into using the prepopulate parameter for \"<a href=\"http://lhncbc.github.io/lforms/\">http://lhncbc.github.io/lforms/</a>\" and read through \"<a href=\"http://hl7.org/fhir/uv/sdc/2019May/populate.html\">http://hl7.org/fhir/uv/sdc/2019May/populate.html</a>\" about Observation-based, FHIRPath-based, and StructureMap-based population but have not managed to get anything working.<br>\nExamples of any working questionnaire population would be appreciated.</p>",
        "id": 240952081,
        "sender_full_name": "Corey Wen",
        "timestamp": 1622558523
    },
    {
        "content": "<p>There are a few examples of Observations-based and FHIRPath-based prepopulation in the \"Featured Questionnaire\" list in the app at <a href=\"https://lhcforms.nlm.nih.gov/sdc\">https://lhcforms.nlm.nih.gov/sdc</a>.</p>",
        "id": 240954200,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1622559362
    },
    {
        "content": "<p>I tried following the example by copying the \"US Surgeon General family health portrait\" questionnaire json, then using LHC-forms to render it after setting the FHIR  context and prepoulate parameter for LHC-forms to true but the questionnaire did not get populated with the patient's first name and birthdate.<br>\nWhat could be the cause of this?</p>\n<div class=\"codehilite\"><pre><span></span><code>LForms.Util.setFHIRContext(client)\nLForms.Util.addFormToPage(questionnaire, &#39;questionslhc&#39;, { prepopulate: true })\n</code></pre></div>",
        "id": 240969679,
        "sender_full_name": "Corey Wen",
        "timestamp": 1622565699
    },
    {
        "content": "<p>That looks correct.<br>\n1) What version of LHC-Forms are you using? <br>\n2) Are you sure the launchContext extension is in the questionnaire object?   There is more than one version of the \"US Surgeon General Family Health Portrait\", and not all have it.<br>\n3) Is there any error or stack trace reported in the console?</p>",
        "id": 240971986,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1622566709
    },
    {
        "content": "<p>1) The version is 28.1.3<br>\n2) I used the questionnaire object by going to the \"Show As\" dropdown -&gt; \"FHIR Questionnaire (SDC)\" which gave me the FHIR SDC Questionnaire Resource in json format. The json has an extension + url field which looks like the following</p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;extension&quot;: [\n    {\n      &quot;url&quot;: &quot;http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaire-launchContext&quot;,\n</code></pre></div>\n<p>3) There is no error or stack trace reported in the console.</p>",
        "id": 240977106,
        "sender_full_name": "Corey Wen",
        "timestamp": 1622568937
    },
    {
        "content": "<p>Did you include the FHIR support file for R4? (<a href=\"http://lhncbc.github.io/lforms/#fhirScripts\">http://lhncbc.github.io/lforms/#fhirScripts</a>).  If so, could you create a jsfiddle that shows the problem?</p>",
        "id": 240979924,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1622570230
    },
    {
        "content": "<p>The FHIR support file for R4 is included. I tried to set up a jsfiddle but am not sure how to get it working so that it includes the EHR launch so that you can select a patient.</p>",
        "id": 240985683,
        "sender_full_name": "Corey Wen",
        "timestamp": 1622572704
    },
    {
        "content": "<p>LForms.Util.setFHIRContext(FHIR.client({serverUrl: serverUrl,  tokenResponse: { patient: patientId }}));</p>",
        "id": 240986705,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1622573221
    },
    {
        "content": "<p>(so, you don't need the SMART launch.)</p>",
        "id": 240986967,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1622573347
    },
    {
        "content": "<p>Here is the jsfiddle, I would appreciate it if you could read through the comments. <a href=\"https://jsfiddle.net/dL2jokpv/1/\">https://jsfiddle.net/dL2jokpv/1/</a><br>\nI managed to get the population to work but I don't quite understand why it works in this manner.<br>\nInitially I was using the questionnaire resource that I copy pasted from \"<a href=\"https://lhcforms.nlm.nih.gov/sdc\">https://lhcforms.nlm.nih.gov/sdc</a>\", from the \"Show As\" dropdown -&gt; \"FHIR Questionnaire from Server\" or \"FHIR Questionnaire (SDC)\"<br>\n<a href=\"/user_uploads/10155/CeUaKN-C_XxAJtgY4qzS8g-r/image.png\">image.png</a> <br>\nNeither of these resources when used as a json resource were prepopulated in the original application.<br>\nThen, I set up the jsfiddle and found out the questionnaire was successfully populated using the \"fhirQuestionnaireSDC\" but not the \"fhirQuestionnaireFromServer\".<br>\nAfter, I tried fetching the questionnaire resource from the URL\"<a href=\"https://lforms-fhir.nlm.nih.gov/baseR4/Questionnaire/54127-6-x\">https://lforms-fhir.nlm.nih.gov/baseR4/Questionnaire/54127-6-x</a>\" and this was also able to populate in the jsfiddle. Then I tested fetching from that URL to use in the original application and it was able to populate.<br>\nI'm unsure as to why the two resources (fetching from URL/\"fhirQuestionnaireSDC\") work in the jsfiddle but only fetching from the URL works in the original application for populating.<br>\nAdditionally, the resulting resource fetched from the URL \"<a href=\"https://lforms-fhir.nlm.nih.gov/baseR4/Questionnaire/54127-6-x\">https://lforms-fhir.nlm.nih.gov/baseR4/Questionnaire/54127-6-x</a>\" is very similar to the \"fhirQuestionnaireFromServer\" resource with only a few differences on certain lines, so I'm unsure as to why one works and the other does not.<br>\nThe only differences were version and the left (fhirQuestionnaireFromServer) had extensions for observationExtract, while the right (fetched from URL) did not. Everything else seemed to be the same.<br>\n<a href=\"user_uploads/10155/W_clxikg1XfKqTd7q27UPPhF/image.png\">image.png</a> <br>\n<a href=\"user_uploads/10155/buvCR-xmhEblQ5iHp6opkCCw/image.png\">image.png</a></p>",
        "id": 241070776,
        "sender_full_name": "Corey Wen",
        "timestamp": 1622579319
    },
    {
        "content": "<p>When you choose the \"FHIR Questionnaire (SDC)\" option you are getting a new export to Questionnaire of what was imported into LHC-Forms, so there could be differences, but both <em>should</em> work the same.  I will take a look.</p>",
        "id": 241076650,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1622582083
    },
    {
        "content": "<p>I see the problem.   The reason we tag LHC-Forms' output with \"lformsVersion\" is because occasionally there is a breaking change in the output.  The Questionnaire at <a href=\"https://lforms-fhir.nlm.nih.gov/baseR4/Questionnaire/54127-6-x\">https://lforms-fhir.nlm.nih.gov/baseR4/Questionnaire/54127-6-x</a> was generated by LHC-Forms 25.0.0.  In version 29.0.0, the URI for the launchContext extension was updated to match what is currently at <a href=\"http://build.fhir.org\">build.fhir.org</a>.  So, the original problem you were having was that you were using the 29.0.0 URI with a 28.1.3 LHC-Forms.   The SDC Questionnaire App at <a href=\"https://lhcforms.nlm.nih.gov/sdc\">https://lhcforms.nlm.nih.gov/sdc</a> handles these problems by using our <a href=\"https://github.com/lhncbc/lforms-updater\">lforms-updater</a> package, which relies on the version number in the tag to know what updates to apply to match the application's version.</p>",
        "id": 241085825,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1622588044
    },
    {
        "content": "<p>So, two options:<br>\n1) If you want your Questionnaire definition to be up-to-date with the SDC IG at <a href=\"http://build.fhir.org\">build.fhir.org</a> (well, more up to date), update your lforms package to 29+, and use the current launchContext URI.<br>\n2) If you don't care about being up to date or the small bug fixes in 29.0.3, stay at 28.1.3, and use the older launchContext URI (which you see in <a href=\"https://lforms-fhir.nlm.nih.gov/baseR4/Questionnaire/54127-6-x\">https://lforms-fhir.nlm.nih.gov/baseR4/Questionnaire/54127-6-x</a>)</p>\n<p>Note:  I am currently working on updating the initialExpression URI, which somehow was missed when updating the launchContext URI.  So, there will be another breaking change for that one, and another release of lforms-updater.   (BTW, in case you are wondering, that package only works to upgrade, and won't downgrade to earlier versions.)</p>",
        "id": 241086608,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1622588538
    }
]