[
    {
        "content": "<p>I want to implement a set of rules that dictate an ordering of questions.  I have an array of rules that are processed in order and if one of the rules fires, it indicates which question to go to next via the linkId.  I don't see anything in the SDC that can handle this but I thought before I created an extension, I'd ask if someone has already done something around question logic.</p>",
        "id": 217185883,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605728269
    },
    {
        "content": "<p>At the moment, all items in a questionnaire have a fixed order.  You can cause some to turn on and off based on other answers, but you can't change their order of appearance.  Can you give an example of where changing order would be necessary?</p>",
        "id": 217225116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605755438
    },
    {
        "content": "<p>Unless you use the dynamic questionnaire stuff that was part of the Argonaut work, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> wherebis that defined again?</p>",
        "id": 217227869,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1605758858
    },
    {
        "content": "<p>We have a questionnaire with branches.  I like to think of them as Choose-Your-Adventure questionnaires. :) Our rules can be based on what you just answered as well as characteristics of the submitter or source.  We looked at 'enableWhen' but since one question could appear in different branches at different points, the rules for enableWhen would get quite complicated.</p>",
        "id": 217227960,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605758995
    },
    {
        "content": "<p>Take a look at the SDC adaptive questionnaire. I think this allows you to load the \"next page\" based on the results of the questionnaire so far.</p>",
        "id": 217228017,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1605759047
    },
    {
        "content": "<p>i did look at that but didn't find, i'll go take another look</p>",
        "id": 217228025,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605759069
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/HL7/sdc/adaptive.html\">http://build.fhir.org/ig/HL7/sdc/adaptive.html</a></p>",
        "id": 217228032,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1605759091
    },
    {
        "content": "<p>right, i remember reading that, but that assumes a server with the question dynamically determined.  this is sort of like that except that I want to exchange the rules for determining the next question with the questionnaire itself</p>",
        "id": 217228272,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605759400
    },
    {
        "content": "<p>Hmm, it seems to require a certain amount of support on the server side; I don't see a way to define the full logic in the questionnaire.</p>",
        "id": 217228276,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1605759403
    },
    {
        "content": "<p>right.</p>",
        "id": 217228278,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1605759406
    },
    {
        "content": "<p>If complex enableWhen conditions are your main block, what about using a variable to factor out those conditions?</p>",
        "id": 217228440,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1605759639
    },
    {
        "content": "<p>I just looked at the hidden extension, but that won't do what you want either--it only takes a constant true/false, not a dynamic value.</p>",
        "id": 217228508,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1605759729
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191380\">Elliot Silver</span> <a href=\"#narrow/stream/179255-questionnaire/topic/Rules.20on.20question.20order/near/217228440\">said</a>:</p>\n<blockquote>\n<p>If complex enableWhen conditions are your main block, what about using a variable to factor out those conditions?</p>\n</blockquote>\n<p>Yes, except that the problem is that I have different branches where the same question occurs in different spots.  So if I had a list of questions 1,2,3,4,5, one branch might be 1,3,4,5, another might be 1,2,5,3,4, etc.</p>",
        "id": 217228694,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605760071
    },
    {
        "content": "<p>Can you give a specific example why sometimes 5 needs to be asked before 3 and 4 and sometimes after?</p>",
        "id": 217264272,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605790286
    },
    {
        "content": "<p>i was making that example up out of whole cloth.  let me find a real branching example that has behaviour like this</p>",
        "id": 217302678,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605806745
    },
    {
        "content": "<p>okay, the questionnaire that I found had a set of questions for everyone, a set of questions for males, a set of questions for females, and then some wrap-up questions.  I can actually reduce the amount of branching by applying some logic, but that wasn't the way that the questionnaire was created in the system.</p>",
        "id": 217304552,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605807586
    },
    {
        "content": "<p>i've abstracted the questions and reordered the branches so that it looks like this:</p>\n<div class=\"codehilite\"><pre><span></span><code>1) What is your gender?  M/F/O\n    if M and age &gt; 40, go to 2\n    if M and age &lt;= 40, go to 22\n    if F and age &gt; 20, go to 10\n    if F and age &lt;= 20, go to 22\n    if O, go to 22\n\n2) Have you been screened for prostate cancer? Y/N\n    if Y, go to 4\n    if N, go to 20\n\n3) Have you been screened for breast cancer? Y/N\n    if Y, go to 16\n    if N, go to 20\n\n4-10) questions about prostate cancer screening experience with logic based on answers\n    last question has go to 16\n\n11-15) questions about breast cancer screening experience with logic based on answers\n    last question has go to 16\n\n16-19) general questions about cancer screening experience, potentially with logic\n\n20) Would you like to book a cancer screening appointment? Y/N\n    If Y, go to 21\n    If N, go to 22\n\n21) (no question, just info about appointment booking)\n\n22) (no question, just thank you slide)\n</code></pre></div>",
        "id": 217305011,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605807782
    },
    {
        "content": "<p>this is how the questionnaire was really laid out (again abstracted as it was way more complex):</p>\n<div class=\"codehilite\"><pre><span></span><code>1) What is your gender?  M/F/O\n    if M and age &gt; 40, go to 2\n    if M and age &lt;= 40, go to 22\n    if F and age &gt; 20, go to 10\n    if F and age &lt;= 20, go to 22\n    if O, go to 22\n\n2) Have you been screened for prostate cancer? Y/N\n    if Y, go to 4\n    if N, go to 20\n\n3-9) questions about prostate cancer screening experience with logic based on answers\n\n10-13) general questions about cancer screening experience, potentially with logic\n    last question has go to 20\n\n14) Have you been screened for breast cancer? Y/N\n    if Y, go to 15\n    if N, go to 20\n\n15-19) questions about breast cancer screening experience with logic based on answers\n    last question has go to 10\n\n20) Would you like to book a cancer screening appointment? Y/N\n    If Y, go to 21\n    If N, go to 22\n\n21) (no question, just info about appointment booking)\n\n22) (no question, just thank you slide)\n</code></pre></div>",
        "id": 217305270,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605807891
    },
    {
        "content": "<p>Having done the reordering above, I don't actually want to force the users to a) go back and reorder the Questionnaires they have already created and b) reduce branching as much as possible in their new created Questionnaires.  I just want to convey the logic that they are creating.  I've created an extension for these rules since I couldn't find anything in SDC.</p>",
        "id": 217305857,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605808170
    },
    {
        "content": "<p>This looks like it can be handled without any re-ordering.  You just turn off the stuff that's not relevant based on prior answers.</p>",
        "id": 217306552,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605808470
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179255-questionnaire/topic/Rules.20on.20question.20order/near/217306552\">said</a>:</p>\n<blockquote>\n<p>This looks like it can be handled without any re-ordering.  You just turn off the stuff that's not relevant based on prior answers.</p>\n</blockquote>\n<p>Sure.  We could use 'enableWhen' but the rules will get quite complex.  I suspect that the development team (which was developing these before I introduced the notion of FHIR Questionnaires) may have considered that but since the rules got too complex and the idea of a Choose-Your-Adventure Questionnaire seemed simpler, they went with that.</p>",
        "id": 217306916,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605808633
    },
    {
        "content": "<p>Are you showing one question at a time?  \"go to\" might or might not mean hide the others.<br>\nenableWhenExpression gives you more flexibility than enableWhen.<br>\nThe disadvantage of your custom extension is that other systems won't understand it.<br>\nYou could submit a change request....</p>",
        "id": 217313112,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1605811643
    },
    {
        "content": "<p>Yes, I am showing one question at a time.  \"go to\" meant purely skip forward to question with linkId x.  I'm going to keep looking at enableWhenExpression and see if I can use that, but the basic problem is that the semantics are the inverse of what I have in my data.</p>",
        "id": 217315530,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605812777
    },
    {
        "content": "<p>Yes, it is inverse, and enableWhen(Expression) has the drawback that if you want to skip from question 1 to question 10 based on question 1's answer, you have to put the enableWhen(Expression) on 8 questions.  As Brian said, you could simplify those expressions with a variable, but they still have to be there.<br>\nI suppose you could write some code to take a set of \"go to\" rules and generate the right enableWhenExpressions.<br>\nIf support for \"go to\" were added, questionnaire renderers that show the full questionnaire would have to implement that same transformation to enabled states to determine which questions should be visible.</p>",
        "id": 217317035,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1605813497
    },
    {
        "content": "<p>You could also point those questions inside a group - but still number them as if they weren't.  Then your enableWhen would only need to appear on the group.</p>",
        "id": 217317341,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605813656
    },
    {
        "content": "<p>The simplest answer to this one is the adaptive mode where they only present the questions at each stage.<br>\nJumping about is going to make things very interesting depending on the way that your renderer displays things, and what is practical on the form factor.<br>\nGoing backwards is always an interesting thing to do - and how would that be handled if you just had a back/next button and showed some content, you'd need to be maintaining an interesting stack of pages/questions?</p>",
        "id": 222249296,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1610323720
    }
]