[
    {
        "content": "<p>Hi all,<br>\njust want to confirm some intuition that isn't covered in the spec. There shouldn't ever be a calculatedExpression (<a href=\"https://build.fhir.org/ig/HL7/sdc/expressions.html#calculatedExpression\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/sdc/expressions.html#calculatedExpression\">https://build.fhir.org/ig/HL7/sdc/expressions.html#calculatedExpression</a>) that is attached to a item with repeats = true, correct? It wouldn't make sense to me for repeats to ever be used here since calculatedExpression should be deterministic, in which case  we'd inevitably just have a duplicated answer. </p>\n<p>note: I think that a calculatedExpression item within a group that itself repeats is a legit use case (though a difficult one to grapple with) but that is not my question right now.</p>",
        "id": 183891513,
        "sender_full_name": "Spencer Evans",
        "timestamp": 1576794308
    },
    {
        "content": "<p>That sounds correct to me, although I don't know if it is necessary to enforce it.  I can't think of a case where it would be desirable, but I don't see any harm in it either.</p>",
        "id": 183894958,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1576797309
    },
    {
        "content": "<p>CalculatedExpression doesn't necessarily result to a numeric value.  With FHIRPath, it <em>could</em> evaluate to a collection and thus satisfy mutliple answers.  I can't think of a situation where you'd <em>want</em> to do this, but I don't know that it's <em>wrong</em> to do so..</p>",
        "id": 183897448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576799891
    },
    {
        "content": "<p>Good point Lloyd. That sounds reasonable and after thinking about it some more, about what I'd expect! As you both suggest, probably something that wouldn't come up but wanted to check anyways. Thank you Paul and Lloyd :)</p>",
        "id": 183975728,
        "sender_full_name": "Spencer Evans",
        "timestamp": 1576877766
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197053\">@Spencer Evans</span> Would you mind submitting a change request for us to add some language clarifying expected behavior here?</p>",
        "id": 183983627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576884518
    }
]