[
    {
        "content": "<p>SDC form data extraction guide says that \"Extraction is a step that only makes sense to occur once a QuestionnaireResponse is completed.\" Meaning: QR has status \"completed\" (or possibly \"amended\"), I think.<br>\nWhen saving the \"in-progress\" QR prior to doing extraction, I believe it should conform to the SDC QR Profile. The issue I'm facing is that the profile <strong>requires</strong> QR.subject field to be present and to reference a Patient resource.</p>\n<p>So, in the case where the Patient does not yet exist, extraction must occur <em>before</em> populating the \"subject\" reference field. Any suggestions on how to handle this? I could create a dummy reference that is unresolvable, or not apply the SDC QR profile until extraction is completed, but both those options seem hacky.</p>",
        "id": 178337383,
        "sender_full_name": "Miriam",
        "timestamp": 1571269349
    },
    {
        "content": "<p>To clarify, you're generating the Patient resource via extraction from the QuestionnaireResponse?  That's certainly something we hadn't contemplated. I'm comfortable with the notion of relaxing the mandatory to just mustSupport and providing usage notes that it should only be absent when context will allow the Patient to be asserted later in the process.  Would you be willing to assert a change request <span class=\"user-mention\" data-user-id=\"225239\">@Miriam</span> ?</p>",
        "id": 178339883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571272112
    },
    {
        "content": "<p>Yes that's correct. Great, I'll submit a change request and link it here. Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 178340338,
        "sender_full_name": "Miriam",
        "timestamp": 1571272637
    },
    {
        "content": "<p>I would want to see this too.</p>",
        "id": 178362497,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571302818
    },
    {
        "content": "<p>Opened #25032</p>",
        "id": 178514007,
        "sender_full_name": "Miriam",
        "timestamp": 1571436261
    },
    {
        "content": "<p>Question came up on today's discussion.  The only time 'subject' cardinality of 1..1 comes into play is when you are actually saving the QuestionnaireResponse in a system.  You're free to fill out the QuestionnaireResponse and not specify the subject immediately - so long as you declare the subject before you save.  The challenges with not having a subject at all are:</p>\n<ul>\n<li>how do you find the QuestionnaireResponse to keep editing it if you can't search by subject?  Do we add an invariant that if there isn't a subject there must be an identifier so you could reliably come back to it again?</li>\n<li>how do you enforce patient privacy expectations if the QR isn't tied to a particular patient compartment?  Do we just highlight this as a risk if subject isn't declared and maybe have a best practice constraint that subject should be declared?</li>\n</ul>\n<p>We'd like to figure out answers to these questions before approving the change.</p>",
        "id": 185264580,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578609778
    },
    {
        "content": "<p>You could be storing the qrid elsewhere.</p>",
        "id": 185265479,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1578610415
    },
    {
        "content": "<p>(not that I am, but possible, or maybe as a contained resource?)</p>",
        "id": 185265554,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1578610458
    },
    {
        "content": "<p>So the client would just 'remember' the server-assigned id and use it to retrieve?  Contained resource would satisfy the mandatory reference, so that's not a reason for loosening it.  Thoughts about the security/privacy aspect?</p>",
        "id": 185267097,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578611711
    },
    {
        "content": "<p>What is there to retrieve before it is saved?  It is still in the client being edited, right?</p>",
        "id": 185267411,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1578612009
    },
    {
        "content": "<p>The request is to allow it to be saved with partial data but no subject.  The client would presumably then close and re-open it at some future point.</p>",
        "id": 185267569,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578612132
    },
    {
        "content": "<p>(Though it could also choose to save it for data recovery purposes.)</p>",
        "id": 185267571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578612145
    },
    {
        "content": "<p>I don't understand why you would not have a subject (or having  one, why it would not be included).  Someone filled out the partial data for a particular person, didn't they?</p>",
        "id": 185267680,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1578612245
    },
    {
        "content": "<p>I think the notion is you start filling out the form and fill in the patient data which then gets extracted to create a contained Patient resource.  But really, I'm not totally sure.  <span class=\"user-mention\" data-user-id=\"225239\">@Miriam</span> can you provide more details about how you envision this working?</p>",
        "id": 185267906,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578612480
    },
    {
        "content": "<p>Yes, where the QR is being used to create what will become a potential subject. That I think is the real use case there.</p>",
        "id": 185268785,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1578613223
    },
    {
        "content": "<p>Patient admission form self populated from home, and doesn't have a patient resource yet (or access to it)</p>",
        "id": 185268797,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1578613251
    },
    {
        "content": "<p>It looks to me like there are no required fields in a Patient resource.  If that is the case, and empty Patient resource could be created when the form is submitted (or even before, when the form is loaded) and set as the subject so that the QuestionnaireResponse can be generated.</p>",
        "id": 185269533,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1578613889
    },
    {
        "content": "<p>The issue is with the SDC profile - which does make several fields required.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>, so the intention is the QuestionnaireResponse is created, extraction is done to create a Patient resource.  The Patient resource gets posted (and cross fingers there are no duplicates found) and then the QuestionnaireResponse is updated to point to the now-created Patient and saved?</p>\n<p>In the interim, is the QuestionnaireResponse queriable?  What patient privacy protections are enforced?</p>",
        "id": 185272565,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578616945
    },
    {
        "content": "<p>Don't know, creator only?</p>",
        "id": 185275956,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1578621414
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I don't see an SDC profile of Patient listed here:  <a href=\"http://hl7.org/fhir/uv/sdc/2019May/artifacts.html\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/sdc/2019May/artifacts.html\">http://hl7.org/fhir/uv/sdc/2019May/artifacts.html</a></p>",
        "id": 185324048,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1578672758
    },
    {
        "content": "<p>There isn't one.  The question is about the cardinality of QuestionnaireResponse.subject</p>",
        "id": 185324688,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578673148
    },
    {
        "content": "<p>So, I pointed out that Patient does not require any fields, and you replied, \"The issue is with the SDC profile - which does make several fields required.\"</p>\n<p>The idea is that one could create an empty Patient, point QuestionnaireResponse.subject to it, and then fill in the Patient during extraction.</p>",
        "id": 185324835,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1578673232
    },
    {
        "content": "<p>You can't have a completely empty Patient - you always have to have at least one populated non-id element.</p>",
        "id": 185325235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578673470
    },
    {
        "content": "<p>I see-- \"name.exists() or telecom.exists() or address.exists() or organization.exists()\".</p>\n<p>Then, an app could ask separately for the patient name to get started, create the Patient with just the name, and then provide a Questionnaire (prepoluated with the name) to collect the rest of the information.</p>",
        "id": 185326261,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1578674026
    },
    {
        "content": "<p>Actually a more fundamental constraint - hasValue() or (children().count() &gt; id.count()).  However, you're correct that a largely empty Patient resource - perhaps just a narrative that said \"waiting for population\" would seem to be feasible.</p>",
        "id": 185329603,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578676026
    },
    {
        "content": "<blockquote>\n<p>@Miriam can you provide more details about how you envision this working?</p>\n</blockquote>\n<p>After reading your comments, I agree that 'subject' should continue to be required. Paul's suggestion of requiring the user to enter some minimal patient details prior to beginning the QR makes sense.</p>",
        "id": 185337987,
        "sender_full_name": "Miriam",
        "timestamp": 1578681530
    },
    {
        "content": "<p>How about for generic forms that don't contain a subject?<br>\nBut for this create me a patient form, still think is better with no subject prop entered.</p>",
        "id": 186971653,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1580380504
    },
    {
        "content": "<p>It's then very clear what is going on. No patient (yet, or perhaps never).<br>\nIt could be an eval form, and the person is deemed not eligible based on the form, and thus no patient created.</p>",
        "id": 186971678,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1580380528
    },
    {
        "content": "<p>How would you manage access control to the entered data in that situation?</p>",
        "id": 187029313,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580417529
    },
    {
        "content": "<p>It would be a special case, and likely related to the Q definition itself.<br>\nThose with access to the intake/assessment desk/feature</p>",
        "id": 187041505,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1580425908
    }
]