[
    {
        "content": "<ol>\n<li>Is it necessary (or desirable) to include a profile within the meta element in our Questionnaires?</li>\n</ol>\n<p>We had been using this profile:  </p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaire|2.7&quot;\n</code></pre></div>\n\n<p>but it doesn't validate in either the IG or in HAPI validation, so we are thinking of removing it.</p>\n<ol start=\"2\">\n<li>\n<p>If it is necessary to reference the SDC profile, is this now the correct and current version?</p>\n<p>\"<a href=\"http://hl7.org/fhir/us/sdc/sdc-questionnaire.html\">http://hl7.org/fhir/us/sdc/sdc-questionnaire.html</a>\"</p>\n</li>\n<li>\n<p>If we use an updated version of the SDC profile url, will this \"break\" our form renderer (LHC Forms from NLM)  which still utilizes the older URLs in some cases (such as for some extensions)?  <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span></p>\n</li>\n</ol>",
        "id": 245573305,
        "sender_full_name": "Diane",
        "timestamp": 1625953231
    },
    {
        "content": "<ol>\n<li>In general, IGs should not require declaring profile in meta because it adds a cost for systems that are producing otherwise conformant data and also reduces the pool of systems that might be willing to conform.  The only time profiles should be mandated is if all systems talking to the server will be aware of the profile and can be reasonably customized to support the declaration AND the declaration is essential for efficient processing of the received data.  (Servers can always validate an instance to determine whether it complies with a given profile, so client-side declaration is primarily about saving the server the effort of performing that process.</li>\n<li>In your IG, you can indicate that your Questionnaire is an example of an SDC profile without declaring it in an instance.</li>\n<li>Different tools may rely on different versions of an IG, so yes, it's possible that pointing to the 'newest' SDC profiles could cause some tools to not recognize all extensions</li>\n</ol>",
        "id": 245574117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625954483
    },
    {
        "content": "<p>I suspect the reason it doesn't validate is that the SDC IG is not published yet.  The LHC-Forms renderer uses that profile URI to determine which FHIR version being used.  However, if you leave it out, it will look at the structure of the Questionnaire try to make a good guess.  You can also put the base Questionnaire profile in meta.profile, which LHC-Forms will also try to parse for the FHIR version. (Example:  \"<a href=\"http://hl7.org/fhir/4.0/StructureDefinition/Questionnaire\">http://hl7.org/fhir/4.0/StructureDefinition/Questionnaire</a>\")</p>",
        "id": 246759095,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1626891823
    }
]