[
    {
        "content": "<p>(deleted)</p>",
        "id": 204434162,
        "sender_full_name": "Kim Roberts",
        "timestamp": 1595257643
    },
    {
        "content": "<p>I am a clinical pharmacist working for Pharmacy HIT that provides guidance to Pharmacy vendors that have implemented the Pharmacist eCare plan.  We are looking to implement assessments and plan on starting with PHQ2, PHQ9, PEG3, and GAD7 so looking for specific examples and references that we can provide to the vendors that are looking for implementation guidance.  Can anyone assist with specific guidance for the PHQ2, PHQ9, PEG3, and GAD7 assessments?</p>",
        "id": 204434777,
        "sender_full_name": "Kim Roberts",
        "timestamp": 1595257935
    },
    {
        "content": "<p>At least three of those assessments are available from LOINC as FHIR Questionnaires, if that helps.  (I am not sure about PEG3.)</p>",
        "id": 204435117,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1595258119
    },
    {
        "content": "<p><a href=\"https://loinc.org/fhir/\">https://loinc.org/fhir/</a></p>",
        "id": 204435308,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1595258223
    },
    {
        "content": "<p>Perfect.  Thank you.</p>",
        "id": 204436398,
        "sender_full_name": "Kim Roberts",
        "timestamp": 1595258653
    },
    {
        "content": "<p>We have an app at <a href=\"https://lhcforms.nlm.nih.gov/sdc\">https://lhcforms.nlm.nih.gov/sdc</a> which lets you search by name and display LOINC forms (and some others).  Also, in the \"Featured Questionnaires\" list on the left, there is a PHQ-9 that will automatically compute the total score.</p>",
        "id": 204438107,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1595259486
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> through the LHC app do you use the LOINC Panel code to generate the questionnaire, and if the questionnaire is filled out, does it create a valid QuestionaireResponse FHIR instance? I am also looking for advice on the best way (as there are several possible integration points) to integrate QuestionnaireResponse, pointing to the LHC tooling, into a developing IG. Project Page: <a href=\"https://confluence.hl7.org/display/PC/Multiple+Chronic+Conditions+%28MCC%29+eCare+Plan\">https://confluence.hl7.org/display/PC/Multiple+Chronic+Conditions+%28MCC%29+eCare+Plan</a>. Though we are building a draft IG in time for the September connectathon, we won't be balloting until September 2022. We are building the IG in Trifolia: <a href=\"https://trifolia-fhir-dev.lantanagroup.com/igs/lantana_prod_hapi_r4/MCC-IG/index.html\">https://trifolia-fhir-dev.lantanagroup.com/igs/lantana_prod_hapi_r4/MCC-IG/index.html</a></p>",
        "id": 204712670,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1595446685
    },
    {
        "content": "<p>That LHC app can save a QuestionnaireResponse instance to the FHIR server.  (See the \"Save As\" button that appears after you have selected a form to view.)   The app is based on the LHC-Forms widget (<a href=\"http://lhncbc.github.io/lforms/\">developer docs</a>) which has an API for pulling out a QuestionnaireResponse when needed.</p>",
        "id": 204713445,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1595447140
    },
    {
        "content": "<p>Perfect - thanks</p>",
        "id": 204715991,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1595448471
    }
]