[
    {
        "content": "<p>If you have alphabetical list of units from unitOption, and want the second one to be the default (so the user does not have to pick a unit if they do not want to change from the default), is there a way to do that?</p>",
        "id": 154863684,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1547147658
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19959\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19959\">GF#19959</a></p>",
        "id": 154990299,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1547311140
    },
    {
        "content": "<p>For an item of type Quantity, can we use initial.valueQuantity with a Quantity that has only a unit (and not a value) to set a default unit for that question?</p>",
        "id": 155265206,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1547655006
    },
    {
        "content": "<p>I guess in theory, yes.</p>",
        "id": 155265298,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547655107
    },
    {
        "content": "<p>An interesting question is whether a unit with no value counts as an \"answer\" for a question.  (Or a value with no unit?)</p>",
        "id": 155265400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547655166
    },
    {
        "content": "<p>Quantity leaves all of its components optional (except that system is required if you provide code).  That seemed weird to me until I thought of using it as a way to specify default units.  I suppose if there is no unit, then the quantity is dimensionless, which is okay.  But, I am not sure whether it would ever make sense to output a QuestionnaireResponse with a  Quantity that was missing a value.</p>",
        "id": 155265700,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1547655388
    },
    {
        "content": "<p>I agree it probably wouldn't make sense - but we haven't stated anywhere that it's not allowed.  (We similarly haven't made an assertion that a Reference must have a Reference.reference (as opposed to a Reference.display or a Reference.extension)</p>",
        "id": 155266078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547655665
    },
    {
        "content": "<p>I've definitely used Reference with display only in many places, such as with Identifier.Assigner only recording the org name in the display and no actual resource reference.</p>",
        "id": 155346543,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1547740880
    }
]