[
    {
        "content": "<p>If we already have subject type in questionnaire, can we use that as hint for definition-based extraction? I know that you can have a named context if you use the context extension. But as long as you're not extracting multiple resource for each resource type (i.e. you're not extracting more than one patient) shouldn't the subject type(s) suffice?</p>",
        "id": 225407754,
        "sender_full_name": "Jing Tang",
        "timestamp": 1612613719
    },
    {
        "content": "<p>I'm not really following.  If Questionnaire.subjectType says 'Patient', how does that help you know what Patient to extract from?  Same question holds if it's Practitioner or Organization.</p>",
        "id": 225419314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612629185
    },
    {
        "content": "<p>so in the case where we're extracting a new patient (or any other resource), know the type is enough?</p>",
        "id": 225459151,
        "sender_full_name": "Jing Tang",
        "timestamp": 1612696890
    },
    {
        "content": "<p>For example, if we have a questionnaire with subject type patient, and each field's definition pointing to a particular field in the patient resource, then it's clear to me how to extract a patient resource from the questionnaire response to this questionnaire even without the context extension. Maybe this is not so much a question but more of an observation... The context extension is only useful when you're editing an existing FHIR resource. Is this right? Am I missing something?</p>",
        "id": 225459326,
        "sender_full_name": "Jing Tang",
        "timestamp": 1612697117
    },
    {
        "content": "<p>You would need to have a patient in context, and the extraction process would need to understand which patient that is.  E.g. If you're dealing with a mom &amp; baby situation, is the subject for the mom or the baby?  So you'd still need the context extension.</p>",
        "id": 225470700,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612713876
    },
    {
        "content": "<p>Thanks Lloyd. That makes sense. I was just wondering the difference between new and existing resources.</p>",
        "id": 225471670,
        "sender_full_name": "Jing Tang",
        "timestamp": 1612715271
    },
    {
        "content": "<p>I don't really understand the question?</p>",
        "id": 225480761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612727916
    },
    {
        "content": "<p>We might be extracting a new resource e.g. a new patient rather than an exisitng patient.</p>",
        "id": 225490646,
        "sender_full_name": "Jing Tang",
        "timestamp": 1612741292
    },
    {
        "content": "<p>That's fine.  If you're trying to create something new, then the context would be empty.</p>",
        "id": 225500810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612755617
    },
    {
        "content": "<p>got it! that is our assumption as well! thanks for clarifying!</p>",
        "id": 225511438,
        "sender_full_name": "Jing Tang",
        "timestamp": 1612770826
    }
]