[
    {
        "content": "<p>The intention was to transition <em>after</em> today, but it looks like the call scheduler has been updated to change the call info effective today.  So we'll be using Zoom for today's FHIR Workflow and FHIR Infrastructure calls.  We'll also be using it for our Thursday SDC call.  This Zoom information will replace the GotoMeeting we've been using from this point forward.  Please update your calendars to use the following link: <a href=\"https://zoom.us/j/8583747934\">https://zoom.us/j/8583747934</a></p>",
        "id": 204438872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595259811
    },
    {
        "content": "<p>What day is the Questionnaire call - can't find it on the HL7 call site ....</p>",
        "id": 204713315,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1595447052
    },
    {
        "content": "<p>Thursday @ 5 p.m. U.S. Eastern Time</p>",
        "id": 204713535,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1595447173
    },
    {
        "content": "<p>Thank- You. I will try to attend to get answers to my questions- I can't this week b/c I  need to attend PC FHIR tracker call held at the same time.</p>",
        "id": 204716274,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1595448601
    },
    {
        "content": "<p>Note that there <em>will</em> be a call today at 5 Eastern and a reminder to connect using Zoom (<a href=\"https://zoom.us/j/8583747934\">https://zoom.us/j/8583747934</a>), not GotoMeeting</p>",
        "id": 204839894,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595530873
    },
    {
        "content": "<p>Is today's call going ahead? Lemme know if there's been a change to the weekly schedule. My apologies I wasn't able to join in the past 3 weeks</p>",
        "id": 216536072,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1605218783
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"191420\">@Koray Atalag</span> Today's call was cancelled.  The notice goes out on the FHIR Infrastructure list serve, but I should have made a post here too.  Apologies for not doing that.</p>",
        "id": 216540816,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605221306
    }
]