[
    {
        "content": "<p>I see that Brian Postlethwaite  has a separate thread about variable scope when populating in repeating groups.</p>\n<p>I didn't want to hijack that one.  I don't know how to confine my variable to one  iteration of the group. </p>\n<p>In Link ID 1.1, the user chooses between site type A or site type B.  This selection is stored in variable %siteType.</p>\n<p>In Link ID 1.2, there is a answerExpression extension with iif in the value expression<br>\nsuch as  iif(%siteType = 'A',  'X',  'Y')</p>\n<p>In Link ID 1.3, there is another answerExpression extension with iif in the value expression<br>\nsuch as iif(%siteType = 'A',  'C',  'D')\"</p>\n<p>In Link ID 1.4, there is another answerExpression extension with iif in the value expression<br>\nsuch as  iif(%siteType = 'A',  'E',  'F')</p>\n<p>These are the results that I want to populate:</p>\n<p>Parent Link ID  1  Sites</p>\n<p>Link ID 1.1      Site Type   A<br>\nLink ID 1.2      X<br>\nLink ID 1.3      C<br>\nLink ID 1.4      E</p>\n<p>Link ID 1.1      Site Type   B<br>\nLink ID 1.2      Y<br>\nLink ID 1.3      D<br>\nLink ID 1.4      F</p>\n<p>Link ID 1.1      Site Type   B<br>\nLink ID 1.2      Y<br>\nLink ID 1.3      D<br>\nLink ID 1.4      F</p>\n<p>I have tried putting the variable against the parent link ID 1, but that is obviously visible to all of the repeating groups, so every time a new site (group iteration) is added, the variable value causes the previously added sites (group iterations)  to repopulate (incorrectly).</p>\n<p>I have also tried making an unneeded  group nesting and putting the variable against it like this: </p>\n<p>Parent Link ID  1  Sites</p>\n<p>Unneeded grouping 1.1   to store variable %siteType<br>\nLink ID 1.1.1      Site Type   A<br>\nLink ID 1.1.2      X<br>\nLink ID 1.1.3      C<br>\nLink ID 1.1.4      E</p>\n<p>Unneeded grouping 1.1  to store variable %siteType<br>\nLink ID 1.1.1      Site Type   B<br>\nLink ID 1.1.2       Y<br>\nLink ID 1.1.3      D<br>\nLink ID 1.1.4      F</p>\n<p>Unneeded grouping 1.1  to store variable %siteType<br>\nLink ID 1.1.1      Site Type   B<br>\nLink ID 1.1.2      Y<br>\nLink ID 1.1.3      D<br>\nLink ID 1.1.4      F</p>\n<p>But, the variable still seems to be \"seen\" and modified by any of the group iterations.</p>\n<p>How do I contain the variable scope to only the one iteration of the repeating group?  </p>\n<p>Do I need to add the extension for itemPopulationContext  to Unneeded grouping 1.1?</p>",
        "id": 258305537,
        "sender_full_name": "Diane",
        "timestamp": 1634699105
    },
    {
        "content": "<p>To clarify linkId \"1\" is a repeating group and declares the %siteType variable?  If so, then my belief is that the value of the %siteType value should be managed separately for each repetition of the group.  <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> ?</p>",
        "id": 258310829,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634704265
    },
    {
        "content": "<p>That is how I've interpreted it too, and implementing in my renderer.</p>",
        "id": 258330209,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1634718346
    },
    {
        "content": "<p>The variable is only visible down the tree, not up.</p>",
        "id": 258330333,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1634718394
    },
    {
        "content": "<p>Yes.  linkid \"1\"  is the repeating group and declares the %siteType variable.     As an alternative, I also tried adding a linkid \"1.1\"  to declare %siteType.</p>",
        "id": 258369854,
        "sender_full_name": "Diane",
        "timestamp": 1634737583
    },
    {
        "content": "<p>I agree that each repetition of a group should get its own instance of the group's variables.  I will double-check LHC-Forms' behavior.</p>",
        "id": 258370047,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1634737657
    },
    {
        "content": "<p>LHC-Forms seems to be behaving correctly.  I just created a repeating BMI panel, and and the BMI calculation for each instance is only affected by the weight &amp; height in the group instance.  <span class=\"user-mention\" data-user-id=\"237340\">@Diane</span> , if you will email me your Questionnaire, I will take a look and see if I can spot the problem.</p>",
        "id": 258382112,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1634741638
    },
    {
        "content": "<p>I just sent the questionnaire to <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span></p>",
        "id": 258399003,
        "sender_full_name": "Diane",
        "timestamp": 1634747422
    },
    {
        "content": "<p>In case anyone else is looking for the solution to this type of problem, the answer (thanks to <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>  is in the fhirpath.  If your fhirpath expression refers to the entire resource, such as %resource.descendants().where(linkId = '1.1'),   then the variable will keep getting updated and wiping out the previous iterations.  The fhirpath expression should be local to the instance of the group.  In my case, using item.descendants().where(linkId = '1.1')   fixed the problem.     </p>\n<p>To answer my question \"How do I contain the variable scope to only the one iteration of the repeating group?\"   Contain your fhirpath expression to the one iteration of the repeating group.</p>",
        "id": 258662047,
        "sender_full_name": "Diane",
        "timestamp": 1634877857
    }
]