[
    {
        "content": "<p>Am I correct in thinking that when a FHIRPath expression appears on an item in a Questionnaire, the %context gets set to the corresponding node of the QuestoinnaireResponse (i.e., not the Questionanire, and not the whole QuestionnaireResponse resource)?</p>\n<p>Is that documented somewhere?</p>",
        "id": 154014669,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1541091924
    },
    {
        "content": "<p>The general presumption with those different extensions is that the expression applies on the instantiation (QuestionnaireResponse, Observation, MedicationRequest, etc.) not the definition that contains the extension (Questionnaire, PlanDefinition, ActivityDefinition, etc.)  However, definitely agree this needs to be clarified.  Can you submit a change request?</p>",
        "id": 154014702,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541093879
    },
    {
        "content": "<p>Sure, but do you mean that it applies to the whole Questionnaire response (i.e., %context is QuestionnaireResponse) or to the item of the QuestionnaireResponse corresponding to the item in Questionnaire where the FHIRPath appeared?  I think it has to be the latter.  You can always get back to the whole QR with %resource.</p>",
        "id": 154014737,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1541095803
    },
    {
        "content": "<p>It applies to the item - and similarly for a PlanDefinition, it would apply to the item that corresponded to a particular action, not to the overall CarePlan.  <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 154014756,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541096385
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19603\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19603\">GF#19603</a></p>",
        "id": 154014784,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1541098361
    }
]