[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span> , I hope this note finds you well. At Prime we are beginning to work on enrollment in different Specialty Copay Maximizer or other patient assistance programs offered by manufacturers. We're reviewing different FHIR Resources and IGs that can be used in this exchange.  I saw on the confluence page that this IG was envisioned to be used in enrollment in manufacturer programs. Does this extend to the Copay Assistance type functions that third parties assist with (SaveonSP, PrudentRx).  I didn't see these use cases specifically called out in the IG so thought I would check with you.  If this IG isn't intended for that type of enrollment, do you or anyone else at pocp know of anything on the horizon related to this? Thanks much!<br>\n<span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> , <span class=\"user-mention\" data-user-id=\"325773\">@Lynne Enright</span> , <span class=\"user-mention\" data-user-id=\"193412\">@Bapi Behera</span></p>",
        "id": 238223239,
        "sender_full_name": "Kate Dech",
        "timestamp": 1620686730
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span> .  The IG is intended to help stakeholders that participate in fulfilling (broadly defined) a patient's specialty medication to obtain information they need. We envisioned the primary data recipients to be specialty pharmacies and HUBs, though the guide doesn't restrict to those. </p>\n<p>I'm not very familar with SaveonSP or  PrudentRx... If their relationship with the payer includes facilitating PA, their needs might be similar to a HUB's. A fair amount of the patient info that HUBs and specialty pharmacies get from the practice is used to obtain authorization from the patient's insurance.</p>\n<p>Hope this helps. <span class=\"user-mention\" data-user-id=\"265495\">@Maggie Buchinger</span> : Please chip in if you have any other thoughts</p>",
        "id": 238398374,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1620776352
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span>  - to add just a bit on to that, one of the use cases specifically defined in the guide is supporting specialty enrollment for programs or services, which includes copay assistance or copay coupon services. It sounds like the Specialty Medication Enrollment implementation guide should be able to meet those needs. Happy to discuss further!</p>",
        "id": 238472050,
        "sender_full_name": "Maggie Buchinger",
        "timestamp": 1620825696
    },
    {
        "content": "<p>Thank you so much Frank and Maggie for your quick response (and apologies for the delay in mine). Maggie, I did also stumble across some work you did related to this in <a href=\"http://Simplifier.net\">Simplifier.net</a> (which was really helpful to see!).  I'm gathering that it is the Consent resource that tracks an enrollment action. Wondering if you might be able to have a discussion with some of my teammates about this (I think everyone is MN so it makes choosing a time a little easier).  If you open to a discussion, can you send me some time options to meet (either here or via private message). Thanks again!<br>\n<span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> , <span class=\"user-mention\" data-user-id=\"325773\">@Lynne Enright</span> , <span class=\"user-mention\" data-user-id=\"270256\">@Bapi Behera</span></p>",
        "id": 239123380,
        "sender_full_name": "Kate Dech",
        "timestamp": 1621270238
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span> , I just came across this conversation and I think we can connect as we are working on adopting Specialty Medication IG in Genentech and we are also working on scenario around Copay enrollment, I'm happy to connect and discuss our interpretation of how Copay enrollment can be implemented</p>",
        "id": 243835786,
        "sender_full_name": "Krzysztof Wilczek",
        "timestamp": 1624563381
    }
]