[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span>, I read through the <a href=\"http://build.fhir.org/ig/HL7/fhir-specialty-rx/index.html\">fhir-specialty-rx</a> (with <span class=\"user-mention\" data-user-id=\"192207\">@Daniel Zhang</span>) for the first time this morning. It's clear that you've been working hard on this fleshed out IG. </p>\n<p>Both Messaging and Questionnaire are parts of FHIR that my company specifically, and many others in the US haven't yet started to support. Messaging is a big lift, because it requires different tools than REST -- namely, the ability to carefully track and prioritize errors and for an analyst to manually resolve (view/edit/resubmit) any errors. </p>\n<p>Up to this point, we've been able to re-use the widely implemented support for SMART apps to satisfy Questionnaire/QuestionnaireResponse scenarios. </p>\n<p>Overall, my knee-jerk reaction is that you're building this ig on top of technology that is not in widespread use. I understand the need to enable an async/manual workflow. The absence of FHIR's strongest exchange mechanism, REST, to satisfy a potentially manual workflow feels unbalanced.</p>",
        "id": 205922719,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1596555371
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> , <span class=\"user-mention\" data-user-id=\"192207\">@Daniel Zhang</span> .  I'm glad you were able to start looking at the guide, and I appreciate your feedback.</p>\n<p>A couple things led us toward messaging, and I'm interested in your thoughts .  A main driver is that pharmacy stakeholders rely on intermediaries to interact with prescribers and their systems... with the intermediary determining the right system to connect to for a provider at a particular location. </p>\n<p>Because of that, the NCPDP task group that's sponsoring the IG believes it's important to enable routing through intermediaries... with the opportunity for an intermediary to handle the work of locating and connecting to the right FHIR endpoint like they do for e-prescribing messages today. I understand that messaging is the standard FHIR approach to enable that.</p>\n<p>We arrived at using Questionnaire after seeing it used for similar information gathering workflows in other IGs. But to your point, those might reflect what people <em>will be</em> doing vs what they're actually doing today.  Could you share more about how you're using SMART apps for this? In particular, with our goal of coming up with a standard way ask questions related to things that might not be in the patient's chart, would that mean individual pharmacies each building their own app based on a standard design, or something else?</p>\n<p>Thanks again for the thoughts!</p>",
        "id": 205948597,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1596568739
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> , <span class=\"user-mention\" data-user-id=\"192207\">@Daniel Zhang</span> <br>\nRelated to questionnaire-type requests (when the pharmacy needs info that's not in the patient's chart, asking questions of the provider, etc) and using SMART apps instead... <br>\nHow would you anticipate the SMART app would get launched in these situations? E.g., could the EHR prompt the user to launch the SMART app upon receiving a CommunicationRequest (or a Task pointing to one)?<br>\nWhat are your thoughts?<br>\nThanks!<br>\nFrank</p>",
        "id": 206526859,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1597103625
    }
]