[
    {
        "content": "<p>Citation resource example: <a href=\"https://gps.health/coka/resources/Citation/1\">https://gps.health/coka/resources/Citation/1</a></p>",
        "id": 197331382,
        "sender_full_name": "Khalid Shahin",
        "timestamp": 1589314202
    },
    {
        "content": "<p>the citation resource seems really heavy weight compared to what I expected. </p>\n<ul>\n<li>One particularly obvious issue is that it doesn't use HumanName and Address. </li>\n<li>I'm not familar with contributers as a concept appart from authors? </li>\n<li>when would you use alternative forms?\n*</li>\n</ul>",
        "id": 197479200,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589404778
    },
    {
        "content": "<p>a more general question: surely some other group has defined an interoperable format for citations?</p>",
        "id": 197479221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589404797
    },
    {
        "content": "<p>Regarding HumanName: Authors in citations have extensive structure in MEDLINE XML DTD and citation resources (developed to meet the needs of sharing citations in communities using MEDLINE as a common base/authority) have a greater need for and mapping of data mapped in this way.  In addition to the mapping of name elements in existing citations there is also a need to handle \"group names\" as an author. We could consider adding an addiitional optional element such as author.humanName as an alternative form of expression which could re-use FHIR data where available.</p>",
        "id": 197487547,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589410597
    },
    {
        "content": "<p>Regarding Address: We can easily change datatype for address to Address. Where data is often shared as a simple string it can use Address.text</p>",
        "id": 197487628,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589410650
    },
    {
        "content": "<p>Regarding contributorList: There is a substantial effort in academic developments (unevenly distributed) to apply contributorship instead of and/or in addition to authorship.  There is a CreDiT Taxonomy (<a href=\"https://jats4r.org/credit-taxonomy\">https://jats4r.org/credit-taxonomy</a>) included in NISO JATS (Journal Article Tag Suite) standard.  We could consider changing contributorList datatype from a BackboneElement to a Contributorship Datatype. (We did something similar changing Statistic Resource to Statistic Datatype.)</p>",
        "id": 197488134,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589410957
    },
    {
        "content": "<p>Regarding alternativeForm: A journal article may be published in both print and online versions. There are times when there are actual differences between the two in the content and frequent instances where the publicationDate is different between the two. But these situations are not considered separate citations.</p>",
        "id": 197488338,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589411146
    },
    {
        "content": "<p>Regarding interoperable format for citations: We reviewed MEDLINE XML DTD, JATS (NISO standard) and RIS tags (commonly used by citation managers) and none of these formats are universally used across the groups managing citations today and they do not meet the needs support citations across multiple research collections right now for COVID-19 datasets.</p>",
        "id": 197488551,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589411301
    },
    {
        "content": "<p>is there any reason for this not to apply to FHIR doing a citation format?</p>",
        "id": 197489503,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589411977
    },
    {
        "content": "<p><a href=\"https://xkcd.com/927/\">https://xkcd.com/927/</a></p>",
        "id": 197489504,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589411977
    },
    {
        "content": "<p>when I see Author.lastName, foreName, suffix, initials, collectiveName, I say - looks like a humanName to me, but with different names for the same things. Why?</p>",
        "id": 197489596,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589412042
    },
    {
        "content": "<p>I do wonder why authorList and contributorList are actually different elements - they're pretty much the same type</p>",
        "id": 197489640,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589412096
    },
    {
        "content": "<p>We can explore remapping the author name elements to humanName (containing use, text, family, given, prefix, suffix, period), initials, and collectiveName.   The differences are mostly 1:1 mapping.  The addition of initials and collectiveName are needed because they are not found in HumanName Datatype.</p>",
        "id": 197490107,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589412404
    },
    {
        "content": "<p>collectiveName = HumanName.text, I think. And initials.. just just HumanName.given</p>",
        "id": 197490265,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589412531
    },
    {
        "content": "<p>There are times when some contributors are not authors and both concepts are accounted for. By the time you manage separate overlapping lists it seems easier to manage them as separate elements.  The actual data in systems today often uses one or the other of these lists so the data is structured to fit one or the other.  Forcing a combination will likely cause a lot of confusion when trying to do both.</p>",
        "id": 197490281,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589412549
    },
    {
        "content": "<p>The data for author names may include \"given\" and \"initials\" so you can not use the same element for both constructs.   If collectiveName is used in existing systems today and it is converted to HumanName.text it is (1) inaccurate as it is not a human name and (2) loses the structured knowledge that it is a collective name.</p>",
        "id": 197490446,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589412670
    },
    {
        "content": "<p>well, there's a difference between combining lists (which I wasn't suggesting) and combining types so you only define the one structure - they only differ by the addition of telecom and the flag for corresponding author</p>",
        "id": 197490480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589412700
    },
    {
        "content": "<p>You could potentially combined authorList and contributorList into one contributorList with one new element (type that lets you set whether the list is author list or contributor list or both combined) and a cardinality adjustment to 0..2 so that you could have 2 lists if you wanted to.</p>",
        "id": 197490735,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589412878
    },
    {
        "content": "<p>well ,I would have two lists author 0..* and contributor 0..*, and then the type for contributor would be @author</p>",
        "id": 197490772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589412950
    },
    {
        "content": "<p>I think.</p>",
        "id": 197490776,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589412952
    },
    {
        "content": "<p>There is authorList 0..1 which contains author 1..<em>, and contributorList 0..1 which contains contributor 1..</em> -- it seems like for each list you either have a list or you don't (so combining them would be 0..2 at the list level).  If you have a list it can have any number of entries but 0 entries would be meaningless.</p>",
        "id": 197491029,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589413154
    },
    {
        "content": "<p>1..* does not show the 1..Asterisk in the note above</p>",
        "id": 197491075,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589413199
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> we worked thought the combination of authorList and contributorList concepts and think your idea of a common datatype will work very well.  The Citation Resource can be reduced to 2 simple lines for this area:</p>",
        "id": 197572729,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589470276
    },
    {
        "content": "<p>This could be changed to:<br>\nauthorList  0..1     AuthorList<br>\ncontributorList 0..1    AuthorList</p>",
        "id": 197572747,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589470287
    },
    {
        "content": "<p>Then the AuthorList Datatype can include: <br>\n    complete    0..1    boolean<br>\n    entry       0..*    BackboneElement<br>\n        humanName   0..1    HumanName <br>\n        initials    0..1    string <br>\n        collectiveName  0..1    string<br>\n        identifier  0..*    Identifier <br>\n        contribution    0..*    CodeableConcept<br>\n        affiliationInfo 0..*    BackboneElement <br>\n            affiliation 0..1    string <br>\n            role        0..1    string<br>\n            identifier  0..*    Identifier <br>\n        address     0..*    Address <br>\n        telecom     0..*    ContactPoint <br>\n        correspondingAuthor 0..1    boolean <br>\n        listOrder   0..1    positiveInt <br>\n    summary 0..*    BackboneElement <br>\n        source      0..1    CodeableConcept <br>\n        value       1..1    string</p>",
        "id": 197572840,
        "sender_full_name": "Brian Alper",
        "timestamp": 1589470330
    },
    {
        "content": "<p>At first glance, that looks like a pretty \"verbose\" data type (but we do have some precedent for that - I'm thinking of Dosage).  One farily minor point, I'm wondering whether instead of the 'humanName' element, it should just be \"name 0..1 HumanName\" (similar to <a href=\"http://Patient.name\">Patient.name</a>)?</p>",
        "id": 200556005,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1591887670
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <a href=\"#narrow/stream/237951-COVID-19-Knowledge.20Accelerator/topic/COKA.20API/near/200556005\">said</a>:</p>\n<blockquote>\n<p>At first glance, that looks like a pretty \"verbose\" data type (but we do have some precedent for that - I'm thinking of Dosage).  One farily minor point, I'm wondering whether instead of the 'humanName' element, it should just be \"name 0..1 HumanName\" (similar to <a href=\"http://Patient.name\">Patient.name</a>)?</p>\n</blockquote>\n<p>Hi Rob, and yes we already changed humanName to name as seen in the FHIR build: <a href=\"http://build.fhir.org/citation.html\">http://build.fhir.org/citation.html</a></p>\n<p>edit: Also, we decided not to make AuthorList a DataType.</p>",
        "id": 200589292,
        "sender_full_name": "Khalid Shahin",
        "timestamp": 1591901586
    }
]