[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"366686\">@Jing Tang</span> <span class=\"user-mention\" data-user-id=\"388620\">@Benjamin Mwalimu</span> <span class=\"user-mention\" data-user-id=\"387988\">@Francis Otieno</span> putting this here until we have a FHIR SDK thread.   Jing - we are close to having the ability to view a Questionaire in the web, fill it out and view the QR.  We don't have a clear pathway to supporting data extraction yet.  It would be cool to explore if we can use the data extraction libraries in the SDK and use them as a microservice or some kind of thing to wrap HAPI or GCP, etc.   Just wanted to throw this idea out there so it was captured.    If anyone knows of any work in JS or java for data extraction we can look at please let us know too.</p>",
        "id": 264958045,
        "sender_full_name": "Matt Berg",
        "timestamp": 1639535654
    },
    {
        "content": "<p>I agree. I went down the definition-based extraction route a bit before finding no open source implementations that can perform the operation by API.</p>",
        "id": 265049262,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1639591200
    },
    {
        "content": "<p>I'm using matchbox</p>",
        "id": 265069152,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639599327
    },
    {
        "content": "<p>(so the extraction is at the server). <span class=\"user-mention\" data-user-id=\"401347\">@Matt Berg</span>  do you mean an API that can be called locally as opposed to the REST API?</p>",
        "id": 265069706,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639599564
    },
    {
        "content": "<p>Is there a REST API?  The scenario we have is we have the ability via web to fill out a Questionaire and submit a questionnaire response.  We would like to be able do extraction via StructureDefs, definitions, etc.  We don't know of a way to currently do that. I don't think HAPI or other FHIR stores provide that.</p>",
        "id": 265076842,
        "sender_full_name": "Matt Berg",
        "timestamp": 1639603412
    },
    {
        "content": "<p><a href=\"https://github.com/hl7-be/matchbox\">https://github.com/hl7-be/matchbox</a></p>",
        "id": 265077190,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639603579
    },
    {
        "content": "<p>This is work in progress</p>",
        "id": 265077226,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639603592
    },
    {
        "content": "<p>Matchbox supports structure map extraction, not definition-based.</p>",
        "id": 265078119,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1639604014
    },
    {
        "content": "<p>Correct. I'm with you on the definition-based extraction. It is functionally less than structuremap based, and is not implemented broadly</p>",
        "id": 265078579,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639604241
    },
    {
        "content": "<p>Indeed. I think it's also easier and portable because it can live within a Q or QR.</p>",
        "id": 265078990,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1639604446
    },
    {
        "content": "<p>Btw, on structure map-based, is there tool that will evaluate it quickly without having to submit it to matchbox? Like a plugin or one-liner?</p>",
        "id": 265079067,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1639604502
    },
    {
        "content": "<p>That is the Work-in-progress bit :)</p>",
        "id": 265079163,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639604540
    },
    {
        "content": "<p>I am using a static page that <br>\na) lists all the questionnaires in the server<br>\nb) when a user selects one, it renders the questionnaire<br>\nc) when the user presses \"extract\" it gets the structure map that is associated with the questionnaire</p>",
        "id": 265079525,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639604645
    },
    {
        "content": "<p>nice</p>",
        "id": 265079631,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1639604668
    },
    {
        "content": "<p>Doesn't do much about tedious work to do structuremaps, but helps prototype and evaluate</p>",
        "id": 265079936,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639604731
    },
    {
        "content": "<p>As far as I know, there is no open source definition based extract tooling. We've also run into some practical limits with that when dealing with multiple resources and cross-references.   I think we need to move to fhir mapping language /structure maps.</p>",
        "id": 265086841,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1639608234
    },
    {
        "content": "<p>Thanks for sharing Jose! Is this a wrapper of HAPI? Want to make sure we can keep upgrading HAPI as needed.  We've built a web interface based on a library we got from the Norwegian health institute that allows us to do web based data entry of questionnaires so this looks like a perfect compliment.   <span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span> we want to explore if we can use kotlin libraries from the SDK too to support extraction.</p>",
        "id": 265090757,
        "sender_full_name": "Matt Berg",
        "timestamp": 1639610454
    },
    {
        "content": "<p>Definition based though has advantages in that it allows people to include in questionnaires .  I realize it's not as robust but for people wanting to build simple case management apps I don't think that should be overlooked.</p>",
        "id": 265090936,
        "sender_full_name": "Matt Berg",
        "timestamp": 1639610569
    },
    {
        "content": "<p>matchbox is built on HAPI, yes</p>",
        "id": 265130055,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639647160
    },
    {
        "content": "<p>with what <span class=\"user-mention\" data-user-id=\"458846\">@Vitor Pamplona</span>  is doing on the android CQL engine, that should support CQL extraction w/o too much effort.  just need to figure out API calls on the FHIR SDK.   Flagging for <span class=\"user-mention\" data-user-id=\"366686\">@Jing Tang</span>  as well.</p>",
        "id": 265145395,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1639656130
    },
    {
        "content": "<p>Is that work being done in the SDK?  I think it would be good to discuss general approaches around extraction and how we want to make them accessible to different kind of users.</p>",
        "id": 265150279,
        "sender_full_name": "Matt Berg",
        "timestamp": 1639659034
    },
    {
        "content": "<p>CQL is running quite well on Android with the latest PR merge on the CQL Engine. But all FHIR libs are still quite heavy for phones, even flagships.</p>",
        "id": 265155481,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1639661400
    },
    {
        "content": "<p>Yea the CQL engine stuff we've been running (outside of the evaluate in the SDK) is pretty heavy.  This is something we'll need to really profile and see if there is room for optimizations with the FHIR SDK over the long run.</p>",
        "id": 265191771,
        "sender_full_name": "Matt Berg",
        "timestamp": 1639676654
    },
    {
        "content": "<p>Long term pitch: Let's ban the use of Reflection on FHIR in favor of code generation. That includes compiling CQL into JVM code. That will solve 90% of the performance issues, finally putting FHIR projects into the \"environmentally conscious\" bucket.</p>",
        "id": 265204347,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1639681827
    },
    {
        "content": "<p>I'm okay with this. As long as the CQL hangs around. We don't want to force Java on people.   For example, there is a JavaScript implementation of the CQL engine</p>",
        "id": 265204628,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1639681951
    },
    {
        "content": "<p>oh.. Yes... Ban reflection on the FHIR libs written for Java only.</p>",
        "id": 265205051,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1639682151
    },
    {
        "content": "<p>I brought up Kotlin though as I know we are doing data extraction in kotlin right now.  We can run that on servers and I believe it can compile down to JS too. So was just thinking about a way to have consistent support across both the SDK and server for extraction</p>",
        "id": 265213510,
        "sender_full_name": "Matt Berg",
        "timestamp": 1639685859
    }
]