[
    {
        "content": "<p>Hi. Let's say that we want to put constraints on some  parameters for a GET url. for example (not a real example but serves the purpose), we may want to say that although FHIR supports searching on multiple resource IDs, our profile just supports one single ID per GET call.<br>\nOr any other constraint. How would such a constraint look like?</p>",
        "id": 153894589,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1497990577
    },
    {
        "content": "<p>is there anything on the IGs for this?</p>",
        "id": 153894590,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1497990633
    },
    {
        "content": "<p>CapabilityStatement/SearchParameter combination, but we have not defined either elements or extensions for dealing with search parameter cardinality. That's come up in a several contexts this week</p>",
        "id": 153894591,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497990933
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> . If it is on the capabilityStatement, it means it is outside the scope of a specific IG, correct? It applies on system level. I initially thought that when we profile in IHE, we are closer to the concept of an IG than to a Capability Statement.  <br>\nso:</p>",
        "id": 153894702,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1498045612
    },
    {
        "content": "<p>Would a profile be a generic capabilityStatement that should be supported by any system , instead of an IG?<br>\nif not, would it make sense to have that capability (to profile searchParams) on IG level? I.e. for transaction A, this is the search parameter constraints you can use. and for transaction B, here are the other search parameters and constraints</p>",
        "id": 153894703,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1498045751
    },
    {
        "content": "<p>i am lacking experience on this so perhaps it's my lack of understanding, so I will gladly take \"RTFM\" for an answer</p>",
        "id": 153894704,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1498045796
    },
    {
        "content": "<p>an IG can publish a capability statement that must be conformed to , along with search parameters </p>",
        "id": 153894719,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498049273
    },
    {
        "content": "<p>I think that answers the rest of your question too: most IGs include a profile on capability statement </p>",
        "id": 153894720,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498049318
    },
    {
        "content": "<p>Jose, an IG is just a documentation container for a set of constraints. Those constraints would be technically defined using the Conformance resources : <a href=\"http://build.fhir.org/conformance-module.html\" target=\"_blank\" title=\"http://build.fhir.org/conformance-module.html\">http://build.fhir.org/conformance-module.html</a>. So an IG would organize as necessary StructureDefinition, OperationDefinition, SearchParameter, CompartmentDefintion, ElementDefinition. Likely also ValueSets, TestScript, etc. -- See the conformance-module </p>",
        "id": 153894721,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498049641
    },
    {
        "content": "<p>I think Jose is looking for a way to restrict the id cardinality on an IHE-profiled query, but not to restrict it for other queries to the same resource.</p>",
        "id": 153894772,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1498061466
    },
    {
        "content": "<p>I don't follow how that works in real life</p>",
        "id": 153894794,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498065522
    },
    {
        "content": "<p>I was not sure the capabilityStatement could go _under_ the IG. I thought only the other way around.<br>\nLet me try it out or find the use case. But indeed the point is that for resourceX.elementY we may have some criteria for one interaction and different criteria for another interaction</p>",
        "id": 153894796,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1498065745
    },
    {
        "content": "<p>so what does the end-point do? Do you need separate end-points so you know which interaction is which?</p>",
        "id": 153894800,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498067380
    },
    {
        "content": "<p>servers deal in capabilities, not interactions</p>",
        "id": 153894801,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498067393
    },
    {
        "content": "<p>You wouldn't need a separate endpoint if you could include a \"query profile\" parameter. This could indicate that the query imposes different rules than a regular query (cardinality, value sets, etc.).<br>\nHowever, as I write that, it strikes me that an operation would probably be a better way to tackle that problem.</p>",
        "id": 153894805,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1498069252
    },
    {
        "content": "<p>Jose, can you please give us the specifics of this? What parameter? Why?   Is this really guidance that the use-case only needs one? Or is it really that you want the server to FAIL the transaction if more than one?</p>",
        "id": 153894806,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498069270
    },
    {
        "content": "<p>actually i just wanted to start with documenting a query parameter, so I will see the capabilityStatement/searchParam.</p>",
        "id": 153894839,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1498076565
    },
    {
        "content": "<p>the capabilityStatement made me think whether this is intended to apply system-wide, or for a specific transaction. <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>, that's it: i don't want to impose all constraints on a system level. For example, different constraints may apply when searching or getting prescriptions (medicationRequest) vs MAR requests (medicationRequest). These are different pieces of information that use the same resource.</p>",
        "id": 153894840,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1498076950
    },
    {
        "content": "<p>i will play with it during the next insomnia.</p>",
        "id": 153894841,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1498076977
    }
]