[
    {
        "content": "<p>I was thinking that the PDQ interaction to obtain a Patient's URL prior to invoking a document submission in MHD could be easily collapsed into the same Transaction</p>\n<p>Option1: conditional create<br>\nper inclusion of the Patient resource in the bundle with a \"conditional create\" criterium<br>\n- create patient if it doesn't already exist, <br>\n- leave it alone, if it already exists, <br>\n- in any case, replace all subsequent references in the bundle with the Patient resource URL, <br>\n- error if multiple match the criteria</p>\n<p>Option 2: conditional reference, <br>\ne.g. instead of first doing a <br>\n<code>GET /Patient?identifier=12345678</code><br>\nwhy not reference  <code>DocumentReference.subject</code> directly to <code>/Patient?identifier=12345678</code>  in the MHD transaction?<br>\nIn this case, the Transaction would error, if there Server found more or less than one exact match for the criteria.<br>\nThat assuming of course, that the client has a unique search criteria for the patient, such as the identifier. However, I can think of many UseCases for that: <br>\nThe document source scans a PID barcode from a wristband or the document source is a V2 MDM message...</p>",
        "id": 153917292,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1509612992
    },
    {
        "content": "<p>Simone, YEs that could work, but it puts a burden on the server actor that IHE does not place on the server actor of XDS. Thus to keep the level of complexity similar, we have required that the client resolve to a Reference</p>",
        "id": 153917335,
        "sender_full_name": "John Moehrke",
        "timestamp": 1509641129
    },
    {
        "content": "<p>said another way... you could write your client that way, but it would need to have the logic to handle a failure-mode anyway. So you are really just optimizing transaction traffic, and making the client even more complex in order to be fully robust.</p>",
        "id": 153917336,
        "sender_full_name": "John Moehrke",
        "timestamp": 1509641250
    }
]