[
    {
        "content": "<p>Quote from MHD's \"Open Issues and Questions\":</p>\n<blockquote>\n<p>MHD_048: We have chosen to define some secondary resources as ‘contained’, which in<br>\nFHIR means that they would not standalone, and thus would not be revisable. We chose<br>\nthis characteristic as the closest to XDS metadata principle. However this means that<br>\n225 these secondary resources would not be searchable.</p>\n</blockquote>\n<p>I would suggest to define a profile on the Reference type and make populating the <code>display</code>element (e.g. with the author's name) mandatory.<br>\nAlso, whenever there are identifiers for these resources that are commonly understood within the domain - such as national identifiers for practitioners - Reference.identifier should also be populated. That way, at least a search by name and/or identifier could be supported, which probably covers &gt;80% of the usecases.</p>",
        "id": 153916692,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1509349675
    },
    {
        "content": "<p>That might be a good 'best practice', but IHE has existing XD* profiles that don't have that requirement. Thus where the data is  stored in XDS, these best-practices can't be filled.   A secondary profile that further refines, seems like a useful way to convey these best-practices... Right?</p>",
        "id": 153916770,
        "sender_full_name": "John Moehrke",
        "timestamp": 1509370005
    },
    {
        "content": "<p>Oh, since this was filed under \"open issues and questions\", I was under the impression that you were looking for a solution for this issue...</p>",
        "id": 153916773,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1509370867
    },
    {
        "content": "<p>ah, well turns out they are searchable according to the STU3 specification. So I have an IHE CP to correct that and add the method of searching. This was one of the things we discovered at the FHIR Connectathon last.  <a href=\"https://healthcaresecprivacy.blogspot.com/2017/09/fhir-connectathon-of-ihe-mhd-profile.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/09/fhir-connectathon-of-ihe-mhd-profile.html\">https://healthcaresecprivacy.blogspot.com/2017/09/fhir-connectathon-of-ihe-mhd-profile.html</a></p>",
        "id": 153916774,
        "sender_full_name": "John Moehrke",
        "timestamp": 1509371069
    },
    {
        "content": "<p>we are always looking for feedback, comments, and improvements... especially during \"Trial Implementation\".</p>",
        "id": 153916775,
        "sender_full_name": "John Moehrke",
        "timestamp": 1509371103
    },
    {
        "content": "<p>There you go :D</p>",
        "id": 153916776,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1509371116
    }
]