[
    {
        "content": "<p>I am working on a barcode supplement, anyone have experience with Barcodes and FHIR? The scope is scan a barcode and get a populated FHIR Resource based on the barcode. The challenge is that a barcode can be a Device, Patient, Medication, Food. So my first thoughts were to define an operation that figures this out. Thoughts?</p>",
        "id": 153912582,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507201343
    },
    {
        "content": "<p>Not being entirely sure on what you want, but according to spec you can do the following: GET [base]/?_type=Device,Patient,Medication&amp;_id=[barcode] ... is it something like that you're looking for?</p>",
        "id": 153912586,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1507203960
    },
    {
        "content": "<p>the barcode is not a resource id</p>",
        "id": 153912587,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507203988
    },
    {
        "content": "<p>so you cannot use &amp;_id for the barcode, so you cannot query</p>",
        "id": 153912588,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507204010
    },
    {
        "content": "<p>(well, actually that could be a way out)</p>",
        "id": 153912589,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507204022
    },
    {
        "content": "<p>i find comfort in the idea of defining an operation. Normally we profile interoperability. Depends on what your supplement is for, but I think I know what supplement is that :)</p>",
        "id": 153912590,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507204126
    },
    {
        "content": "<p>may want to check <a href=\"http://zeora.net/blog\" target=\"_blank\" title=\"http://zeora.net/blog\">zeora.net/blog</a></p>",
        "id": 153912591,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507204140
    },
    {
        "content": "<p>Im not sure I understand why it is hard to query the various Resources that you know how to process. It is simply code. You put it on the front, or the back. By requiring it be on the server, you are asking for a special purpose server. By doing the processing in the app, you are able to work in many environments.</p>",
        "id": 153912592,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507204505
    },
    {
        "content": "<p>well ... I guess that depends. The barcode could be the ressource id and in that case it would be correct.</p>",
        "id": 153912593,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1507204536
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> - special purpose server == some server that fulfills some standard?</p>",
        "id": 153912594,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1507204612
    },
    {
        "content": "<p>yes, the special purpose can be a Profile or IG, and thus special in that the Profile or IG is declared as being supported. However 'special' means it is in a population of solutions that is smaller than non-specialized. Thus the body of existing FHIR Servers, non today support your special case.. This is my point indeed.      Sometimes a Special purpose server is the right solution, sometimes it isn't. I was just indicating 'Im no sure...' for this use-case.  As it seems to me one would want to have this barcode app broadly usable, not tied to a smaller population of 'special purpose' servers... just my opinion on the use-case, not my condemnation of special purpose severs.</p>",
        "id": 153912595,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507204935
    },
    {
        "content": "<p>so, searching for the barcode could work if:<br>\na) the server assigns resource IDs for each barcode and you search the _id as you mention<br>\nOR<br>\nb) there is a common \"barcode attribute\" for all the resources you mention (if it is not a common attribute, one single query will result in error)<br>\nOR<br>\nc) the client queries each resource like patient.identifier, medication.code, device.udi.carrieraidc</p>",
        "id": 153912603,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507208097
    },
    {
        "content": "<p>problem with a) : how does that work for items that have the same barcode? It's not the same item, should it be the same resource? your inventory managemetn possibilities would become limited because of a technical trick</p>",
        "id": 153912604,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507208151
    },
    {
        "content": "<p>problem with b) - not really, simply requires us to harmonize (we're working on it)</p>",
        "id": 153912605,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507208175
    },
    {
        "content": "<p>problem with c) - the initial problem we had was that we have a dumb barcode reader, so i would put as little logic there as possible</p>",
        "id": 153912606,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507208208
    },
    {
        "content": "<p>Barcodes should be simply an optically encoded identifier. Any system that doesn't make truly unique identifiers will cause collisions. That is a identity management problem, not a technical or standards problem.</p>",
        "id": 153912608,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507209207
    },
    {
        "content": "<p>If your barcode reader is so dumb, then it won't be able to process the resulting FHIR Resource... thus that barcode reader couldn't be part of this discussion. The discussion is about how to search the FHIR resource space for relevant resources with the identifier given in a barcode. Thus the 'client' that is doing the searching, has some ability to process the resulting FHIR Resource...</p>",
        "id": 153912609,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507209295
    },
    {
        "content": "<p>If that code can process a FHIR Resource, then it has the ability to LOOP through a set of Resources. where that set of resoures is the set of resources that it is programmed to be able to process.</p>",
        "id": 153912610,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507209400
    },
    {
        "content": "<p>From my guessing hat: The transactions that Michael is looking at are the following 2: a) dumb app/ barcode reader says \"i have something here, i don't know what it is, please decode it; b) the server responds to the app/barcode reader AND/OR eventually sends to the next guy the notice \"hey, someone was using a device, with a GTIN number X, with a serial number Y....\"</p>",
        "id": 153912669,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507228942
    },
    {
        "content": "<p>agree, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> that the code can do a loop, but the idea (see the blog post) is that it'd have to loop across resources using different attributes: patient.identifier, then device.udi.carrieraidc, medication.??? (doesn't exist yet).<br>\nThis has given some ideas, namely harmonize how medication/devices/... use barcodes, because the barcode is a simple way to transmit information. And that information can be a code, an indentifier, or a more complex string</p>",
        "id": 153912670,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507229072
    },
    {
        "content": "<p>the requirement from the barcode folks was that the system that sends the barcode may not be the only one that receives the decoding result</p>",
        "id": 153912671,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507229175
    },
    {
        "content": "<p><a href=\"http://zeora.net/blog/2017/09/14/querying-different-items-from-their-barcode/\" target=\"_blank\" title=\"http://zeora.net/blog/2017/09/14/querying-different-items-from-their-barcode/\">http://zeora.net/blog/2017/09/14/querying-different-items-from-their-barcode/</a></p>",
        "id": 153912672,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507229213
    },
    {
        "content": "<p>the premise that the client that does the search can process the result is not always true (at least as it is defined in the supplement)</p>",
        "id": 153912673,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507229310
    },
    {
        "content": "<p>anyway, this lacked some context. These things were discussed in the supplement calls already, and I guess <span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span> wanted to probe for additional input.</p>",
        "id": 153912674,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507229388
    },
    {
        "content": "<p>Yes. I was looking for more input. Thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  for the blog.<br>\nMy use-case is about interpreting the barcode. If I go the query route there will only be results if the endpoint has some instance of a resource for that barcode. So that won't help me. That is why I think the operation is the only way for my use-case.</p>",
        "id": 153912811,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507273134
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I have a question about the PDQm on your blog. It says you can either send just the patient identifier or the whole barcode. But that means you have to add that whole barcode as an alternate identifier for the Patient right?</p>",
        "id": 153912812,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507273308
    },
    {
        "content": "<p>Correct, <span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span>  - the functionality might only be possible if you have an operation. We can go that route, but when you mention \"supplement\" I think I know the scope, and we are working on transactions, and not functionality. <br>\nOn the other hand, we can profile an operation as part of a transaction, so i look forward for more discussion on that</p>",
        "id": 153912813,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507274668
    },
    {
        "content": "<p>and Yes, if you stick to barcodes as identifiers, the Patient identifier case does require the barcode is assigned as an identifier for the patient resource.</p>",
        "id": 153912814,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507274721
    },
    {
        "content": "<p>for operation, are you thinking of smth like \" $decodeBarcode?aidcString=012345678 \"?</p>",
        "id": 153912815,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507274947
    },
    {
        "content": "<p>Yes! Actually \"$decode-barcode?aidcString\" :-) That looks more consistent with other existing operations.<br>\nBy the way is \"barcode\" the most generic name since it could also come from rfid?</p>",
        "id": 153912816,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507275283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span> you mean $decode-barcode?&lt;value of the aidc String&gt; or $decode-barcode?aidcString=&lt;value of the aidc String&gt;</p>",
        "id": 153913232,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507630384
    },
    {
        "content": "<p>i think the latter,right?</p>",
        "id": 153913233,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507630392
    },
    {
        "content": "<p>Yes. The latter.</p>",
        "id": 153913235,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507631231
    },
    {
        "content": "<p>and can we have operations across resource types? or we have to define an operation for device, another for medication...?</p>",
        "id": 153913237,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507632039
    },
    {
        "content": "<p>in practice: i am a dumb barcode reader. How do I say \"I have no idea what this is, i just have the barcode\".? surely I can't send a resource... and what is the response?</p>",
        "id": 153913238,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507632135
    },
    {
        "content": "<p>My thoughts are that the barcode device sends the barcode to the consumer (some application) that then uses the barcode processor to decode the barcode into a resource. So the consumer is the actual application that does the FHIR request.</p>",
        "id": 153913266,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507635402
    },
    {
        "content": "<p>ok, that is covered and if that were the initial scope, it would have made our life a lot easier.</p>",
        "id": 153913267,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507635513
    },
    {
        "content": "<p>Then the barcode consumer can fill all the other fields, like Device name, Manufacturer name, reference to patient (when the barcode is something else than patient ;-), etc. etc. Or it can request for an existing Resource based on the decoded fields.</p>",
        "id": 153913268,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507635548
    },
    {
        "content": "<p>idd. scope-wise, we want something very small: Just decode the barcode string</p>",
        "id": 153913269,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507635599
    },
    {
        "content": "<p>do we send the barcode string in raw form? or base-64? at this moment I am leaving that open, i.e. readers can send whatever they want and the operation has to be defined to support that.</p>",
        "id": 153913270,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507635641
    },
    {
        "content": "<p>The datatype for aidc in FHIR Device is Base64.</p>",
        "id": 153913271,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507635740
    },
    {
        "content": "<p>:) i know, it was a lot of work to make it so.</p>",
        "id": 153913272,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507635765
    },
    {
        "content": "<p>The operation should detect what form is used. How do barcode(rfid) readers normally do this?</p>",
        "id": 153913273,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507635851
    },
    {
        "content": "<p>but can we expect a barcode reader to be able to push base-64 content ? and do we limit ourselves to that? <br>\nin some cases the barcode string is just ascii</p>",
        "id": 153913274,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507635923
    },
    {
        "content": "<p>afaik, rfid readers can be just a unique number, or can actually contain some data. Don't know how they provide the \"string\"</p>",
        "id": 153913275,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507635976
    },
    {
        "content": "<p>Can we expect some device driver that handles that. The Consumer then gets the ASCII barcode from the Reader through the driver? So the Consumer uses the ASCII HRF for the query.</p>",
        "id": 153913276,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507636085
    },
    {
        "content": "<p>consumer is not in this picture. the one that gets the raw string is the barcode processor</p>",
        "id": 153913277,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507636125
    },
    {
        "content": "<p>In FHIR terms I see the processor as being the Operation implementation, right? It receives a barcode and decodes it and returns the appropriate Resource.</p>",
        "id": 153913280,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507636450
    },
    {
        "content": "<p>yes</p>",
        "id": 153913281,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507636583
    },
    {
        "content": "<p>Sorry. I am a bit lost I think.. <br>\nWe want to use the operation. That means that there is an endpoint that gets queried trough a REST query with the barcode in the parameter and a resource as response. That is the way it works. The current transactions look more like MESSAGING (HL7 v2). That is a different paradigm.</p>",
        "id": 153913282,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507637041
    },
    {
        "content": "<p>yes, sorry, we had that discussion some time ago.</p>",
        "id": 153913283,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507637068
    },
    {
        "content": "<p>the idea is:</p>",
        "id": 153913284,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507637071
    },
    {
        "content": "<p>sometimes you send a resource and you do require a response (if you are a smartphone app)</p>",
        "id": 153913285,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507637138
    },
    {
        "content": "<p>but other times, if you are just a cashier, or an inventory dumb barcode reader, you say \"i found this, not sure who cares\"</p>",
        "id": 153913286,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507637208
    },
    {
        "content": "<p>that was the assumption we made for scope</p>",
        "id": 153913287,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507637217
    },
    {
        "content": "<p>in case 1, which is the most common, the barcode reader and the consumer are the same system</p>",
        "id": 153913288,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507637237
    },
    {
        "content": "<p>You could use FHIR in a messaging fashion, but that feels odd. Cannot we define a difference sequence in the FHIR REST case?</p>",
        "id": 153913289,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507637914
    },
    {
        "content": "<p>the point is not about messaging or not. The idea is how do we support that the barcode reader may not be the final destination of the content?</p>",
        "id": 153913290,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507637969
    },
    {
        "content": "<p>if we have an answer to that, our life may be much easier</p>",
        "id": 153913292,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507638755
    },
    {
        "content": "<p>I was wondering if there are minimal requirements for an Implementation Guide? For example if you define a new Operation, say decode-barcode. You need a couple of artifacts to fully describe what it does. In FHIR terms these are OperationDefinition, OperationOutcome,  some Profiles, a CapabilityStatement so that you can check if a server implements this operation, and then you wrap all these things in an ImplementationGuide.</p>",
        "id": 153917042,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1509521319
    },
    {
        "content": "<p>At this moment, even the ImplementationGuide is (wisely, i'd say) out of scope of IHE deliverable packages.</p>",
        "id": 153917203,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509563030
    },
    {
        "content": "<p>we are defining what should be the implementation materials</p>",
        "id": 153917204,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509563067
    },
    {
        "content": "<p>Yes. You are right. I meant the \"Implementation materials\". I did a first pass at them. Were shall I put them?</p>",
        "id": 153917530,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1509714487
    },
    {
        "content": "<p>if you mean a first pass at a list: here(?)<br>\nif you mean a first pass at the actual resources: here? mail? here is ok, i guess</p>",
        "id": 153917531,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509714555
    },
    {
        "content": "<p>in any case, thanks! we need to get onto an agreed set of deliverables.</p>",
        "id": 153917532,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509714584
    },
    {
        "content": "<p>John is creating a folder structure in the FTP site</p>",
        "id": 153917533,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509714602
    },
    {
        "content": "<p>Hi Michael. See my instructions to IHE profiles on fhir   <a href=\"http://wiki.ihe.net/index.php/Guidance_on_writing_Profiles_of_FHIR\" target=\"_blank\" title=\"http://wiki.ihe.net/index.php/Guidance_on_writing_Profiles_of_FHIR\">http://wiki.ihe.net/index.php/Guidance_on_writing_Profiles_of_FHIR</a></p>",
        "id": 153917558,
        "sender_full_name": "John Moehrke",
        "timestamp": 1509720814
    },
    {
        "content": "<p>I am working on the IHE UBP profile FHIR artifacts here: <a href=\"http://github.com/mvdzel/ihe-ubp-fhir\" target=\"_blank\" title=\"http://github.com/mvdzel/ihe-ubp-fhir\">github.com/mvdzel/ihe-ubp-fhir</a> <br>\nMy point was that the OperationDefinition is not mentioned on your instruction page.<br>\nThere is also a partial demo impl on top of HAPI for it.</p>",
        "id": 153917616,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1509724471
    },
    {
        "content": "<p>understood... i added mention, that we don't yet have lessons learned to convey.</p>",
        "id": 153917619,
        "sender_full_name": "John Moehrke",
        "timestamp": 1509726475
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> At the last FHIR DevDays we created a TestScript for running in Touchstone. I think it makes sence to also include TestScript and related resources in the Guidance on writing profiles page. Do you agree?</p>",
        "id": 153921581,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1511685707
    },
    {
        "content": "<p>I think IHE should also publish the FHIR artifacts in Simplifier since that is the place were the FHIR community will look.</p>",
        "id": 153921582,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1511685738
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span> the guidance I have published does have the conformance resources published through Simplifier to the FHIR Registry.  As to TestScript, I would agree that they should be developed and also published. I would consider TestScript resources just as critical to an IHE Profile (FHIR Implementation Guide) as the other conformance resources. I am surprised that TestScript resource is not within the conformance group on the FHIR specification.</p>",
        "id": 153921608,
        "sender_full_name": "John Moehrke",
        "timestamp": 1511717945
    }
]