[
    {
        "content": "<p>Hi There. Is there FHIR equivalent to XCPD just as MHD is to XDS. Any hints how best to implement in FHIR maybe reference Project? Appreciate any suggestion.</p>",
        "id": 153942420,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1520266247
    },
    {
        "content": "<p>No, not yet. We haven't looked at any of the cross-community profiles. It may be that the same set of problem don't exist with FHIR (or can be solved trivially). I think most people are still having trouble getting their minds around FHIR-enabled distributed systems within an organization, and haven't though cross-organization yet. <br>\nI imagine a multi-destination forwarding proxy for facade for FHIR could solve the problem more generally than just XCPD.<br>\nIf you have a use case, please let us know. We take submissions for new work items in August/September, and could potentially take this on for next year. Alternatively, we might have an idea that allows you to move forward before then.</p>",
        "id": 153942436,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1520270666
    },
    {
        "content": "<blockquote>\n<p>No, not yet.[...]If you have a use case, please let us know. We take submissions for new work items in August/September, and could potentially take this on for next year. Alternatively, we might have an idea that allows you to move forward before then.</p>\n</blockquote>\n<p>Thnx alot Elliot. Use case is an National Network with a mixed healthcare/research setting. Patients switch caregivers and caregivers are served by different pathologists - for the same patient. I've got the gp's, physicians and pathologists beautifully lined&amp;tied up. patient hashes are ok but their real names are a pain and have to be stuffed somewhere locally. A general solution has it's advantages &amp; disadvantages. As ever. I'll keep you copied on how this evolves.</p>",
        "id": 153942532,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1520281986
    },
    {
        "content": "<p>I might assert that, like with MHD, one could use PDQm as a local API; where the backend infrastructure is XCPD federated patient queries.</p>",
        "id": 153942552,
        "sender_full_name": "John Moehrke",
        "timestamp": 1520304602
    },
    {
        "content": "<p>Trial implementation is open right now on PDQm and MHD... so now is a good time to 'try' it and give feedback.</p>",
        "id": 153942553,
        "sender_full_name": "John Moehrke",
        "timestamp": 1520304664
    }
]