[
    {
        "content": "<p>Suppose there are multiple information sources (ehr in hospital 1, ehr in hospital 2, gp) were data is available for 1 patient. <br>\nSuppose there is an index with endpoints per patient.<br>\nI am thinking about a solution were there is an index were we can get the Endpoints were data is available for a specific patient.<br>\nIs there anybody that can point me to examples or specifications for this?<br>\nAlso interested in SMART-on-FHIR apps that can than present / integrate this data.<br>\nThanks!</p>\n<p>(I am not sure were to ask this question and I thought to start here)</p>",
        "id": 177803987,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1570710431
    },
    {
        "content": "<p>I think you are describing the problem that a new work item is to address.  This work item intends to orchistrate the many existing (and some gaps) into an HIE that is based around FHIR -- <a href=\"https://github.com/IHE/IT-Infrastructure/tree/master/MHD-HIE\" target=\"_blank\" title=\"https://github.com/IHE/IT-Infrastructure/tree/master/MHD-HIE\">https://github.com/IHE/IT-Infrastructure/tree/master/MHD-HIE</a></p>",
        "id": 177804426,
        "sender_full_name": "John Moehrke",
        "timestamp": 1570710783
    },
    {
        "content": "<p>As to the discovery of endpoints. the mCSD profile contains this functionality, for providing a directory where organization endpoints are published.</p>",
        "id": 177804479,
        "sender_full_name": "John Moehrke",
        "timestamp": 1570710826
    },
    {
        "content": "<blockquote>\n<p>As to the discovery of endpoints. the mCSD profile contains this functionality, for providing a directory where organization endpoints are published.</p>\n</blockquote>\n<p>I would like to query for (organisation) endpoints based on a specific patient. If I interpret the mCSD right, it does not support that use-case.</p>",
        "id": 178181907,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1571137732
    },
    {
        "content": "<p>correct. you would find endpoints from mCSD, then do a query at each endpoint for the patient (PDQm)</p>",
        "id": 178325218,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571257483
    },
    {
        "content": "<p>There could be a massive Patient registry... nothing to stop someone from centralizing a patient registry (using PDQm and/or PIXm). Then from that you would see all the alias Patient resources, each would be at different organizational endpoints. This however creates a massive patient database.</p>",
        "id": 178325349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571257572
    }
]