[
    {
        "content": "<p>Please discuss the pro/con of having IHE MHD switch from using DocumentManifest for SubmissionSet, to using List for SubmissionSet? I am wondering if this is a better long term strategy given the limited interest in DocumentManifest vs the more broad interest in List for many use-cases. Yes it would require merging in some functionality not currently found in List, but it seems a better fit than a special case resource like DocumentManifest.</p>",
        "id": 183889052,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576792500
    },
    {
        "content": "<p>Can you refresh my memory on the advantage of List vs Bundle?</p>",
        "id": 183889218,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1576792614
    },
    {
        "content": "<p>Bundle is just a packaging mechanism. It says nothing about the relationships between the resources, List is the opposite</p>",
        "id": 183889437,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576792777
    },
    {
        "content": "<p>What does DocumentManifest achieve?</p>",
        "id": 183889462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576792794
    },
    {
        "content": "<p>(in XDS, I mean)</p>",
        "id": 183889474,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576792801
    },
    {
        "content": "<p>Thanks. In XDS, there are two \"bundling\" concepts: Submission Set which gathers all content submitted together; and Folder which gathers content related to a particular topic (e.g., the patient's knee injury). Folders can be updated over time as new documents become relevant to the topic, and anyone (with authorization) can add to it. Alternatively, a provider could define a \"patient's documents interesting to me\" folder. Submission Set is (largely) immutable and is created by the system that publishes the documents as part of the publication process.</p>",
        "id": 183889974,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1576793092
    },
    {
        "content": "<p>Note that neither concept is required when using XCA (the cross-community layer on top of XDS).</p>",
        "id": 183890090,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1576793162
    },
    {
        "content": "<p>\"List\" is an appropriate resource for both (squarely in it's scope) and also a more appropriate word than 'manifest'</p>",
        "id": 183890143,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576793204
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, it is the fact that neither folder nor bundle is required in XCA that I think removing them from the profile is safe, and would allow us to wait to see if anyone else moves DocumentManifest forward.</p>",
        "id": 183890190,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1576793268
    },
    {
        "content": "<p>(Agree, I always trip over \"manifest\". It isn't obvious. But makes sense when you think of it as the list <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> of things in this package.</p>",
        "id": 183890326,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1576793382
    },
    {
        "content": "<p>you mean DocumentManifest, not bundle... but I get the point.  Understood, but that leaves MHD only as a Query/Retrieve function. No publication pathway.</p>",
        "id": 183890410,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793414
    },
    {
        "content": "<p>so yes... a SubmissionSet is a list of documents as part of the submission... a packing list. aka manifest</p>",
        "id": 183890522,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793510
    },
    {
        "content": "<p>a folder in XDS is a list of documents for a specific purpose</p>",
        "id": 183890588,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793538
    },
    {
        "content": "<p>SubmissionSet is fixed at publication time, and can't be changed. Folders change over time.</p>",
        "id": 183890603,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793558
    },
    {
        "content": "<p>Actually, I meant SubmissionSet, but yes. Does it leave only Q/R functionality? And if so, is that a problem? XCA survives with Q/R only.</p>",
        "id": 183890630,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1576793584
    },
    {
        "content": "<p>You can get Folders and SubmissionSet in XCA. They are not missing... they are just read-only, and not typically thought of.. so unlikely to be queried for.</p>",
        "id": 183890643,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793605
    },
    {
        "content": "<p>I think it's a problem, yes, but I don't know if it's true. Replacing Manifest with list is a problem?</p>",
        "id": 183890664,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576793626
    },
    {
        "content": "<p>but... isn't the scope of the transaction what is submitted in the transaction?</p>",
        "id": 183890723,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576793649
    },
    {
        "content": "<p>a SubmissionSet does indeed define the publication transaction. But it is also an object that can be queried for as Provenance evidence.</p>",
        "id": 183890779,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793702
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  Support for folders and submissions is not required of a community.<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I think it is only a problem in that its a change of the profile, and that there are elements in DocumentManifest that aren't in List.</p>",
        "id": 183890818,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1576793732
    },
    {
        "content": "<p>So it should actually be Provenance then?</p>",
        "id": 183890819,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576793734
    },
    {
        "content": "<p>well, one might argue that it is also CommunicationRequest</p>",
        "id": 183890897,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793775
    },
    {
        "content": "<p>or even MessageHeader</p>",
        "id": 183890925,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793801
    },
    {
        "content": "<p>depending on the use-case (aka XDR the SubmissionSet is much closer to MessageHeader), but XDS it is much more like Provenance+List</p>",
        "id": 183890956,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793841
    },
    {
        "content": "<p>Maybe that's the answer then: Provenance+List.</p>",
        "id": 183890977,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1576793872
    },
    {
        "content": "<p>I don't think Provenance actually adds much.. I might need to do the exercise of mapping SubmissionSet into List to see what is missing. Clearly IntendedRecipient, and some clinical purpose/setting. but I expected these would be reasonable core extensions on List</p>",
        "id": 183891094,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576793972
    },
    {
        "content": "<p>I've never really understood IntendedRecipient at the functional requirements level... it's the repository, surely</p>",
        "id": 183891178,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576794024
    },
    {
        "content": "<p>no IntendedRecipient is really only intended to be used in XDR.. the \"who\" should receive this push. It was intended to be a human or service at the endpoint</p>",
        "id": 183891267,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576794119
    },
    {
        "content": "<p>but some liked it for XDS, as they liked that it indicated the original target audience of a publication... so that person could be notified when something was published with them listed</p>",
        "id": 183891331,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576794157
    },
    {
        "content": "<p>hence... communicationRequest</p>",
        "id": 183891339,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576794167
    },
    {
        "content": "<p>actually that sounds more like a message header...</p>",
        "id": 183891611,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576794373
    },
    {
        "content": "<p>Hi,<br>\npersonally I like the idea of replacing DocumentManifest with List for the XDS SubmissionSet in order to move MHD forward.<br>\nBut out of curiosity, since the current version of MHD declares XDS Folders already as List and an XDS SubmissionSet could become a List as well,  how would they be distinguished? Via different codes for the list (<a href=\"http://hl7.org/fhir/r4/valueset-list-example-codes.html\" target=\"_blank\" title=\"http://hl7.org/fhir/r4/valueset-list-example-codes.html\">http://hl7.org/fhir/r4/valueset-list-example-codes.html</a>) or some new attribute?</p>",
        "id": 184735342,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1578059978
    },
    {
        "content": "<p>Yes. I  figure we would use the .code element to distinguish between submissionSet and Folder. Thus carrying the SubmissionSet.contentTypeCode and List.codeList in an extension element. I had asked for another codeableConcept (0..*) but that got rejected by FHIR-I last month.</p>",
        "id": 184735587,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578060150
    },
    {
        "content": "<p>we can't use the List.code for much anyway as it is 0..1; and our uses are 0..*</p>",
        "id": 184735606,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578060180
    },
    {
        "content": "<p>correction, they decided to add a core extension element \"category\" (0..*) CodeableConcept FHIR-19822<br>\nso we would have that as a core extension</p>",
        "id": 184735974,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578060488
    },
    {
        "content": "<p>sounds good, but just to clarify - the distinction between Folder and SubmissionSet would be part of list.code and SubmissionSet.contentTypeCode would go to the new core extension \"category\" <br>\nor<br>\nwould both values be mapped to \"category\"?</p>",
        "id": 184736440,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1578060949
    },
    {
        "content": "<p>I think... that the best mapping is to use the List.code only to distinguish between submissionSet and Folder.. This is most visible element, vs extension.. but is also based on the fact that List.code is a 0..1 element, so can't be used for much.</p>",
        "id": 184738796,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578062959
    },
    {
        "content": "<p>I agree in this case the distinction will be a vital information for MHD and should not be \"hidden\" in an extension</p>",
        "id": 184741094,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1578064633
    }
]