[
    {
        "content": "<p>In <a href=\"#narrow/stream/179166-implementers/topic/DocumentReference.2F.24generate.20Operation\">that</a> thread, we discussed some of the syntactical issues with the current specification of the <a href=\"https://build.fhir.org/documentreference-operation-generate.html\">$generate operation</a>.</p>\n<p>In this thread I would like to talk  about the implications of using $generate in an MHD context.<br>\nI think the operation makes a lot of sense for implementers who want to send a FHIR document via MHD/XDS . Having an endpoint that is able to map the Composition metadata to the appropriate DocumentReference for an MHD/XDS affinity domain could be super convenient.</p>\n<p>What I am currently unclear about however is the expected behaviour of $generate...<br>\nDoes it simply map the content according to <a href=\"http://hl7.org/fhir/documentreference-mappings.html#fhircomposition\">this</a> mapping?</p>\n<p>Or can I expect the operation to also do some terminology translate operations in order to figure out the appropriate class/type codes for the domain.<br>\nIs there a general expectation that Compositions sent via MHD are aligned with the DocumentReference or could for example the classcodes differ (assuming that documents are classified differently at the point of creation than in an XDS context - internal vs. external...?)</p>\n<p>Interestingly the mapping between <a href=\"http://hl7.org/fhir/documentreference-mappings.html#cda\">CDA and DocumentReference</a> seems to leave room for differences in class/type codes, whereas the mapping between <a href=\"http://hl7.org/fhir/documentreference-mappings.html#fhircomposition\">Composition and DocumentReference</a> does not.</p>\n<p>I realize that these mappings are merely informational but I think there is impact on what the expected behaviour of $generate is.</p>\n<p>Opinions, anyone?</p>",
        "id": 255012676,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1632731903
    },
    {
        "content": "<p>The questions about $generate likely need a broader audience. This is not an IHE defined operation, and we have not discussed the use of $generate.</p>",
        "id": 255041878,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632747047
    },
    {
        "content": "<p>As to the internal vs external -- yes, this is intended. The mapping given for Composition -&gt; DocumentEntry/Reference are advice, not mandates. There is an update of the IHE-PCC technical framework to provide a mapping advice similar to what they have today for CDA-&gt;DocumentEntry/Reference. The IHE advice should be more clear on the adjustment to the Document Sharing community needs. As you point out class code is commonly different.</p>",
        "id": 255042233,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632747198
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179223-ihe/topic/DocumentReference.2F.24generate.20in.20context.20of.20MHD/near/255041878\">said</a>:</p>\n<blockquote>\n<p>The questions about $generate likely need a broader audience. This is not an IHE defined operation, and we have not discussed the use of $generate.</p>\n</blockquote>\n<p>I think that the general assumption with FHIR operations is, that they define an interface but not the business logic behind it.  </p>\n<p>A generic Patient/$everything implementation might just bundle up all resources pertaining to a patient whereas a US realm implementation would return the data according to meaningful use.</p>\n<p>In the same fashion, a generic implementation of DocumentReference/$generate might just use the suggested Composition-&gt;DocumentReference mapping whereas an MHD(S)-adjacent implementation would probably  want to do more than that.</p>\n<p>I opened this discussion in /ihe to figure out what the \"more than that\" could be. Or would you assume a similar functionality in an MHD(S) context to be a seperate operation?</p>",
        "id": 255585168,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633012675
    },
    {
        "content": "<p>interesting proposal to me.</p>",
        "id": 255587018,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633013345
    },
    {
        "content": "<p>much like a specific FHIR based way to do the OnDemand document entry.</p>",
        "id": 255587099,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633013374
    },
    {
        "content": "<p>I had not thought of doing $generate on the DocumentReference endpoint. Presume it is actually DocumentReference/[id]/$generate</p>",
        "id": 255587397,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633013470
    },
    {
        "content": "<p>Since the DocumentReference doesn't exist yet at the time of calling the operation I think it should be ResourceType specific, not instance specific. The Composition (or CDA) for which the DocumentReference should be created is provided as an input parameter.</p>",
        "id": 255593809,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633015691
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179223-ihe/topic/DocumentReference.2F.24generate.20in.20context.20of.20MHD/near/255587099\">said</a>:</p>\n<blockquote>\n<p>much like a specific FHIR based way to do the OnDemand document entry.</p>\n</blockquote>\n<p>I'm not entirely sure, we're thinking about the same use case. I mostly consider $generate as a service Document Recipients could provide for (IHE incompetent) Document Sources to help them prepare an ITI-65 transaction. \"Just give me your document, I'll figure out the appropriate metadata for you...\"</p>\n<p>Specifically for FHIR based clients that already went through the effort to create a document bundle with all the structured metadata, I think it would be nice to reward them with a quick and simple way to transform the Composition into the required DocumentReference. And it makes sense to have a server do it for them because looking up the mappings for e.g. class and type codes might require some serious terminology infrastructure.</p>\n<p>But I am sure there are lots of other useful applications in the MHD(S) realm...</p>",
        "id": 255602225,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633018762
    },
    {
        "content": "<p>oh, definitely not what I was thinking. that seems useful, but different. that would seem to be a useful FHIR Operation for MHD to define. today MHD expects the Document Source that is able to provide a document to be knowledgeable about what that document is. What you are describing may be needed, but is something less functional than a Document Source. Something that starts with some kind of structured/coded document that it this actor does not understand, it calls upon a service to prepare (or even invoke) the responsibility of a Document Source. So something pre-Document Source.</p>\n<blockquote>\n<p>Document Publisher -&gt; Document Describer -&gt; Document Source -&gt; Document Recipient --&gt; Document Registry</p>\n</blockquote>",
        "id": 255632349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633029709
    },
    {
        "content": "<p>Just the organization I think of..    different grouping (I grouped Document Describer and Document Source), could group Document Publisher with Document Source.</p>",
        "id": 255632745,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633029858
    }
]