[
    {
        "content": "<p>What is the motivation behind the 1..1 cardinality on <a href=\"http://DocumentReference.date\">DocumentReference.date</a>?<br>\n<a href=\"#narrow/stream/179166-implementers/topic/DocumentReference.20Date\">This discussion</a> indicates, that it is considered as rather unimportant, even a candidate for removal.<br>\nHowever, the <a href=\"http://build.fhir.org/ig/IHE/ITI.MHD/StructureDefinition-IHE.MHD.Comprehensive.DocumentReference.html\">MHD Comprehensive DocumentReference</a> mandates it.<br>\nI couldn't find any mapping to XDS, so I wonder why this decision was made...?</p>",
        "id": 256034147,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633342062
    },
    {
        "content": "<p>Quick correction: The constraint is introduced in <a href=\"http://build.fhir.org/ig/IHE/ITI.MHD/StructureDefinition-IHE.MHD.UnContained.Comprehensive.DocumentReference.html\">MHD Comprehensive DocumentReference Uncontained</a> from where it propagates into the profile mentioned above</p>",
        "id": 256053767,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633352253
    },
    {
        "content": "<p><code>date</code> is also listed among the <a href=\"http://build.fhir.org/ig/IHE/ITI.MHD/ITI-67.html\">optional search parameters for ITI-67</a>, but again, there is no <a href=\"http://build.fhir.org/ig/IHE/ITI.MHD/ITI-67.html#23674131-xds-on-fhir-option\">mapping to an equivalent XDS-parameter</a>.</p>\n<p>Note 5 on the mapping of the <code>creation</code>parameter \"The FHIR DocumentReference does not yet have a query parameter for creationTime of the document, it has only a date element which is the creation date/time of the DocumentReference. For FHIR R4 we align these two elements so that query will function.\" makes a reference to <code>date</code> which is presumably out of date, since no apparent alignment has occured in R4, but the creation parameter is non the less currently functional as a custom parameter.<br>\nIs it possible that <code>date</code> is a remnant of the 'before times', when the creation search didn't work...?</p>",
        "id": 256055837,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633353027
    },
    {
        "content": "<p>Ill look into this.</p>",
        "id": 257060566,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633957183
    },
    {
        "content": "<p>I can't find a justification. i think it is from the STU3 days where we used the .date because there was no actual creation date/time that was available to be queried. Where as now we added the DocumentReference-Creation search parameter.</p>",
        "id": 257068971,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633961131
    },
    {
        "content": "<p>seems like it is still a useful element, just not anything that should be mandated.</p>",
        "id": 257069018,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633961155
    },
    {
        "content": "<p>can you create an issue? I am not sure what to change it to. there is no IHE-DocumentSharing metadata reason for it to be populated or query parameter. so by that definition it should be 0..0. But it was used in the past and would have historically been 1..1. so not clear to me what the right change would be.</p>",
        "id": 257069475,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633961350
    },
    {
        "content": "<p><a href=\"https://github.com/IHE/ITI.MHD/issues/94\">https://github.com/IHE/ITI.MHD/issues/94</a></p>",
        "id": 257424851,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1634153926
    }
]