[
    {
        "content": "<p>There is a CR open asking for FHIR to consider EndPoint connection types more fine grain than currently specified. Currently IHE profiles like XDS, XCA, and XDR are mentioned. But the CR proposes that there might be a different EndPoint for each transaction within these profiles. I am not convinced that this theory is reality. Thus I am not persuaded. What do the likes of <span class=\"user-mention\" data-user-id=\"192274\">@Joe Lamy</span> <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span>  <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> or other IHE implementers and deployers think?<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-12342\">https://jira.hl7.org/browse/FHIR-12342</a></p>",
        "id": 224468914,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611926459
    },
    {
        "content": "<p>realistically with synchronous there is only one endpoint type of interest in most cases.. like XCA the responding-gateway is the only service. However with async there would be a useful need to have endpoint records for both ends of the communication for the purposes of recording the certificates used. Is this the need?</p>",
        "id": 224469841,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611926942
    },
    {
        "content": "<p>We have a limitation in our web services stack that prevents us from accepting Text and MTOM encoded messages at the same endpoint. So this forces us to have different endpoints for, say, ITI-38 and ITI-39, despite the fact that both transactions are to the XCA responding gateway actor. </p>\n<p>We also need to distinguish between Sync and Async, again because of limitations in our web services stack.</p>\n<p>And for ITI-41, we have a single endpoint regardless of whether we're in an XDR or XDS.b integration.</p>\n<p>So, for us, IHE transaction + Sync vs Async (WS-Addressing) would be a good fit. I think the Gazelle suite for IHE Connectathon offers distinction based on Actor+Transaction+Sync vs Async, and it works well for us.</p>",
        "id": 224491301,
        "sender_full_name": "Spencer LaGesse",
        "timestamp": 1611935896
    },
    {
        "content": "<p>I think I raised the issue originally because knowing something is an \"XDS\" endpoint isn't sufficient. At the most basic level, is it a Registry or a Repository? On the other hand, is it necessary to distinguish between XDS and XCA endpoints? (I think probably, but not always.)</p>",
        "id": 224500053,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611938843
    },
    {
        "content": "<p>How do you encode endpoints for XDS-I/XCA-I? Obviously, the Imaging Document Source is a separate endpoint (or endpoints, if you separate XCA), but do you need XDS and XDS-I Repositories?</p>",
        "id": 224500363,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611938963
    },
    {
        "content": "<p>ah, I agree Actor is important. I saw only mention of transaction..</p>",
        "id": 224505021,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611940851
    },
    {
        "content": "<p>might the classic IHE triplet be the right level: Profile/Actor/Option?</p>",
        "id": 224505090,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611940885
    },
    {
        "content": "<p>I think it might need to be Profile/Actor/Transaction/Option -- that explodes the list of terms greatly</p>\n<ul>\n<li>XDS-Registry-Feed</li>\n<li>XDS-Registry-Feed-v3</li>\n<li>XDS-Registry-Feed-v3-async</li>\n<li>XDS-Registry-Feed-v3-as4</li>\n<li>XDS-Registry-Register</li>\n<li>XDS-Registry-Register-async</li>\n<li>XDS-Registry-Register-as4</li>\n<li>XDS-Registry-Query</li>\n<li>XDS-Registry-Query-async</li>\n<li>XDS-Registry-Query-as4</li>\n<li>XDS-Registry-RegOnDemand</li>\n<li>XDS-Registry-RegOnDemand-async</li>\n<li>XDS-Registry-RegOnDemand-as4</li>\n</ul>\n<p>and that is just for Registry</p>\n<p>which feels like a task that should be done by IHE, not something that should be done in FHIR core... possibly in mCSD, or in grouping behavior between XDS and mCSD?  Which points out that mCSD did not include Endpoint resource type.</p>",
        "id": 224506587,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611941534
    },
    {
        "content": "<p>You and I discussed that when the issue was first filed.</p>",
        "id": 224506590,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611941537
    },
    {
        "content": "<p>Yes.</p>",
        "id": 224506613,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611941551
    },
    {
        "content": "<p>I think the discussion was whether what you just listed is overkill. When do we need to list the profile/actor, vs just the transaction?</p>",
        "id": 224506795,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611941640
    },
    {
        "content": "<p>it would be a shame to have no evidence of IHE in the valueset... but it would also be unfortunate if IHE needs 500 codes.</p>",
        "id": 224507161,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611941811
    },
    {
        "content": "<p>Agree.</p>",
        "id": 224507235,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611941842
    },
    {
        "content": "<p>which ones do you think can be eliminated? I think they are all possibly distinct. Especially given <span class=\"user-mention\" data-user-id=\"224405\">@Spencer LaGesse</span> comments</p>",
        "id": 224508831,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611942527
    },
    {
        "content": "<p>It is possible for some simple profiles (two actors in synchronous interaction) that only Profile is needed. (e.g. PDQ). But clearly XDS is an example of the extreme, especially because there  are two forms of async.</p>",
        "id": 224509958,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611942970
    },
    {
        "content": "<p>So, sync/async is obviously needed. But I had been thinking of all 50 RAD profiles where an Image Manager/Image Archive needs to receive a C-STORE, or does it matter if ITI-8 (patient info feed) goes to a PIX manager or a Doc Registry (that example is probably going the wrong direction)?</p>",
        "id": 224511752,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611943708
    },
    {
        "content": "<p>Is knowing the transaction and options sufficient?</p>",
        "id": 224511904,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611943791
    },
    {
        "content": "<p>It probably is from a connectivity point of view....But you may need to know Actor to decide if you want to connect to an endpoint, even if you know (based on transaction) that you can.</p>",
        "id": 224512098,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611943890
    },
    {
        "content": "<p>I'm not sure all options need to be distinguished; I think only the ones that affect the web service stack would need to be distinguished (Sync vs Async). For example, I'm not aware of any situations where one would have separate endpoints for OnDemand vs non-OnDemand. If the system supports OnDemand, it would simply publish an endpoint that handles that option as well as the base case.</p>\n<p>Regarding Actors, I'm not sure that is needed. I typically think of a directory as a list of systems I can talk to where each system as a list of endpoints I can hit to do various things. I would expect that either there would be a separate system for each actor, or I should be able to send the transaction to a singular endpoint for all actors it supports and it will figure it out internally. </p>\n<p>That being said, having the Actor listed wouldn't hurt, other than potentially unnecessarily expanding the value set.</p>",
        "id": 224516209,
        "sender_full_name": "Spencer LaGesse",
        "timestamp": 1611945856
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179223-ihe/topic/Endpoint.20connection.20type/near/224507161\">said</a>:</p>\n<blockquote>\n<p>it would be a shame to have no evidence of IHE in the valueset... but it would also be unfortunate if IHE needs 500 codes.</p>\n</blockquote>\n<p>Unfortunate, but useful</p>",
        "id": 224541328,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1611958059
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224405\">@Spencer LaGesse</span> correct. I only mentioned an option when it would have affected interop. There are other options that I did not mention.</p>",
        "id": 224739679,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612192509
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> DICOM would need both ends.</p>",
        "id": 224739720,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612192531
    },
    {
        "content": "<p>I think Profile/Actor/Option is more useful than Transaction-ID. Because some transactions have different behaviors per actual named Actor (and option).</p>",
        "id": 224739873,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612192589
    },
    {
        "content": "<p>agreed on the triple (profile,actor,option)</p>",
        "id": 224740059,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1612192669
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192274\">@Joe Lamy</span> what did care quality do?</p>",
        "id": 224744459,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612194262
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , <span class=\"user-mention\" data-user-id=\"192274\">@Joe Lamy</span>  - Is this a topic that could get closed out this week during the IHE S2S (screen-to-screen) meeting?</p>",
        "id": 238240366,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620698735
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> you may join us and drive the point. I think this would be something that should be covered somewhere in IHE. It is not clear to me if this is mCSD, or elsewhere. Today mCSD does not have any Endpoint specification. So this would seem to be a big change, although I think it was in the scope of one of the work item proposals that drove mCSD.</p>",
        "id": 238295181,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620734800
    },
    {
        "content": "<p>I wasn't thinking about anything as grand as updating a profile, just closing out the jira ticket. When would be good for me to join?</p>",
        "id": 238337978,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620750483
    },
    {
        "content": "<p>which jira ticket?</p>",
        "id": 238518111,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620842632
    },
    {
        "content": "<p>oh... well we did talk about this a bit this morning</p>",
        "id": 238518429,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620842755
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"192274\">@Joe Lamy</span> will be writing the use-case up for mCSD</p>",
        "id": 238518530,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620842783
    },
    {
        "content": "<p>It is not clear the level of detail that will be needed</p>",
        "id": 238518552,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620842794
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-12342\">FHIR#12342</a>. I'd be really happy not to get a nag email about it every week.</p>",
        "id": 238520060,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620843409
    },
    {
        "content": "<p>I don't need an extension for mCSD, I just need a vocabulary we can give to Patient Admin.</p>",
        "id": 238520174,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620843463
    },
    {
        "content": "<p>I think XDS and XCA are already there. right?</p>",
        "id": 238528459,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620846637
    },
    {
        "content": "<p>so, this seeems like it should be closed as redundant</p>",
        "id": 238528508,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620846656
    },
    {
        "content": "<p>we were discussing today if there was a need to add ihe-mhd.. but that was agreed was unnecessary as there is already a fhir type, and one would discover MHD by looking at the capability statement</p>",
        "id": 238528584,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620846694
    },
    {
        "content": "<p>They are there, but is the vocab right? One value for all XDS endpoints (including both initiator and receiver)</p>",
        "id": 238528591,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620846698
    },
    {
        "content": "<p>I don't think it is quite right. A distinction is needed between synchronous/asynchronous. Differentiation between actors is usually not needed, since in XCPD, XDS, and XCA, for each transaction there is only one actor that needs a URL published, so the actor is assumed. (An XCA Initiating Gateway, for example, could publish a URL for it's asynchronous response endpoint, but at least in WS-Addressing async this is not needed because it is also supplied in the request message. At the same time, one can imagine somebody wanting those to be published in a directory, in which case differentiation between initiating vs responding would be needed). </p>\n<p>I suggest  values represent an actor+transaction+synchronicity combination, unless there's a better way to represent synchronicity in Endpoint that I'm not seeing.</p>",
        "id": 238547708,
        "sender_full_name": "Spencer LaGesse",
        "timestamp": 1620855088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224405\">@Spencer LaGesse</span> do you have a solution in your pocket you can provide? I don't know of an alternative proposal, so your proposal would likely win.</p>",
        "id": 238548185,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620855272
    },
    {
        "content": "<p>could these alternatives be represented in the .payloadType? Meaning the .connectionType is just XDS or XCA... but the .payloadType represents the options</p>",
        "id": 238548480,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620855426
    },
    {
        "content": "<p>or do we just need a small set of flavors of XDS and flavors of XCA (flavors of XDR?)</p>",
        "id": 238548556,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620855472
    },
    {
        "content": "<p>Actually specifying those things as payloadType might make more sense. Then you can have a single endpoint for XDS/XCA/etc. and specify which payload types that endpoint supports. So if the payloadType valueset was updated to be more in line with the SOAP actions we have in our profiles, I think that could work.</p>",
        "id": 238549054,
        "sender_full_name": "Spencer LaGesse",
        "timestamp": 1620855725
    },
    {
        "content": "<p>I think that valueSet could be something we manage in IHE as an IHE vocabulary. Not clear where, but the idea we had today was that mCSD would be a logical choice.</p>",
        "id": 238553843,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620858550
    },
    {
        "content": "<p>Right, it probably should be an IHE managed vocabulary, but given how long it's taken to move format codes over, I'd prefer to see a short term solution that closes this issue, then IHE can tackle a longer term project to take over the vocab.</p>",
        "id": 238556102,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620860076
    },
    {
        "content": "<p>Spencer, are you suggesting endpoint per transaction and synchronicity moves into payload, or...? Setting aside synchronicity (and questions about initiator/responder) for a moment, what is the argument that profile and actor are not needed?</p>",
        "id": 238556611,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620860434
    },
    {
        "content": "<p>I'm suggesting we leave profile as it is, in connectionType, and specify a list of accepted SOAP actions in payloadType. Multiple endpoints with the same connectionType but (potentially) different payloadTypes would need to be expected to accomodate systems that have different endpoints for different message types. Usually the SOAP actions + the profile will imply the actor, and in cases where that isn't necessarily the case (XDS.b Document Repository/On-Demand Document Source) the client is unlikely to care about what the actor is.</p>",
        "id": 238558814,
        "sender_full_name": "Spencer LaGesse",
        "timestamp": 1620861931
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> do you mean a formal solution? Or a write up of the plan? Because the writeup of the plan can be done quickly on either the hl7 confluence, or the ihe wiki.. and be done by the end of today</p>",
        "id": 238559619,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620862487
    },
    {
        "content": "<p>I would like MnM to see the plan and agree it is an approach intended</p>",
        "id": 238559705,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620862554
    },
    {
        "content": "<p>The Jira ticket is waiting for input. If you or Spencer wants to provide that input to the ticket, that would be great.</p>",
        "id": 238559797,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620862605
    },
    {
        "content": "<p>I nominate Spencer</p>",
        "id": 238559854,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620862665
    },
    {
        "content": "<p>I think the plan we have, could be reviewed for intent... and that approval of plan intent would be sufficient to reject the jira ticket.</p>",
        "id": 238560080,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620862814
    },
    {
        "content": "<p>they might choose to reject with mod... choosing to update Endpoint to explain this pattern.</p>",
        "id": 238560127,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620862851
    },
    {
        "content": "<p>I've left a comment on the Jira ticket. Is that all that is needed for now? I don't work with the HL7 Jira often.</p>",
        "id": 238572186,
        "sender_full_name": "Spencer LaGesse",
        "timestamp": 1620872833
    },
    {
        "content": "<p>I think that's good. I'm going to leave a comment suggesting that this be closed, that IHE will be developing their own value sets for various elements, and that at some point IHE may ask for an update to the HL7 value set, but that will be via a separate ticket.</p>",
        "id": 238632807,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1620917888
    },
    {
        "content": "<p>I added this on the ticket: <br>\nIn eHx, we make use of Endpoint for XCA (and XCPD) as follows:<br>\nWe use payloadType to convey document content types (with the defined FHIR valueset), adding an \"All\" value.<br>\nWe use connectionType at the level \"IHE-XCA\"<br>\nWe use extensions to independently specify Transaction, Actor, Version (of eHx profile over the transaction), Purposes of Use allowed, Roles allowed, IP address. We don't address synchronicity because we currently don't support WS-Addressing async.</p>\n<p>So unfortunately I can't support taking payloadType at this time for that purpose. I do like eliminating codes that would be unnecessary, and perhaps we could further cut them down by utilizing an IHE-defined extension for an independent aspect like synchronicity.</p>",
        "id": 240490157,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1622131197
    },
    {
        "content": "<p>By the way, I don't think there is a big need for the eHx-specific aspects to find their way into this solution. I do think options supported besides synchronicity are useful to make known, but also not critical to be solved here.</p>",
        "id": 240494924,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1622133038
    },
    {
        "content": "<p>It seems like Carequality might also use payloadType for document content, so I agree that payloadType might not be appropriate here. For reference, this is the Carequality R4 IG:  <a href=\"https://carequality.org/healthcare-directory/index.html\">https://carequality.org/healthcare-directory/index.html</a></p>",
        "id": 240499866,
        "sender_full_name": "Spencer LaGesse",
        "timestamp": 1622135190
    },
    {
        "content": "<p>There has been a bit of work on this both in HL7 and IHE, so I wanted to update this thread. The IHE work is in the 3.6.1 version of the mCSD profile, which is out for Public Comment <a href=\"https://profiles.ihe.net/ITI/mCSD/3.6.1/index.html\">here</a>.</p>\n<ul>\n<li><a href=\"https://jira.hl7.org/browse/FHIR-12342\">FHIR-12342</a> will allow connectionType to hold more than one value.</li>\n<li>IHE has defined a <a href=\"https://profiles.ihe.net/ITI/mCSD/3.6.1/CodeSystem-MCSDEndpointTypes.html\">code system</a> for connection types to IHE-profiled SOAP endpoints, e.g. \"XCA-RespGateway-Query\". These codes provide the descriptiveness lacking in HL7-defined codes like \"ihe-xca\".</li>\n<li>In Endpoint.connectionType, because the binding to the HL7 value set is extensible, we cannot simply add codes to connectionType, for example, connectionType = {ihe-xca, XCA-RespGateway-Query} - every code used must be chosen from the HL7 value set if it applies. So instead IHE has defined an extension to hold these codes. The extension is defined <a href=\"https://profiles.ihe.net/ITI/mCSD/3.6.1/StructureDefinition-ihe-endpointspecifictype.html\">here</a> and the profiled Endpoint StructureDefinition that uses it is <a href=\"https://profiles.ihe.net/ITI/mCSD/3.6.1/StructureDefinition-IHE.mCSD.Endpoint.DocShare.html\">here</a>.</li>\n</ul>\n<p>Please review and offer feedback. Thanks!</p>",
        "id": 274753541,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1646860630
    },
    {
        "content": "<p>Isn't extensible met by, within each repetition of connectionType, having a coding from the HL7 value set, with additional values from the IHE value set permitted? Thus, following your notation, <code>connectionType[0].coding = {ihe-xca, XCA-RespGateway-Query}</code>.</p>",
        "id": 274759434,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646863729
    },
    {
        "content": "<p>the given codeSystem should be seen as nothing but example.</p>",
        "id": 274760159,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646864092
    },
    {
        "content": "<p>Maybe, but Joe says, \"In Endpoint.connectionType, because the binding to the HL7 value set is extensible, we cannot simply add codes to connectionType\" which I'm challenging in one direction, and you are challenging in another.</p>",
        "id": 274760383,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646864182
    },
    {
        "content": "<p>I don't know that it makes good sense for FHIR to have IHE document sharing codes. We can do that in mCSD</p>",
        "id": 274760566,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646864272
    },
    {
        "content": "<p>so, i just want R5 to not be extensible bound to something that has codes that are not real codes. the current codeSystem is really nothing but some example codes.</p>",
        "id": 274760687,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646864310
    },
    {
        "content": "<p>if they want to pull in some of the IHE defined codes into their example valueSet... I can see doing that, but it would be odd for FHIR core to do that</p>",
        "id": 274760908,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646864356
    },
    {
        "content": "<p>OK, so again, that's two reasons why there's no need for the proposed extension.</p>",
        "id": 274760954,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646864366
    },
    {
        "content": "<p>we need the extension for R4</p>",
        "id": 274762310,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646865050
    },
    {
        "content": "<p>I tried to go down the logic you are trying. I lost. Hence the extension today</p>",
        "id": 274762558,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646865144
    },
    {
        "content": "<p>the mCSD code is more specific, not equivalent</p>",
        "id": 274762601,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646865169
    },
    {
        "content": "<p>Ah, so is the extension in R5 too?</p>",
        "id": 274770782,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646870388
    },
    {
        "content": "<p>no, in R5 we won't need it</p>",
        "id": 274773606,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646872172
    },
    {
        "content": "<p>In R5 you move to an example valueset and ..*, in R4 you accomplish that with an extension? Got it.</p>",
        "id": 274853779,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646927419
    },
    {
        "content": "<p>feel free to enter a comment. this version of mCSD is open for comment.</p>",
        "id": 274854308,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646927633
    },
    {
        "content": "<p>I was thinking about it from a FHIR point of view, not mCSD.</p>",
        "id": 274855822,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646928208
    },
    {
        "content": "<p>There's been a lot of recent work by PA to address issues with Endpoint (see <a href=\"https://jira.hl7.org/browse/FHIR-36074\">the comments</a> for <a href=\"https://jira.hl7.org/browse/FHIR-36074\">https://jira.hl7.org/browse/FHIR-36074</a>). I opened <a href=\"https://jira.hl7.org/browse/FHIR-36589\">a new issue</a> to request they change Endpoint.connectionType to CodeableConcept, so we can include our more detailed codes, as it didn't appear there was one specifically for this.</p>",
        "id": 276389887,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1648064872
    },
    {
        "content": "<p>those improvements can be used when R5 gets released and IHE moves to R5.</p>",
        "id": 276391282,
        "sender_full_name": "John Moehrke",
        "timestamp": 1648065550
    }
]