[
    {
        "content": "<p>John, thanks for setting up this IHE on FHIR stream. In our QRPH session re: FHIR, you mentioned that there is a way for those of us who are leveraging FHIR in our profiles to be able to tell what is the maturity of these underlying specifications. The implication is that we somewhat \"inherit\" this maturity (or immaturity) in our profile. Can you point to where we can find out the FHIR profile maturity and do you have a sense of how solid we are with our 5 existing ITI profiles (for example)?</p>\n<p>Also... as a question for the group... should we consider having a \"minimum maturity threshold\" for FHIR assets before we reference them in IHE profiles? Such a practice might help us systemically defend the IHE \"brand\" as credible for broad-scale implementation. MOHs will appreciate our efforts at being their ally in mitigating ecosystem-level implementation risk. Just a thought...</p>",
        "id": 153871594,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1487172807
    },
    {
        "content": "<p>First, the \"Maturity\" of a Resource is indicated on the Resource page, and reflected as a number on the page with all the Resources listed  <a href=\"http://build.fhir.org/resourcelist.html\" target=\"_blank\" title=\"http://build.fhir.org/resourcelist.html\">http://build.fhir.org/resourcelist.html</a></p>",
        "id": 153871603,
        "sender_full_name": "John Moehrke",
        "timestamp": 1487176009
    },
    {
        "content": "<p>Today they are mostly at 0, this is more an indication that the committee owning the resource has not yet voted on their FMM value. All values were reset to 0 at the start of STU3 ballot reconsilliation. The are likely to go higher than they were at DSTU2.  --- You should wait a few more weeks to see what the values are in the final STU3 publication. </p>",
        "id": 153871604,
        "sender_full_name": "John Moehrke",
        "timestamp": 1487176110
    },
    {
        "content": "<p>I personally would never say never with regards to if one should profile a Resource that is at FMM 0. It should be done with eyes wide open; but I would never say never. Sometimes a new Resource is the best standard available. The Profiling process is a process to find the 'best' solution to the problem you are trying to address. The whole reason for \"Trial Implementation\" (and HL7 STU) is to explain what the vision is, and get experience feedback from that vision. Any MOH that doesn't understand \"Trial Implementation\" danger, needs to learn that. We should not change the meaning of the state because they don't understand the state.</p>",
        "id": 153871605,
        "sender_full_name": "John Moehrke",
        "timestamp": 1487176382
    }
]