[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> the status bar that comes out of the IG publisher does not have a \"Workgroup\" like HL7 has. Is this something I didn't configure, or is this something that just doesn't exist in the IHE template?</p>",
        "id": 249903337,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629316462
    },
    {
        "content": "<p>Status bar - footer?</p>",
        "id": 249903532,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1629316570
    },
    {
        "content": "<p>Or do you mean the metainfo header that <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> was going to merge into the template?</p>",
        "id": 249903666,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1629316665
    },
    {
        "content": "<p>and what is the workgroup? in the HL7 IGs i see only one contact, e.g. HL7 FHIR Infrastructure group (which would be the same thing as replacing \"Integrating the Healthcare Enterprise (IHE)\" with \"Integrating the Healthcare Enterprise (IHE) - ITI Committee\"</p>",
        "id": 249904089,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1629316838
    },
    {
        "content": "<p>in HL7 IGs, there is the HL7 Workgroup that owns the IG.. In IHE we have \"domains\" (Pharmacy, PCC, QRPH, ITI, Rad, etc...)</p>",
        "id": 249908640,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629319234
    },
    {
        "content": "<p>I see that most of the time the status bar in HL7 is a combination of \"HL7\" and the workgroup.</p>",
        "id": 249908905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629319382
    },
    {
        "content": "<p>in the footer is a link to the workgroup</p>",
        "id": 249908960,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629319418
    },
    {
        "content": "<p>I lost track of  what is being discussed here, but I presume this is an ex-discussion.<br>\nHL7 has the same template as IHE, in the footer they just put the contact as the working group, not HL7 international.<br>\nThe logos on the top can be added as per the parallel discussion</p>",
        "id": 250050414,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1629407724
    },
    {
        "content": "<p>Yes, I figured that out. and ITI has been doing that for some time.</p>",
        "id": 250110712,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629462386
    }
]