[
    {
        "content": "<p>Assuming we get a LA(M)P / WA(M) stack or equivalent somewhere to publish IHE stuff soon, <br>\nPharmacy and myself will start working on some cool stuff: What we have in our queue:</p>\n<ol>\n<li>Supply (nice and thorough, with Logical Models, Transactions and some profiling)</li>\n<li>Mobile Medication Administration (porting existing doc to FHIR IG, because it's not nice to maintain word docs)</li>\n<li>We may do something on Immunization (a new work item but seems popular and it would be easy)</li>\n<li>Medication Record (aka medication lists aka medication reconciliation aka medication documentation aka \"patients's current/active/relevant/history medications\"</li>\n</ol>\n<p>This is roughly the priority from Pharmacy, can be tuned.<br>\nWe should have some separate discussions on templates / tools (on zulip)</p>",
        "id": 200241444,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591714830
    },
    {
        "content": "<p>any inputs/ideas?</p>",
        "id": 200241462,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591714837
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> it'd be great to connect re: the Immunization idea. Firstly... there is a quite-solid start in the IPS Immunization section... and second... we're gonna wanna track 7.5 billion COVID-19 vaccination transactions in 2021 (we hope!). :-)</p>",
        "id": 210308424,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1600284319
    },
    {
        "content": "<p>I love the International perspective that Immunizations should be easy!  57 Registries in the US, all with differing requirements and laws and regulations impacting them.  God how I wish that was easy.  Although honestly, a minimal set of immunization information that should be available from anyone, and could be the core of what was to anyone SHOULD be easy, and would be VERY valuable for work I'm literally doing today.</p>",
        "id": 210310295,
        "sender_full_name": "Keith Boone",
        "timestamp": 1600285261
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179223-ihe/topic/IHE.20FHIR.20profile.20queue/near/200241444\">said</a>:</p>\n<blockquote>\n<p>Assuming we get a LA(M)P / WA(M) stack or equivalent somewhere to publish IHE stuff soon, <br>\nPharmacy and myself will start working on some cool stuff: What we have in our queue:</p>\n<ol>\n<li>Supply (nice and thorough, with Logical Models, Transactions and some profiling)</li>\n<li>Mobile Medication Administration (porting existing doc to FHIR IG, because it's not nice to maintain word docs)</li>\n<li>We may do something on Immunization (a new work item but seems popular and it would be easy)</li>\n<li>Medication Record (aka medication lists aka medication reconciliation aka medication documentation aka \"patients's current/active/relevant/history medications\"</li>\n</ol>\n<p>This is roughly the priority from Pharmacy, can be tuned.<br>\nWe should have some separate discussions on templates / tools (on zulip)</p>\n</blockquote>\n<p>Done, and you have been given administrative rights to the tool MONTHS ago. What are you waiting for?</p>",
        "id": 210310517,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600285371
    },
    {
        "content": "<p>The IHE domain to work on the Immunization Registry is likely QRPH. So <span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> , this should be a proposal to your domain.</p>",
        "id": 210310683,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600285443
    },
    {
        "content": "<p>all three of you have worked on IHE Implementation Guides using the HL7 tooling... so what more are you all waiting for?</p>",
        "id": 210310855,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600285536
    },
    {
        "content": "<p>I seem to be the only one who has published an IG. <a href=\"http://profiles.ihe.net/fhir/ihe.formatcode.fhir/\">http://profiles.ihe.net/fhir/ihe.formatcode.fhir/</a><br>\nYet, you all have been engaged along the way.</p>",
        "id": 210311006,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600285599
    },
    {
        "content": "<p>as to scope, would it help to start with a very targeted immunization for COVID19? As an Interop spec, it could start with simply a profile of the Immunization, and ignore the deployment issues around registry management, and ignore all the other kinds of immunizations.</p>",
        "id": 210311592,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600285877
    },
    {
        "content": "<p>hence, as <span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> points out, it would be just extracting the Immunization 'profile' from the IPS, and adding a valueSet specific to the variations around COVID19 immunization. right?</p>",
        "id": 210311741,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600285941
    },
    {
        "content": "<p>I'm hoping (and expecting, actually) that the Immunization section in the IPS will suffice as a \"virtual yellow card\" (the WHO's format for an immunization card). The COVID-19 codes have been, as I understand it, added to the open source SNOMED code list (the SNOMED GPS). So... <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> , it might be that the IPS really does (or could) help address the Tower of Babel issue you're describing for Immunization Registries. Here's hoping...</p>",
        "id": 210314996,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1600287502
    },
    {
        "content": "<p>it would still need to be extracted as a standalone Implementation Guide so that conformance could be claimed. Otherwise the IPS document would be required when an immunization registry is all that is needed.</p>",
        "id": 210321589,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600291002
    },
    {
        "content": "<p>and note... QEDm does provide already query access to Immunizations. So, first question is if that is sufficiently defined? I would guess that it is not sufficiently profiled, especially not for COVID19</p>",
        "id": 210322140,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600291349
    },
    {
        "content": "<p>so... I must admit that I've thought for a long time now that an \"immunization registry\" or a \"cancer registry\" or a \"diabetes registry\" is really just an articulated query against a patient-centric, longitudinal EHR. tbh... i'd rather have the EHR. thinking of it that way, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , i don't feel awful that \"an IPS document would be required when an immunization registry is all that is needed\"...  a repository of IPS content seems like the more useful thing to work towards... (just sayin'... <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span> )</p>",
        "id": 210324810,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1600293024
    },
    {
        "content": "<p>in that case, then your vision is already satisfied by QEDm</p>",
        "id": 210325330,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600293444
    },
    {
        "content": "<p>but I suspect that others (I think USA) are thinking that an Immunization Registry is a mostly centeralized service run by the public health; where new immunizations are sent, so that there is a comprehensive list of each patient immunizations. I think in the USA there is interest in building this at the COVID19 level to keep track (public health) of the compliance of the population regionally..... this said, I am not an authority. Just guessing based on tweets</p>",
        "id": 210325498,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600293569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> would know more, as they manage many of these registries.. I think</p>",
        "id": 210325530,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600293597
    },
    {
        "content": "<p>as to the idea of just using the IPS... this exposes a large variety of sensitive information, when all that is needed by many use-cases for immunizations need only see the immunization (immunization station checking that you have not already received the COVID19 immunization)</p>",
        "id": 210326009,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600293849
    },
    {
        "content": "<p>No, we don't \"manage\" registries, that'd be like herding 64 cats.  We're managing a project that builds a router that will get you to any one of them.</p>",
        "id": 210349110,
        "sender_full_name": "Keith Boone",
        "timestamp": 1600319706
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> good to hear.. but can you enlighten us on the more important parts of the thread?</p>",
        "id": 210377156,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600342964
    },
    {
        "content": "<p>could this all be switched to a QEDm query by public health of clinical data available from EHR, or thru medical summaries available from a nationwide document exchange?   Technically, workable; but seems a huge change, and huge changes don't happen.</p>",
        "id": 210377427,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600343175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , it is true that huge changes don't (easily) happen. In countries where there is <strong>not</strong> a large and entrenched infrastructure of legacy systems, the idea of a simplified IPS-exchange may well represent a \"leapfrog\" opportunity. A proliferation of hard-walled health data silos... each focused on its own subset of a person's health history... is expensive, unmanageable, and an impediment to providing person-centric (as opposed to disease-centric) primary care. A longitudinal repository with one EHR per person is to be preferred. [And note... if an immunization registry doesn't know anything else about you... how will it know that your vaccination schedule needs to take account of your HIV medicines? IMHO, we need to <strong>always</strong> be caring for the <strong>whole person</strong>...] :-)</p>",
        "id": 210439264,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1600371099
    },
    {
        "content": "<p>My work is US focused, I don't see the present mechanisms of interchange of immunization data being altered all that much.</p>",
        "id": 210771269,
        "sender_full_name": "Keith Boone",
        "timestamp": 1600708349
    }
]