[
    {
        "content": "<p>The ITI workgroup:</p>\n<ul>\n<li>Patient Identity Management using FHIR -- We got started on this, mostly agreeing to the usecases, scope, and actors. This is targeting supporting a regional or national level patient identity management system, and will be tied to XDS Registry to keep the registry up-to-date, so that XDS Consumers get accurate results when querying for a patient.</li>\n<li>Updating mCSD -- We are about ready to send this out for Public Comment, look for it in a month. This is an effort to add support for \"Facilities\" and clarify how they are different than \"Locations\". The work-item is aimed also to define how to create multiple hierarchies between facilities. </li>\n<li>XCA Deferred Query -- We progressed to almost a complete specification, however this will likely not be approved for Public Comment until our next face-to-face. This work item intends to support use-cases where an XCA Responding Community will take longer to respond to query and response than is allowed by Asynchronous Web-Services. Use-case such as when a human must get involved with the response to evaluate patient privacy consent authorization, or where paper documents would need to be scanned and indexed. These longer response times would be supported through a Deferred query mechanism similar to what is in XCPD.</li>\n<li>FHIR R4 priority 1 group - finishing the update to FHIR R4 for the group of IHE Profiles using FHIR that is considered a Priority for ONC: MHD, PDQm, QEDm, mCSD, and Appendix Z. we resolved public comment in addition to all outstanding CP. Compliance files (structureDefinition, capabilityStatement, etc) have not yet been converted to R4, this will be done in the coming months when Forge can be used.</li>\n<li>Added new work item to create a FHIR based ATNA feed, and update the ATNA Query to FHIR R4.<br>\nmore detail at <br>\n<a href=\"https://healthcaresecprivacy.blogspot.com/2019/02/ihe-iti-winter-2019.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2019/02/ihe-iti-winter-2019.html\">https://healthcaresecprivacy.blogspot.com/2019/02/ihe-iti-winter-2019.html</a></li>\n</ul>",
        "id": 159914488,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551707316
    },
    {
        "content": "<p>IHE Publishes a set of profiles using FHIR R4 <a href=\"https://healthcaresecprivacy.blogspot.com/2019/03/ihe-produces-profiles-using-fhir-r4-for.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2019/03/ihe-produces-profiles-using-fhir-r4-for.html\">https://healthcaresecprivacy.blogspot.com/2019/03/ihe-produces-profiles-using-fhir-r4-for.html</a></p>",
        "id": 160722157,
        "sender_full_name": "John Moehrke",
        "timestamp": 1552507114
    }
]