[
    {
        "content": "<p>Notice of a mHealth Plugfest being held at the EU IHE Connectathon  <a href=\"http://connectathon.ihe-europe.net/mhealth-plug-thon-announced\" target=\"_blank\" title=\"http://connectathon.ihe-europe.net/mhealth-plug-thon-announced\">http://connectathon.ihe-europe.net/mhealth-plug-thon-announced</a></p>",
        "id": 153877070,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489611175
    },
    {
        "content": "<p>Hi,<br>\nduring this years IHE Europe CAT in Venice there was some time to reflect on the experiences of the participants concerning the testing of the FHIR related profiles. Some of the key results of this discussion were:<br>\n- that it might be a good idea to combine the profiles PIXm and PDQm into one profile<br>\n- to make a differentiation within the MHD profile if MHD is used with a XDS environment in the back or without<br>\n<span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>, <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span>, <span class=\"user-mention\" data-user-id=\"192145\">@Patrick Mangesius</span> feel free to add further points, since you had a much deeper look into the matter.<br>\nIt will be interesting to see how IHE is going to proceed here in detail.<br>\nAnd most of the implementers are of course curious about the upcoming switch of the IHE FHIR profiles to STU3 :)</p>",
        "id": 153884701,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1492098262
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191890\">@Reinhard Egelkraut</span>, you wrote:</p>\n<blockquote>\n<p>It will be interesting to see how IHE is going to proceed here in detail</p>\n</blockquote>\n<p>The direction of the IHE here is based on the feedback and involvement of the community.<br>\nI think you're asking for a named option to identify the MHD backend. Can you expand on what the benefit would be? As discussed at the Connectathon, IHE ITI is looking at updates to the their profiles, and such additional information informs our decisions.</p>",
        "id": 153884726,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1492113315
    },
    {
        "content": "<p>There is lots of work to be done regarding IHE and FHIR, as I see it, ie:<br>\n1) Upgrading to STU3<br>\n2) Create FHIR conformance profiles so that conformance can easier be machine-verified<br>\n3) Revisit current profiles - especially PIXm and MHD and apply inputs from CAT</p>",
        "id": 153884815,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1492206499
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>. All three of those are in progress or being evaluated. I know we have feedback from EU CAT which we have started to go over.. With respect to PIXm, I don't know what particular feedback you have in mind, but it addresses confidentiallity concerns that PDQm and the current FHIR MPI operations don't, so we can't merge it into PDQm.</p>",
        "id": 153884867,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1492320118
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> - PIXm over PDQm could be done with an extension to PDQm so that the returned Patient Resource only included identifiers. You would then gain the feature of not having to maintain to separate interfaces and PDQm could be considered an extension of PIXm which it is in FHIR terms. Keeping these features separate in FHIR does not make sense.</p>",
        "id": 153884870,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1492344953
    },
    {
        "content": "<p>Actually - it could be spec'ed (conformance profiled) as two different Patient Resources where the PDQm could extend the PIXm. Each hosted on different Endpoints. Regardless - both should use the Patient Resource already which is not the case today</p>",
        "id": 153884874,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1492367567
    },
    {
        "content": "<p>that would need to be brought in as a new work item next year. That is too radical of a change for a CP. It would be a good second \"Trial Implementation\", to see which one gets more implementation.</p>",
        "id": 153884903,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492429566
    },
    {
        "content": "<p>Agree that it is probably too signfiicant a change for a CP, but that doesn't mean we shouldn't investigate. I think keeping PIXm and PDQm as separate profiles has value as the use cases are distinct; but that doesn't mean that the solutions couldn't be made closer. Our work so far hasn't uncovered a more complementary solution, so, Jens, I'd be interested in seeing details if you have something in mind for what this looks like.</p>",
        "id": 153884920,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1492446410
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> The main topic here was not to identify the different backends. It was more respecting there different requirements. An example would be a for submitting documents there are systems that can work with a rather small amount of Metadata. However to register a document in an XDS environment there is a larger list of required fields, that other systems might not need. Currently the only option for an implementer who wants to achieve this mapping is either extend the parameters or work with a large set of default values, which is often not possible or not really practicable in a non-demo setting. Therefore it was discussed, that one option would be to have a separate profile or version, that clearly outlines the XDS binding. Having a layer of Fhir, MHD and MHD XDS that put more and more requirements the higher you are getting in the stack</p>",
        "id": 153885281,
        "sender_full_name": "Patrick Mangesius",
        "timestamp": 1492700865
    },
    {
        "content": "<p>The intention I had for MHD is that the MHD profile itself would impose very few constraints; yet when MHD servers are grouped with appropriate XDS actors that the constraints of XDS can cause warning/error responses by the MHD server back to the MHD client. The advantage of this is that MHD can then be used in a non-XDS environment without modification of the MHD profile. The additional advantage is that XDS can change the XDS constraints and they magically appear in MHD indirectly. ---- The question I have is, given that warning/response (including FHIR operationOutcome) is supported, what is a substantive problem with this model??? I understand some failuremodes, but they are detectable and can be managed.</p>",
        "id": 153885286,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492704259
    },
    {
        "content": "<p>The only problem is that this intention is not clearly expressed... Vol 1 has some intentional phrases like \"The proxy might be expected to fill in any necessary missing metadata information\", but this is very vague. Vol 2 and Vol 3 (like in Table 5.4.1.1-1) do not use any constructs like e.g. a \"XDS-Grouping/Backend option\" to enforce this intention: e.g. define what should happen is content required for XDS is not provided to the proxy layer etc.</p>",
        "id": 153885689,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1493017260
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191607\">@Christian Ohr</span> can you explain what you want to assure doesn't happen? Knowing this will help me set the requirements more actionable. Is it a case that MHD server side are not passing through all the XDS information? Is it clients are not providing all the XDS information and the server doesn't know what to do about it? Is it something else?</p>",
        "id": 153885732,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493041633
    },
    {
        "content": "<p>I want to avoid situations where both integration partners follow the transaction specification but are nevertheless unable to integrate properly.<br>\nWhen grouping the Document Recipient and Document Source actors like advertised in MHD 33.6.1, you obviously need to translate between FHIR and XDS and vice versa. However, there is a number of attributes that are mandatory in XDS (Table 4.3.1-3) but optional in FHIR. This is a potential problem for ITI-65. <br>\nFor some attributes you can use default values (DocumentEntry confidentialityCode) or generate values (uniqueId, submissionTime), but for others this is at least difficult (DocumentEntry: practiceSettingCode, facilityTypeCode, classCode; SubmissionSet: contentTypeCode, sourceId; Folder: title, codeList). This makes it hard for MHD/XDS proxies to integrate out-of-the box with Document Sources that are not able to (or willing to) provide values for these attributes.<br>\nAt the CAT we therefore briefly discussed adding a \"XDS grouping\" option to ITI-65 for both Document Source and Document Recipient that makes these attributes mandatory in the respective FHIR resources.</p>",
        "id": 153885753,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1493048747
    },
    {
        "content": "<p>okay, so I could see how adding an Option to the MHD DocumentRecipient to indicate that it will require the higher requires of XDS. But, even if this option existed, it must still have the ability to handle a Document Source that fails to provide all the elements desired. This is today allowed by a DocumentRecipient, to throw an error that it wants more elements than were provided.   </p>",
        "id": 153885757,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493052289
    },
    {
        "content": "<p>Note: MHD does require the DocumentRecipient to validate against the XDS/XCA/XDR requirements...</p>",
        "id": 153885758,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493052323
    },
    {
        "content": "<p>\"The Document Recipient shall also verify the FHIR resource elements for consistency with the Document Sharing metadata requirements as specified for attributes ITI TF-3: Table 4.3.1.1-3. If necessary for processing, the Document Recipient shall retrieve Resources referenced by absolute URLs in the FHIR Bundle Resource.\"</p>",
        "id": 153885759,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493052332
    },
    {
        "content": "<p>With such an option It would be just much clearer that the document recipient actually expects XDS conformance and that it would return a 4xx + OperationOutcome for any violation. The note you added actually implies this, but then again it clearly contradicts with the FHIR cardinalities explicitly listed in Table 5.4.1.1-1.</p>",
        "id": 153885880,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1493103851
    },
    {
        "content": "<p>I put the option in last night. Please feel free to review and comment to me. IHE ITI upates to STU3 can be found at ftp://ftp.ihe.net/IT_Infrastructure/iheitiyr15-2017-2018/Technical_Cmte/Workitems/STU3updates/</p>",
        "id": 153885933,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493129664
    },
    {
        "content": "<p>Great, this makes things much clearer. Though I didn't quite get the need of having two options; both are targeted as bridging FHIR to XDS</p>",
        "id": 153886090,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1493188001
    },
    {
        "content": "<p>Regarding PIXm: what <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>  had in mind was that the following queries are equivalent:<br>\nPDQm: /Patient?identifier=urn:oid:1.2.3|4711&amp;identifier=urn:oid:1.2.4|&amp;_elements=identifier<br>\nPIXm: /Patient/$ihe-pix?sourceIdentifier=urn:oid:1.2.3|4711&amp;targetSystem=urn:oid:1.2.4<br>\nI wonder if the scope of PDQm could just be made broader so that it also covers the use cases of PIXm, making PIXm eventually obsolete.</p>\n<p>If we keep PIXm for a while, we should look at error case 3: it requires a 404 response together with a Parameters resource. Usually, error responses in FHIR may only contain OperationOutcome.</p>",
        "id": 153886094,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1493189046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191607\">@Christian Ohr</span>  - or as an alternative, profile a PIXmPatient that only contains identifiers and extend that profile for PDQm as PDQmPatient with the extra attributes contained in PDQm having them hosted on separate endpoints to ease discretion/security</p>",
        "id": 153886097,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1493190198
    },
    {
        "content": "<p>Dunno... PDQm requires mostly a standard Patient resource, so that a patient returned by PIXm' would rather be a restriction thereof, setting the cardinalities of all attributes but identifier to 0..0. I'm not very familiar with FHIR profiling, though.</p>",
        "id": 153886098,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1493191001
    },
    {
        "content": "<p>Right ... constraints only goes one way so extending a PIXm might not be the way to go. So what about two different Patient profiles instead?</p>",
        "id": 153886101,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1493193289
    },
    {
        "content": "<p>You guys seem to just want PDQm... it already can be used to get cross-references. It allows query by ID, or query by demographics, or both... The results you get are based on the server knowledge of the patients, and might be Patient resources with multiple identifiers; or might e multiple Patient that are different identifiers but are related because they were 'linked'. So all that you want to change PIXm into; is already availble in PDQm. Just ignore PIXm.</p>",
        "id": 153886130,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493208504
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153886411,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1493371329
    }
]