[
    {
        "content": "<p>ITI domain has 5 profiles. Each of them are on DST2, and will simply be updated to STU3 in the coming month (MHD, PDQm, ATNA, PIXm, and mACM). There is some question of if mACM use of CommunicationRequest is still the right solution. There is some question if PIXm should evaluate and use te Patient MPI mechanism. Please provide constructive/critical comment</p>",
        "id": 153871084,
        "sender_full_name": "John Moehrke",
        "timestamp": 1486800466
    },
    {
        "content": "<p>hello, I am not sure how to use the MHD profile, or, in other words, whether it is correct what we have currently defined. The profile tells me, that XDS.documentEntry.creationTime should be mapped to MHD.documentReference.indexed and that MHD.documentReference.created should not be used. According to my understanding I would have expected that XDS.documentEntry.creationTime  is mapped to MHD.documentReference.created because this is the information about the creation of the document. MHD.documentReference.indexed is the information when the DocumentReference Resource instance has been created. Where am I wrong? thx regards Frank</p>",
        "id": 153873132,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1487854758
    },
    {
        "content": "<p>Hi Frank, You are not wrong, and this is why both are in trial state; as we need feedback. It does seem that XDS.documentEntry.creationTime is assigned to the wrong FHIR element. It should be DocumentReference.created. I note that the mapping on the FHIR DocumentReference is also incorrect.  I think I can fix FHIR under Quality fixes this week. MHD needs a CP, which we will fix this summer when we align with STU3.</p>",
        "id": 153873144,
        "sender_full_name": "John Moehrke",
        "timestamp": 1487864024
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12892\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12892\">GF#12892</a></p>",
        "id": 153873148,
        "sender_full_name": "John Moehrke",
        "timestamp": 1487864584
    },
    {
        "content": "<p>ok, good, so, using the right entries would be in favor of this correction then, right?</p>",
        "id": 153873153,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1487866591
    },
    {
        "content": "<p>corrections are always welcome. Thanks</p>",
        "id": 153873154,
        "sender_full_name": "John Moehrke",
        "timestamp": 1487866722
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Reading the text @ <a href=\"https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)\">https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)</a> it sounds like MHD is primarily for resource constrained devices - because of the use of FHIR. I disagree. The use of FHIR makes a lot of things more simple and the typical frameworks that are used in interaction with FHIR are more lightweight - but FHIR is suited just as much on the backend of large enterprise systems</p>",
        "id": 153989440,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534750235
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>  reading a summary wiki page is not like reading the full specification. Summary specifications tend to be less complete. We explain this more fully in the formal specification.</p>",
        "id": 153989528,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534768530
    },
    {
        "content": "<p>I agree.</p>",
        "id": 153989556,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534777146
    },
    {
        "content": "<p>But does that justify the content?</p>",
        "id": 153989557,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534777162
    },
    {
        "content": "<p>IHE already has defined general mechanisms for sharing documents: XDS and XCA. In general, non-constrained devices are capable of using those mechanisms. On the other hand, more constrained devices are unable to use those mechanisms, or the overhead required to use them is obviously a non-starter on a constrained device. Thus, MHD expands IHE's solution space into an area previously not addressed: constrained devices. <br>\nDoes that mean that non-constrained devices won't see benefits using MHD? No, they might, but the benefit is less clear cut, and they were supported with the previous mechanisms, so it is less important to emphasize this capability.</p>",
        "id": 153989584,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1534787040
    },
    {
        "content": "<p>I guess that depends on how you 'measure' the benefit - avoiding memory hungry SOAP serializers is beneficial on all platforms - big as small, as well as saving CPU cycles traversing (overly) complex structures (especially) when running (FaaS) in the cloud.</p>",
        "id": 153989586,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534788936
    },
    {
        "content": "<p>Let me quote <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>    <br>\n\"Does that mean that non-constrained devices won't see benefits using MHD? No, they might, but the benefit is less clear cut, and they were supported with the previous mechanisms, so it is less important to emphasize this capability.\"</p>",
        "id": 153989587,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534789002
    },
    {
        "content": "<p>so... there is no statement that MHD is not helpful to everyone... just that it is more helpful to those that are constrained... You seem to be wanting to read this fact as an inverse fact.</p>",
        "id": 153989588,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534789076
    },
    {
        "content": "<p>My point is that it is helpful to everyone</p>",
        "id": 153989589,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534789150
    },
    {
        "content": "<p>In practice there are organizations that are fully capable of using the classic SOAP, but are choosing to implement MHD... One example that went public lately is CommonWell and new partners.</p>",
        "id": 153989590,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534789152
    },
    {
        "content": "<p>It is not helpful to those that have already implemented XCPD/XCA, or those that have a SOAP toolkit and no REST toolkit.</p>",
        "id": 153989591,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534789216
    },
    {
        "content": "<p>depends on how their CPU cycles are billed</p>",
        "id": 153989592,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534789270
    },
    {
        "content": "<p>not really... you are grasping</p>",
        "id": 153989593,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534789292
    },
    {
        "content": "<p>I have no problem clarifing this.. .but I am not about to tell hundreds of working organizations that they must throw away the investment... all for a few cpu cycles?</p>",
        "id": 153989594,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534789341
    },
    {
        "content": "<p>they shouldn't throw it away if it works for them</p>",
        "id": 153989595,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534789363
    },
    {
        "content": "<p>so then, do you have a recommendation for how this can be said better?</p>",
        "id": 153989596,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534789484
    },
    {
        "content": "<p>that (FHIR) is usually less resource demanding than SOAP because of the more intensive wrapping?</p>",
        "id": 153989597,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534789728
    },
    {
        "content": "<p>Is that a statement of fact, or a question?</p>",
        "id": 153989598,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534789768
    },
    {
        "content": "<p>touché - ... that would be my not-so-scientific presumption</p>",
        "id": 153989599,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534789924
    },
    {
        "content": "<p>which I guess is something you agree on since the text says its a good fit for constrained devices or what?</p>",
        "id": 153989602,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534790524
    },
    {
        "content": "<p>The availability of RESTful toolkits is indeed far easier on constrained environments. Tying to get a SOAP stack onto an iPHone or Android is possible, but hard.  I don't think that is a question, and is indeed the message... That does not mean the opposite is false, there is no meaning on the opposite.</p>",
        "id": 153989603,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534790707
    },
    {
        "content": "<p>im just saying its beneficial to all platforms and because of that I wouldn't highlight one platform over another as it is beneficial to both</p>",
        "id": 153989604,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534791051
    },
    {
        "content": "<p>I would highlight that one stack is more lightweight than the other</p>",
        "id": 153989605,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534791111
    },
    {
        "content": "<p>that is my postulate</p>",
        "id": 153989606,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534791165
    },
    {
        "content": "<p>the word 'lightweight', or 'beneficial', or 'best', are all subjective.</p>",
        "id": 153989607,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534791179
    },
    {
        "content": "<p>subjective is a fine thing to be in marketing material, not useful in a standard.</p>",
        "id": 153989608,
        "sender_full_name": "John Moehrke",
        "timestamp": 1534791202
    },
    {
        "content": "<p>im not selling anything - and I agree. But I can imagine that MHD is less byte-verbose on the wire than XDS and maybe as a consequence serialization frameworks are less mem hungry. I would call that lightweight (being objective about it) without feeling that I had to sell anything.</p>",
        "id": 153989619,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1534795897
    },
    {
        "content": "<p>IMO the major advantage of MHD over XDS lies not so much in the comparison of the two profiles alone.<br>\nIf you chose to implement MHD, you can also implement all the related Profiles (PIX/PDQ/ATNA) using one - and only one - technology stack. You don't have that option with XDS. I think that that is a point that could be more emphasized because it's definitely relevant to implementers, regardless of their platform and it's probably something that isn't obvious to people who are new to the specification.</p>",
        "id": 153990372,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1535013588
    },
    {
        "content": "<p>Yes <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> that is a point that I have made. This is very important for the Source or Consumer actors. Which is why these profiles are first being introduced as API to existing systems. This API consistency enables new apps. When viewed this way one is not \"throwing the baby out with the bath water\". One gets the benefit for Apps, while not invalidating the investment already in the infrastructure.</p>",
        "id": 153990389,
        "sender_full_name": "John Moehrke",
        "timestamp": 1535026660
    }
]