[
    {
        "content": "<p>hey <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>   I was talking with <span class=\"user-mention\" data-user-id=\"193291\">@Bob Jolliffe</span> about mADX and Measures for routine reporting use cases.   While we can try and infer a periodicity from the start date and end date of the report, it would be very useful to have the option to do start date and duration (e.g. 1 week or 1 month).  The duration is much more closely turned to periodicity.   (adding in <span class=\"user-mention\" data-user-id=\"192545\">@Alex Goel</span>  for visibility).    In other standards (e.g. SDMX on which ADX is based) they have both the (Start date,end date) and (start date, duration) options based on ISO 8601 durations <a href=\"https://en.wikipedia.org/wiki/ISO_8601#Durations\">https://en.wikipedia.org/wiki/ISO_8601#Durations</a></p>",
        "id": 199488251,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1591103368
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193291\">@Bob Jolliffe</span>  do you want to provide more background?</p>",
        "id": 199488464,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1591103461
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span> , in the Quality Measure IG, we define <a href=\"http://build.fhir.org/ig/HL7/cqf-measures/StructureDefinition-cqfm-effectivePeriodAnchor.html\">effectivePeriodAnchor</a> and <a href=\"http://build.fhir.org/ig/HL7/cqf-measures/StructureDefinition-cqfm-effectivePeriodDuration.html\">effectivePeriodDuration</a> extensions for exactly this purpose. Measure can specify effectivePeriod with either a start/end date, or an anchor and duration.</p>",
        "id": 199493831,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591105993
    },
    {
        "content": "<p>OK thanks <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> -  one potential issue here is that this seems to be US realm.   Can we move this into something non-US specific or maybe add it as a core element in the Measure resource?   One other potential issue - we often have the same measure/indicator that needs to be collected at different periodicities depending on the reporting agency.  in your view, would these be different measures (as seems to be implied in the extension) or the same measure (with the reporting period more closely attached to the measurereport) or would you start with a measure and create a dependent measure specifying the duration?</p>\n<p>Ignoring the realm issues,  <span class=\"user-mention\" data-user-id=\"193291\">@Bob Jolliffe</span>  will this address your concerns?</p>",
        "id": 199530106,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1591120944
    }
]