[
    {
        "content": "<p>Hello, I'm trying to use the <a href=\"https://build.fhir.org/ig/IHE/ITI.MHD/IHE.MHD.Provide.Comprehensive.DocumentReference.html\">https://build.fhir.org/ig/IHE/ITI.MHD/IHE.MHD.Provide.Comprehensive.DocumentReference.html</a> profile in context of a german telematic infrastructure (TI) project. It fit's quite well because parts of the TI specification are referring to XDS.b<br>\nOne thing troubles me at the moment, is that DocumentReference.content.attachment.data is not allowed in this profile.<br>\nWhile this isn't an issue when retrieving documents, it would might be easier to provide a document as base64 encoded data instead of only linking it.<br>\nOur use case is the following:</p>\n<ol>\n<li>We download a document from an external repository and creating it on the FHIR server with a PUT request containing also the document data (base64 encoded)</li>\n<li>While storing the data the FHIR server takes the inline data and stores it in separate place (file system,...) other than the FHIR meta data.</li>\n<li>When a client is requesting the document later on, now the FHIR server provides only the url to the document in the DocumentReference resource.</li>\n</ol>\n<p>Is there a reason whyDocumentReference.content.attachment.data is not allowed?</p>",
        "id": 208199712,
        "sender_full_name": "Wolfgang Kronseder",
        "timestamp": 1598524342
    },
    {
        "content": "<p>When providing a document you can embed it in the bundle as a Binary Resource (MHD line 683: When the DocumentReference.content.attachment.url points at a Binary Resource, the<br>\n Binary Resource shall be in the Bundle). This does not answer your question directly why it is now allowed though, I think it is for consistency reason that you always can expect the reference to the doc in attachment.url as ITI-67 Find Document Reference is requesting.</p>",
        "id": 208201711,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1598525831
    },
    {
        "content": "<p>Thanks for the hint! <br>\nI missed that part in the specs and I also didn't thought of solving it this way.<br>\nYou might not directly answer my question, but you helped me a lot. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 208203864,
        "sender_full_name": "Wolfgang Kronseder",
        "timestamp": 1598527459
    }
]