[
    {
        "content": "<p>Can anyone tell me more about the rationale of constraining  DocumentReference.context.encounter in MHD to 0..0 ?<br>\nWe have the situation that in an internal document exchange scenario between systems within a hospital (at least in Germany), the encounter context is pretty important both for querying as well as during the document provide interaction. So if we were do define profiles for this scenario we'd be incompatible with MHD due to this restriction.</p>",
        "id": 253222006,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631611633
    },
    {
        "content": "<p>it is defined this way because there is not place for that data in the Document Sharing metadata model. So although it would work in an MHDS environment, it would not work where XDS or XCA or XDR or XDM are used somewhere in the path.</p>",
        "id": 253246349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631624694
    },
    {
        "content": "<p>at one point we were thinking of using the Document Sharing metadata element ReferenceIdList, however current model just has .related mapped to this.</p>",
        "id": 253246805,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631624878
    },
    {
        "content": "<p>I think it would be useful to have you explain the use-case in an issue that could drive change.</p>",
        "id": 253246886,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631624901
    },
    {
        "content": "<p>I understand that it's not relevant/needed in MHD/XDS context, but I would assume that in most internal scenarios, e.g. where FHIR replaces HL7 V2 MDM communication, the provision of encounter information will be mandatory. <br>\nThe question this raises is: should these internally used DocumentReferences be reuseable - as is - for MHD  or do vendors in fact need to actively remove the encounter reference?<br>\nIs the fact that the information would be dropped when mapping to XDS enough reason to completely rule out the element? In my interpretation of cardinalities, I would assume that the encounter reference should  simply lack the mustSupport flag to indicate that it won't be processed within the MDH scope.</p>\n<p>We are currently specifying such an internal document exchange and aim to harmonize with MHD as much as possible. However with the encounter reference we'd be forced to break compatibility.</p>",
        "id": 253268926,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631632544
    },
    {
        "content": "<p>yes, that is exactly what I would like to see explained in a github issue on MHD. <a href=\"https://github.com/IHE/ITI.MHD/issues\">https://github.com/IHE/ITI.MHD/issues</a><br>\nLet me know what your github id is so that I can add you to the team.</p>",
        "id": 253269410,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631632699
    },
    {
        "content": "<p>note that I do have many mentions in the specification that recipients should be robust to all elements. Thus recipients should not have a problem with an .encounter; they might not know what to do with it, but they should not be throwing an error.</p>",
        "id": 253269840,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631632874
    },
    {
        "content": "<p>I do wish there was a \"not recommended\" equivalent negative flag to \"must support\". I did enter a FHIR CR asking for that. This would be a flag used to discourage without forbidding, like 0..0 does.</p>",
        "id": 253269847,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631632876
    },
    {
        "content": "<p>that said.. I think a use-case could justify that both .encounter and .related could be mapped into DocumentEntry.referenceIdList... leaving XDS-&gt;FHIR mapping up to creative implementations to figure out which identifiers are which kind.</p>",
        "id": 253270149,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631632963
    },
    {
        "content": "<p>hence, why I want an issue to drive IHE discussino.</p>",
        "id": 253270197,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631632980
    },
    {
        "content": "<p>This is me on GitHub: <a href=\"https://github.com/simoneOnFhir\">https://github.com/simoneOnFhir</a></p>",
        "id": 253271299,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631633438
    },
    {
        "content": "<p>I'll file the issue as soon as I have access</p>",
        "id": 253271358,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631633463
    },
    {
        "content": "<blockquote>\n<p>it is defined this way because there is not place for that data in the Document Sharing metadata model. </p>\n</blockquote>\n<p>Doesn't ReferenceIdList provide this in the metadata?</p>",
        "id": 253285671,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1631638943
    },
    {
        "content": "<p>Vassil, yes it could be that way. it was mostly an oversite due to no one mentioning it.</p>",
        "id": 253288056,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631639817
    },
    {
        "content": "<p>Issue added: <a href=\"https://github.com/IHE/ITI.MHD/issues/88\">https://github.com/IHE/ITI.MHD/issues/88</a></p>",
        "id": 253406189,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631709624
    },
    {
        "content": "<p>tbh the way the IG publisher renders the profile, it's very hard to actually see the constraint, unless you're explicitly looking for the context.encounter element and wondering where it went.<br>\nSimplifier would render that as a striked (stoke? strikken?) out element, making this more obvious.<br>\nI only noticed it, when I looked at the FSH code <span aria-label=\"nerd\" class=\"emoji emoji-1f913\" role=\"img\" title=\"nerd\">:nerd:</span></p>",
        "id": 253406478,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631709798
    },
    {
        "content": "<p>agreed. I am liking the FSH format for being blunt.</p>",
        "id": 253450656,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631725375
    },
    {
        "content": "<p>thanks for creating these issues.</p>",
        "id": 253450734,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631725407
    },
    {
        "content": "<p>what's hard to see?</p>",
        "id": 253685037,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631850244
    },
    {
        "content": "<p>DocumentReference.context.encounter beeing set to 0..0 <br>\nThe element is simply missing from the differential, so you can't see the constraint.</p>",
        "id": 253700234,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631862650
    },
    {
        "content": "<p>where is it missing from the differential? it certainly shouldn't be</p>",
        "id": 253700374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631862747
    },
    {
        "content": "<p>Ah sorry, it <strong>is</strong> struck out in the differential. It's the snapshot where you can't see it.</p>",
        "id": 253700405,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631862772
    },
    {
        "content": "<p>ahh ok. well, you can take that up on <a class=\"stream\" data-stream-id=\"196008\" href=\"/#narrow/stream/196008-ig-publishing-requirements\">#ig publishing requirements</a> but that's been debated before</p>",
        "id": 253700433,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631862793
    }
]