[
    {
        "content": "<p>IHE Mobile Access to Health Documents (MHD) - Implementation Guide<br>\nPublic Comment now open until May 2.  - The main purpose of this release is to author and publish the MHD Profile using the Implementation Guide Publisher format. There are breaking changes, so this is a new version.  (Significant changes since MHD Version 3.2 - <a href=\"https://healthcaresecprivacy.blogspot.com/2021/04/ihe-mobile-access-to-health-documents.html\">https://healthcaresecprivacy.blogspot.com/2021/04/ihe-mobile-access-to-health-documents.html</a></p>",
        "id": 233005247,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617455213
    },
    {
        "content": "<p>reminder of this public comment open until May 2.</p>",
        "id": 234374733,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618337484
    },
    {
        "content": "<p>Just noticed the announcement yesterday and was quite surprised by the move to switch from DocumentManifest to List. Your <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  main rationale to do that was the maturity level. Aren't there means to stick to the DocumentManifest and push the work in the HL7 WG?</p>",
        "id": 234690705,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1618498555
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197429\">@Axel Biernat</span> I have asked the IHE community for input on this for almost a full year. No one was against the move to List. List supports the workflow, as can be seen in the current MHD IG. IHE could have been the sole pusher for maturity of DocumentManifest, but there would have been no advantage to doing that.</p>",
        "id": 234723207,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618509210
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> sorry but I missed your call for input. The Document Submission Set can be implemented either way. So I can also see feasibility we the breaking change. My concerns are coming from an implenters perspective. As the new version 4.0 on the horizon, I won’t start on the current version. As use of DocumentManifest is discontinued we won‘t see any implementation which can help to grow maturity of the resource. So very likely the DocumentManifest resource is loosing even more attention.</p>\n<p>So does make sense to implement MHD before version 4.0 is released?</p>",
        "id": 234727654,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1618510987
    },
    {
        "content": "<p>MHD version 4.0 is in public-comment right now. Public comment resolution and publication will likely be the end of May.</p>",
        "id": 234842700,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618575572
    },
    {
        "content": "<p>Working with DocumentManifest today is not much different than the List resource profile.</p>",
        "id": 234842865,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618575647
    },
    {
        "content": "<p>This is not the only breaking change in 4.0; it is just the most visible. Breaking changes will happen in pre-normative specifications.</p>",
        "id": 234842973,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618575695
    },
    {
        "content": "<p>Reminder IHE-MHD is out for public comment, due May 4th..... May 'the' 4th... be with you</p>",
        "id": 236531817,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619625072
    }
]