[
    {
        "content": "<p>I just saw the recent commit and I have a question:<br>\nIf we say that <code>The Patient Demographics Supplier shall support both GET and POST based searches</code>,<br>\nI think that means that in a country or project that has decided, for whatever reason, that they can only do POST search, that will render their supplier irrevocably non-compliant with PDQm, right?</p>",
        "id": 258375884,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634739472
    },
    {
        "content": "<p>Right?</p>",
        "id": 258388625,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634743892
    },
    {
        "content": "<p>nope, they can have a regional specification that constrains that.</p>",
        "id": 258437528,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634761284
    },
    {
        "content": "<p>in my opinion... aka, my intent is that regions and organizations can further refine....</p>",
        "id": 258437651,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634761327
    },
    {
        "content": "<p>different than FHIR core that forbids POST from being eliminated.</p>",
        "id": 258437686,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634761340
    },
    {
        "content": "<p>We recently resolved issue <a href=\"http://jira.hl7.org/browse/FHIR-31943\">FHIR-31943</a>  providing a requirement for \"support\" but offering servers significant leeway to respond with <code>405</code>  without processing a request</p>",
        "id": 258447853,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634765512
    },
    {
        "content": "<p>This was... a contentious issue, and may come back up in ballot</p>",
        "id": 258447957,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634765544
    },
    {
        "content": "<p>I had a request for inperson, I was not there... I was told that was not allowed.</p>",
        "id": 258451236,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634767234
    },
    {
        "content": "<p>but, I don't think I am against the end result. I have tried to keep up with it.</p>",
        "id": 258451294,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634767267
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  -- yeah, we chipped away at this over several weeks of FHIR-I calls and updated the tracker with comments throughout (and I read and incorporated your feedback as well as I could, so I'm glad and not surprised to hear that you're _probably_ OK with the end result.)</p>",
        "id": 258451901,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634767585
    },
    {
        "content": "<p>yup, following all the editing was not easy. I really appreciated the consideration.</p>",
        "id": 258452023,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634767660
    },
    {
        "content": "<p>The wording in the commit seems against the interpretation you wrote, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . <br>\nIf we say \"systems shall support A <em>and</em> B\", if one system only supports A, it is not  conformant. In other words, a system that is suppporting only A is NOT further constraining, but is relaxing one constraint</p>",
        "id": 258462077,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634773458
    },
    {
        "content": "<p>I don't think this is a translation issue. The wording seems clear and in this case is very strict, and national / regional systems cannot be less strict</p>",
        "id": 258462188,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634773558
    },
    {
        "content": "<p>The 405 is the key. You don't have a choice but to 'support' it, but you can support it by returning a 405. </p>\n<p>if the base IG says 'no 405', then regions and organizations can't revoke that - so it depends on what the base PDQm spec says</p>",
        "id": 258478052,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634783669
    },
    {
        "content": "<p>I acknowledge Jose's point.  There surely is some way to resolve this, at least in IHE for international vs regional constraints. It is common for regional to further refine, and I had always figured that included picking A vs B where the internatonal specifies both for a server. We will discuss this today in the IHE meeting.</p>",
        "id": 258541285,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634821449
    },
    {
        "content": "<p>note that the reason PDQm requires both GET and POST is because IHE wants to specify the proper and useful use of GET. Thus we elevate GET to mandatory for the PDQm. The POST is already mandated by FHIR core, so we can't lower that requirement, we could expect our readers to know this, or we could be more friendly to the reader and remind them that POST is also mandatory. So this is why we got to servers must support both. -- given this was the main intent, the ability for a region to eliminate GET vs POST is not part of that intent.</p>",
        "id": 258543129,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634822228
    },
    {
        "content": "<p>to the 405 pathway... I don't like that this be the only solution... but it certainly does fit within the \"policy\" exception to all rules. One can always have a policy that refines in this way. This is an ugly solution, but it would work. I hope for something better.</p>",
        "id": 258543481,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634822368
    },
    {
        "content": "<p>The update to FHIR Core places GET and POST on the same level of requirement, and provides clarification that \"required to support\" is satisfied by returning a 405 for the particular method. With this in place, the base PDQm spec needs to clarify that it refers to the same definition, and also describe how localizations can specify requirements for only one or only the other (two parts - the client shall not use [GET/POST], server shall respond to [GET/POST] with a  405).</p>",
        "id": 258551368,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1634825238
    },
    {
        "content": "<p><del>@<strong>Vassil Peytchev</strong>  do you have spurious <em>not</em> after your hyphen there?</del> </p>\n<p>Nevermind, I get it now (I glossed over \"client\")</p>",
        "id": 258552358,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634825601
    },
    {
        "content": "<p>I documented in PDQm an Open Issue that explains this approach, and how we got there. This version will be published for Trial Implementation in the coming weeks. You can see it on the ci build - <a href=\"http://build.fhir.org/ig/IHE/ITI.PDQm/branches/main/index.html\">http://build.fhir.org/ig/IHE/ITI.PDQm/branches/main/index.html</a></p>",
        "id": 258950429,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635164321
    }
]