[
    {
        "content": "<p>Hi. Is there any guidance on using PUT vs POST when pushing a resource for the first time?<br>\nI understood that both may be used, one key difference being idempotency so I am wondering how this has gotten solved by others.</p>",
        "id": 153904488,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1504629965
    },
    {
        "content": "<p>it depends on your id managemnet patterns</p>",
        "id": 153904495,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504632780
    },
    {
        "content": "<p>MHD and NPFS used POST, but they are also posting a Bundle of resources. Not just a singular resource (Create). The other FHIR profiles from ITI are just read only profiles.</p>",
        "id": 153904500,
        "sender_full_name": "John Moehrke",
        "timestamp": 1504634280
    },
    {
        "content": "<p>Perhaps we need to use a bundle too.<br>\nScenario: patient syncs his smartphone and this uploads all the pending medicationAdministrations to the server.<br>\nThis means bundle, right?</p>",
        "id": 153904505,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1504635453
    },
    {
        "content": "<p>if i get it right, basically either we:<br>\na) leave the IDs for the server to manage, use POST and risk POSTing same thing twice.<br>\nb) expect the client to manage their IDs and PUT the things that are not on the server yet.<br>\nIs that about right?</p>",
        "id": 153904508,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1504635626
    },
    {
        "content": "<p>Yes. The duplicate POST is mostly an academic argument, not found in the wild that much.  It can be left to a client choice. But they need to be warned that if they chose to use PUT, they must do proper id management; and they must know the server will allow it. POST is the more common method. So I would recommend you have servers support both methods, and recommend clients use POST.   Or just pick POST until you have strong Profile evidence that you must address this.</p>",
        "id": 153904509,
        "sender_full_name": "John Moehrke",
        "timestamp": 1504641009
    }
]