[
    {
        "content": "<p>Maybe this is a more generic question, however it stumbled over when translating a DocumentReference query into a ITI-18 query:</p>",
        "id": 153876170,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1489408048
    },
    {
        "content": "<p>when querying for a related-id, XDS allows to specify an identifier type code (as specified in ITI-TF 3, 4.2.3.1.7 Metadata Attribute Data types; the datatype is CXi), i.e. providing a CX.5 part into the Slot value. <br>\nBut the FHIR TokenParam only allows system and value (although FHIR Identifiers may have type codes as well). Is this something lacking in FHIR or did I just miss something?</p>",
        "id": 153876171,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1489408244
    },
    {
        "content": "<p>This is a case where IHE seems to allow a query subset that one can't reflect into FHIR. I don't see it as a useful query subset. It exists as it was easier to document ITI-18 as allowing CXi. It was never mandated it be supported. As with all query, the server has choice on what do with nonsense query parameters; it can ignore, throw an  error, or do something that the developer thought was useful. </p>",
        "id": 153876178,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489410046
    },
    {
        "content": "<p>Well, related ID is a pretty broad term, and it feels useful to me to allow the client to specify whether the related id belongs to a referral or a study instance or an encounter, so the registry does not have to look after everything. Adding nonsense parameters is certainly possible but not really interoperable.  <br>\nOK, so no obvious workaround for the moment, I guess.</p>",
        "id": 153876207,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1489420151
    },
    {
        "content": "<p>If the ID is unique, then the type of ID is not adding any value. It is possible to query on the ID, and then further refine by type of ID locally. This does not seem to be a big burden, especially since the ID should have been globally unique in the first place.</p>",
        "id": 153876214,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489420648
    },
    {
        "content": "<p>Agree. But sometimes IDs of different objects are not stored in one place, even though they are unique. <br>\nBut that's an implementation detail and not relevant here.</p>",
        "id": 153876223,
        "sender_full_name": "Christian Ohr",
        "timestamp": 1489422698
    }
]