[
    {
        "content": "<p>While working on the diagram rendering I thought of checking my approach: <br>\nCurrently I take a resource (e.g. ExampleScenario, CapabilityStatement, PlanDefinition) and run some XSLT magic to render it as a diagram <br>\n(generate PlantUML source, create diagram, then throw away the source, take the diagram and build a page).</p>\n<p>I was wondering if it makes sense to preserve the source, for example having an extension \"DiagramRepresentationSource\" that can hold the plantUML text. <br>\nI don't see value added, but that is because of the way I'm implementing - are there other perspectives?</p>",
        "id": 197175312,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589216646
    },
    {
        "content": "<p>In ITI, when we create UML diagrams from UML source, we put that source inline. This becasue some readers like to take that UML source for their use.</p>",
        "id": 197188274,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589223089
    },
    {
        "content": "<p>in html authoring this should be even more clear it is a good thing to make the source avaialble to the reader</p>",
        "id": 197188320,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589223121
    },
    {
        "content": "<p>I'm tring to add that to the template. We can probably make an extension</p>",
        "id": 200242262,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591715095
    },
    {
        "content": "<p>What kind of XSLT magic?</p>",
        "id": 200382583,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1591770960
    },
    {
        "content": "<p>As per my first line in the thread- I take the resource in xml, and I generate the plantuml syntax from that, and then I pass it through plantUML, and that gives me an SVG</p>",
        "id": 200386006,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591774588
    },
    {
        "content": "<p>there's not much to it (it was not so easy because i did not really know xslt when I started this, but the transformation is rather simple)</p>",
        "id": 200386040,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591774636
    }
]