[
    {
        "content": "<p>The on-demand option in XDS.b states the following when it comes to the ITI-18 stored query: \"If no value is specified for DocumentEntryType, the value requesting only Stable Document Entries shall be assumed.  To get all Document Entry types, the query shall contain both of the valid values in the request.\". In MHD we can't distinguish (by means of a query parameter), whether something is a stable or an on demand document. Wouldn't it be better if the default in XDS.b were to be 'both', rather than 'stable'? (raised by Revathy Sreenath, at the Amsterdam DevDays)</p>",
        "id": 181614987,
        "sender_full_name": "René Spronk",
        "timestamp": 1574406698
    },
    {
        "content": "<p>It would have been better, but IHE governance prevents breaking changes to a Final Text profile. The concept of dynamic documents was added much later, after the core XDS was normative. Thus it had to be added as an Option.</p>",
        "id": 181650539,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574438251
    },
    {
        "content": "<p>very little down side to the model where you need to ask for both if you want both.</p>",
        "id": 181650570,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574438272
    },
    {
        "content": "<p>If the main point of the question is how dynamic documents are to be addressed in MHD... That topic has not been brought to IHE as something needing to be solved. The original scope for MHD was kept small to be easy to write and implement. Thus some XDS options were not addressed, including dynamic (onDemand) documents.</p>",
        "id": 181650742,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574438385
    },
    {
        "content": "<p>The question is a) an observation that we have a difference in default query behaviour between XDS.b and NHD, where personally I think the XDS.b wording is the undesirable one, and b) a query as to what (if any) is the use case where one would wish to explicitely only retrieve on-demand or stable documents?</p>",
        "id": 181707194,
        "sender_full_name": "René Spronk",
        "timestamp": 1574499506
    },
    {
        "content": "<p>Not much to say on ( a ). But on ( b ) there is little overhead to returning results that the client throws away. I have no heard any requests for ( b ) either</p>",
        "id": 181832205,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574695495
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> it seems that the need for <strong>on-demand MHD</strong> may well arise from the current work in PCC related to the International Patient Summary (<strong>IPS</strong>). It is certainly reasonable to want an IPS to represent the right-now summary of information about a subject of care. Is this a use case we could add to the <strong>MHD HIE</strong> work item?</p>",
        "id": 182859049,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1575748182
    }
]