[
    {
        "content": "<p>I notice that PDQm and MHD are both in DRAFT on STU3. Is the plan to marure those on STU3 or move them to R4?</p>",
        "id": 153957789,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1526044579
    },
    {
        "content": "<p>Yes, IHE is moving along with FHIR as releases (not ballot packages) are made.  All IHE profiles must stay in Trial Implementation state until the underlying standard is normative. With the possibility of R4 having normative content by the end of this year, it is possible that PDQm will be able to move to Final Text status.</p>",
        "id": 153957815,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526046322
    },
    {
        "content": "<p>Hmm OK - So if we have no plans to use R4 at the moment then aligning to IHE on these may be problematic.</p>",
        "id": 153957916,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1526054308
    },
    {
        "content": "<p>I do not understand your last point. Can you elaborate?  (Note R4 is not published, there is a ballot proposal for R4, but that is not an R4 publication. The R4 publication will be late this year, possibly early next year).</p>",
        "id": 153957917,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526054611
    },
    {
        "content": "<p>So currently we have a lot of developments underway all using STU3. Across these we use a consistent set of national profiles. We are looking at some usecases for \"document\" and \"record\" retireval as well as some demographic use cases. As such we are looking at MHD and PDQm  which are also based on STU3.</p>\n<p>If we progress along this path (which will go well imnto next year) by that time R4 may have arrived and IHE may update to adopt it. If that's the case our work will be out of date as we will still be on STU3.</p>",
        "id": 153957918,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1526054887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> the issue for me with Forge is that it doesn't seem to integrate well with other desktop applications - maybe I'm behind, but I can I open profiles with forge from another application, and if I do, can I get notification that it's saved/closed?</p>",
        "id": 153957929,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526057649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> you can open a profile in Forge via the command line, e.g. \"Forge myprofile.xml\". A client tool could observe file system change notifications to detect whenever the user saves the profile. Does that help?</p>",
        "id": 153958244,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1526111385
    },
    {
        "content": "<p>ok I'll see if that does it</p>",
        "id": 153958252,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526111554
    },
    {
        "content": "<p>I can't tell when the session ends though?</p>",
        "id": 153958253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526111564
    },
    {
        "content": "<p>If you start any external process, the OS can tell you when it has finished.</p>",
        "id": 153958287,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1526113882
    },
    {
        "content": "<p>I could implement some custom notifications, but I think the OS already covers your needs.</p>",
        "id": 153958288,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1526113908
    },
    {
        "content": "<p>last time I looked, it was confusing because of the .net bootstrap - it's a different process</p>",
        "id": 153958289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526114034
    },
    {
        "content": "<p>Win32 OpenProcess function returns a process handle, then you can call WaitForSingleObject.</p>",
        "id": 153958337,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1526118243
    }
]