[
    {
        "content": "<p>XDS / CDA question for my CDA/XDS comrades: are you familiar with any use and coupling of externalDocuments and XDS associations in any XDS setups that uses this binding actively to group related documents - meaning that externalDocuments are part of the actual document set as well?</p>",
        "id": 216632970,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1605283830
    },
    {
        "content": "<p>Hi Jens. not that I've seen in the wild, at least at this point. However, the 2016 HL7 Data Provenance IG makes use of externalDocument to capture provenance links, e.g. when an entry in one CDA is derived from one in another. And interest in provenance is increasing - we've started to add some requirements to production exchanges in the US, so I expect to see some uptake in cases such as reconciliation.</p>\n<p>As far as its intersection with XDS, the mechanism by which you could group documents related this way is the XDS attribute referenceIdList (not through XDS associations). I don't believe this is being used at the national level in the US, although I don't have visibility into regional exchanges.</p>\n<p>Hope this helps.</p>",
        "id": 216658479,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1605294824
    },
    {
        "content": "<p>For clarification, were you referring to the externalDocument element in the CDA spec? As in something like this use case? <a href=\"http://www.healthintersections.com.au/?p=960\">http://www.healthintersections.com.au/?p=960</a></p>",
        "id": 216661933,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1605296166
    },
    {
        "content": "<p>referenceIdList is more flexible and supports linkages agnostic to transport mechanics. Within XDS there is also Folder, and SubmissionSet that can show grouping of documents.</p>",
        "id": 216661964,
        "sender_full_name": "John Moehrke",
        "timestamp": 1605296184
    },
    {
        "content": "<p>Exactly as John said. What specific kind of grouping are you looking for?</p>",
        "id": 216663132,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1605296643
    },
    {
        "content": "<p>primarily submissionSet</p>",
        "id": 216717021,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1605344208
    },
    {
        "content": "<p>I understand that Italy uses SubmissionSet. They even have a digital signature across the SubmissionSet.</p>",
        "id": 216808505,
        "sender_full_name": "John Moehrke",
        "timestamp": 1605467357
    },
    {
        "content": "<p>Some years ago, 2009?, we (IHE Germany) have submitted a proposal to remove the constraints on associations so that one could represent any association between documents - beyond versioning. That would have been very simple and allow for a broader use. Unfortunately that was rejected and never considered again.</p>",
        "id": 217008592,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1605623239
    }
]