[
    {
        "content": "<p>I was hopeful that this problem has already been solved. <br>\nWe would like it if Consent resources were made active/inactive based on the contents of Consent.provision.period where if there are no currently provisions (based on Consent.provision.period), the resource is marked inactive (and vice-versa).  Is that possible?</p>",
        "id": 167776498,
        "sender_full_name": "David Pyke",
        "timestamp": 1560186436
    },
    {
        "content": "<p>it's not an API thing, so we haven't done it directly. You could say something in narrative - did you have more in mind?</p>",
        "id": 167778063,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560187658
    },
    {
        "content": "<p>I'm not sure we'd need more, it was just a question to the group if that kind of thing is a new issue or if we can just say \"server to monitor consents and update status as appropriate\"</p>",
        "id": 167778657,
        "sender_full_name": "David Pyke",
        "timestamp": 1560188063
    },
    {
        "content": "<p>we haven't had such a case before, where status is directly linked to a period</p>",
        "id": 167778825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560188197
    },
    {
        "content": "<p>typically, status is not directly linked</p>",
        "id": 167778832,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560188204
    },
    {
        "content": "<p>I was hoping that Medication or other resources that may be time limited had looked into/solved this issue</p>",
        "id": 167779246,
        "sender_full_name": "David Pyke",
        "timestamp": 1560188512
    },
    {
        "content": "<p>the record remains active even if the period during which it was applicable is past.</p>",
        "id": 167779504,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560188707
    },
    {
        "content": "<p>So, we'll just have to leave it to local inspection if there are any active consents after a query</p>",
        "id": 167779654,
        "sender_full_name": "David Pyke",
        "timestamp": 1560188830
    },
    {
        "content": "<p>If you have an active prescription that's intended to expire at a particular date, it's up to the server to decide whether/when to transition the prescription to \"completed\" based on the assumption that the patient is (likely) not taking the medication anymore.  There's no requirement for servers to do this and, thus far, I'm not aware of any implementation guides that set an expectation to do this.</p>",
        "id": 167780653,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560189485
    },
    {
        "content": "<p>And the timing of when that flag was actually tripped, during an update, some server based update that updated the record on expiry, some process that does the review/marking etc.</p>",
        "id": 167824636,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1560236395
    },
    {
        "content": "<p>All this agreed... is there some text that warns that the .status element does not automatically move to inactive upon time based expiration? with recommendation that this could be automated? If we had this kind of language it would be good for it to appear similarly in all places where expiration results in .status changes.</p>",
        "id": 167844905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560256174
    },
    {
        "content": "<p>I don't think we've said that anywhere, but I don't think we've really had any assertion that it should. Do you see other similar resources</p>",
        "id": 167857593,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560264769
    },
    {
        "content": "<p>We are looking at Consent that can have a time horizon (I allow access for 12 months)... and figure it might be rather similar to a medication authorization (drug x is authorized for 12 months). So rather than invent unique human text, we are just asking if there is common text so that the reader of FHIR can see similar explaination.</p>",
        "id": 167858705,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560265467
    },
    {
        "content": "<p>we don't have a resource for Authorization, to my knowledge</p>",
        "id": 167861420,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560267249
    },
    {
        "content": "<p>Period's don't always dictate direct active status...<br>\nAn encounter could be complete, but post encounter activities are still going for a while during the billing cycle.</p>",
        "id": 167965704,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1560358000
    }
]