[
    {
        "content": "<p>Wondering if anyone else has had a need to be able to work out if a resource can be edited or deleted (to help drive a user experience and put the record in read only mode)?<br>\nI know that there is the validate operation that can be used to find this out for delete<br>\n<a href=\"http://hl7.org/fhir/resource-operation-validate.html\">http://hl7.org/fhir/resource-operation-validate.html</a><br>\nAnd if I do a get on the _history I can see if it is a historic version (hence not _really_ updatable) but there's no way to check if the user has permission to do update a resource.<br>\nI guess you could post the resource you just retrieved to the validate for an update and see if that returns a permission error...</p>",
        "id": 268890689,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1642792909
    },
    {
        "content": "<p>is it purely a permission problem, or are you also including in there business-rules?</p>",
        "id": 268890962,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642793049
    },
    {
        "content": "<p>My usage is to drive global readonly behaviour - mostly a permission thing.<br>\n(I'm doing the core business rules for the individual controls on a bit by bit basis)</p>",
        "id": 268903319,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1642799219
    },
    {
        "content": "<p>Is this in addition to or in replacement of what can be discovered in Capability Statements and SMART Permissions?</p>",
        "id": 268903465,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642799303
    },
    {
        "content": "<p>It's specific for an actual resource - which would give the user permissions result for the specific instance.</p>",
        "id": 268906453,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1642800993
    },
    {
        "content": "<p>(But true, I could peek there for general read-only sense)</p>",
        "id": 268906494,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1642801032
    },
    {
        "content": "<p>Kubernetes has a \"can-i\" command backed by an authorization API where you can ask questions about whether a particular operation will be allowed in a given authorization context <a href=\"https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.19/#selfsubjectaccessreview-v1-authorization-k8s-io\">https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.19/#selfsubjectaccessreview-v1-authorization-k8s-io</a></p>",
        "id": 268911263,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642803713
    },
    {
        "content": "<p>We might consider an analogous FHIR operation</p>",
        "id": 268911362,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642803756
    }
]