[
    {
        "content": "<p>I have heard the presentation on this project to create a FAST/FHIR intermediary implementation guide, and I can't help but think we are re-inventing the wheel, where we should be using the wheels (the internet) we have to use. HL7 should be focused on the \"Health\" specific needs, not general IT infrastructure. We certainly should be presented with the Use-Case to solve, not presented with the solution someone has already created.</p>",
        "id": 224193590,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611759856
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196338\">@Patrick Murta</span></p>",
        "id": 224193865,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611759972
    },
    {
        "content": "<p>Why does the long-standing use of http-proxy, or api-gateway not sufficient? These have been used for years to support simplifying routing/management, and provide for content policy inspection. Where http-proxy are commonly used by corporations to inspect all outbound http browser sessions by the company users; and api-gateways are used by cloud service to support inbund to the cloud API requests that are potentially bound to various services (micro-services) within the cloud (or beyond).</p>",
        "id": 224193905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611759994
    },
    {
        "content": "<p>I went to the connectathon track on this and my impression was similar, it sounds like adding another layer of FHIR-specific routing to solve problems that the internet has already solved.</p>",
        "id": 224194801,
        "sender_full_name": "Paul Church",
        "timestamp": 1611760362
    },
    {
        "content": "<p>I had to miss the call yesterday, but this was my concern when it came up in FMG, too.</p>",
        "id": 224199396,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611762122
    },
    {
        "content": "<p>Zeroth: apologies for the novel.  It's been a little while since I posted one, but it's how I think the best (and I'm sure you have all missed them ;-).</p>\n<p>First, <span class=\"user-mention\" data-user-id=\"196338\">@Patrick Murta</span>, I hope I didn't offend last night.  These sessions at the WGM are a chance for people that can't pay attention \"always to everything\" to focus in and ask difficult questions.  And yes, I've been on the receiving side of that a few times =).  It's hard, but it's also necessary (and useful).</p>\n<p>Getting to the FAST IG itself... I still don't have a clear picture of the use cases, but I can see a few areas that definitely need exploration.</p>\n<p>For example, the idea of a standardizing a 'FHIR directory' server.  I like it, and I think building an IG for this is a great idea.  I would argue it should use FHIR resources (e.g., <code>Organization</code> and <code>Endpoint</code>) so to, as John said, avoid re-inventing the wheel*, but having a reusable specification for a directory of FHIR servers sounds useful.</p>\n<p>*e.g., how do you assign multiple names to an organization (\"Insurance Provider of State\" + \"INPxx\", etc.), search semantics (clients don't want to download 500 records, index them, and figure out their own search algorithms to do the above name matching), etc.</p>\n<p>Similarly, the idea of a standard token exchange mechanism for trusted networks of servers <em>seems</em> useful.  I am curious how implementers \"at large\" feel (e.g., would it actually be implemented?), and work on a foundational component probably needs a broad core group and a large time investment*.  Again, I would love to see an IG/project for this, and hope it can align with the SMART specs already present (e.g., app launch and backend services authorization).</p>\n<p>*as a datapoint, updating the SMART App Launch Framework to v2 has been a public project for a year with bi-weekly calls and multiple Connectathons.  The changes are just now in the process of moving to the necessary WGs for additional review/work.</p>\n<p>On the other hand, it feels like some decisions have already been made and aren't open to discussion.</p>\n<p>An example here is the 'header vs. path component' issue.  This was brought up during PSS application, and apparently at FMG review as well.  So far, I haven't heard any <em>reasoning</em> as to why headers were chosen, simply that they were.  Doing something contrary to what's in place isn't going to be approved without some justification.</p>\n<p>Similar on this front is the decision not to \"depend\" (if I have my wording correct from last night) on FHIR for certain parts of the work.  If I'm sending a request for a FHIR resource to a network, I would expect an <code>OperationOutcome</code> for errors.  Here again, defining something different will set the bar much higher because there's already a way defined and in use.</p>\n<p>Overall, I think my biggest concern is about expectations.  Bringing a specification for publication as a part of FHIR means that it needs to align with FHIR.  This can be challenging (what I wouldn't give to change the JSON serialization format =), but it is a requirement of the process.</p>",
        "id": 224207994,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1611765243
    },
    {
        "content": "<p>Would it be helpful to step through an example of how things are expected to work?</p>\n<p>A common pattern of accessing FHIR resources is to establish patient identity, and then request additional resources related to that patient. If we assume to have the following actors:</p>\n<ul>\n<li>Originator <code>A</code></li>\n<li>Responder <code>B1</code></li>\n<li>Responder <code>B2</code></li>\n<li>Intermediary <code>I1</code></li>\n<li>Intermediary <code>I2</code></li>\n</ul>\n<p>and the following routing rules:</p>\n<ul>\n<li><code>A</code> -&gt; <code>I1</code> -&gt; <code>B1</code></li>\n<li><code>A</code> -&gt;<code> I1</code> -&gt; <code>I2</code> -&gt; <code>B2</code></li>\n</ul>\n<p>If the goal of <code>A</code> is to do a search on a patient, and then retrieve the PCP, what would be the steps for <code>A</code> to do that, given the two patients, <code>P1</code>, and <code>P2</code>, which are both found on <code>B1</code>, but with the following difference:</p>\n<ul>\n<li><code>P1.generalPractitioner</code> references the <code>GP1</code> Practitioner resource on <strong><code>B1</code></strong></li>\n<li><code>P2.generalPractitioner</code> references the <code>GP2</code> Practitioner resource on <strong><code>B2</code></strong></li>\n</ul>\n<p>The last assumption here is that there is a Directory/Locator service that can be queried by <code>A</code> to learn the URL and destination to search for <code>P1</code> and <code>P2</code>.</p>",
        "id": 225751266,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1612902033
    },
    {
        "content": "<p>My first question here is how these practitioner references are represented. Are they full URLs? An identifier that has to be looked up in a directory? Is the reference from a patient on B1 to a practitioner on B1 different from the reference to the practitioner on B2?</p>",
        "id": 226176979,
        "sender_full_name": "Paul Church",
        "timestamp": 1613154400
    },
    {
        "content": "<p>The references to GP1 and GP2 are \"vanilla\" RESTful references; in this example, P1 to GP1 can be a relative reference, or a full URL, the reference from P2 to GP2 must be a full URL.</p>",
        "id": 226178238,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1613155014
    },
    {
        "content": "<p>Is the full URL reference from P2 to GP2 using the base URL of B2 or I1?</p>",
        "id": 226178553,
        "sender_full_name": "Paul Church",
        "timestamp": 1613155169
    },
    {
        "content": "<p>B1 and B2 consider I1 and I2 to be just another client. The reference from P2 to GP2 uses the base URL of B2.</p>",
        "id": 226178903,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1613155368
    },
    {
        "content": "<p>How does the client know that I1 is the first hop in trying to obtain a resource from B2? If I understand correctly, in the proposed FAST intermediaries design the client would call I1 with an X-Destination of B2. But why would it know that it can't just resolve the REST URL to B2 directly?</p>",
        "id": 226179186,
        "sender_full_name": "Paul Church",
        "timestamp": 1613155539
    },
    {
        "content": "<p>That is one of the questions I am trying to raise and get answers to. </p>\n<p>If there is a business reason for queries from A to always go through I1, no matter the destination, I think that implies either a requirement for I1 to appropriately rewrite links in any responses it gets, or a requirement for the client to use mapping functionality that maps non-I1 URLs to I1 URLs. </p>\n<p>If the goal is for the client to be agnostic whether it is communicating through an intermediary or directly, then the rewriting requirement becomes the only viable solution.</p>",
        "id": 226180311,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1613156121
    },
    {
        "content": "<p>I think we're on the same page about a very fundamental question - if we are talking about REST URLs, there is already a way for a client to get requests routed to the ultimate destination: the internet. So if I have a REST URL and an X-Destination header, I don't understand what layer we are routing at.</p>\n<p>The FAST group has talked about things like clearinghouses or technology providers as intermediaries, but in those cases I would expect the full URL to be the intermediary rather than the ultimate responder.</p>",
        "id": 226185122,
        "sender_full_name": "Paul Church",
        "timestamp": 1613158601
    },
    {
        "content": "<p>We have this problem in GCP, where the actual full URL is a cloud service that the implementer likely does not want to expose and may migrate behind the scenes from time to time. So the next layer of proxy does full URL rewriting between incoming and outgoing resources to expose a consistent URL to clients.</p>",
        "id": 226185842,
        "sender_full_name": "Paul Church",
        "timestamp": 1613158970
    },
    {
        "content": "<p>GCP?</p>",
        "id": 226380249,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613393685
    },
    {
        "content": "<p>GCP = Google Cloud Platform</p>",
        "id": 226380333,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1613393746
    },
    {
        "content": "<p>re-writing returned URLs means re-writing all internal references too... which means changing medical records... This is a big burden to keep re-written URLs consistent longitudinally for the life of the patient plus; and consistent regardless of the consuming system.   This solution is very expensive and puts into question the integrity of the data.</p>",
        "id": 226380426,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613393804
    },
    {
        "content": "<p>We can see the solution they are proposing... but I can't yet understand the problem we think we are solving. Thus no idea if the solution actually solves the problem, and no idea if the solution is economical solution to the problem.</p>",
        "id": 226380599,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613393897
    },
    {
        "content": "<p>There are intermediary solutions being proposed in the Netherlands that are likely going to re-write fullUrls and re-map FHIR IDs (since if you re-host to a new URL, and that intermediary does that for multiple parties, you may not have unique FHIR IDs anymore).  Just an FYI on some projects I know are happening in real life.</p>",
        "id": 227319151,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1614020481
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  Are you referring to Twiin or other initiatives? I'm working on Twiin myself, and would love to be in contact with anyone else working on a solution for this complex problem.</p>",
        "id": 233825710,
        "sender_full_name": "Marc Sandberg",
        "timestamp": 1617976879
    },
    {
        "content": "<p>Twiin is not something I've heard of.  I was referring to various DVZA entities for MedMij.  If Twiin is a DVZA, it isn't one of the specific DVZAs I'd heard of.</p>",
        "id": 233830627,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1617978666
    },
    {
        "content": "<p>Twiin isn't a DVZA, it's working to specify something similar to MedMij but for Health Organization to Health Organization instead of Patient to Health Organization.</p>",
        "id": 233835719,
        "sender_full_name": "Marc Sandberg",
        "timestamp": 1617980379
    },
    {
        "content": "<p>All, we have made a few updates to the draft IG framework in response to feedback here an in meetings.  I have also attached a PDF which distills down the options considered to a matrix with sequence diagrams.  An option that has been reviewed with several of you during connectathons and such is the DNS model in which the URL for actor B (the receiver of the API call) has been set up to resolve to the intermediary.  This one seems to be the most popular at this point (options 1/2 in the PDF and shell IG).</p>",
        "id": 243817966,
        "sender_full_name": "Patrick Murta",
        "timestamp": 1624555125
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/HL7/fhir-exchange-routing-ig/branches/main/specification.html\">http://build.fhir.org/ig/HL7/fhir-exchange-routing-ig/branches/main/specification.html</a></p>",
        "id": 243817992,
        "sender_full_name": "Patrick Murta",
        "timestamp": 1624555141
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/w_KKqRAng4I6wlLbUUU2r9f0/Hybrid-Intermediary-Exchange-IG-options-20210618.pdf\">Hybrid-Intermediary-Exchange-IG-options-20210618.pdf</a></p>",
        "id": 243818048,
        "sender_full_name": "Patrick Murta",
        "timestamp": 1624555162
    }
]