[
    {
        "content": "<p>I have started getting R4B ready for publishing. Per the agreement with FMG, I am transiting to using 4.3.0-CIBUILD, etc, so that the rest of the R4B sequence will be 4.3.0</p>",
        "id": 264784286,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639437106
    },
    {
        "content": "<p>this raises a question I hadn't considered, and we didn't discuss:</p>",
        "id": 264784360,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639437126
    },
    {
        "content": "<p>at this point, the FHIR version enumeration used in StructureDefinitions lists every release of FHIR from the start, including the ballot and interim versions.</p>",
        "id": 264786926,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639438849
    },
    {
        "content": "<p>that doesn't have be the case anymore - I could just have 4.3.0 as \"R4B sequence\". or I could list all the interim versions - 4.3.0-DRAFT</p>",
        "id": 264786999,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639438897
    },
    {
        "content": "<p>anyone have any thoughts?</p>",
        "id": 264787007,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639438901
    },
    {
        "content": "<p>Are these enumerations driving how an artifact is referenced in an IG?</p>",
        "id": 264793369,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1639443736
    },
    {
        "content": "<p>Would anyone need to reference a specific interim version?  Currently I am building off the balloted r4b but will want to switch to the published version.  Thus I can make do with just 4.3.0. But others might want to stick to the balloted version for some time?</p>",
        "id": 264794135,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1639444351
    },
    {
        "content": "<p>I'm not asking about the package version -  that will be 4.3.0-XXX. I'm asking about the enumerations inside the resources themselves</p>",
        "id": 264808914,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639455619
    },
    {
        "content": "<p>and no, this is not what drives versioning from for IGs - they will run off the package version. In dependencies. But canonical versioning will run off the resource version not the package version</p>",
        "id": 264808950,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639455670
    },
    {
        "content": "<p>for now, I'll be continuing with the practice that the resource versions match the package version  - it turns out to be a significant rewrite to change that arrangement</p>",
        "id": 264808990,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639455716
    },
    {
        "content": "<p>Where are the enumerations used?</p>",
        "id": 264815685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639461093
    },
    {
        "content": "<p>CapabilityStatement.fhirVersion, ImplementationGuide.fhirVersion , StructureDefinition.fhirVersion</p>",
        "id": 264818384,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639464273
    },
    {
        "content": "<p>These interim versions sound like release candidates to me, and the intention is that these versions represent 4.3.0 in its final shape, so we could consider them to be 4.3.0, and do not need a persistent label in the version enumeration.</p>",
        "id": 264830259,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1639473774
    },
    {
        "content": "<p>well, R5b draft published this week will have one, because I'm currently tied to one meaning. But we can consider that. it does mean that you won't be able to tell instances from the candidates apart</p>",
        "id": 264833606,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639475726
    }
]