[
    {
        "content": "<p>I think that the disposition for <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14962\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14962\">GF#14962</a> is wrong (even though I moved it). The intent of the disposition is that the item related invariants on Questionnaire apply to nested items - yes, that makes sense. But the disposition says that they should be applied to .repeat(item) - but that doesn't make sense. They are part of the element definition for Questionnaire.item (not Questionnaire.repeat(item), which is not an element) and automatically apply to all nested items, since they are @Questionnaire.item</p>",
        "id": 153973000,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530572358
    },
    {
        "content": "<p>There's a separate tracker that talked about splitting referenced elements to be contained structure definitions so we could differentiate between constraints that apply to the element vs. those that apply to the type - given that invariants could be either.  Don't remember where that landed.</p>",
        "id": 153973008,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530572835
    },
    {
        "content": "<p>I think the submitter's comment was that the invariant wasn't being enforced by the tooling as it stands</p>",
        "id": 153973009,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530572859
    },
    {
        "content": "<p>we didn't at on the other tracker; we said instead that profiles don't use contentReference. I applied that a few hours ago.</p>",
        "id": 153973010,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530572947
    },
    {
        "content": "<p>I'll make sure that the tooling enforces them correctly</p>",
        "id": 153973011,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530572959
    }
]