[
    {
        "content": "<p>Hello everyone :)</p>\n<p>I have a question and a proposition about the Group resource and particularly about its characteristics attribute. I think this attribute is quickly limited when we want to describe complex characs.</p>\n<p>For example I want to create a group of patients. There are three possible characteristics to fulfill, call them characteristic A, B, C.</p>\n<p>My first use case is the <strong>OR operator</strong></p>\n<ul>\n<li>I want to describe a group where patients check char A OR char B.</li>\n</ul>\n<p>My second use case is <strong>n amongst m operator</strong></p>\n<ul>\n<li>I want to describe a group where patients have at least (or maximum) 2 out of the three characteristics.</li>\n</ul>\n<p>My third use case: nested caracteristics</p>\n<ul>\n<li>patients matching ( 1 characteristics AND (n amongst m characteristics) ), char A, and either char B or char C</li>\n</ul>\n<p>One possibility would be to add extensions, however it would be limited for nested characteristics and we will lose in readability.</p>\n<p>According to me, the most interesting solution would be to add nested characteristics to the Group resource (maybe in FHIR R5 ?) and to add two attributes to the characteristic BackboneElement</p>\n<p><a href=\"/user_uploads/10155/WLdQv3JVpEWqDbggpqkfISQs/Group.png\">Group.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/WLdQv3JVpEWqDbggpqkfISQs/Group.png\" title=\"Group.png\"><img src=\"/user_uploads/10155/WLdQv3JVpEWqDbggpqkfISQs/Group.png\"></a></div><p>My idea is to duplicate and nest the <strong>characteristics BackboneElement</strong> and to add two attributes :</p>\n<ul>\n<li>The type attribute is a <strong>ValueSet</strong> [\"and\", \"or\" \"nAmongstM\"]</li>\n<li>The minimumValid attribute is a <strong>number</strong> to indicate that the nested characteristics must have at least n validated to be included in the group</li>\n</ul>\n<p>Is it possible to integrate the Workgroup ?</p>\n<p>Thanks for your feedback !</p>",
        "id": 211730755,
        "sender_full_name": "Nicolas Riss | Arkhn",
        "timestamp": 1601455666
    },
    {
        "content": "<p>AND is handled by listing all of the characteristics.  OR is handled by composition of the base group referencing the alternative groups.  n amongst m would need to be handled as an extension.  Feel free to submit a change request proposing a change though</p>",
        "id": 211754564,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601470547
    },
    {
        "content": "<p>n of m is still an 'or' with some set math.</p>",
        "id": 211851985,
        "sender_full_name": "Eric Haas",
        "timestamp": 1601507971
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 211852139,
        "sender_full_name": "Eric Haas",
        "timestamp": 1601508111
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179280-fhir.2Finfrastructure-wg/topic/Group.20and.20characteristics/near/211754564\">said</a>:</p>\n<blockquote>\n<p>AND is handled by listing all of the characteristics.  OR is handled by composition of the base group referencing the alternative groups.  n amongst m would need to be handled as an extension.  Feel free to submit a change request proposing a change though</p>\n</blockquote>\n<p>It is a satisfying solution, finally I just had to add an extension to indicate the minimum number of characteristics to be validated in the indicated subgroup. </p>\n<p>n amongst m is finally just a generalization of the or operator, with this minimum number of characteristics set to 1.</p>\n<p>I will think of a change request with a description of the valueReference usage to explain the possibility to reference a Group, and with like a \"minimumValid\" number attribute.</p>\n<p>Thanks for your replies</p>",
        "id": 211887951,
        "sender_full_name": "Nicolas Riss | Arkhn",
        "timestamp": 1601545653
    }
]