[
    {
        "content": "<p>The following ticket is marked as \"Resolved - Change required\". The page however is now owned by the Security WG. What's the best way of assigning it to a different working group? <a href=\"https://jira.hl7.org/browse/FHIR-27794\">https://jira.hl7.org/browse/FHIR-27794</a></p>",
        "id": 275715457,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1647546295
    },
    {
        "content": "<p>If it's resolved, it can't be reassigned.  The WG is the WG that voted on the resolution and needs to remain.</p>",
        "id": 275715723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647546440
    },
    {
        "content": "<p>To reassign you'd have to re-open and the new WG would need to re-vote on the resolution.  Re-opening would require a vote by the original WG.</p>",
        "id": 275715778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647546471
    },
    {
        "content": "<p>Why would FHIR-I be the appropriate owner for this? Is FHIR-I also going to take ownership of Provenance too?</p>",
        "id": 275723013,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647549662
    },
    {
        "content": "<p>This was originated a long time ago, and was resolved also a long time ago. I think this one should be dumped... and I was the originator of this one.</p>",
        "id": 275723514,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647549799
    },
    {
        "content": "<p>The resolution does not seem to align at all with the problem statement. The problem is that this \"Provenance Relevant History\" showed up and it never declared what the difference is between \"relevant\" and everything else (non-relevant?)</p>",
        "id": 275723969,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647549993
    },
    {
        "content": "<p>At the time it was resolved, FHIR-I was the owner.  If you want FHIR-I to vote to re-open it, transition it to Security, and have them redisposition it, that's totally possible.  But that would be the process needed.</p>",
        "id": 275740643,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647558641
    }
]