[
    {
        "content": "<p>I spent yesterday evening and most of today going through all of our issues - including those not yet triaged, those that were related to core tooling issues, etc. and tried to move as many as I could 'along'.  I've assigned priorities to everything still open.  Prioritization is as follows:<br>\nHighest - issues related to R4B (which we need to both land and apply pronto if the fixes are going to make this release<br>\nVery High - Issues related to normative portions of the spec, which we want to both resolve and apply before R5 ballot<br>\nHigh - not normative, but issues that ideally we'll resolve before ballot<br>\nLow - ok to address after ballot</p>\n<p>Note that 'low' doesn't mean \"not important\", just \"we have a bit more time to address\"</p>\n<p>There are 41 issues currently on our list to resolve, plus 24 \"waiting for input\" issues, most of which will also need WG time.  There may be a few Block vote candidates that'll get pulled to deal with as well.  Plus new ones. </p>\n<p>I <em>think</em> we can get through most, if not all of the high priority ones before the ballot opens with 1 hour a week (leaving the second hour to work on applying changes).  It'll be tight though.</p>\n<p>The real challenge is that we now have 802 items to apply + 40 more from a block vote, plus a decent chunk of the 65 open issues.  So close to 900 issues.  Some of those are quick and easy.  Some are pretty evil.  We'll devote the second hour of our call each week to applying changes.  Workflow calls will also address a decent chunk of their time to applying changes.  We can do the same with IG tooling calls.  However, we're going to need volunteers to work on changes between calls too.  </p>\n<p>We have 6 weeks before content freeze...</p>",
        "id": 268997011,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642913062
    },
    {
        "content": "<p>Question on a ticket: <a href=\"http://jira.hl7.org/browse/FHIR-23738\">FHIR-23738</a> is labeled as a 'placeholder' for moving to topic-based subscriptions.  Given where we are, is it ok to mark it as applied?</p>",
        "id": 269139308,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1643045015
    },
    {
        "content": "<p>Makes sense to me</p>",
        "id": 269139545,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643045105
    },
    {
        "content": "<p>Thanks Lloyd - yoeman's work indeed !</p>",
        "id": 269156298,
        "sender_full_name": "Eric Haas",
        "timestamp": 1643051968
    }
]