[
    {
        "content": "<p>FHIR-I currently has the biggest backlog of unapplied issues of any of the work groups.  I've been thinking about how we might avoid that in the future.  I think the main reason for the backlog is that no-one is on the hook to 'apply' a change once it's agreed - and we don't even necessarily think about the 'size' of the work involved in applying a change.  I'm wondering if it might make sense for us to establish a rule that we don't agree to make a change without identifying someone who agrees to make the change - and assigning it to them as soon as the resolution is stored.  We can then check the backlog each call, or even each month, of \"assigned but not yet committed\" issues that are older than, say, 4 weeks and figure out whether we need to re-jig who's responsible.</p>\n<p>Does that seem workable?  Obviously it doesn't make the current backlog disappear, but it might help with ensuring it doesn't get so big in the future.</p>",
        "id": 273146497,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645735035
    },
    {
        "content": "<p>I like this line of thought. In my ideal world, change proposals would come with PRs that we'd review and accept. Or they'd <em>lead</em> to PRs that we reviewed before accepting.  I understand there are lots of reasons why that's challenging, but I think it'd be a good goal in many cases.</p>\n<p>Also a corollary: for us to be productive, we need agreement about the \"right\" answer <em>and</em> someone who cares enough to do the work. If we don't have both, it might be worth closing issues or moving them into an \"insufficient interest\" state. Again, I understand there are lots of reasons why that's challenging, but we need to be realistic about what we can get done.</p>",
        "id": 273162809,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645744226
    },
    {
        "content": "<p>I agree with this and think we might even extend it to all workgroup FHIR issues.  I've been getting <span class=\"user-mention\" data-user-id=\"311999\">@Marc Duteau</span>  to do the M&amp;M tickets and there are a number where he comes back to me to say \"the group obviously knew what it meant when it wrote this resolution, but I don't\".  I then look at it and don't know either.  Having a definite PR or at least a well thought out disposition along with assigning it to someone to get it done would help across the organization.</p>",
        "id": 273164114,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1645745036
    },
    {
        "content": "<p>Yeah, I’d agree that having a definite PR would be the ideal but without that at the very least having much more descriptive dispositions and having someone on the hook for them is essential.</p>",
        "id": 273164904,
        "sender_full_name": "Marc Duteau",
        "timestamp": 1645745534
    },
    {
        "content": "<p>I expect most people who submit issues won't have the skill level to create PRs.  And I'm not sure we have to have a PR to resolve an issue.  But we should definitely not resolve an issue without the agreed wording being present or a description of the technical changes that's sufficient for someone to just go and make the change.  And agree that if we don't have someone willing to make the change, that's a sign that the change isn't super important (or that the juice isn't worth the squeeze).  Also, if there's an expectation that someone is signed up to apply the change on the day it's approved - and they'll get nagged by the group if it's not done in 4 weeks, the context of the change should still be fresh enough in everyone's mind that if there's an issue and the tracker needs to come back for discussion, we won't be starting at ground zero.</p>",
        "id": 273167886,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645747494
    },
    {
        "content": "<p>Is there any room for volunteers to help out?</p>",
        "id": 273172935,
        "sender_full_name": "Corey Spears",
        "timestamp": 1645751808
    },
    {
        "content": "<p>Absolutely</p>",
        "id": 273184381,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645758872
    },
    {
        "content": "<p>Currently for the ballot reconciliation of the IPA IG , we are following a process where no issue can be voted/resolved if a change is not applied. Is it possible to have a new flavor of \"assigned\" that doesn't result in a \"Feedback requested\" status?</p>",
        "id": 273277731,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1645819261
    },
    {
        "content": "<p>All things are 'possible', but that one's not easy.  When you say \"change is not applied\", do you mean pull request is created or what?  If you've assigned the issue for someone to create the pull request, that'd still technically be \"waiting for input\" - it's just 'technical' input rather than 'business' input.</p>",
        "id": 273278039,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645819428
    },
    {
        "content": "<p>I am wondering if there also needs to be a process change to avoid spending committee time on tickets that nobody will work on.  It is not a problem for tickets that get 'nominated' for review manually, since the person asking is a logical assignee, but I have doubts about the general 'oldest open ticket' view.  If the process is 'find ticket, read, understand, ask if someone is going to work on this', it is not much less time than the current voting process.</p>\n<p>For reference, my thinking was a possible process of defaulting to the 'mover' being on the hook for resolution (don't move things you aren't willing to do!  =).  But I realized that generally people would just... not make motions.  In that scenario, it would be fewer steps and less time wasted to mark everything 'not interesting' and only take up issues that people move out of that state.</p>\n<p>After more reflection, I think an issue is that a lot of tickets do not meet the bar of 'interesting enough to <em>volunteer</em> doing' - similar to how it is easier to find volunteers to hand out refreshments than to pick up garbage.  Would that be something HL7 could fund (e.g., assign to 'someone getting paid to fix this type of thing because nobody else wants to')?</p>\n<p>I think there is also a related issue that people ( <span aria-label=\"raised hand\" class=\"emoji emoji-270b\" role=\"img\" title=\"raised hand\">:raised_hand:</span>  =) do not have the bandwidth to consistently troll the open ticket lists and try to sort/find tickets - work I would put under the Project Manager umbrella..  I guess it leads to the same sort of question in my mind - if the process is failing today because people are not volunteering to do it, does it need to be a non-volunteer role?</p>\n<p>(note: been sitting on this a while before sending because I don't love the direction/conclusions I have... but posting anyway in case it helps crystalize anyone else's thoughts or that someone's response can get my thoughts unstuck  =)</p>",
        "id": 273284165,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1645822697
    },
    {
        "content": "<p>My company has funded a resource to go and implement tickets for MnM and Vocabulary.  I think that HL7 has funded resources in the past for other tickets.  So funding does help things go.</p>",
        "id": 273285582,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1645823600
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> that is kind of how THO works</p>",
        "id": 273285899,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645823816
    },
    {
        "content": "<p>many times people put in a CR becasue they don't know how to solve a problem. Might have multiple solutions, and want the committee to choose the one the committee woudl recommend</p>",
        "id": 273285959,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645823863
    },
    {
        "content": "<p>Yep.  I know that I also file tickets that I just generally notice when arbitrarily looking something up.  For those tickets, I am not particularly interested in fixing them myself, just trying to be a good citizen and let someone know there was an issue.  If I was on the hook for fixing everything I submitted, I would think twice about submitting issues (and three times for some WGs).</p>",
        "id": 273286142,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1645823997
    },
    {
        "content": "<p>I think the presumption that we will get backlog to zero every ballot is a fallacy.  but I think we should have a state for a ticket that is close to rejected, but just  shy of rejected. It stays in that state accumulating votes (or linkages to dups).</p>",
        "id": 273286406,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645824165
    },
    {
        "content": "<p>the watching flag that jira has I use to pile-on to an issue I think is important. We could make this concept of voting up/down much more easy and visible.</p>",
        "id": 273286466,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645824227
    },
    {
        "content": "<p>I'm not sure it's true that most of our tickets don't meet the bar of 'interesting enough to <em>volunteer</em> doing'.  We just haven't had a previous process of seeking people to do them at the time of resolving them.  Thus they all just sat there on the presumption that 'someone' (likely Grahame) would get to them eventually. </p>\n<p>The lack of triaging tickets is likewise a process issue.  If it's not identified as a) a prioritization, and b) an expectation for certain people to do the job, then \"triaging on calls\" becomes the default.</p>\n<p>I <em>think</em> we have enough interested &amp; technically capable people on the FHIR-I calls that we could keep up - if we have the right processes in place.</p>\n<p>My proposal would be something like this:</p>\n<ol>\n<li>Have an agreement amongst the co-chairs to perform triage of FHIR-I items on a regular basis (every 2 weeks?  every 4 weeks?).  Triage would look for issues that can have resolutions pre-defined, make sure that change request vs. technical correction is properly set, distinguish tooling from non-tooling and prioritize based on broken/enhancement/normative-impacting/whatever and (if determinable), identify the amount of effort/skill type needed to apply the proposed change.</li>\n<li>Our review filter would ensure we only look at items that are triaged, based on priority.</li>\n<li>We review all issues, however before we can vote to approve something we would need the resolution completely clear in terms of the wording or resource change (no hand-wavy stuff) and have a volunteer to make the change.</li>\n<li>If we have agreement on appropriateness of a change, we can tag those issues as \"needs-volunteer\" and let them sit for a month or two.  If there are no takers in that period, we can resolve as not-persuasive</li>\n<li>We review the list of items that have been assigned and no updates in 4 weeks as part of our call to see if something needs to be re-assigned or re-opened and marked as \"needs-volunteer\".</li>\n</ol>\n<p>The biggest issue is making sure we continue to stay on top of things.  If we stay on top, triaging shouldn't take more than an hour a month and, amongst the 10 or so regular participants we have that know how to apply changes, probably not more than 1-2 hours outside calls per month to apply changes.  It's possible that there'll be the odd major change that involves a mass change of resources and/or significant tooling work that will take some time to get to, but at least then those will be known 'BIG' items that can be scheduled by the volunteer and that we can monitor to see if they're happening when scheduled or not.</p>\n<p>I'm certainly not suggesting that funding doesn't help.  It may well be that some \"volunteer-needed\" issues will get assigned because the 'volunteer' who picks them up ends up being paid to do so by someone who has the incentive to make it happen.</p>",
        "id": 273287734,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645824961
    },
    {
        "content": "<p>I'm not super-fond of the notion of voting an issue up or down.  Say some organization puts 20 up-votes on an item - who cares?  If they're not willing to fund/do the work and no one else could be bothered, it's not going to happen.</p>\n<p>And we're not talking about getting backlog to zero.  But I <em>would</em> like to get \"volume of FHIR-I assigned issues that haven't been updated in 2+ months\" to zero.  Everything that comes in should end up either applied or rejected or punted to 'future use' in no more than 6 months.  I think <em>that</em> is fully achievable with the right processes and discipline.</p>",
        "id": 273288022,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645825128
    },
    {
        "content": "<p>Fair enough, though I think we also need to note that a better phrasing of 'interesting enough to volunteer doing' would be 'interesting enough to volunteer to setup the build environment locally, spend some time finding the correct source file, make a change that takes a few seconds, wait for a build that takes up to half an hour, submit a PR, wait for checks that can take <em>another</em> half hour, and then merge the PR'  ;-).</p>\n<p>A bit tongue-in-cheek, but I think it is relevant that even 'simple' tickets (e.g., fixing wording) still take a significant amount of time to apply.  The people that have all of that working and good processes/intuitions about batching changes are often the same people who are already swamped trying to work through items.</p>",
        "id": 273289289,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1645825899
    },
    {
        "content": "<p>I never realized that when a ticket is in a a proposed resolution status you can assign it, and it goes into a \"waiting for input\" state. Is it possible to distinguish when \"waiting for input\" is because of assignment to apply changes vs. when a clarification about the issue is needed?</p>\n<p>As to what does it mean to have the change pre-applied, I think a PR needs to be available, so we can look at the branch output and agree that the proposed resolutions is being met.</p>",
        "id": 273290799,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1645826691
    },
    {
        "content": "<p>The \"set up the build environment\" is, in theory, a one-time activity, though agree there can be occasional maintenance.  You don't actually have to run a full local build before submitting a PR if you're confident in your fix.  If you've messed with spreadsheets, you only need about the first 5 minutes of the build to re-gen the spreadsheets, at which point you're good for a commit.  You can also make a PR with commits for a bunch of separate changes.  I'm not saying the build process is 'pleasant', but it's manageable.</p>\n<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> - expectation is that when something's assigned, there's a comment that explains what is being asked of the assignee.  We could define a standard Grouping though if there was a desire.</p>\n<p>I agree that in <em>some</em> cases requiring a PR before voting to approve a change makes sense.  But I wouldn't want to put that in place as a general expectation.</p>",
        "id": 273291290,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645826990
    },
    {
        "content": "<p>Isn't this discussion broader than FHIR-I? I've got issues that have spent months or a year in triaged; or months or years in \"resolved - change required\" in various WGs. Perhaps this should be a FMG-level discussion, not just FHIR-I.</p>",
        "id": 273291383,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1645827023
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179280-fhir.2Finfrastructure-wg/topic/Minimizing.20backlog.20going.20forward/near/273289289\">said</a>:</p>\n<blockquote>\n<p>'Interesting enough to volunteer to setup the build environment locally, spend some time finding the correct source file, make a change that takes a few seconds, wait for a build that takes up to half an hour, submit a PR, wait for checks that can take <em>another</em> half hour, and then merge the PR'  ;-).</p>\n<p>A bit tongue-in-cheek, but I think it is relevant that even 'simple' tickets (e.g., fixing wording) still take a significant amount of time to apply.  The people that have all of that working and good processes/intuitions about batching changes are often the same people who are already swamped trying to work through items.</p>\n</blockquote>\n<p>Don't forget step 0: request a system from IT beefy enough to do a build on, and justify it by saying you need it for volunteer work.</p>",
        "id": 273291588,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1645827136
    },
    {
        "content": "<p>My leaning is to try out a system with FHIR-I (seeing as we appear to have the biggest problem).  If it works for us, the TSC could look at encouraging it to be used elsewhere.  However, different WGs have variable capacity.  With our WG, we have the benefit of 10-ish folks who can reasonably be asked to help apply changes.  For some work groups, that's only 2 or even just one.  (i.e. have a big enough machine and enough comfort with Git, the build process, messing with the technical artifacts, etc.)  So \"is there a volunteer\" defacto becomes \"Does Mary have time/interest?\"  That might still be the right question, but it's a more problematic one.</p>",
        "id": 273292159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645827503
    },
    {
        "content": "<p>I like Josh's solution shift the burden to commenter for CRs by forcing a PR. It would put the commenter's skin the game and dramatically reduce the number of trackers.  - problem solved !</p>",
        "id": 273543285,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646077505
    },
    {
        "content": "<p>I strongly object to that notion.  We want everyone in the world to identify things that need to be fixed or could be better.  We want the barrier to identifying issues to be as low as possible.  (Some would argue that needing to sign up for Jira and fill in the mandatory elements is already too high.)  There is <strong>no way</strong> we can expect most of the community who have issues to:</p>\n<ul>\n<li>understand how to submit Git PRs</li>\n<li>understand how we organize our source</li>\n<li>set up a build environment</li>\n<li>go through the steps of making the change and submitting a PR.</li>\n</ul>\n<p>If someone wants to submit a PR, that's great - though given that the agreed resolution after discussion is often different anyhow, having the PR doesn't necessarily save much time.</p>\n<p>Creating the PR is something that should fall on the work group - they're the ones who have the obligation to make the change and who have the understanding of how we maintain our source.</p>",
        "id": 273543949,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646077812
    },
    {
        "content": "<p>I would like to set a cutoff date. Any tickets that are not applied before cutoff date will be automatically move to next release.</p>",
        "id": 273544637,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1646078138
    },
    {
        "content": "<p>Not applied ticket will be drop as \"not needed\" after certain time frame because apparently no one cares about the resolution.</p>",
        "id": 273545078,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1646078337
    },
    {
        "content": "<p>That's also a bit problematic.  If we hit something that's badly broken and going to cause us grief in the next release, then we should fix it.  What might be better is a bias toward \"considered for future use\" on new new stuff unless we believe it's really important to have in R5.</p>",
        "id": 273545185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646078390
    },
    {
        "content": "<p>So enhancements and clarifications would be \"considered for future use\" unless someone can make the case for including them in R5 (which will typically mean agreeing to undertake the PR)</p>",
        "id": 273545471,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646078435
    },
    {
        "content": "<blockquote>\n<p>Yunwei Wang: I would like to set a cutoff date. Any tickets that are not applied before cutoff date will be automatically move to next release.</p>\n</blockquote>\n<p>I agree with the goal here.</p>",
        "id": 273545752,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646078568
    },
    {
        "content": "<p>Should we try a bit of micromanagement? We have the 2 hours on Mondays, so we could try something like this: </p>\n<ol>\n<li>A few people \"on duty\" who would prepare a local branch as we start the meeting (including the 10-15 min local build).</li>\n<li>During the first hour, as resolutions are approved, they are assigned to one of the participants on duty to apply to their branch. As each issue is applied, the branches are committed, built locally, and pushed (not as a PR, so no trigger for CI build).</li>\n<li>The second hour is used to finish applying all the decisions from the first hour, then merge all working branches into 1, and create one PR for that one branch, to trigger the CI build.</li>\n</ol>\n<p>Why multiple people? If the changes are related (same resource/page), they go to the same person. If we have changes that are not related, they can be applied in parallel.</p>\n<p>The idea is that a person would be \"on duty\" no more often than once a month. That way our commitment for Mondays is all that is needed to avoid stale decisions.</p>\n<p>I think this will avoid marking issues as \"resolved-change required\" without an actual resolution.</p>",
        "id": 273587344,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1646106086
    },
    {
        "content": "<p>Love this concept. Was discussing with <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> earlier today a similar idea. Slight differences:</p>\n<ul>\n<li>a \"working session branch\" would live on GH and participants could push their commits directly to it (i.e., we would not enable branch protection rules and would not create a PR into master until the session was coming to a close)</li>\n<li>we might use this technique during calls or outside of calls during times when we're trying to rapidly make progress against our backlog (e.g., with a weekly async cadence for \"sessions\" working through backlog).</li>\n</ul>",
        "id": 273588765,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646107698
    },
    {
        "content": "<p>I am exploring some tooling to try and help here too - I think the majority of  changes fall into a few buckets that could be made 'on rails' and would then not be able to break a build (e.g., changing page text needs HTML validation and verification of any links added, but doesn't affect anything else, changing the description of an element is the same, etc.).</p>\n<p>The goal is to have something to lower the bar for 'simple' changes*, then someone who has the full build tooling and knowledge to fix any build issues can validate everything before it gets merged in.</p>",
        "id": 273668483,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1646152261
    },
    {
        "content": "<p>I just think having one person per \"session branch\" is easier, because you avoid any possibility of merging until each branch is done, then you can merge once locally, build and then create the PR.</p>",
        "id": 273669412,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1646152634
    },
    {
        "content": "<p>Maybe this has been brought up in the past, but the connectathons can be used as informal hack days to work through making changes.  Or, schedule once a month sessions?</p>",
        "id": 273755420,
        "sender_full_name": "Scott Fradkin",
        "timestamp": 1646196630
    }
]