[
    {
        "content": "<p>MetadataResource is normative. But RelatedArtifact is not. I don't know how this slipped by us in R4. </p>\n<p>Do we have a list of Datatypes that are going normative in R5? RelatedArtifact needs to. Though I think it's underdone...</p>",
        "id": 272332937,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645136511
    },
    {
        "content": "<p>It's definitely underdone.  Would it be a technical correction to flag it as non-normative given that the data type is non-normative?</p>",
        "id": 272340890,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645141707
    },
    {
        "content": "<p>well, vocab just moved to make CodeSystem, ValueSet and ConceptMap depend on MetadataResource</p>",
        "id": 272348739,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645147908
    },
    {
        "content": "<p>so no, we better not make it non-normative. I think we could consider marking the element non-normative.</p>",
        "id": 272348801,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1645147936
    },
    {
        "content": "<p>Making it normative when the type has problems isn't a good plan.  If we mark the element non-normative, then having the type non-normative isn't a problem.</p>",
        "id": 272412315,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645196670
    },
    {
        "content": "<p>We're planning to take Library  normative, so that's <a href=\"https://build.fhir.org/metadatatypes.html#UsageContext\">UsageContext</a>, <a href=\"https://build.fhir.org/metadatatypes.html#RelatedArtifact\">RelatedArtifact</a>, <a href=\"https://build.fhir.org/metadatatypes.html#ParameterDefinition\">ParameterDefinition</a>, and <a href=\"https://build.fhir.org/metadatatypes.html#DataRequirement\">DataRequirement</a></p>",
        "id": 272412967,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1645196977
    },
    {
        "content": "<p>Agree that RelatedArtifact needs work, but also happy to mark that element as TU in Library.</p>",
        "id": 272413110,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1645197038
    },
    {
        "content": "<p>UsageContext is currently TU.  Do you feel ParameterDefinition and DataRequirement are ready to lock down?</p>",
        "id": 272413893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645197465
    },
    {
        "content": "<p>ParameterDefinition is pretty simple and we haven't needed to expand it so far, so I feel good about that one. DataRequirement has had some changes in R5 but they are backwards compatible and introduce new capability. We could potentially keep those new things TU, but overall I'd say yes.</p>",
        "id": 272417962,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1645199382
    }
]