[
    {
        "content": "<p>OK, so I just ran this fun exercise looking at bundle reference resolution logic (live<a href=\"https://youtu.be/ZK0AKB5PqGM\">-stream</a>; led to <a href=\"http://jira.hl7.org/browse/FHIR-29271\">FHIR#29271</a> that I created just now).</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ZK0AKB5PqGM\" href=\"https://youtu.be/ZK0AKB5PqGM\"><img src=\"https://i.ytimg.com/vi/ZK0AKB5PqGM/default.jpg\"></a></div><p>Then I realized: this feels really familiar. I found <a href=\"http://jira.hl7.org/browse/FHIR-18235\">GF#18235</a> from 2 years ago, where we had agreed to make improvements to the documentation for R4. The history shows the change as \"Applied\" on 2018-10-14, but when I review <a href=\"https://github.com/HL7/fhir/commits/master/source/bundle/bundle-notes.xml\">https://github.com/HL7/fhir/commits/master/source/bundle/bundle-notes.xml</a> I see no changes mentioning issue <a href=\"http://jira.hl7.org/browse/FHIR-18235\">GF#18235</a>.</p>",
        "id": 213602799,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602875904
    },
    {
        "content": "<p>This is a super-manual process, so it's easy to see how things get out of sync. Maybe more of an FMG question, but I'm curious if folks have practices they've seen for keeping track of these kinds of things without two-sided manual data entry.</p>",
        "id": 213602868,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602875958
    },
    {
        "content": "<p>Did you notice the comment where Grahame referenced <a href=\"https://github.com/HL7/fhir/commit/c9067ba302\">GH#c9067ba302</a> as (presumably) the commit that applied the changes?</p>",
        "id": 213614725,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1602882693
    },
    {
        "content": "<p>I missed that -- good catch! (Though in any case, that commit doesn't contain the changes in question.)</p>",
        "id": 213615567,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602883181
    },
    {
        "content": "<p>when I apply changes, I forward the list of CR that I applied to the workgroup mailing list. Asking them to confirm they see the change I made and to point out any mistakes.  I include the list in the minutes of the next t-con too. I am not confident that anyone does this, but it gives them a chance to check-my-work. I have always been uncomfortable being the only one to check that I made the change. BUT, adding more overhead seems a step too far.</p>",
        "id": 213653042,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602942876
    },
    {
        "content": "<p>Yeah, that's a great example of a practice that spreads responsibility / checking a bit. I'm not saying we need to formalize something like this, but it's good to think about.</p>",
        "id": 213659935,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602953163
    },
    {
        "content": "<p>I'm not sure what else we could do to guard against mistakes - presumably I made one</p>",
        "id": 213989981,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1603234895
    },
    {
        "content": "<p>I certainly did.</p>",
        "id": 213990049,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1603234929
    },
    {
        "content": "<blockquote>\n<p>I'm not sure what else we could do to guard against mistakes </p>\n</blockquote>\n<p>I mean, John's example is a good one, for what we could do -- it's basically the equivalent of \"code review\" (having someone other than the author review changes before merging), which is a standard practice in software engineering.</p>",
        "id": 214072993,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603296316
    },
    {
        "content": "<p>(I understand that trying to do this across all changes in FHIR would be untenable, because it would create a terrible bottleneck. But it's something we could experiment with for purely editorial changes, for instance.)</p>",
        "id": 214073117,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603296359
    },
    {
        "content": "<p>FWIW we do practice this in a few low-traffic areas; we use GH approvals for every pull request on bulk data (<a href=\"https://github.com/HL7/bulk-data/pulls?q=is%3Apr+is%3Aclosed\">https://github.com/HL7/bulk-data/pulls?q=is%3Apr+is%3Aclosed</a> for example). And while <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> would probably say that 80% of the time these reviews add no value, we do occasionally catch stuff ;-)</p>",
        "id": 214073465,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603296475
    },
    {
        "content": "<p>note that my process does not have them reviewing a PR. they just get to review the results and I will fix anything they find .</p>",
        "id": 214224347,
        "sender_full_name": "John Moehrke",
        "timestamp": 1603389542
    }
]