[
    {
        "content": "<p>Please take note of the <a href=\"/user_uploads/10155/8kJxa9SE1hG0UAGwr_5q-WoZ/FSH-Block-Vote-1-Proposed-6-8-2020.xlsx\">enclosed spreadsheet</a> with a proposed block vote for FHIR Shorthand, tentatively scheduled for June 8.  It contains 39 issues , all considered \"low hanging\".  <br>\nOne word of explanation: Several of the issues have resolution of \"not related\". These issues addressed the non-normative content (for example, questions about SUSHI or typos in the tutorial). This does not mean the comment was ignored; in fact, most of these issues contained very good suggestions that have been or will be applied.  But the issues didn't concern the FSH specification itself. <br>\nPlease let me know if you would like anything removed for further consideration.</p>",
        "id": 199199888,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1590780122
    },
    {
        "content": "<p>As a rule, we typically on bother marking things as 'not related' in situations where we're not making the change or when we're dealing with a normative ballot.  Otherwise, we're just creating extra work of having the issues re-submitted outside of ballot for us to be able to track applying the changes.</p>",
        "id": 199201515,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590780908
    },
    {
        "content": "<p>Is this the meeting that the vote will occur in? <a href=\"http://www.hl7.org/concalls/CallDetails.aspx?concall=47932\">http://www.hl7.org/concalls/CallDetails.aspx?concall=47932</a></p>",
        "id": 199628383,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591195486
    },
    {
        "content": "<p>Yes. This is the webmeeting link: <a href=\"https://global.gotomeeting.com/join/696476549\">https://global.gotomeeting.com/join/696476549</a></p>",
        "id": 199686359,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1591224250
    },
    {
        "content": "<p>Here is a URL that should get you directly to the list of issues in Block Vote #1: <a href=\"https://tinyurl.com/y73rox7s\">https://tinyurl.com/y73rox7s</a></p>\n<p>It resolves to this JQL:</p>\n<div class=\"codehilite\"><pre><span></span><code>project = &quot;FHIR Specification Feedback&quot; AND Specification = &quot;Shorthand (FHIR) [FHIR-shorthand]&quot; AND Grouping = Block-Vote-1 ORDER BY key DESC\n</code></pre></div>",
        "id": 199878105,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591364881
    },
    {
        "content": "<blockquote>\n<p>As a rule, we typically on bother marking things as 'not related' in situations where we're not making the change or when we're dealing with a normative ballot.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- what resolutions should be used for comments on informative-only material in an STU ballot?  The same as for the official STU content?  If so, is there another way to easily distinguish informative vs STU comments and resolutions -- since I think there are different rules regarding follow-up on those?</p>",
        "id": 199905582,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591376294
    },
    {
        "content": "<p>There aren't really any differences to resolution process.  If something is specifically out of scope for a ballot, you can find the 'ballot' part of the comment non-related, but the proposed change would need to be resolved eventually anyhow.  Whether content is normative track or informative doesn't impact the ability to pass ballot.</p>",
        "id": 199906486,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591376754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am not completely clear on what you are saying (maybe you meant \"you can find the <em>non-</em>ballot part of the comment non-related\"?)  Regardless, the comments related to non-normative content have largely been pre-applied to the non-normative content, and I think in spirit that's what is intended.</p>",
        "id": 200092598,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1591620856
    },
    {
        "content": "<p>Jira has two pieces - specification feedback and ballot votes.  (Right now, the latter are imported via spreadsheet, but eventually users will 'vote' directly in Jira.)  The notion of \"not related\" is tied to the ballot (i.e. is the feedback linked to the ballot vote part of the scope of the specified ballot).  However, the 'feedback' item is against the spec overall and, so long as the feedback is about anything FHIR, there's an expectation the relevant work group will deal with it eventually - they just don't have to deal with it as part of the scope of the ballot and therefore it's not mandatory to deal with it before publication.</p>\n<p>If you've received feedback and you're making the changes, then find the comment persuasive and mark it applied.  Whether the content was normative track or not doesn't really matter.</p>",
        "id": 200102645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591625581
    },
    {
        "content": "<p>I've made the requested changes and would like to re-propose Block Vote #1. Specifically, those issues previously marked \"Not Related\" have been changed to conventional labels (\"Persuasive\", \"Not Persuasive\", etc.) <a href=\"/user_uploads/10155/ZZJoynbvRFLuFCbT2a0STFb_/FSH-Block-Vote-1-Proposed-6-11-2020.xlsx\">FSH-Block-Vote-1-Proposed-6-11-2020.xlsx</a>.  When is the next opportunity to vote on this?</p>",
        "id": 200588738,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1591901315
    }
]