[
    {
        "content": "<p>In follow-up to our meeting from Monday, I have updated the PSS in and pasted the link here... <a href=\"https://jira.hl7.org/browse/PSS-1666\">https://jira.hl7.org/browse/PSS-1666</a>.  Feedback appreciated...</p>",
        "id": 212678146,
        "sender_full_name": "Patrick Murta",
        "timestamp": 1602158403
    },
    {
        "content": "<blockquote>\n<p>support for push and pull models in synchronous and asynchronous patterns</p>\n</blockquote>\n<p>should you add subscriptions to the list?</p>",
        "id": 212739651,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602185998
    },
    {
        "content": "<p>I think the most obvious other question is 'who will be involved in trailing the project, and what would their and the project's success criteria look like'?</p>",
        "id": 212739831,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602186082
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>support for push and pull models in synchronous and asynchronous patterns</p>\n</blockquote>\n<p>should you add subscriptions to the list?</p>\n</blockquote>\n<p>I have been using \"data source initiated, and data recipient initiated\" as a more inclusive expression. That includes subscriptions (which are data source initiated).</p>",
        "id": 212757922,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1602196784
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"196338\">@Patrick Murta</span> for sharing updates here!</p>\n<blockquote>\n<p>Our goal is to provide a model which supports a hybrid model of point to point interaction as well as intermediary brokered interaction without the actors in either side needing detailed knowledge of how intermediary routing works.</p>\n</blockquote>\n<p>Just to check: I assume the <em>intermediaries themselves</em> do/must have knowledge of these details? If that's right, is the goal goal here to standard the actor::intermediary interface or the intermediary::intermediary interface?</p>",
        "id": 213049102,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602514700
    },
    {
        "content": "<blockquote>\n<p>The planned approach is to create an IG which uses the model described as part of Custom Headers</p>\n</blockquote>\n<p>Is there an initial sense of the scope for this IG? Universal, US Realm, or other?</p>",
        "id": 213049193,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602514757
    },
    {
        "content": "<p>Other framing comment: generally the Internet already provides a model where a given actor doesn't need to know about intermediary hops along the network. I'd find it helpful if you can add a sentence or two explaining why client::intermediary behavior would need to change for this \"hybrid model\" to work (vs the common pattern where clients talk to servers, and the servers may be transparent proxies or may respond directly -- and either way the client doesn't need to worry).</p>",
        "id": 213050004,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602515087
    }
]