[
    {
        "content": "<p>(I have no idea where to put this so feel free to move it)  How do you decide some thing should be a resource or a datatype?  Seems to me there is gray.  Like ValueSet, TriggerDefinition, StructureDefinition,  and more.  what is the logic beyond the decision?  Have you ever promoted a data type to a resource or demoted a resource to a data type before?</p>",
        "id": 200774549,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1592066523
    },
    {
        "content": "<p>Also, resources have maturity levels but datatypes do not appear to .  I can't imagine that we never add datatypes - which would therefore be quite immature - how is that tracked?</p>",
        "id": 200774773,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1592066820
    },
    {
        "content": "<p>Some of the thought process is here: <a href=\"https://confluence.hl7.org/display/FHIR/Resource+Considerations\">https://confluence.hl7.org/display/FHIR/Resource+Considerations</a><br>\nOne key consideration I didn't see on that page is that resources maintain independent state.</p>",
        "id": 200784520,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592080620
    },
    {
        "content": "<p>Wow - that is interesting as well as the surrounding pages but you comment makes the most sense - I guess its state and identity.  Thank you.  Also, what about maturity of data types - I am guessing every once in a while, there is a new datatype.  My brain was a little blown by datatypes referencing resources.</p>",
        "id": 200787890,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1592086051
    },
    {
        "content": "<p>The bulk of the data types are now normative.  There a few minor additions expected but not a lot.  Most of the new data type content will likely be in complex re-useable structures like Dosage.</p>",
        "id": 200790957,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592091678
    },
    {
        "content": "<p>Oh thats good.  I also observed that contained resources feel a bit like data types and seem to be reused in other resources.  Do you ever have contained resource versus datatype discussions?</p>",
        "id": 200829021,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1592161379
    }
]