[
    {
        "content": "<p>I have started the process of reworking CapabilityStatement by publishing <a href=\"http://build.fhir.org/capabilitystatement2.html#resource\" target=\"_blank\" title=\"http://build.fhir.org/capabilitystatement2.html#resource\">http://build.fhir.org/capabilitystatement2.html#resource</a>, which is the current CapablityStatement with most non-normative content removed</p>",
        "id": 166675624,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559007073
    },
    {
        "content": "<p>I have got the updated CapabilityStatement2 publishing now - see <a href=\"http://build.fhir.org/capabilitystatement2.html\">http://build.fhir.org/capabilitystatement2.html</a></p>\n<p>This contains an early and rough draft of what a reworked CapabilityStatement would look like, orientated towards feature negotiation rather than adding more and more flags around system behavior.</p>",
        "id": 210904504,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600795852
    },
    {
        "content": "<p>FHIR-I discussed this in committee yesterday, and agreed to follow up discussion here, along with a connectathon around this in January.</p>",
        "id": 210904588,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600795893
    },
    {
        "content": "<p>this is the place for the discussion.</p>",
        "id": 210904609,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600795899
    },
    {
        "content": "<p>The current proposal is focused on the REST API - are other APIs in scope? Since OperationDefinition covers operations, would features be appropriate there as well?</p>",
        "id": 210905764,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1600796418
    },
    {
        "content": "<p>yes, I think features are appropriate in OperationDefinition and SearchParameter too.</p>",
        "id": 210906421,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600796710
    },
    {
        "content": "<p>I'm not sure about other APIs. What other API are you interested in? As far as I know, all the potential APIs we could talk about fall under CS+OD+SP?</p>",
        "id": 210906577,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600796766
    },
    {
        "content": "<p>I can see a use for it in Library, we are currently exposing similar functionality for CQL (what features of the language are required to run this expression, and what capabilities does this engine support).</p>",
        "id": 210923419,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1600804744
    }
]