[
    {
        "content": "<p>new FHIR-I agenda item next week: I have updated the v2 and v3 code systems and value sets to use a canonical root of <a href=\"http://terminology.hl7.org\" target=\"_blank\" title=\"http://terminology.hl7.org\">http://terminology.hl7.org</a>. Now we have to consider what - if any - of the FHIR code systems and terminologies will get the same treatment</p>",
        "id": 153975974,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531890235
    },
    {
        "content": "<p>What would be the rationale for not moving all of them?</p>",
        "id": 153975988,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531895712
    },
    {
        "content": "<p>well, I think there's an authority question</p>",
        "id": 153975993,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531897626
    },
    {
        "content": "<p>we haven't talked about which thing swill be in UTG</p>",
        "id": 153975994,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531897641
    },
    {
        "content": "<p>well, I applied the change to the code systems.... took my 22 hours solid work... I've run out of steam to apply it to the value sets, so that probably misses R4 now. But I'm a little bit happy about that - we need to talk about which value sets make sense in UTG and which in fhir. In particular, the example terminology stuff, I feel like it doesn't belong in utG</p>",
        "id": 153978197,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532581907
    },
    {
        "content": "<p>It depends on the example value set.  There are some \"useable\" example value sets that are only not \"recommended\" because we didn't want favorites.  Those are reasonable to be in UTG because they're useful.  There are also some true \"example\" example value sets that are made-up or just picking some arbitrary codes from existing code systems to show what's possible.  Those shouldn't be in UTG.  Perhaps we need different binding strengths to distinguish?</p>",
        "id": 153978312,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532609475
    },
    {
        "content": "<p>maybe we should distinguish them by the experimental flag? anyway, for now, it's an R5 issue</p>",
        "id": 153978314,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532609558
    },
    {
        "content": "<p>Can we fix the ones that are going Normative?</p>",
        "id": 153978317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532609615
    },
    {
        "content": "<p>(in R4)</p>",
        "id": 153978319,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532609627
    },
    {
        "content": "<p>aren't any I think. I'll check</p>",
        "id": 153978320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532609638
    },
    {
        "content": "<p>k</p>",
        "id": 153978321,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532609643
    },
    {
        "content": "<p>Also, this seems like a change we could make after the ballot opens for the non-normative stuff - especially if we include a note to balloters that it's going to happen.  Waiting 1.5 years for the transition to the new ValueSet URLs is going to create some challenges for UTG (and us).  (And the longer we wait, the worse it's going to be.)</p>",
        "id": 153978339,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532610630
    }
]