[
    {
        "content": "<p>As discussed on today's call, FHIR-I has over 700 changes waiting to be applied to the core specification.  <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> has agreed to take those related to StructureMap/Mapping language.  I've taken all those related to Questionnaire, QuestionnaireResponse and schematron.  I've left all the tooling-related ones to Grahame.  That still leaves about 500 changes, many of which can be done by anyone.  We need volunteers to assist because there's no way Grahame can do all of them (or probably even half).</p>\n<p>I've categorized them in 4 priority levels:<br>\n<strong>Highest</strong> priority are the technical corrections for R4 that ought to be included in R4B.  These need to be applied to the R4B branch by about the end of February (and should be applied to R5 at the same time - just submit your branch as a PR against both).<br>\n<strong>Very High</strong> priority are the changes to normative artifacts which are either substantive, or occasionally non-compatible.  We <em>really</em> want those applied before our final freeze deadline for the R5 \"for comment\" ballot by end of March<br>\n<strong>High</strong> priority are all other changes to normative artifacts wish <em>should</em> be in by end of March and definitely needed before the R5 ballot deadline mid-July<br>\n<strong>Medium</strong> priority are all changes to non-normative artifacts which are substantive or breaking and must be in by mid-July<br>\n<strong>Low</strong> priority are all non-substantive changes to non-normative artifacts which <em>should</em> be made by mid-July, but in theory we could apply later</p>\n<p>If you find something you're sure that only Grahame can do, assign it to him.  He'll likely tackle these first.</p>\n<p>When working on a resource or page to do higher-priority items, please scan for other stuff on the same page/in the same artifact.  If you can knock off some easy low priority items at the same time, please do.  Please tie your commits to the tracker items fixed and be sure to mark them as 'Applied'.</p>\n<p>When you're working on something, assign it to yourself so we don't duplicate work.  (But don't assign something to yourself unless you're actually going to work on it and commit it in a reasonable timeframe.)</p>\n<p>If you don't have commit privileges or ability to mark things as 'Applied' in Jira and would like to help out, send me a PM.</p>\n<p>The list of outstanding tracker items is here: <a href=\"https://jira.hl7.org/issues/?filter=13755\">https://jira.hl7.org/issues/?filter=13755</a></p>\n<p>If you have questions, shout.</p>",
        "id": 226469396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613448628
    },
    {
        "content": "<p>I'll go through the subscriptions-related ones this week; most are applied (from before I had access to update the tickets).  I think that's about 25 more off the list (if my local count is correct).</p>",
        "id": 226522856,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1613487478
    },
    {
        "content": "<p>Regarding changes that need to be applied to R4B as well as R5 -- I don't think it will be possible to submit a single pull request for both purposes, but we can \"git cherry-pick\" specific commits once they have been merged into R4B. For example, we might want to create pull requests against R4B and apply a specific label like \"needs R5 cherry pick\" in github. Then we can go through and update the labels to indicate status as we perform the cherry picking.</p>",
        "id": 226530630,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1613490850
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : I would like to confirm the process:<br>\n1) select a ticket from <a href=\"https://jira.hl7.org/issues/?filter=13755\">https://jira.hl7.org/issues/?filter=13755</a><br>\n2) assign the ticket to myself<br>\n3) create a branch from master@HL7/fhir repo<br>\n4) fix StructureDefinition xml <br>\n5) create a PR review (I am not sure here. Is it one PR per ticket or not necessary?)<br>\n6) change the ticket to applied (is this before PR or after merge?)</p>",
        "id": 226755100,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1613612950
    },
    {
        "content": "<ol start=\"5\">\n<li>Commit your branch and in your commit, indicate the ticket(s) addressed</li>\n<li>Create a pull request against the core spec from your branch</li>\n<li>Add a comment indicating the PR # associated with the ticket(s)</li>\n<li>Once merged, mark the tickets as applied</li>\n</ol>",
        "id": 226755682,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613613472
    },
    {
        "content": "<p>I saw some of them were already fixed in R5, like this one: <a href=\"https://jira.hl7.org/browse/FHIR-25262\">https://jira.hl7.org/browse/FHIR-25262</a> though the ticket status is still \"RESOLVED - CHANGE REQUIRED\". What do we do with those ticket?</p>",
        "id": 227097294,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1613834212
    },
    {
        "content": "<p>If it's already done, just mark it as applied</p>",
        "id": 227105482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613842158
    },
    {
        "content": "<p>(in Jira)</p>",
        "id": 227105486,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613842161
    }
]