[
    {
        "content": "<p>I think we can use this stream for the discussion about streamlining the resources we have, as a possible alternative to the resources that are drafted now. Depending on the feedback, we can find other methods but I presume we can start here.</p>",
        "id": 216054194,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604910435
    },
    {
        "content": "<p>This is an exploration of an alternative which I think is needed. I'd like the resources to be supporting IDMP but other models, and not only regulatory aspects but also clinical (prescribing and monitoring)</p>",
        "id": 216054356,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604910530
    },
    {
        "content": "<p>Some starting topics I'm working on:</p>\n<ol>\n<li>Fusion of the MedicinalProductDefinition, AdministrableProductDefinition and PackagedProductDefinition resources. There's some overlap of attributes.</li>\n</ol>",
        "id": 216054861,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604910868
    },
    {
        "content": "<p>Practical impact of this fusion to IDMP implementers: none - each IDMP concepts (PhP, MP, PP) is simply a profile of this resource type.<br>\nPractical impact of this fusion to other implementers that already exist (SNOMED, the many national concepts, others) - It allows to also profile such concepts, without a lot of extensions or contained resources.</p>",
        "id": 216055033,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604910996
    },
    {
        "content": "<p>hi Jose, some feedback:</p>\n<p>Firstly, the proposal you mention here is already a subject of a Jira you have raised (perhaps you can add a link to it for us). There are some specific and significant comments on there that may help guide us. </p>\n<p>Secondly you are saying that there are no <em>practical</em> impacts to what you are suggesting.</p>\n<p>I believe the impacts are wholly practical. </p>\n<p>They are practical in the sense of no conceptual difference but actual difference in the experience of use.</p>\n<p>Using distinct resources vs having to create the same concepts by profiling is exactly a practical issue. </p>\n<p>It may not be a logical or conceptual one, but it is a practical one. The model you create will be equivalent, but more abstract and will need practical work to tailor it for each use case.</p>\n<p>Of course there is a continuum of ways to model this, from one extreme to the other. You can do it like the Common Product Model and the RIM. Or you can do it like most of FHIR where common domain concepts have their own resources (e.g. Condition, Observation, Procedure - those have a lot in common but we don't expect people to profile them from an abstract concept before using them).</p>\n<p>I believe what we have is a good compromise that fits what implementers (regulatory and otherwise) tell us they need. No other set of resources in FHIR insists on using profiles to support the basic use cases found in the domain (though further resource specific profiling is always sensible).</p>\n<p>For example the stakeholders I'm in touch with, and some common industry models, do want a clear distinction between product and pack at resource level, so there will be some push back on removing the package resource that implementers are currently using.</p>\n<p>Thirdly, for the work proposed, rather than suggesting the solution first, I would suggest stating the requirements and aims first, then looking for a solution that addresses it. Otherwise it is not clear what is trying to be achieved. Changing (or proposing an alternative to) the current models is not a goal in its own right - it’s a solution to some issue. Let’s articulate what that issue is.</p>",
        "id": 216068074,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604919175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> I'd like to have a topic that is focused on the changes and ideas. For meta-discussions we can open a parallen discussion. I want this to be a clean discussion if possible. Here we can comment on the changes.</p>",
        "id": 216068425,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604919392
    },
    {
        "content": "<p>3 points directly about the changes:</p>\n<ul>\n<li>We have existing comments on the exact changes proposed, we need to consider those</li>\n<li>The changes proposed have practical impacts that we must consider in the evaluation</li>\n<li>We need to have a rationale for the changes to be able to evaluate the changes</li>\n</ul>",
        "id": 216069240,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604919903
    },
    {
        "content": "<p>If this is about \"what to change\" - here is a good place. If this is about \"whether/how\", not here please</p>",
        "id": 216069304,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604919956
    },
    {
        "content": "<p>So back on topic: I'm thinking of drafting a single resource that would be a MedicinalProductDefinition that includes the non-duplicate attributes from the AdministrableProduct and the PackagedProductDefinition</p>",
        "id": 216069422,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604920027
    },
    {
        "content": "<p>Except the \"Package\" part in PackagedProductDefinition - that would perhaps be better as a separate resource</p>",
        "id": 216069536,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604920087
    },
    {
        "content": "<p>okay - please let us know what problem that solves, so that we can know if you have solved it better than the existing solution</p>",
        "id": 216069603,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604920141
    },
    {
        "content": "<p>It will be in the design after the resources are drafted.</p>",
        "id": 216069643,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604920166
    },
    {
        "content": "<p>It's hard to comment at this point then, if we don't know what you are trying to achieve</p>",
        "id": 216069799,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604920249
    },
    {
        "content": "<p>You don't need to comment yet, please let us work towards an alternative and then we compare</p>",
        "id": 216069884,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604920319
    },
    {
        "content": "<p>So, again on the key initial ideas, here's my expected target:</p>\n<ol>\n<li>Merge the xxxDefinition resources - saving duplicate files while still allowing for profiles to provide the same functionality.</li>\n<li>Package would be its own resource</li>\n</ol>",
        "id": 216070138,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604920444
    },
    {
        "content": "<p>some questions</p>\n<ol>\n<li>Does a Package point to a Product or  a Product point to a package? I think it is a Package that points to a Product, but I'd hope for feedback</li>\n</ol>",
        "id": 216070225,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604920501
    },
    {
        "content": "<ol start=\"2\">\n<li>in AdministrableProductDefinition.routeOfAdministration - when merging, should that rather be of Dosage datatype, instead of a backbone element with all the attributes?</li>\n</ol>",
        "id": 216070553,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604920707
    },
    {
        "content": "<p>#1 A product has packages, that it the logical direction. But there is the possibility to represent this logical link in two physical directions. \"product has a (child) package\" and \"package has a (parent) product\". The packages come and go more often, so there is a rationale to allow them to reference the product rather than the other way around. Compare to Patients having encounters, but the physical link goes the other way, because you don't want to update Patient continually. Both physical directions of product to pack are possible currently, but there is only one direction conceptually.</p>",
        "id": 216070760,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604920840
    },
    {
        "content": "<p>#2 this is already merged. Route is not a dosage.</p>",
        "id": 216070833,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604920906
    },
    {
        "content": "<p>#1 Yes, I think Package resource would point to the Product - this would go well with other products that have a package</p>",
        "id": 216072198,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604921713
    },
    {
        "content": "<p>#2 the Dosage data type has some (most?) of the attributes of what is called \"routeOfAdministration\". I think there's potential for reuse</p>",
        "id": 216072317,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604921771
    },
    {
        "content": "<p>You may need to define what you see as route of administration. When I have seen it it is usually just a code for a route. e.g. oral, intravenous, etc. CodeableConcept has the necessary attributes for the use cases I am familiar with.</p>",
        "id": 216072498,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604921887
    },
    {
        "content": "<p>what the current resource defines as \".routeOfAdministration\" looks a lot like a Dosage which includes the route of administration<br>\n<a href=\"http://hl7.org/fhir/dosage.html#Dosage\">http://hl7.org/fhir/dosage.html#Dosage</a></p>",
        "id": 216073004,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604922207
    },
    {
        "content": "<p>ah you mean the backbone itself. Yes some of those could be done using Dosage, but it would be overkill and less convenient. A quantity is already a reusable datatype.</p>",
        "id": 216073229,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604922354
    },
    {
        "content": "<p>Why \"overkill and less convenient\"? We'd reduce the number of elements</p>",
        "id": 216073496,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604922494
    },
    {
        "content": "<p>it would need multiple Dosages, and a way to tell them apart. Reducing the number of elements is not a design goal in itself.</p>",
        "id": 216073610,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604922565
    },
    {
        "content": "<p>The most convenient thing is when you have the exact named concept you need and the exact datatype for it. Other more general solutions are less convenient, but if wider uses cases are needed, they may be preferable. It's a balance. If there are no other use cases then there is no need to change it.</p>",
        "id": 216073835,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604922672
    },
    {
        "content": "<p>Let me make a proposal about that. I retain the requirement - there need to be multiple dosages/routes.</p>",
        "id": 216073972,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604922747
    },
    {
        "content": "<p>I will try to use Dosage in the merged resource.</p>",
        "id": 216073996,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604922761
    },
    {
        "content": "<p>I'll ping back once I have any idea what to do with Species there.</p>",
        "id": 216074045,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604922792
    }
]