[
    {
        "content": "<p>Hi all, </p>\n<p>We are currently working on implementing a FHIR API for distributing medicinal products for the Norwegian Medicine Agency to hospitals. In order to use off the shelf software for the API we will use R4. </p>\n<p>I have started the profiling of PackagedProductDefinition and have some questions regarding the thought of using the identifier data type for \"Data Carrier Identifier\".  Besides just the code, there has been identified the need for; </p>\n<ol>\n<li>a status (an identifier can at least have the status of active or to-be-expired)</li>\n<li>last modified date (not sure of the actual need here, waiting for feedback)</li>\n<li>an indication of the standard used (GS1 standards:  ntin or gtin)</li>\n</ol>\n<p>I'm quite new to FHIR, so, can I use the \"use\" and \"type\" (on identifier) for number 1 and 3? Or should I create an extension? Or any other thoughts? </p>\n<p>I'm publishing my work here: <a href=\"https://simplifier.net/safest\" target=\"_blank\" title=\"https://simplifier.net/safest\">https://simplifier.net/safest</a>, any comments are highly appriciated</p>",
        "id": 188004304,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1581509716
    },
    {
        "content": "<p>hi Stine</p>\n<p>In FHIR R4 the IDMP Data Carrier Identifier is MedicinalProductPackaged.packageItem.identifier. </p>\n<p>It's a FHIR identifier type, so you do get  \"use\", \"period\", \"assigner\" in there as well as the \"type\" and the \"system\" (and of course a \"value\"). The standard used (e.g. gtin) would go in the \"system\", using a pre-defined URI. </p>\n<p>There is no status, or last modified date though. It is possible that by going to the actual GS1 system those may be found, but I can see that you may want them directly in FHIR. FHIR uses identifiers rather than defines them, perhaps, so it doesn't really have things like \"last modified\".</p>\n<p>identifier.use may be useful, but it has a fixed set of values. Perhaps the pair of \"usual\" and \"old\" would cover it? But if you need more, it's probably going to need an extension. And there is nowhere obvious to put last modified date. </p>\n<p>So that does probably mean having an extension on the datatype itself. If you extend just the packageItem, it will be hard to know which identifier it is talking about, if you still need multiple identifiers (identifier is 0..*).</p>\n<p>There is a standard extension for identifier.validDate which could also possibly be useful (but it's not really the same as lastModified), and if not it may make a good template for your own extensions: <a href=\"http://hl7.org/fhir/extension-identifier-validdate.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-identifier-validdate.html\">http://hl7.org/fhir/extension-identifier-validdate.html</a></p>",
        "id": 188011566,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1581515894
    },
    {
        "content": "<p>Thanks Rik! That helps alot.</p>",
        "id": 188082380,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1581576189
    }
]