[
    {
        "content": "<p>I want to use some of these resources, and I want to understand them. <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> , others(?) What is the best way to discuss?<br>\nI just found a small issue in MPDefinition.indication (should refer to ClinicalUseIssue) but this gave me more questions e.g.: </p>\n<ul>\n<li>Why do we have MPDefinition.indication as text, but ClinicalUseIssue as a separate set of resources? Is MPDefinition.indication going to contain the concatenation of all the ClinicalUseIssues.description?</li>\n</ul>",
        "id": 206898982,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597382122
    },
    {
        "content": "<ul>\n<li>the package concept in PackagedProductDefinition and the batch identifiers seem so be similar to how IDMP states them (i.e. not the way actual systems do at least outside of regulatory). So the scope should be clear if we want to maintain that inconsistency (I presume there may be reasons to maintain it)</li>\n</ul>",
        "id": 206899127,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597382355
    },
    {
        "content": "<p>I'm not dumping a set of complaints - this is feedback, but I think if I put this on a chat it will seem less constructive than I mean it. <br>\nI'm looking at IDMP and the EMA's IG and I want these resources to be in good shape.</p>",
        "id": 206899307,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597382610
    },
    {
        "content": "<p>and (Because communication issues) I am not implying that any issues are blocking for having a release.  It's good to expose these resources to some fresh air and fresh feedback.</p>",
        "id": 206899396,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597382712
    },
    {
        "content": "<p>MPD.indication is different from using ClinicalUseIssue. It is needed because the current generation of systems often carries this as one block of text, about all the indications. It cannot easily be separated into multiple resources, so cannot use ClinicalUseIssue, and it is not a duplication/concatenation (well it is but at source data level not at FHIR data level). ClinicalUseIssue is of course also available for use and it is not showing in MPD because it points in, not out of the resource.</p>",
        "id": 206910425,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597395897
    },
    {
        "content": "<p>Re PPD and batch, the intent is to cover all use current cases so please let us know the specific gap we are not handling.</p>",
        "id": 206910666,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597396152
    },
    {
        "content": "<p>indication ok for now (i was looking for a way to discuss, let's use this chat then) it just feels awkward, not something I can point to.</p>",
        "id": 206911822,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597397203
    },
    {
        "content": "<p>PPD and batch - well, this is a very awkward construct. <br>\nWhat is normally done is : you can nest items (boxes of boxes, or boxes inside boxes) and each of them has a set of production identifiers - lot, serial, expiry, etc. using only \"batch\" as an identifier would make sense if you want to disregard serialization, and if you want to force people to describe the expiry dates for the batch elsewhere (which would be strange). And I do not see why \"outerpackaging\" and \"immediatepackaging\" are both in batch. If a package contains another package, the nesting can take care of  this.</p>",
        "id": 206912362,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597397667
    },
    {
        "content": "<p>why not a single \"batch\" backbone with serial, expiry, etc. as in Medication resource?</p>",
        "id": 206912513,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597397785
    },
    {
        "content": "<p>I was looking at shelf life but that is different. Shelf life is about the kind (definitional), batch is about the instance.</p>",
        "id": 206912551,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597397828
    },
    {
        "content": "<p>The identifiers I added on the package were meant to allow numbers at all levels (which is not supported in IDMP). We may be able to remove BatchIdentifier, it is true.</p>",
        "id": 206912648,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597397890
    },
    {
        "content": "<p>also, this resource is definitional. <br>\nif batch means \"these were the batches produced and put in the market\" - that for me would be a new resource, looking at the instance, not kind</p>",
        "id": 206912677,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597397930
    },
    {
        "content": "<p>I don't know the workflow but do manufacturers have to redeclare the product when informing that a new batch is being created? I'd hope not.</p>",
        "id": 206912727,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597397988
    },
    {
        "content": "<p>This resource can/could also be used for instances. The scope may need changing or clarifying but it has always has batch identifiers - which are only really on instances. We wouldn't want to clone the whole resource to allow instances, when they fit fine in the data items as now.</p>",
        "id": 206912821,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597398042
    },
    {
        "content": "<p>shelf life can be about an instance</p>",
        "id": 206912955,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597398180
    },
    {
        "content": "<p>shelf life can be 2 things: definitional (6 months) and instance (today + 6 months)</p>",
        "id": 206913382,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597398571
    },
    {
        "content": "<p>I understand this resource can be rescoped or the scope clarified (which makes my feedback a challenge because I do not know if I am saying something that is known and not documented). But if a thing called PackagedProductDefinition can also be used for instances, that is not how we have been doing it so far, right? And it should be very well documented because it will overlap with inventory management</p>",
        "id": 206913627,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597398765
    },
    {
        "content": "<p>Specifically on shelf life I would make it very clear the difference between the definitional aspect and the instance</p>",
        "id": 206913762,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597398884
    },
    {
        "content": "<p>The \"definition\" in these resources is not about instance vs kind it is about level of detail. Mostly the resources would be definitions but there is a need for some to be instances, hence batch numbers. The Medication resource can also be both an instance and a kind too.</p>",
        "id": 206913783,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597398904
    },
    {
        "content": "<p>Yes, but Medication resource is transactional data, these resources are master data</p>",
        "id": 206913803,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597398928
    },
    {
        "content": "<p>I am not sure why that makes a difference. We don't draw any distinction in FHIR. If it is used as an instance then it is \"transactional\" perhaps.</p>",
        "id": 206913947,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399043
    },
    {
        "content": "<p>I don't think this is wrong. I just think that if that is the approach, it should be well documented, data segmented (like shelf life vs expiry date). And the name might be best \"PackagedProduct\"</p>",
        "id": 206913950,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399044
    },
    {
        "content": "<p>re shelf life, we can make any clarifications as needed. Which applies to everything.</p>",
        "id": 206914037,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399095
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Feedback.20on.20current.20model/near/206913947\">said</a>:</p>\n<blockquote>\n<p>If it is used as an instance then it is \"transactional\" perhaps.</p>\n</blockquote>\n<p>Agree</p>",
        "id": 206914043,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399102
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Feedback.20on.20current.20model/near/206913947\">said</a>:</p>\n<blockquote>\n<p>I am not sure why that makes a difference. We don't draw any distinction in FHIR.</p>\n</blockquote>\n<p>I think we do sometimes, sometimes we don't</p>",
        "id": 206914061,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399127
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Feedback.20on.20current.20model/near/206914037\">said</a>:</p>\n<blockquote>\n<p>re shelf life, we can make any clarifications as needed. Which applies to everything.</p>\n</blockquote>\n<p>Yes, separate shelf life (definition, stays where it is) and add expiry (under the batch thing)</p>",
        "id": 206914090,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399164
    },
    {
        "content": "<p>Re the names, it was very hard to come up with a set of names that worked best, and we discussed it many many times in different forums over more than a year. So, while not ideal, I would not be keen to alter then unless there was very significant problems with them.</p>",
        "id": 206914094,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399168
    },
    {
        "content": "<p>I know the struggle, but when you agreed on the scope of xxxDefinition, was it clear that this would also support instances? I'd expect that would raise  some attention</p>",
        "id": 206914192,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399237
    },
    {
        "content": "<p>I would have preferred PackagedProduct, and MedicinalProduct, but those names were rejected</p>",
        "id": 206914270,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399307
    },
    {
        "content": "<p>IMO the name should match the scope</p>",
        "id": 206914349,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399348
    },
    {
        "content": "<p>re batch - besides the discussion whether it fits into a new resource or not, IMO it does not make sense to put those two identifiers. batches of different levels should be handled with the nesting of the package that you already do</p>",
        "id": 206914432,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399432
    },
    {
        "content": "<p>yes, I agree. but we live in a world where you cannot fully describe things in the name of a resource, which needs to be relatively short. When these were originally proposed the main summary diagram (I have posted this a few times) was this, where the relationship/purpose is something like \"fully described <a href=\"/user_uploads/10155/l0_reIekyFKcTWOYTKgFasO0/resources-sketch.png\">resources-sketch.png</a> by\"</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/l0_reIekyFKcTWOYTKgFasO0/resources-sketch.png\" title=\"resources-sketch.png\"><img src=\"/user_uploads/10155/l0_reIekyFKcTWOYTKgFasO0/resources-sketch.png\"></a></div>",
        "id": 206914595,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399564
    },
    {
        "content": "<p>btw, is \"Pharmaceutical Product\" called \"AdministrableProduct\"?</p>",
        "id": 206914604,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399577
    },
    {
        "content": "<p>yes</p>",
        "id": 206914614,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399593
    },
    {
        "content": "<p>re batch I agreed with you, in principle, further up the thread</p>",
        "id": 206914637,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399628
    },
    {
        "content": "<p>(that is a bit confusing because that is the one that is not commercialized or administered, right? isn't that at the level of VMP?)</p>",
        "id": 206914673,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399675
    },
    {
        "content": "<p>it is what is administered</p>",
        "id": 206914782,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399780
    },
    {
        "content": "<p>PhPs are not existing per se</p>",
        "id": 206914792,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399794
    },
    {
        "content": "<p>sorry, I don't understand that comment</p>",
        "id": 206914877,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399852
    },
    {
        "content": "<p>I understand the PhP as an abstraction for the products. Nobody gets paracetamol 500 mg tablets. They get Tylenol</p>",
        "id": 206914910,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597399887
    },
    {
        "content": "<p>I don't see how that relates to this. This is not about branded vs generic (or branded generics)</p>",
        "id": 206914995,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597399944
    },
    {
        "content": "<p>If the names are the best we could do but the scope is not documented, it's hard to understand the resource.<br>\nFor example this AdministrableProductDefinition has a \"property\" which can be many things, including things that belong in other resources</p>",
        "id": 206915152,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400137
    },
    {
        "content": "<p>sure, we would be happy to requests with clarifying text</p>",
        "id": 206915228,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597400198
    },
    {
        "content": "<p>PhP - the point is that a PhP is not an administrable product.  It's an abstraction that represents perhaps the administrable form and other characteristics. But that is minor, we can move along</p>",
        "id": 206915231,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400203
    },
    {
        "content": "<p>there is no PhP in this model, afaik</p>",
        "id": 206915245,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597400222
    },
    {
        "content": "<p>I thought PhP was now called AdministrableProduct</p>",
        "id": 206915268,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400251
    },
    {
        "content": "<p>no</p>",
        "id": 206915275,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597400263
    },
    {
        "content": "<p>maybe I phrased it wrongly, that is what i meant by <br>\n is \"Pharmaceutical Product\" called \"AdministrableProduct\"</p>",
        "id": 206915337,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400307
    },
    {
        "content": "<p>thanks for the information. I understand the meaning better now. <br>\nI hear that you're happy to get requests to clarify text - I expect there will be a lot of that needed for this to be clear.<br>\nAnd I also expect that some wrinkles may need changes.</p>",
        "id": 206915522,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400490
    },
    {
        "content": "<p>AdministrableProductDefinition is a resource yes. It is not synonymous with a PhP (which I know as a specific term for an ID system, and which can be carried here if need be). The resource represents the final product as it is given to the patient - possibly as mixed from the components.</p>",
        "id": 206915598,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597400550
    },
    {
        "content": "<p>From my perspective, I'm trying to give a first feedback, I don't think these resources are clear for implementation, but if we don't expose the resources, the feedback will be of low quality.</p>",
        "id": 206915622,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400575
    },
    {
        "content": "<p>I hope I was able to answer all your questions</p>",
        "id": 206915758,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597400696
    },
    {
        "content": "<p>I was looking also at RegulatedAuthorization.indication - so we have 3 places and 3 different ways to express what a product is for - and none of them mention ConditionDefinition</p>",
        "id": 206915776,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400715
    },
    {
        "content": "<p>Yes, the questions so far are answered - but we have work ahead</p>",
        "id": 206915794,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400729
    },
    {
        "content": "<p>btw, I think i saw paediatrics mentioned somewhere - UK/US thing?</p>",
        "id": 206915868,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400763
    },
    {
        "content": "<p>ConditionDefinition did not exist when that was defined</p>",
        "id": 206915916,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597400823
    },
    {
        "content": "<p>true, but it does now</p>",
        "id": 206915964,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400881
    },
    {
        "content": "<p>will you please check MPDefinition.indication that still refers to MedicinalProductDefinitionIndication?</p>",
        "id": 206916010,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597400891
    },
    {
        "content": "<p>please \"clarify 3 different ways to express what a product is for\". There are several places we use ClinicalUseIssue, because that is what is needed. It is not a alternative or repeated way to say something else.</p>",
        "id": 206916102,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597400994
    },
    {
        "content": "<p>ConditionDefinition is a level 0 resource. If we need to support that, happy to consider a change request to do so</p>",
        "id": 206916219,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597401070
    },
    {
        "content": "<p>ah thanks for spotting an old bit of text there with MedicinalProductDefinitionIndication. That is out of date.</p>",
        "id": 206916295,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597401146
    },
    {
        "content": "<p>as free text, as a clinicaluseissue, and as a codeableconcept</p>",
        "id": 206916521,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597401407
    },
    {
        "content": "<p>(I hope we have a more nimble approach at this phase than making lots of change requests)</p>",
        "id": 206916568,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597401481
    },
    {
        "content": "<p>yes, ok I see what you mean, there are 3 levels supported. That is deliberate</p>",
        "id": 206916620,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597401531
    },
    {
        "content": "<p>could it be more consistent?</p>",
        "id": 206916641,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597401568
    },
    {
        "content": "<p>the idea is to cover the existing use cases, and the existing use cases are not themselves consistent. Somewhat like CodeableReference, but more fine grained because we know which use cases tend to apply where</p>",
        "id": 206916722,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597401655
    },
    {
        "content": "<p>I cannot figure out which parts have been cleared and checked and which ones are still expected to be changed, so I am treating everything as a \"candidate\" and provide feedback as such.</p>",
        "id": 206916734,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597401663
    },
    {
        "content": "<p>are those use cases documented? That might help me in the analysis and eventual feedback.</p>",
        "id": 206916761,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597401696
    },
    {
        "content": "<p>(note that I am just worried about 20% of the resources, overall I think the design is in a good direction, and I am trying to focus on what I would think is needed for an MVP / first good candidate)</p>",
        "id": 206916829,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597401753
    },
    {
        "content": "<p>these are level 1 resources, so all parts are subject to feedback. I don't have documented traceable requirements for all attributes in these resources, but I am happy to describe any rationale you may want information on</p>",
        "id": 206916840,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597401767
    },
    {
        "content": "<p>I think we do not have requirements for any resources, and I don't want to push that now.. <br>\nLet's find some way to clarify the intended scope - but if you say \"that is not in the use cases\" i'd like to be able to say \"then this use case is missing or incomplete\".</p>",
        "id": 206917339,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597402247
    },
    {
        "content": "<p>sure</p>",
        "id": 206917374,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597402304
    },
    {
        "content": "<p>and chats are good but less efficient. Especially if one is asking about the forest or suggesting a new species of tree and you respond \"which tree\" (because that is really the only actionable thing we have - change requests on individual resources)</p>",
        "id": 206917462,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597402381
    },
    {
        "content": "<p>I'll do some more reading and will ping for more feedback. hopefully in a few iterations things will be clearer</p>",
        "id": 206917490,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597402422
    },
    {
        "content": "<p>Coming late to the thread - my understanding was that the MedicationDefinition resources did <em>not</em> convey instance data - i.e. they are not specific to a single lot or serial number.  Is that incorrect?</p>",
        "id": 207786625,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598209378
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> yes. </p>\n<p>I can't yet see a use case for a instance that wouldn't be easier to convey using the Medication resource (with a reference to a MedicinalProductDefinition in the background possibly, for extra detail). </p>\n<p>However there are use cases for a PackagedProductDefinition to be an actual instance - and it already has batch numbers.</p>",
        "id": 208010239,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598383327
    },
    {
        "content": "<p>So it's not really just a definition anymore...?</p>",
        "id": 208011436,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598383914
    },
    {
        "content": "<p>I don't understand PackagedProductDefinition being an instance.  If it's a definition, it shouldn't ever be an instance.  (And I don't think that was part of the approved scope for the resource?)</p>",
        "id": 208016481,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598386269
    },
    {
        "content": "<p>I agree, and the name isn't good for that. It was not the name that we originally wanted - and it has always had batch numbers. Nevertheless there is a use case for actual batches of things, and for all the details of the packaging. So a solution is needed. If not this resource, then something else. Any suggestions?</p>",
        "id": 208021210,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598388408
    },
    {
        "content": "<p>What is that use case for instance/batch info?</p>",
        "id": 208021444,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598388512
    },
    {
        "content": "<p>The need to represent manufactured batches of drugs, and to be able to state the packaging.</p>",
        "id": 208021579,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598388578
    },
    {
        "content": "<p>For what use case?</p>",
        "id": 208021616,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598388596
    },
    {
        "content": "<p>that is the use case :-) Manufacturing of drug batches.</p>",
        "id": 208021700,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598388619
    },
    {
        "content": "<p>Manufacturing of drug batches - how is that a use case for interoperability?</p>",
        "id": 208021777,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598388661
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Feedback.20on.20current.20model/near/208021777\">said</a>:</p>\n<blockquote>\n<p>Manufacturing of drug batches - how is that a use case for interoperability?</p>\n</blockquote>\n<p>It is part of supply chain management and master data management.  The Packaged Product resource and its relationships allows us to clearly identify batches of product in the full detail needed for manufacturing and supply chain management.  In these use cases, the limited Medication resource isn't enough.</p>",
        "id": 208022243,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598388922
    },
    {
        "content": "<p>I can imagine that need in inventory (and we're working on that); or for serialisation (and we'd need a serial number for that)</p>",
        "id": 208022276,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598388940
    },
    {
        "content": "<p>So, not definitional</p>",
        "id": 208022310,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598388960
    },
    {
        "content": "<p>depends on your definition of definitional :). It is defining the product, its packaging, and the associated identifiers for use in a supply chain.</p>",
        "id": 208022424,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598389005
    },
    {
        "content": "<p>And I still don't see the use case (tbh I didn't see it in idmp either)</p>",
        "id": 208022428,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598389008
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> this is not IDMP.</p>",
        "id": 208022495,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598389049
    },
    {
        "content": "<p>\"I still don't see the use case\" I don't know why you keep saying that.  I've defined the use case and you don't understand it?  Or you understand it but don't see a need for it?</p>",
        "id": 208022523,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598389066
    },
    {
        "content": "<p>The use case I imagine is : manufacturer declares to the regulator the following batches have been put on the market today.</p>",
        "id": 208022651,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598389116
    },
    {
        "content": "<p>yes, that is also a good use case.  but that's not the use case I was detailing.  In the use case I was detailing, the manufacturer is detailing what has gone into the batch of product they produced and uses that when sending to other parties in the supply chain.</p>",
        "id": 208022803,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598389194
    },
    {
        "content": "<p>That is a supply chain issue, and is not a regulatory submission issue.</p>",
        "id": 208022878,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598389214
    },
    {
        "content": "<p>So if those are the use cases (which seem close) we should handle that in the supply chain</p>",
        "id": 208022927,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598389249
    },
    {
        "content": "<p>This is information that drug companies submit to regulators. So it is regulatory, though I don't see why it matters.</p>",
        "id": 208023109,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598389334
    },
    {
        "content": "<p>Supply chain for regulators should follow the practices of supply chain</p>",
        "id": 208023221,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598389399
    },
    {
        "content": "<p>So I think there is a case but I don't understand why these resources are making a partial solution for a problem that is broader</p>",
        "id": 208023342,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598389444
    },
    {
        "content": "<p>It's about regulation of the manufacture of drugs and the information content fits squarely into the package resource - because it a lot to do with packaging of medications. We don't want to describe a packaged thing differently at different times, or when it later becomes \"supply chain\".</p>",
        "id": 208023675,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598389633
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> I know this is not idmp, but I saw the same antipattern here as idmp.</p>",
        "id": 208023734,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598389671
    },
    {
        "content": "<p>So anyway, the issue is how to represent all the packaging of medicinal item, and also have instance data of identifiers and dates.</p>",
        "id": 208024134,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598389907
    },
    {
        "content": "<p>Definitional resources are for master data, and inventory can also be seen as master data but the lifecycles are different.</p>",
        "id": 208024728,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598390179
    },
    {
        "content": "<blockquote>\n<p>So anyway, the issue is how to represent all the packaging of medicinal item, and also have instance data of identifiers and dates.</p>\n</blockquote>\n<p>One resource for the definitional side, and another for the instance. These resources will be used differently and updated differently</p>",
        "id": 208024952,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598390286
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  the proposal says \"The core basis for the resource is the information in ISO 11615\"... Which explains the inherited issue/mix.</p>",
        "id": 208025598,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598390599
    },
    {
        "content": "<p>I don't grasp the detailed scope and intent of these resources.</p>",
        "id": 208026171,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598390881
    },
    {
        "content": "<p>The requirement and use cases are not clear so I have to guess a bit. But that is manageable</p>",
        "id": 208026475,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598391034
    },
    {
        "content": "<p>My suggestion would be to reconsider the batch info in these resources</p>",
        "id": 208026531,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598391074
    },
    {
        "content": "<p>I.e. remove them</p>",
        "id": 208026754,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598391189
    },
    {
        "content": "<p>we may need to use Medication for the instance and PackagedProductDefinition for the packaging info</p>",
        "id": 208028188,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598391903
    },
    {
        "content": "<p>I see several XProductDefinition resources, but no XProduct resources... Are all instances going to be Medication then?</p>",
        "id": 208028780,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1598392304
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> good question. Proposal seems to indicate that.</p>",
        "id": 208029912,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598392942
    },
    {
        "content": "<p>These resources are apparently medication-centric. One of my quests is to compare this with the Healthcare Product discussions which should be valid for medication or devices or nutrition</p>",
        "id": 208030033,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598393031
    },
    {
        "content": "<p>Instances will be Medication yes. Probably in every case - but that is this discussion. <br>\nDay to day prescribing is Medication and not the Medication Definition resources, that has always been the plan. (Medication is used for both instance and also sometimes definition though btw).  <br>\nThere are some regulatory manufacturing use cases that we are discussing that are somewhat between instance and definition. These are \"test batches\", and submitted to regulators as part of the drug approval process, so are partly definitional - like a template - but they have dates and identifiers, so have an instance aspect.</p>",
        "id": 208030660,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598393378
    },
    {
        "content": "<p>Reporting of test batches seems a different use case.</p>",
        "id": 208032249,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598394548
    },
    {
        "content": "<p>Yes, it is a different use case - but it needs similar data elements.</p>",
        "id": 208035674,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598396981
    },
    {
        "content": "<p>If the use-case is notifying the regulator that a particular batch has been produced - to allow subsequent supply chain tracing - I don't understand why you wouldn't have a Medication instance that points to the Definition instead of using a Definition instance for two different purposes - one of which clearly <em>isn't</em> a definition.</p>",
        "id": 208036415,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598397494
    },
    {
        "content": "<p>yes I was suggesting exactly that just earlier in the thread</p>",
        "id": 208037137,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598398237
    },
    {
        "content": "<p>Ok, so the definition resources wouldn't need to expose 'lot' then, correct?</p>",
        "id": 208040443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598401237
    },
    {
        "content": "<p>that's right</p>",
        "id": 208040745,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598401482
    },
    {
        "content": "<p>There are not many value sets and bindings on these resources. Is that intentional? Why not put examples like EDQM?</p>",
        "id": 208322997,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598607692
    },
    {
        "content": "<p>also, \"paediatricUseIndicator\" - is a codeableConcept - why?</p>",
        "id": 208323073,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598607745
    },
    {
        "content": "<p>(just found these ones).</p>",
        "id": 208323095,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598607759
    },
    {
        "content": "<p>I'm expecting these resources to be rather generic, and then EMA / FDA would have to constrain them,  but I don't see those constraints.</p>",
        "id": 208323151,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598607816
    },
    {
        "content": "<p>-is that intentional<br>\nThis work has just not been done yet.</p>\n<p>-paediatricUseIndicator<br>\nIs coded so you can have a variety of values, not just yes/no or true/false. e.g. \"for use in infants\", \"not for under 12s\" etc.</p>\n<p>-I'm expecting these resources to be rather generic<br>\nAgree<br>\n-and then EMA / FDA would have to constrain them<br>\nYes<br>\n-but I don't see those constraints<br>\nIf they are constrained by those organizations, then those constraints won't be visible in the resources themselves.</p>",
        "id": 208328943,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598612583
    },
    {
        "content": "<p>Pediatric - why not code? Do we want free text in submissions?</p>",
        "id": 208331750,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598614946
    },
    {
        "content": "<p>I was looking at the ema ig and they pretty much point to the resources as if it's ready out of the box.. as long as they are aware that there is still a lot to do (some on the core, a lot on their IG), we're fine</p>",
        "id": 208331964,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598615092
    },
    {
        "content": "<p>-why not code<br>\nAfaik MnM guidelines recommend using CodeableConcept for general use in resources</p>",
        "id": 208334517,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598616750
    },
    {
        "content": "<p>This is not a field where I would expect people to add free text values. I expect this to be reference data available somewhere</p>",
        "id": 208344310,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598622352
    },
    {
        "content": "<p>(right?)</p>",
        "id": 208344500,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598622433
    },
    {
        "content": "<p>yes I agree</p>",
        "id": 208344747,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598622558
    },
    {
        "content": "<p>usually it would be a single code, but this can also be used for a general description of the paediatric use, and also MnM guidance says to prefer CodeableConcept datatype</p>",
        "id": 208345185,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598622793
    },
    {
        "content": "<p>for a general description - then we cn change to coding and use use coding.display<br>\nI don't know how the MnM guidance would apply here - if we want to exclude free text, why use CodeableConcept?</p>",
        "id": 208346571,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598623392
    },
    {
        "content": "<p>If there's a chance of code translations being needed, CodeableConcept is appropriate.</p>",
        "id": 208347694,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598623986
    },
    {
        "content": "<p>Coding.display is not for a general description. It's for the fixed display text of the code.</p>\n<p>Re MnM Im not sure what to say - MnM guidance says to use CodeableConcept in general unless there is a very strong reason why not. We had several Codings in these resources at one stage, but were specifically asked to change them to CodeableConcepts.</p>",
        "id": 208347846,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598624061
    },
    {
        "content": "<p>This is regulatory stuff, I'd expect the reference data to be defined for one domain. I don't see where we'd have several translations in one produce code.</p>",
        "id": 209871616,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599900345
    },
    {
        "content": "<p>I'm sure the MnM guidance comes with a context - code is not deprecated afaik. Perhaps this shouldn't be code, I just don't see a reason.</p>",
        "id": 209871694,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599900473
    },
    {
        "content": "<p>Related to feedback: I can't create a Jira ticket on MedicinalProductDefinition. The resource is not shown in the dropdown box</p>",
        "id": 209871839,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599900722
    },
    {
        "content": "<p>For this resource, scope should be clarified - explicit, not by exclusion. Currently it gives the idea that is resource covers everything except clinical use (which is not the case judging from recent discussions - this is not intended to cover unknown/eventual scopes).</p>",
        "id": 209871934,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599900847
    },
    {
        "content": "<p>Jira doesn't have the R5 names, only R4, so you have to use those</p>",
        "id": 209872050,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1599901139
    },
    {
        "content": "<p>The resources are not just regulatory, they are for any situation where you need the full information, such as a drug dictionary, or pharmacopeia. And even regulatory is not \"one domain\" with single code systems defined for codes. \"Regulatory\" is a big area.</p>",
        "id": 209872197,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1599901378
    },
    {
        "content": "<p>Where are the mappings so that I can figure out which resource to use in Jira? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> (or perhaps add the page)</p>",
        "id": 209872658,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599902286
    },
    {
        "content": "<p>And I don't think you can say \"for any situation\" after the debate where you don't want to consider \"eventual\" scope. (you = BRR)</p>",
        "id": 209872672,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599902343
    },
    {
        "content": "<p>We either make sure the resource is valid for any situation (including new ones), or we define our scope better.</p>",
        "id": 209872731,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599902411
    },
    {
        "content": "<p>You can e.g. exclude homeopatic, or supply chain (known unknowns), but that still makes the resource scope inconsistent with the previous discussions.</p>",
        "id": 209872882,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599902700
    },
    {
        "content": "<p>We can consider new situations when we have requirements for new situations. It's not good to add speculative requirements, nor to say we are are done and won't be accepting any more requirements.</p>",
        "id": 209872898,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1599902728
    },
    {
        "content": "<p>This is difficult.... So if say \"this resource should support also this case but requires a redesign\" - I seem to get \"no, that is not in scope\". But when I need to understand the scope, i get \"scope can be anything, depends on the use cases\".</p>",
        "id": 209873016,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599902903
    },
    {
        "content": "<p>These are not requirements. This is a scope discussion. I am not talking about the quality of the resources , but the scope of one resource. If that is not clear...</p>",
        "id": 209873081,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599903022
    },
    {
        "content": "<p>We really want to use these resources, and put them to test, but I sense a resistance like when feedback is not really welcome.</p>",
        "id": 209873100,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599903099
    },
    {
        "content": "<p>I welcome your feedback Jose, please just give us specific changes that you would like to be made. I also suggest to start using the resources, and to put them to the test.</p>",
        "id": 209873440,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1599903621
    },
    {
        "content": "<p>I just gave feedback</p>",
        "id": 209874037,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599904701
    },
    {
        "content": "<p>Make the scope explicit about what is covered, not \"anything except...\"</p>",
        "id": 209874058,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599904776
    },
    {
        "content": "<p>We do want to be completely explicit about what is in scope, but have not yet decided what will be in scope eventually. For example we don't know what aspects of devices should be in scope. Analysis work needs to be done before we make that decision. I think we are working towards the clarity that you want, but we are not there yet. And we are not saying we are done.</p>",
        "id": 209874181,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1599904972
    },
    {
        "content": "<p>Then please be explicit. Indicate what it covers. Do not indicate it can cover anything else except the known exclusions. If and when you include devices, you can add that to the scope. But do not leave this deliberately open - that seems in contrast with email discussions</p>",
        "id": 209874836,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599905950
    },
    {
        "content": "<p>My feedback is simple, I think: make the scope explicit. The initial scope was regulatory for medicines. Expand the scope to the use cases you included since. This is for consistency with previous email discussions - which I disagree but I respect</p>",
        "id": 209874905,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599906090
    },
    {
        "content": "<p>thanks for the feedback Jose</p>",
        "id": 209875232,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1599906678
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> - you can and should make a pull request against Jira-Spec-Artifacts to change the names in Jira (adding the old ones in brackets, like we did for CapabilityStatement).</p>",
        "id": 209884103,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599921658
    },
    {
        "content": "<p>I don't know if this is done yet - Is it there? <br>\nI wanted to follow up on one of my previous issues was too vague (about the use of codes vs codeableconcepts) and I can submit more precise change proposals if adequate</p>",
        "id": 213771356,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603106708
    },
    {
        "content": "<p>I have not had a chance to do this yet no, sorry. You can still submit comments.</p>",
        "id": 213777518,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603110619
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'm getting a 403 error on push. Do I need permission?</p>",
        "id": 214349853,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603477987
    },
    {
        "content": "<p>What are you trying to push to?</p>",
        "id": 214350585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603478371
    },
    {
        "content": "<p>I tried to push to origin, but it then says: fatal: unable to access '<a href=\"https://github.com/HL7/JIRA-Spec-Artifacts/\">https://github.com/HL7/JIRA-Spec-Artifacts/</a>': The requested URL returned error: 403.</p>",
        "id": 214351959,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603479083
    },
    {
        "content": "<p>by the way should I add new resource artifacts and leave the old? If I delete the old it complains, understandably. But what is the thing with the brackets? Does that refer to the old name, but the old name is still left there? Is it just a comment for humans?</p>",
        "id": 214352309,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603479258
    },
    {
        "content": "<p>You have to make a local repository and then submit a pull request.  You can't push directly</p>",
        "id": 214395722,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603494456
    },
    {
        "content": "<p>I do have a local copy and a build. Is that not a local repository?</p>",
        "id": 214395787,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603494495
    },
    {
        "content": "<p>I've obviously not done it right. I will try to clone the repo again.</p>",
        "id": 214395812,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603494527
    },
    {
        "content": "<p>You should be able to commit to your personal repository.  Create a pull request from that.</p>",
        "id": 214396178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603494953
    }
]