[
    {
        "content": "<p>Looking at the resource scopes, I understand that IDMP product levels are:<br>\nPharmaceutical Products - AdministrableProductDef? (or MedicinalProductDef? )<br>\nMedicinal Products - MedicinalProductDef <br>\nPackaged Products - PackagedProductDefinition?(or MedicinalProductDef? )</p>",
        "id": 210098649,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600155341
    },
    {
        "content": "<p>Yes. Not the ones in your brackets.</p>",
        "id": 210099193,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600155769
    },
    {
        "content": "<p>Thanks. For other definitions, like national concepts that do not map 1:1 to an IDMP level (e.g. paracetamol tablets 500 mg pack of 20, but no brand), are these supposed to support it? I think MedKowledge covers those.</p>",
        "id": 210099725,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600156177
    },
    {
        "content": "<p>To represent any product you use MedicinalProductDefinition, but the package specific info goes in PackagedProductDefinition</p>",
        "id": 210100190,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600156516
    },
    {
        "content": "<p>It's a multi level model</p>",
        "id": 210100218,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600156543
    },
    {
        "content": "<p>I expected that answer. What is the boundary with MedKnowledge? Why not use that, which is also a definition?</p>",
        "id": 210100473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600156696
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> is that boundary defined? I need to convey a definition of a product that does not match one of IDMP levels. The way that resources are structured, I find MedKnowledge much more convenient, because BRR resources require some collage (contained? as a bundle?)</p>",
        "id": 210103813,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600159169
    },
    {
        "content": "<p>(This is not a new requirement)</p>",
        "id": 210104348,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600159607
    },
    {
        "content": "<p>If you need multiple resources in FHIR you can use a bundle, or contained, or you can just put all the resources on the server and let the references show the links.</p>",
        "id": 210105020,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600160081
    },
    {
        "content": "<p>All products can be mapped to IDMP, or at least that is the theory, and it is thought that all EU and US medications do fit. But if you have one that does not, then let us know and we can take a look. The FHIR product model is split over several resources as we have seen. For different aspects you may need to use multiple resources, or you may not - it depends what data you want to carry. A basic product definition with names, identifiers, indications, legal status, classification, manufacturer can be represented just using MPD for instance.</p>",
        "id": 210105393,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600160337
    },
    {
        "content": "<p>this example I gave is a well known example on the clinical and regulatory space. At some point we even wondered if we needed to change IDMP for that (forthunately we didn't).</p>",
        "id": 210105553,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600160427
    },
    {
        "content": "<p>my question was whether the boundary is clear. I don't want to promote MedKnowledge if we have the other resources. and if we have those, we should have this as initial guidance.</p>",
        "id": 210105627,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600160488
    },
    {
        "content": "<p>ok. you are welcome to tell us what it is like if you want some assistance with it.</p>",
        "id": 210105727,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600160535
    },
    {
        "content": "<p>again, I don't understand.</p>",
        "id": 210105749,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600160555
    },
    {
        "content": "<p>from what you are stating <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> , I don't need a MedKnowledge for that example - so what is the rule?</p>",
        "id": 210105752,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600160561
    },
    {
        "content": "<p>For a full definition, use MP. It is true that some level of detail can be represented in MK, and even in basic Medication. But they don't scale, so its not a full solution.</p>",
        "id": 210105822,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600160617
    },
    {
        "content": "<p>If your use case can be fulfilled by the Medication resource, then you can use that.</p>",
        "id": 210105908,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600160665
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> is that also your understanding? In a medication catalog, I use the IDMP/Regulatory resources?</p>",
        "id": 210105950,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600160694
    },
    {
        "content": "<p>We call those resources \"Medication Definition\", since they are neither limited to IDMP or regulatory.</p>",
        "id": 210106073,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600160789
    },
    {
        "content": "<p>(yes, you got the point, forgive me my abuse of language)<br>\nMy example is such a simple one, and is transversal from regulatory to drug dictionaries...</p>",
        "id": 210106152,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600160870
    },
    {
        "content": "<p>I don't know if there is guidance, but every discussion seems very complicated. <br>\nI was expecting some more smoothness in these resources, given the assertivity in these discussions.</p>",
        "id": 210106204,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600160887
    },
    {
        "content": "<p>some of the guidance you are looking for is not yet written down. But you can help us create it. Also if you want help with mapping an example, let us know what it is.</p>",
        "id": 210106409,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600161032
    },
    {
        "content": "<p>btw the way I have it is that MPD <em>is</em> the medication (definition) and MK is <em>about</em> the medication (context and usage).<br>\nSome aspects overlap, and in those cases this is solved by using a common structure (e.g. ClinicalUseIssue). So there is overlap between all the resources used by MK and all the resources used by MPD. But should not be much direct overlap. But they will both have some fundamentals in common, same as with Medication.</p>",
        "id": 210107265,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600161681
    },
    {
        "content": "<p>Also note that an MK can reference an MPD as its definition</p>",
        "id": 210107431,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600161797
    },
    {
        "content": "<p>If we want to implement Product Dictionaries (à la ISO 19256) this boundary should be clear. Perhaps an end-to-end example, from regulatory to clinical, to see the transition?</p>",
        "id": 210108489,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600162612
    },
    {
        "content": "<p>I understand you can use 2 Medication definition resources. I also think you can use a MedicationKnowledge. This same example (we want to define a product which is Paracetamol 500 mg tablets box of 20, no brand\" can be done at national regulators, or inside a hospital.</p>",
        "id": 210109924,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600163723
    },
    {
        "content": "<p>re the ISO 19256 issue, that would be a good thing to have, yes</p>",
        "id": 210110054,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600163822
    },
    {
        "content": "<p>I did request that in the past, I got this as a response:<br>\n<span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Link.20MedicationKnowledge.20to.20an.20resource.20instance/near/190107032\">said</a>:</p>\n<blockquote>\n<p>Pharma company creates a new medication product.  They need to submit their product reference information to a registrar such as the EMA or the FDA.  They use MedicinalProductDefinition as their resource as this contains all of the reference information that a registrar needs to evaluate, register, and authorize medication products.</p>\n<p>The product is now on the market and a drug knowledgebase such as Medi-Span or First Data Bank includes it in their product.  Regional health authorities and drug insurance companies list the product in their formulary.  They all use the MedicationKnowledge resource to convey their knowledge information.</p>\n</blockquote>\n<p>I think this should be documented</p>",
        "id": 210110372,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600164109
    },
    {
        "content": "<p>I agree</p>",
        "id": 210110634,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600164267
    },
    {
        "content": "<p>(i think this says that i should use MedKnowledge for my example)</p>",
        "id": 210111248,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600164733
    },
    {
        "content": "<p>When I mapped a UK drug dictionary to FHIR, which has a distinct products and packs structure defined, I found I needed to use the Medication Definition resources. However I did also use MK for some of the more context specific items, such as pricing.</p>",
        "id": 210112306,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600165584
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  - that's one way to do it. Another approach is to map to terminology resources - namely CodeSystem and ValueSet. I believe that <span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  from CSIRO in Australia has tried both approaches. To some extent it boils down to whether one prefers to create Code System properties or extensions on the Medication Resources.</p>",
        "id": 210201044,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1600209986
    },
    {
        "content": "<p>Yes I used STU3 Medication some time back for an AMT experiment, I've been meaning to refresh that to R4 MK. It is still up at <a href=\"https://medserve.online/\">https://medserve.online/</a></p>\n<p>Certainly there's quite a bit of overlap now between the Medication Definition resources, Medication and MedicationKnowledge. I'm not sure I still follow the distinction between these and how to determine which use case is fulfilled by which resource.</p>\n<p>Is there some sort of guidance on this, particularly the future direction of these resources?</p>",
        "id": 210226291,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1600238227
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> Codes can only get you so far. The full data has numeric values and textual descriptions. You cannot code integers or text.</p>\n<p>There is a reason that we use Observation and Condition FHIR structures for moderately complex data and don't just have a bunch of codes. We do need information models. UK dm+d has been mapped to SCT for years (and so could be put into CodeSystem), and it does cover the gross structure, virtual to actual packs and so on, but it's a necessarily incomplete mapping. </p>\n<p>Medication Definition is more than just a bunch of codes. Day-to-day prescribing may need just the codes it is true, and the very small Medication resource (often just a code and a coded form in there). For that you can just use SCT or NDC etc and it's fine. Maybe a CodeSystem full of codes is all you need to support that. </p>\n<p>But that is not the same use case as the Medication Definition resources, where you are giving the entire product data such as the strengths of the ingredients. </p>\n<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  There is overlap between Medication and the Medication Definition set of resources it is true, but they are a world apart. Medication is for the day-to-day prescribing cycle, the key basics. MedicationKnowledge is for data <em>about</em> medications - usage, context, guidelines, pricing etc. The Medication Definition set (so that is MedicinalProductDefinition, PackagedProductDefinition etc, here <a href=\"http://build.fhir.org/medication-definition-module.html\">http://build.fhir.org/medication-definition-module.html</a>) are for the fundamental <em>definitions</em> of the medication items themselves - the intrinsics. And overlap does exist, but is managed by using the same structures in both. Both use the Ingredient resource for instance and both use ClinicalUseIssue for the indications. The MedicationKnowledge resource has an \"associatedDefinition\" link to a MedicinalProductDefinition resource that lets you hold the full data if you need to.<br>\nIt should also be possible to point a Medication at a MedicinalProductDefinition, if you choose to host your medication definitions in a structured FHIR format and want to use a reference (and not an indirect code lookup). And that will also show that there is prescribing of medication and there is definition of medication and they stand separate but connected. You cannot directly prescribe a MedicinalProductDefinition, you only prescribe a Medication that \"has-a\" MedicinalProductDefinition (just like it \"has-a\" SCT code often).</p>",
        "id": 210232756,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600243866
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  Agree that Codes (which are simply concept identifiers) themselves are limited. However, you seem to suggest that medicine terminologies - which do contain text and numeric  properties - cannot be directly implemented as Code Systems, which I would disagree with. NZMT, for example, has a whole host of these, including the strength  of individual ingredients <a href=\"https://terminz.azurewebsites.net/fhir/CodeSystem/$lookup?system=http://nzmt.org.nz&amp;code=10169591000116106&amp;property=all\">for example</a> and it's not certain if we'll ever map that to SCT or, indeed, whether we need to. </p>\n<p>I'm also not ignoring the role of information models - it's just a case of which one best suits a particular use case. There are two generic sets of these that I encounter in my day job that may be served by the Medication Definition Set - one is to support the NZ Formulary and the other relates to pricing and stock control.</p>",
        "id": 210236281,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1600246494
    },
    {
        "content": "<p>hi Peter, yes anything is possible if you try hard enough :-)<br>\nI have never thought of a code system as a place to put numbers and dates and text though. <br>\nYour example is nice but it uses a flat list of key value pairs, and strings for the numerics.  <br>\nI would say that is a limited solution that may be fine for a small-ish information model (\"drug codes plus\") but is unlikely to scale to bigger richer models that are needed for other uses. <br>\nBut if its good enough for what you need then that is great. <br>\nI don't think we will be eliminating creative use of code systems any time soon.</p>",
        "id": 210240654,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600249853
    },
    {
        "content": "<p>Stock control is stock control, not medication definition. What scope you have in mind <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> ?</p>",
        "id": 210242237,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600251099
    },
    {
        "content": "<p>we are looking at an Inventory Report resource (how many items we have, where items=any product),</p>",
        "id": 210242332,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600251143
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  - agreed, and you may be interested (or not) in the introduction of concrete domain values to SCT.<br>\n<span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - I should have been more explicit. Not full-blown stock control, but certain stock-related properties - e.g. stock in hand, prices. We're receiving requests to add these as extensions to the Medication Resource, but are wondering if they belong elsewhere.</p>",
        "id": 210324450,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1600292784
    },
    {
        "content": "<p>I think had something like this in a project - the medication \"catalog\" contained something like \"in stock\" or \"in emergency stock\".</p>",
        "id": 210324542,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600292852
    },
    {
        "content": "<p>in the current picture, I would put those summary info bits as extension to the medicationKnowledge resource.<br>\nIt will overlap with \"proper\" stock management, but I think that is ok - and that is what implementers do anyway (judging from my limited experience)</p>",
        "id": 210324829,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600293046
    },
    {
        "content": "<p>Peter - that is interesting indeed. A surprising move, but I can see the usefulness. Next would be to add a REST interface for writing new data :-)<br>\nCan our FHIR resources represent code systems that have numerics in them?</p>",
        "id": 210325423,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600293487
    },
    {
        "content": "<p>Good question, Rick. At present these values are SCT concepts and, as such, their descriptions are rendered in strings. AFAIU, the replacements will be attribute values and will also be rendered as strings (with a # prefix) in the RF2 distribution format...<a href=\"https://confluence.ihtsdotools.org/mag/concrete-domains-community-of-practice-consultation/snomed-international-proposal-for-representing-concrete-domains-in-rf2\">further information</a></p>",
        "id": 210327217,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1600294697
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> I agree that there needs to be a balance between what goes in terminology/coding systems and an information model - too much skew towards overloading one or the other creates problems. That's obvious at the extremes, but can sometimes be hard to find the sensible hard line in the large grey zone. I guess that's why we need to leave wriggle room in each for people to choose their own adventure (or poison) and still achieve sufficient interoperability.</p>\n<p>But <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> makes a good point regarding representing attributes that have numeric, date or string values. Code systems with formal semantics (like SNOMED CT) can use DL features like Concrete Domains (aka Datatype properties) for those properties to be part of a complex definition of a concept and therefore queried and reasoned with. AMT (Australia's SNOMED CT drug extension) does exactly this, and has since 2014, and SNOMED International has recently adopted this feature.</p>\n<p>So while it is true that dm+d's drug extension doesn't formally represent these attributes in its model and is therefore semantically incomplete, it doesn't mean it isn't possible, or in fact valuable for organising, reasoning with and analysing data using a drug terminology.</p>",
        "id": 210369394,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1600336783
    },
    {
        "content": "<p>I'll try to elaborate on my original question and confusion. Don't take any of this the wrong way, I'm just trying to get my head around it so I know what bits to use for what, and why things are there.</p>\n<p>I get the use case for the Medication resource as it is. Perhaps it is a little over simplified, but it is a resource that provides simple yet sufficient identification and definition of a medication for clinical use cases (like prescribing, dispensing, recording...etc). Could just be a wrapper around a code which provides all the definition, or it might define the medication in the case of a compounded medication or extemporaneous preparation. Makes sense.</p>\n<p>MedicationKnowledge confuses me a bit, because it has some information like costs, monitoring programs, guidelines etc (which make sense), but it also has amount, dose form, ingredients, strengths which seem highly overlapping with Medication and/or MedicinalProductDefinition it references. To me that seems like redundant information that I'm not sure when to/not populate, and what to do if it disagrees.</p>\n<p>The Medication Definition resources seem to be for regulators and manufactures rather than clinical use cases? It seems to mirror IDMP which is very much in this space. I guess one of my questions is if IDMP exists, what is the benefit of replicating it in FHIR? Wouldn't the regulators/manufacturers just use IDMP because that's what it is for? It would be different if IDMP didn't exist and something was needed in that space, but IDMP does exist and seems to be progressing and have traction. So unless there are real deficiencies with IDMP doesn't FHIR just need a way to reference IDMP things, rather than redefine a rendering for them in FHIR? Perhaps I'm just missing a whole bunch of context and use cases. I'm far from an IDMP expert.</p>\n<p>However that aside, if FHIR does take on that use case, it feels like we have MedicationKnowledge, Medication and MedicinalProductDefinition (et. al.) considerably overlapping. Both Medication and MedicinalProductDefinition \"identify and define\" medications, and MedicationKnowledge doesn't set out to do that but has enough elements to put it in that space and be problematically overlapping.</p>\n<p>It feels to me that there is a single thing - medication -  that we are trying to identify and define, and then possibly attach some other non-defining information to for different use cases. I think those things - the identification/definition and the non-defining information - should be kept separate. I'd really like one way to identify and define things, and then structures that can attach information to that thing without overlapping.</p>\n<p>So I guess my questions are</p>\n<ul>\n<li>isn't Medication (identification and definition) really just a chopped down profile of MedicinalProductDefinition cleaving away the detail that is unnecessary to meet the clinical use cases?</li>\n<li>shouldn't the MedicationKnowledge (non-defining information) reference and add information to, but not attempt to redefine the defining parts of the identifying/defining resource it is referencing (whether that is Medication or MedicinalProductDefinition)?</li>\n<li>why are we replicating/rendering IDMP in FHIR rather than referencing it?</li>\n</ul>\n<p>It may well be that I'm missing a heap of context that makes sense of this and I've really got it all wrong - I'm more than happy with that! If anyone can correct my logic above and help me understand it I'd really appreciate it!</p>",
        "id": 210372101,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1600339015
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> Agree  with your remarks - I do take other conclusions (i would just start with less resouurces as I mentioned before) but I believe we'll get there.</p>",
        "id": 210375712,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600341767
    },
    {
        "content": "<p>On IDMP vs FHIR: IDMP is not a technical standard. IDMP defines something in the space of a logical model, but is not a technical implementable standard. So it needs to be implemented. Initially IDMP said \"systems implementing this model shall use SPL for exchanging this information\" but we removed it and it became thus open to use FHIR as well.</p>",
        "id": 210375719,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600341772
    },
    {
        "content": "<p>hi Dion</p>\n<p>The IDMP question is easy. IDMP is a logical model and has no physical expression. So the Medication Definition resources cover that scope (but are not limited to it), and allow you to actually use IDMP. If you want to send IDMP using CSV files or in your own made up XML, you can. But people want to use FHIR.</p>\n<p>Medication is in effect a chopped down profile of the MedicinalProductDefinition resource plus the other Medication Definition resources, yes.<br>\nIt could have been physically a profile of that resource it is true and this was seriously considered as a design choice and discussed at some length by the committees. This approach was rejected because it would mean that Medication, a very key resource in FHIR would be appear much more complicated, for those new to FHIR. It would be a profile - and no core \"resources\" are profiles - and of something that seems very alien to a pharmacy person. The stuff in MPD resource is not that familiar to prescribers (we hear) and they don't need to have it up front. So this was simply a deliberate design choice to make FHIR easier to understand overall. Not a technical choice, a practical ease of use one. Yes it comes with some downsides.</p>\n<p>MedicationKnowledge does reference and not redefine some things such as Ingredient and ClinicalUseIssue (for indications etc). I would like to see more of that and there is ongoing work there. For instance the PackagedProductDefinition resource is being considered for the packaging parts, I understand. I think MK could evolve so the definitional parts are less to be honest, and it becomes more clearly about context. But that is just one opinion and this is all a process of discovering what works best for the people that actually want to use these things. Sometimes a small amount of duplication is better than having to use a huge other structure (you don't want to reference a whole other resource to have \"form\" (a code)). And sometimes it's not.</p>",
        "id": 210375729,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600341780
    },
    {
        "content": "<p>so there was a need to promote a technical standard around regulatory definition of medicines, hence this initiative.</p>",
        "id": 210375780,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600341832
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  on the issue of terminology vs information model, there will probably always be a grey area in the middle yes. I see no problem with codes systems evolving to have more of the properties of information models, such as concrete data. And for fairly static things that is ok. Nether information nor terminology is perfect for all use cases and both will continue to co-exist I am sure. There does come a point when a model like FHIR is just easier to use than the SNOMED model though, imho. </p>\n<p>But the real difference is when you have dynamic data. When you are exchanging data about an evolving product, around different parties, who are updating different pieces (over months or years), you need an update-able model rather than one that is mostly intended to be read only distribution format. Then once you have that need, you have those definitional resources even if you don't intend to update them often. And people may want to use the same structures for both circumstances.</p>",
        "id": 210379579,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600344578
    },
    {
        "content": "<p>We started out this work thinking that there would be a single resource with multiple profiles, but that idea was turned down.  That's why we ended up where we are.  We did work on a common model so that the resources are harmonized where there is overlap.</p>",
        "id": 210383392,
        "sender_full_name": "Melva Peters",
        "timestamp": 1600346777
    },
    {
        "content": "<p>hi Melva, it was turned down in that we didn't want Medication to be a profile of all the Medication Definition resources, but I don't think that decision had any relationship to MedicationKnowledge being a profile.</p>",
        "id": 210383760,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600346987
    },
    {
        "content": "<p>No, the original discussion was to have one single resource and then multiple profiles</p>",
        "id": 210384718,
        "sender_full_name": "Melva Peters",
        "timestamp": 1600347428
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191759\">Melva Peters</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210384718\">said</a>:</p>\n<blockquote>\n<p>No, the original discussion was to have one single resource and then multiple profiles</p>\n</blockquote>\n<p>that should have been our starting point indeed. Long before we had Medication Definition resources I recall some valid opinions (besides mine) in that sense. I missed that turning point.</p>",
        "id": 210386091,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600348010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> and it was, but it was turned down early on - if I remember correctly it was at the September WGM in San Diego</p>",
        "id": 210394050,
        "sender_full_name": "Melva Peters",
        "timestamp": 1600351398
    },
    {
        "content": "<p>The reasons it was rejected are still valid today</p>",
        "id": 210396304,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600352337
    },
    {
        "content": "<p>I personally don't know those reasons. <br>\nBut I also expect that there are opposite reasons as well, especially looking back and seeing how clear, lean and clean are our resources..</p>",
        "id": 210398107,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600353110
    },
    {
        "content": "<p>I.e. I'm sure we had valid reasons, but looking at what we have today, that seems far from a final decision. We took the best decision possible with the information we had, but today we have more info</p>",
        "id": 210398298,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600353188
    },
    {
        "content": "<p>Some of the reasons were mentioned just above. One of them was this: <br>\n\"This approach was rejected because it would mean that Medication, a very key resource in FHIR would be appear much more complicated\"<br>\nYou can read the rest of the text around it above. You may disagree with it, but there reasons are there to know. That was true then and it is true now.</p>",
        "id": 210399375,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600353629
    },
    {
        "content": "<p>I did not know where to find those, sometimes I miss things in Zulip. And I don't disagree with one argument.</p>",
        "id": 210403141,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600355201
    },
    {
        "content": "<p>We took the best decision possible with the information we had, but today we have more info</p>",
        "id": 210403173,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600355219
    },
    {
        "content": "<p>Just so we can be sure we are all on the same page, here are two more reasons why there isn't one big resource. These applied at the time the consensus decision was made and seem to still be valid:</p>\n<p>Products and tablets and packages and ingredients, although all \"medicinal product things\" are significantly different entities, that have different properties and have different roles. </p>\n<p>You need individually addressable items of each, to cope with the known use cases.</p>\n<p>You can have one huge model that has all of them in and then profile them down into useable chunks.<br>\nBut there is no need to make an actual huge FHIR resource with hundreds of classes in it, purely to then profile it and never use it. We just \"profiled\" the logical superset model to make resources.</p>\n<p>Whether we chose the exact correct set of resources and boundaries is a different issue. <br>\n(One resource too many may result in a little extra fluff, or an relatively unused resource, but if you have two entities combined that need to be addressed separately, there is no easy way out of that.)</p>\n<p>We gave it our best effort and we are now implementing to see if it works (as is the FHIR way).</p>\n<p>Another approach would be to have one overarching model that was somewhat smaller but very generic.<br>\nYou could model products and tablets and as one thing \"MedicinalProductEntity\", having attributes called \"property\". <br>\nBut that thing would be so generic as to be unusable, other than as a meta model. <br>\nFHIR is not like that (it's deliberately not the RIM), and doesn't have resources like that. </p>\n<p>If you want a higher level logical model then you can, but in the end you need resources.</p>",
        "id": 210404995,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600355881
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210404995\">said</a>:</p>\n<blockquote>\n<p>Products and tablets and packages and ingredients, although all \"medicinal product things\" are significantly different entities, that have different properties and have different roles. <br>\nYou need individually addressable items of each, to cope with the known use cases.</p>\n</blockquote>\n<p>OTOH, there are many other medicinal product things, with a different mix of properties. Sticking to one resource makes those cases more complicated - and those cases will be the norm before and after IDMP. The need for individually addressable items is also covered by one resource with N profiles.</p>\n<p>This is one valid reason (I don't think anyone is arguing that), just that there are more use cases and therefore other reasons. What is the second reason?</p>",
        "id": 210406515,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600356539
    },
    {
        "content": "<p>One resource with N profiles ends up unusable if the N things are categorically different and yet need to be used in close associations.</p>\n<p>The individually addressable things need to have usable names. </p>\n<p>If I want to represent a product with packaging and tablets in it, it's not easy if they are all called product and they have a product inside with products inside that which are made out of products. </p>\n<p>That is exactly why V3 failed. No one thinks that way.</p>\n<p>We know there are more use cases, and I can repeat: we are not done yet. We await your, and everyone's, other use cases. But we need to make some progress while we are waiting :-) </p>\n<p>(btw the two reasons I stated were: <br>\none huge model doesn't work <br>\nand <br>\none super generic model doesn't work. <br>\nBut it you want to model it as one generic answer with two profiles, that is up to you :-)</p>",
        "id": 210408229,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600357310
    },
    {
        "content": "<p>I don't understand \"up to you\" - We are trying to give feedback to reach a joint approach.</p>",
        "id": 210422521,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600363735
    },
    {
        "content": "<p>IDMP was supposed to be based on SPL (one super generic model IMO).</p>",
        "id": 210422599,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600363779
    },
    {
        "content": "<p>that was just a little joke Jose</p>",
        "id": 210422693,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600363809
    },
    {
        "content": "<p>anyway, it's not that we have yet any feedback from implementers - we do know how drug DBs work; we know how prescription and supply systems work; devices too. What we do not have is great experience in regulatory models post-idmp.</p>",
        "id": 210422728,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600363829
    },
    {
        "content": "<p>re SPL, yes and it was a terrible idea. </p>\n<p>The idea to do IDMP on SPL was because SPL was the only thing around, 10 years ago. Indeed a super generic model (at least CPM that it is based on) and deeply flawed because of it. As soon as FHIR came along it was realised that it was far easier than SPL and V3 in general, so we moved along. We don't do super generic now and are better for it. </p>\n<p>It was only the implementation guide for IDMP that was about SPL anyway, the actual standard itself was not.</p>",
        "id": 210423813,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600364323
    },
    {
        "content": "<blockquote>\n<p>It was only the implementation guide for IDMP that was about SPL anyway, the actual standard itself was not.</p>\n</blockquote>\n<p>I'll check that later. I remember suggesting a change, and I think it was to one of the 1161x standards</p>",
        "id": 210426479,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600365458
    },
    {
        "content": "<p>It's history</p>",
        "id": 210426723,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600365552
    },
    {
        "content": "<p>I hesitate to wade in here but I'll hopefully end up unscathed.  <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> you can correct my words about MedicinalProduct if I say anything incorrect.</p>\n<p>RESOURCE USE CASES<br>\n1) Medication - used for the simple specifying of products for prescribing, dispensing, administration, and other uses.  Allows for the specification of a code for coded products or a simple recipe of ingredients for compounds/extemporaneous products.<br>\n2) MedicinalProduct (and its associated resources) - used for the complete specification of a medication.  Primarily used for the regulatory registration of medicinal products.  It has some affinity to IDMP but is NOT IDMP-on-FHIR.<br>\n3) MedicationKnowledge - used for the representation of medications in drug knowledge bases and formularies.  Has more definitional information than Medication but less than MedicinalProduct.  It also includes information about the medication that is non-definitional (costs, classifications, guidelines, etc.)</p>\n<p>In terms of maturity (ignoring the FMM levels for now and purely from my perspective), I would say that Medication and MedicinalProduct are further along in their ability to progress than MedicationKnowledge.  I know that there are a number of projects/groups working to advance the MedicinalProduct space.  Unfortunately, although Pharmacy has had initial conversations with knowledge base vendors and formulary creators, we have not had the uptake we desired, so a lot of our data elements are speculatory in that we've looked at existing formularies and knowledge base products and tried to model those as best we can.</p>",
        "id": 210430069,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600367080
    },
    {
        "content": "<p>sounds about right to me. The grey area is probably \"drug dictionaries\", which I think are distinct from knowledge bases (discuss). I think they need more than what is in MK.</p>",
        "id": 210430797,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600367410
    },
    {
        "content": "<p>there is overlap between those 3 use cases. We can keep trying to define boundaries by convention - it will always be fuzzy.</p>",
        "id": 210446931,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600374748
    },
    {
        "content": "<p>and we can try to arbitrate a boundary between drug dictionaries and knowledge bases, (and drug databases ?)...  (why?)</p>",
        "id": 210447208,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600374888
    },
    {
        "content": "<p>BTW, medicinal product and administrable product - i suggested a merge between those. The separation is clear in IDMP, but other than that, I think it will just be messy in practice.</p>",
        "id": 210447317,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600374951
    },
    {
        "content": "<p>yes we did discuss MedicinalProductDefinition and AdminstrableProductDefinition merge the other day. The issue is that one product can have several administrable forms, from several other manufactured items. <br>\nThere is no clear way to represent that without using different resources.</p>",
        "id": 210448937,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600375698
    },
    {
        "content": "<p>different resource instances, not different resource types</p>",
        "id": 210449036,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600375758
    },
    {
        "content": "<p>that is a different issue that we discussed earlier</p>",
        "id": 210449112,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600375791
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210448937\">said</a>:</p>\n<blockquote>\n<p>The issue is that one product can have several administrable forms, from several other manufactured items. <br>\nThere is no clear way to represent that without using different resources.</p>\n</blockquote>\n<p>you can have different resource instances, you don't need two types.</p>",
        "id": 210450533,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600376430
    },
    {
        "content": "<p>yes, that is what we discussed earlier</p>",
        "id": 210451457,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600376843
    },
    {
        "content": "<p>the sizing of resource definition was a few messages ago, but... I would also recommend thinking about the content of each resource type relative to the intended uses of that data. It is far easier to constrain the access control at the resource level, than it is to have data within a larger resource that is useful for different audiences.  For example the system that is responsible for watching stock numbers, and trigger restocking, doesn't really need to know the medicine chemical makeup. I don't claim that use-case is useful, but it seemed to appear earlier to day on this thread.</p>",
        "id": 210461340,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600383314
    },
    {
        "content": "<p>inventory management is a different set of use cases and is a rather different set of resources. Let me try to explain the point here:</p>",
        "id": 210486521,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600414093
    },
    {
        "content": "<p>for regulatory submission (manufacturer to regulator), the regulators have a new standard - IDMP - which defines different concepts:  </p>\n<ul>\n<li>the substance (defining a substance)</li>\n<li>the formulation / presentation of a product (in generic terms), containing attributes like substance, strength, form, -e.g. acetaminophen 500 mg in tablets</li>\n<li>the manufactured item, which links to the previous and contains attributes like manufacturer, brand name, authorization number, etc. - (e.g. ACME tylenol for kids rainbow colors, authorization B20839483)</li>\n<li>the package, which links to previous and contains other attributes like package type, qty per pack.. e.g.  the colored box with 21 tablets in 3 x 7-colored blisters</li>\n</ul>",
        "id": 210487489,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600414825
    },
    {
        "content": "<p>For them, it's fine to have these as very distinct resource types. Because these are things that  (mostly) have different lifecyles, and the attributes are clearly distinguished in IDMP. And they can enforce that, because they are the receivers.</p>",
        "id": 210498510,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600422909
    },
    {
        "content": "<p>National regulators, however, will have it more fuzzy - they will have different kinds of concepts, with a different mix of these same attributes. For example the \"national prescribable product\" in some countries is \"acetaminophen 500 mg tablets, box of 20, independent of brand name\". <br>\nThese concepts have their own lifecycle (a national lifecycle). And we do not want to create specific resource types for each concept in each country.<br>\nOverall, the need to exchange these is today more common than the need for IDMP-like regulatory submission.</p>",
        "id": 210498931,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600423229
    },
    {
        "content": "<p>And the drug database / drug knowledge / drug dictionary publishers, they must handle all these concepts. They need to add several types of elements - things like \"official prices\", \"existing literature\", \"history of recalls\", interactions..... And they need to do this on any level, not just the official IDMP levels.</p>",
        "id": 210499160,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600423406
    },
    {
        "content": "<p>that boundary is already fuzzy enough, but even when prescribing, in some cases you need to tell more about the medication - for example in cross-border prescription you need to say </p>\n<blockquote>\n<p>I prescribed \"Italian prescribable code 12345\" - but I can also tell you this is acetaminophen 500 mg tablets box of 20.   </p>\n</blockquote>\n<p>This wil make sure that the receiver side can understand what was prescribed even if they don't know the code</p>",
        "id": 210501317,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600425176
    },
    {
        "content": "<p>these cases are all in the \"prioduct definition / specification\" and a flatter model, with one resource type, that can be profiled in the different concepts, works, and works better.</p>",
        "id": 210501475,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600425311
    },
    {
        "content": "<p>Thanks for the example Jose, that is really useful. That would be like this:</p>\n<div class=\"codehilite\"><pre><span></span><code>&lt;MedicinalProductDefinition xmlns=&quot;http://hl7.org/fhir&quot;&gt;\n   &lt;id value=&quot;Acetamin-500-20-generic&quot;/&gt;\n   &lt;contained&gt;\n      &lt;PackagedProductDefinition&gt;\n         &lt;id value=&quot;Acetamin-pack-20&quot;/&gt;\n         &lt;package&gt;\n            &lt;type&gt;\n               &lt;coding&gt;\n                  &lt;code value=&quot;cardboard box&quot;/&gt;\n               &lt;/coding&gt;\n            &lt;/type&gt;\n            &lt;containedItem&gt;\n               &lt;item&gt;\n                  &lt;reference value=&quot;#Acetamin-tab-500&quot;/&gt;\n               &lt;/item&gt;\n               &lt;amountInteger value=&quot;20&quot;/&gt;\n            &lt;/containedItem&gt;\n         &lt;/package&gt;\n      &lt;/PackagedProductDefinition&gt;\n   &lt;/contained&gt;\n   &lt;contained&gt;\n      &lt;ManufacturedItemDefinition&gt;\n         &lt;id value=&quot;Acetamin-tab-500&quot;/&gt;\n         &lt;manufacturedDoseForm&gt;\n            &lt;coding&gt;\n               &lt;code value=&quot;tablet&quot;/&gt;\n            &lt;/coding&gt;\n         &lt;/manufacturedDoseForm&gt;\n         &lt;ingredient&gt;\n            &lt;reference value=&quot;#Acetamin-ing-50&quot;/&gt;\n         &lt;/ingredient&gt;\n      &lt;/ManufacturedItemDefinition&gt;\n   &lt;/contained&gt;\n   &lt;contained&gt;\n      &lt;Ingredient&gt;\n         &lt;id value=&quot;Acetamin-ing-500&quot;/&gt;\n         &lt;role&gt;\n            &lt;coding&gt;\n               &lt;code value=&quot;active&quot;/&gt;\n            &lt;/coding&gt;\n         &lt;/role&gt;\n         &lt;substance&gt;\n            &lt;codeCodeableConcept&gt;\n               &lt;coding&gt;\n                  &lt;code value=&quot;{acetaminophen}&quot;/&gt;\n               &lt;/coding&gt;\n            &lt;/codeCodeableConcept&gt;\n            &lt;strength&gt;\n               &lt;presentation&gt;\n                  &lt;numerator&gt;\n                     &lt;value value=&quot;500&quot;/&gt;\n                     &lt;unit value=&quot;mg&quot;/&gt;\n                  &lt;/numerator&gt;\n                  &lt;denominator&gt;\n                     &lt;value value=&quot;1&quot;/&gt;\n                     &lt;unit value=&quot;tablet&quot;/&gt;\n                  &lt;/denominator&gt;\n               &lt;/presentation&gt;\n            &lt;/strength&gt;\n         &lt;/substance&gt;\n      &lt;/Ingredient&gt;\n   &lt;/contained&gt;\n   &lt;identifier&gt;\n      &lt;system value=&quot;http://example.nation.org/drugs&quot;/&gt;\n      &lt;value value=&quot;12345&quot;/&gt;\n   &lt;/identifier&gt;\n   &lt;packagedMedicinalProduct&gt;\n      &lt;reference value=&quot;#Acetamin-pack-20&quot;/&gt;\n   &lt;/packagedMedicinalProduct&gt;\n   &lt;name&gt;\n      &lt;productName value=&quot;Acetaminophen 500 mg tablets [generic]&quot;/&gt;\n   &lt;/name&gt;\n&lt;/MedicinalProductDefinition&gt;\n</code></pre></div>",
        "id": 210501557,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600425365
    },
    {
        "content": "<p>@Rik yes, the current model requires you to contain different resource types for something that should be flatter. That is the point</p>",
        "id": 210501711,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600425492
    },
    {
        "content": "<p>This would be a single (?) MedicationKnowledge resource. And in a prescription would be a Medication resource.</p>",
        "id": 210501789,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600425575
    },
    {
        "content": "<p>in a Medication resource it would be a single code, yes</p>",
        "id": 210501859,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600425611
    },
    {
        "content": "<p>no, a medication with extra attributes</p>",
        "id": 210501871,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600425621
    },
    {
        "content": "<p>in practice, implementers are free just say \"I don't care about understanding these IDMP concepts, I just need 4 attributes, so I'll just make extensions to Medication  resource\".</p>",
        "id": 210501927,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600425677
    },
    {
        "content": "<p>I would not recommend ad hoc extension attributes to Medication. </p>\n<p>Also to be fair, if you don't want to implement multiple resources, or don't even know they exist as separate entities, the XML above is effectively just one resource. </p>\n<p>It can be created as one, and sent/stored as one. It just has the extra word \"contained\" in it a few times. Even better in json, it's only there once :-). So the downside is one or two extra lines - I doubt that would phase anyone (and in fact the above XML is actually flatter - less nested - than the one big resource version, where it would go down and down). </p>\n<p>And with this you then do have the possibility of fine grained updates, reusing ingredients across products or packs, in manufacturing plans and so on, which you don't have otherwise - and which is needed. So the multi-resource approach has benefits. </p>\n<p>If we find during testing and implementation that no one uses the levels and it's always contained, then we can look at that.</p>",
        "id": 210510547,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600431609
    },
    {
        "content": "<p>There seems to be a confusion here between <strong>different resources</strong> and <strong>different resource types</strong> <br>\nthe above example contains different resource types. Yes, it's one resource, implementers will know what contained means.</p>",
        "id": 210519590,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600436555
    },
    {
        "content": "<p>I am not interested in one resource. I am interested in less resource types, that can be instanciated more freely.</p>",
        "id": 210519659,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600436592
    },
    {
        "content": "<blockquote>\n<p>And with this you then do have the possibility of fine grained updates, reusing ingredients across products or packs, in manufacturing plans and so on, which you don't have otherwise - and which is needed. So the multi-resource approach has benefits. </p>\n</blockquote>\n<p>Yes, you do have it otherwise.</p>",
        "id": 210519746,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600436641
    },
    {
        "content": "<p>in the XML above, just replace <code>ManufacturedItemDefinition</code>  and <code>PackagedProductDefinition</code> by <code>MedicinalProductDefinition</code>- that will give a sense of the alternative I push towards</p>",
        "id": 210519923,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600436714
    },
    {
        "content": "<p>this seems to be a cause for debate , so I repeat: <br>\nIt's not about \"less resources\". It's about \"less resource types\". Because implementers don't see the boundary between these different resource types. And because that boudnary is only clear in some limited scope</p>",
        "id": 210520392,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600436898
    },
    {
        "content": "<p>Jose - yes I guess we all understand your view. </p>\n<p>The counter view is that a recursive \"thing\" structure that loops back on itself multiple times, with a collection of generic attributes, is very hard for implementers to understand (see V3 CPM). </p>\n<p>Imho that is far worse than the fact there there will be some imperfect boundary conditions, in a complex set of resources. Some areas are not complete, some boundaries need more exploring and documenting, but that doesn't mean it is impossible to complete them to a practically useful level.</p>\n<p>I do believe however that it is impossible to make a super generic recursive structure - supporting at least 4 levels - easy for implementers to use. I know you disagree and that this will likely not change your mind. Nor should it.</p>\n<p>I think the best thing to do is what FHIR does once a committee decision has been reached (which it was a while ago): implement and test. Then gather more requirements, and implement and test again. Would you agree that is a good way forward?</p>",
        "id": 210524294,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600438509
    },
    {
        "content": "<p>A recursive structure that's profiled differently for each layer should largely be indistinguishable for implementers from distinct resources I would think...</p>",
        "id": 210527312,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600439732
    },
    {
        "content": "<p>but when you look at the XML... none of these things will have the right names or the right attribute names</p>",
        "id": 210527787,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600439969
    },
    {
        "content": "<p>I did not ask for a super generic structure à la SPL - I think we should have one structure (or, say a couple), that combine the specific attributes across 2 or 3 of the IDMP levels.</p>",
        "id": 210527802,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600439978
    },
    {
        "content": "<p>so in the regulatory space you can have your file with contained resources. in a drug dictionary, you can have those attributes in a flatter xml. There are options there, and I think both options would work better than this forced separation into IDMP attributes.</p>",
        "id": 210528020,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600440053
    },
    {
        "content": "<p>profiling is not GreenCDA. it doesn't make an ugly model beautiful</p>",
        "id": 210528073,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440071
    },
    {
        "content": "<p>Observation is a single resource, yet implementers manage to handle complex panels with a couple of levels to them.  The 'name' in their heads comes from the Observation.code.  So long as there's a way to tell what you're looking at, implementers can generally handle it, even though Observation.value means different things.</p>",
        "id": 210528084,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440076
    },
    {
        "content": "<p>but we don't use Observation for Condition and for Procedure.</p>",
        "id": 210528179,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440113
    },
    {
        "content": "<p>Also, presumably the attributes would generally mean the same thing across levels - it would primarily be a question of what attributes are permitted.</p>",
        "id": 210528186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440118
    },
    {
        "content": "<p>Why not profiling? MedicinalProductDefinition.identifier could be a PhPID, or a National ID, or a PCID, or ...</p>",
        "id": 210528292,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600440145
    },
    {
        "content": "<p>True. But Jose's assertion is that the different levels of drug representation are more akin to different levels of Observation</p>",
        "id": 210528295,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440146
    },
    {
        "content": "<p>but that premise is false. An ingredient and a tablet and a package - all very different with different properties.</p>",
        "id": 210528348,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440167
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210528348\">said</a>:</p>\n<blockquote>\n<p>but that premise is false. An ingredient and a tablet and a package - all very different with different properties.</p>\n</blockquote>\n<p>they are all product specifications.</p>",
        "id": 210528402,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600440197
    },
    {
        "content": "<p>An ingredient and a tablet aren't so different.  You can have a drug that's a powder or a liquid and you can have an ingredient that's a powder or a liquid</p>",
        "id": 210528475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440229
    },
    {
        "content": "<p>they are also all entities, but that is not really the point. A tablet is not like a package, even if they are both in the same domain</p>",
        "id": 210528516,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440242
    },
    {
        "content": "<p>Tablet and package I will grant are distinct</p>",
        "id": 210528594,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440259
    },
    {
        "content": "<p>the boundary is fluid - in my example I show something that is between the concepts of MedicinalProduct and administrable product and package.</p>",
        "id": 210528646,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600440285
    },
    {
        "content": "<p>they are both made of atoms too. but that is also not really of interest.</p>",
        "id": 210528655,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440288
    },
    {
        "content": "<p>But tablet &amp; ingredient, not so much.  And manufactured tablet with strength vs. not with strength, etc. are not really different things, just different levels of abstraction of the same thing</p>",
        "id": 210528723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440317
    },
    {
        "content": "<p>different roles Lloyd. Is a patient a practitioner? they both are both humans - so they are the same, right?</p>",
        "id": 210528871,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440365
    },
    {
        "content": "<p>Different participations, I think more than roles.  And participations are handled in FHIR using relationships</p>",
        "id": 210528996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440413
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> yes, they are both humans. But when you exchange information about them, their role is clear. and there is hardly a mid-term. That does not happen in this domain</p>",
        "id": 210529058,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600440437
    },
    {
        "content": "<p>The fundamental roles - \"prescribable entity\" and \"administrable entity\" often point ambiguiously to codes that come from any of the levels in real systems.</p>",
        "id": 210529136,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440477
    },
    {
        "content": "<p>But we don;t have the RIM and mandatory profiles. We have resources. Which are easy to connect to each other with specific properties and specific relationships to each other.</p>",
        "id": 210529242,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440509
    },
    {
        "content": "<p>As an example - I was against the addition of yet another level in IDMP for the concept of \"acetaminophen 500 mg tablet box of 20\".  Because these are already possible combinations of IDMP concepts. </p>\n<p>If I did not have the same perspective as I have here now, you could have not 4 but 5 resources because a group of people in Europe suggested a new IDMP concept. And who knows, we would still be adding to the list of IDMP concepts (thus adding more resources?).<br>\nThat is what I am trying to expose.</p>",
        "id": 210529365,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600440567
    },
    {
        "content": "<p>The boundaries of the resources are generally crafted to keep counts down and to avoid making differentiations that aren't consistently represented across pretty much all systems and all use-cases.  And Jose's asserting that, in this case, the granularities currently proposed aren't sufficiently universal and are too tied to a single use-case.</p>",
        "id": 210529520,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440618
    },
    {
        "content": "<p>I'm not pushing for one outcome vs. another because I don't have a strong sense of what's universal in this space, I'm just saying that Jose's arguments may have merit.</p>",
        "id": 210529649,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440668
    },
    {
        "content": "<p>yes he is asserting that. Assertions are just that.</p>",
        "id": 210529676,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440677
    },
    {
        "content": "<p>Is the group confident that there will never be other levels?</p>",
        "id": 210529821,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600440723
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210529520\">said</a>:</p>\n<blockquote>\n<p>The boundaries of the resources are generally crafted to keep counts down and to avoid making differentiations that aren't consistently represented across pretty much all systems and all use-cases.  And Jose's asserting that, in this case, the granularities currently proposed aren't sufficiently universal and are too tied to a single use-case.</p>\n</blockquote>\n<p>The granularities are defined in IDMP, but the many other product dictionaries and national product granularities will differ.</p>",
        "id": 210529864,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600440730
    },
    {
        "content": "<p>what we need is to take the use cases and try them out. If there are things that don't work, we can fix that.</p>",
        "id": 210529891,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440740
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210529821\">said</a>:</p>\n<blockquote>\n<p>Is the group confident that there will never be other levels?</p>\n</blockquote>\n<p>the group should be confident that there ARE many other levels.</p>",
        "id": 210529916,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600440749
    },
    {
        "content": "<p>BR&amp;R have no intention of creating any other levels. If there is opportunity to remove a level, as evidenced by implementation, we will take it.</p>",
        "id": 210530314,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600440899
    },
    {
        "content": "<p>Jose - we don't call everything a \"level\". There are various permutations of data, and a set of resources that can deal with that. It's not perfect, or finished. But unless it can be shown not to work - please <em>show us the gaps</em> rather than just alluding to them - we should continue on our path to implement, test, gather requirements and make progress.</p>",
        "id": 210531100,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600441161
    },
    {
        "content": "<p>I got lost. There are 4.x levels in IDMP, so we have 4 main resource types. my suggestion is to reduce the number of resource types (and harmonize with the clinical ones) so that we can support more flexibility in the number of concepts/levels that we have out there (which are not 4 or 5)</p>",
        "id": 210531399,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600441281
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210531100\">said</a>:</p>\n<blockquote>\n<p>There are various permutations of data, and a set of resources that can deal with that. </p>\n</blockquote>\n<p>Suggestion is to make that set of resource types smaller thus supporting more concepts with a reduced complexity.</p>",
        "id": 210531575,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600441338
    },
    {
        "content": "<p>The problem is not whether it will work - the problem is the ambiguity.</p>",
        "id": 210531690,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600441385
    },
    {
        "content": "<p>But \"make them smaller\" is not a test case or a requirement. We understand your position . We have a set of candidate resources and want to test them out. Until we do that, or have strong evidence that there is sometime that <em>needs</em> to change, we will continue to develop and test.</p>",
        "id": 210531756,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600441420
    },
    {
        "content": "<p>I do not know how else to show the gaps. I gave an example that is common and requires a complicated structure.  The requirement is \"keep in mind that other concepts will exist and people do not know IDMP\". Also \"keep in mind that IDMP is the least mature part of this chain, look at the full lifecycle for ideas\".</p>",
        "id": 210532078,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600441557
    },
    {
        "content": "<p>Also \"support more flexibility\" is not a actionable  thing. Please give specifics that we need to support that we don't cover. And we can look at those.</p>",
        "id": 210532090,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600441559
    },
    {
        "content": "<p>We cannot action: \"be less complicated\" or \"keep in mind that other concepts will exist...\". </p>\n<p>Those are not requirements. We can however gather actual requirements, keeping those things in mind as we do. When we have requirements, we can look at them.</p>",
        "id": 210532589,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600441776
    },
    {
        "content": "<p>take the example above, the one you showed. 4 attributes for a medication, 3 different resource types. If you think that is solid, I can't argue.</p>",
        "id": 210532601,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600441782
    },
    {
        "content": "<p>It works, and also work for other use cases that need the individual resources. The XML is really not that bad and the JSON is better :-) It's FHIR. Please show us a gap.</p>",
        "id": 210532885,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600441894
    },
    {
        "content": "<p>I got the point. I don't know if any requirement we present will meets the intake criteria. If everything is working fine, and if implementers \"just\" need to understand these resources when implementing a national drug repository,</p>",
        "id": 210532936,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600441916
    },
    {
        "content": "<p>then everything is fine, why are we bothering?</p>",
        "id": 210533067,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600441957
    },
    {
        "content": "<p>Seems like one regulator a few years ago: \"we should use IDMP for everything, and nobody can prove to us it won't work\".</p>",
        "id": 210533157,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600441994
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210532601\">said</a>:</p>\n<blockquote>\n<p>take the example above, the one you showed. 4 attributes for a medication, 3 different resource types. If you think that is solid, I can't argue.</p>\n</blockquote>\n<p>I hate to interrupt, but is the example \"acetaminophen 500 mg tablets box of 20\"?  That doesn't seem to be something you'd be using the MedicinalProduct resources for.  What context are you trying to send \"acetaminophen 500 mg tablets box of 20\"?</p>",
        "id": 210533366,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600442068
    },
    {
        "content": "<p>in several countries, this is one of the official concepts of medication that can be prescribed.</p>",
        "id": 210533545,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442134
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210533545\">said</a>:</p>\n<blockquote>\n<p>in several countries, this is one of the official concepts of medication that can be prescribed.</p>\n</blockquote>\n<p>right, but you don't use MedicinalProduct resources for what you are prescribing but to define the product.  I'm not sure you'd send MedicinalProduct instances to say I'm prescribing this.</p>",
        "id": 210533718,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600442173
    },
    {
        "content": "<p>not in a prescription. This is part of the national drug catalog</p>",
        "id": 210533994,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442227
    },
    {
        "content": "<p>again, i'm not sure that MedicinalProduct instances are used in a national drug catalog either.</p>",
        "id": 210534081,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600442276
    },
    {
        "content": "<p>they are in Norway</p>",
        "id": 210534182,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600442313
    },
    {
        "content": "<p>I think the MedKnowledge (which is a super generic structure..) is a much better fit for that. But Rik just showed it works with the current resources.</p>",
        "id": 210534222,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442330
    },
    {
        "content": "<p>ah, okay.  this is where I check out of the conversation and go back to lurking :)</p>",
        "id": 210534242,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600442341
    },
    {
        "content": "<p>no you stay here! :)</p>",
        "id": 210534258,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442352
    },
    {
        "content": "<p>I vote that we agree to disagree and go on to test our resources with real data and requirements</p>",
        "id": 210534483,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600442443
    },
    {
        "content": "<p>I think this is exhausted. It always gets to the same point: a redesign is not necessary because our initial decision still works. And any requirement is a matter of preference.</p>",
        "id": 210534514,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442458
    },
    {
        "content": "<p>no, the point is \"bring us a set of use cases and show us where we can improve\".  the one example you brought forward appears to be handled with the existing structure.</p>",
        "id": 210534712,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600442531
    },
    {
        "content": "<p>Indeed. We work in requirements first. Preferences are not so easy to implement. If the requirements lead to a redesign being needed, then redesign it is.</p>",
        "id": 210534764,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600442549
    },
    {
        "content": "<p>yes, I understand. It works and I cannot say this is messy because, well it works.</p>",
        "id": 210534798,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442571
    },
    {
        "content": "<p>we exist to create working software</p>",
        "id": 210534836,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600442588
    },
    {
        "content": "<p>I can't imagine what requirement will be needed to make reconsider a more generic resource that gets profiled, instead of this variety. <br>\nIs that even conceivable, a requirement that will brig us to the drawing board?</p>",
        "id": 210535037,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442670
    },
    {
        "content": "<p>yes, I have some requirements that I am working through to represent some SPL-like submissions and I have some questions/concerns about the current set of resources.  Once I have determined whether the structures will or will not work, I'll be bringing those forward.</p>",
        "id": 210535187,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600442738
    },
    {
        "content": "<p>An actual requirement yes. \"Have a generic resource\" is not a requirement.</p>",
        "id": 210535206,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600442744
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210534712\">said</a>:</p>\n<blockquote>\n<p>no, the point is \"bring us a set of use cases and show us where we can improve\".  the one example you brought forward appears to be handled with the existing structure.</p>\n</blockquote>\n<p>\"<br>\nNational regulators, however, will have it more fuzzy - they will have different kinds of concepts, with a different mix of these same attributes. For example the \"national prescribable product\" in some countries is \"acetaminophen 500 mg tablets, box of 20, independent of brand name\".<br>\nThese concepts have their own lifecycle (a national lifecycle). And we do not want to create specific resource types for each concept in each country.<br>\nOverall, the need to exchange these is today more common than the need for IDMP-like regulatory submission.<br>\nAnd the drug database / drug knowledge / drug dictionary publishers, they must handle all these concepts. They need to add several types of elements - things like \"official prices\", \"existing literature\", \"history of recalls\", interactions..... And they need to do this on any level, not just the official IDMP levels.<br>\nThat boundary is already fuzzy enough, but even when prescribing, in some cases you need to tell more about the medication - for example in cross-border prescription you need to say</p>\n<p>I prescribed \"Italian prescribable code 12345\" - but I can also tell you this is acetaminophen 500 mg tablets box of 20.</p>\n<p>This wil make sure that the receiver side can understand what was prescribed even if they don't know the code.<br>\nthese cases are all in the \"priouct definition / specification\" and a flatter model, with one resource type, that can be profiled in the different concepts, works, and works better.<br>\n\"</p>",
        "id": 210535389,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442823
    },
    {
        "content": "<p>but I'll have concrete questions, as an example, one I had in the past \"I have one route for my medication and it seems a bit obtuse to have these extra contained resources just to express the route\".</p>",
        "id": 210535429,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600442840
    },
    {
        "content": "<p>Seems a bit obtuse to have 3 resource <strong>types</strong> to convey 4 attributes.</p>",
        "id": 210535574,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600442895
    },
    {
        "content": "<p>btw the XML has more than 4 attributes: <br>\nname, form, strength (fully structured), packaging, inner contents, quantity and identifiers<br>\nand was deliberately constructed to show the levels, not using much of each one. <br>\nIf each was fully populated it would be dozens of attributes in 4 resources.</p>",
        "id": 210536412,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600443232
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210535574\">said</a>:</p>\n<blockquote>\n<p>Seems a bit obtuse to have 3 resource <strong>types</strong> to convey 4 attributes.</p>\n</blockquote>\n<p>Sure, but that is why I'm questioning whether your desire to use these resources for your use case is correct.  I suspect that you would need to convey way more than 4 attributes for your specific use case - a national dictionary of drug definitions.</p>",
        "id": 210536694,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600443349
    },
    {
        "content": "<p>I was assuming there was more unmentioned, otherwise it would just be a code.</p>",
        "id": 210536876,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600443428
    },
    {
        "content": "<p>for a full set of drug definitions, with a 100 or so data items, virtual and actual products and packages instantiating them, its good to use a structure that lends itself to that. You could use Medication resource on its own, with Jose's 4 (or 40) extensions and a reference back to itself for 3 or 4 different linkage types. But I doubt that would cover it and be understandable.</p>",
        "id": 210537710,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600443795
    },
    {
        "content": "<p>Being able to differentiate products and packs is a key thing these models have (and IDMP too). It's good to have at least that structure I think.</p>",
        "id": 210537990,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600443916
    },
    {
        "content": "<p>Being able to differentiate \"administrable products\" and \"medicinal products\" is not a 80% thing, is it?</p>",
        "id": 210551625,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600450470
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210536694\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210535574\">said</a>:</p>\n<blockquote>\n<p>Seems a bit obtuse to have 3 resource <strong>types</strong> to convey 4 attributes.</p>\n</blockquote>\n<p>Sure, but that is why I'm questioning whether your desire to use these resources for your use case is correct.  I suspect that you would need to convey way more than 4 attributes for your specific use case - a national dictionary of drug definitions.</p>\n</blockquote>\n<p>yes, the obtuse part is that the moment you need a new attribute, you must get a new resource type.</p>",
        "id": 210551706,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600450522
    },
    {
        "content": "<p>(btw, in my language <code>obtuse</code> is rather harsh, but I take your lead that it's a proper decent word :-) )</p>",
        "id": 210551819,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600450576
    },
    {
        "content": "<p>Drug route is key and is tracked by well over 80% of drug systems I would say. That is a feature of the administrable product.<br>\nIf it turns out that it doesn't get used in a way that makes it need a standalone resource, we can get rid of it.<br>\nThat is for us to find out.</p>",
        "id": 210556481,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600452903
    },
    {
        "content": "<p>I think there may be other attributes that get dropped when we get to ballot.</p>",
        "id": 210556679,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600453005
    },
    {
        "content": "<p>All drug products in the EU will be registered and tracked in a way that describes the administrable product though.</p>",
        "id": 210556936,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600453154
    },
    {
        "content": "<p>And when I say will, they are at the moment and will be soon in FHIR.</p>",
        "id": 210557163,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600453254
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/IDMP.20product.20levels/near/210556481\">said</a>:</p>\n<blockquote>\n<p>Drug route is key and is tracked by well over 80% of drug systems I would say.</p>\n</blockquote>\n<p>I would say that too if anyone were discussing that.</p>\n<blockquote>\n<p>That is a feature of the administrable product.</p>\n</blockquote>\n<p>It is a feature of a medicinal product. Making it part of a dedicated resource called \"administrable product\" seems a convention (a design option).</p>\n<blockquote>\n<p>If it turns out that it doesn't get used in a way that makes it need a standalone resource, we can get rid of it.</p>\n</blockquote>\n<p>By \"get rid of it\" I assume you mean \"get rid of the resource type\" - that will be a good step. <br>\nMy bet: If you ask regulators/MAHs, they are bound to IDMP, they will love a standard really matching their roadmap. If you ask MPDs providers, I don't think you will have a clear answer.</p>\n<p>All I am asking is to entertain the alternative and support the variety we have out there - because that is much more known and certain that IDMP right now. For me the current approach is a misstep - which is arguable, and given the extensive work so far, I think it is best to move forward (I don't want to stop the train). But we should be aware it is one option, not the only thing that works.</p>",
        "id": 210580551,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600466920
    },
    {
        "content": "<p>Created <a href=\"http://jira.hl7.org/browse/FHIR-28581\">J#28581</a>: Reduce number of resource types for defining a product.<br>\nI think the example above is a perfect illustration of the unnecessary complication. We want to promote IDMP adoption, please consider this feedback.</p>",
        "id": 210673031,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600618149
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> every attempt triggers a lot of writing and negation, and I haven't received a suggestion to talk about it. My suggestion was not understood as I meant it. This is inefficient. And demotivating. Any suggestion? I'm sure we can converge, but it takes two to tango, and a room with music. What is your preference? Can we discuss feedback?</p>",
        "id": 211091328,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600924818
    },
    {
        "content": "<p>Hi Jose, we were having a very long discussion here, which was your chosen forum. <br>\nNow there is feedback about your Jira, on Jira. You can respond there, or here. I'm not sure what you are looking for? <br>\nYou can call for BR&amp;R call agenda time of course, if you have an item you wish to raise.</p>",
        "id": 211097359,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600932597
    },
    {
        "content": "<p>Let's try to keep this positive. What is the time slot we can have to discuss a few changes? I'm not sure Pharmacy has brought some feedback, but I have at least 2 Jira tickets to discuss.</p>",
        "id": 211098468,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600933491
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span></p>",
        "id": 211098664,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600933647
    },
    {
        "content": "<p>when is a good BRR call to continue the previous discussion? I think we had good steps and I don't want to lose that convergence. My proposals are not complicated nor inflexible, but information in writing is somewhat lost.  It would be good to converge soon</p>",
        "id": 212678013,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602158319
    },
    {
        "content": "<p>hi Jose - you may want to have a look at recent evolution of the models. The need for multiple levels, for the simpler cases, has been largely resolved I believe. This may affect the applicability of your outstanding Jira. You use a single MedicinalProductDefinition resource for: identifiers, names, form, routes, legal status, classifications, ingredients, package type, cross references, manufacturer, description and other characteristics. I expect that will cover most of the simpler use cases, and it is also of course still possible to use the richer structures when required.</p>",
        "id": 212680933,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602160014
    },
    {
        "content": "<p>So when is a good time to join a call?</p>",
        "id": 213771071,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603106521
    }
]