[
    {
        "content": "<p>Hi, can anyone explain to me the intended use of specifiedSubstance vs substance on the Ingredient(R5)/MedicinalProductIngredient(R4) resource?</p>",
        "id": 189892421,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1583501539
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span></p>",
        "id": 189905010,
        "sender_full_name": "Melva Peters",
        "timestamp": 1583509407
    },
    {
        "content": "<p>Hi Stine</p>\n<p>The specifiedSubstance is a substance that has some extra amount of \"specification\". So instead of just the chemical it would say the chemical as manufactured by some company, or the chemical derived from some specific part of the world, or prepared by some particular process. </p>\n<p>The short answer is that if you don't know that you need it, you probably don't.</p>\n<p>The name can be thought of as meaning \"fully specified substance\". And people categorise these by the level of extra detail - this is the \"group\".</p>\n<p>I am never sure that it needs its own special class because it would just be a code like any other. The main rationale for it having one is that you can have several for just one ingredient. These are alternatives e.g. the same chemical can be used from one of several suppliers. If the main ingredient.substance was made 0..* then it makes it look like it represents lots of different ingredients, which we don't want. So this special class is made 0..* while the plain Substance is left at 0..1. </p>\n<p>I'm not that keen on the way its modelled tbh but can't see a better way that doesn't mess up the much more common case of using just once instance of ingredient.substance.</p>",
        "id": 189906978,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1583510537
    },
    {
        "content": "<p>Thanks Rik. Think I'll stick with the \"I'll probably won't need it\".</p>",
        "id": 190074880,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1583764325
    }
]