[
    {
        "content": "<p>Hi, when mapping our implementation of IDMP/SPOR to FHIR R4, we have a question regarding Authorized Authorized Pharmaceutical Dose form which is part of IDMP, but I cant see it in neither R4 or R5 of FHIR. Can anyone comment on why the authorized dose form is not present in the FHIR resource?</p>",
        "id": 201253526,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1592478441
    },
    {
        "content": "<p>hi Stine, IDMP has several dose forms:</p>\n<p>Medicinal Product.Combined Pharmaceutical Dose Form which is at MedicinalProduct.combinedPharmaceuticalDoseForm<br>\n(in R5 at MedicinalProductDefinition.combinedPharmaceuticalDoseForm)</p>\n<p>Pharmaceutical Product.Administrable Dose Form which is at MedicinalProductPharmaceutical.administrableDoseForm <br>\n(in R5 at AdministrableProductDefinition.administrableDoseForm)</p>\n<p>and<br>\nManufactured Item.Manufactured Dose Form which is at MedicinalProductManufactured.manufacturedDoseForm<br>\n(in R5 at ManufacturedItemDefinition.manufacturedDoseForm)</p>",
        "id": 201255686,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1592480216
    },
    {
        "content": "<p>Yes, I am aware, but isn't also \"Authorised Pharmaceutical Dose Form\" connected to/on Medicinal Product, as in the dose form that was approved?</p>",
        "id": 201260010,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1592483034
    },
    {
        "content": "<p>hmm, where are you seeing that name? The product as a whole gets authorised, and the form is one of its defining attributes, but not with that name in IDMP. The authorisation itself is in a RegulatedAuthorization resource (in R5), which points <em>in</em> to the product, and so is not shown (though its a key thing).</p>",
        "id": 201264751,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1592485746
    },
    {
        "content": "<p>Its in the PMS Logical Data Model from EMA. I see now that in an email I're received from someone working with SPOR and the EU IG  is having a discussion on this, they say the authorized form is not in IDMP, so I guess it's a SPOR detail. Are the FHIR resources being created directly from IDMP, or is the SPOR work also being taken into account?</p>",
        "id": 201354355,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1592545241
    },
    {
        "content": "<p>The FHIR resources intend to cover all the requirements for this domain industry wide, and are no way limited to IDMP or SPOR. I don't think any new form is needed above what is in IDMP, it's just a matter of the form being licensed (via the product). It's not a different form. </p>\n<p>I worked to map the whole of SPOR and the EMA PMS LDM and the EU IG to FHIR, so I know it is all covered. Let's discuss off line to see where the wires are getting crossed.</p>",
        "id": 201375317,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1592564030
    }
]