[
    {
        "content": "<p>We have a debit/credit model in our domain model when it comes to the dispensing of medication from MedicationRequest. This means there will \"only\" be POST's of MedicationDispense with status either \"Registered\", \"Adjusted\" or \"Reversed\" (freely translated). The problem is I cant really find any natural representation among these native status codes for MD:<br>\n-Preparation<br>\n-In Progress    <br>\n-Cancelled<br>\n-On Hold<br>\n-Completed<br>\n-Entered in Error<br>\n-Stopped<br>\n-Declined<br>\n-Unknown</p>\n<p>It feels like it is not representing the same thing semantically. Any thoughts or experience on this, would love to hear it!</p>",
        "id": 183236096,
        "sender_full_name": "Tobias Cervin",
        "timestamp": 1576138102
    },
    {
        "content": "<p>The medicationdispense.status is intended to convey the status of the action itself, independent of impact, consequences or context.</p>",
        "id": 183246505,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576146464
    },
    {
        "content": "<p>In this case it seems that these are not statuses, rather specific subtypes of dispense</p>",
        "id": 183246596,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576146560
    },
    {
        "content": "<p>Without knowing more, my first suggestion would be to use an extension</p>",
        "id": 183246662,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576146615
    },
    {
        "content": "<p>If however you want to manage the sub-processes of registration, adjustment or reversal, you might be looking at task.</p>",
        "id": 183246724,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576146706
    },
    {
        "content": "<p>In that latter option, appending a task resource to the dispense would mean something like \"by the way, this dispense is expected to trigger a reversal action\"</p>",
        "id": 183246947,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576146897
    },
    {
        "content": "<p>Ah, thank you for quick reply. Will look into Task!</p>",
        "id": 183253050,
        "sender_full_name": "Tobias Cervin",
        "timestamp": 1576152946
    }
]