[
    {
        "content": "<p>Right now, wherever we have OtherCharacteristics, we just have a CodeableConcept.  We need to have the ability to indicate the type of characteristic and the value of that characteristic.  It's not good enough for me to just say \"Red\", I need to say \"Wrapper Colour\" / \"Red\" (to use a contrived example).</p>",
        "id": 175085214,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1567790821
    },
    {
        "content": "<p>I am making gForge tracker items for these, but I thought I'd raise them here as well.</p>",
        "id": 175085228,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1567790834
    },
    {
        "content": "<p>I have also thought that. I assumed it was meant to have only pre-coordinated \"permutations\" of codes. But you can't do that for all colours.</p>",
        "id": 175095631,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567797867
    },
    {
        "content": "<p>There is also Physical Characteristics, if you literally want colours. But all of that could be collapsed into a single repeating pair of Code and Value[x]=code, string, quantity (and boolean)</p>",
        "id": 175098556,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567800013
    },
    {
        "content": "<p>yeah, colour was just an example.  I actually had to express whether or not the product was a combination drug.  So i had a valueBoolean and needed to say what the true/false represented.</p>",
        "id": 175098668,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1567800114
    },
    {
        "content": "<p>Well in the contrived one, in fact your wrapper could be a packageItem component, and that could have physical characteristic of red.  So it's not so contrived, it's in scope.</p>",
        "id": 175098972,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567800359
    },
    {
        "content": "<p>And there may be a use case for CombinationDrug as an attribute in its own right. That has come up before. It can be inferred but not easily (especially if you don't have all the levels). It was \"Co-packaged Indicator\".</p>",
        "id": 175099012,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567800364
    }
]