[
    {
        "content": "<p>We have a few resources to convey \"the relevant characteristics of a medicinal product\". <br>\nSome resources for the top regulators, some resources for the clinical world. <br>\nSome resources aligned to IDMP, others not focused on that.</p>\n<p>Out there, we will have variance. How is FHIR going to support it?</p>\n<p>how do we support the several levels/concepts of medication? For one country, the top level is \"generic\" but for another it will be \"active substance\".</p>\n<ul>\n<li>RxNorm has 2 levels IIRC</li>\n<li>IDMP has several levels (4 concepts, but one of them has several levels)</li>\n<li>DCI / ICD has not levels, but just substances (and is still a target for national prescription)</li>\n<li>Countries have levels of granularity that can be Generic , Brand , Package, etc. this is not a small set. <br>\nThey are all useful.</li>\n</ul>",
        "id": 154010810,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540148670
    },
    {
        "content": "<p>(sorry for repost)</p>",
        "id": 154010811,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540148703
    },
    {
        "content": "<p>in Open Medicine, we could (only?) solve the issue by having a \"master medicinal product attribute set\" from which we could select a couple of attributes to define a Pharmaceutical Product, or a substance, or a branded product... This avoided some ideas to prevent proliferation of concepts.</p>",
        "id": 154010812,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540148933
    },
    {
        "content": "<p>I personally am inclined towards a \"master\" definitional resource that can be profiled, rather than several resources with specific purposes. <br>\nThis could include regulatory needs (e.g. a Pharmaceutical Product is a Medication Definition for which Substance, Strength, Dose Form... are present, medicinal Product is one where Manufacturer, brand... are present.\"</p>",
        "id": 154010813,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540148933
    },
    {
        "content": "<p>I know this will get interesting when looking at medicinal products that have two pharmaceutical products (e.g. oral contraceptives, or packages that have different types of antibiotics for a given schedule) but i just wanted to launch the need:<br>\nIDMP is one of the great things that happened in this topic, and we must support it, and provide a bridge to all the other \"medicinal product definitions\" that exist in local regulatory jurisdictions, or inside a given hospital, or inside the context of a given insurance plan...</p>",
        "id": 154010814,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540148933
    },
    {
        "content": "<p>Quoting <span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> </p>\n<blockquote>\n<p>I've thought about this quite a bit too <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> and it does seem a bit awkward at present. It seems FHIR currently has 3 concepts of medications -<br>\n* Medication - used for instance resources in prescribe/dispense...etc events<br>\n* MedicationKnowledge - used to provide reference and definitional information about medicines, e.g. from terminology<br>\n* \"Medication Definition\" resources - appear to be a FHIR rendering of IDMP</p>\n<p>I've spent time working on STU3 representing terminology definitions using Medication because I started before MedicationKnowledge existed. For my use case there were many required extensions to Medication to support what I wanted to do. You can see the latest results at <a href=\"https://medserve.online\" target=\"_blank\" title=\"https://medserve.online\">https://medserve.online</a></p>\n<p>Perhaps moving to MedicationKnowledge will resolve some of these extensions (I'm yet to do that analysis), but both Medication and MedicationKnowledge have this strange (to me) modelling with respect to \"units\" (like a tablet) versus packages (like a bottle of tablets) and the resulting consequence of being able to represent nonsense.</p>\n<p>The \"Medication Definition\" resources are much more detailed in their modelling, separating out this concept clearly, but are also much more detailed than the use case I've got - I want to provide AMT and other medicines terminology content via an easy to consume API, and FHIR makes a pretty good candidate for this.</p>\n<p>So I'm really interested where this goes, but I agree something that is probably more maximal than MedicationKnowledge (maybe split it in two first) and then profiled for various use cases makes sense...but that's just my thought.</p>\n<p>I'd be interested to sit in on that discussion if possible...</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> has provided the details of the calls. The BRR folks are in European time, so timing may be an issue.</p>",
        "id": 154010831,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540188766
    },
    {
        "content": "<p>Re this idea <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  \"I personally am inclined towards a \"master\" definitional resource that can be profiled, rather than several resources with specific purposes.\"</p>\n<p>The issue with this is that by far the most commonly used subset as used in the Medication resource is very much smaller than the full set of data items. </p>\n<p>We have, more or less, ruled out the idea of using an actual FHIR profile of some all encompassing SuperMedication for what the the day to day Medication resource is used for now. Done that way, everyone would need to use a profile of a huge resource, when only a small percentage users actually care about the other 90%. </p>\n<p>Even as someone coming at this from a regulatory point of view, I feel that this puts the burden in the wrong place. </p>\n<p>Having a profiled set of resources has some elegance in engineering terms but would make it hard for implementers. The commonly used things need to be as easy as possible to use.</p>\n<p>Instead, the current thinking is to have a logical supserset model (not directly implementable) and do \"logical profiles\" of it, into Medication, MedicationKnowledge, and MedicinalProduct and the other \"definitional\" resources. </p>\n<p>There will be overlap in physical terms, but this is mitigated by the logical model that documents this, and shows what belongs where. We do plan to refactor as much as possible so that there is little physical overlap between the MedicationKnowledge and MedicinalProduct resources.</p>\n<p>There is perhaps some scope for other parts of the models to be collapsed together however, possibly for instance MedicinalProduct and MedicinalProductPharmaceutical.</p>",
        "id": 154012144,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540479223
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> Not sure if I understand well, but i agree that we should have a logical superset model of whic the definitional resources are profiles.</p>",
        "id": 154012155,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540480589
    },
    {
        "content": "<p>It seems I missed a key point: <br>\nThe \"master definitional\" would be definitional, so including PhP, MP, MedicationKnowledge... but not taking the role of the medication resource used in prescriptions, etc. - which is much smaller indeed.</p>",
        "id": 154012156,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540480600
    },
    {
        "content": "<p>i personally see that when that model exists, MedicationKnowledge could also be a profile of it.</p>",
        "id": 154012157,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540480656
    },
    {
        "content": "<p>Yes this logical model that we (in fact <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>) is drafting, has all the content from PhP, MP, Medication Knowledge etc.</p>",
        "id": 154012159,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540480693
    },
    {
        "content": "<p>and you are  correct (perhaps that is the point i missed), better than a master resource, we can have a logical pattern</p>",
        "id": 154012161,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540480702
    },
    {
        "content": "<p>ok that is what i mentioned before and my preferred approach. in Cologne I got convinced that it was way too early to think of patterns there, so i am happy we are going there</p>",
        "id": 154012162,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540480762
    },
    {
        "content": "<p>So maybe that is the key thing yes, it won't be a FHIR resource, just a UML model to explain how things fit together. So it won't be \"profiled\" in literal FHIR terms. But the effect will be similar.</p>",
        "id": 154012163,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540480811
    },
    {
        "content": "<p>btw, when we get there, I am pretty sure that the boundary between medication resource and medicationDefinition or whatever the name will not be very clear, so i am betting we can also do something there</p>",
        "id": 154012164,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540480816
    },
    {
        "content": "<p>i'd suggest a pattern that can be put in FHIR, like we have for request, etc.</p>",
        "id": 154012166,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540480877
    },
    {
        "content": "<p>(silly) example for boundary medication / medicationDefinitionalResource:<br>\nPatient states they are having a medication, which is the white and red capsule and is for the stomach. that is in a clinical workflow, but even there we are providing enough information about the medication.</p>",
        "id": 154012167,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540480960
    },
    {
        "content": "<p>better example for medication/Definition boundary: openMedicine. Across borders, you cannot point to a medication because a common code does not exist. But you can send all the characteristics you know and those will be used on the other side. In that case, it is a medication / definition thing.<br>\n(i know IDMP will solve all that, but this use case will stil exist, and we are taking advantage of the best of IDMP: A logical model with clearly defined elements.</p>",
        "id": 154012168,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540481106
    },
    {
        "content": "<p>I see Medication and MedicinalProduct (I think this is what you are calling MedicationDefinition) as somewhat like child and parent. Basic version and full version. (MedicinalProduct is really a set of resources \"MedicinalProductEtc\" however). MedicationKnowledge is perhaps more of a sibling of Medication, since it is a different set of information items, rather than more detail. But it's not that clear cut of course, and some of MK is in MPEtc (but some is not).</p>",
        "id": 154012169,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540481191
    },
    {
        "content": "<p>but perhaps we hold that for later. I am happy that we are going towards a UML pattern. That is good news.<br>\nSo my question is: will we then have different resources? i don't see a need, they can be profiles.</p>",
        "id": 154012170,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540481211
    },
    {
        "content": "<p>this big supermodel of medication characteristics is what i call the medication definitional resource. same as \"medKnowledge\"</p>",
        "id": 154012172,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540481266
    },
    {
        "content": "<p>my main point is that I don't see how many resources we will have for the definition bit:<br>\na) we have One single FHIR core resource, of which MP (regulatory), PHP (Regulatory), MK(drug databases), and other custom flavors, like US RxNorm concepts, and other national stuff like NationalProductDefinition, HospitalCodeDefinition, GenericPRoduct,... are profiles. We'd have one resource or pattern, and several profiles.<br>\nb) we have one resource for PharmProduct, one for MedProduct, one for PackagedPRoduct(IDMP), one for NationalPackageConcept, one for \"National Code\"... where will it end?</p>",
        "id": 154012173,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540481508
    },
    {
        "content": "<p>sure, medication is a special case. i am only about the definitions bit.</p>",
        "id": 154012175,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540481551
    },
    {
        "content": "<p>i also definitely don't want a big resource when it comes to instances (one resource on the server for each serial number of the product)...</p>",
        "id": 154012176,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540481640
    },
    {
        "content": "<p>i just think that we should have a way to have a superset of information elements and a proper structure,from which the 80% of the definitions of medications can be profiled. We profile a few core ones,</p>",
        "id": 154012177,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540481693
    },
    {
        "content": "<blockquote>\n<p>my main point is that I don't see how many resources we will have for the definition bit</p>\n</blockquote>\n<p>That is being worked out now. It's too big for one resource though. For instance contraindication is part of this and that is surely a different resource to the product itself.</p>",
        "id": 154012179,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540481807
    },
    {
        "content": "<p>btw MedicationKnowledge is not the name of the superset, nor the same concept. Despite the name it is not \"all the knowledge that exists\" about a medication. It is designed to have the extra knowledge that is commonly needed to support day to day prescribing. That doesn't include all of the regulatory set of data items.</p>",
        "id": 154012183,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540482352
    },
    {
        "content": "<blockquote>\n<p>For instance contraindication is part of this and that is surely a different resource to the product itself.</p>\n</blockquote>\n<p>I don't see how contraindication needs to be a resource. I see how it could be, not why it must be</p>",
        "id": 154012204,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540484960
    },
    {
        "content": "<blockquote>\n<p>btw MedicationKnowledge is not the name of the superset, nor the same concept. Despite the name it is not \"all the knowledge that exists\" about a medication. It is designed to have the extra knowledge that is commonly needed to support day to day prescribing. That doesn't include all of the regulatory set of data items.</p>\n</blockquote>\n<p>That is what I suggested to align. I think the name \"knowledge\" is misleading, and I do know that there is no single way to define a product. Even inside a hospital there will be many medication concepts that need to be defined. Some regulatory, some logistic, some scientific.</p>",
        "id": 154012205,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540485025
    },
    {
        "content": "<p>for example in one implementation, we had to consider the \"logistical definition\" of \"logistic aspirin (as it was seen from the ERP), the \"scientific definition\" of a \"scientific aspirin\" (as it was seen from the drug DBs), the \"regulatory definition\" of the \"regulatory aspirinS\" (as it was from the national catalogs) and the hospital's own definitions (as they were governed in the EHR)</p>",
        "id": 154012207,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540485222
    },
    {
        "content": "<p>all of these are different concepts, different granularities, different IDs.</p>",
        "id": 154012208,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540485240
    },
    {
        "content": "<p>so, for solving these kinds of issues, we need something that we can extend. Hence my idea that we should have one FHIR resource that can hold this information (and which we can constrain or extend)</p>",
        "id": 154012209,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540485293
    },
    {
        "content": "<p>one of the key enablers of openMedicine was to provide that bridge, from the IDMP concepts to \"any\" concept/granularity of medication.</p>",
        "id": 154012210,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540485381
    },
    {
        "content": "<p>and iirc that was one of openMedicine's requests to HL7: <br>\nsupport definitions of products, and make sure that FHIR supports conveying different kinds of product information, whether they are IDMP concepts or other concepts, without trying to model the entire set of medication concepts.</p>",
        "id": 154012214,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540485497
    },
    {
        "content": "<p>Well we do aim to cover that request. Let me know if you see that the current thinking does not fit with that.  </p>\n<p>There will definitely be some challenges with what to call things, that is inevitable and ultimately unavoidable. But good discussion and good documentation should mean we can land on names that work. </p>\n<p>Why would contraindication not be a resource? it is a repeatable reusable chunk. You may want to add one to a product that already exists (possibly in some other repository or code system), hence it needs its own lifecycle. It may be about a Medication or a MedicinalProduct, or be part of MedicationKnowledge, or some other treatment, so that also points to something that is separate. Those all suggest it being a resource.</p>\n<blockquote>\n<p>Hence my idea that we should have one FHIR resource</p>\n</blockquote>\n<p>Can you describe which data items would be in this resource and what its scope is?</p>",
        "id": 154012854,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540648905
    },
    {
        "content": "<p>contraindication seems to be an attributed relation between a product and a condition (or something else). While it makes it interesting, I'm not sure this makes it a viable candidate for resource (but I can't really point at a clear reason, sorry).</p>",
        "id": 154012917,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540666770
    },
    {
        "content": "<blockquote>\n<p>You may want to add one to a product that already exists (possibly in some other repository or code system), hence it needs its own lifecycle. </p>\n</blockquote>\n<p>In my opinion, this is not a valid conclusion. when we add a contraindication to a medication you are not altering the lifecycle of a medication, you are altering the actual medicinal product characteristics as they should be seen by whoever uses it. So it points at a characteristic of a product.</p>",
        "id": 154012918,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540666894
    },
    {
        "content": "<blockquote>\n<p>It may be about a Medication or a MedicinalProduct, or be part of MedicationKnowledge, or some other treatment, so that also points to something that is separate. </p>\n</blockquote>\n<p>In fact, contraindications can be about any level of granularity of product.<br>\nThis example is clearer and while I don't think a contraindication is a separately governed entity, i see why you are thinking of something that can be reused in several places.<br>\nBut if the medication or medicinalProduct or ... are the same resource, the first half of the problem no longer exists - a contraindication can be a characteristic of a product, regardless of the level and type of the product.</p>",
        "id": 154012919,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540667080
    },
    {
        "content": "<p>I think there is one problem that is still not solved - a way to support non-IDMP regulated product definitions. Making one resource for each level is OK if we have 4  to 7 levels like IDMP, but will still need to be used in practice.</p>\n<p>I think medicationKnowledge is closer to that and it reflects most of my ideas, so I am in favour of one MedicineDefinition resource or logical model, that contains information about:<br>\n. What level of granularity it is (PhP, MP, PCP, Generic, HospitalCode, RxNorm,...)<br>\n. A link to a base definition (what is the \"parent\" level product)<br>\n. The identifying attributes of all the IDMP levels. Substance, Strength, Package Size, etc. (<a href=\"http://www.open-medicine.eu/fileadmin/openmed/re_documents/openmedicine_deliverable_3.2_v1b_fin_after_atr.pdf#page=29\" target=\"_blank\" title=\"http://www.open-medicine.eu/fileadmin/openmed/re_documents/openmedicine_deliverable_3.2_v1b_fin_after_atr.pdf#page=29\">http://www.open-medicine.eu/fileadmin/openmed/re_documents/openmedicine_deliverable_3.2_v1b_fin_after_atr.pdf#page=29</a>)<br>\n. Standard extensions (if it is a resource) or core optional attributes (if it is a mode) for all the necessary IDMP regulatory stuff, and them some.<br>\n. Profiles (of resource) or </p>\n<p>How to use: <br>\nIf we want to define a PHP, we have one resource with Substance, route, etc filled in. No MAH, no package<br>\nIf we want to define a MP, we have another resource that points to the PhP(s), and then we fill the rest of the stuff: MAH, Brand Name...<br>\nIf we want to define any another granularity level, we pick their characteristics:</p>\n<ul>\n<li>a US NDC can point to the RxNorm(?) parent and provide the brand name and manufacturer...</li>\n<li>A European \"Hospital Code\" or \"national dispense code\" links to the PhP, adds package size '''without''' specifying the manufacturer.<br>\n..</li>\n</ul>",
        "id": 154012926,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540668097
    },
    {
        "content": "<p>hi Jose, we still have the basic issue that the most commonly used entity - Medication - should not be a profile of a much larger thing that is not of interest to most users. This I see as a fundamental blocker to all the more elegant designs where everything is profiled sub-type of some large model.</p>\n<blockquote>\n<p>I think there is one problem that is still not solved - a way to support non-IDMP regulated product definitions. </p>\n</blockquote>\n<p>Do you have specifics on why what we have drafted now doesn't work for that?</p>\n<p>What is drafted now could be joined up into one super resource, but it would become a big monolith.</p>\n<p>If I want to assert a contraindication or an interaction, I don't want necessarily want to update the product definition. I may not even have write access to that. Or I may only want to refer to the code for a medication. There may be no product resource for the contraindication to live in.</p>",
        "id": 154012961,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540671720
    },
    {
        "content": "<blockquote>\n<p>If I want to assert a contraindication or an interaction, I don't want necessarily want to update the product definition. I may not even have write access to that. Or I may only want to refer to the code for a medication. There may be no product resource for the contraindication to live in.</p>\n</blockquote>\n<p>Ah, the way I see it, you do want to update the product definition. Not the \"regulatory\" product definition, but if you say \"as of now I am stating that this may interact with that\", you are defining a product characteristic</p>",
        "id": 154013253,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540826358
    },
    {
        "content": "<p>possibly the cause for some communication mismatch: Products will be defined along the chain - first by the manufacturers, then by the regulators (Regional and national) and then further defined or enriched in the hospital, then in the ward...</p>",
        "id": 154013254,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540826483
    },
    {
        "content": "<p>So if you consider that all products are defined at top level, then <br>\na) it's hard to fit the continuum to medicationKnowledge in that picture<br>\nb) yes, you would need a big monolith<br>\nc) that is not what I am proposing.</p>",
        "id": 154013255,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540826571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - how does an interaction complement or relate to an allergic reaction?  Is the \"interaction\" product specific and not based on a specific patient whereas an allergic reaction is patient specific?   (which brings up the related question of how do these contraindications and interactions relate to the AllergyIntolerance resource?  In HL7 V2.x there seemed to be some overlap since an AL1 or IAM could be defined by the type, e.g. drug or food, etc.)</p>",
        "id": 154013256,
        "sender_full_name": "John Silva",
        "timestamp": 1540827134
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I am not disputing that an interaction is a characteristic of a product, just saying that it is not always good to have every characteristic of a product in one resource, for practical reasons.</p>",
        "id": 154013290,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540830398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> The idea of the current resource (MedicinalProductInteraction) is that it is definitional and refers to a known interaction that can happen. It is not any particular instance of it actually happening. It's what might be written on the piece of paper inside the packet of tablets.</p>",
        "id": 154013292,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540830738
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> agree that on an instance of the resource you may not want to have everything.</p>",
        "id": 154013308,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540832593
    },
    {
        "content": "<p>But I don't yet see a way to support the cascading and enriching of product definitions unless we have a pattern that can be instantiated differently in different instances</p>",
        "id": 154013309,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540832728
    },
    {
        "content": "<p>So concretely if a product is defined as having a contraindication on the regulatory side, when the hospital defines their own flavour of the product they would use the same resource type but trim down some of the attributes and create a new resource instance. And conversely if that internal redefinition means that a new granularity is defined and the new code is justified then they have this new instance of the same resource type but with other code</p>",
        "id": 154013310,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540832887
    },
    {
        "content": "<p>I can work out a better example, but please consider the national product concepts that include active substance, strength, package size. This is an official product definition, and not an idmp concept. And it will have attributes like contraindication and indication.</p>",
        "id": 154013312,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540833145
    },
    {
        "content": "<p>And then in the hospital they have what we called the\"logistics product\" whose definition is the ERP code, short name, distribution constraints, barcodes and what not.This is a catalogue the Hospital will publish regularly, and linking to the regulatory product definitions</p>",
        "id": 154013313,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540833303
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> as Rik says here we are not looking at workflows. Only the product definition . FHIR allows us to make a very nice and clear distinction between a) a product being known for causing some allergies, b) a patient being known to have some allergies to some medication and c) a patient actually having an event of allergic reaction. This present discussion only covers item a)</p>",
        "id": 154013314,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540833710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - OK, thanks for the clarification.   I thought that the AllergyIntolerance was only for recording 'instance' info but wanted to clarify.  (I guess I'm still trying to understand the workflow side of things so my questions lean towards that.)</p>",
        "id": 154013317,
        "sender_full_name": "John Silva",
        "timestamp": 1540834820
    },
    {
        "content": "<p>For all the above definitions of product, I think that MedicationKnowledge is the one that provides a more versatile approach. it can support different levels of products in catalogs.</p>",
        "id": 154013392,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540846223
    },
    {
        "content": "<p>Remember that MedicationKnowledge, despite the name, was never intended to be the source of all knowledge of the product. It has a different scope. It's not intended to be huge model that can polymorphically represent all levels of products. Think of it as \"MedicationPrescribingSupportData\", or something. Yes we need something somewhere that has that it all, but let's not reuse the current definitions. I see this big model as a logical model, only, with concrete expressions that are cut to best match how users would like to use them, and in chunks that are palatable in size and ability to be comprehended. We don't want common product model back again :-)</p>",
        "id": 154013691,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540917485
    },
    {
        "content": "<p>I had the name \"medicationDefinition\" exactly because there is no central whole knowledge about a product. <br>\nBut I would want to hav something that while not representing all levels, can represent any level - for the simple reason that this is how things are working and will work - there are lots of levels and we should not try to have one resource per level</p>",
        "id": 154013718,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540921759
    },
    {
        "content": "<p>starting with names that are not overloaded is always a good idea, yes :)</p>",
        "id": 154013719,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540921797
    },
    {
        "content": "<p>I am sure the model will work for the IDMP regulatory and prescribing cases, I just want to make sure that there is a continuum there. For scope, I assume that \"product\" can have many meanings, i.e. it can be defined at any level of granularity.</p>",
        "id": 154013721,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540921973
    },
    {
        "content": "<p>We do want to be able to cover products at all \"levels\". I suggest for now we see if the current models fit all the use cases we have. If not we need to re-think.</p>",
        "id": 154013736,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540924138
    },
    {
        "content": "<p>\"all levels\" should be part of \"the use cases we have\", right? (and by \"all, i think you mean \"any\") I hope it is clear that no single resource instance should define more than one product in one level. but one resource type should support several levels</p>",
        "id": 154013738,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540924713
    },
    {
        "content": "<p>The determination of use cases is the task that FMG has put forward to us - Pharmacy and BRR - to determine.  We obviously have implementer need for the current Medication resource and for the IDMP work that Rik is doing.  What we haven't had is a solid implementer requirement for any other use case.  Scott Robertson and I are heading to NCPDP next week to get some support for our current MK resource use case from the participants there and there has been some other work in Baltimore to find implementers who need what MK is proposing to provide.  If there are other implementer needs/use cases that call for other representations, we need to find those out and determine what they need.</p>",
        "id": 154013740,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1540925812
    },
    {
        "content": "<p>The clinical and regulatory use cases are not isolated, and there is the interoperability need . As long as we solve the continuum we should be ok.</p>",
        "id": 154014109,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540997641
    },
    {
        "content": "<p>Hence my bet on a more flexible resource that does not stick to a concept (medknowledge).</p>",
        "id": 154014112,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540997744
    },
    {
        "content": "<p>So, interoperability use case: \"national regulator gets information about products, in the 3 idmp levels; they define national medication concepts of 2 different levels, none of them idmp concepts, and then drug database vendors enrich information at the appropriate levels - some knowledge is added at substance level like classification/schedule, other information is added at other levels such as average expected customer price. And hospitals add more information elements to define local concepts or add local characteristics.'</p>",
        "id": 154014115,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540998298
    },
    {
        "content": "<p>I am just drawing attention that imo this is not a matter of one scope Vs the other. This matter is hard enough to implement, standards should help by supporting the complexity</p>",
        "id": 154014117,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540998375
    },
    {
        "content": "<p>If needed I can produce an example, this is pretty common stuff</p>",
        "id": 154014121,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540998791
    },
    {
        "content": "<p>I've heard this use case a few times but no one can actually tell us of an actual implementer whose software handles all of these cases in one package.  The closest that I've been provided is an implementer who has two different software packages - one for submitting regulatory information and a separate one for maintaining similar information for use in trials.  But even that implementer admitted that it was separate packages and they didn't need one resource but rather just consistent representations.</p>",
        "id": 154014125,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1540999049
    },
    {
        "content": "<p>If you know of European implementers who do have one package that handles the various levels and would push for one resource or profiles, getting them to come forward would be wonderful.</p>",
        "id": 154014126,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1540999134
    },
    {
        "content": "<p>No software does it all (yet). First DB wanted to look at idmp so they may need to cover the entire spectrum.</p>",
        "id": 154014128,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540999189
    },
    {
        "content": "<p>Vidal is engaged with idmp so they will want to do that too - all the way to the hospital because they cover a broad part of that chain</p>",
        "id": 154014129,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540999230
    },
    {
        "content": "<p>I think they are involved in the catalog discussions. <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span> <span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span> ?</p>",
        "id": 154014130,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540999291
    },
    {
        "content": "<p>(sorry, missed post) perhaps check with the catalog discussions <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span>@<strong>Lorraine Constable</strong>@<strong>Claude Nanjo</strong></p>",
        "id": 154014131,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540999377
    },
    {
        "content": "<p>But my focus is that we need a continuum. This the experience I can bring from Integrating this in hospital and from openmedicine.</p>",
        "id": 154014132,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540999579
    },
    {
        "content": "<p>If someone is tasked to procure sufficient use cases so that the design is solid, this will surely emerge</p>",
        "id": 154014133,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540999627
    },
    {
        "content": "<p>Hi Jose. Help me understand this strong statement that all levels must be in one resource type.</p>\n<p>I wonder if your statement comes from the requirement that we want to be able to <em>prescribe</em> at all levels? i.e. have one slot that can carry a code (or reference) to any of the levels. </p>\n<p>That doesn't mean that you need the definition of a pack to be conflated with the definition of a product, only that you can point at either. </p>\n<p>In the UK we can prescribe a pack or a product (manufactured by someone) or a pharmaceutical product (just the \"drug\"). </p>\n<p>You can use the code for any, but behind the scenes these have different properties.</p>\n<p>People who support different levels in the definition will want to track the parts differently. EMA certainly do.</p>\n<p>They want a list of packs (that make up products) to be different from a list of products.</p>",
        "id": 154014188,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1541003296
    },
    {
        "content": "<blockquote>\n<p>Hi Jose. Help me understand this strong statement that all levels must be in one resource type.</p>\n</blockquote>\n<p>Hi Rik. Perhaps it seems as such, i don't say it must be a single resource type. I think it should, becauseI don't see another way to have the flexibility I really think is needed. And perhaps my perspective is not clear, so i can try to explain better</p>",
        "id": 154014253,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541011331
    },
    {
        "content": "<p>(or perhaps it is clear and it is simply wrong - can well be the case)</p>",
        "id": 154014254,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541011373
    },
    {
        "content": "<blockquote>\n<p>I wonder if your statement comes from the requirement that we want to be able to <em>prescribe</em> at all levels? i.e. have one slot that can carry a code (or reference) to any of the levels. </p>\n</blockquote>\n<p>Not only prescribe, but I would want to be able to point to a product at any level (not only the 3 or 7  IDMP levels, but any level</p>",
        "id": 154014255,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541011471
    },
    {
        "content": "<blockquote>\n<p>That doesn't mean that you need the definition of a pack to be conflated with the definition of a product, only that you can point at either. </p>\n</blockquote>\n<p>Agree.  i don't think we should combine the definitions. i actually think we should not try to do so. Defining one package is one resource instance, a product is another instance.</p>",
        "id": 154014259,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541011831
    },
    {
        "content": "<p>From an 'outside perspective' it seems like the differences you are talking about is between a 'data model' and an 'workflow model' (or dynamic/interaction model).    It appears that in order to come to an agreement on the 'data model' there needs to be an understanding of the 'workflow model' to discover what is needed in it.    It would be very helpful if there were a set of workflow models (like the IHE Hospital Pharmacy profile) to help have some concrete use cases to 'test' this 'data model' against.    (To my 'newbie eyes' the IDMP levels seem to be about granularity or specificity of the data model but still do not address the workflow model.)</p>",
        "id": 154014260,
        "sender_full_name": "John Silva",
        "timestamp": 1541011874
    },
    {
        "content": "<blockquote>\n<p>People who support different levels in the definition will want to track the parts differently. EMA certainly do.<br>\nThey want a list of packs (that make up products) to be different from a list of products.</p>\n</blockquote>\n<p>I think that is the (only good) solution, yes. In my implementation, this was indeed the first thing we established to make the problem solvable - different concepts of product with different characteristics. There is a list of substances a list of packages, the list of \"inventory items\", all those were independent. our hospital catalog then just articulated all of those.</p>",
        "id": 154014262,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541012012
    },
    {
        "content": "<p>So, <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> I think the only difference between what you are presenting and I am presenting seems to be this:<br>\nPhP, packs, products have a well-defined set of characteristics. So you can conceive three resource types for this, each having their characteristics. then you can share information about those products.<br>\nBut the moment that you have something that contains a combination of characteristics from more than one level (the \"official hospital product code\" that is common in South Europe and is basically PhP + Pack size), I don't see how we would handle that - we send the PhP characteristics in a PhP resource and then an extension with the pack size? Or another solution I am not seeing atm? This is a simple example of why we must use IDMP as a reference but there are other definitions of products that do not match IDMP.<br>\nSo I am orbiting to a solution that is one resource type, that, depending on what attributes are populated, can inform of a PhP, or a Pack, or a MP, or a \"generic\" or a \"CIP\" or whichever of the many levels are needed.</p>",
        "id": 154014269,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541012446
    },
    {
        "content": "<p>but that is because I don't see a clean way to do it otherwise. Perhaps there is.</p>",
        "id": 154014270,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541012501
    },
    {
        "content": "<p>(BTW, apologies if there is a bit of \"impedance mismatch\" - perhaps you have it well covered and I am just missing it; the fact that I had this discussion a few times may cause me to amplify and try to re-expain something you all are well aware of. But when it comes to the current design, I am still not seeing how this will work outside of the ideal future when everyone talks  IDMP.)</p>",
        "id": 154014272,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541012681
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , that's great. Thanks. That is just what we need. </p>\n<p>Real uses cases that we can try to fit into the models and see if they work, and make changes if not. This is much better than working in the abstract. </p>\n<p>Is this one coded item (for the predefined combination of pharmaceutical and pack), or two (with a second code or number for the pack size)?</p>\n<p>Assuming the former, isn't that just a product? Perhaps you would call it a virtual one.</p>\n<p>But a predefined combination of a drug and a pack size seems to me to fit fine into MedicinalProduct.</p>\n<p>Sure it's not like the full use of IDMP where you have names and manufacturers etc, but that's no problem. None of that is mandatory.</p>",
        "id": 154014779,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1541097736
    },
    {
        "content": "<p>it is one coded item. and it is defined by 4 attributes - substance, strength, dose form and pack size.</p>",
        "id": 154015049,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541146984
    },
    {
        "content": "<p>from what you have described, i did not see a way to have all these in one resource instance without pointing to other definitions.</p>",
        "id": 154015050,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541147133
    },
    {
        "content": "<p>thanks for looking at this - it makes understanding easier and alignment should be much better</p>",
        "id": 154015051,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541147172
    },
    {
        "content": "<p>When this discussion starts talking about products and packaging it got me thinking that the (US) NDC codes do exactly that.  Although your discussion has been about IDMP shouldn't the MedicinalProduct also consider NDC as well?   The 3 segments of the NDC identify:  the labeler, the product ,the commercial package size.</p>\n<p><a href=\"https://www.drugs.com/ndc.html\" target=\"_blank\" title=\"https://www.drugs.com/ndc.html\">https://www.drugs.com/ndc.html</a></p>",
        "id": 154015054,
        "sender_full_name": "John Silva",
        "timestamp": 1541150548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> &gt; did not see a way to have all these in one resource instance without pointing to other definitions.</p>\n<p>That is right, but sometimes that is just how FHIR works. Data is split across resources. You often need more than one resource to represent complex things. If you really need one resource instance you can use contained resources. The data needs to be split for some use cases. It can easily be joined back together for other use cases, that is normal for FHIR. But you cannot easily split something that is too coarse grained. As well as the various MedicinalProduct series of resources, you may have DocumentReferences, Organizations etc. It cannot all be in one resource.</p>\n<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span>  Yes the MedicinalProduct certainly should consider NDC - as well as all similar international systems. It is no way meant to be limited to IDMP, it's just that that ISO standard has been developed specifically to cover a large subset of this sort of data (albeit coming at this from the angle of the regulators rather than the prescribing drug catalogues). The resources do have places for the labeller (I assume this is manufacturer, but let me know if not), the product, and the pack size.</p>",
        "id": 154015222,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1541181103
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> .   Earlier Jose mentioned drug DB vendors like First DB and Vidal.   Are any of these Drug DB vendors involved in the FHIR Pharmacy group or specifically this modeling effort?  (e.g. bedsides above, Pepid, Elsevier, Wolters Kluwer, etc.)   Seems like it would be good to have their input (and experience)</p>",
        "id": 154015225,
        "sender_full_name": "John Silva",
        "timestamp": 1541181687
    },
    {
        "content": "<p>Hi Rik. Thanks. Then we understand each other's preference. Perhaps we can even agree on the solution or leave that open. But this common understanding is what I was missing.</p>",
        "id": 154015227,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541182179
    },
    {
        "content": "<p>I can understand that you have the \"fundamental\" characteristics of products split across resources - that is still not how I would start, but it does have the advantage of anchoring ti a common global conceptual model - the idmp model</p>",
        "id": 154015230,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541182303
    },
    {
        "content": "<p>My question now is: if we have those 2 or 3 \"primary components\", where do you combine them?  In my example, you would have a contained PHP. Contained in what? which resource would you use ? I see a resource called medicineDefinition or medication knowledge or smth playing that role.</p>",
        "id": 154015235,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541182645
    },
    {
        "content": "<p>Otherwise if I am not mistaken, in my example you would be using a resource called \"medicinalProduct\" to represent something that is not an idmp medicinal product.</p>",
        "id": 154015236,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1541182736
    },
    {
        "content": "<blockquote>\n<p>Contained in what? which resource would you use</p>\n</blockquote>\n<p>Contained in MedicinalProduct.</p>\n<p>MedicinalProduct is not synonymous with an IDMP medicinal product. Just because it is inspired by IDMP it isn't meant to only cover things that are exactly like IDMP - at all.  That is just one of the data sets that it aims to cover. It covers things that are \"products\". </p>\n<p>That is something that is prescribe-able, but is more than just a pharmaceutical or a substance. (A counter example might be \"give 20mg morphine\" - really just an active substance). A product is either something listed by a manufacturer, or something that is a \"virtual\" product, a combination that is a pharmaceutical and a pack size perhaps. It's a bit of a subtle definition but you know one when you see one :-) Your thing, if it is given a code and it is not just a pharmaceutical/substance/ingredient, is a product.</p>\n<blockquote>\n<p>that is still not how I would start</p>\n</blockquote>\n<p>It is not how I started either. But I soon realised it was way too big and unwieldy, and also that people want to use the pieces themselves. So it has to be broken up.</p>",
        "id": 154015266,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1541187925
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> Yes we aware of them and very much want to talk to those people. We did have some input in Baltimore, and there is to be some more outreach next week (think  was mentioned earlier in the thread by Jean). If you have contacts with one of more of those you please invite them to be involved.</p>",
        "id": 154015267,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1541188260
    }
]