[
    {
        "content": "<p>What is the difference between AdministrableProductDefinition.producedFrom and MedicinalProductDefinition.ingredient?</p>",
        "id": 215418082,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604386532
    },
    {
        "content": "<p>One describes the ingredients of the product, i.e. the actual substances that make up the product.  The other describes multiple products that are combined to make the administrable product.  For example, 5ml Dopamine 40mg/ml Concentrate for Solution for Infusion + 500ml 0.9% Sodium Chloride Solution.  Each of the producedFrom products will have their own ingredients.</p>",
        "id": 215418733,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604387318
    },
    {
        "content": "<p>NOTE: The definition of AdministrableProduct does a fairly decent job explaining this:  A medicinal product may consist of several items, which need to be combined before administration to the patient. The administrable (or \"pharmaceutical\") product - which differs in that it is now \"mixed\" from its components (if necessary) and is ready for use - is covered by this resource. The components themselves are ManufacturedItemDefinitions.</p>",
        "id": 215418750,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604387356
    },
    {
        "content": "<p>Ok thanks. Is that the difference between what is manufactured by the manufacturer and what is prepared after that?</p>",
        "id": 215419312,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604388050
    },
    {
        "content": "<p>In other words, how would this work for an officinal preparation? I presume the officinal preparation will also define a product that is made by hand in a pharmacy - is there a difference between those 2 concepts? or in the case of officinal preparation the difference fades away?</p>",
        "id": 215419413,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604388166
    },
    {
        "content": "<p>i don't think so.  i've been told that products that are packaged like that (with multiple components that need to be mixed) are done due to potency concerns.  I'm assuming that if they came pre-mixed, the potency would \"fade away\" as it sat on a shelf.</p>",
        "id": 215419425,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604388188
    },
    {
        "content": "<p>this isn't defining a product that is necessarily made by hand in a pharmacy.  it could very well be something that the patient mixes at home.</p>",
        "id": 215419502,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604388257
    },
    {
        "content": "<p>i.e. it comes marketed as multiple separate product components in one package</p>",
        "id": 215419508,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604388271
    },
    {
        "content": "<p>I don't mean to ask whether those preparations would come in mixed or not. I mean to ask if I want to define an officinal preparation, what was  \"ProducedFrom\" is now an \"ingredient\", right?</p>",
        "id": 215419548,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604388313
    },
    {
        "content": "<p>no.</p>",
        "id": 215419560,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604388327
    },
    {
        "content": "<p>an officinal preparation has already been mixed. The patient / nurse just needs to add water and apply.</p>",
        "id": 215419635,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604388372
    },
    {
        "content": "<p>I understand the difference between e.g. contraceptives and antibiotic cocktails that come in one box but are different tablets with different substances altogether (those just happen to be in a same box but are not ingredients, I expect).</p>",
        "id": 215419810,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604388528
    },
    {
        "content": "<p>I guess my question is : If I have one single resource type that describes a medicinal product (manufactured, pharmaceutical, officinal,...) do I need ProducedFrom and Ingredient as separate attributes? <br>\nIf so, would that be the difference between \"this was made from 2 different things and is now one single thing\" vs \"this is given to you as 2 different things, for you to make into 1 thing\" ? Or another difference?</p>",
        "id": 215419989,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604388707
    },
    {
        "content": "<p>yes you do.  If that Medicinal Product comes packaged as two separate products that are mixed together, you need to describe the following things:<br>\na) the packaged product contains two separate products<br>\nb) each of those component products needs to be described: what are each product's ingredients, form, characteristics<br>\nc) you need to describe the characteristics of the final combined product that has been mixed: form, route, etc.</p>\n<p>To properly define the product, you need to define the packaging characteristics of the product as well as the pharmaceutical characteristics of the product.</p>",
        "id": 215420184,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604388905
    },
    {
        "content": "<p>your problem is that you say \"things\" for both substances and products when they aren't the same.</p>",
        "id": 215420201,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604388941
    },
    {
        "content": "<p>to restate your sentences: \"this was made from 2 different substances and is now one single product\" vs \"this is given to you as two different products, for you to make into 1 product\"</p>",
        "id": 215420257,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604388989
    },
    {
        "content": "<p>I've found a product - Xyntha - that comes in two different kits:<br>\na) 4-ml diluent volume, prefilled syringe, needleless transfer system, vial adapter, and a vial of Antihemophilic factor<br>\nb) 4-ml diluent volume, prefilled syringe, with the Antihemophilic factor also in the syringe but kept separate until you use the plunger to mix them.</p>\n<p>They have different AdministrableProductDefinitions:<br>\na) only 1 Part: 4ml syringe: Ingredients: Moroctocog Alfa 2000iU in 4mL; Sodium Chloride 0.036ml in 4ml; Sucrose; Histidine; Calcium Chloride; Polysorbate 80; Water 4mL in 4mL</p>\n<p>b) 2 parts: 1 4mL single-use vial: Ingredients: Moroctocog Alfa 2000iU in 4mL; Sodium Chloride; Sucrose; Histidine; Calcium Chloride; Polysorbate 80.  1 4mL syringe: Ingredients: Sodium Chloride 0.036mg in 4mL; Water 4mL in 4mL</p>\n<p>Both of these kits come with a bunch of other stuff that would also be described in the PackagedProductDefinition (alcohol swabs and some devices like butterfly needles) but are not described in the AdministrableProductDefinition.</p>",
        "id": 215421448,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604390224
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Produced.20From.20.20.2F.20Ingredient/near/215420201\">said</a>:</p>\n<blockquote>\n<p>your problem is that you say \"things\" for both substances and products when they aren't the same.</p>\n</blockquote>\n<p>They are not the same, but my starting point is that they can be expressed from the same resource type (with different profiles).</p>",
        "id": 215422663,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604391373
    },
    {
        "content": "<p>(and it's not a problem, it is a hypothesis)</p>",
        "id": 215422757,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604391476
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Produced.20From.20.20.2F.20Ingredient/near/215422663\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Produced.20From.20.20.2F.20Ingredient/near/215420201\">said</a>:</p>\n<blockquote>\n<p>your problem is that you say \"things\" for both substances and products when they aren't the same.</p>\n</blockquote>\n<p>They are not the same, but my starting point is that they can be expressed from the same resource type (with different profiles).</p>\n</blockquote>\n<p>That will be interesting to see since one is using Substances and the other is using MedicinalProducts.  Good luck! :)</p>",
        "id": 215422846,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1604391538
    },
    {
        "content": "<p>same reasoning there.</p>",
        "id": 215422867,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604391569
    },
    {
        "content": "<p>a) the packaged product contains two separate products<br>\nb) each of those component products needs to be described: what are each product's ingredients, form, characteristics<br>\nc) you need to describe the characteristics of the final combined product that has been mixed: form, route, etc.</p>\n<p>I understand here that we would have indeed 2 attributes: </p>\n<ol>\n<li>How this comes packaged (roughly speaking)</li>\n<li>How this is supposed to be used.</li>\n</ol>",
        "id": 215422996,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604391655
    },
    {
        "content": "<p>For the 1. packaging thing, is there a difference between<br>\n\"this box contains active tablets and placebo tablets\" and \"this box contains 3 blisters totaling 84 tablets\"?  I guess that is relevant for regulators.</p>",
        "id": 215423391,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604391970
    },
    {
        "content": "<blockquote>\n<p>I guess that is relevant for regulators.</p>\n</blockquote>\n<p>yes. And they are a key stakeholder. Plus anyone else who needs the full information. Those that don't need this can simply not use this level of detail. It is our job to make sure these work for people who want full detail, and those who want less detail (but still more than in the basic Medication resource). That is a key design constraint.</p>\n<blockquote>\n<p>They are not the same, but my starting point is that they can be expressed from the same resource type (with different profiles). .. it is a hypothesis</p>\n</blockquote>\n<p>Things that are commonly held to be distinct concepts in the domain, should not be modelled as the same resource type.</p>\n<p>Domain concepts:</p>\n<p>Medicinal product and substance (plenty of evidence that people treat these differently - the ISO Models, the existing  XEVMPD EU wide implementation, that pre-dates ISO, the UK dm+d national drug catalogue)</p>\n<p>Product and packs (plenty of evidence that people treat these differently, the ISO models, the existing XEVMPD EU wide implementation, UK dm+d, and others (the Irish one, the Australian one etc.))</p>\n<p>Observations and procedures (plenty of evidence that people treat these differently, many EHRs implemented worldwide)</p>\n<p>Of course, domains are wide and not everyone treats all these things as different. For very simple uses cases some of these may be the same (undifferentiated clinical notes in a consumer iPhone app for instance, or a UK system I worked on that had \"entry\" records that treated these as the same concept, but with a type code). </p>\n<p>We need to differentiate these for the general case, to make life familiar for domain implementers.</p>",
        "id": 215441832,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604403588
    },
    {
        "content": "<p>I am just opening up a hypothesis of how we can meet the same requirements, let's keep the discussion open.</p>",
        "id": 215442608,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604404029
    },
    {
        "content": "<p>I understand that the content (in terms of \"recipe\" and the content (in terms of packaging) are separate concepts. I can handle that, regardless of whether a medicinal product and an administrable product are the same resource type or not.</p>",
        "id": 215442725,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604404111
    },
    {
        "content": "<p>At some point discussion has to reach a conclusion. Hypothesis are fine, but must be tested, with evidence. In FHIR that means seeing what people are actually doing in implementations.</p>",
        "id": 215443106,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604404345
    },
    {
        "content": "<p>I don't understand. I thought we had an agreement to develop a second hypothesis.</p>",
        "id": 215444752,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604405346
    },
    {
        "content": "<p>In FHIR that means working together.</p>",
        "id": 215444805,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604405393
    },
    {
        "content": "<p>I am not sure what you mean. There is nothing stopping you Jose. We are all working together, and the workgroup is the coordinating group.</p>",
        "id": 215444924,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604405452
    },
    {
        "content": "<p>I have the answer to my question, that allows me to continue working towards a different proposal.</p>",
        "id": 215445875,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1604406104
    },
    {
        "content": "<p>PQ/CMC does not map to Medicinal Product this way.  It there are two products in the package, there are two Medicinal products.  They have completely different quality profiles.  They get combined as an administrable product.</p>",
        "id": 215486657,
        "sender_full_name": "Catherine Hosage Norman",
        "timestamp": 1604425100
    },
    {
        "content": "<p>ManufacturedItemDefinition is the resource that is intended to represent the actual physical tablets, solutions etc, that get mixed. They are not normally considered to be a product in their own right, in the sense of something that is eventually marketed in a packaged form with licensed indications etc. They would have different quality profiles, of course.</p>",
        "id": 215490706,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604426934
    },
    {
        "content": "<p>The diagrams here illustrate this: <a href=\"http://build.fhir.org/medication-definition-module.html\">http://build.fhir.org/medication-definition-module.html</a></p>",
        "id": 215490911,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1604427039
    },
    {
        "content": "<p>I have see the diagram.  That is not how we are mapping.  If there are two products in the eCTD there will be two medicinal products.</p>",
        "id": 215493652,
        "sender_full_name": "Catherine Hosage Norman",
        "timestamp": 1604428413
    },
    {
        "content": "<p>That is the IDMP use case.  We are adapting to this via our profiles.</p>",
        "id": 215493813,
        "sender_full_name": "Catherine Hosage Norman",
        "timestamp": 1604428474
    }
]