[
    {
        "content": "<p>Having looked on the examples of <a href=\"http://hl7.org/fhir/5.0.0-snapshot1/medicinalproductdefinition.html\">http://hl7.org/fhir/5.0.0-snapshot1/medicinalproductdefinition.html</a> I see a high degree of examples that uses <code>contained</code> almost as if it is the preferred way to refer to resources. May I encourage not to do so in all but eg. one example as searching within contained content is a pain.</p>",
        "id": 266750839,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641253506
    },
    {
        "content": "<p>This is really just because we had some specific cases recently that needed illustrating for ballot issues.</p>\n<p>We want to add more examples.<br>\nIf you have other examples, that illustrate different things, please contribute them.</p>",
        "id": 266796765,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641295520
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/use.20of.20contained/near/266796765\">said</a>:</p>\n<blockquote>\n<p>This is really just because we had some specific cases recently that needed illustrating for ballot issues.</p>\n</blockquote>\n<p>The example of VMPP ( e.g. \"paracetamol 500 mg tablets box of 20\" is a global, common requirement) requires several contained resources - which is really messy.</p>",
        "id": 266806589,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641302568
    },
    {
        "content": "<p>I agree with Jens's point</p>",
        "id": 266806909,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641302785
    },
    {
        "content": "<p>Just want to mention that the use of contained resources in BRR resources seems to be fundamental, not just a \"specific case\". The current design makes contained resources necessary</p>",
        "id": 266806977,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641302828
    },
    {
        "content": "<p>(And I see no requirement for that being so)</p>",
        "id": 266807007,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641302856
    },
    {
        "content": "<p><a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Ingredient/near/214370708\">https://chat.fhir.org/#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/Ingredient/near/214370708</a></p>",
        "id": 266807009,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641302860
    },
    {
        "content": "<p>I'd like it to be clear - at the time I was told that we'd use contained resources because that is the intended way. <br>\nNow I am reading that it is considered a specific case?</p>",
        "id": 266807581,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641303194
    },
    {
        "content": "<p>The full representation of a product, and its lifecycle, needs more than one resource. In some use cases that full representation is not needed, so it is possible to use the resources as contained - but you don't have to. A \"one resource\" model doesn't work for all use cases, and a multi-resource model does work, but is a little complex for some use cases. So we compromise on the model that works, knowing that it is not perfect for everyone.</p>",
        "id": 266814597,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641306977
    },
    {
        "content": "<p>If the question is \"do I have to use contained resources with this product model?\" then the answer is simply \"no, you do not\". If the question is, are the some circumstances where it makes sense to use contained resources, then the answer is yes. I think that is true of all sets of related FHIR resources.</p>\n<p>We want all uses of this set of resources to be as consistent as possible. In some uses cases there is not enough data or workflow to make populating a standalone resource desirable, and a contained one is more convenient (and we can show examples of that, because they may be less obvious than some other cases). But it is always possible to use the standalone resources. The two solutions will both use the same resources and attributes, and so are consistent.</p>",
        "id": 266820110,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641309522
    },
    {
        "content": "<p>The question is:  Do we have to use contained resources for something that is a common, global, legal requirement?<br>\nThe answer seems to be - with this approach, yes.</p>",
        "id": 266828815,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641313301
    },
    {
        "content": "<p>The other question is: Could this be avoided for that use case, while maintaining the support for the others? The answer is - yes, if we simplified the resources.</p>",
        "id": 266828823,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641313303
    },
    {
        "content": "<p>The examples in the core spec should focus on the common use cases.</p>",
        "id": 266829182,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641313393
    },
    {
        "content": "<p>If for such a common use case our core spec example uses contained resources, then I'd say something is wrong - either the example or the resources.</p>",
        "id": 266829278,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641313422
    },
    {
        "content": "<p>(There are several places where we have contained resources in the examples, but in those cases we can see it's an editorial simplification, not a functional need)</p>",
        "id": 266829548,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641313487
    },
    {
        "content": "<p>As stated previously, you do not have to use contained, but it is an option.<br>\nWe put contained in the examples for 2 reasons. <br>\nFirstly that use is not as obvious, so needed an example. When a case comes up that needs an example, we add an example.<br>\nSecondly we thought at one point that examples for a resource had to be of the type of that resource. That is a problem for a multi-resource examples. Only later did we realise that Bundles were allowed (though they can also obscure the use case somewhat). So some contained examples here are editorial, indeed. <br>\nThe set of examples there is not fixed and doesn't reflect the frequency of any given scenario. The same is true of other resources. We don't add thousands of basic Patient examples and just one for a less common scenario. We try, eventually, to cover all the scenarios.</p>",
        "id": 266834788,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641315664
    },
    {
        "content": "<p>Re simplifying the model, we can only do that if it doesn't block the more complex common requirements and doesn't lead to inconsistent representation. We could simplify package representation by redundantly repeating the package name - your example - on the product. But then there are two places to put it. We know that some uses cases need a separate resource for packages (at least because of lifecycle issues, and because of the legal requirements you mention in fact - the ability to point at a package with an authorisation). The resource can be used contained if need be (but doesn't have to be), and that is consistent with the standalone resource pattern - using the same name attribute. This maintains the requirement for consistency, at the expense of some inconvenience in certain use cases.</p>",
        "id": 266836282,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641316356
    },
    {
        "content": "<p>The fact is that the richer solution works for the simpler but not vice versa.<br>\nAnd if the richer solution is necessary for the known current requirements, and is not just blue sky modelling, then that has to be chosen over the one that is too simple or is inconsistent.</p>",
        "id": 266836724,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641316576
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/use.20of.20contained/near/266836282\">said</a>:</p>\n<blockquote>\n<p>Re simplifying the model, we can only do that if it doesn't block the more complex common requirements and doesn't lead to inconsistent representation. </p>\n</blockquote>\n<p>Does that mean that BRR would entertain an opportunity to do that?</p>",
        "id": 266845609,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641320945
    },
    {
        "content": "<p>I think FHIR would benefit from a Package approach that is consistent with other resources that have the same requirement. From my perspective, a Packaging or ItemPackage or PackagedItem deserves its own resource type.</p>",
        "id": 266845843,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641321080
    },
    {
        "content": "<p>The rest of the simplification I'd propose is for better supporting IDMP especially in its necessary ambiguity and in supporting other requirements - I believe the example I mentioned is is a core DM+D concept, so it's pretty much universal.</p>",
        "id": 266846120,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641321242
    },
    {
        "content": "<p>I don't speak for BR&amp;R but any workgroup will always look at new actionable proposals. You would have to bear in mind that many of these ideas have been discussed at great length already. I doubt there is an appetite to revisit ideas already covered unless there is significant new information.</p>",
        "id": 266846211,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641321281
    },
    {
        "content": "<p>Having an alternative was never discussed at lenght. \"whether ould have an alternative\" was argued against at length, but I never had 30 minutes to present such an alternative.</p>",
        "id": 266846285,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641321333
    },
    {
        "content": "<p>(at least my alternative, which was: stick to one MedicinalProductDefinition, make 3 core profiles, get rid of Ingredient)</p>",
        "id": 266846371,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641321383
    },
    {
        "content": "<p>\"significant new information\" - there's just more practical experience and more fundamented hestitation to use such complicated resources.</p>",
        "id": 266846620,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641321519
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> my point is: If 5 out of the 8 examples heavily depend on <code>contained</code> resources, then you are also passing that message on by \"illustrating/leading by example\" - and that is probably not what you want to do. Especially not if you want the <code>contained</code> items to be searchable or leading to the actual resource. That was just my concern - but I don't know your use cases which may be valid reasons to make the examples the way you/others did them.</p>",
        "id": 266846896,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641321665
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> BR&amp;R had 2 one hour sessions discussing your ideas and we stopped when there were no further new points being made. Please let us know specifics about the extra implementation experience you now have.<br>\n<span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> agree that contained is over represented currently. Reasons are given above and it will be improved.</p>",
        "id": 266849364,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641322997
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> BRR had a long discussion about whether to discuss the ideas. There was never a substantial discussion, only arguing against entertaining changes</p>",
        "id": 266849598,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641323128
    },
    {
        "content": "<p>Best to take it up with the BR&amp;R co-chairs Jose.</p>",
        "id": 266849743,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641323202
    },
    {
        "content": "<p>I had the chance to express my concern after waiting months for an opportunity to express the alternative, being told it was too early, and then immediately after being told that it was too late.</p>",
        "id": 266849752,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641323207
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/use.20of.20contained/near/266849743\">said</a>:</p>\n<blockquote>\n<p>Best to take it up with the BR&amp;R co-chairs Jose.</p>\n</blockquote>\n<p>Right, that was the indication I had before, and that is what I did. I just I don't want to leave the impression that we did discuss an alternative. we didn't.</p>",
        "id": 266849918,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641323291
    },
    {
        "content": "<p>as for the new information, it is as I mentioned before - I said that using contained resources was difficult (e.g. because of search), and someone in the group said that that that was not true. It seems there was some merit.</p>",
        "id": 266850004,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641323343
    },
    {
        "content": "<p>I was clearly told that contained resources were the way to go.</p>",
        "id": 266850212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641323473
    },
    {
        "content": "<p>so, suggestion is still the same: </p>\n<ol>\n<li>Get rid of Ingredient (which is a modeling artifact, there is no justification for that IMO - whether from drug DBs or from IDMP, or from implementers)</li>\n<li>Support more product concepts by sticking to a \"MedicationProductDefinition\" and create 3 core profiles. (IMO this would better reflect IDMP and can avoid so many contained attributes - the Paracetamol 500 mg is a good, symptomatic example of that: we need to contain several resources just for the purpose of borrowing data elements that actually belong together).</li>\n</ol>",
        "id": 266850536,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641323670
    },
    {
        "content": "<p>If we did that, we would be supporting IDMP much better by bringing IDMP (and other regulations/regulators) outside of the regulatory silo.</p>",
        "id": 266850734,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641323791
    },
    {
        "content": "<p>I hope the additional confirmation that \"contained resources are evil\" helps BRR reconsider. <br>\nAlso the fact that some implementers consider these resources to be in need of simplification.</p>",
        "id": 266850945,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641323910
    },
    {
        "content": "<p>in regards to: \"contained resources are evil\": It can be perfectly valid to use contained resources, but usually (99 out of a 100) it should be your very last resort and don't expect them to be searchable or used as reference or anything like that. In regards to \"someone in the group said that that that was not true\" - that someone should probably try to implement the technical details around it - then we can talk about what is considered difficult.</p>",
        "id": 266853593,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641325429
    },
    {
        "content": "<p>i really really really don't want to tread into this discussion, but I wanted to point out that I believe that many of the entity resources (Medication, Device, NutritionProduct, etc.) will get used as contained more often than not because implementers probably won't have actual resources on their system that they want to reference.  i.e. if I'm sending a medication recipe, I <em>probably</em> won't actually create a Medication resource and then refer to it.  In compounding pharmacies, I would expect resources to be created, but in \"regular\" pharmacies, I wouldn't.  Thus I don't think \"contained resources are evil\" is a valid message.</p>",
        "id": 266854241,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1641325784
    },
    {
        "content": "<p>You could just as well then send a bundle of resources, right?</p>",
        "id": 266854409,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641325864
    },
    {
        "content": "<p>you could, but very often the Entity resource really doesn't have a life of its own.  In the pharmacy systems I've been working with in Canada and the US, medications are either a code (no resource) or a recipe that doesn't have a life of its own, i.e. it is tied to the dispense, so there is never an actual Medication resource in the system's data store.<br>\nIn that case, sending the contained resource as a resource in a bundle seems to me to imply it is a \"real\" resource.</p>",
        "id": 266854894,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1641326105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> I do think there's a valid case to use contained resources. Indeed, when sending a dispense of a medication, you may not have a resource in the server for each serialized medication. That is ok (and the medication resources was the example I consider valid because we don't want to contaminate the focus example, so a contained is fine).</p>",
        "id": 266856598,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641327033
    },
    {
        "content": "<p>The point that made me react is that it seems more pertinent that using contained resource to borrow attributes is not as solid as we discussed, and it was one of the arguments to not have that redesign.</p>",
        "id": 266856795,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641327125
    },
    {
        "content": "<p>I see this as another argument to reconsider the design (having to use contained resources to borrow attributes will not work easily - besides seeming conceptually awkward and functionally unnecessary).</p>",
        "id": 266921400,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641380317
    },
    {
        "content": "<p>But I feel this discussion is still not really welcome.</p>",
        "id": 266921564,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641380413
    },
    {
        "content": "<p>I see no functioning mechanism to promote discussion for eventual change.</p>",
        "id": 266921895,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641380592
    },
    {
        "content": "<p>Jose, there is no new information here, especially not about contained (some good opinions but no new facts), so I personally cannot see anything new to discuss. Repeated discussion of the same points is not helpful imho. We know what your proposals are, you have put them forward many times on here, on Jira (where there was lots of discussion), and had opportunity on two dedicated one hour calls. But raise it with co-chairs if you think you have a new point to make.</p>\n<p>Here is my view on the options (taking the example of package name attribute):<br>\na) just use the resource (PackagedProductDefinition)<br>\nb) use it contained<br>\nc) move the attribute to the other resource - but, although good for your case, it is incompatible with many applications<br>\nd) clone the attribute to the other resource - but this breaks consistency<br>\ne) replace all the resources with a profile of one of them - see option c)</p>\n<p>a and b are the only viable options, and no one is forced to use b.<br>\nc, d and e don't work so don't get out of the gate. </p>\n<p>As for e), FHIR is firstly a resource oriented system not a profile oriented one. We don't use profiles to create first class domain concepts. If we did then there would be a Participant resource profiled into Patient and Practitioner, because they share a lot of attributes. But since they are well known to be distinct concepts in the domain (and this is not the RIM) we have two resources and not two profiles.</p>\n<p>The only question then is if products and packages are distinct concepts, and the answer, based on various models (including your own example of dm+d) and practical current implementer experience, is, in the main, yes.</p>",
        "id": 266924754,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641382597
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/use.20of.20contained/near/266924754\">said</a>:</p>\n<blockquote>\n<p>Jose, there is no new information here, especially not about contained (some good opinions but no new facts), so I personally cannot see anything new to discuss.</p>\n</blockquote>\n<p>One of the reasons that an alternative was dismissed was because someone asserted, against my opinion, that search on contained resources was not an issue. I see confirmation that such an fundamental assertion was not solid, based on this additional insight.</p>\n<p>As for the discussion - I think this thread confirms the point - a simple proposal - get rid of ingredient, keep package, combine other resources into 1, and make profiles, which would simplfiy other medication concepts and still guarantee that core IDMP concepts are supported.</p>",
        "id": 266927364,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641384631
    },
    {
        "content": "<p>So, </p>\n<ol>\n<li>\n<p>It seems that some of our starting assumptions/assertions are fragile - technically it won't work well. Up to you and BRR to acknowledge that or not.</p>\n</li>\n<li>\n<p>An alternative was proposed and I was looking at finding middle ground, which there was no chance.</p>\n</li>\n<li>\n<p>You say \"it won't work\" - that is not an inviting argument, especially after things do work.</p>\n</li>\n<li>\n<p>There is not a lot of independent implementer experience on these resources. There is vast implementer experience on alternative ways to represent it - it just seems that you don't want to consider that experience.</p>\n</li>\n<li>\n<p>There seems to be some confusion between distinct resources and distinct resource types. the DM+D proves that the current resources are a mess.</p>\n</li>\n</ol>\n<p>I just wanted to set that straight. From this thread, it seems that as soon as I propose \"perhaps let's discuss\" you say \"nothing new here\".<br>\nIt's almost as Iif I just came here for an argument...</p>",
        "id": 266928114,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641385174
    },
    {
        "content": "<p>I hope it's clear that these 2 issues are still blocking the use of those resources anywhere outside new IDMP-dedicated databases. It's a pity that we have such a silo.</p>",
        "id": 266928360,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641385342
    },
    {
        "content": "<p>I will say again Jose, please bring your new proposals - and especially the implementation feedback that you mention - to BR&amp;R co-chairs.</p>",
        "id": 266929534,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641386155
    },
    {
        "content": "<p>I did. What I am saying is that the proposal is still the same, the ball is in the BRR court (and you) that rejected a discussion. Any chance things would be different now that you got this additional feedback?</p>",
        "id": 266930018,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641386489
    },
    {
        "content": "<p>Is it the same or is there additional feedback? When you had the chance to talk to BR&amp;R at the two specially convened calls, your arguments were not persuasive.  If you didn't manage to make your case in that time, I am not sure what else can be done, unless the case is now different. But please give us your implementers' feedback.</p>",
        "id": 266930402,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641386729
    },
    {
        "content": "<p>I would especially like to hear your dm+d implementation feedback. When I implemented this a couple of years ago for a client (and showed part of it later at a Connectathon), I did have some problems. These were raised as Jiras and brought into the current model. So it would be great if your implementers can raise some Jiras.</p>",
        "id": 266933911,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641388568
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179308-BRR--.20Pharmacy.20model/topic/use.20of.20contained/near/266930402\">said</a>:</p>\n<blockquote>\n<p>When you had the chance to talk to BR&amp;R at the two specially convened calls, your arguments were not persuasive. </p>\n</blockquote>\n<p>I don't like this confusion. You should not say the arguments were not persuasive. You said that it was not persuasive to engage in such a change because things were fine (for example that search in contained resources was fine).</p>",
        "id": 266940144,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641392105
    },
    {
        "content": "<p>Please consider that dm+d implementation is unnecessarily complicated (the example in the core spec is clear enough - why would we ever need 3+ resources to convey what is a very common, legal need?). Unlike we were told before, contained is not a good option because we need to search on those.</p>",
        "id": 266940712,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641392428
    },
    {
        "content": "<p>I'd love to have a substantial discussion on alternatives because it is only 2 simple changes.</p>",
        "id": 266940762,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641392454
    },
    {
        "content": "<p>May I suggest that you bring any new proposals and implementation experience to BR&amp;R co-chairs?</p>",
        "id": 266943073,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641393799
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> here it is:<br>\nProcess-wise:  The starting assertion that contained resources were harmless seems not really solid. <br>\nThere are arguments ready, but we stopped at \"why should we discuss this\". \"bring the proposals\" and \"why bringing proposals? they won't work\".</p>\n<p>Content-wise:<br>\nI need something that can contain IDMP and non-IDMP definitions of medication. Current resource types are complicated. The VMPP (Acetaminophen) example shows how messy simple, common things can get.</p>\n<p>I don't have a magic formula except - getting people around a table. Starting proposal is simple: </p>\n<ul>\n<li>Get rid of Ingredient </li>\n<li>\n<p>Collapse AdministrableProdDef with MedicinalProductDef and the \"clinical\" bit of PackagedProduct</p>\n</li>\n<li>\n<p>because it's Christmas - check the overlaps between PackagedProduct and ManufacturedItem, create a ProductPackage that can be reused - not a PackagedProduct, but a ProductPackage</p>\n</li>\n</ul>",
        "id": 266957593,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641400657
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Just to say that every single one of those have recently been extensively discussed on ballot reconciliation and voted on</p>",
        "id": 266958740,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1641401100
    },
    {
        "content": "<p>Right. I wasn't there - see above.</p>",
        "id": 266958818,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641401140
    },
    {
        "content": "<p>BTW, I'm not a BR&amp;R co-chair, so I didn't need to be @ed. :). I'm comfortably using the resources as they exist in the latest R4B snapshot for my SPL project, so I'm good.</p>",
        "id": 266961266,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1641402229
    },
    {
        "content": "<p>I thought you were a co-chair, sorry for that</p>",
        "id": 266961403,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641402278
    },
    {
        "content": "<p>(It's been a while. I don't know if I should expect any response from co-chairs this time)</p>",
        "id": 267846695,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1642068055
    }
]