[
    {
        "content": "<p>In Belgium, a lab can obtain an accredition from a government body. This accredition consists of a number, on organisation level. This accredition can be valid for one or more tests. It is a legal obligation for the lab to indicate for a test if the lab has an accreditation. Do other countries have similar requirements, and how do they go about this?</p>",
        "id": 275209964,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1647249532
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span>  have you seen this?</p>",
        "id": 275557251,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647455270
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I had not.  Thanks for the heads up.</p>",
        "id": 275558548,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1647455831
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"441371\">@Bart Decuypere</span> In the US, CLIA is the federal regulation/requirements for laboratory testing (and laboratories).  Several organizations (i.e. CAP, Joint Commission) have deemed status from CLIA as laboratory accrediting bodies, meeting CLIA at a minimum, but may have more specific requirements.  </p>\n<p>Each entity performing lab testing is required to have a CLIA number that is required along with other lab info to be on each laboratory report.  Is your question how to support sending the CLIA # in a lab report?  It's supported by HL7 laboratory guides.  What version of HL7 messaging does the question pertain?  Are there other requirements for Belgian reporting related to this question?</p>",
        "id": 275560059,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1647456375
    },
    {
        "content": "<p>Can you provide a link to an IG where the CLIA# is used on a lab report? An example would be welcome...</p>",
        "id": 275660322,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1647527090
    }
]