[
    {
        "content": "<p>Hello - We (Clinical Genomics WG) needed to include test disclaimers, comments and other important notes in a structured manner in DR. Since this is fairly generic feature and not particular to genomics, we discussed this request with O&amp;O, see <a href=\"https://jira.hl7.org/browse/FHIR-31660\">Jira</a>. O&amp;O created a Jira for FHIR Core and CG decided to create an extension called Note in the meantime. This Note option works for use cases such as comments and test disclaimers. The question here is if such a Note element on an Observation resource can be used to house summary style information <a href=\"/user_uploads/10155/2tydaGJocg7Ew83fAbgTnVBi/Eg.pdf\">see attached highlighted text</a>. The example included is more interpretative information (typically canned) about the variant identified in the patient. Another example is such summary or interpretation text entered by the geneticist at the report level as well. Is such information a fit for the Note extension even with an appropriate code? Or considering its significance, should such summary information be called out in a component? FYI <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> <span class=\"user-mention\" data-user-id=\"191969\">@John David Larkin Nolen</span></p>",
        "id": 263717989,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1638636327
    },
    {
        "content": "<p>There is currently <a href=\"http://build.fhir.org/diagnosticreport-definitions.html#DiagnosticReport.note\">DiagnosticReport.note</a>, why is there a consideration for a note extension?</p>",
        "id": 263732110,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1638652983
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> - There can multiple observations per report, and each observation can have its own “interpretative information”</p>",
        "id": 263747692,
        "sender_full_name": "Kevin Power",
        "timestamp": 1638676720
    },
    {
        "content": "<p>And each Observation has it's own <a href=\"http://build.fhir.org/observation-definitions.html#Observation.note\"><code>note</code> element</a> - wouldn't that work? Or is the extension specifically for <code>Observation.component</code>?</p>",
        "id": 263749841,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1638680403
    },
    {
        "content": "<p>We are considering both <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> - the trick is that this text is important enough that we need to be able to identify it. So having a fixed code to use in component.code would work. We can also use our newly profiled Annotation data type to add a “type” extension. Just trying to decide which approach sounds better to the community. Or if something else would be better.</p>",
        "id": 263776821,
        "sender_full_name": "Kevin Power",
        "timestamp": 1638722473
    },
    {
        "content": "<p>Maybe the way to ask - does this kind of statement feel like a 'note' or not? I suppose it could fit in with the definition:</p>\n<blockquote>\n<p>May include general statements about the observation, or statements about significant, unexpected or unreliable results values, or information about its source when relevant to its interpretation.</p>\n</blockquote>\n<p>I typically think of notes as things like \"specimen was clotted\" or similar. But is my thinking too narrow?</p>",
        "id": 263938713,
        "sender_full_name": "Kevin Power",
        "timestamp": 1638832632
    },
    {
        "content": "<p>Unacceptable specimens and specimen quality is handled else where.</p>",
        "id": 265884044,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1640235964
    },
    {
        "content": "<p>Do you know where <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> ?</p>",
        "id": 265919862,
        "sender_full_name": "Kevin Power",
        "timestamp": 1640268716
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  See specimen resource for specimen quality/notes:  <a href=\"https://build.fhir.org/specimen-definitions.html\">https://build.fhir.org/specimen-definitions.html</a>  For your clotted example, Specimen Condition contains clotted in the value set:  <a href=\"https://terminology.hl7.org/3.0.0/ValueSet-v2-0493.html\">https://terminology.hl7.org/3.0.0/ValueSet-v2-0493.html</a>  to meet these CLIA requirements as in V2</p>",
        "id": 265936197,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1640280413
    },
    {
        "content": "<p>For Notes about Lab Developed Tests and other CLIA and/or FDA required notes as <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span>  indicates, I'd expect these to be on the observation as it's related to the assay/test.  When a clotted specimen results in a canceled test, then additional steps would be needed such as canceling the original order to which the original clotted specimen is tied.  These actions would impact Service Request.  (The performing laboratory often requests a re-order and re-draw so assuming the clinician still wants the testing done.  It also provides the workflow needs/tasks/orders such as collecting a new specimen.  I'll mention I haven't seen anyone model out and test all the FHIR resources/aspects needed for end to end daily real world lab data needs yet and those that would be CLIA compliant.  There are several projects with scenarios tackling pieces of the total need.)</p>",
        "id": 265937265,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1640281288
    },
    {
        "content": "<p>Many thanks <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> -- I think the best thing we can do now is to develop some examples of what we are thinking (I believe <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> is working on that) and ensure this group agrees with what we are proposing.</p>",
        "id": 265937429,
        "sender_full_name": "Kevin Power",
        "timestamp": 1640281421
    }
]