[
    {
        "content": "<p>For a number of observations, the set of 'absent reasons' (other, refused to answer, not applicable, etc.) is incorporated as part of the valueset for the Observation.valueCodeableConcept - as is best practice.  However, there certain null flavors such as 'masked' that will <em>never</em> be the actual value for the element - when doing data capture \"masked\" is not something that makes sense.  So we don't want to include that 'absent reason' as part of the ValueSet for the Observation.value.  The question is: is it appropriate to send the 'masked' absent reason in Observation.dataAbsentReason and wipe the value, or should we wipe the value and replace it with the DAR extension?</p>\n<p>My leaning is to say that what goes in Observation.dataAbsentReason should be what was originally captured, whereas if you're redacting data , that you always use the DAR extension - because there are a variety of things that you might redact (author, subject, timeframe, etc.)</p>\n<p>Opinions?  Is it appropriate to add a recommendation/best practice to the spec for something like this?</p>",
        "id": 277314326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648747636
    },
    {
        "content": "<p>note that masked is just one algorithm for de-identifying data... but I don't think that is your use-case... right?</p>",
        "id": 277314811,
        "sender_full_name": "John Moehrke",
        "timestamp": 1648747899
    },
    {
        "content": "<p>We did look at Observation, and it is the subject of the De-Identification section -- <a href=\"http://build.fhir.org/secpriv-module.html#deId\">http://build.fhir.org/secpriv-module.html#deId</a></p>",
        "id": 277315066,
        "sender_full_name": "John Moehrke",
        "timestamp": 1648748034
    },
    {
        "content": "<p>YES, more would be good. glad to help</p>",
        "id": 277315131,
        "sender_full_name": "John Moehrke",
        "timestamp": 1648748053
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : I'm concerned that also the DAR extension would get confusing whether it represents the actual record absent reason or the masking process reason if there is still other data being sent on the resource.  So shouldn't it be a more specific masking focused extension?  Adding a DAR extension where a DAR attribute is already present would get confusing as well as to the purpose.</p>",
        "id": 277315681,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1648748358
    },
    {
        "content": "<p>You wouldn't have a DAR extension on 'value' if there hadn't been a value.  I guess in theory you could have a DAR extension on Observation.dataAbsentReason if you were suppressing something like \"refused to answer\".</p>",
        "id": 277320119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648750591
    },
    {
        "content": "<p>(And understood that 'Masked' is only one style of redaction.  If you're actually yanking the elements and not making explicit what you yanked, then there's no question of where to put the flag, so I'm not worrying about that aspect.)</p>",
        "id": 277320187,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648750637
    },
    {
        "content": "<p>So if DAR is on Observation directly you would you use of the general purpose masking and if on a specific attribute and it is o.k. to know there was something there but redacted you would use it on that attribute.  My concern is that regular process DARs are different than redaction DARs.  Similar to having a status on the record or a status (one or more) on the content.</p>",
        "id": 277354924,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1648770694
    },
    {
        "content": "<p>I don't think it would make sense for a 'source' Observation to ever have an Observation.dataAbsentReason of 'masked'.  If you had an Observation with a DAR of \"refused to answer\" and for some reason wanted to mask that DAR, then you would send the DAR with a DAR extension in it that said 'masked'.</p>",
        "id": 277363283,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648779306
    },
    {
        "content": "<p>that seems like a policy choice. Not unreasonable place for a policy to end up... I will quote a Canadian: \"If you choose not to decide you still have made a choice.\"</p>",
        "id": 277401068,
        "sender_full_name": "John Moehrke",
        "timestamp": 1648811560
    }
]