[
    {
        "content": "<p>In one of our products, we use the Device resource for modelling the leads of an ICD (implantable cardioverter-defibrillator). Often, when an ICD is explanted the leads are left behind. We used the Device.status value 'not available' to represent that the leads are inactive but still in the patient. This was based on <a href=\"http://hl7.org/fhir/2017Jan/valueset-devicestatus.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2017Jan/valueset-devicestatus.html\">http://hl7.org/fhir/2017Jan/valueset-devicestatus.html</a>, which states \"The Device is no longer available for use (e.g. lost, expired, <em>damaged</em>)\" for status value 'not available'.</p>\n<p>Later (<a href=\"http://hl7.org/fhir/STU3/valueset-device-status.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/valueset-device-status.html\">http://hl7.org/fhir/STU3/valueset-device-status.html</a>), the ValueSet was changed; 'not available' is no longer there, it has been replaced by 'inactive'. However, a comment was added for this particular value: \"Note: This means for <em>implanted devices</em> the device has been removed from the patient.\" </p>\n<p>This note causes a breaking change for us, because the leads have not been removed from the patient, they only have been de-activated.<br>\nThe other available values are not appropriate in this particular case.</p>\n<p>I am seeking advice on how to resolve this issue.</p>",
        "id": 161353498,
        "sender_full_name": "David La Hei",
        "timestamp": 1553180415
    },
    {
        "content": "<p>For now, you'll need an extension.  But submit a change proposal to separate the notion of active/Inactive from implanted/explanted</p>",
        "id": 161355937,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553181920
    },
    {
        "content": "<p>Thanks for quick reply Lloyd. Would a change request to STU3 and R4 still be taken into consideration? Or, can we only submit a change request for the current build? With your suggestion to add an extension, do you mean adding our own custom status field with own values?</p>",
        "id": 161357746,
        "sender_full_name": "David La Hei",
        "timestamp": 1553182960
    },
    {
        "content": "<p>This change would be something that we'd fix in the CI build for official release in R5.  Once released, we can't make substantive changes to published specs.</p>",
        "id": 161361932,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553185431
    }
]