[
    {
        "content": "<p>I can set ServiceRequest status at cancelled but I want to storage extra data like date and user who canceled the Order.<br>\nWhere can I storage that info?</p>",
        "id": 158135582,
        "sender_full_name": "Jorge Yero",
        "timestamp": 1549992723
    },
    {
        "content": "<p>Take a look at Provenance.  It lets you capture metadata about who did something, where they did it, why, when, under whose authorization, etc.</p>",
        "id": 158136088,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549993091
    },
    {
        "content": "<p>Thanks, it is  exactly I was looking for.</p>",
        "id": 158138090,
        "sender_full_name": "Jorge Yero",
        "timestamp": 1549994556
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> we are wondering now about the difference between<code>Provenance</code> and <code>AuditEvent</code>. We aren't clear about where to put the information related to an order cancellation.</p>",
        "id": 160223247,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1551983154
    },
    {
        "content": "<p>Provenance is a record intended to be seen by clinicians and other users.  It describes how a particular resource version came to be - who created it, when, where, why, what sources were drawn from and what \"action\" occurred to create the instance (e.g. anonymization, error correction, etc.)  Provenance records are only created when data is changed.</p>\n<p>AuditEvent is used to track system actions.  That includes the creation, update and delete of records (which should also have Provenance instances associated), but it also includes queries, backups, restores, logins, password changes and all sorts of other things that could be relevant when tracking the behavior of a system to allow subsequent audit of use.</p>\n<p>The short answer to your question is that both types of records should exist, but the user-facing data will be in Provenance.</p>",
        "id": 160225806,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551984946
    },
    {
        "content": "<p>thanks!</p>",
        "id": 160229103,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1551986734
    }
]