[
    {
        "content": "<p>I’m trying to figure if we should store the usage of implanted contraceptive devices like Copper - T as DeviceUseStatement OR as an Observation with social-history category OR both?</p>\n<p>The question about contraceptive history is generally asked in the context of sexual history which falls in the larger bucket of Social History. Hence what should be the most appropriate classification of implanted contraceptive devices from data storage model perspective?</p>\n<p>Once we figure this, we do also have the question of storage/model for the non-implant contraceptive methods like the Female Condoms. I believe these should be purely social history observations.</p>",
        "id": 207404340,
        "sender_full_name": "Deepak Choudhary",
        "timestamp": 1597842245
    },
    {
        "content": "<p>I think I figured it, we can create both, an observation record and a deviceUseStatement record and link them via<code>DeviceUseStatement.derivedFrom</code> Observation.</p>\n<p>In case anyone has a suggestion please do reply.</p>",
        "id": 207406771,
        "sender_full_name": "Deepak Choudhary",
        "timestamp": 1597843544
    },
    {
        "content": "<p>I would stick to the DeviceUseStatement. If you need an observation for some reason, then you can \"echo\" the deviceUseStatement as an observation indeed - does it add any useful information?</p>",
        "id": 207442931,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597861067
    },
    {
        "content": "<p>what is the challenge with non-implant contraceptive methods?</p>",
        "id": 207443044,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597861111
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span>, the reason I think creating an observation record makes sense as well (for implanted contraceptive devies) is because the other questions related to the contraception and sexual history like 'usage of oral contraceptives', 'reasons for not using any contraceptive (despite being sexually active)', etc are all created as observation records. Therefore I think it just gives us one coherent point of view &amp; storage of all such conceptual information together. And therefore the usefulness is that it give us one place &amp; model for evaluation of all contraceptive /sexual history data &amp; transferring to other systems.<br>\nWhat do you think?</p>\n<p>Could you please also explain about what you mean by \"echo\"ing the deviceUseStatement as an observation?</p>",
        "id": 207498015,
        "sender_full_name": "Deepak Choudhary",
        "timestamp": 1597910691
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Contraceptive.20Devices.20-.20DeviceUseStatement.20v.2Fs.20Observation/near/207443044\">said</a>:</p>\n<blockquote>\n<p>what is the challenge with non-implant contraceptive methods?</p>\n</blockquote>\n<p>If we're creating DeviceUseStatement for implanted contraceptive devices, then does it make sense to create device records for non-implant contraceptives as well? Like Condoms, Cervical Cap, Diaphragm, etc.<br>\nStoring these just as observations (not creating device records) seems to make better sense as these are typically not considered as \"Devices\" and are part of the overall social-history of the patient.</p>",
        "id": 207498452,
        "sender_full_name": "Deepak Choudhary",
        "timestamp": 1597911039
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"331237\">Deepak Choudhary</span> <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Contraceptive.20Devices.20-.20DeviceUseStatement.20v.2Fs.20Observation/near/207498015\">said</a>:</p>\n<blockquote>\n<p>it just gives us one coherent point of view &amp; storage of all such conceptual information together. And therefore the usefulness is that it give us one place &amp; model for evaluation of all contraceptive /sexual history data &amp; transferring to other systems.<br>\nWhat do you think?<br>\nCould you please also explain about what you mean by \"echo\"ing the deviceUseStatement as an observation?</p>\n</blockquote>\n<p>I agree. I was poking to see the reason - it does not add new information element, but if you want to export data in a consistent way, I think use of observation is ok. What I meant with echo is just that - represent the same information as another resource.</p>",
        "id": 207508459,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597919478
    },
    {
        "content": "<p>for non-implanted, especially if you use an observation, I don't see a strict need for a deviceUseStatement, butI'm torn. if you say \"patient reports use of diaphragm\" that sounds a lot like a deviceusestatement</p>",
        "id": 207508573,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597919588
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span>, ok. Thank you for your inputs.<br>\nStructuring the healthcare data is such an interesting space, full of ambiguity and dilemmas. But we'll reach there, gradually &amp; eventually.<br>\nI see that not many people and companies go to such a level of depth in this journey, most are still at the tip of the iceberg (if you know of others otherwise?). Good thing is, the ball is in motion. Glad to have this conversation with you (was my first on this forum).</p>",
        "id": 207525375,
        "sender_full_name": "Deepak Choudhary",
        "timestamp": 1597932188
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span>  is this question part of your work?</p>",
        "id": 207544246,
        "sender_full_name": "Eric Haas",
        "timestamp": 1597941410
    },
    {
        "content": "<p>Not at the moment. The stuff I've been working on is related to the pregnancy and delivery.</p>",
        "id": 207637086,
        "sender_full_name": "Craig Newman",
        "timestamp": 1598018385
    }
]