[
    {
        "content": "<p>Apologies for the cross-post, but this didn't seem to get any traction in implementers, and figured this would be the next place to ask.  Currently, <code>Device</code> is not allowed in <code>Observation.performer</code>.  Given that, how would you record \"AI Algorithm X\" performed an Observation? (e.g., AI analysis of an Imaging Study)?</p>",
        "id": 211072884,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1600902343
    },
    {
        "content": "<p>I'd be in favor of a change request to extend Observation.performer.  There are definitely Devices that perform (and have sole responsibility for) certain Observations.  I don't think the fear of confusion between Observation.performer and Observation.device is a valid reason to omit it.</p>",
        "id": 211081485,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600911310
    },
    {
        "content": "<p>... or we could use <a href=\"http://jira.hl7.org/browse/FHIR-22147\">FHIR#22147</a> .  Do I need to open another tracker?</p>",
        "id": 211149062,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1600961789
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-22147\">J#22147</a> is still open, so I think we should use the same also to avoid repeating the discussion.</p>",
        "id": 211180224,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600976464
    },
    {
        "content": "<p>I think it is a terrible idea that will lead to unending confusion where to stick the device.</p>",
        "id": 211648226,
        "sender_full_name": "Eric Haas",
        "timestamp": 1601397547
    },
    {
        "content": "<p>I don't understand what is the problem. If my watch tells me my heart rate, or that I don't seleep enough, what is the confusion / alternative?</p>",
        "id": 211658743,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1601402031
    },
    {
        "content": "<p>It's two different devices.  \"What made the decision\" vs. \"what was used\".  You can't stick both in the same element because they mean different things.  Implementers get confused about lots of things.  Our job is to create the needed elements and make it as obvious as we can how to do the right thing.  We don't \"not\" include needed capabilities because we're concerned about confusion.</p>",
        "id": 211660646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601402878
    },
    {
        "content": "<p>If the intent of device as a performer is to indicate what/who made the decision, I can understand that distinction.  Problem will remain where to shift from was used into performed.  Do you see that if a machine deducted a result (whether simple lab result, or some AI algorithm) that that observation is performed by a device and then a human indicates whether it can be used?  whether they acted on it?  Is the lab tech the performer, or \"just\" the operator?</p>",
        "id": 211661396,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1601403154
    },
    {
        "content": "<p>There are multiple workflows.  In general if a human decides whether the value exposed, then human has responsibility.  However, if the device has sole responsibility for both determining the value and deciding the Observation is going to be added to the patient record, then that's definitely the performer.</p>",
        "id": 211662903,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601403761
    },
    {
        "content": "<p>I think it lowers confusion.  If a practitioner <em>uses</em> a device, the practitioner is the performer and the device is just a device used.  The change is to allow the case when there is no practitioner directly involved in the workflow - e.g., organization ABC uses an AI system to perform initial (or secondary, etc.) observations.  The practitioner has no input into what is run, it's just part of the workflow.</p>\n<p>You could make the argument that some sort of organization or person should be listed as the 'one who decided this step in the workflow', but I don't think it is reasonable (or likely) that it would be filled out (read: most people have no idea who made the decision).</p>",
        "id": 211662951,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1601403779
    },
    {
        "content": "<p>and I don't see any mention in this thread of autoverification rules where most LISs indicate which (especially when multiple) instrument \"reported\" an autoverified result.  Knowing which instrument is also a regulatory requirement (for traceback/root cause analysis).  How is this requirement met?</p>",
        "id": 265762916,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1640144567
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Device-issued.20Observations/near/211662951\">said</a>:</p>\n<blockquote>\n<p>I think it lowers confusion.  If a practitioner <em>uses</em> a device, the practitioner is the performer and the device is just a device used.  The change is to allow the case when there is no practitioner directly involved in the workflow - e.g., organization ABC uses an AI system to perform initial (or secondary, etc.) observations.  The practitioner has no input into what is run, it's just part of the workflow.</p>\n<p>You could make the argument that some sort of organization or person should be listed as the 'one who decided this step in the workflow', but I don't think it is reasonable (or likely) that it would be filled out (read: most people have no idea who made the decision).</p>\n</blockquote>\n<p>lawyers care (a lot) and therefore the providers care</p>",
        "id": 265835045,
        "sender_full_name": "Eric Haas",
        "timestamp": 1640196557
    },
    {
        "content": "<p>lawyers only care when it was a bad/wrong decision</p>",
        "id": 265837831,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640198183
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Device-issued.20Observations/near/211072884\">said</a>:</p>\n<blockquote>\n<p>Apologies for the cross-post, but this didn't seem to get any traction in implementers, and figured this would be the next place to ask.  Currently, <code>Device</code> is not allowed in <code>Observation.performer</code>.  Given that, how would you record \"AI Algorithm X\" performed an Observation? (e.g., AI analysis of an Imaging Study)?</p>\n</blockquote>\n<p>Would the Device route allow us to capture eg AI Algorithm Version?</p>",
        "id": 265840128,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1640199596
    },
    {
        "content": "<p>I have proposed Provenance be used to express the AI algorithm, and possibly the inputs (Provenance.entity) it was given.</p>",
        "id": 265840621,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640199861
    },
    {
        "content": "<p>Devices absolutely make decisions and perform things without human supervision.  They do that under the auspices of an Organization, but you definitely want to be able to list the Device as the performer.</p>",
        "id": 265863116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640213255
    },
    {
        "content": "<p>Lloyd, I think you are  is being too (absolutely and definitely) dogmatic about this.   IMO The device element is intended for all of this.</p>",
        "id": 265876663,
        "sender_full_name": "Eric Haas",
        "timestamp": 1640225815
    },
    {
        "content": "<p>IMO If the device element did all of this, it would need to be a backbone element with a role and a reference, so that the different roles played by the device can be expressed.</p>",
        "id": 265876873,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1640226104
    },
    {
        "content": "<p>Performer and 'device' are different things.  If a Device is the thing that is <em>responsible</em> for making the Observation without supervision, then it's the performer - just as a device can be the author of a condition or performer of a procedure or author of a QuestionnaireResponse.  Observation shouldn't handle the situation any differently.  Doing so creates discrepancy and confusion.</p>",
        "id": 265877676,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640227322
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  actually for lab data, there's regulatory requirements to know exactly which device (unique id/serial number if multiples of the same model are used in a lab), a particular result originated from.  It's helpful for troubleshooting, root cause analysis and FDA I think requires it for any investigations that may lead to recalls, etc.  For COVID reporting, HHS wants the UDIs for the analyzer (device) and test kits (device) used to generate the lab results. <br>\nNot quite the same as an algorithm/AI produced result, but since many \"algorithms\" are essentially calculations, calculations need to be validated according to lab regulatory requirements too (usually before they go into use  and when inspected.)</p>",
        "id": 265884343,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1640236425
    }
]