[
    {
        "content": "<p>Device Version is broken up into components, each with a type, but there is no vocabulary for a type. Most things have a complex string version e.g. 1.35.23-1 (or semver: 1.2.3). What 's the expectation here? a single component? with a type, or not? or is smver supposed to ve set up?</p>\n<p>I don't think there's justification for breaking version up. It seems like an extension thing to me at best ....</p>",
        "id": 162320496,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554200207
    },
    {
        "content": "<p>or else we better get a good vocab for type and some good documentation</p>",
        "id": 162320517,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554200225
    },
    {
        "content": "<p>no, I do not begin to understand .value vs .component here</p>",
        "id": 162320606,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554200284
    },
    {
        "content": "<p>what's the relationship between device.url and EndPoint? (<span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> )</p>",
        "id": 162320765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554200429
    },
    {
        "content": "<p>Just rechecking, and there is no documentation on either resource on the boundaries between these!<br>\nThis should be added to both resources.<br>\nWill take this up on the PA call tomorrow - to get a PA viewpoint on it.</p>",
        "id": 162416599,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1554287511
    },
    {
        "content": "<p>The version 0..* is for the several different types of versioned items there are in a communicating medical device. Some of these are firmware, software, hardware, protocol, and even something like 'Continua'. Even simple consumer devices have all these. The MDC code system (which is device oriented) has codes for each of these version types. The versions were originally present in the now defunct DeviceComponent productionSpecification entry.</p>\n<p>Here are some codes from the MDC code system:</p>\n<p><code>\ndescription         MDC code       MDC reference identifier\nHardware revision   531974          MDC_ID_PROD_SPEC_HW\nSoftware revision   531975          MDC_ID_PROD_SPEC_SW\nFirmware revision   531976          MDC_ID_PROD_SPEC_FW\nProtocol revision   531977          MDC_ID_PROD_SPEC_PROTOCOL\nContinua version    532352          MDC_REG_CERT_DATA_CONTINUA_VERSION</code></p>",
        "id": 165531491,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1557756399
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  I should add that there USED to be a FHIR-defined code system for these when there was a DeviceComponent resource and there was a productionSpecification element in it. The code system contained more than just versions; it also contained the serial number, for example, which was part of the production spec. In the Device-DeviceComponent merge,  It was decided to flatten some of the more common fields like serial number and coordinate all the different version types under versions. The special code system disappeared along with the DeviceComponent but the MDC code system always had codes for these items so that is what I use.</p>",
        "id": 165699634,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1557912877
    }
]