[
    {
        "content": "<p>Specimens provided to a lab that are not tested, and therefore do not provide any resultant information on the DiagnosticReport, should <strong>not</strong> be included on said DiagnosticReport.specimen, correct? In order to reference non-tested specimens in a given report, would use of data-absent-reason extension within DR.specimen be appropriate? Or, would a standalone List, etc. of Specimens (provided to the lab and not tested) be a better approach? fyi <span class=\"user-mention\" data-user-id=\"369387\">@Diana Wright</span></p>",
        "id": 272979766,
        "sender_full_name": "David deRoode",
        "timestamp": 1645636503
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197608\">@David deRoode</span> It depends on the use cases.  Often in ED, a rainbow draw of tubes are collected in anticipation of orders, but all of the specimen tubes may not be used.  They may not even make it into the lab (sometimes they are labeled and placed in a drawer in ED.  So the lab may not have record of them.  In other cases, they may be sent to the lab and not meeting blood bank criteria, might be used for other lab tests/add ons.  Sometimes they are labeled (i.e. 2 green top tubes collected, but only one used for testing) and stored in the lab in case they are needed (i.e. dilution on original tube or add ons).  </p>\n<p>However, in pathology, a single \"specimen\" or multiple specimens may be collected (i.e. bone marrow touch print, core,) and sent to labs for processing, staining or blocks with multiple slides created, etc.   Usually a tray of slides result.  The question I hear you ask is whether individual observations and/or diagnostic report is created reflecting \"analysis\"/\"testing\" of each slide, correct?  For pathology, all the slides may be scanned, reviewed or not.  Some may be scanned, but one is chosen (i.e. touch imprint w one stain) upon which to perform a bone marrow differential.  Another (i.e. core with H&amp;E stain) is utilized to assess cellularity and core features.  Each of these is reported, but historically individual labeled slides for each observation are not noted.  Rather all the specimens comprise a Case# upon which the Diagnostic Report and Observations are associated.  </p>\n<p>With prostate specimens, where Gleason Score is calculated and other notations as to which specimen has cancer identified, I understand there are varied practices as some surgeons may not indicate from where the specimens are collected (but number as 1, 2, 3, etc.)  I'd defer to pathologists as to the variety of practices for these specimens.</p>\n<p>So for tubes and some containers of specimens, they are required to be tracked per CLIA but if no analysis is performed upon them I wouldn't expect observations in a Diagnostic Report.  However, I have seen some lab panels where information about extra tubes collected are reported as a lab result (I'm trying to remember which type of \"test\" it was), so there could be some tubes \"indicated\" as a lab result/observation but not have a traditional value for an analyte.</p>",
        "id": 273091434,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1645710799
    },
    {
        "content": "<p>Here are some quick examples I found.   Reflex testing may be a good example of you collection minimal requirements and depending on results of initial tests you may not do the remainder (reflex criteria not met), so you will have extra \"specimens\" not tested.  See <a href=\"https://www.labcorp.com/tests/510344/aggressive-b-cell-lymphoma-profile-fish\">https://www.labcorp.com/tests/510344/aggressive-b-cell-lymphoma-profile-fish</a>  for different volumes, different types of specimen requirements.  \"Solid\" specimens are a bit different than \"liquid specimens\" as with liquid (i.e. blood, urine, body fluids), it's generally assumed the analyte/DNA/tumor marker is homogenously found within a specimen no matter how many tubes are collected (i.e. typically multiple tubes aren't each analyzed for the same assay).  However, with solid specimens, especially with pathology, one may need to view all to determine which one(s) cancer is detected, other abnormalities/markers/staining/morphologies, where margins occur/don't occur, etc. as one doesn't one to miss the one specimen where an abnormality is present.  If all the slides are representative of the entire specimen, then one may be selected for analysis.  In other cases, multiple slides need to be analyzed.  Each slide may be given a unique accession number or the same access with notations for the block, or container, etc.  depending on how specimen tracking is performed with the LIS.</p>",
        "id": 273093807,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1645711912
    },
    {
        "content": "<p>I'll also mention, 4 pediatric bullet tubes may be collected to produce the specimen volume of a single larger \"adult\" tube.  Serum or plasma may be combined from 4 bullets into a single aliquot tube for analysis.  In these cases, the actual tubes are not noted with the observation/diagnostic report.  Similar if 2 swabs are submitted for microbiology and one not used/not needed.</p>",
        "id": 273094271,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1645712139
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> Thanks for the explanation! My question though is not related to cancer/pathology lab testing actually; the use case is when a toxicology lab is sent specimens for analysis during a medicolegal death investigation, how to convey they tox lab received the specimens but they were not tested (and the reason why they were not tested).</p>",
        "id": 273522212,
        "sender_full_name": "David deRoode",
        "timestamp": 1646068311
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197608\">@David deRoode</span> Thank you for the additional info.  One of the key questions is Would the testing be performed in a CLIA lab or a non CLIA lab (as requirements differ) ?   </p>\n<p>Typically for CLIA labs, your question is  more order/Service Request/requisition like testing today, not observation or Diagnostic Report related. (Also assuming your inquiry doesn't involve any partial results from a panel order?)  </p>\n<p>However, there are also forensic toxicology specific reporting  requirements I came across.  <br>\n<a href=\"http://www.slh.wisc.edu/forensic/coroner-and-medical-examiner-testing/\">http://www.slh.wisc.edu/forensic/coroner-and-medical-examiner-testing/</a><br>\n<a href=\"https://www.aafs.org/asb-standard/standard-report-content-forensic-toxicology\">https://www.aafs.org/asb-standard/standard-report-content-forensic-toxicology</a></p>\n<p>Have you contacted a forensic lab director to understand all the requirements for this specialized type of testing?</p>",
        "id": 273529393,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1646071243
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> Toxicology labs are not CLIA approved. They are accredited by American Board of Forensic Toxicology (ABFT). They are not considered clinical laboratories</p>",
        "id": 273820010,
        "sender_full_name": "David deRoode",
        "timestamp": 1646233531
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197608\">@David deRoode</span>  Thanks for clarifying that your scope only includes toxicology lab testing in non CLIA labs (I've seen both).</p>",
        "id": 273827202,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1646236210
    }
]