[
    {
        "content": "<p>Just wanted to check in on #17518.  There was discussion about category.  In looking at the existing list, it matches our requirements for category (LBCAT in CDISC), but not the subcategory (LBSCAT), which is a level lower.    We would want to capture both 'Chemistry' (category) and 'Electrolytes' (subcategory).  We don't see a way to do that with the current DIAGNOSTIC REPORT resource.</p>\n<p>Suggestions for filling that gap?  Our proposal was to add subcategory as a codeable concept 0..1, just like category (which is already on DR), but with a different value set.  </p>\n<p>Other options?</p>",
        "id": 153978710,
        "sender_full_name": "Christine D",
        "timestamp": 1532704421
    },
    {
        "content": "<p>Link is <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17518\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17518\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17518</a></p>",
        "id": 153978712,
        "sender_full_name": "Christine D",
        "timestamp": 1532704594
    },
    {
        "content": "<p>It's not clear why the proposed solution - send both in category.coding won't work.</p>",
        "id": 153978735,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532707329
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  then would the codes for category be extended to include both category and subcategory values?</p>",
        "id": 153978742,
        "sender_full_name": "Christine D",
        "timestamp": 1532707632
    },
    {
        "content": "<p>Or do we need a new code list for the subcategory values?</p>",
        "id": 153978744,
        "sender_full_name": "Christine D",
        "timestamp": 1532707767
    },
    {
        "content": "<p>it feels like we need to somehow differentiate the two.  have system point to existing category list for category and system point to new subcategory list for subcategory?</p>",
        "id": 153978747,
        "sender_full_name": "Christine D",
        "timestamp": 1532707883
    },
    {
        "content": "<p>If you want to have systems send both, you'd create a profile that sliced Observation.category.coding by value set and specify two slices, one with the value set for category and one with the value set for subcategory.  You <em>could</em> use different code systems for each and if you did so, differentiation would be easier, but that's not technically necessary to enforce the expectation.</p>",
        "id": 153978755,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532708175
    },
    {
        "content": "<p>For me  Going from <code>category</code> to <code>code</code> is a continuum  of specificity and you want a point in the middle, but I don't think adding a subcategory element is any better than using code translation like LLoyd suggests.</p>",
        "id": 153978761,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532708668
    },
    {
        "content": "<p>The primary challenge is that your category might be someone else's sub-category.  And someone else might have need for a sub-sub-category.</p>",
        "id": 153978765,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532708927
    },
    {
        "content": "<p>How would we go about adding terms to the existing category vocabulary?  Is that a tracker?</p>",
        "id": 153978766,
        "sender_full_name": "Christine D",
        "timestamp": 1532709113
    },
    {
        "content": "<p>Yes, that would be a change request, though there's no guarantee that all of your preferred categories will make it into HL7's preferred category set.  It's totally possible to send an HL7 category, an SDTM LBCAT and an STDM LBSBCAT as alternative codings within Observation.category</p>",
        "id": 153978768,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532710345
    },
    {
        "content": "<p>Ah, ok.  So we just need to be able to point to the coding system?  It doesn't need to reside within HL7?</p>",
        "id": 153978771,
        "sender_full_name": "Christine D",
        "timestamp": 1532713849
    },
    {
        "content": "<p>No.  The preferred code system is defined by HL7, but you're allowed to send codes from whatever code systems you prefer.</p>",
        "id": 153978813,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532717480
    },
    {
        "content": "<p>If the binding had been 'required'  (or 'extensible' and the observation fell within the valueset), then you'd be expected to send the HL7 code, but would still have been free to include additional codes from other code systems.</p>",
        "id": 153978814,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532717532
    },
    {
        "content": "<p>Thanks for the clarification.  I think we can close that tracker.  I don't have edit privs to be able to withdraw it.</p>",
        "id": 153978816,
        "sender_full_name": "Christine D",
        "timestamp": 1532718530
    },
    {
        "content": "<p>Add a comment indicating that you wish to withdraw and we can change the status for you.  (Unfortunately gForge isn't terribly flexible in terms of edit privileges - it's all or nothing.</p>",
        "id": 153978818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532719132
    }
]