[
    {
        "content": "<p>Created <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17495&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17495&amp;start=0\">GF#17495</a> to initiate a debatte relating how reagents/substance should be stored in observation resource. </p>\n<p>Reason: <br>\nIHE LAB-29 (OUL^R22) transaction uses the following structure (cut down to only needed/applicable elements for my problem):</p>\n<div class=\"codehilite\"><pre><span></span>MSH\n...\n{ --- SPECIMEN begin\n    SPM\n    [{ --- CONTAINER begin\n        SAC\n    }] --- CONTAINER end\n    { --- ORDER begin\n        OBR\n        ORC\n            [{ --- RESULT begin\n                OBX\n                [{INV}] // Used Substance/reagent information\n            }] --- RESULT end\n    } --- ORDER end\n} --- SPECIMEN end\n</pre></div>\n\n\n<p>So in the v2 based LAB-29 transaction the used reagent/substance information (INV-Segment) is part of the result group, and in the result group the used device is also available (OBX-Segment) so both of them are related to the Result. </p>\n<p>We would like to model something like this in FHIR via the observation resource, so we would like to have reagents/substance as a reference in the observation. </p>\n<p>Some information for the background:</p>\n<ul>\n<li>Each Analyzer consists out of several modules (1-5) which contain up to two submodules</li>\n<li>Each Submodul could perform several different tests</li>\n<li>Each Test could use several different reagents </li>\n<li>Each Module (<strong>not submodule</strong>) could have several different reagents each with a unique expiration date/time, unique lot, ...  </li>\n<li>Each Reagent could be unloaded and loaded to another Module </li>\n<li>Each reagent has a specific position on the Module (and could be identified via this (and the pipetting time)).</li>\n<li>Some Tests could be measured on different module/submodule combinations</li>\n<li>Observation is <em>usually</em> produced on the submodule level (but might be produced on the module or analyzer level)</li>\n</ul>\n<p>I think this should not be done via the device resource, because else we would need for each reagent ever loaded to the module a separate device instance where the problem is that the reagents are not part of the submodule but of the module while the measurement was done (most of the time) on the submodule. </p>\n<p>Easiest to model this would be to add the used reagent to the observation analog to the LAB-29 transaction of IHE. I think this need is quiet common on the big Analyzers (which might be needed to be verified). Perhaps a standard extension should be available for this use case.</p>\n<p><em>corrected a typo</em></p>",
        "id": 153977652,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1532444542
    },
    {
        "content": "<p>Basically I would just want to have something like this added to the observation:</p>\n<div class=\"codehilite\"><pre><span></span>      {\n        &quot;label&quot;: &quot;reagent&quot;,\n        &quot;id&quot;: &quot;ObservationWithSubstance.reagent&quot;,\n        &quot;path&quot;: &quot;ObservationWithSubstance.reagent&quot;,\n        &quot;short&quot;: &quot;reagent&quot;,\n        &quot;definition&quot;: &quot;Reference to used reagents to generate this observation&quot;,\n        &quot;min&quot;: 0,\n        &quot;max&quot;: &quot;*&quot;,\n        &quot;mapping&quot;: [],\n        &quot;type&quot;: [\n          {\n            &quot;code&quot;: &quot;Reference&quot;,\n            &quot;targetProfile&quot;: &quot;http://hl7.org/fhir/StructureDefinition/Substance&quot;\n          }\n        ],\n        &quot;base&quot;: {\n          &quot;path&quot;: &quot;ObservationWithSubstance.reagent&quot;,\n          &quot;min&quot;: 0,\n          &quot;max&quot;: &quot;1&quot;\n        },\n        &quot;extension&quot;: []\n      },\n</pre></div>",
        "id": 153977677,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1532451525
    },
    {
        "content": "<p>Is this for in-lab messaging between instrument and LIS?</p>",
        "id": 153977704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532462745
    },
    {
        "content": "<p>Mostly yes. <br>\nI believe it could also be used for tracing results to device and reagents used (but I do not know if it is only needed inside a laboratory for traceability)...</p>",
        "id": 153977710,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1532463015
    },
    {
        "content": "<p>I have never seen details like that reported outside the lab</p>",
        "id": 153977711,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532463048
    },
    {
        "content": "<p>I've never thought that Observation is scoped for in-lab comms. I've always that we'd get around to making fit for purpose resources for instrumentation management in a lab one day</p>",
        "id": 153977712,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532463148
    },
    {
        "content": "<p>I would be fine with that, except that we (want to) start a prototype using FHIR ...  When I was taking a look at observation resource I found much I liked and some missing stuff...</p>",
        "id": 153977715,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1532463277
    },
    {
        "content": "<p>so extensions for now then. In the lab messaging is a focused variant of device interaction, with a particular focus on calibration and reagents. And we also haven't done device control yet...</p>",
        "id": 153977720,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532463781
    },
    {
        "content": "<p>I would not need too much device interaction, it is more for reporting of results as a kind of a prototype project.</p>",
        "id": 153977943,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1532532944
    },
    {
        "content": "<p>So Ralf is this the only extension you are looking for?</p>",
        "id": 153978014,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532547430
    },
    {
        "content": "<p>added to last block vote I am trying to squeeze in.</p>",
        "id": 153978017,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532548045
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17424\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17424\">GF#17424</a> - if you made it not persuasive w/ mod and added the note I proposed in my most recent comment on the tracker, I could live with that.</p>",
        "id": 153978023,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532548882
    },
    {
        "content": "<p>I just don't understand your use case.  I responded by sayin:</p>",
        "id": 153978049,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532550547
    },
    {
        "content": "<p>I don't think this guidance needs to be in the resource it is covered in FHIR documetation</p>\n<p>option 1:  Use an opaque identifier in the reference.identifer element - the use case Bob M has certainly needs to track the patient so a business identifer is perfectly appropriate here.   </p>\n<p>option 2 :or a the existing <a href=\"http://build.fhir.org/extension-data-absent-reason.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-data-absent-reason.html\">http://build.fhir.org/extension-data-absent-reason.html</a> extension for the edge cases where there is no source.</p>",
        "id": 153978050,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532550549
    },
    {
        "content": "<p>The FHIR documentation allows many things.  There are going to be places where systems will process a specimen or pass around information about a specimen  with no idea who it's associated with.   The linkage to the patient would be outside that process - through the order number or by specimen id with a system that does know the linkage.  I accept that there's a minimal set of information in the Patient resource that will likely be needed, so I can live with minOccurs=1, but I think it's important to call attention to the fact that you don't need a reference to a stand-alone resource.</p>",
        "id": 153978053,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551035
    },
    {
        "content": "<p>Note that if we think there's any likelihood that element won't be needed by systems a tall, the solution isn't \"use dataAbsentReason\", it's to make the element optional.  dataAbsentReason is a mechanism when systems need to know why data is missing.  It's <em>not</em> a mechanism to let designers make something mandatory, while giving implementers an \"out\" to ignore the requirement.</p>",
        "id": 153978054,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551155
    },
    {
        "content": "<p>Making up an opaque identifier if one isn't needed also isn't acceptable.  If a system doesn't need an element at all, then that element should be optional in the spec - even if 99% of systems will require it.</p>",
        "id": 153978055,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551204
    },
    {
        "content": "<p>my experience is there is always slot for a source.   I'm afraid I don't follow your logic.  in Observation status is required but a system may not have it so we should make it 0..1?</p>",
        "id": 153978059,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532551568
    },
    {
        "content": "<p>We provide an explicit status of \"unknown\" for that case.</p>",
        "id": 153978060,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551621
    },
    {
        "content": "<p>Can't do that for a Reference</p>",
        "id": 153978061,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551626
    },
    {
        "content": "<p>We can give it a temporay ID though</p>",
        "id": 153978062,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532551657
    },
    {
        "content": "<p>Making up data to satisfy an unnecessary mandatory is a kludge.  It shouldn't be a mandatory</p>",
        "id": 153978064,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551693
    },
    {
        "content": "<p>why is that different than a contained reference to me its the shorter sweeter solution</p>",
        "id": 153978065,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532551706
    },
    {
        "content": "<p>It's been argued that there's always a need for gender/birthdate.  <em>If</em> that's valid, then contained resource would be the mechanism to do that.</p>",
        "id": 153978068,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551765
    },
    {
        "content": "<p>My preference would be 0..1</p>",
        "id": 153978069,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551789
    },
    {
        "content": "<p>The committee has deliberated and will pull for a separate vote.</p>",
        "id": 153978073,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532551839
    },
    {
        "content": "<p>If the committee believes there will <em>always</em> be a reference to a stand-alone resource or a need for at least a contained resource, that's fine.  But it's not kosher for them to say \"just send something to satisfy the mandatory\" in the rare case you don't need it.  If they believe the rare case exists, make it 0..1 and in the usage notes indicate that it should almost always be present.</p>",
        "id": 153978076,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532551967
    },
    {
        "content": "<blockquote>\n<p>There are going to be places where systems will process a specimen or pass around information about a specimen with no idea who it's associated with.</p>\n</blockquote>",
        "id": 153978080,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532552055
    },
    {
        "content": "<p>is not a use case is an assertion.  I have trouble understanding what you are going to doing with a specimen information if you don't know where it came from.</p>",
        "id": 153978081,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532552126
    },
    {
        "content": "<p><em>Some</em> of the systems in the chain will know/care who the patient is.  But not all systems will.  We need to allow that the back-ends of some systems aren't going to  persist patient data because they don't care - even though they do track the specimen under test.</p>",
        "id": 153978088,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532552542
    },
    {
        "content": "<p>Specimen is going to be used in the back-end lab processing, not just in the EHR &lt;-&gt; Lab interaction</p>",
        "id": 153978090,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532552568
    },
    {
        "content": "<p>dammit Lloyd I was going to use the QR.questtionnaire as another example but its 0..1      :-)</p>",
        "id": 153978093,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532553120
    },
    {
        "content": "<p>:D</p>",
        "id": 153978095,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532553371
    },
    {
        "content": "<p>You may have legacy systems that have responses that don't actually have a Questionnaire instance to point to or anything useful to say.</p>",
        "id": 153978097,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532553424
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>   It is true historically this info hasn't been reported outside the clinical lab, but with COVID,  HHS is requiring info about reagents and instruments (UDIs) to be reported as part of regulatory requirements.</p>\n<p>That said, what is typically done for automated chemistry, may not apply to other areas of the laboratory.  For example 4 reagents are utilized by hematology analyzers to produce \"parameters\" for CBC results typically reported.  This could result in combinatorial explosion for some lab results if you consider calibrators, controls, lot numbers, etc. (as some at FDA have been requesting).  The latter would be incredibly burdensome to clinical laboratories.  </p>\n<p>Also realize FHIR resources are pretty broad/generic to apply to many needs.  (O&amp;O has started talking about UDIs at times, especially on the Friday LIVD calls with IVD vendors, like <span class=\"user-mention\" data-user-id=\"196116\">@Ralf Herzog</span> .)   The other issue is if any systems in the \"information flow\" don't have functionality, it will be difficult to implement (send/receive).  O&amp;O isn't aware of any LIS/LIMS that has FHIR functionality yet, much less for daily lab needs.  If anyone becomes aware of LIS FHIR functionality, would be interested to learn more.</p>",
        "id": 266729993,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1641239801
    }
]