[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17520\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17520\">GF#17520</a>  <span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span>   <br>\nsee <a href=\"http://build.fhir.org/extension-quantity-precision.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-quantity-precision.html\">http://build.fhir.org/extension-quantity-precision.html</a>  if that meets your needs will you be willling to withdraw this tracker?</p>",
        "id": 153992903,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536025505
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"195175\">@Angie Romano</span> are we planning to derive the precision or would this extension be helpful?  (the extension only represents the decimal portion, where we are looking for something like 5,3)</p>",
        "id": 153993793,
        "sender_full_name": "Christine D",
        "timestamp": 1536239326
    },
    {
        "content": "<p>We can determine the precision of a specific result, but I think what we would be looking for would be that all the results for the same test show in a uniform precision.  so that is one A1C value was 5.4 and another was 5.55.  If we have that the precision should be 2 then all the results would be displayed at 5.40 and 5.55 in this example.  I will try out the extension on our test dataset.</p>",
        "id": 153993809,
        "sender_full_name": "Angie Romano",
        "timestamp": 1536240729
    },
    {
        "content": "<p>A system could choose to expose all data as having the same precision or enforce that all data is captured with the same precision, but fundamentally precision is a property of each record.  Also note that precision is retained withint the value.  So if you send 5.40, systems are expected to respect and remember that.   <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> What's the actual use-case for the extension?  I can see a need for sharing precision if you want to send a value like 5000 and say it has precision of 2.  But based on the definition of the extension, you couldn't use it in that case.</p>",
        "id": 153993840,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536244386
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span> What's the actual use-case for the extension? See lloyd's comment</p>",
        "id": 153993848,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536247347
    },
    {
        "content": "<p>Central Labs align their data with the CDISC LAB data standard.  Within that standard is a need to understand the precision at the lab.  As noted above, sometimes zeros are lost in the transmission process, so it is important to understand the precision at collection.  This is part of the CDISC LAB standard - numeric result precision.  As Angela noted above, we may receive a 5.4 that should actually be represented as 5.40.  The explicit numeric precision is useful in that situation.</p>",
        "id": 153994000,
        "sender_full_name": "Christine D",
        "timestamp": 1536260378
    },
    {
        "content": "<p>In a compliant FHIR system, zeros cannot be lost.  In a non-compliant system, they're unlikely to support the extension, so you're not gaining much by adding the extension to the spec.</p>",
        "id": 153994080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536265280
    },
    {
        "content": "<p>It sounds like your concerns are already addressed by FHIR.</p>",
        "id": 153994112,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536272957
    },
    {
        "content": "<p>there's already an extension. couldn't possibly add another</p>",
        "id": 153994118,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536273764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span> based on <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>'s comments, do you want to use the extension or derive based on the result?</p>",
        "id": 153994307,
        "sender_full_name": "Angie Romano",
        "timestamp": 1536331789
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195175\">@Angie Romano</span> using the extension would get us part of the way, but there would still be some deriving.  So maybe we just derive this one?</p>",
        "id": 153994378,
        "sender_full_name": "Christine D",
        "timestamp": 1536347555
    }
]