[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span>   <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16100\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16100\">GF#16100</a> needs example use case where the patient or related person is a collector.  can you provide one?</p>",
        "id": 154014164,
        "sender_full_name": "Eric Haas",
        "timestamp": 1541002376
    },
    {
        "content": "<p>Ditto for for <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16097\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16097\">GF#16097</a>  need use case examples</p>",
        "id": 154014193,
        "sender_full_name": "Eric Haas",
        "timestamp": 1541003945
    },
    {
        "content": "<p>and <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16101\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16101\">GF#16101</a></p>",
        "id": 154014198,
        "sender_full_name": "Eric Haas",
        "timestamp": 1541004571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192901\">@Kirt Schaper</span> <span class=\"user-mention\" data-user-id=\"193633\">@Robinette Renner</span> <span class=\"user-mention\" data-user-id=\"195169\">@Jane Pollack</span></p>",
        "id": 154014221,
        "sender_full_name": " Bob Milius",
        "timestamp": 1541006046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195169\">@Jane Pollack</span> commented on the trackers with use cases. Let us know if you have any questions about them.</p>",
        "id": 154015154,
        "sender_full_name": " Bob Milius",
        "timestamp": 1541169265
    },
    {
        "content": "<p>For the issue related to \"BiologicallyDerivedProduct.Collector is not a related person.\" <br>\nWhile it is possible for a person to collect their own specimen,  in the case of someone using a buccal swab to collect their own cheek cells,  or spit into a tube for a saliva sample,  this is a SPECIMEN,  not a collector of a BiologicallyDerivedProduct.  Therefore,  the collector of a BiologicallyDerivedProduct is never the patient but a practitioner.</p>\n<p>Resolution:  please remove patient and related person as the collection collector.</p>",
        "id": 154015184,
        "sender_full_name": "Jane Pollack",
        "timestamp": 1541174821
    },
    {
        "content": "<p>[#16097] Summary: Unclear distinction between Processing and Manipulation. <br>\nYes,  we are aware that this can seem like splitting hairs,  but we do make the distinction between Processing and Manipulation:</p>\n<p>During the collection of a Stem-Cell Product such as PBSC (Peripheral Blood Stem Cells),  we process a product by adding anti-coagulants during the collection in order to ensure that the collection can finish seamlessly to protect the product and make it easier on the donor.   Once the collection is completed,  we manipulate the product by doing buffy-coat enrichment or CD8 reduction to alter the product to make it more suitable for infusion to the recipient.  We make the distinction because the first (Processing) is not to change the fundamental nature of the product, but the second (Manipulation) is intended to alter the product.</p>",
        "id": 154015188,
        "sender_full_name": "Jane Pollack",
        "timestamp": 1541174934
    },
    {
        "content": "<p>[#16101]  For Summary: BiologicallyDerivedProduct needs example of how many BDPs can have one BDP as a parent. (Transplantation) </p>\n<p>In the Stem Cell Therapy domain,  one person can spend up to two days donating PBSC (Peripheral Blood Stem Cells).  The totality of the donation is one BiologicallyDerivedProduct (the Parent),  spanning 'n' days,  while the children of this BiologicallyDerivedProduct are the number of bags of BiologicallyDerivedProduct cells collected on each day.  Each bag has an identifier that must be tracked, and the parent has a distinct identifier that must be tracked,  thus requiring the one-to-many relationship.</p>",
        "id": 154015189,
        "sender_full_name": "Jane Pollack",
        "timestamp": 1541175046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195169\">@Jane Pollack</span> <span class=\"user-mention\" data-user-id=\"192901\">@Kirt Schaper</span> <span class=\"user-mention\" data-user-id=\"193633\">@Robinette Renner</span> </p>\n<blockquote>\n<p>in the case of someone using a buccal swab to collect their own cheek cells, or spit into a tube for a saliva sample, this is a SPECIMEN, not a collector of a BiologicallyDerivedProduct</p>\n</blockquote>\n<p>Maybe there's confusion here. The <em>donor</em> of the BiologicallyDerivedProduct is not the collector. Often the donor is the patient (autologous transplant) or related person, or unrelated person. There may be a case (not in Stem Cell Transplant)  where the collector might be a related person or the patient, ie the person performing the collection. I can't think of a use case where that happens though.<br>\nI don't think there's any question that the stuff being collected for analysis is a Specimen, and the material being collected for transplantation is a BiologicallyDerivedProduct. But the collector in both is the person/org doing the collecting, and is different for each.</p>",
        "id": 154015193,
        "sender_full_name": " Bob Milius",
        "timestamp": 1541176327
    },
    {
        "content": "<p>The donor of the BiologicallyDerivedProduct is the collection.source, reference to either Patient or Organization (in the case of a UCAR)</p>",
        "id": 154015232,
        "sender_full_name": "Kirt Schaper",
        "timestamp": 1541182433
    },
    {
        "content": "<p>The collection.collector (reference to a Practitioner) is the individual actually performing the collection. For this purpose, a bucal swab is NOT a BDP, and we assume that a BDP comes from a medical procedure requiring a trained medical staff person (the Practititioner).</p>",
        "id": 154015233,
        "sender_full_name": "Kirt Schaper",
        "timestamp": 1541182560
    },
    {
        "content": "<p>Even if the donor is a related person, the reference would be to a Patient, as the act of donation would entail a medical procedure.</p>",
        "id": 154015234,
        "sender_full_name": "Kirt Schaper",
        "timestamp": 1541182601
    },
    {
        "content": "<p>for <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=1600\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=1600\">GF#1600</a> to change the proposal it needs to be formally reopened and a new disposition applied by committee vote.   I will  will preapply the your proposed changes to  (  remove patient and related person as the collection collector.)  however it will not be closed until it revoted upon.</p>",
        "id": 154016065,
        "sender_full_name": "Eric Haas",
        "timestamp": 1541552051
    }
]