[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16153\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16153\">GF#16153</a>  Add elements to ServiceRequest for specifying a quantity of service being requested.</p>\n<p>I can see a use for this but would like to find out whether is a real world implementation need or whether would be represented using a text blob in which case <code>orderDetail </code> is adequate.</p>",
        "id": 153955537,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525302486
    },
    {
        "content": "<p>look at timing for the commenters use cases,  for dosing besides radiation Tx and transfusion medication what other use cases are there?</p>",
        "id": 153956998,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525805855
    },
    {
        "content": "<p>Eric, I'm sorry I missed today's OO on FHIR call. We've looked at timing extensively, and I'd be happy to provide more details on use cases. With the WG coming up next week, when do you think you'd be able to discuss this again? Thanks, Irina</p>",
        "id": 153957044,
        "sender_full_name": "Irina Connelly",
        "timestamp": 1525810524
    },
    {
        "content": "<p>Part of the gap here to represent what we need in our service plans is really a couple of issues.  </p>\n<p>1) Timing can't handle many of our units of measure, like meals, dollars, miles, trips, visits, etc. So we need some sort of quantity to be able to say that a service can provide 40 meals a month.  Based on relatively extensive discussions with Lloyd, the only way to really deal with our units is to add a quantity, similar to what is in dosage.</p>\n<p>2) In terms of \"timing\" sorts of things, there is the high level quantity that is approved, say someone is to get 40 meals a month the existing timing data element can be used to provide the details that it is 2 meals a day on Monday thru Friday. We would like to have the option to use a quantity ratio, which would support saying 40 meals a  month, and then being able to use Timing for the higher level of detail. In the real world with these service plans, the plan is initially published with the higher level information (40 meals a month) and then after the service provider and the service recipient get together later to nail down the more detailed information.</p>",
        "id": 153957174,
        "sender_full_name": "Jack Wallace",
        "timestamp": 1525870482
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195836\">@Irina Connelly</span>  unfortunately, I won't be at the WGM but would be happy to hear about your use case and whether timing worked.</p>",
        "id": 153957200,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525875783
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Nobody from our team will be at this WGM either. We are planning to join the OO on FHIR calls after the WGM meeting, unless a different time would work better.</p>",
        "id": 153957274,
        "sender_full_name": "Irina Connelly",
        "timestamp": 1525882176
    }
]