[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15596\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15596\">GF#15596</a>   I'm finding this pretty non persuasive:<br>\n to clarify: is  the proposal  to enable  profiling device - because for profiling the cardinality of the element doesn't matter - just reuse the same profile for mulitple types.   or is it to enable a way to represent multiple devices in a single Device instance - that is not going to work since all the resource attribute point to a single device.  </p>\n<p><span class=\"user-mention\" data-user-id=\"192220\">@Martin Rosner</span> ?</p>",
        "id": 153939496,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519248576
    },
    {
        "content": "<p>My reading of the proposal is that a single device might simultaneously be of multiple types.  E.g. Heart rate monitor + Pulsoximeter.  The question is how this relates to the Device/DeviceComponent division.  Do we have 0..* on Device.type or do we set Device.type to \"multi-function device\" and then list the types in DeviceComponent?  Having two ways to convey the same information isn't prohibited in FHIR, but we need to think carefully before we allow it and confirm that it's really necessary.</p>",
        "id": 153939562,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519270599
    },
    {
        "content": "<p>I thought the whole device,  device component, device metric model was all about representing the attributes for each modality.  If you don't care then just use type = \"multifunction device\" i.e 0..1.</p>",
        "id": 153939567,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519274582
    },
    {
        "content": "<p>Well, the point is that they do care.  They want to say \"This device is a heart rate monitor\" and \"This device is a pulseoximeter\" - for the same device.  The question is what's the right way to do that - and if we should support two ways of doing that.</p>",
        "id": 153939568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519274825
    },
    {
        "content": "<p>There are already type codes for multicomponent devices.  will await further input.  A diagram would be nice...</p>",
        "id": 153939569,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519276565
    },
    {
        "content": "<p>submitter has provided a powerpoint summarizing there requested changes in the tracker</p>",
        "id": 153941050,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519766787
    },
    {
        "content": "<p>Here are a couple of screenshots: <br>\nWhat the submitter would like Device to do: <br>\n<a href=\"/user_uploads/10155/Shb32PZnNwoeB9VnIgE7CiD4/Screen-Shot-2018-02-27-at-1.27.14-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-02-27-at-1.27.14-PM.png\">Screen-Shot-2018-02-27-at-1.27.14-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Shb32PZnNwoeB9VnIgE7CiD4/Screen-Shot-2018-02-27-at-1.27.14-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-02-27-at-1.27.14-PM.png\"><img src=\"/user_uploads/10155/Shb32PZnNwoeB9VnIgE7CiD4/Screen-Shot-2018-02-27-at-1.27.14-PM.png\"></a></div>",
        "id": 153941051,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519766953
    },
    {
        "content": "<p>see the tracker for more details..</p>",
        "id": 153941053,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519767002
    },
    {
        "content": "<p>Here is my immediate feedback:<br>\nWould like more detailed model of IEEE 11073 PHD  or a simple nonFHIR model of what is being displayed in Slide 5.   I am still not clear why device replaces devicecomponent for the the different functions of a device as displayed in Slide 5 and why device isn't the top level instead of DeviceComponent.  I would seem to me that the proposal just replaced DeviceComponent with Device in essence getting rid of DeviceComponent as a redundant layer?</p>\n<p>And I still don't get why type would be 0..*  just use a concept for 'multifunction device Z',  what does listing out   'device Z with function A', and 'device Z with function B'  buy you?</p>\n<p>An alternative is to use some post- coordinated concept.</p>\n<p>We need to look how these changes would affect the other use cases for Device as well.</p>",
        "id": 153941054,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519767462
    },
    {
        "content": "<p>The diagram posted doesn't show DeviceComponent at all...</p>",
        "id": 153941062,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519768190
    },
    {
        "content": "<p>see the tracker for more details..  that is just one screen shot from the powerpoint</p>",
        "id": 153941069,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519771125
    },
    {
        "content": "<p>Here what I think the best solution would be if the desire is to really harmonize the two.  this is a more radical change than the radical change suggested by the commenter.</p>\n<ul>\n<li>get rid of DeviceComponent and merge with Device</li>\n<li>Nest Devices</li>\n</ul>",
        "id": 153941237,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519842960
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153941238,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519842973
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/1OnQ0SAOFcLbUluMCTlsBe8G/Screen-Shot-2018-02-28-at-10.32.51-AM.png\" target=\"_blank\" title=\"Screen-Shot-2018-02-28-at-10.32.51-AM.png\">Screen-Shot-2018-02-28-at-10.32.51-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/1OnQ0SAOFcLbUluMCTlsBe8G/Screen-Shot-2018-02-28-at-10.32.51-AM.png\" target=\"_blank\" title=\"Screen-Shot-2018-02-28-at-10.32.51-AM.png\"><img src=\"/user_uploads/10155/1OnQ0SAOFcLbUluMCTlsBe8G/Screen-Shot-2018-02-28-at-10.32.51-AM.png\"></a></div>",
        "id": 153941239,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519842989
    },
    {
        "content": "<p>still can't understand why need type = 0..*.  The way I look at it is if you have a bag of groceries your code is bag of groceries you don't list each item in item in the bag.</p>",
        "id": 153941240,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519843193
    },
    {
        "content": "<p>(kudos to ClinFhir once again for letting me visualize this so easily)</p>",
        "id": 153941241,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519843270
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/hqSpGTtuopLq9mRZH-R0JvDf/Screen-Shot-2018-02-28-at-12.19.19-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-02-28-at-12.19.19-PM.png\">Screen-Shot-2018-02-28-at-12.19.19-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/hqSpGTtuopLq9mRZH-R0JvDf/Screen-Shot-2018-02-28-at-12.19.19-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-02-28-at-12.19.19-PM.png\"><img src=\"/user_uploads/10155/hqSpGTtuopLq9mRZH-R0JvDf/Screen-Shot-2018-02-28-at-12.19.19-PM.png\"></a></div>",
        "id": 153941266,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519849448
    },
    {
        "content": "<p>and after rereading the PHD draft IG think that what is really wanted is a way to represent Specializations in a device.  so sounds more like an new element than Type 0..*</p>",
        "id": 153941267,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519849537
    },
    {
        "content": "<p>Eric,<br>\nThat would be the ideal solution in my opinion. There is so much overlap between Device and DeviceComponent that they do not deserve to be independent resources. If the two were merged, then the Device would get parent and child elements and one could use that to establish any kind of hierarchy one wants. The hard part as I have seen it for Personal Health Devices (which are a single device) has been the lack of a ProductionSpecification in the Device.<br>\nAlso, about multiple specializations in a PHD. In some sense, the definition of a specialization is somewhat arbitrary and artificial. An example is the ECG specialization which is used as a heart rate monitor. But the monitor uses some input from the user (weight, age, sex, etc.) and the device calculates calories burned based upon those inputs and the heart rate. However, the calories consumed measurement is not part of the ECG specialization, it is part of the Cardiovascular specialization. So this device reports two specializations.</p>\n<p>Another case is a weight scale and body composition specialization. Both have weight measurements and the BCA needs that weight value to do its thing. So a BCA is often a scale you step on barefoot so little electric pulses go through you to get the BCA measurements (such as percent of body fat). Here is another potential multi-specialization device in the PHD world. In both cases, it is a single device.</p>\n<p>In the much more sophisticated PoCD world, the Device might be a controller, like a Vital Signs Montor. But it controls sub-components that may even come from different companies. These sub-components might be individually responsible for measuring a single vital sign; heart rate, temperature, breathing rate, SpO2, etc. Those sub-components may be exchangeable pieces of hardware and the PoCD model is capable of expressing and reporting that. No so in the PHD world. All measurements are reported as coming from a single unit and the receiver of the data only knows what the measurements are and they all come from a Device with the same fixed properties.<br>\nA couple of years ago a submitted a request for the merger of the Device and DeviceComponent as a way to solve all PHD and PoCD mapping issues without losing anything that the Device already had. Since many of the elements in both are the same, the merger did not add many new elements.</p>",
        "id": 153941453,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1519903787
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>  The ProductionSpecification really bothers me because in Device we enumerate  may of the these as inline elements so what else in the 80% that needs to be an element and how do we avoid duplication or putting in ProductionSpecification when there is a perfectly good element.</p>",
        "id": 153941485,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519919978
    },
    {
        "content": "<p>I am glad we are in agreement but I am assuming that there is not universal agreement  - Will need cross WGs coordination and pretty sure will be hard to do before R 4</p>",
        "id": 153941487,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519920137
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>  Eric, is your proposal to do away entirely with DeviceComponent or only to leave it out of the PHD model? Accomodating PHD needs fully in  Device is a good thing, but trying to completely collapse DeviceComponents into Device would  throw over Point-of-Care Device (PoCD) modeling and practice in a big way. A complicated PoCD device (and most of them are fairly complicated) is represented by a hierarchy of related DeviceComponents, some of which make no sense to represent as  Devices. And hanging dynamic attributes off of Device seems  inconsistent with its intended use, no?</p>",
        "id": 153941566,
        "sender_full_name": "John Rhoads",
        "timestamp": 1519930982
    },
    {
        "content": "<p>By dynamic attributes I mean things like measurement state. An individual module or measurement can be turned off at the device by clinicians for reasons like moving leads or transducers on a patient. Software trying to determine why observations aren't coming in would want to be able to find that out.</p>",
        "id": 153941569,
        "sender_full_name": "John Rhoads",
        "timestamp": 1519931668
    },
    {
        "content": "<p>The suggestion is to Merge them reproducing DeviceComponents elements in Device and doing away with the DeviceComponent.    Conceptually  it sounds to me that there is not a bright line between the Device and DeviceComponent or we would not be talking about this. Using a single resource that sometimes is the device containers or sometimes a component and sometimes something in the middle seems like a better idea than duplicating a bunch of elements in Device ( as the tracker suggests ) and creates two essentially identical resources.   I haven't explored this idea much beyond this chat but would like to discuss further.   Originally Device was intended to be a static administrative thing.   Maybe is to ambitious to have a single resource cover all device use cases?  but here is pretty complete picture of the merge resource ...</p>",
        "id": 153941627,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519940210
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/qehquw4_AzvT1Y0GPXYVxR4S/deviceComponent-DeviceMerge.png\" target=\"_blank\" title=\"deviceComponent-DeviceMerge.png\">deviceComponent-DeviceMerge.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/qehquw4_AzvT1Y0GPXYVxR4S/deviceComponent-DeviceMerge.png\" target=\"_blank\" title=\"deviceComponent-DeviceMerge.png\"><img src=\"/user_uploads/10155/qehquw4_AzvT1Y0GPXYVxR4S/deviceComponent-DeviceMerge.png\"></a></div>",
        "id": 153941629,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519940354
    },
    {
        "content": "<p>Can we discuss after HIMMS?  or during if you are there?</p>",
        "id": 153941630,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519940409
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span>  I think the idea is to merge them so that they can represent either. All fields that exist in the DC would now be present in the Device, and with the merger, the DC would add 'child' and 'parent' elements. The Device would be the static entity at the top of the hierarchy. IT would have no parent. A Device with a DC concept would always have a parent and either point to another Device with a parent element or a static top-level Device with no parent. One could even make the requirement that a Device with lastSystemChange and operationalStatus entries must have a parent element. And that a Device without a parent element shall not have lastSystemChange and operationalStatus entries. As I understand it, these two are the only dynamic entries; everything else is present on a static Device or is already present in the Device. At one time 'lastSystemChange' was required in the DC but taken out so PHDs could use it only to get the productionSpec. A compromise but in so-doing knocked a piece of the 'dynamicness' of the DC down a notch. One could bring it back by requiring the field if there is a parent element.<br>\nThe combination of the two has the advantage of efficiency since so much is otherwise duplicated between the two. That simplifies IG guides so they don't have to specify which of the duplicate entries is populated.</p>\n<p>Well, that was the idea in any case.</p>",
        "id": 153941739,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1519984750
    },
    {
        "content": "<p>I agree that there is some overlap between Device and DeviceComponent, and there will be more with the addition of productionSpecification. As suggested, the point-of-care device model defined in the PoCD IG could also be realized by profiling Device resources for the MDS, VMD, and Channel layers (constraining unneeded elements to 0..0). It would even solve the problem with multiple UDIs for devices with physical sub-systems.<br>\nCurrently the Device resource can be used as \"entry point\" for searching and reconstructing the PoCD structure from resources on a server. DeviceComponents can be found by looking for the source reference. Using Device only will need clear guidance how to distinguish between the overall device representation and purely logical components.<br>\nMerging Device and DeviceComponent would be a big change for the current PoCD model. If we can get to a clean and aligned model for both PHD and PoCD, I'd consider it worth the effort.</p>",
        "id": 153941766,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1519999646
    },
    {
        "content": "<p>Needs some discussion. Unfortunately I won't be at HIMSS, nor I think will either of the Stefans, or Brian, so let's find another venue (might \"Devices on FHIR\" conference calls Wednesdays 9:30 ET work?). As Stefan K says, it would be a big change for PoCD model, but it might be worth doing for a couple of potential benefits. I'm surprised that people who are not so much in the device world seem to be willing to consider repurposing Device from being mainly administrative to something with two divergent uses and bundles of functionality that, you have to admit, are pretty different and maybe involve some pretty contorted \"80-20\" rationalization. I'd also think some current users of Device would find the ground shifting under them in surprising ways. However, it's not for me to say! I'm willing to listen.</p>",
        "id": 153941812,
        "sender_full_name": "John Rhoads",
        "timestamp": 1520019912
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"192966\">@Stefan Karl</span> <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span></p>",
        "id": 153941813,
        "sender_full_name": "John Rhoads",
        "timestamp": 1520020116
    },
    {
        "content": "<p>This should not bother current Device users, as all the introduced fields and merged fields are optional. It won't even be a breaking change. Software that can work with the current Device will work with this merger as it does not change anything in the current Device. The only breaking change is outside of the merger but would be changing the Device.type to 0..*.<br>\nOO does not particularly like that but would prefer adding a new element called specializations with 0..*. PHD is certainly happy with that. The Device.type might then be \"PHD\" and then the specializations would be in the new element.<br>\nOne has to also remember that the Device is only at level 2 which means that development is still expected as it gets used and tested.</p>",
        "id": 153941814,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1520020584
    },
    {
        "content": "<p>Late to this discussion, but just to let know that afaik there is a chance that we'd reform/retire DeviceComponent</p>",
        "id": 153941815,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1520020700
    },
    {
        "content": "<p>(right?)</p>",
        "id": 153941816,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1520020730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192966\">@Stefan Karl</span>  What is productionSpecification?</p>",
        "id": 153941817,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1520020759
    },
    {
        "content": "<blockquote>\n<p>There is so much overlap between Device and DeviceComponent that they do not deserve to be independent resources. If the two were merged, then the Device would get parent and child elements and one could use that to establish any kind of hierarchy one wants. </p>\n</blockquote>\n<p>Yes, that is the thing. Device can have a component that is another device. A Device Matryoshka</p>",
        "id": 153941819,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1520021293
    },
    {
        "content": "<blockquote>\n<p>Here what I think the best solution would be if the desire is to really harmonize the two.  this is a more radical change than the radical change suggested by the commenter.<br>\n*   get rid of DeviceComponent and merge with Device<br>\n*   Nest Devices</p>\n</blockquote>\n<p>Yes, we discussed this path this week</p>",
        "id": 153941822,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1520021574
    },
    {
        "content": "<p>I think it's worth discussing in DoF given the feedback from OO. And indeed since maturity is at level 2, this is a good time to harmonize across all interested parties (administrative or otherwise). As the lines between PHD and PoCD become increasingly blurry it is in all our interests to come to a common model - to that end I am not surprised of the effort to do so. We can discuss further on the DoF call but for <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> that will be 6:30am Vegas time next week.</p>",
        "id": 153941829,
        "sender_full_name": "Martin Rosner",
        "timestamp": 1520021948
    },
    {
        "content": "<p>sure I will try to make it.  Which day?    And I admit I'm only looking at this issue from the perspective of the tracker and the intent to harmonize the two.   I am not a medical device expert and trying to understand the use case.  It  is a huge challenge to try to represent everything from a toothbrush to a complex medical monitoring device in a single resource.  There are obvious trade-offs.</p>",
        "id": 153941864,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520034161
    },
    {
        "content": "<p>RE:  \"It would even solve the problem with multiple UDIs for devices with physical sub-systems.\"  There is separate tracker <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13965\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13965\">GF#13965</a> which is <em>also</em> making the suggestion that  a component Device point to a parent Device.</p>\n<p>\"Between the Device and DeviceComponent, there are a number of ways in which UDI information can be represented for these more complex, composable systems.  For example, there could be a Device instance with UDI for the top-level information and then one or more DeviceComponents for the subcomponents, some of which may also have UDI information.  Alternatively, a new relationship data element could be added to Device (e.g., parent) to represent \"is a component of\" and thus capture the additional UDIs. \"</p>\n<p>I have not dealt with this one directly : <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  or <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>  I'm sure this discussion ties into that one as well.</p>",
        "id": 153941866,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520034862
    },
    {
        "content": "<p>it does. It seems we will benefit from getting rid of deviceComponent and soon</p>",
        "id": 153941890,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1520038073
    },
    {
        "content": "<p>Well ... is a discussion point.  The people using and making Devices need to agree as well.</p>",
        "id": 153941891,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520038137
    },
    {
        "content": "<p>yes. i am just stating that imo we made life harder, the sooner we have some more solid resource set, the better</p>",
        "id": 153941892,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1520038232
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> productionSpecification is a complex element that carries hardware- and software-specific information like product/part number, serial number, and hardware/firmware/software versions. There can be multiple (0..*) entries, which have a specification type with extensible binding, an optional identifier, and the specification string itself. The definition is taken from the ISO/IEEE 11073-10201 (PoCD) and -20601 (PHD) standards.<br>\nThe ability to represent multiple versions is quite important. Even simple electronic devices will have hardware and firmware version. In many cases there are several pieces of software with independent versioning, e. g. boot loader, operating system, and application software modules. This is what the optional identifier is intended for. Centralized device management and software update servers will need this information at a detailed level.</p>\n<p>We already identified some overlap between the productionSpecification definition and what's already in the Device resource - see last slide in Martin's presentation attached to <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15596\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15596\">GF#15596</a>: Serial number is in Device.identifier and should be removed from the specification-type ValueSet. Device.version should be covered by the (more specific) productionSpecification entries.</p>",
        "id": 153941942,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1520096344
    },
    {
        "content": "<p>@Jose and @Stefan  I  listed the prod specs out in mashup logical model combining the two <a href=\"https://chat.fhir.org/#narrow/stream/Orders.20and.20Observation.20WG/subject/GF.2315596.20.20Request.20cardinality.20of.20Device.2Etype.20be.20changed.20from/near/131043\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/Orders.20and.20Observation.20WG/subject/GF.2315596.20.20Request.20cardinality.20of.20Device.2Etype.20be.20changed.20from/near/131043\">above</a>.  As Brian mentioned you could easily profile the component from Device if we were to go this route.</p>",
        "id": 153941954,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520102573
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Yes, I think that is closer to what we need. Is this taken from our UDI call last monday? <br>\n<span class=\"user-mention\" data-user-id=\"192966\">@Stefan Karl</span> I was afraid that productionSpecification was a new resource. in Catalog discussions, we have found a need for additional attributes like this. So I do think we need these attributes. However, we should not mix Kind and instance in a same element.<br>\nSerial number, firmware version etc. are on the Instance, not on Kind.<br>\nProduct and part number are on Kind, not on instance. Think GS1's Device Identifiers (Kind) and Production Identifiers (Instance).<br>\nSo I think that a) merging DeviceComponent into device and b) handling Kind and Instance appropriately will give us what we need. Having a flexible \"productionSpecification\" seems to be quite close to what we had in entryDefinition.</p>",
        "id": 153941958,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1520107873
    },
    {
        "content": "<p>Wednesday/tomorrow.</p>",
        "id": 153942597,
        "sender_full_name": "Martin Rosner",
        "timestamp": 1520346880
    },
    {
        "content": "<blockquote>\n<p>sure I will try to make it.  Which day?    And I admit I'm only looking at this issue from the perspective of the tracker and the intent to harmonize the two.   I am not a medical device expert and trying to understand the use case.  It  is a huge challenge to try to represent everything from a toothbrush to a complex medical monitoring device in a single resource.  There are obvious trade-offs.</p>\n</blockquote>\n<p>Wednesday / tomorrow - <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 153942598,
        "sender_full_name": "Martin Rosner",
        "timestamp": 1520347021
    },
    {
        "content": "<p>Can somebody explain to me what a \"Specialization\" is in simple non-10073 insider terms.  When I hear it and read about it I think of it *not * as a type but a set of attributes that describes a function  OR a subtype that describes a specific capability.   For example to me the type is a fitness band or a Pulse OX and a specialization is the HR functionality.  </p>\n<p>So when I look at representing  this term 'specialization' in FHIR  It could be any on of these things...</p>\n<ul>\n<li>a translation on the type </li>\n<li>a set of capabilities listed as codes<ul>\n<li>as types  (fitness band, hrt rate monitor)</li>\n<li>as a new element specialization</li>\n</ul>\n</li>\n<li>a set of Device profiles.</li>\n</ul>",
        "id": 153942621,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520353951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  A specialization is a refinement of the base standard, kind of like a profile on a resource in FHIR. The general resource has lots of options which a profile limits and defines to describe its use case. THe base standard 20601 is a generic means of representing (almost) any medical device; the device information and the types of measurements. A specialization, like the Blood Pressure specialization, restricts the generalized attribute values and objects to specific values; for example it specifies two measurement objects (equivalent to FHIR resources), one to represent the blood pressure and another to represent the pulse rate. Within each of those objects the attributes (equivalent to resource elements) are specified to describe a blood pressure measurement etc. That might be a little too 11073 but the corresponding FHIR model (which you are very familar with) should help.</p>",
        "id": 153942709,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1520428176
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  \"Production specification' As I see it the Device has only one inline element and that is the version. THe Production Spec has hardware, software, and firmware versions, all which are different. The Production Spec does NOT normally include the manufacturer name and model number. Those are in the SystemModel attribute of the PHD. For the PHD IG guide, I had to put those two fields in the Production spec since there was no place for them in the DeviceComponent. THis too has always seemed weird to me since the PoCD specification has a SYstemModel attribute for BOTH the MDS and VMD. My ideal mapping would be MDS to Device and VMD to DeviceComponent. But lets face it, they are both Devices so in the end fields one needs to describe them are going to be mostly the same!</p>\n<p>THe UDI is also making its way into PHDs. ITs not there yet, but its all a matter of time. THus we will need that in the DeviceComponent, too. This is why I like a merger.</p>",
        "id": 153942711,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1520428746
    },
    {
        "content": "<p>thanks for the explanation of specializations,  that is going to be hard to document but necessary. updated the proposed merged resource here: <a href=\"http://clinfhir.com/logicalModeller.html#8tbfk\" target=\"_blank\" title=\"http://clinfhir.com/logicalModeller.html#8tbfk\">http://clinfhir.com/logicalModeller.html#8tbfk</a></p>",
        "id": 153942815,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520443994
    }
]