[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17515\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17515\">GF#17515</a> <span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span>  Can you provide a mapping between the proposed test statuses and the Obervation statuses?   Will be discussing this with the OO lab folks.   Also, there is no corresponding concept of a test status in v2 so where and how is this used in v2?</p>",
        "id": 153992908,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536027714
    },
    {
        "content": "<p>Not sure I understand the question.  There are two distinct concepts to be captured: the status of the result itself (indicating whether it has been QCed) and the status of the test (indicating whether it was performed).  The only place we capture the concept of \"test\" appears to be within Observation. If we had  a lab test request or a relationship between the test request and the observation, that is probably where we would put the test status.  Mixing the two concepts in a single field would result in interpretation overhead and rules.  \"if you see this value, then you assume....\"</p>",
        "id": 153993811,
        "sender_full_name": "Christine D",
        "timestamp": 1536240835
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span>, can you provide a clearer explanation of exactly what the workflow is?  FHIR has a status for the order - which represents the status of the authorization.  An authorization might exist for a particular test to be done multiple times over the period of a year.  It'll remain active until the last test is performed and deemed to be complete.  And we have a status on the Observation.  Non-reviewed results are reported with a status of \"preliminary\" and reviewed/confirmed results are reported with a status of \"final\".  Where does your new status fit into this and why is it needed?</p>",
        "id": 153993842,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536244661
    },
    {
        "content": "<p>I have discussed on the OO on FHIR call with lab folks and they indicated in HL7 Version 2 messaging speak which is the current way most labs communicate electronically.  The order status is in OBR-25? and the test or test result status is OBX-11.   These map as follows</p>",
        "id": 153993851,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536247919
    },
    {
        "content": "<table>\n<thead>\n<tr>\n<th>FHIR element</th>\n<th>HL7 V2 Element</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Observation.status</td>\n<td>OBX-11</td>\n</tr>\n<tr>\n<td>DiagnosticReport.status</td>\n<td>OBR-25</td>\n</tr>\n</tbody>\n</table>",
        "id": 153993853,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536247984
    },
    {
        "content": "<p>I am confused by the term \"test status\"  that could mean many things.....</p>",
        "id": 153993854,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536248061
    },
    {
        "content": "<p>Also FHIR Observation is not really intended for use in back end LIS machine to machine communiciations to provide the intermediate statuses testing statuses that machines might relay to each other....</p>",
        "id": 153993855,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536248206
    },
    {
        "content": "<p>And then there is the Provenance resource to provide a bunch of background to the resource updates...</p>",
        "id": 153993856,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536248278
    },
    {
        "content": "<p>I'm not a fan of the term \"test status\".  That's its name in the CDISC LAB data standard.  In most models, the concept of \"test\" and the concept of \"result value\" are two distinct entities.  You run a test and it produces result values.  (one test execution related to many result values).  The test itself may have attributes (name, execution status - was the test run successfully or not, etc.) and then the results that are produced by the execution of that test have attributes (value, QC level status).  I think that's where the confusion lies - in FHIR, we  have \"test\" and \"result\" combined into a single resource - Observation.  Is there a separate resource that represents the test performed?</p>",
        "id": 153994013,
        "sender_full_name": "Christine D",
        "timestamp": 1536261110
    },
    {
        "content": "<p>You can have an Observation that represents a panel that then has member Observations.  For example you might have a \"Blood Panel\" Obseration that then points to member Observations for hemoglobin, white blood cell count, etc.</p>",
        "id": 153994084,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536265395
    },
    {
        "content": "<p>Also, some types of tests might have multiple components (e.g. blood pressure having systolic and diastolic), but there's only one status for the Observation.</p>",
        "id": 153994086,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536265443
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span>  it would be helpful to discuss this in person with OO.  we have lots of lab SMES  on the call.  I have not seen the concept of \"test status\" represented in interoperability standards, which makes me believe is a backend ( intermediate status) kind of thing.  Can you make one of our Thursday at 10 AM PACIFIC TIME OO calls or a Tue 11AM PACIFIC TIME Call?  let me know so I can make sure have enough people to discuss.  Otherwise we could discus at the WGM in Baltimore if you will be there?</p>",
        "id": 153994111,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536272838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  that would be great.  I can be on the call Tuesday at 2:00pm EST (11:00am Pacific) or Thursday at 1:00pm EST / 10:00am PST.  I will also be at the Connectathon and will attend the WGM until Tuesday lunchtime.</p>",
        "id": 153994147,
        "sender_full_name": "Christine D",
        "timestamp": 1536276833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> after looking at ServiceRequest, we think that is the right place (and it already has the status and the doNotPerform flag available).  There would be a request to run lab tests and the lab would then update the ServiceRequest (at least that's what the documentation says) with the status of whether they were able to perform the test or not.  Sound reasonable?</p>",
        "id": 153994398,
        "sender_full_name": "Christine D",
        "timestamp": 1536351575
    },
    {
        "content": "<p>In general, the lab would never update the placer's copy of the ServiceRequest - that's the official authorization and the only system that should touch it in general is the placer system.  The Lab would create a filler order copy of the ServiceRequest that reflects what they're actually going to do (which isn't always the same as what's ordered).  In most cases, there'll also be a Task in between that represents the request for a particular lab to fulfill a particular (part of a) lab order.  That's where you capture statuses like \"requested\", \"accepted\", \"in progress\", etc.</p>",
        "id": 153994471,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536355679
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195175\">@Angie Romano</span> is this consistent with what we were going to do?</p>",
        "id": 153995347,
        "sender_full_name": "Christine D",
        "timestamp": 1536595327
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> let me make sure I've got this.  I just want to make sure what we mock-up is what will \"usually\" or \"should\" happen in reality.  </p>\n<ul>\n<li>Healthcare institution creates a ServiceRequest that is sent to a lab</li>\n<li>Lab acknowledges said ServiceRequest and generates an order which creates an additional ServiceRequest and a Task</li>\n<li>Lab updates Task with status changes</li>\n</ul>\n<p>So, if I have that part right, then how would we be able to retrieve both ServiceRequests and the the Task when query the Healthcare institutions FHIR server? Do the ServiceRequests and Tasks from the lab make it back to the Healthcare Institution or would we need to query both the Healthcare institution and the Labs FHIR servers to get everything that we need?</p>",
        "id": 153995379,
        "sender_full_name": "Angie Romano",
        "timestamp": 1536599836
    },
    {
        "content": "<p>There's a number of workflows possible.  There's a section talking about them here: <a href=\"http://build.fhir.org/workflow-communications.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow-communications.html\">http://build.fhir.org/workflow-communications.html</a></p>",
        "id": 153995381,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536599979
    },
    {
        "content": "<p>The original Task would typically be authored by the healthcare institution, as the Task says \"please fulfill one repetition of ServiceRequest 123 in the next week\"</p>",
        "id": 153995382,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536600033
    },
    {
        "content": "<p>In some cases, all 3 might live on different servers.  However, because you have the URLs, you can still retrieve them all</p>",
        "id": 153995385,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536600099
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span></p>",
        "id": 153995845,
        "sender_full_name": "Christine D",
        "timestamp": 1536690887
    }
]