[
    {
        "content": "<p>I am working on FHIR and want to send HIV ORDER to some other organization. Which resource i have to use   <br>\n1. ServiceRequest<br>\n2. DiagnosticOrder<br>\n3. CarePlan<br>\nandy code example</p>",
        "id": 156585361,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1548141551
    },
    {
        "content": "<p>You'll need to explain in more detail what \"HIV ORDER\" is - what are you looking to have happen?</p>",
        "id": 156585524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548141732
    },
    {
        "content": "<p>For example i want to request to perform Complete blood count (CBC) test from a LAB. How to design my order using HAPI FHIR</p>",
        "id": 156585648,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1548141909
    },
    {
        "content": "<p>And maybe which version of fhir you're targeting</p>",
        "id": 156593008,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1548151467
    },
    {
        "content": "<p>I am targeting dstu-3 and R4</p>",
        "id": 156593154,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1548151663
    },
    {
        "content": "<p>Ordering a CBC would be done using  ProcedureRequest in STU3 and ServiceRequest in R4.  The actual process to request fulfillment of the lab order could be done a variety of ways (check out the workflow pages), though for lab orders, something involving Task is most likely.  Make sure that the labs you're interested in talking to actually support FHIR though - not many (any?) do right now...</p>",
        "id": 156611601,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548169853
    },
    {
        "content": "<p>Great Question.  Are you asking about these order aspects too?:<br>\n1. The Service Catalog/lab compendium order, which is what the performing laboratory offers on their test menu and part of the CLIA Specimen Collection Manual (US), which needs to be built in the EHR's CPOE system so the physician can place the right order to the right laboratory.<br>\n2. The order requisition (medical legal request for an order issued by a physician)<br>\n3. The order request as to which order is selected in EHR CPOE and sent to the performing lab (and built in their LIS)?  <br>\n4. Is there a need to indicate specimen collection information as they order cannot be performed by the laboratory without a specimen?</p>\n<p>Sounds like it might be 1-3 above?  </p>\n<p>In which country is your implementation?  As Lloyd mentions, not aware of clinical labs that can receive FHIR.  If anyone is, please share....  Also in the US and some countries, some regulatory requirements may apply, affecting what can be done.</p>",
        "id": 157040507,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1548695410
    }
]