[
    {
        "content": "<p>Does FHIR provide any resources for stock management? I am dealing with a system now that deals with immunizations. Upon receiving the Immunization resource, they want to know whether to update the stock for the vaccine or not. Anyone knows how to go about this?</p>",
        "id": 274959820,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1646996330
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span></p>",
        "id": 274990477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647012732
    },
    {
        "content": "<p>FHIR resources for supply chain management are:</p>\n<ul>\n<li>R4: <ul>\n<li>SupplyRequest (for ordering items)</li>\n<li>SupplyDelivery (for tracking the dlivery of such items)</li>\n</ul>\n</li>\n<li>R5:<ul>\n<li>InventoryReport (for exchanging current state of inventory, or for tracking stock changes e.g. consumption)</li>\n<li>Transport (for exchanging the information about the physical transport of things)</li>\n</ul>\n</li>\n</ul>",
        "id": 274992342,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647013741
    },
    {
        "content": "<p>Normally, an immunization presumes that some dispense took place (the product or part were assigned to that specific patient)</p>",
        "id": 274992406,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647013782
    },
    {
        "content": "<p>if the system receives information about an immunization event, then what they know is that \"at least one dose was consumed for this patient\"</p>",
        "id": 274992559,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647013843
    },
    {
        "content": "<p>With that in mind, the exchange depends on what the different systems are doing. Key point: who decides when to order? </p>\n<ul>\n<li>Is it the sending system that says \"We just gave a vaccine, a reorder is now needed\"</li>\n<li>Or is it the receiving system that sees a messaage saying \"We just gave a vaccine, please decide whether to reorder\"<ul>\n<li>In this case, the receiving system needs to know the current stock, e.g. by tracking previous consumptions or getting the additional information \"We now have 29 units in stock (InventoryReport), please see if a reorder is needed)</li>\n</ul>\n</li>\n</ul>",
        "id": 274993509,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647014314
    },
    {
        "content": "<p>if you just want to receive additional information and say \"I have just gave a vaccine and I used up one box with this one\", then this is a consumption (which can be done with InventoryReport)</p>",
        "id": 274993744,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647014406
    },
    {
        "content": "<p>With R4 you're quite limited (Supply was not a focus of FHIR traditionally, and FHIR doesn't want to replace supply standards, but articulate with them. This is why we have Transport and InventoryReport coming, because they make the link between clinical and logistics)</p>",
        "id": 274994199,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647014502
    },
    {
        "content": "<p>As I understand the situation now, the receiving system (known as Vaccinnet (Belgium/Flanders)), knows about the stock of a sender. The sender should indicate whether an immunization message causes the decrease of the stock of the sender for that vaccine by one.</p>",
        "id": 274994483,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1647014629
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"441371\">Bart Decuypere</span> <a href=\"#narrow/stream/179256-Orders-and-Observation-WG/topic/Immunization.20and.20stock.20management/near/274994483\">said</a>:</p>\n<blockquote>\n<p>The sender should indicate whether an immunization message causes the decrease of the stock of the sender for that vaccine by one.</p>\n</blockquote>\n<p>Ok so the sender would say explicitly whether a product/item/pack/box was consumed?</p>",
        "id": 274996665,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647015611
    },
    {
        "content": "<p>in which case would the sender not send \"decreased by one\"? Would it ever say \"decreased by 2\" or \"not decreased\"?</p>",
        "id": 274996778,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647015671
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I'm very interested in this topic. In the US we have the old model where the report of an administered vaccination causes a single dose to be decremented. But this process was never intentionally designed and is essentially broken. We are looking to modernize to FHIR and are looking to leave that old \"decrementing\" model. </p>\n<p>The ideal solution would be a comprehensive tracking of inventory, including usage (decrementing), wasted, receiving, transferring, etc.  I see this separated from reporting an administration of an immunization to a patient. A clinical system might report to a registry \"Patient A received Immunization X\", and then separately to a vaccination inventory system (perhaps even the same registry) that \"Immunization X has one less dose because it was administered\". This idea is very rough, we haven't really started exploring it enough y et. </p>\n<p>Is this what you are looking for too? Or do you see it differently?</p>",
        "id": 275041065,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1647036670
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Belgium (due to its federal structure) has several vaccination authorities. All authorities want to be aware of vaccinations of the other authorities, but they only need to decrease stock if the vaccinating institution (sender) is part of the receiving authority. Example: if a Flemish institution sends a immunization message to a Flemish authority, the Flemish authority should decrease the stock for the institution. If a Walloon, or Brussels authority sends a message to the Flemish authority, to indicate that a vaccination took place in another region of the federal state, then the Flemish authority does not have to decrease the stock.</p>",
        "id": 275201758,
        "sender_full_name": "Bart Decuypere",
        "timestamp": 1647243632
    },
    {
        "content": "<p>I understand that :)</p>",
        "id": 275204556,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647245999
    },
    {
        "content": "<p>This could be an appendix to the immunization message.  The immunization message says \"we just gave a vaccine\". This appendix would say:<br>\na) \"... and a dose was consumed, please do with it as you find useful, as the vaccination site doesn't manage regional stock\"<br>\nb) \"...and the vaccination site reports a dose was consumed, so that the receiving site can do with it as it wants\"</p>",
        "id": 275204808,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647246174
    },
    {
        "content": "<p>I think we're talking about a) - which in R4 would be either an extension or a Dispense. <br>\nThis should be clear first in the logical model before we figure out how to do it in FHIR.</p>",
        "id": 275204920,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647246249
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> I am happy you explain the \"decrementing\" model for what it is - which is old. <br>\nIHE had been looking at this for a long time (we made a white paper some content and exhaustive traceability so that the requirements were clear). And in there there is one important aspect which is the separation between the logistics and the clinical.<br>\nAlso the dutch model separates the logistics from the clinical and I think it is a good way forward (actually the only one so far)</p>",
        "id": 275223664,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647257799
    },
    {
        "content": "<p>so, functionally: <br>\nClinically we have ordering, dispensing, preparation and administration.<br>\nLogistically we have transport, wastage, reporting, etc. Those are orthogonal</p>",
        "id": 275223863,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647257918
    },
    {
        "content": "<p>(summarized view: <a href=\"/user_uploads/10155/LmOurcn3x4xggJt2vOG7R-BO/image.png\">image.png</a> )</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/LmOurcn3x4xggJt2vOG7R-BO/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/LmOurcn3x4xggJt2vOG7R-BO/image.png\"></a></div>",
        "id": 275223873,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647257928
    },
    {
        "content": "<p>basic building blocks and some examples: </p>\n<ul>\n<li>Dispense is the articulation point between patient-specific and logistics</li>\n<li>Medication that is wasted/consumed is not the same as dispensed. There are several examples such as tablet dropped, cream tube is fully/partially used, medication recalled...</li>\n<li>Medication can be transported before or after dispensing (e.g. transport of bulk stock vs transport of patient-labeled medications)</li>\n<li>Products can be prepared before or after dispensing (e.g. cytostatics vs syrup mixtures at bedside)</li>\n</ul>\n<p>There is lots of assumptions possible - when we give a vaccine, we are implicitly stating that it was dispensed for that patient, and we are implicitly saying that at least one vaccine dose was consumed, and also the syringe. Those are normal and should be welcome - which is why our approach needs to be relatively solid and immune to assumptions being implicit or explicit.</p>",
        "id": 275224413,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647258369
    },
    {
        "content": "<p>In R5, we have the SupplyRequest and SupplyDelivery - to handle the material ordering and delivery- We also have InventoryReport that can say things like </p>\n<ul>\n<li>2 of these have been used</li>\n<li>today we have 2 of these less than we had yesterday</li>\n<li>now we have 22 of these total</li>\n</ul>",
        "id": 275224456,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647258404
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Thank you for the idea of separating \"logistics\" from \"clinical\". These are the words I need to describe what needs to change in the US. Do you know where I should look for the information on the Dutch model and/or the IHE white paper?</p>",
        "id": 275224526,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1647258450
    },
    {
        "content": "<p>some systems report only administrations, and others report the amount used/depleted/consumed. That is an optionality based on assumptions.<br>\nSome systems report \"i have consumed 2\" and other systems report \"I have 22 today\". that is not an assumption, that is depending on who actually keeps count.</p>",
        "id": 275224650,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647258539
    },
    {
        "content": "<p>for the Dutch models, I have this starting link: <a href=\"https://zibs.nl/wiki/HCIM_Release_2021(EN)\">https://zibs.nl/wiki/HCIM_Release_2021(EN)</a><br>\nI remember a nice diagram where the 2 parts of medication were separated - the clinical on top, logistics underneath -  perhaps <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> can help?</p>",
        "id": 275265287,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647276673
    },
    {
        "content": "<p>for the IHE white paper: <a href=\"https://www.ihe.net/uploadedFiles/Documents/Pharmacy/IHE_Pharmacy_WP_Supply.pdf\">https://www.ihe.net/uploadedFiles/Documents/Pharmacy/IHE_Pharmacy_WP_Supply.pdf</a></p>",
        "id": 275265497,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647276753
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  You probably want to go straight into the design details for Medication: <a href=\"https://informatiestandaarden.nictiz.nl/wiki/mp:V9_2.0.0_Ontwerp_medicatieproces_ENG\">https://informatiestandaarden.nictiz.nl/wiki/mp:V9_2.0.0_Ontwerp_medicatieproces_ENG</a></p>\n<p>The pictures use Dutch terms but all surrounding text is in English and there is a glossary on which Dutch terms mean what.</p>",
        "id": 275556231,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1647454844
    },
    {
        "content": "<p>that's it. 1.3.1 <span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span></p>",
        "id": 275556343,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647454894
    },
    {
        "content": "<p>Dankjewel, <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span></p>",
        "id": 275556960,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647455139
    }
]