[
    {
        "content": "<p>This is a follow up on: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17205\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17205\">GF#17205</a><br>\nWe still have the need to have DiagnosticReports which are summarizing several other DiagnosticReports. In the GF you pointed to the existing Extensions.<br>\nWe are currently considering the usage of: <a href=\"http://build.fhir.org/extension-diagnosticreport-extends.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-diagnosticreport-extends.html\">http://build.fhir.org/extension-diagnosticreport-extends.html</a></p>",
        "id": 157537719,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1549299687
    },
    {
        "content": "<p>Would you agree on extends, or do you think another of the several extensions would be a better fit?</p>",
        "id": 157537764,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1549299722
    },
    {
        "content": "<p>have you considered <a href=\"http://build.fhir.org/extension-diagnosticreport-summaryof.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-diagnosticreport-summaryof.html\">http://build.fhir.org/extension-diagnosticreport-summaryof.html</a></p>",
        "id": 157560004,
        "sender_full_name": "Eric Haas",
        "timestamp": 1549316851
    },
    {
        "content": "<p>yes we also considered it. What is the semantical difference between these two options. They seem to overlap a lot.</p>",
        "id": 157613076,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1549379475
    },
    {
        "content": "<p>Realize the topic has been circling between different WGs.  I'd shared with Eric last week, an example of a Diagnostic Report, which integrates results from other lab reports (CBC) that would be reported in DR resource if using FHIR:  <a href=\"https://www.mayocliniclabs.com/test-updates/attachment.php?id=52148\" target=\"_blank\" title=\"https://www.mayocliniclabs.com/test-updates/attachment.php?id=52148\">https://www.mayocliniclabs.com/test-updates/attachment.php?id=52148</a>  Also provided a cytogenetics report as example of genomics testing.  </p>\n<p>The major issue mentioned on CG calls is around the requirements that each report individually would require the name of the performing lab, patient demographics, etc.  However, in an integrated report, each individual report information is often pulled in to the integrated report, but it excludes the patient information from the individual reports in favor of having a header with the patient demographics, performing lab, etc. to avoid unnecessary duplication of fields.</p>\n<p>Both types of formats/structure/modeling need to be supported in FHIR DR as they are comprise the major ways narrative reports are communicated worldwide today.  It's a broader O&amp;O issue and why Patrick is bringing it forward for O&amp;O to consider.  Would there be an upcoming O&amp;O call where it might be discussed Eric or would you have it on the O&amp;O on FHIR call?  Would prefer to get Kathy and others to weigh in on how they might support given they report hundreds if not thousands daily in their labs.</p>",
        "id": 157619544,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1549384679
    },
    {
        "content": "<blockquote>\n<p>The major issue mentioned on CG calls is around the requirements that each report individually would require the name of the performing lab, patient demographics, etc.  However, in an integrated report, each individual report information is often pulled in to the integrated report, but it excludes the patient information from the individual reports in favor of having a header with the patient demographics, performing lab, etc. to avoid unnecessary duplication of fields.</p>\n</blockquote>\n<p>i don't see that as an issue in FHIR  as these are only references.</p>",
        "id": 157677076,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1549445770
    },
    {
        "content": "<p>However for US and multiple country regulatory requirements this is an issue as they need to be on each report or represented once on a single integrated report.  From what Kevin discussed it didn't seem like this had been resolved.  If there are examples it may help clarify.</p>",
        "id": 158041904,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1549901469
    },
    {
        "content": "<p>In FHIR context conduction is <em>not</em> assumed and resources must for a complet representation by themselves so   \"to avoid unnecessary duplication of fields.\" is not a goal,  the resources will by design repeat a lot of information.</p>",
        "id": 158054860,
        "sender_full_name": "Eric Haas",
        "timestamp": 1549911708
    },
    {
        "content": "<p>Context is vital to have clinically accurate meaning.  I wasn't following your message completely.  Are you saying resources must completely represent concepts themselves?  If so, then service request and observation and diagnostic report must all be combined?  There is important context in lab orders that apply to the results in a number of cases (observations, and thus diagnostic report).  It's also vital to know if Ear is a specimen type or specimen source as they are coded differently in SCT, and handled differently in different lab areas (i.e. source is likely a microbiology culture, but as a specimen, it's like anatomic pathology)</p>\n<p>If that isn't what you are saying, please clarify.</p>",
        "id": 159933557,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1551721538
    }
]