[
    {
        "content": "<p>Hi, I have a use case like this: \"a ServiceRequest created with a coverage defined\" now I want to be able to tag that the servicerequest as \"free-of-charge\" from the point of view of the requester (Practitioner) because someone else is taking care of that. I'm wondering if would be ok to include a new coverage in the <code>ServiceRequest</code>. I would need to do that and mark the old coverage as <code>cancelled</code> and the new one <code>active </code><br>\nThanks</p>",
        "id": 159633180,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1551374335
    },
    {
        "content": "<p>Coverage is specific to the patient, not the action.  ChargeItem is what allows you to capture both the charge associated with the service  as well as what account it's going to be charged against.  The Account might be one that's managed internally for \"free\" services, could be associated to Coverage that's intended to cover all or part of the charges, list the guarantors who are responsible for paying for the account, or provide financial information such as a credit card number to bill to.</p>",
        "id": 159633553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551374639
    },
    {
        "content": "<p>the problem with <code>ChargeItem</code> is we don't have a way to link the charge items directly to the task or the <code>ServiceRequest</code>. we will need to create an <code>encounter</code> to establish the relationship. the other possibility is to use <code>DiagnosticReport</code> for the link but I feel that's not the right place <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 159654344,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1551389699
    },
    {
        "content": "<p>Ah, I see the issue.  ChargeItem allows capture of the actual charge once the thing is done, not the potential charge for what's intended to be done.  And it needs to be in the context of a specific patient and specific time, so it can't just generically point to ChargeDefinition.  <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 159662223,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551396030
    },
    {
        "content": "<p>Hmmm... I believe we never considered the requester logging chargeitems. Wouldn’t it be normally the providers call to decide if and how services rendered are being charged? The semantics of what you describe are that the requester <em>asks</em> for a service to be provided free of charge, correct? The actual task of zeroing the cost for a chargeitem or placing it into a specific account would be done by the provider...?</p>",
        "id": 159731826,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1551461668
    },
    {
        "content": "<p>...or potentially refusing to do it for free ;-)</p>",
        "id": 159731853,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1551461714
    },
    {
        "content": "<p>Maybe it would make sense, if a ServiceRequest could somehow indicate into which Account the charges for the service should go?</p>",
        "id": 159731937,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1551461798
    },
    {
        "content": "<p>In some cases, there can be a charge for actually creating the order.  (I've been charged by the vet for them writing a prescription.)  There can also be information on \"expected\" cost and \"expected\" payment arrangements - what account, insurance, pre-authorization, etc. applies to the events tied to the order.  I think we need to support both.</p>",
        "id": 159731943,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551461809
    },
    {
        "content": "<p>Would it help if ChargeItem.service included ServiceRequest as a potential target?</p>",
        "id": 159732053,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1551461912
    },
    {
        "content": "<p>yes, <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  that will work for us</p>",
        "id": 159742518,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1551469341
    },
    {
        "content": "<p>Can you log a change request, please?</p>",
        "id": 159742590,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1551469410
    },
    {
        "content": "<p>sure thing. I just don't know where I should do that ;)</p>",
        "id": 159742874,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1551469604
    },
    {
        "content": "<p>Keep in mind that ChargeItem.service pointing to the order would generally be the charge for creating the order, not for providing the service being ordered.  There's a need for both and it should be clear which is which.</p>",
        "id": 159744597,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551470763
    },
    {
        "content": "<p>So if I want to perform the tests and later make that free of charge to the patient, I would need to do that using <code>ChargeItem</code> with a reference to the <code>DiagnosticReport</code>. that's correct?</p>",
        "id": 159750471,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1551475513
    },
    {
        "content": "<p>Yes.  In fact, it'd be a ChargeItem whether you choose to make it free of charge or not :)</p>",
        "id": 159750548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551475568
    },
    {
        "content": "<p>thanks!</p>",
        "id": 159750589,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1551475624
    },
    {
        "content": "<p>As @Simone pointed out, please remember that a free service isn't free, it's just charged somewhere else, so the cost is being allocated to a different account.<br>\nFinance will be tracking how much of that they do... And why.</p>",
        "id": 159813042,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1551557996
    }
]