[
    {
        "content": "<p>The clinical genomics WG has the need of notes on Observations, as well as notes on DiagnosticReports to  include a narrative of the used method(s) or other textual comments which often times is half a page or more.<br>\nDuring the may WGM Observation.note was suggested.<br>\nThis could work, but:<br>\n- note doesn't contain a type to express the type of note<br>\n- note doesn't exist in DiagnosticReport<br>\nMy first idea was to add type to the Annotation data type: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\">GF#22102</a> which would solve the type problem but not the \"notes on DR\" problem.</p>\n<p>What does O&amp;O think?</p>",
        "id": 172114099,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564567408
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> At least at first glance this seems to me like a pretty reasonable request, and possibly solutions.  We'll need to have some further discussion of it, of course.  I can try to review what we have from the discussion in May.   Would you be able to provide some further details and ideally example(s) of the information that you want to include this way?</p>",
        "id": 172120470,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564574439
    },
    {
        "content": "<p>Thanks Rob, i asked the emerge project about an example as our examples are german ones. Will post these as soon as i receive them.</p>",
        "id": 172121523,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564575427
    },
    {
        "content": "<p>When you start wanting a note type it sounds like you want more than a note or annotation. I  think these are component or free standing observations.  So it will be great to see example instances (German is fine) and see what existing options exist or whether    Need to add to the spec.</p>",
        "id": 172145799,
        "sender_full_name": "Eric Haas",
        "timestamp": 1564593471
    },
    {
        "content": "<p>Key question is whether it's a situation where different people will be capturing comments over the lifetime of the Observation/report (especially after they are final).  If so, and if there's a need to sub-categorize (and you're expecting multiple note repetitions for a single category), then adding a category to Annotation might be reasonable.  However, if the intention is to capture a bunch of 'categorized' string fields that are part of what's captured by the lab and the \"who said it and when\" doesn't much matter and you're not expecting the notes to be captured after the observation/report is final, then agree with Eric that component is probably better.</p>",
        "id": 172146088,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564593654
    },
    {
        "content": "<p>Eric said component or free standing observations.  I'm a little skeptical about whether component would be the right fit for this, but first it would be good to look at some examples.</p>",
        "id": 172149918,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564596092
    },
    {
        "content": "<p>I got some eMerge examples:</p>\n<p>Addtional Note 1<br>\nDisease penetrance and severity can vary due to modifier genes and/or environmental factors. The significance of a variant should therefore be interpreted in the context of the individual's clinical manifestations.<br>\nAdditional Note 2<br>\nVariants of unlikely clinical significance are not included on eMERGE reports but can be shared separately. Please note that variant classifications may change over time if more information becomes available. Please contact us at xxx-xxx-xxxx or <a href=\"mailto:xxx@xxx.xxx\" title=\"mailto:xxx@xxx.xxx\">xxx@xxx.xxx</a>.<br>\nAdditional Note 3<br>\nWe cannot exclude the presence of a variant in the following gene(s) due to &lt;95% coverage at 20x*: KCNQ1 (94.7%), ....<br>\nAdditional information (gene and variant lists as well as reference sequence) available at <a href=\"http://lab.hostname.org/xxx/\" target=\"_blank\" title=\"http://lab.hostname.org/xxx/\">http://lab.hostname.org/xxx/</a>.<br>\nComments <br>\nIt is recommended that correlation of these findings with the clinical phenotype be performed. Genetic counseling for the<br>\npatient and at-risk family members is recommended.</p>",
        "id": 173777260,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1566379136
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>.  These do seem to be additional notes that are intended to aid the clinician in interpreting and using the results (and in the past I've seen plenty of similar notes that often are included for relatively complex tests and results like this).  And I think they truly are notes and wouldn't be separate observations/components.  I'm somewhat inclined to agree with your suggestion in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\">GF#22102</a>, but the Data Types are owned by FHIR-I and are normative.  You likely would need to use an extension for now, and maybe this could be considered as a change for R5?  I also wonder if adding a separate 'interpretationNote' element as an Annotation (without changing the data type) would be even clearer and better?  There is still the issue of changing a normative resource, but it wouldn't be a breaking change (and it is under OO control).  You could also make 'interpretation' a backbone element, but that would be much more disruptive and I don't think it would be considered.  I do think that adding a 'note' (and potentially 'interpretationNote') element to DR would be reasonable.</p>",
        "id": 173788118,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1566390091
    },
    {
        "content": "<p>\"Annotation\" isn't really for capturing notes made at the time the result is created.  It's more for capturing comments after the fact - that's why we care about the author and the timestamp so that we know who said what, when.  If we're capturing additional discrete data as part of an Observation/report, then we should be looking at components (or extensions for DiagnosticReport).</p>",
        "id": 173788329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566390275
    },
    {
        "content": "<p>That's a reasonable point about Annotation.  But these notes aren't additional discrete data that is being captured.  They are explanatory notes included to aid in the interpretation and use of the results.  So maybe 'interpretationNote' (with an appropriate data type) is what is needed (as an extension now and possibly added for R5, to both Observation and DiagnosticReport?).</p>",
        "id": 173789191,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1566390999
    },
    {
        "content": "<p>Extension on DiagnosticReport makes sense to me.  For Observation, I have a bias towards using Observation.component if the information is describing/qualifying the reported result - which is what the interpretation notes seem to be doing.</p>",
        "id": 173795813,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566395617
    },
    {
        "content": "<p>I think the way to decide whether it's a \"note\" (in whatever flavor) or if it's a component is whether or not the notes are specific to <strong>this particular instance</strong> of the observation, or whether they are more general and the same (or very similar) note is included for each instance of this <strong>type</strong> of observation (likely based on Observation.code).  In the former case I think that component does make sense, and in the latter I think it's an \"interpretation note\" (however we decide to handle that).  The examples that <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> gave I think fit more into the latter category of being general based on <strong>type</strong> (but he can say what he thinks about that).</p>",
        "id": 173796832,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1566396292
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> would say there are classes of these 'notes' that fall into both sides - some are specific to a particular instance of an observation, others apply more broadly.</p>",
        "id": 173798367,
        "sender_full_name": "Kevin Power",
        "timestamp": 1566397352
    },
    {
        "content": "<p>agree</p>",
        "id": 173798439,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1566397431
    },
    {
        "content": "<p>If they apply to the 'type', then they'd ideally be on the ObservationDefinition.  However, the reality is that in v2, they'd all be sent as an OBX, so I'm not sure why FHIR would try to make a distinction...</p>",
        "id": 173798649,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566397568
    },
    {
        "content": "<p>in V2 lab reporting I think we handle them all in essentially the same way<br>\nin FHIR I guess we need to decide if we should/want to make a distinction</p>",
        "id": 173798669,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1566397588
    },
    {
        "content": "<p>had almost the same thought at the same time :)</p>",
        "id": 173798698,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1566397601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> - Perhaps we should broaden the scope of <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\">GF#22102</a>, and include Larry's other examples that are not methodology related?</p>",
        "id": 173803425,
        "sender_full_name": "Kevin Power",
        "timestamp": 1566400503
    },
    {
        "content": "<p>I not sure what it is buying you to slice and dice these notes  into further subcategories.  Is the clinician going to care or misunderstand that one note is boilerplate for observation A vs a another that  is specific to it?  In the end we read display them them all in a report</p>",
        "id": 173804152,
        "sender_full_name": "Eric Haas",
        "timestamp": 1566400968
    },
    {
        "content": "<p>There's \"what does the clinician care about?\" and there's \"how do systems stick the information into their databases?\" and there's \"are there specific business rules about what must be present and when?\".  All of those can influence what's captured as distinct elements.</p>",
        "id": 173804400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566401141
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> and I need to be able to share \"notes and comments\" that the results interpreters and test performers include at report, observation group and observation levels as part of the signed out information.  We are not in a position to do an exhaustive analysis with the labs to find out all the uses of these notes and comments, but they definitely seem important enough to be included on the report.</p>\n<p>If we make them separate OBXs or Observations in FHIR, then I would need to provide the linkage to point them to the one, several or report level that they are commenting/noting about. So that seem less than ideal. I'd also have to codify them which I suppose is possible (assuming there's at least one LOINC code that means \"comment\"). But this seems less than ideal</p>\n<p>If we go with an \"interpretationNote\" extension on the DR and use a codified component on the Observation and Observation Groups, then i would need a \"code\" for the Observation.component, please suggest if you have one or let me know if I can simply go with a codeableconcept.text approach.</p>\n<p>I would like to allow the authors of the report to be able to label the notes as they see fit. This labeling (Additonal Note 1, Comment, Disclaimer, etc...) is useful and helps add context that the human consumer needs to put the note in perspective. So, in light of the fact that I believe it is quite unrealistic to figure out every type of \"comment/note\" labeling that lab reporters would want to provide, I think I should allow the note to be passed as markdown or xhtml rather than just a simple string.  If I use a string value then I think I will need a \"label\" or \"type\" field that allows the reporters to label or type the notes and provide the context (kind of comment) it is.</p>\n<p>I understand the rationale of all the arguments made above. But I simply need a solution that I can apply now. One that allows the producers of reports to convey \"note-like\" text blurbs with some form of label, heading or type that enable the downstream systems to store it in a place related to a report or observation object so that it can help communicate information that the reporter feels is useful to the consumers.</p>\n<p>I was starting to lean towards <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> s solution. I do agree that Annotation seems more like a comment that is made by some party after the report is created are made not as part of the returned report contents.  I do think it is important to provide a context, label or type that the reporters can convey with their text blurb and possibly include links and such.  I recognize that users could misuse this field to send true observation data in an less structure or unstructured way which may provide the opportunity for bad behavior, but I believe that guidance and definitions are our best defense against those that misuse these structures for unintended use.</p>\n<p>In any case, I think <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> and I will be likely creating our own extension to pass markdown or xhtml text blurbs as \"interpretationNote(s)\" on either DRs or Observations unless you guys can provide a clear and straightforward solution to this requirement.</p>\n<p>Any help in this direction is greatly appreciated.</p>",
        "id": 174358556,
        "sender_full_name": "Larry Babb",
        "timestamp": 1566996654
    },
    {
        "content": "<p>Generally, reports are treated as having only one author - the lab.  Responsibility for individual pieces is generally not reflected in the report.  Do you have a use-case to differentiate where different people in the lab are uniquely attributed to specific comments/observations?</p>",
        "id": 174385323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567014205
    },
    {
        "content": "<p>No. these comments and notes are part of the report and considered as part of the \"sign out\" process. There is no specialized attribution on these items. They are simply \"text blurbs\" that get placed at a report level, an observation level or an subset of observations. I do not need Annotation and think that it is not the correct data type for our needs.</p>",
        "id": 174457228,
        "sender_full_name": "Larry Babb",
        "timestamp": 1567087755
    },
    {
        "content": "<p>Ok.  To have a general comment about an Observation, you could just have a component with LOINC code 8251-1 (Service comment).  At the report level, you'd have a member Observation with LOINC code 86467-8 (Report comment).</p>",
        "id": 174467255,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567094274
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . For comments at an observation group level would I use a the component method above on the \"observation\" that groups the other observations that the comment is about collectively? Or should I use a separate Observation off of the grouped Observation (like a nested report section) and use the (Report Comment) loinc code above to show that the comment is for all of the observations in the group?</p>",
        "id": 174686438,
        "sender_full_name": "Larry Babb",
        "timestamp": 1567391031
    },
    {
        "content": "<p>For a panel, I'd probably use the memberOf approach but either would be valid.</p>",
        "id": 174722047,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567434555
    },
    {
        "content": "<p>typically anything added after a report is finalized is an amendment or addendum to the report and follows regular requirements, including for corrections.</p>",
        "id": 195706654,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588166227
    },
    {
        "content": "<p>In DR, results are typically as observations or lab results.   They are structured in a standardized way for pathology reports to communicate information about specimens unambiguously.   The reason you want them structured as discrete data so they can be codified and utilized in clinical decision support, so they are computer processable.  Also items which are part of panels need to be kept together for context and appropriate interpretation.</p>",
        "id": 195785578,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588205058
    },
    {
        "content": "<p>Typically I'd treat an interpretation as a observation/result value and it can be LOINC encoded appropriately.  I wouldn't make them observation components or notes or other items.</p>",
        "id": 195785980,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588205426
    }
]