[
    {
        "content": "<p>Why is NutritionOrder  inpatient only. I certainly see it applicable to Kidney dialysis/CKD patients and in other outpatient chronic care settings where complex care is delivered.</p>",
        "id": 198496448,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1590182540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> <span class=\"user-mention\" data-user-id=\"209837\">@David Burgess</span> <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"196116\">@Ralf Herzog</span> <span class=\"user-mention\" data-user-id=\"191969\">@John David Larkin Nolen</span>  Hi Folks, this is your resource. Can I get a little feedback on my question above? <span class=\"user-mention\" data-user-id=\"197951\">@Becky Gradl</span></p>",
        "id": 200136923,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1591640634
    },
    {
        "content": "<p>Hi Gay, the initial work focused on inpatient orders. We are currently working on extending that, and are working on related use cases. <span class=\"user-mention\" data-user-id=\"197951\">@Becky Gradl</span>  - any sme level comments?</p>",
        "id": 200172876,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1591663867
    },
    {
        "content": "<p>Hi Lorraine - Thanks for replying, what is the ETA on the new work? I am interested in hearing from <span class=\"user-mention\" data-user-id=\"197951\">@Becky Gradl</span> - I'm not a nutritionist - but I am a nurse and I am not seeing any preclusion in using it for the use cases I mention above.</p>",
        "id": 200236411,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1591713050
    },
    {
        "content": "<p>I think I see the problem/restriction: <br>\nNutritionOrder</p>\n<p>Definition  <br>\nA request to supply a diet, formula feeding (enteral) or oral nutritional supplement to a patient/resident.</p>",
        "id": 200700970,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1591983679
    },
    {
        "content": "<p>So - an actual diet has to be supplied in the use case of this profile</p>",
        "id": 200701231,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1591983826
    },
    {
        "content": "<p>I don't know the history on the creation of NutritionOrder, but <span class=\"user-mention\" data-user-id=\"193259\">@Margaret Dittloff</span>  may be able to shed some light on that. The issue of using NutritionOrder in an outpatient setting has been raised in the past, however since it was not an urgent issue, no work has been done to see if it would work. We would need to do a walk-through of the resource to see if in its current state it might work in an outpatient setting for a \"nutrition prescription\" (i.e. a suggested diet to follow) and determine if it needs any modifications or a new resource. In this instance, I would think the diet (that would typically be used for a diet order) could be used for the \"nutrition prescription\". There is a bi-weekly Nutrition call on Wednesdays under O&amp;O where we discuss nutrition topics. This would be the best place to have this conversation.</p>",
        "id": 201872799,
        "sender_full_name": "Becky Gradl",
        "timestamp": 1593017173
    },
    {
        "content": "<p>I don't see any reason for outpatients to be explicitly excluded. I will join the call today and if this is in the agenda, I'd like to see if/why this is excluded.</p>",
        "id": 201878899,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593020051
    }
]