[
    {
        "content": "<p>I'm running into a situation where obs-7 creates a problem.  The situation is as follows:</p>\n<ul>\n<li>when capturing race, there can be multiple coded values - which means the information needs to be captured as components, because the values won't be translations of each other, they're separate values</li>\n<li>however, you can <em>also</em> capture your race as a string - and in that case there's only one, and it encompasses all of the encoded information</li>\n</ul>\n<p>The natural way to do this is to have a Observation.valueString and multiple Observation.component.valueCodeableConcepts.  However, we can't do that right now because of the invariant.  I think the decision to add the invariant hadn't contemplated the notion of having a string summary as a value.</p>\n<p>Thoughts?</p>",
        "id": 259437931,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635448338
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 259437955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635448350
    },
    {
        "content": "<p>Note - similar problem for ethnicity, where you might have a single high-level code  in addition to a description, and then a whole bunch of detailed codes.</p>",
        "id": 259443821,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635451184
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Yes, I think the issues are similar with ethnicity (though the way you stated it seems a little different).  I think the main question we would need to answer is whether we want to allow or expect that Observation.value (specifically valueString) could be used as a \"composite summary\" of the values for multiple additional copies of the <strong>same observation</strong> (i.e. with the same value for 'code', as per obs-7) that are present in Observation.component.  I think we created the invariant because we didn't believe that would be a logical or legitimate thing to do.  The \"race composite summary\" observation really isn't the same thing as one or more of the individual \"race\" observations that would be in the instances of Observation.component.  So maybe the \"race composite summary\" observation should have a different observation code?</p>",
        "id": 259455684,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1635457198
    },
    {
        "content": "<p>Well, it's easy to keep the constraint if you force different codes.  But the reality is that a system might easily use 32624-9 and have a value that's a string, a value that's a code, or a bunch of components each with their own code.  Saying we must introduce a new LOINC code just so we can maintain the Observation invariant seems backwards to me...</p>",
        "id": 259459835,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635459607
    },
    {
        "content": "<p>Agree with Rob's recollection but to restate it - We wanted all the values for a given code in one place and not split between value and component value.   If you want a valueText stick it in Component.valueString.    Not sure there is much can do since is normative anyway.  What are you proposing exactly and is the juice  worth the squeeze?  You are the first to complain ever.</p>",
        "id": 259479495,
        "sender_full_name": "Eric Haas",
        "timestamp": 1635479107
    },
    {
        "content": "<p>At the moment, the only technical way to make it work is to have a component valueString (and for ethnicity a 'restricted' CodeableConcept that essentially acts as a boolean of \"Hispanic or not?\").  But, given that it's an overall assessment, it seems very inappropriate to need to do so in component.  I don't understand the desire to not split?  Why not?  If you've got a value that's overarching, put it in Observation.value.  If you've got multiple child values, put them in component.  What problem were you trying to avoid?</p>",
        "id": 259481996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635482401
    },
    {
        "content": "<p>Are we expecting this to happen in same Observation resource?<br>\nIf so, Can we use some other field to capture the summary/description (say interpretation)?</p>",
        "id": 259511417,
        "sender_full_name": "Jeffy Mathew Jose",
        "timestamp": 1635507185
    },
    {
        "content": "<p>It's not an interpretation.  It's not saying your race is good/bad/improving/worse/etc.  It's saying, in the patient's own terms, what their race is.  Essentially the CodeableConcept.text, with the challenge that the codes we need to send are codings of different 'aspects' of the race and thus can't appear as translations and must therefore be sent as components.</p>",
        "id": 259521093,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635512833
    },
    {
        "content": "<blockquote>\n<p>I don't understand the desire to not split? Why not? If you've got a value that's overarching, put it in Observation.value. If you've got multiple child values, put them in component. What problem were you trying to avoid?</p>\n</blockquote>\n<p>IMO What you are suggesting is giving a code multiple personalities.  (See how it flies on the vocab stream.  :-)).  I think Rob's initial reaction is correct... use two codes.  </p>\n<p>As an aside - I am assuming you are trying map a QR to a bunch of observations.... how do these observations ultimately turn into the patient extensions?</p>",
        "id": 259698955,
        "sender_full_name": "Eric Haas",
        "timestamp": 1635552558
    },
    {
        "content": "<p>The proposal is actually to move from using the patient extensions to Observations - there's a requirement to capture who reported the race, whether it was determined algorithmically (apparently that's a thing), whether the information is deemed to be 'protected', and apparently there can be more than one race or ethnicity in play at once.  E.g. \"This is what the grandmother said, this is what the software algorithm said\".</p>\n<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> would you support submitting a new code to LOINC for this?  Do you think they'd respond affirmatively?</p>\n<p>Also, what happens for Ethnicity, where there's only one code for the 'summary' level, but can be multiple codes at the 'detail' level - would we have distinct codes for detailed ethnicity?</p>",
        "id": 259704473,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635560367
    },
    {
        "content": "<p>While waiting for the new LOINC code you use two observations:</p>\n<ul>\n<li>one Observation with all of the Observation.component.value[x]:CodeableConcept and no Observation.value, and </li>\n<li>one Observation with Observation.value[x]:string and Observation.derivedFrom that points to the first Observation.<br>\n<span aria-label=\"grimacing\" class=\"emoji emoji-1f62c\" role=\"img\" title=\"grimacing\">:grimacing:</span></li>\n</ul>",
        "id": 259829988,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1635746614
    },
    {
        "content": "<blockquote>\n<p>What happens for Ethnicity, where there's only one code for the 'summary' level, but can be multiple codes at the 'detail' level - would we have distinct codes for detailed ethnicity?</p>\n</blockquote>\n<p>how are code heirarchies represented in general??      single codeableconcept with with multiple codings or multiple components  or observations with unique codes??</p>",
        "id": 259873115,
        "sender_full_name": "Eric Haas",
        "timestamp": 1635778230
    },
    {
        "content": "<p>Depends on the type of hierarchy.  If you've got a subsumption relationship, you can have all of the codings present on one CodeableConcept.  But that requires all of the codes to be reasonable translations of each other.  In this case, the codes are \"partOf\" rather than \"is a\".</p>",
        "id": 259883570,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635783097
    },
    {
        "content": "<p>so what is the general pattern for part of codes?</p>",
        "id": 259885098,
        "sender_full_name": "Eric Haas",
        "timestamp": 1635783821
    },
    {
        "content": "<p>The repetitions have to be handled as components.  But it doesn't really make sense for the high-level concept/text to also be components.</p>",
        "id": 259888940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635785573
    }
]