[
    {
        "content": "<p>Does OO have any guidance anywhere about when you would have an observation that has a coded value, and whether to put the code in the value or the interpretation?</p>",
        "id": 153996874,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536886515
    },
    {
        "content": "<p>obviously, if the observation code is 'femur length', and the code is 'longer than normal', that's an interpretation whether or not you have an actual value</p>",
        "id": 153996875,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536886556
    },
    {
        "content": "<p>but if the observation is 'hip mobility concern' with values ok, watch, refer for treatment -is that a value or an interpretation?</p>",
        "id": 153996876,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536886597
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195650\">@Reuben Daniels</span> <span class=\"user-mention\" data-user-id=\"196785\">@Nichol Hill</span> <span class=\"user-mention\" data-user-id=\"194468\">@Vincent McCauley</span> feel free to chime in with other examples</p>",
        "id": 153996880,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536886637
    },
    {
        "content": "<p>(from Australian child health standards meeting)</p>",
        "id": 153996881,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536886645
    },
    {
        "content": "<p>Thanks Grahame. This encapsulates well. </p>\n<p>In context the observations are part of the set of assessment that are performed at child health checks (eyes, hips, fontanalles). </p>\n<p>Also would be good to understand how this normalises with other assesments taken as part of the same set  such as weight that record both the actual weight and a value of  ok, watch, refer for treatment</p>",
        "id": 153996883,
        "sender_full_name": "Nichol Hill",
        "timestamp": 1536887458
    },
    {
        "content": "<p>I think we haven't been particularly specific or prescriptive regarding the rules around this.  My personal take at the moment (which may or may not be consistent with the views of others in OO) would be to avoid a proliferation of very specific interpretation codes.  For 'femur length' I think you would ideally provide the actual measurement value, but a code that categorizes it as \"longer that normal\" (with maybe better wording) could be defined and used instead, if that's really desired.  In that case I think I would still use one of the currently defined interpretation codes - probably 'H' (High), since it's \"above the upper limit of the reference range\".</p>",
        "id": 153997059,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536942917
    },
    {
        "content": "<p>For 'hip mobility concern' I'm not sure if 'ok', 'watch' and 'refer for treatment' would necessarily be the best set of values (or interpretations) - that could b e discussed.  But I would be inclined to follow the same or similar pattern as with 'femur length'.</p>",
        "id": 153997062,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1536943324
    },
    {
        "content": "<p>I imagine that the current situation is that a measurement is given and then a long narrative text blob is provided in the comments sections providing all this interpretative information.   Also in my mind -'ok', 'watch' and 'refer for treatment'  are not interpretations but Clinical Assessments.</p>",
        "id": 153997648,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537287760
    }
]