[
    {
        "content": "<p>(deleted)</p>",
        "id": 203019347,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1594057397
    },
    {
        "content": "<p>HI. I'd like to confirm that for my 2 use cases for querying for or sending a lab panel - like a CBC that I would be using observation correctly. My two use cases are really not diagnostic reports, but rather representing within a single observation (or panel observation in this case) for/to.<br>\n1) Query to bring in to the MCC eCare Plan<br>\n2) Within a C-CDA on FHIR doc or to be sent around as a single observation. Initially, I was thinking it logical to be component observation, but then I noted that  what seems to be actually recommended in the base ObservationResource is to use \"hasMember\" and reference the individual observation.<br>\n<a href=\"https://www.hl7.org/fhir/observation-definitions.html#Observation.hasMember\">https://www.hl7.org/fhir/observation-definitions.html#Observation.hasMember</a>  <br>\nExample: <a href=\"https://www.hl7.org/fhir/observation-example-bgpanel.json.html\">https://www.hl7.org/fhir/observation-example-bgpanel.json.html</a></p>\n<p>So. I'd like to confirm that hasMember indeed the correct way to represent a panel if not sending within a DiagnosticReport?</p>",
        "id": 203019678,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1594057578
    },
    {
        "content": "<p>I think you are correct, Gay, that using hasMember for this (at least in the case of a panel like CBC) is probably the best practice.  There is quite a bit of discussion in the spec under Observation Grouping [here[(<a href=\"http://build.fhir.org/observation.html#obsgrouping\">http://build.fhir.org/observation.html#obsgrouping</a>) that I think seems reasonably clear (although, there are still some wiggle room and choices that can be made).  The most important point for using Observation.component, I think, is that it \"is used for any supporting result that cannot reasonably be interpreted and used outside the scope of the Observation it is a component of\".  I think that's clearly not true in the case of a panel like a CBC, where many of the individual observations (like hemoglobin and hematocrit, for example) could also quite reasonably be used separately (can stand alone).  I think there might be other cases of a lab panel, though, where the observations are more tightly bound together and would fit reasonably well with using Observation.component (that is definitely true in for some non-lab observations, like blood pressure and Apgar scores).  So it's not entirely black and white, but I think that hasMember is going to be the best choice in most cases for lab.</p>",
        "id": 203065678,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594095687
    },
    {
        "content": "<p>Thanks Rob</p>",
        "id": 203109723,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1594132211
    }
]