[
    {
        "content": "<p>After digging a bit into the observation resource I wonder how to model used reagents, disposables, etc. pp. into the observation resource.  Is there a profile/extension for this or should it be included into the resource itself?</p>",
        "id": 153971753,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530008335
    },
    {
        "content": "<p>device? closest woudld be Procedure.usedReference.</p>",
        "id": 153971754,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530008423
    },
    {
        "content": "<p>(if Device seems not adequate, i've been thinking of a healthProduct, but that would be a pattern, not an implementable resource)</p>",
        "id": 153971755,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530008482
    },
    {
        "content": "<p>For disposables: yes, but there is only a 0..1 relationship in observation to device. <br>\nBut where to place reagent(s) (remember there might be multiple for one observation)...</p>",
        "id": 153971756,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530008790
    },
    {
        "content": "<p>can you give a concrete example of your use case?   I am leaning on Device/DeviceComponent as well.</p>",
        "id": 153971793,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530021883
    },
    {
        "content": "<p>The device that produced the information is on observation.device</p>",
        "id": 153971827,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530029633
    },
    {
        "content": "<p>if you consumed items, this is not part of the observation, but it is actually part of the procedure that prodced this observation.</p>",
        "id": 153971828,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530029657
    },
    {
        "content": "<p>hence the link being on Procedure.usedReference</p>",
        "id": 153971829,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530029670
    },
    {
        "content": "<p>Let's try with an example Measurement of Glucose (but please do not nail me that Glucose is not measured that way).<br>\nUsed reagents to measure Glucose are:<br>\n- Glucose Reagent<br>\n- Glucose Dilutent<br>\nUsed Consumables<br>\n- Glucose Pipette<br>\n- Glucose Container</p>",
        "id": 153971830,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530029686
    },
    {
        "content": "<p>So, you have</p>",
        "id": 153971831,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530029722
    },
    {
        "content": "<p>observation1 (your observation).</p>",
        "id": 153971832,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530029732
    },
    {
        "content": "<p>observation-PartOf= Procedure1 (the acquisition procedure)</p>",
        "id": 153971833,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530029817
    },
    {
        "content": "<p>then on Procedure1.usedReference you have your consumables and reagents</p>",
        "id": 153971834,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530029920
    },
    {
        "content": "<p>the observation.Devicethat is if you need to indicate which machine was used in producing that result</p>",
        "id": 153971835,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530029972
    },
    {
        "content": "<p>makes sense?</p>",
        "id": 153971836,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530030301
    },
    {
        "content": "<p>So you say that the observation is part of the Procedure where the reagents and consumables are linked too? Hmm... <br>\nI would argue there, that an observation is something where reagents and consumables were used to produce whatever value. And the observation would belong to a task/order.<br>\nI try to explain it in v2 kind of style.<br>\nYou get an order via an OML^O33 message where the order: for Sample XYZ (SPM-2) in Container (SAC-3) Glucose (OBR-4) should be measured.<br>\nThe result upload would be in a OUL^R22 message where the result would be in OBX-5 and the Substance information would be in subsequent INV Segments where the first would include the Glucose reagent (INV-1 something like GlucoseReagent^^99WhatEver) and the second the Glucose dilutent (INV-1 something like GlucoseDilutend^^ 99WhatEver). The Third INV segment would be the used disposable (INV-1 something like Disposable1^^99WhatEver) and so on. <br>\nI think the message structure of OUL^R22 as in the IHE LAB-29 Transaction makes more sense here. </p>\n<p>To mention: this is in a centralized lab environment .</p>",
        "id": 153971837,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530030857
    },
    {
        "content": "<p>the v2 model does anchor us to some conceptual ways of expressing things.</p>",
        "id": 153971838,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530030917
    },
    {
        "content": "<p>\"the observation is something where reagents...\" - let me dissect that:<br>\nfor my proposed suggestion, I assume that observation is the result of a process. Typically you don't capture the details of the process, just the outcome, so you don't need procedure. But if you need to capture consumables, time it took to process that, etc then you need something.<br>\nyou are correct, it could be a task as well. but if you consider observation as the outcome of an activity, then  the consumables are not part of the outcome, but they are part of the activity.</p>",
        "id": 153971839,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031045
    },
    {
        "content": "<p>yes, but at least it - for this use case-  makes the modeling quiet easy. When you mention procedure I always think on procedures performed on patients (like the procedure resource is mentioning in the Description &amp; Constraints \"An action that is being or was performed on a patient\"</p>",
        "id": 153971840,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530031088
    },
    {
        "content": "<p>on the other hand, if you consider observation as being the procedure, then indeed you have a point and something would be missing.</p>",
        "id": 153971842,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031135
    },
    {
        "content": "<p>ah there you have a point - what is the way in FHIR to convey automated activities like a machine processing a specimen and producing a result - i don't know if that is clear</p>",
        "id": 153971843,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031169
    },
    {
        "content": "<p>Yes, I think we might need there a bit of a more lengthy discussion which I think this in the appropriate WG. <br>\nBut we should involve some more people with an analyzer, IHE PaML (LDA and LAW) background.</p>",
        "id": 153971848,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530031461
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span> <span class=\"user-mention\" data-user-id=\"192578\">@Andrea Pitkus, PhD, MLS(ASCP)CM</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  can help there?</p>",
        "id": 153971851,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031781
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> (i was not forgetting you, but I could not find you under your full name :)</p>",
        "id": 153971852,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031868
    },
    {
        "content": "<p>I agree that this needs a bit more thought before we add something to observation (that's normative). I think Eric might have mentioned device, becasue that is what I was thinking is used for procedures NOT on patient. I just reviewed the definition and it says on or for a patient, so lab tests on specimen would fall into the latter category, so procedure seems to be the right place.</p>",
        "id": 153971949,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1530045039
    },
    {
        "content": "<p>I don't think this is about observation at all. There's nothing inherent in observation about using anything to make it. If we want to do something about the process of making an observation, that's something different</p>",
        "id": 153972019,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530073704
    },
    {
        "content": "<p>Let me give a try on this topic.<br>\nReagents, like analyzers, and pipettes are medical devices. Their identification and representation is guided by the HL7 UDI Implementation Guidance DAM. In terms of use cases, the requirement to identify which analyzer produced the glucose observation, and what was the reagent lot number used for that, is not uncommon. I don't know precisely about the details of CLIA in the US, but in Europe, that would be part of the requirements of clinical laboratory accreditation based on the ISO 15189 standard.</p>\n<p>In V2.9 (adopted for this purpose by the IHE LAW profile) the reagent properties (identifier, expiration date, lot number, ...) are conveyed by an instance of INV \"Inventory Detail\" segment, which is part of the RESULT segment group wrapping an OBX (observation) segment. </p>\n<p>The logic of such quality requirements  is to link this set of information to the observation itself. Just like for the method used, we are still characterizing the observation produced, rather than describing a procedure.</p>\n<p>So the transposition to FHIR seems straightforward. We have Observation.method for the method, and we have Observation.device referencing an instance of Device or of DeviceComponent, which enables to describe all medical devices used to produce the observation: analyzer, reagent, and more.</p>",
        "id": 153972087,
        "sender_full_name": "François Macary",
        "timestamp": 1530109946
    },
    {
        "content": "<p>Hi François,<br>\nyour answer sounds reasonable, but I still have the problem how to put into a 0..1 device (where Description says \"(Measurement) Device\") 0..* medical devices used to produce the observation (the used reagents (if more than one) are not in a part of relationship to each other but exist on the same level (same for used disposables if more than one is used). <br>\nOr am I completely wrong here?</p>",
        "id": 153972090,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530112435
    },
    {
        "content": "<p>Devices have components  use DeviceComponents or create an extension to Nest Device</p>",
        "id": 153972100,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530116425
    },
    {
        "content": "<p>Yes, that would work, considering the reagent(s) used as components of the analyzer, even if they are not components stricto sensu.</p>",
        "id": 153972101,
        "sender_full_name": "François Macary",
        "timestamp": 1530116580
    },
    {
        "content": "<p>they are like the ink in an inkjet printer and if they came a little cartridge it would be more obvious that it is a component device.</p>",
        "id": 153972104,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530116987
    },
    {
        "content": "<p>I'm confused how this information characterises the observation itself. what's an example?</p>",
        "id": 153972197,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530129318
    },
    {
        "content": "<p>I think it characterizes the methodology/instrumentation</p>",
        "id": 153972220,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530131696
    },
    {
        "content": "<p>Jose, fyi, consumables and reagents are typically not tracked/messaged in HL7 for the laboratory like it is for pharmacy or supply chain areas.</p>",
        "id": 153972266,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1530140250
    },
    {
        "content": "<blockquote>\n<p>Devices have components  use DeviceComponents or create an extension to Nest Device</p>\n</blockquote>\n<p>We are redesigning Device to support nested devices, so that could be an option.<br>\nWe could see consumables as \"components\" of the performing device... this may well support(not sure how, but i'm confident) the downtream requirements including resupply, inventory and consumption tracking, etc.</p>",
        "id": 153972334,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530177504
    },
    {
        "content": "<p>I think I might think here either to complex or I am simply not getting it. <br>\nSo, how to get device with the \"part-of\" relation to model two reagents plus one disposable to be in observation?</p>",
        "id": 153972417,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530207314
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/p9l220wAJ0PBJNJKUd8R5PjR/Screen-Shot-2018-06-28-at-12.16.10-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-06-28-at-12.16.10-PM.png\">Screen-Shot-2018-06-28-at-12.16.10-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/p9l220wAJ0PBJNJKUd8R5PjR/Screen-Shot-2018-06-28-at-12.16.10-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-06-28-at-12.16.10-PM.png\"><img src=\"/user_uploads/10155/p9l220wAJ0PBJNJKUd8R5PjR/Screen-Shot-2018-06-28-at-12.16.10-PM.png\"></a></div>",
        "id": 153972434,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530213421
    },
    {
        "content": "<p>Hi Eric,<br>\nyour solution is not working for my problem, because<br>\n- A specific device has multiple reagents<br>\n- A specific device could perform multiple different codes/orders/tests where specific different reagents are used (i.e. two out of 100).<br>\n=&gt; so the relation is between the reagent and the code/order/test <strong>not</strong> between the device and the reagent. </p>\n<p>With your model I would need multiple devices with a limited validity where each device could perform one specific code/order/test with one valid combination of reagents. I do not think we should have a code and reagent specific device for a small set of observation for a test. <br>\nIt would be possible to model that, but then the device would exist only for a short amount of time (as long as <strong>all</strong> the used reagents are <strong>valid and available</strong>) for <strong>one</strong> code/order/test. From there I could reference to the subdevice from where I could go to the device, ... </p>\n<p>But: there is no elegant and easy way to trace from the observation on a specific (sub-)device with observation specific reagents to the observation specific reagents/disposables with your solution. <br>\nI think we need a \"substance\" reference (0..1) inside the observation - or a laboratoryObservation which would include this.</p>",
        "id": 153972531,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530277081
    },
    {
        "content": "<p>or as diagram:<br>\n<a href=\"/user_uploads/10155/qoUDRv9JwcZYFhbhXqHGpQD7/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/qoUDRv9JwcZYFhbhXqHGpQD7/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/qoUDRv9JwcZYFhbhXqHGpQD7/pasted_image.png\"></a></div>",
        "id": 153972552,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1530277955
    },
    {
        "content": "<p>Have you asked anybody in the Devices group  <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>  is this a livd thing?</p>",
        "id": 153972563,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530279675
    },
    {
        "content": "<p>Not directly a LIVD thing, but related.  Devices WG should probably be included too, monitoring systems probably don't have quite the same issue with consumables most of the time so I don't know if they'll have any specific solutions.  I agree with Ralf that consumables/reagents as device components doesn't instinctively feel like it's quite correct; Substance seems plausible but might be too generic as-is (we'd like production/lot info in the reagent metadata) and there's still the question of how to reference it.  I think it reagents need to be separate from the device, not nested in it (an observation/test result could be generated by a human doing some chemistry too, and then there's no automation or encompassing device but we'd still want to be able to document the reagents used).</p>",
        "id": 153974046,
        "sender_full_name": "Daniel Rutz",
        "timestamp": 1530885796
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>  like to asked for a Resource Model (in an entity relationship kind of notation):<br>\n<a href=\"/user_uploads/10155/I-4eZsEWiQw0di4QtCRKOqZ_/ResourceModel.png\" target=\"_blank\" title=\"ResourceModel.png\">ResourceModel.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/I-4eZsEWiQw0di4QtCRKOqZ_/ResourceModel.png\" target=\"_blank\" title=\"ResourceModel.png\"><img src=\"/user_uploads/10155/I-4eZsEWiQw0di4QtCRKOqZ_/ResourceModel.png\"></a></div>",
        "id": 153974460,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1531230626
    }
]