[
    {
        "content": "<p>here is my <a href=\"https://gist.github.com/Healthedata1/9f156d982a2c891c56dc9af2c9bfe73e\" target=\"_blank\" title=\"https://gist.github.com/Healthedata1/9f156d982a2c891c56dc9af2c9bfe73e\">Gist</a> where I prototype the approach that <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  talks about in this <a href=\"#narrow/stream/4-implementers/subject/Generic.20or.20specific.20profiles.3F\" title=\"#narrow/stream/4-implementers/subject/Generic.20or.20specific.20profiles.3F\">chat</a> about using a ObservationDefinition  (OD) <br>\n to created simple tables ('dictionary') to create a Profile + OD structure instead of creating 100-1000s of profiles using StructureDefinition.  I created a  spreadsheet that generates Observations from a base profile and  I reversed engineered from the spreadsheet to create a OD Logical Model (LM) which I compared to the existing OD </p>\n<p>Conclusions:</p>\n<ul>\n<li>\n<p>Existing OD doesn't come close to handling this simple yet useful scenario<br>\n     * Element names should use the same element names as Observation when they are talking about the same thing<br>\n     *  The Definition pattern meta data which was missing ( although not used directly in the spreadsheets)</p>\n</li>\n<li>\n<p>Although is not as simple as 1:1 mapping from element to spreadsheet column - My LM comes  a lot closer <br>\n     * I saved a few elements from it like method and precision:<br>\n      * Added the Definition pattern meta data</p>\n</li>\n</ul>",
        "id": 153971643,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529957781
    },
    {
        "content": "<p>Note that each row of a table would be represented by an OD...</p>",
        "id": 153971727,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529995052
    },
    {
        "content": "<p>If I get this right, the ObservationDefinition points to a StructureDefinition profile that describes for a \"class\" of observations (e.g., numeric lab results), the ObservationDefinition attributes that are relevant.  Or is the ObservationDefinition using the StructureDefinition to describe for that class of observations what data the Observation is supposed to contain?  If the first, then I'm wondering why ObservationDefinition could not be profiled.  If the second, we would not be \"generating Obserations\" rather providing templates of what data to collect for such an Observation.  If neither, please clarify.</p>",
        "id": 153971892,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1530037589
    },
    {
        "content": "<p>The second.   OD + Profile  = entry in dictionary of Observation templates </p>\n<p>you could do the same using a form + Profile where the form is a Questionnaire but then I think you would need to 'decorate' the Questionnaire with a bunch of extensions. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 153972227,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530132015
    },
    {
        "content": "<p>umm not sure what you are asking. Dictionary is a technique you can use with several different resources</p>",
        "id": 153972286,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530158809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  can you define what is meant by Dictionary?  What I think you mean is that you pull up a particular representation a resource instance which is full of variables that get substituted with the actual values to create an instance. (in my case this is a string representing the json format) This is a shortcut from creation of an SD for each type of measurement.</p>",
        "id": 153975232,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531555630
    },
    {
        "content": "<p>yes that's pretty much what I mean in practice</p>",
        "id": 153975277,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531629215
    }
]