[
    {
        "content": "<p>Hello. ((sorry if this is not the proper place for this doubt ...)</p>\n<p>I have a need and I do not find in the STU-3 specification a resource that can be used.</p>\n<p>The set:<br>\nProvision of services between laboratories. (laboratory hires other larger laboratories to process samples)</p>\n<p>This occurs when certain types of tests are not attractive to the main contracted laboratory, which subcontracts other larger laboratories to and / or perform the procedure and / or only processes the samples.<br>\nThis need occurs for many reasons such as lack of scale, price and / or availability of equipment that process these tests.</p>\n<p>After studying the spec, the resource that most meets the needs, is the Encounter. But in the spec is informed that this resource is only used by the Patient. I do not find a resource where the meeting is between providers.</p>\n<p>I created a Encounter Profile and structured it according to our needs, but I'm not sure it's the right one. My question is if I have problems recovering observations or other elements ... and if I am violating the specification...</p>\n<p>This profile created for the Encounter feature is actually a Bundle transaction, which will contain all the laboratory order for the patient. In it I have reference to other necessary resources like: Patient, Organization, Practitioner, Specimen, Medication, ProceureRequest and some others.</p>\n<p>I made the POST of this bundle in Hapi Fhir Sever wothout errors...</p>\n<p>OR</p>\n<p>Would ServiceRequest (R4) be the best resource to use?</p>\n<p>Thanks for any comments</p>",
        "id": 153971006,
        "sender_full_name": "Paulo Rades",
        "timestamp": 1529605463
    },
    {
        "content": "<p>Look at the <a href=\"http://hl7.org/fhir/workflow-module.html\" target=\"_blank\" title=\"http://hl7.org/fhir/workflow-module.html\">Workflow pages</a>.  I think this is handled using ServiceRequest and Task.  I have cross posted to the <a class=\"stream\" data-stream-id=\"40\" href=\"/#narrow/stream/40-workflow\">#workflow</a>  stream.</p>",
        "id": 153971041,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529632693
    },
    {
        "content": "<p>I'm not sure that Encounter is relevant here.  If you're delegating the processing of a sample, the Encounter is still the patient encounter the specimen is associated with.  No one really cares about the \"meeting\" between the two laboratories when the sample is passed.  If it were represented at all, it would be represented as a \"SupplyDelivery\" instance.  You could have a child ProcedureRequest/ServiceRequest for the delegated test that could point back to the original request so that chain of authority was everywhere.</p>",
        "id": 153971191,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529681414
    }
]