[
    {
        "content": "<p>Hi!  I am looking for existing examples of Radiology reports as mapped to FHIR resources.   We are looking to design a FHIR-structured radiology report (converting it from HL7v2 or SQL retrievals) as a standard representation of Rad. for use in Machine Learning projects.  Can anyone point me to existing work i can look at in this space?  Thanks in advance!</p>",
        "id": 173106296,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1565697318
    },
    {
        "content": "<p>not in radiology. What is this, a bone density scan?</p>",
        "id": 173184697,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565771762
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> this is general Radiology reports, textual report content with supporting standards meta data. We are training a range of AI algorithms in Scotland on PACS DICOM data that look to these reports for evidence to support the training.  Would love to offer our researchers standard FHIR resources for the data wherever possible.</p>",
        "id": 173192226,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1565779803
    },
    {
        "content": "<p>Should address the Imaging Workgroup (they don't have a stream) -- <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> <span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span> <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span>    <a href=\"https://confluence.hl7.org/display/IMIN/Imaging+Integration+Home\" target=\"_blank\" title=\"https://confluence.hl7.org/display/IMIN/Imaging+Integration+Home\">https://confluence.hl7.org/display/IMIN/Imaging+Integration+Home</a></p>",
        "id": 173203232,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565789781
    },
    {
        "content": "<p>In the US, the #<strong>Argonaut</strong> Project has profiled radiology reports, but at a very high level. There is a separate breast cancer initiative going on right now which, I believe, is profiling reports with discrete observations.  </p>\n<p>This is a task that the HL7 Imaging Integration/DICOM WG-20 workgroups have been wanting to address for a bit, but haven't had anyone step forward to lead it. I am encountering more and more calls for this profiling.</p>\n<p>I suggest you send an email to the Imaging integration/DICOM WG-20 mailing lists, or show up to one of their calls and see if there is any movement here. (I haven't been able to attend recently, so I don't know.) I'm sure II/WG-20 would be happy to work with you to lead a project for AI encoding of Radiology results.</p>\n<p>Also, DICOM WG-27 (AI and Application Hosting) and the ACR's Data Science Institute are leading initiatives related  to invoking AIs and encoding results, with coming at the problem from different sides. You may want to connect with those groups to see if they have guidance. I can provide you with contact info for both if you don't have it.</p>",
        "id": 173223966,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1565803674
    },
    {
        "content": "<p>I</p>",
        "id": 173259435,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565834796
    },
    {
        "content": "<p>I'm about to do some very similar work for Anatomical Pathology Reports in Australia, but I just wanted to be clear; I'm not exactly sure what this means:</p>\n<blockquote>\n<p>with supporting standards meta data</p>\n</blockquote>",
        "id": 173259463,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565834854
    },
    {
        "content": "<p>what's standards metadata ? That doesn't sound like supporting atomic data (e.g. actual bone densities in a bone density scan) but... something else?</p>",
        "id": 173259515,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565834887
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, my bad, should have been more explicit. I'm not looking at eg. Pathology structured reports or similar. The metadata I meant by 'standard' is that which comes with most Radiology Info System reports - pat details, accession number, requesting physician, reporting radiologist etc.</p>",
        "id": 173268089,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1565849166
    },
    {
        "content": "<p>Well,in that case, you just need a DiagnosticReport with Patient and Practitioner</p>",
        "id": 173269994,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565852056
    },
    {
        "content": "<p>would look at Cacner interoperability council Breast cancer radiology report and mCode initiatives/ballots.</p>",
        "id": 195706804,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588166303
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  (also dislike metadata as used widely to mean different things that we usually have specific names for in the lab liek specimen, accession, etc.</p>",
        "id": 195706957,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588166390
    }
]