[
    {
        "content": "<p>Requirement: record these:<br>\nDid the patient have sepsis (YNU)? <br>\nIs that confirmed by culture (YNU)? </p>\n<p>Initial stab:<br>\nDid the patient have sepsis (YNU)? -&gt; Observation_A.code = sepsis; value = present/absent/unk<br>\nIs that confirmed by culture (YNU)? Observation_A.method = culture, unk, other</p>\n<p><strong>Issue</strong>: \"other\" is only meaningful in the context of this data set.</p>\n<p>Alternate stab:<br>\nDid the patient have sepsis (YNU)? -&gt; Observation_B.code = sepsis; value = present/absent/unk; .partOf = Procedure_B<br>\nIs that confirmed by culture (YNU)? -&gt; Procedure_B.code = culture; .status = complete | unk | not-done</p>\n<p><strong>Issue</strong>: if the procedure is unk or not-done, does the partOf assertion imply nonsense?</p>",
        "id": 275701235,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1647539579
    },
    {
        "content": "<p>This may be easy in this case, if we don't need to distinguish N and U; or if we can do so with method[CodeableConcept].text.</p>",
        "id": 275709088,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1647543213
    },
    {
        "content": "<p>Some Options<br>\n<a href=\"/user_uploads/10155/5YMspUgwPmW-2FC8kQKHzbW0/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/5YMspUgwPmW-2FC8kQKHzbW0/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/5YMspUgwPmW-2FC8kQKHzbW0/image.png\"></a></div>",
        "id": 275865726,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1647639295
    },
    {
        "content": "<p>Why aren't you looking for a finding of sepsis on the patient problem list implying a clinician determined a patient has sepsis whether confirmed by culture or other means?</p>",
        "id": 275965007,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1647780042
    },
    {
        "content": "<p>Whether the issue has been included in the problem list is not significant for the registry use case. In the current iteration, a registry collecting data in low and middle income countries, it won't be in a system at all.</p>\n<p>In the future (as we iterate toward support for OECD context - i.e., with an EHR), guidance will be to search both Observations and Conditions, whether on the problem list or not. In the interim, we're making as few assumptions as possible for the research elements.</p>\n<p>In any case, it doesn't seem to me that using Condition would solve the problem we're facing. Am I missing something?</p>",
        "id": 276198626,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1647960181
    },
    {
        "content": "<p>I missed the use case/context.  It seems like it still requires a clinician to make the assessment (after considering all the data available) to diagnose sepsis (which can be challenging at times).  In many cases it may not involve a culture at the time of diagnosis as most culture results come later as to which organism.  It may be a combination of other lab results such as lactate, WBC, procalcitonin, which are Typically available much quicker, along with vitals such as respiratory rate, temperature, BP, etc.   </p>\n<p>Where are your registry data originating?  Which roles are populating the data? It seems like depending on when you are answering the questions, you may wish to have a response such as culture in progress.  It may not yet be complete or you may have preliminary findings too.  In those cases, how/when would you address your questions?  Also when you ask did the patient have sepsis, when is this?  The most recent encounter or at any time in their life?</p>",
        "id": 276349375,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1648048833
    },
    {
        "content": "<p>Use case: a registry collecting data in low and middle income countries via web form. The data will not be coming from an EHR. Questionnaire would be a candidate solution if we weren't putting the data in a repository that will eventually also contain data from EHRs.</p>\n<p>We could infer Conditions for present disorders, but we have to have Observations for the pertinent negatives, so we're thinking simple is the better first step.</p>\n<p>But the question is how to represent method. The GA example is a little richer than the sepsis example. We are leaning toward option D.</p>",
        "id": 276909379,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1648489977
    },
    {
        "content": "<p>Thinking through this, Option A in your diagram seems clearly the best <em>if</em> your database in question can contain enough details of the Procedure to make it a viable freestanding resource.  However, the snippets of data shown don't indicate that the procedure information (for either the culture or ultrasound) are ever collected, so if that's not part of your data model it's obviously not viable.</p>\n<ul>\n<li>I personally wouldn't worry too much about the downside of the data being nonsense is the Procedure(US) has a status of Not Done.  IMO, that shouldn't be a state that your data model is trying to inherently reject, it should be up to data collection/ingestion processes to ensure that valid input is being used (I understand there are philosophies of design which prioritize this tradeoff differently, but that's not the use case perspective I'm coming from).</li>\n</ul>\n<p>Option D might be the best fall-back option if you don't have the procedure data model &amp; data collection in scope, I agree.  It also scales up plausibly to be able to work with Option A in the future because the Observation(GA) still exists identically in both cases, and the Obs(US:\"Y/N/NA/U) can exist in parallel with the Procedure(US) without obvious conflict.</p>",
        "id": 277431866,
        "sender_full_name": "Daniel Rutz",
        "timestamp": 1648825552
    }
]