[
    {
        "content": "<p>It was brought to my attention that Task and thus an odd sub-set of resources in R4 include an element relevantHistory that points at Provenance. I am concerned about this trend as it might be a misunderstand how Provenance functions relative to reverse lookups on Provenance.target. Even if this is not a misunderstanding of how Provenance functions, what is the meaning of a Provenance that was recorded, but not listed in relevantHistory? Does that mean it is not-relevant? Does that mean it should not be considered? The concern I have is that not listing should not be seen as an excuse to ignore other Provenance records. This ignoring could result in missed information that truly was relevant. Relevance should not be a static thing, but rather be a 'current' thing.</p>",
        "id": 162628361,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554474737
    },
    {
        "content": "<p>Yes, it means it's not relevant in the view of the person who updated the resource.  The purpose of relevant history is to give a view of key events such as creation, suspension, release, dispense, etc.  Some of the Provenances pointed to might not even have a focus of the referencing resource (e.g. the dispense example).  Minor edits, transformations, etc. wouldn't be shown.  The purpose is to do the same as v2 messages that show \"status history\" where 'status' is interpreted fairly broadly.</p>",
        "id": 162632613,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554477572
    },
    {
        "content": "<p>If you actually care about provenance, you'd do so as per usual.</p>",
        "id": 162632620,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554477585
    },
    {
        "content": "<p>relevantHistory will never include the most recent change - as that provenance record won't exist yet when you make the update.</p>",
        "id": 162632683,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554477606
    },
    {
        "content": "<p>so, how about the consistency across the FHIR specification?  Should there be some mention of this mechanism and proper use of the mechanism on the Provenance page? If so, could someone writeup that narrative and propose in a CR?</p>",
        "id": 162633586,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554478247
    },
    {
        "content": "<p>It's described in the Request pattern</p>",
        "id": 162634351,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554478869
    },
    {
        "content": "<p>There's actually a profile on Provenance that should be referenced, but the tooling didn't support asserting that constraint</p>",
        "id": 162634481,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554478956
    },
    {
        "content": "<p>(in a resource definition)</p>",
        "id": 162634488,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554478963
    },
    {
        "content": "<p>started a CR <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20758\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20758\">GF#20758</a> -- welcome specific text recommendation</p>",
        "id": 162945780,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554840792
    },
    {
        "content": "<p>I find a provenance-relevant-history profile, but can't find where this is referenced. It seems floating all alone, only mentioned on the Provenance profile page. I think it is defined in the build with Provenance resource. Right?</p>",
        "id": 162946640,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554841490
    },
    {
        "content": "<p>Right.  The intention was for the 'related history' elements to point to it, but the tooling for the core build doesn't support that right now.</p>",
        "id": 162948415,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554842733
    },
    {
        "content": "<p>okay. I was expecting something to be said on the workflow pages... hoping that I could just clone that onto the Provenance page. I think it would be very important that we make clear how this .relevantHistory is intended to be used. Specifically, why it would not be a copy of all Provenance. It seems very redundant without specific guidance.</p>",
        "id": 162949231,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554843357
    },
    {
        "content": "<p>It was created as a result of a change request from implementers who very definitely did NOT want to do all provenance.  They wanted a very limited subset that would support the use-case of relevant history.</p>",
        "id": 162949439,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554843488
    },
    {
        "content": "<p>Agree that the workflow pages should point to it at least.  Can you submit a change request?</p>",
        "id": 162949464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554843515
    },
    {
        "content": "<p>done <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20760\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20760\">GF#20760</a></p>",
        "id": 162951894,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554845405
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> <span class=\"user-mention\" data-user-id=\"191426\">@Peter Van Houte</span> <span class=\"user-mention\" data-user-id=\"199026\">@k connor</span></p>",
        "id": 163497875,
        "sender_full_name": "John Moehrke",
        "timestamp": 1555441917
    }
]