[
    {
        "content": "<p>Sometimes when capturing vital signs a number of measurements are captured at regular intervals.  For example blood pressures, pulse rates, etc.  Normally we recommend the use of the SampledData data type for such situations.  However, right now the vital signs profiles don't support the use of this type.  Are we comfortable saying that blood pressure, pulseox, etc. cannot EVER be captured using SampledData and must always have each measurement captured as a separate Observation?  (Because that's what we're doing right now with the mandatory profiles...)</p>",
        "id": 162949654,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554843650
    },
    {
        "content": "<p>Am cross posting to implementers.</p>",
        "id": 162949789,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554843737
    },
    {
        "content": "<p>to see if CURRENTLY an issue.</p>",
        "id": 162950046,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554843960
    },
    {
        "content": "<p>As mentioned there, the profile needs to allow what's permitted <em>ever</em>.  If we say \"this can only be a Quantity\" and go normative, it can't ever be anything else.  And these profiles are candidates to normative in R5.</p>",
        "id": 162951083,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554844692
    },
    {
        "content": "<p>I think that prohibiting the use of sample data for blood pressure, etc. is a bad idea.</p>",
        "id": 162965299,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1554859125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>  Strongly agree. In devices, it is sometimes natural for multiple sampled periodic vital signs to \"travel together\", as in patient-worn devices that sample more frequently than they transmit, for monitors that queue up samples until they can be validated by a clinician, for devices responding to retrospective data queries, and so on. Requiring these data to be rejiggered as individual observations doesn't seem beneficial in all cases.</p>",
        "id": 164919495,
        "sender_full_name": "John Rhoads",
        "timestamp": 1557062987
    }
]