[
    {
        "content": "<p>Hi Guys, back in HL7 V2 when creating an order for pathology or radiology we used ORM^O01 messages here in Australia. Others may have moved to the OML^O21 message which I'm less familiar with. Regardless both had an OBR Segment and OBR-28 had a definition of: <em>This field identifies the people who are to receive copies of the results.</em>  In later V2 releases this was deprecated in favour of the PRT Segment (Participation Information Segment).</p>\n<p>Regardless, I'm trying to work out how to express the equivalent concept in a FHIR order based around a ServiceRequest in R4. </p>\n<p>I can see we have a ServiceRequest.performer property (0..*) where I can have many Practitioner or PractitionerRole resources, along with other types. Then there is also also a ServiceRequest.performerType property (0..1) which can express the type of performer they are, I assume. There is no example code that means \"Performer to receive a copy\" but I could make my own code to be clear. <br>\nHowever, two things don't feel right to me:<br>\nThis does not seem like the logical place for this concept to live.<br>\nWhy is the ServiceRequest.performerType (0..1) when ServiceRequest.performer is (0..*)? Must there only be one type of performer and all must be of the same type?<br>\nMore importantly, how do I express a list of entities, primarily PractitionerRole, Practitioner or Patient entities that the requester would like a copy of the produced reports to be sent to?</p>\n<p>Has anyone else tackled this issue, what other solutions might I have missed?</p>\n<p>Thanks guys.</p>",
        "id": 257654275,
        "sender_full_name": "Angus Millar",
        "timestamp": 1634281091
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base/StructureDefinition-au-composition.html\">http://build.fhir.org/ig/hl7au/au-fhir-base/StructureDefinition-au-composition.html</a></p>",
        "id": 257970450,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1634526496
    },
    {
        "content": "<p>This is definitely worth some discussion.  I would tend to suggest putting it on the agenda for an OO on FHIR call - but that or any of our calls probably aren't at very good times for you, <span class=\"user-mention\" data-user-id=\"191391\">@Angus Millar</span>, as I believe that Tuesday at 10:00 AM EDT for OO on FHIR will be Wednesday 4:00 AM for you?</p>",
        "id": 258021256,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634560606
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>. However, we were not intending to use Composition or the document paradigm. Even if we did run with a  document and Composition for our orders it does not align with our intent. We are not trying to send extra copies of the order to the extra recipients, we want a way to communicate that the outcome or the order, e.g the diagnostic reports, be sent to the extra recipients.</p>",
        "id": 258131403,
        "sender_full_name": "Angus Millar",
        "timestamp": 1634610130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  Google seems to tell me that Tuesday 10 AM EDT is midnight Wednesday for me in Brisbane Australia. I could make that time if the meeting is on. Can you confirm the meeting will occur and point me to connection details?</p>",
        "id": 258131727,
        "sender_full_name": "Angus Millar",
        "timestamp": 1634610414
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191391\">@Angus Millar</span>  Well, you are right - but unfortunately I was wrong about 10:00 AM EDT.  I'm not sure what I was thinking and how I came up with that, but the actual time for the OO on FHIR call is 2:00 PM EDT (so again it would be 4:00 AM for you). :(  But in case you do want to get up really early Wednesday morning, here are the <a href=\"http://www.hl7.org/concalls/CallDetails.cfm?concall=57911\">details</a>.  The Zoom meeting is <code>https://zoom.us/j/5100467805</code>.</p>",
        "id": 258136399,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634614594
    },
    {
        "content": "<p>Thanks for clarifying <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, 4 AM is a little brutal so I will have to see how I feel tomorrow night.</p>",
        "id": 258138199,
        "sender_full_name": "Angus Millar",
        "timestamp": 1634616302
    }
]