[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> </p>\n<p>This issue has been discussed at several WGM's and I was asking for some use cases to help us visualize the issue and discussion. <br>\n Well trying to apply a Michelle tracker to servicerequest  using one of her examples  I stumbled upon a use case creating a <a href=\"http://build.fhir.org/servicerequest-example-ventilation.html\" target=\"_blank\" title=\"http://build.fhir.org/servicerequest-example-ventilation.html\">ventilator example</a> with order detalis.   I have not used a ventilator since vet school so the details may be way off but I think the concept of all the dosing details are illustrative of the issues. </p>\n<p>There are several dose like details in this example: sensitivity, pressure, flow  that are present in a non structured way.</p>\n<p>Assuming this is a valid use case - this brings up several questions:</p>\n<ul>\n<li>\n<p>Is this best represented in the order as a structured data using a  dosing element like Meds resources do?<br>\n        *  If so can we generalized Dosing to represent stuff like this as well?</p>\n</li>\n<li>\n<p>Or is there some other structure like an ad-hoc protocol or pre-existing protocol that should be referenced in <code>instantiates</code>  (I really don't know how protocols are used in the real world of -  but I imagine an anesthesiologist or whoever writes the order jotting downs some settings. )<br>\n        * what if is a form filled out by the orderer - right now that could only be referenced by <code>supportingInfo</code> as a binary or DocRef   -Is this even a use case ?</p>\n</li>\n</ul>",
        "id": 153940237,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519434430
    },
    {
        "content": "<p>I wouldn't rely on a protocol - the request resource should be able to express what's needed without one.  SupportingInfo doesn't define the order, it provides information necessary in executing the order.  E.g. a height and weight for a patient when ordering a drug and allowing the pharmacy to determine the dose; gender or age information to allow a lab to determine normal ranges, etc.</p>",
        "id": 153940250,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519435146
    },
    {
        "content": "<p>I would expect for us to be able to handle discrete data about the flow rates.  (Whether that's core or extension is up to the WG)</p>",
        "id": 153940253,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519435267
    },
    {
        "content": "<p><em>Could</em> you just reference 'Protocol Z' though?  .... and I would like to know pharmacy's take on generalizing Dosing.</p>",
        "id": 153940255,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519435429
    },
    {
        "content": "<p>Sure</p>",
        "id": 153940256,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519435475
    },
    {
        "content": "<p>I'm not sure if you could just reference a protocol in the ventilator settings case.  You may be able to and want to use a protocol to <strong>calculate</strong> the ventilator settings in a given instance, and Intermountain, particularly, has published research showing (as I recall it) that outcomes are better if a protocol is used to do this rather than relying on \"expert\" clinicians.  But you still need to represent the individualized settings in each instance (possibly a CarePlan can be used to do this?).  Generalizing the Dosing structure seems like it could be a possibility, but I haven't looked at any details on that.</p>",
        "id": 153940314,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1519474024
    }
]