[
    {
        "content": "<p>I'm curious as to why there is no equivalent status on a procedure request as there is on a medication request for a started but stopped service. Currently, there would be no way of determining if a request was terminated after initiation or before initiation. This also somewhat pertains to the potential addition of  (something like) Dosage to these requests. Should I submit a tracker about this or has there been previous discussion?</p>\n<p>This also somewhat pertains also to RequestGroup. Thank you</p>",
        "id": 153957224,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1525878309
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> ?</p>",
        "id": 153957228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525878755
    },
    {
        "content": "<p>The statused are aligned with the request pattern statuses...</p>\n<ul>\n<li>cancelled Cancelled   The authorization/request to act has been terminated prior to the full completion of the intended actions. No further activity should occur.</li>\n</ul>\n<p>there is no status in the pattern to indicate it was stopped before it was started but is that even a thing?</p>\n<p>What is a use case for this?</p>",
        "id": 153957232,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525878968
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   did you discuss in workflow?</p>",
        "id": 153957233,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525879011
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>   did you get a nastygram from workflow regarding  your status not being in alignment re this?</p>",
        "id": 153957236,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525879082
    },
    {
        "content": "<p>Pharmacy has dispensation for \"stopped\" rather than \"aborted\".</p>",
        "id": 153957237,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525879172
    },
    {
        "content": "<p>In Procedure, if something wasn't done at all, it would have a status of not-done.  If it had been started, then stopped, it would be aborted.</p>",
        "id": 153957238,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525879216
    },
    {
        "content": "<p>Code<br>\ndraft<br>\nactive<br>\nsuspended<br>\ncancelled<br>\ncompleted<br>\nentered-in-error<br>\nunknown</p>",
        "id": 153957245,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525879629
    },
    {
        "content": "<p>request statuses</p>",
        "id": 153957246,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525879649
    },
    {
        "content": "<p>for ServiceRequest</p>",
        "id": 153957248,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525879683
    },
    {
        "content": "<p>I was looking more at request group, for returning a set of surveillance type requests (PSA every 6 months, Prostate biopsy every 12 months). I guess it kind of leads to another question. What is the status of a request that doesn't have a specified end date but is expected to terminate when something changes in the patient? Is that even a thing?</p>",
        "id": 153957250,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1525879940
    },
    {
        "content": "<p>active</p>",
        "id": 153957255,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525880326
    },
    {
        "content": "<p>Sorry Eric, I meant after that event occurs (in this case it would be worsening of the cancer).</p>",
        "id": 153957276,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1525882278
    },
    {
        "content": "<p>I havent looked at RequestGroup very much so need to defer that question to someone else, perhaps <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 153957287,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525882843
    },
    {
        "content": "<p>A request that's triggered (or terminated) conditionally would be \"active\" as soon as the authoriation is in place.  As a simple example, if I write a prescription today (May 2018) that says \"Starting June 1, patient should take 1 tablet twice a day\", the order is \"active\" today (from the moment it's signed), even though the patient isn't supposed to start - and dispenses might not even be allowed for 1.5 months.  On the other hand, the MedicationStatement which reflects what the patient is actually <em>doing</em> shouldn't go active until July.</p>",
        "id": 153957348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525891493
    }
]