[
    {
        "content": "<p>When ordering a laboratory test, ServiceRequest may reference a Specimen. Thus, FHIR assumes the sample to be collected and registered as a resource before the test is ordered. However, the workflow in our clinic is different: an order is made long before the procedure, and defines the test and specimen type to be collected in the future.</p>\n<p>An approach for us may be maintaining a catalog of ActivityDefinitions for possible tests, each referencing SpecimenDefinitions. Then a ServiceRequest may reference ActivityDefinition (and transitively its SpecimenDefinition) to convey test and specimen type.</p>\n<p>Why was ServiceRequest designed to support only the case where the Specimen comes into existence first, but does not include a field to reference a SpecimenDefinition directly to support the workflow where the specimen is collected in the future in a more straightforward way?</p>",
        "id": 267926792,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1642106281
    },
    {
        "content": "<p>Specimen in ServiceRequest is optional.  It's used in situations where you're asking to run tests on a specimen that already exists.  In most cases, the ServiceRequest for a lab test won't point to a Specimen at all.  The lab will simply look at the set of <a href=\"http://ServiceRequest.codes\">ServiceRequest.codes</a> for all of the ServiceRequests in the requisition and decide what specimens are needed to satisfy those tests.  They <em>might</em> do this by looking up the associated ObservationDefinition and SpecimenDefinition, but the reality is that most labs don't use FHIR for this purpose.</p>",
        "id": 267947338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642116782
    },
    {
        "content": "<p>It'd be odd for the ServiceRequest to point to a SpecimenDefinition because, in most cases, it's not the responsibility of the ordering provider to decide what type of specimen is needed for a given test - or what specimens might reasonably be shared across tests.</p>",
        "id": 267947373,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642116829
    },
    {
        "content": "<p>This is a bit backwards. The performing lab establishes which specimens they perform their tests upon (and clinically validate before they are even offered to providers as an option).  It is correct these specifications are in Catalog Observation and Specimen Definitions so providers know what to collect for a particular \"test.\"  </p>\n<p>These can be used for generating patient instance data associated with the Service Request.  For lab orders, there will be the overarching \"parent\" Service Request that serves as the medical/legal requisition.  In addition there will be 'child\" Service Request(s) for Specimen Collection.  The order Service Request can be submitted by the provider independently, triggering the Collection Service Request so the patient specimen can be collected (which will likely involve different times/workflows/ tasks from the order service request).  Both would be needed by the performing laboratory to commence testing.</p>",
        "id": 270471376,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1643842156
    }
]