[
    {
        "content": "<p>Hi, I'm representing laboratory orders using <code>RequestGroup</code> and <code>ServiceRequest</code>. Now, as part of the lab flow, we need to send to the patients a kit. Now I need to store in some way the shipping method I want to use for each kit but I'm not sure where to put that kind of information. can anyone point me in the right direction?</p>",
        "id": 166711490,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1559047049
    },
    {
        "content": "<p>DeviceRequest would be the mechanism for ordering the kit.  You might need an extension for shipping method though.  You could submit a change request for a standard extension.</p>",
        "id": 166714149,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559048837
    },
    {
        "content": "<p>We should add that to SupplyRequest also. If it is only about the physical transportation, I would use SupplyRequest rather than DeviceRequest</p>",
        "id": 166768224,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559084468
    },
    {
        "content": "<p>Supply Request doesn't link to Patient</p>",
        "id": 166769042,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559085333
    },
    {
        "content": "<p>yep, my bad. We discussed adding it for this exact purpose but it is not there yet.</p>",
        "id": 166950439,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559254296
    },
    {
        "content": "<p>I'd be opposed to adding it.  The FMG agreed to allow SupplyRequest as a resource solely on the grounds that it was for non-patient-specific purposes (and thus there was no overlap with DeviceRequest and MedicationRequest).  We don't want to do anything that would create that overlap.</p>",
        "id": 166951009,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559254948
    },
    {
        "content": "<p>Implementations use that motion of delivery to a patient. We may keep the boundary \"patient specific\" but then we have to carefully look at boundaries across all xxxRequests resources to avoid gaps and overlaps</p>",
        "id": 166970967,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559282486
    },
    {
        "content": "<p>If something is being requested to be delivered to a patient and we do not care whether it is a device or a med or a nutrition, what do we use for that?</p>",
        "id": 166971030,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559282576
    },
    {
        "content": "<p>This is not a clinical request (in the functional sense and with the legal implications of it). I think that all our xxxRequests are clinical. But I may be wrong</p>",
        "id": 166971139,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559282751
    },
    {
        "content": "<p>When implementing, this was the 20% of function that gives 80% of the work or 80% of the z segments and Z events in v2</p>",
        "id": 166971202,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559282821
    },
    {
        "content": "<p>This notion of requesting stuff to be delivered to a patient - or to a location but to put in a patient's shelf - is implemented in systems - ERPs, not EHRs</p>",
        "id": 166971390,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559283075
    },
    {
        "content": "<p>As a way out, we could have a thing called ProductRequest that can be used for logistics purposes...</p>",
        "id": 166971449,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559283136
    },
    {
        "content": "<p>But then we'd have to take good care of scopes and boundaries again</p>",
        "id": 166971473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559283194
    },
    {
        "content": "<p>My leaning would be to generify DeviceRequest</p>",
        "id": 166991361,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559304714
    },
    {
        "content": "<p>Are you guys thinking of this a value tied specifically for reuse whenever a Patient reorders? That was not our intent.</p>",
        "id": 167882784,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1560281457
    },
    {
        "content": "<p>our kits are delivered using some carriers and with its own configurations. we are trying to find a place to store that kind of information</p>",
        "id": 167953676,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1560350667
    },
    {
        "content": "<p>Have you looked at observation definition as part of the Order Catalog IG?  It lists all kinds of specimen criteria as part of the CLIA Specimen Collection Manual and can list temperature and other specimen requirements.  It might be able to support your shipping needs too.  Unclear if you are asking if the specimen was sent frozen, on ice, etc. as part of your need?</p>",
        "id": 195705531,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588165761
    }
]