[
    {
        "content": "<p>We are working on identifying all elements described in the Specimen DAM (<a href=\"http://hl7.org/implement/standards/product_brief.cfm?product_id=499\" target=\"_blank\" title=\"http://hl7.org/implement/standards/product_brief.cfm?product_id=499\">http://hl7.org/implement/standards/product_brief.cfm?product_id=499</a>) to FHIR resources (most of them as extensions).</p>\n<p>As part of this we are looking at the area of container (touches the specimen) and holders, storage equipment and locations a specimen can be located.</p>\n<p>Currently FHIR only uses the term container and it can only be described within the context of the specimen and specimenDefinition resources.</p>\n<p>We would like to keep the distinction between containers and any other holders etc.<br>\nWe need support for nesting of containers in holders, holders inside holders / storage equipment - currently we have a gForge tracker (now jira item) to make container backbone recursive - we would like to change that to reference holder instead, BUT ALSO are trying to figure out if using this as backbone element only is sufficient.</p>\n<p>We are looking for input from YOU as to what will be most appropriate:<br>\n#1 For the specimen resource we came up with these 3 options:</p>\n<p>Option 1: add reference to device resource used to describe the holder / storageEquipmentComponent / StorageEquipment either:<br>\n1a under specimen.container instead of the currently suggested backbone of specimen.container.container (which will most likely be an extension)<br>\n1b separately direct under specimen<br>\nOption 2: add backbone element to specimen.container for holder<br>\nOption 3: remove container backbone element and add reference to device which then would describe the container / holder / storageEquipmentComponent / storageEquipment</p>\n<p>We think that option 3 may provide the most flexibility to accomodate the nesting as well as allow for description of containers outside of being associated with a specific specimen already. For all options using reference to device we think we may need some extensions to the device resource to accommodate existing container attributes</p>\n<p>#2 For the specimenDefinition resource, do we want to replace the container backbone element with a reference to deviceDefinition (which may need some extensions to accommodate existing container attributes)?</p>\n<p>Please send your thoughts back to this list by COB 12/9/2019 - thank you for your input!</p>",
        "id": 182710026,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1575583580
    },
    {
        "content": "<p>From the minutes of the catalog call on 12/6/2019 (<a href=\"https://confluence.hl7.org/display/OO/Catalog+Call+Minutes+December+6%2C+2019\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/Catalog+Call+Minutes+December+6%2C+2019\">https://confluence.hl7.org/display/OO/Catalog+Call+Minutes+December+6%2C+2019</a>):<br>\nDiscussion on specimen container vs other elements<br>\nSee zulip chat for the problem statement: <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Specimen.20Containers.20and.20holders\" title=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Specimen.20Containers.20and.20holders\">https://chat.fhir.org/#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Specimen.20Containers.20and.20holders</a><br>\nFor the catalog group this affects specimenDefinition:<br>\nIn specimenDefinition we would replace the container backbone with reference to deviceDefinition, if we can be sure we can add the additional elements into the deviceDefinition (we prefer Option 3 with this caveat)<br>\ndeviceDefinition does not have any required elements we don’t need, so that works out ok<br>\nNeed to merge the values for valueset deviceType to include what we currently have in containerType - that can also help with the differentiation between containers and other kind of things like the holders, storage equipement<br>\nFor catalog not sure if we would need to define holders (maybe for handling description)<br>\nWill need to add deviceDefinition to the lab catalogs</p>",
        "id": 183685815,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1576612997
    },
    {
        "content": "<p>Hello everyone,</p>\n<p>I am quite new to the FHIR chat and in general to the underlying mechanisms of the working groups and standardization. However I'm interested in solving the issue with Specimens, having a precise location, that are collected in a hierarchical structure like racks, trays, freezers, rooms, buildings, sites, etc… </p>\n<p>Is there any update on this, or did I miss something on that topic? Thank you for any hints or feedback!</p>",
        "id": 243367687,
        "sender_full_name": "Marc Eden",
        "timestamp": 1624274272
    },
    {
        "content": "<p>Seems like it would be reasonable to at least have an extension that could indicate the Location where the Specimen currently resides.  (The Location resource would handle the recursive handling of rack inside tray inside freezer inside room, etc.)  <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>?</p>",
        "id": 243732905,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624498225
    },
    {
        "content": "<p>(Oh, and welcome to the community <span class=\"user-mention\" data-user-id=\"303882\">@Marc Eden</span> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 243732922,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624498258
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span></p>",
        "id": 243733814,
        "sender_full_name": "Eric Haas",
        "timestamp": 1624499445
    },
    {
        "content": "<p>Welcome <span class=\"user-mention\" data-user-id=\"303882\">@Marc Eden</span> - we are considering freezers, racks and trays devices and devices have a location. There is work ongoing at IHE to define the Specimen Event Tracking (SET) profile - it should be published soon, though that looks at it in the V2 world, but describes the different use cases around specimen movement. We usually tlk about these things on the specimen project calls, which are Mondays 2 - 3 PM ET (</p>",
        "id": 243735545,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1624501818
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"303882\">@Marc Eden</span> - user error - I meant to insert a paragraph  - here are meetign minutes from last year where we had discussions that also have links to the FHIR trakcers, but I have NOT looked where those are: <a href=\"https://confluence.hl7.org/display/OO/Specimen+Call+Minutes+February+24%2C+2020\">https://confluence.hl7.org/display/OO/Specimen+Call+Minutes+February+24%2C+2020</a> ... and the link to the call: <a href=\"http://www.hl7.org/concalls/CallDetails.cfm?concall=55495\">http://www.hl7.org/concalls/CallDetails.cfm?concall=55495</a></p>",
        "id": 243735576,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1624501899
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> - does it seem reasonable to have a link from Specimen to Location to indicate 'current' location?  (We do that with Devices)</p>",
        "id": 243810326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624551696
    },
    {
        "content": "<p>Yes, that's a reasonable suggestion, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.  We've addressed it in <a href=\"https://jira.hl7.org/browse/FHIR-21280\">FHIR-21280</a>, and also related is <a href=\"https://jira.hl7.org/browse/FHIR-22823\">FHIR-22823</a>.  The one thing that I think maybe we didn't do (or at least didn't do sufficiently) is look at whether we need to re-open <a href=\"http://jira.hl7.org/browse/FHIR-21280\">FHIR-21280</a> and no longer add Specimen.container.location, since with <a href=\"http://jira.hl7.org/browse/FHIR-22823\">FHIR-22823</a> we will have Specimen.container.device.location - and I'm sure we won't want to have both. <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> <span class=\"user-mention\" data-user-id=\"191969\">@John David Larkin Nolen</span></p>",
        "id": 243856220,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624575137
    },
    {
        "content": "<p>@Robert Hausam &lt;<a href=\"mailto:rrhausam@gmail.com\">rrhausam@gmail.com</a>&gt; @John David Nolen<br>\n&lt;<a href=\"mailto:jdlnolen@gmail.com\">jdlnolen@gmail.com</a>&gt; @Lloyd<br>\nMcKenzie &lt;<a href=\"mailto:lloyd@lmckenzie.com\">lloyd@lmckenzie.com</a>&gt;<br>\nI thought we wanted the location to be on container (=device) because in<br>\nreality a specimen is always in a container (or in the analyzer).<br>\nThanks @Robert Hausam &lt;<a href=\"mailto:rrhausam@gmail.com\">rrhausam@gmail.com</a>&gt; for pulling in the FHIR trackers.<br>\nSo I think we should pull these up on next week's specimen call = Monday<br>\n2-3 PM ET.<br>\nRiki</p>",
        "id": 244017167,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1624717000
    },
    {
        "content": "<p>Device is an option, though it's a level of indirection that may make querying a bit difficult.</p>",
        "id": 244034578,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624741809
    },
    {
        "content": "<p>Thanks everyone for your warm welcome! :) And of course for your suggested approaches and the detailed information. I will have a look at all the linked documents and discuss the insights with out team. Again, thank you for your helpfulness – that's not naturally in such specialized communities. <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span></p>",
        "id": 245937251,
        "sender_full_name": "Marc Eden",
        "timestamp": 1626255124
    }
]