[
    {
        "content": "<p>Currently the specimen has a cardinality of 0..1, in the genomics use case we have the need to have multiple specimen. If you have an Observation on germline/somatic mutation you always look at least at 2 specimen, sometimes even 3.</p>",
        "id": 164884656,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557000448
    },
    {
        "content": "<p>specimen can be split into multiple sub-specimen.  I would have a single parent specimen with multiple childen   <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span>   <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span>  can you comment</p>",
        "id": 164889913,
        "sender_full_name": "Eric Haas",
        "timestamp": 1557008897
    },
    {
        "content": "<p>but these specimens doesn't have a relationship. One specimen would be the tumor, the other blood from the patient or blood from a relative.</p>",
        "id": 164890431,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557009854
    },
    {
        "content": "<p>what is the relationship of observation to specimen?  are there three observations that get combined into a calculated result.</p>",
        "id": 164892987,
        "sender_full_name": "Eric Haas",
        "timestamp": 1557014678
    },
    {
        "content": "<p>Example - Person A is definitely a father/mother of Person B on the basis of the analysis of specimen A1 and specimen B1</p>",
        "id": 164893357,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557015395
    },
    {
        "content": "<p>Yes you will need to be able to track the multiple children - and children's children, when you are talking about anatomic pathology - if you can reference the imediate parent, you can daisey chain them together - if you can reference all specimen IDs, whithout a hierachy, that could work, but keeping the lineage intact would be better.</p>",
        "id": 164917947,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1557060403
    },
    {
        "content": "<blockquote>\n<p>what is the relationship of observation to specimen?  are there three observations that get combined into a calculated result.</p>\n</blockquote>\n<p>The relation is that i have an observation which is based on two specimen. I need multiple specimen to compare the DNA of these. This could be 3 Observations, but when reporting genomic cancer variants, you would expect a single observation pointing to multiple specimen.</p>",
        "id": 164919782,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557063436
    },
    {
        "content": "<p>can you provide a specific example  ie a reference to a method or something to illustrate this.  do you stick three disparate example in a blender and then run the analysis on the blenderized sample?  or do you really have three separate observation each with the sample and then should maybe ref thes observation?  Otherwise I think this is an edge case and an extension like 'aggregate sample' may be a better option.</p>",
        "id": 164923802,
        "sender_full_name": "Eric Haas",
        "timestamp": 1557069681
    },
    {
        "content": "<p>we discussed the issue in CG and came to the same conclusion. The \"correct\" usage would be 3 different Observations, as this is too much overhead for us we will go with an extension.</p>",
        "id": 164928671,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557077864
    },
    {
        "content": "<p>Isn't this a possible use case with anatomic pathology as well?</p>",
        "id": 164930504,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1557080997
    },
    {
        "content": "<p>Nevermind, answer is listed above.</p>",
        "id": 164930692,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1557081272
    },
    {
        "content": "<p>We will define an Extension for 0..* \"related\" Specimen for the clinical genomics use-case. Does O&amp;O prefer to have this Extension in FHIR-Core, or should we do our own extension?</p>",
        "id": 166095545,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1558367055
    },
    {
        "content": "<p>but can add as genomics extension,  OO has not had input on genomics trackers to OO resource.  (Maybe we should).   Otherwise OO tracker.</p>",
        "id": 166108409,
        "sender_full_name": "Eric Haas",
        "timestamp": 1558377422
    },
    {
        "content": "<p>But adding it to core wouldn't take effect until R5, right? If we add it to the IG, then it could be used as soon as the IG is published (this summer?). Once it becomes published as part of core in R5, then a new IG can point to that.</p>",
        "id": 166109501,
        "sender_full_name": " Bob Milius",
        "timestamp": 1558378297
    },
    {
        "content": "<p>late here, but another great example is transplant testing, and transfusion type and cross match (very common).  In both cases, you have a donor specimen and recipient specimen.  It's vital to keep them separate.  They are collected separately, but used in the final report typically on the recipient (as that is where billing, the order/request originates, etc.)  </p>\n<p>It's a bit different than the use case with derived specimens as described by <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span>  and common in AP, microbiology and the like.</p>",
        "id": 167849456,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1560259578
    },
    {
        "content": "<p>I am even later than Andrea ... So it sounds like what is happening in CG is that each specimen is analyzed and then a conclusion is formed, tking these observations into account; I think the extension is a good idea. We are working on speciment resource this cycle - calls are Tuesdays 3 -4 PM EDT on the OO main line (Online Meeting Link: <a href=\"https://join.freeconferencecall.com/ord\" target=\"_blank\" title=\"https://join.freeconferencecall.com/ord\">https://join.freeconferencecall.com/ord</a> - Online Meeting ID: ord) - please feel free to join us on one of those).</p>",
        "id": 167851160,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1560260777
    },
    {
        "content": "<p>also cultures as folks know....</p>",
        "id": 195705004,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588165542
    }
]