[
    {
        "content": "<p>We are trying to maintain a certain sort order in our Specimen and be able to make sure that we know the order on a ServiceRequest level. How would this best be achieved? When we make a FHIR query request should the result when an include iterate is in the request return the specimen in the order they appear in the ServiceRequest resource?</p>",
        "id": 164108614,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1556131798
    },
    {
        "content": "<p>if I understand your question.  ServiceRequest.specimimen is a 0..* element and the expectation in FHIR is that order of 0..8*elements shall be maintained when transacting a resource.  In other words the order in ServiceRequest that you post to a server should be the same when you go and fetch it.  If you think that won't happen in the real world then can introduce an itemorder extension to explicitly call out its order.   (<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  will frown :0)</p>",
        "id": 164112236,
        "sender_full_name": "Eric Haas",
        "timestamp": 1556134131
    },
    {
        "content": "<p>Systems are expected to retain order of repeating elements where order has meaning.  However, order has no meaning in ServiceRequest.specimen.  As such the order shouldn't matter.  Even so, order should be retained for digital signature purposes.  (Note that implementations are not permitted to infer meaning from order where FHIR has not defined a meaning for the order.  If you need to convey semantics by order and order has no meaning, you have no choice but to use an extension.</p>",
        "id": 164120542,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556140452
    },
    {
        "content": "<p>Late to the discussion, but it might be good to avoid ambiguity if the definitions of order are clearly delineated:  1.  sequential order 1.2.3, etc. vs 2.  order or requisition or request as in laboratory order.  Realize it's a bit ironic given the need to convey semantics, but want to ensure there's no misinterpretation of the discussion above as happens when folks use the same term to mean different meanings.  Seems like all uses above might be the first definition, is that correct?</p>\n<p>Agree order (sequential) should be retained for order (lab request) as there is context with orders (lab request) when paired with specimen and results (observation/component, etc).</p>",
        "id": 167848542,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1560258898
    },
    {
        "content": "<p>Great question as I assume it's wanting to keep/create the Order of Draw for specimen collection.  (It's important when drawing multiple specimens from a single patient venipuncture to collect tubes in a certain order or contamination of subsequent tubes can occur invalidating test results.)</p>\n<p>Have you reviewed Order Catalog resources and requirements to generate them on a patient instance level during the ordering process?  There was another poster who was trying to solve the same problem.</p>",
        "id": 195704689,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588165405
    }
]