[
    {
        "content": "<p>Hi all, <br>\nis it ok to use the Specimen.subject to model the recursive nature of containers or how this could be done? <br>\nThanks in advance Ralf</p>",
        "id": 153970286,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1529339125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>?  (My take is that using subject would be inappropriate, but not sure if a correct mechanism has been defined)</p>",
        "id": 153970287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529342395
    },
    {
        "content": "<p>Subject is not for the container and is inappropriate.  </p>\n<p>try </p>\n<div class=\"codehilite\"><pre><span></span>Specimen.parent\nElement Id  Specimen.parent\nDefinition\nReference to the parent (source) specimen which is used when the specimen was either derived from or a component of another specimen.\n\nControl 0..*\nType    Reference(Specimen)\nComments\nThe parent specimen could be the source from which the current specimen is derived by some processing step (e.g. an aliquot or isolate or extracted nucleic acids from clinical samples) or one of many specimens that were combined to create a pooled sample.\n</pre></div>",
        "id": 153970361,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529358171
    },
    {
        "content": "<p>Your suggestion is not exactly what I am looking for. My problem relates to the need to model something like a specimen is in a container who is on a tray (with a certain position), which is on a rack (with a certain position), ... (basically v2 SAC-10ff) so how to model this recursive nature (specimen in container on a tray in a rack in ...) would this needed to be done as an extension or should it be in the resource?</p>",
        "id": 153970404,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1529396799
    },
    {
        "content": "<p>Are you referring to a specific specimen, or the definition of a specimen?</p>",
        "id": 153970405,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529396852
    },
    {
        "content": "<p>To a specific Specimen.</p>",
        "id": 153970406,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1529396888
    },
    {
        "content": "<p>hmmm ok. i read this as if it were definitional, in which case specimenDefinition might have helped</p>",
        "id": 153970407,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529396985
    },
    {
        "content": "<p>SpecimenDefinition would help, but SpecimenDefinition should be included as a possible Reference in Specimen. Since we are currently only prototyping I would like to use the SpecimenDefinition and perhaps just create an extension to Specimen to Reference it. <br>\nDoes anything speaks against this (except the obvious that it is from R4 draft)?</p>",
        "id": 153970408,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1529397971
    },
    {
        "content": "<p>Let's check what <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> has to say about this</p>",
        "id": 153970413,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529401047
    },
    {
        "content": "<p>Ok, so this is about automated tracking.  I don't think SpecimenDefinition would be helpful here as this is about managing a specific instance, not a 'kind'.  The racks and trays would not be \"specimens\", so this would not be a recursive relationship.  The racks and trays are (typically reuseable) devices.  And device (now) does have a hierarchical relationship - and a location.  If Specimen.container included a Reference(Device), would that meet your needs?</p>",
        "id": 153970417,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529403927
    },
    {
        "content": "<p>...or extensions as you suggest which may be easier for and I wold certainly make a tracker for OO to look at this in FHIR because the specimen working group is certainly familiar with this.  <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span>  ?</p>",
        "id": 153970423,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529404247
    },
    {
        "content": "<p>A Reference(device) in Specimen would be a great way to do it. But it should be named appropriate. I would think about something like \"carrier\".</p>",
        "id": 153970432,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1529408164
    },
    {
        "content": "<p>after reworking, i expect that the resource that would contain location would be the device instance, not the device kind.</p>",
        "id": 153970433,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529408627
    },
    {
        "content": "<p>but since a device instance can point to a device kind, the coverage will remain.</p>",
        "id": 153970434,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529408692
    },
    {
        "content": "<p>device (kind) will still have a hierarchical relationship (parent) to another device (kind)</p>",
        "id": 153970435,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529408764
    },
    {
        "content": "<p>and of course any of those can have an instance</p>",
        "id": 153970436,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529408811
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196116\">@Ralf Herzog</span>, Device is used for all kinds of devices - those you're interested in but also software, complex medical devices, etc.  We don't create custom-named resources for each use-case they're used in as that would result in thousands of them.  If you choose to profile the Device resource for this specific use-case, you can name the profiles whatever you wish.  However, in the instances, the resource would still be named \"Device\".</p>",
        "id": 153970468,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529412716
    },
    {
        "content": "<p>The specimen work group is certainly familiar with this, and I understand there is a work stream focused on specimen banking use cases. Now that the domain analysis model is ready for publication, the work group intended to focus on the specimen resource(s) as the current resource is  a mixture of specimen, specimen tracking and specimen collection procedures. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> or <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span>   are  most familiar with the project work and planned next steps</p>",
        "id": 153970566,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1529426589
    },
    {
        "content": "<p>May I bring this topic back into use ,</p>\n<p>in the context of biobanking for clinical trials we came across the question of container recursion too, but there also is a second relationship of containers : a specimen container may belong to a so called sample kit which means a composition of different sample containers belonging to one single collection.</p>\n<p>So my question: Is there any ongoing work to add these relations (recursion as well as aggregation) to Specimen ?</p>",
        "id": 154021574,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1543488302
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> ?</p>",
        "id": 154021712,
        "sender_full_name": "Eric Haas",
        "timestamp": 1543506252
    },
    {
        "content": "<p>Yes there is work going on - we are currently trying to define handling of derived specimen in the Tuesday specimen calls (3-4 PM ET) using the ord free-conference call line (<a href=\"https://join.freeconferencecall.com/ord\" target=\"_blank\" title=\"https://join.freeconferencecall.com/ord\">https://join.freeconferencecall.com/ord</a>, Online Meeting ID: ord, calls (United States): (515) 739-1430, Access Code: 294586) - we also looked at dealing with specimen event tracking (knowing where the specimen is - and are considering using the provenance resource for that. The specimen resource in FHIR definitely needs an overhaul! Please join the specimen list serve to stay in touch.</p>",
        "id": 154021714,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1543506923
    }
]