[
    {
        "content": "<p>I have been discussing this with <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> and <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> and we want to clarify the use of Substance resource as an instance and make changes to Substance to better support this<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-28547\">https://jira.hl7.org/browse/FHIR-28547</a></p>",
        "id": 210298711,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600279445
    },
    {
        "content": "<p>Both Medication and Substance behave as both 'kind' and 'instance' - and it would be problematic (and unnecessary) to change that.</p>",
        "id": 210303549,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600282032
    },
    {
        "content": "<p>we are not changing that</p>",
        "id": 210308154,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600284177
    },
    {
        "content": "<p>I think substance code is not the same as substance instance identifier. <br>\nAnd the notion of a \"instance flag\" was briefly discussed in the product pattern, we adopted the instance backbone. Why is substance instance different from medication instance?</p>",
        "id": 210326007,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600293849
    },
    {
        "content": "<p>Perhaps this is the same debate as whether to use separate resources  for kind and instance.</p>",
        "id": 210326294,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600294007
    },
    {
        "content": "<p>-I think substance code is not the same as substance instance identifier.<br>\nI agree</p>",
        "id": 210379813,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600344747
    },
    {
        "content": "<p>-And the notion of a \"instance flag\" was briefly discussed in the product pattern, we adopted the instance backbone.</p>\n<p>Because a 0..* backbone element with several optional items in it doesn't make a very good flag. A boolean works better</p>",
        "id": 210379881,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600344809
    },
    {
        "content": "<p>-why is substance instance different from medication instance?</p>\n<p>Because a medication is intended for a person, but a substance is intended as an ingredient, never for a person</p>",
        "id": 210380016,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600344884
    },
    {
        "content": "<p>-Perhaps this is the same debate as whether to use separate resources  for kind and instance.</p>\n<p>Yes it is part of that debate. Substance is already used for both and we see no reason to change that (<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>'s  point)</p>",
        "id": 210380206,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600344996
    },
    {
        "content": "<p>If you're going to add a flag, it can't be mandatory (and it's not a modifier)</p>",
        "id": 210384813,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600347482
    },
    {
        "content": "<p>great - that is what we propose, not mandatory. But if it makes it an instance or a kind, is that not a modifier?</p>",
        "id": 210386332,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600348090
    },
    {
        "content": "<p>didn't we propose a flag in the Product pattern discussion (inside instance)? I think I remember it not being seen as necessary.</p>",
        "id": 210387131,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600348455
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Substance.20resource.20as.20an.20instance/near/210379881\">said</a>:</p>\n<blockquote>\n<p>-And the notion of a \"instance flag\" was briefly discussed in the product pattern, we adopted the instance backbone.</p>\n<p>Because a 0..* backbone element with several optional items in it doesn't make a very good flag. A boolean works better</p>\n</blockquote>\n<p>true, a boolean works better for a flag - question is - why is this a \"flag\"?</p>",
        "id": 210387262,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600348524
    },
    {
        "content": "<p>this discussion seems 2016'ish . And it seems like a very good reason to have a pattern (as we do). If we keep hammering one or another new resource to find the best model, we will take a while.</p>",
        "id": 210387693,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600348684
    },
    {
        "content": "<p>(sorry for pushing for pattern again, but I don't realize how strong I'm pushing :) )</p>",
        "id": 210387772,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600348722
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : there needs to be recognition that when a resource intends to cover both an actual instance (albeit not always fully populated with all relevant identifiers to clearly make it so, thus somewhat kind-ish) and a definition/kind, that one always knows which context that resource is expected to be used in as the context that it is actually being used in (as referenced already or not yet) is not always present, and that during that resource instance's life cycle the meaning does not change, e.g., a resource that started as a definition suddenly gets a serial number and has become an instance.  That needs some sort of flag, or boolean, or unambiguous absence or presence of certain data that never can change (immutable).  Use cases that indicate they don't care are actually in the instance space with fuzzy/kind-ish identification.  Those working with definitions would not suddenly want to change them mid-stream to instances as references that expect them in definition context would become problematic.  For Substance it is o.k. to have one resource supporting both, but then it must be possible to unambiguously and immutably indicate what it represents.  Relying on profiling is not strong enough.  Absence/presence of certain data is not strong enough.  Only an immutable flag/boolean is.  And you can default as appropriate (mostly instance as reality is that there are many more instance instances than definition instances).</p>",
        "id": 210389279,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600349374
    },
    {
        "content": "<p>Most systems working with medications and substances today don't differentiate and don't need to.  You could certainly profile in your space to make it mandatory.  However, given that many (most?) systems today don't know/don't care, FHIR certainly can't make such a concept mandatory.  In many spaces the same resource instance can be pointed to as both kind (e.g. by the order) and instance (e.g. by the dispense).   And that works just fine.</p>",
        "id": 210399769,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600353804
    },
    {
        "content": "<p>So It's not ok to force the flag to be populated in the core spec - and I wouldn't even be comfortable with it being mandatory in a general-purpose IG like US-Core.</p>",
        "id": 210399844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600353838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> the Jira does make it very clear that we are not making it mandatory. It basically states exactly what you just stated :-)</p>",
        "id": 210400300,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600354039
    },
    {
        "content": "<p>I'm arguing w/ Hans, not you Rik :)</p>",
        "id": 210401153,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600354394
    },
    {
        "content": "<p>ah, but I was agreeing with both you and Hans, so something is up... :-)</p>",
        "id": 210409450,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600357833
    },
    {
        "content": "<p>Hans is saying you always need to know the context in which the resource is intended to be used in - and I'm saying you don't.  That for many use-cases, it's fine for the resource to be ambiguous</p>",
        "id": 210409731,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600357980
    },
    {
        "content": "<p>I can't speak for Hans, but we did chat earlier about that offline and we were agreed that the flag can be optional (then I wrote that up in the Jira). He did say above \"can default as appropriate\" which is how we discussed it.</p>",
        "id": 210411116,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600358532
    },
    {
        "content": "<p>The flag would need to allow for 'unknown'.  It can't be a boolean where if you omit it, a value is assumed.</p>",
        "id": 210416619,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600361079
    },
    {
        "content": "<p>if its not there the value would be \"nothing stated about that\". Which is neither true nor false, indeed.<br>\nI see \"Default value\" in the FHIR source spreadsheets. Does that not apply these days?</p>",
        "id": 210417556,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600361537
    },
    {
        "content": "<p>Default values aren't allowed.  You can have \"meaning if missing\".  But in this case, if I have a Medication instance and I don't know/care whether it represents a kind or an instance (and might be used in both context), it needs to be exposed in FHIR that way.</p>",
        "id": 210423349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600364108
    },
    {
        "content": "<p>A boolean can state yes or no, and if you dont know/care you dont use it. Are you saying there must be a way to positively state that we don't know? Also, if meaning if missing is a concept, why is that unable to work here?</p>",
        "id": 210429425,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600366793
    },
    {
        "content": "<p>I'm saying I'd be happier with an optional code.  Most environments can't handle an 'unknown' boolean.</p>",
        "id": 210431697,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600367828
    },
    {
        "content": "<p>A boolean is easier for people to grasp I would say. If there cannot be a default - or a meaning if missing (I'm unclear what role that plays) - then there is true (it's an instance), false (it's not, so it's a kind/definition) and no value, if it's not present, no statement is made about what it is. Is there a reason that that doesn't work?</p>",
        "id": 210559780,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1600454561
    },
    {
        "content": "<p>The reference implementations can't generally distinguish once the data has been parsed whether a boolean was present with false or absent entirely.  So 'code' is really the only way to go to maintain the distinction safely.</p>",
        "id": 210565812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600457736
    },
    {
        "content": "<blockquote>\n<p>The reference implementations can't generally distinguish once the data has been parsed whether a boolean was present with false or absent entirely</p>\n</blockquote>\n<p>That's not true of most of them, but it is true of some implementations</p>",
        "id": 210681409,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600630506
    }
]