[
    {
        "content": "<p>I was wondering when and how (if at all) it would be legal to use codes for a <em>substance</em> (substance codes in SNOMED or part-codes in LOINC) in <code>Observation.code</code> when transmitting the result of a measurement of that substance. For instance, for a measurement of LDL cholesterol, setting <code>code</code> to SNOMED 102737005 (High density lipoprotein cholesterol (substance)) and giving the measured concentration in <code>valueQuantity</code>.</p>\n<p>It's clear that this not the recommended way (e.g. it gives no information about the measurement method or the sample) and that a proper LOINC code would be better. Looking at the <a href=\"http://hl7.org/fhir/R4/observation.html#guidance\">guidance on the use of obs codes in the spec</a>, such codes also do not appear in any of the recommended approaches.  However, I'm considering contexts with restrictions and am trying to gauge whether this would ever be an acceptable way out. For instance, cases where one can only use a fixed code system that has an appropriate substance codes but no matching measurement code (e.g. SNOMED). I've also come across cases where no LOINC measurement code could be chosen because all appropriate LOINC codes implied the use of a specific measurement method and I did not have any information about the method (this was outside a classical laboratory setting, e.g. patient reported information).</p>\n<p>How would you see this and are there perhaps better alternatives (short of custom codes)?</p>",
        "id": 267990733,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1642153128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> It might be useful to look at the UK profiles in this regard.  I'm pretty certain that they are dealing with lab data, and they use SNOMED CT exclusively (or at least don't use LOINC).</p>",
        "id": 269618412,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1643308901
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> I'll have a look at that.</p>",
        "id": 269690117,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1643348885
    },
    {
        "content": "<p>Maybe you could point me to the specific IG you meant? I found multiple NHS IGs, but they seem to allow both SNOMED and LOINC cf. <a href=\"https://simplifier.net/guide/ClinicalObservations/Observation\">this profile from the Clinical Observations IG</a> or <a href=\"https://simplifier.net/guide/SummaryCareRecordWithCodedData/Observation\">this profile from the Summary Care Record IG</a>.</p>",
        "id": 269694361,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1643353191
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>  I was somewhat surprised to find that the latest UK Core <a href=\"https://simplifier.net/guide/UKCoreImplementationGuide0.3.0-STU1/Home\">IG</a> doesn't seem to have any profiles for lab results.  And I did see a profile on DiagnosticReport in an earlier (I think) UK Core version which has a LOINC binding for DiagnosticReport.code.  But I do know that they have done more with this, and my impression still is that they have focused (nearly) exclusively on SNOMED CT.  But I guess I will have to reach to some contacts if we want to get further details.</p>",
        "id": 269795462,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1643400811
    },
    {
        "content": "<p>For consumer performed testing/info, if it is using a test kit used by health professionals (i.e. waived test kits for COVID Ag) and it's just the performer/setting that differ, then existing LOINCs might be used to map to the test result and SCT for qualitative result values.  The performer would be indicated too.   However, if it's say a device that has a totally new way of testing, such as a smartwatch doing a glucose measurement on the skin, then a new LOINC code should be requested so it's available for all end users of the method.</p>",
        "id": 270471843,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1643842430
    }
]