[
    {
        "content": "<p>When is <code>observation.valueString</code> preferred over <code>observation.valueCodeableConcept.text</code>?<br>\nSeems like the latter can be used instead of the former. Can someone show me an example where the former is preferred? </p>\n<p>from <a href=\"https://www.hl7.org/fhir/observation.html#valuex\" target=\"_blank\" title=\"https://www.hl7.org/fhir/observation.html#valuex\">https://www.hl7.org/fhir/observation.html#valuex</a><br>\n<em>When the data element is usually coded or the type associated with the code element defines a coded value, use valueCodeableConcept even if there is no appropriate code and only un-coded text is available. For example using text only, the valueCodeableConcept element would be:</em></p>\n<div class=\"codehilite\"><pre><span></span>&quot;valueCodeableConcept&quot;: {\n&quot;text&quot;: &quot;uncoded free text result&quot;\n }\n</pre></div>",
        "id": 153989825,
        "sender_full_name": " Bob Milius",
        "timestamp": 1534869948
    },
    {
        "content": "<p>An example would Observation.code was a LOINC with property scale = narrative then <em>only</em> text is anticipated.  Then valueString is appropriate.   Certainly is technically appropriate to use observation.valueCodeableConcept.text  but from an implementation stand point the simpler valueString may be preferred if only expecting text.   <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 153989838,
        "sender_full_name": "Eric Haas",
        "timestamp": 1534876004
    },
    {
        "content": "<p>Thanks! The guidance I quoted above says \"when the data element is <strong><em>usually</em></strong> coded...\" <br>\nWhen developing an IG, would it be appropriate to constrain the valueX to CodeableConcept even if the majority of the time only a string value is expected, to allow for local code systems for values? Or should both valueString and valueCodeableConcept be allowed? Seems there would be a benefit to constrain it to just one of these in an IG.</p>",
        "id": 153989841,
        "sender_full_name": " Bob Milius",
        "timestamp": 1534877296
    },
    {
        "content": "<p>I agree</p>",
        "id": 153989844,
        "sender_full_name": "Eric Haas",
        "timestamp": 1534877748
    },
    {
        "content": "<p>I think that basically I agree.  If the value <strong>may</strong> be coded, even if it isn't most of the time, I think CodeableConcept is appropriate.  If the intent is that the value is <strong>always</strong> text (narrative) then you should use string.  There is probably not a lot of reason (if any) to have a choice of  valueString and valueCodeableConcept, although I don't think it would be wrong in any way to do that.</p>",
        "id": 153989846,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534878420
    }
]