[
    {
        "content": "<p>In the attached file you can find an example heart rate observation with statistical components to report min, max, average, etc. of the observed heart rate over a period of time. <br>\nWhen a sensor device does not report individual observations, but only this aggregate statistic summary, what would be the most interoperable manner to store this in a FHIR server?</p>\n<p>In particular,<br>\n(1) Is it appropriate to report this as a Vital Signs Observation?<br>\n(2) Is it appropriate to use the value reported as the average also as the valueQuantity of the Observation?</p>\n<p><a href=\"/user_uploads/10155/Js8VeDTiRrfMZvxeEF5Z5lr7/heartrate-with-statistics-FHIR.json\">heartrate-with-statistics-FHIR.json</a></p>",
        "id": 242989248,
        "sender_full_name": "Erik Moll",
        "timestamp": 1623919977
    },
    {
        "content": "<p><a href=\"https://hackmd.io/1PmjSjkfSa69UP9UDxYNmw\">Here</a> is how we mapped OMH to FHIR for this.   Following <a href=\"http://hl7.org/fhir/observation-vitalsigns.html#vitals-table\">this guidance</a> for the FHIR Core vitals Profiles:</p>\n<blockquote>\n<p>If a more specific code or another code system is recorded or required, implementers must support both the values (LOINC) listed below and the translated code - e.g. method specific LOINC codes, SNOMED CT concepts, system specific (local) codes.</p>\n</blockquote>\n<p>we added the minimum coding to the <code>code</code>.</p>",
        "id": 243047600,
        "sender_full_name": "Eric Haas",
        "timestamp": 1623948450
    },
    {
        "content": "<p>So what you have is basically a panel  of measures, which also works IMO if you don't want individually separable objects.</p>",
        "id": 243048761,
        "sender_full_name": "Eric Haas",
        "timestamp": 1623948780
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> thanks for the response and the OMH reference. <br>\nWhat I distill is that you think it is appropriate to use extra components in a vital signs observation.<br>\nWhat I would find questionable is how the OMH <strong>minimum </strong> respiration rate over a period of an hour is mapped to the value of a FHIR Respiration Rate Observation, with an additional code OMH specific code. If we would do this for minimum, maximum, average, median and standard deviation, this would likely confuse clients that attempt to graph vitals. So, we proposed to use the average as the main value of the observation, and we support the others in additional components, and we repeat the average as component as well.</p>",
        "id": 243481366,
        "sender_full_name": "Erik Moll",
        "timestamp": 1624347573
    }
]