[
    {
        "content": "<p>A laboratory requisition often contains a collection of tests and panels ordered together for a common purpose (screening, diagnostic or prognostic of a condition, monitoring a treatment, check before or after a procedure …). It is a collection of {ORC, OBR} in HL7 V2, a collection of ServiceRequest in FHIR. <br>\nIn many European countries, the lab requisition as a whole is represented and communicated per se between CPOE and LIS, with its status being monitored (active, completed …), and the lab report fulfilling it.<br>\nIn HL7 V2, those European countries have relied only on the {ORC, OBR} pairs representing each individual test/panel ordered in the global requisition, the two fields ORC-4 and ORC-38 representing the global requisition seen from EHR-S and LIS.<br>\nIn FHIR, I see two alternative solutions to represent more accurately the laboratory requisition object: List or CarePlan. In both cases the resource would be profiled to hold a homogeneous collection of ‘Laboratory procedure’ ServiceRequest resources. <br>\nBoth List and CarePlan have a subject and encounter, may have identifiers, and an author/source.<br>\nList.status (current, retired, …) is less appropriate to the purpose than CarePlan.status (draft, active, on-hold, completed …).<br>\nMoreover, being a ‘request’ resource, CarePlan is appropriate to be the starting point of a workflow, and offers more features adequate to the purpose: </p>\n<ul>\n<li>addresses Condition (what this lab requisition is focused on)</li>\n<li>supportingInfo (to convey additional findings and observations contextualizing the requisition)</li>\n<li>CarePlan is referenced by DiagnosticReport, enabling DiagnosticReport to reference both an individual ServiceRequest it fulfills and the global lab requisition.<br>\nFor the reasons above, my choice would be profiling CarePlan for this specific purpose, rather than using List. <br>\nDoes this raise any concerns or other suggestions?<br>\nThanks</li>\n</ul>",
        "id": 189319610,
        "sender_full_name": "François Macary",
        "timestamp": 1582903662
    },
    {
        "content": "<p>The general expectation is that there won't be a resource for the collection at all - you'll just have a whole bunch of ServiceRequests that happen to share the same requisition identifier.  No object for the requisition itself.  That design came about after significant discussion and a realization that the requisition doesn't have an independent status.  Every item ordered can be suspended, cancelled or completed independently.  For those rare situations where multiple things are ordered and have to be treated as a collective - i.e. must be suspended, cancelled, etc. as a group, there's the RequestGroup resource.</p>",
        "id": 189320533,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582904234
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for the arguments and also for pointing me to RequestGroup, which reflects the geometry of PlanDefinition. I had missed this one. <br>\nI agree  with the two kinds of solutions, depending on at which level the life cycle needs to be managed:</p>\n<ul>\n<li>Collection of ServiceRequests sharing the same requisition identifier, each with its own independent status.</li>\n<li>RequestGroup if the status needs to be managed at the collective level.  <br>\nI had exactly the same question for drugs prescriptions as a computable object. The same couple of solutions applies, I guess.</li>\n</ul>",
        "id": 189322798,
        "sender_full_name": "François Macary",
        "timestamp": 1582905623
    },
    {
        "content": "<p>Yes.  And even for mixtures.  E.g. a drug and repeating lab tests that are tightly intertwined</p>",
        "id": 189329329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582909808
    },
    {
        "content": "<p>Just saw this Francois.  Although CarePlan would be used by a provider to indicate their plan of care for a patient, it is not used for a requisition for lab orders.  Service Request is the FHIR resource as Lloyd describes to request a lab test.  It would need to be paired with a request for specimen collection.  Both could be triggered by Order Catalog on a patient instance level.  It would be wonderful if we could take some catalog entries and provide real examples for implementers as a guide.  FHIR Workflow with Lloyd did start walking through a number of different types of orders (panel, profile/tiered panel, surg path report, culture, etc.) in talkign through resources, which was extremely helpful as there are some nuances that are needed to support some of the complex orders.</p>",
        "id": 195702808,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1588164583
    }
]