[
    {
        "content": "<p>Useful article from Gartner: Top 10 mistakes in enterprise blockchain projects  <a href=\"http://www.gartner.com/smarterwithgartner/top-10-mistakes-in-enterprise-blockchain-projects/\" target=\"_blank\" title=\"http://www.gartner.com/smarterwithgartner/top-10-mistakes-in-enterprise-blockchain-projects/\">http://www.gartner.com/smarterwithgartner/top-10-mistakes-in-enterprise-blockchain-projects/</a></p>",
        "id": 153877446,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489666007
    },
    {
        "content": "<p>Useful technical decomposition from Kantara, who document what makes a good use of blockchain and what does not. Includes a set of use-cases with details. I participle in this workgroup. <a href=\"http://kantarainitiative.org/confluence/display/BSC/Home\" target=\"_blank\" title=\"http://kantarainitiative.org/confluence/display/BSC/Home\">http://kantarainitiative.org/confluence/display/BSC/Home</a>   You should be able to read the Report, in google document form. It is out for public comment right now.</p>",
        "id": 153877447,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489666232
    },
    {
        "content": "<p>I just added a set of criteria that a Healthcare use of Blockchain should measure up to. I don't claim this is definitive, but rather a start <a href=\"https://healthcaresecprivacy.blogspot.com/2017/03/healthcare-blockchain-use.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/03/healthcare-blockchain-use.html\">https://healthcaresecprivacy.blogspot.com/2017/03/healthcare-blockchain-use.html</a></p>",
        "id": 153878634,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490038103
    },
    {
        "content": "<p>John<br>\nI'm at the \"Healthcare Blockchain Summit.\" And (notwithstanding the fact that I was actually a featured speaker there this afternoon;-) the overall quality of both the presentations and the apparent sophistication of the audience here is quite impressive.  As you'd imagine, I could fill pages with with interesting insights offered.  That said, my headline remains the same: The mutual indifference of Blockchain and FHIR folk is breathtaking﻿ [present company, of course, excluded;-]</p>",
        "id": 153878661,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1490044653
    },
    {
        "content": "<p>and yet... Blockchain on FHIR....  would be so very buzzword compliant... sexy...</p>",
        "id": 153878665,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490046374
    },
    {
        "content": "<p>Yep..go figure.<br>\nBTW, FWIW, I'm working on a White Paper on a concept that we' dubbed FHIR(R)Blocks*: one that may strike a blow in more than mere buzzword fashion</p>\n<hr>\n<p>*respecting, of course, HL7's registered TM</p>",
        "id": 153878669,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1490051705
    },
    {
        "content": "<p>We just added support for the FHIR Patient resource to our blockchain audit log.  Next up is the AuditEvent resource.<br>\n<a href=\"https://github.com/chafey/ethereum-hipaa-audit-log-improved/pull/1\" target=\"_blank\" title=\"https://github.com/chafey/ethereum-hipaa-audit-log-improved/pull/1\">https://github.com/chafey/ethereum-hipaa-audit-log-improved/pull/1</a></p>",
        "id": 153878674,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490053095
    },
    {
        "content": "<p>so what does that mean, to support it? </p>",
        "id": 153878675,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490053137
    },
    {
        "content": "<p>I'm imagining that block chain has a blob in which you put a Patient resource. And I\"m supposing that it makes no difference to blockchain that's a FHIR Patient as opposed to anything else it could be?</p>",
        "id": 153878676,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490053182
    },
    {
        "content": "<p>Pretty much.  The etherium-audit-log example was creating using a custom Patient object, and storing into a Patients collection.  That Patients collection now uses the FHIR 1.6.0 schema.  When the Patient object gets created, it writes items into the blockchain ledger.  Next step is to put an event hook on the Patients collection, so the blockchain ledger is updated when updates come over the REST API.  The demo is pretty clever.  The blockchain mining is happening in the background; and you can see the ledger get hashed and updated when a Patient is created or viewed (through the user interface).  Meteor on FHIR apps which use the FHIR collections can all benefit from a single blockchain mining node; and once we get the event hooks, it should be supported via REST APIs also.</p>",
        "id": 153878677,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490053563
    },
    {
        "content": "<p>Kudos to Chris Hafey and the team at <a href=\"http://Nucleus.io\" target=\"_blank\" title=\"http://Nucleus.io\">Nucleus.io</a> who did all the crypto work;  I'm just updating their audit log with FHIR schema(s).</p>",
        "id": 153878678,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490053641
    },
    {
        "content": "<p>I would certainly agree that AuditEvent could be the basis of a BlockChain based audit log. A selected subset (CRUD) of audit events. How is the patient privacy protected, while still using public ledger (aka block validation by miners)? Not that I expect all problems to be solved during early day...</p>",
        "id": 153878720,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490096657
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> interested to learn more; is the API (or code) for a <a href=\"http://nucleus.io/\" target=\"_blank\" title=\"http://nucleus.io/\">http://nucleus.io/</a> audit log published somewhere? The web site doesn't include a ton of detail :-)</p>",
        "id": 153878752,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1490106224
    },
    {
        "content": "<p>Here's the demo.  <br>\n<a href=\"https://github.com/chafey/ethereum-hipaa-audit-log-improved\" target=\"_blank\" title=\"https://github.com/chafey/ethereum-hipaa-audit-log-improved\">https://github.com/chafey/ethereum-hipaa-audit-log-improved</a></p>\n<p>You'll need to follow some links, and install the etherium network to get the blockchain mining node; install MetaMask to access the ledger ; RoboMongo if you want a Mongo database manager; Postman if you want to test the FHIR API.</p>",
        "id": 153878753,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490107199
    },
    {
        "content": "<p>Right now, we're not updating the ledger when a Patient resource is created via REST endpoint; only when it's created via the user interface, which uses a websocket connection (i.e. a Subscription).  There's a pull request submitted to get the event hooks in place to update the ledger via REST endpoint.  </p>",
        "id": 153878754,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490107398
    },
    {
        "content": "<p>what metadata do you need to store along with the actual blob for the patient resource? a mime type, say?</p>",
        "id": 153878789,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490112251
    },
    {
        "content": "<p>There were two fields on the original object, <code>transactionHash</code> and <code>contractAddress</code>.  I was able to create an extension and attach that to the Patient object.  Tentatively thinking that registering a <code>patient-ethereum</code> or <code>patient-ethereum-audit-log</code> extension would make sense.</p>\n<p><a href=\"https://github.com/chafey/ethereum-hipaa-audit-log-improved/blob/master/patientApp/lib/collections/patients.js\" target=\"_blank\" title=\"https://github.com/chafey/ethereum-hipaa-audit-log-improved/blob/master/patientApp/lib/collections/patients.js\">https://github.com/chafey/ethereum-hipaa-audit-log-improved/blob/master/patientApp/lib/collections/patients.js</a></p>",
        "id": 153878790,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490112585
    },
    {
        "content": "<p>Those fields could probably be renamed; but that's what got the job accomplished.  Kudos to Chris Hafey and team; they came up with that.</p>",
        "id": 153878791,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490112644
    },
    {
        "content": "<p>I don't understand why you'd extend patient in order to put patient in the blockchain?</p>",
        "id": 153878792,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490112681
    },
    {
        "content": "<p>I'm a bit fuzzy on that part because I didn't implement it; but it seems like you could do without, but you'd lose the reference and it would get lost in the chain.  I certainly wouldn't know how to query the ledger without that info.</p>",
        "id": 153878793,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490112892
    },
    {
        "content": "<p>it seems odd to me that a patient has a reference into the chain..? wouldn't the chain index handle that? </p>",
        "id": 153878794,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490113376
    },
    {
        "content": "<p>We're using a denormalized database (Mongo), so references get duplicated and we run housecleaning methods and event hooks to keep things in sync.  It's a pretty typical pattern for our infrastructure to have the reference there.  We use the HL7 FHIR schemas directly as our database schemas.  I'm sure it could be implemented in a few different ways.</p>",
        "id": 153878796,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490114314
    },
    {
        "content": "<p>I am not clear on the linkage. I would expect the public-key used as identity in blockchain, to be considered one of the Patient.identifier values. This element in FHIR could hold it, and it would be a nice identifier.</p>",
        "id": 153878797,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490114341
    },
    {
        "content": "<p>FWIW, the variation of FHIR/blockchain that we're working on does not place PHI Resources themselves in a blockchain; rather only conditioned-permissioned pointers to off-chain (EHRs, IPFS, etc) and/or side-chain (smart-contract-peered pointers to other blockchains) URI/L's</p>",
        "id": 153878799,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1490114423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> - I sort of expected the public-key to be in the Patient.identifier as well.  But I guess it doesn't need it?  ¯\\_(ツ)_/¯</p>",
        "id": 153878800,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490114543
    },
    {
        "content": "<p>all depends on what is needed. Pointers need only go one way, if both sides can be queried. More typical of http/REST.  So, if the blockchain holds pointers to FHIR objects (protected on a off-chain service), then there is no need to put public key into the FHIR Patient.identifier.  It wouldn't hurt... Indeed there might be many blockchain public identifiers that all map to the same patient, to support non-linkability.</p>",
        "id": 153878802,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490114753
    },
    {
        "content": "<p>oh, and if using blockchain public identifiers as pseudonyms in a non-linability mode; then you would NOT want then in the Patient.identifier</p>",
        "id": 153878803,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490114822
    },
    {
        "content": "<p>New article on blockchain in healthcare <a href=\"https://blockchainhealthcaretoday.com/index.php/journal/article/view/24\" target=\"_blank\" title=\"https://blockchainhealthcaretoday.com/index.php/journal/article/view/24\">https://blockchainhealthcaretoday.com/index.php/journal/article/view/24</a>  nothing new but it is well written and easy to read. Mostly targeting executive, not technical people.</p>",
        "id": 153947627,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521923508
    }
]