[
    {
        "content": "<p>Has anybody else worked with BigChain?  Because it stores JSON objects natively on it's chain, it's effectively a native-FHIR blockchain.<br>\n<a href=\"https://www.bigchaindb.com/\">https://www.bigchaindb.com/</a></p>\n<p>I ask because I have a Vaccine Wallet app that I'm getting ready to publish, and have a list of people asking about health passports, health ID cards, vaccine cards, vaccine registries, etc.  Having worked with Ethereum and Hyperledger, I find their on-chain data model to be way too obfuscated.  So, for simplicities sake, I think I'm going to set things up so the users of the app have the option to permanently write their FHIR Immunization records to a vaccine container on BigChain, and call it a registry.  Et voila.</p>",
        "id": 231971362,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616768096
    },
    {
        "content": "<p>What is your goal in encouraging people to write their immunization records to a public registry?</p>",
        "id": 231974655,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616769305
    },
    {
        "content": "<p>(We've been thinking about proof of vaccination use cases in <a href=\"https://smarthealth.cards\">https://smarthealth.cards</a>, where we give individuals a signed record they can store and use, without having to <em>publish</em> it anywhere. This helps individuals manage their data privately.)</p>",
        "id": 231974981,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616769400
    },
    {
        "content": "<p><a href=\"https://vaccinationcredential.org/\">https://vaccinationcredential.org/</a> has more into on the initiative.</p>",
        "id": 231975046,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616769422
    },
    {
        "content": "<p>Travel insurance.  People lose their phones.  Imagine traveling overseas, your vaccine card gets you to some remote local, you have an accident and lose your phone, and now countries are preventing you from getting home because intermediary stops require vaccine approval.  </p>\n<p>Also, if people posting their vaccine results on Facebook and Twitter are any indication, vaccination is something they willfully desire to broadcast, not keep private.  Not for everyone.  But there’s an interest.</p>",
        "id": 231977368,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616770183
    },
    {
        "content": "<p>Re: phones, the expectation is that everything works on paper too, so you can save that. Or digitally you can save a copy of these records in any \"online drive\" tool.</p>\n<p>(I take your point that lots of people are comfortable sharing data publicly, and heck I publish my full medical records on GitHub -- but still, when it comes to packaged, focused apps, privacy by default is super important because defaults drive the \"choices\" that users make.)</p>",
        "id": 231978090,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616770444
    },
    {
        "content": "<p>Disclaimer:  I find the whole notion of vaccine wallets to be net-neutral in terms of benefits.  The research is inconclusive how well they work, and suggests they have the potential for discrimination and reducing social mobility.  But... there’s widespread demand, and therefore probably a compelling Patient Empowerment argument that there should be a public/open alternative.  And it seems to be a legitimate case for blockchain.  </p>\n<p>But I’d rather architect and design for positive impact, rather than chase the tech hype cycle.  And Ethereum and Hyperledger are so caught up in their own blockchain-ness, with the mining culture and contracts and all, that they can’t take FHIR seriously.  Meanwhile, as a dev and operator, I just want something that stores JSON/FHIR natively on chain, and call it a day, ya know?</p>",
        "id": 231979742,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616771026
    },
    {
        "content": "<p>I very much am worried about the elitism that will come with vaccine credentials... but that is a problem that needs to be solved well above the Interoperability Standards level. We need to produce something that works, while outlining all the policy/politics/procedure/etc   considerations that are potentiall problematic</p>",
        "id": 231980120,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616771159
    },
    {
        "content": "<p>YUP.</p>",
        "id": 231980232,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616771185
    },
    {
        "content": "<p>Josh, I'd like to second that: there's absolutely no need to put a certificate (aka credential) on any chain. If an issurer signs it, a verifier knows it hasn't tampered with by simply verfying the signature. What you should put on chain (or any trusted, publicly readable, highly read-scaleable, proven to be secure, not controlled by one party, remote \"database\") is the trust anchorship of the issuer's DID / her public key / signing address. Smart Health Cards are one of the first (imo quite US-biased) good implementations of VC/DID based FHIR-claims I've seen so far. Another might be <a href=\"https://cccc4.ca/\">https://cccc4.ca/</a> (<a href=\"https://link.getmailspring.com/link/C17092B2-641F-4F68-B289-AAF753E49EAC@getmailspring.com/0?redirect=https%3A%2F%2Fcccc4.ca%2F&amp;recipient=bW0yNjQyOWNiMjNkYTMxZTAyNzdhZDUwZGQwMTMxOWE0MEBzdHJlYW1zLnp1bGlwY2hhdC5jb20%3D\">https://link.getmailspring.com/link/C17092B2-641F-4F68-B289-AAF753E49EAC@getmailspring.com/0?redirect=https%3A%2F%2Fcccc4.ca%2F&amp;recipient=bW0yNjQyOWNiMjNkYTMxZTAyNzdhZDUwZGQwMTMxOWE0MEBzdHJlYW1zLnp1bGlwY2hhdC5jb20%3D</a>) (Canada) or the W3C Vaccination Vocabulary (<a href=\"https://link.getmailspring.com/link/C17092B2-641F-4F68-B289-AAF753E49EAC@getmailspring.com/1?redirect=https%3A%2F%2Fw3c-ccg.github.io%2Fvaccination-vocab%2F&amp;recipient=bW0yNjQyOWNiMjNkYTMxZTAyNzdhZDUwZGQwMTMxOWE0MEBzdHJlYW1zLnp1bGlwY2hhdC5jb20%3D\">https://link.getmailspring.com/link/C17092B2-641F-4F68-B289-AAF753E49EAC@getmailspring.com/1?redirect=https%3A%2F%2Fw3c-ccg.github.io%2Fvaccination-vocab%2F&amp;recipient=bW0yNjQyOWNiMjNkYTMxZTAyNzdhZDUwZGQwMTMxOWE0MEBzdHJlYW1zLnp1bGlwY2hhdC5jb20%3D</a>) (~ Europe), both both don't use FHIR.</p>\n<p>@Abigail: here in Germany a consortium that builds vacc certs similar to your idea has won the government's call for proposals by March 9 - they're also not storing a certificate on chain but rather merkle tree roots that prove that a credential (which is not bound to an identity but contains PII data to verify a personal id card) hasn't been modified (<a href=\"https://ubirch.de/en/digital-vaccination-certificate\">https://ubirch.de/en/digital-vaccination-certificate</a> (<a href=\"https://link.getmailspring.com/link/C17092B2-641F-4F68-B289-AAF753E49EAC@getmailspring.com/2?redirect=https%3A%2F%2Fubirch.de%2Fen%2Fdigital-vaccination-certificate&amp;recipient=bW0yNjQyOWNiMjNkYTMxZTAyNzdhZDUwZGQwMTMxOWE0MEBzdHJlYW1zLnp1bGlwY2hhdC5jb20%3D\">https://link.getmailspring.com/link/C17092B2-641F-4F68-B289-AAF753E49EAC@getmailspring.com/2?redirect=https%3A%2F%2Fubirch.de%2Fen%2Fdigital-vaccination-certificate&amp;recipient=bW0yNjQyOWNiMjNkYTMxZTAyNzdhZDUwZGQwMTMxOWE0MEBzdHJlYW1zLnp1bGlwY2hhdC5jb20%3D</a>)). I'm still 100% convinced that it's a really bad idea to put a certificate (aka a claim about an identity) or only parts of it on an immutable ledger. Sorry to say that, no bad feelings :)<br>\nCheers,<br>\nStefan</p>\n<p>Sent from Mailspring (<a href=\"https://link.getmailspring.com/link/C17092B2-641F-4F68-B289-AAF753E49EAC@getmailspring.com/3?redirect=https%3A%2F%2Fgetmailspring.com%2F&amp;recipient=bW0yNjQyOWNiMjNkYTMxZTAyNzdhZDUwZGQwMTMxOWE0MEBzdHJlYW1zLnp1bGlwY2hhdC5jb20%3D\">https://link.getmailspring.com/link/C17092B2-641F-4F68-B289-AAF753E49EAC@getmailspring.com/3?redirect=https%3A%2F%2Fgetmailspring.com%2F&amp;recipient=bW0yNjQyOWNiMjNkYTMxZTAyNzdhZDUwZGQwMTMxOWE0MEBzdHJlYW1zLnp1bGlwY2hhdC5jb20%3D</a>), the best free email app for work</p>",
        "id": 231980789,
        "sender_full_name": "Stefan Adolf",
        "timestamp": 1616771383
    },
    {
        "content": "<p>See, I look at that and find it over-engineered.  I’ve done the federated/sovereign-ID-on-hyperledger thing before, and vendors didn’t want to support the ID in their FHIR server, because they didn’t control the chain.  </p>\n<p>Which is why I’m a proponent of ripping out the smart contract overhead, getting back to basics, and following-the-data.  We have JSON and XML datatypes, so focus on the blockchain-like technologies that natively support those formats.  That’s the path to building FHIR specific chains.  Start with something straightforward like Immunization to verify the technology, then use Provenance on-chain to support all the security use cases and bootstrap into the model you’re suggesting.</p>\n<p>Aside:  we’re going to have QR codes that carry the entire FHIR Immunization resource in the barcode.  And a QR scanner in our wallet, so someone can scan another phone from a tollbooth or entry point.  QR-on-FHIR is a crazy cool technology.  Works better than NFC-on-FHIR, even.  Doing the hashed-record-on-chain approach doesn’t let us pop the record off and display it with existing UI.</p>",
        "id": 231983559,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616772330
    },
    {
        "content": "<p>This conversation does make me think we need a clause in the Terms and Agreements before rolling this out, that we reserve the right to scrap the entire registry and take it down if it doesn’t perform as expected.</p>",
        "id": 231984201,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616772550
    },
    {
        "content": "<p>\"vary the entire FHIR Immunization resource\" --&gt; *carry ?</p>",
        "id": 231984668,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616772694
    },
    {
        "content": "<p>Re: QRs, keeping thing small can be a challenge. Practically these get harder to scan as you get beyond ~V22 symbols. <a href=\"https://smarthealth.cards/#health-cards-are-small\">https://smarthealth.cards/#health-cards-are-small</a> is the bag of tricks we use to keep things small FWIW.</p>",
        "id": 231984922,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616772777
    },
    {
        "content": "<p>(If you're only looking to make this work within your own app, you can also just go the protobuf route, which helps a lot -- it's just a higher bar if you have a diverse set of implementers to bring into the fold.)</p>",
        "id": 231985658,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616773037
    },
    {
        "content": "<p>Right.  We’re probably looking at supporting multiple chains long term.  But the politics of the Ethereum and Hyperledger (IBM/Oracle) worlds are just too obfuscated and lost in their own drama.  I’m looking for keeping it dead simple with an initial proof-of-concept in production.</p>",
        "id": 231993233,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616775841
    },
    {
        "content": "<p>Oh, by the way... PatientEmpowerment is taking a vote next week to possibly co-sponsor the Vaccine Card track.  We had folks from Europe bring up the European vaccine initiative a few weeks ago, and turns out there’s a fair bit of interest.</p>\n<p>Great work on the SmartHealth Cards spec, btw.  The cryptography seems both straightforward, but also very liability avoidant at the cost of ease-of-use.  I’m reading it in more detail right now, and it seems to advocate that any Vaccine Wallet operator become a notary signer of sorts.  Which... I’m not entirely against.  But on first read, it seems implementing the spec obligates the implementor into certain business models.  Maybe worth spelling out a policy implications section?</p>",
        "id": 231994828,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616776425
    },
    {
        "content": "<blockquote>\n<p>advocate that any Vaccine Wallet operator become a notary signer of sorts</p>\n</blockquote>\n<p>Can you say more about this? We basically want/hope the wallet role to be very thin (a user can use a paper wallet with printed cards, or a digital wallet that shares the same content) -- the wallet doesn't \"vouch for\" anything. Issuers vouch for their content, and verifies can check the content; digital wallets are entirely optional, and when used are only a conduit.</p>",
        "id": 232002346,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616779193
    },
    {
        "content": "<blockquote>\n<p>implementing the spec obligates the implementor into certain business models</p>\n</blockquote>\n<p>I hope not, but say more about what you mean? The only requirement is that <em>issuers</em>, if they're going to be compatible with the spec, need to openly host their public keys (i.e., the mere act of validating an issuer's signature on a Health Card  can't require pre-arrangement or payments)</p>",
        "id": 232002558,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616779274
    },
    {
        "content": "<p>Well, follow the data right?  Consider some app developer, develops an app which allows the user/patient to select an Immunization record from their Apple Health Records.  It's been issued, but there's no JWT signature.  Just a JSON blob sitting in their FHIR storage.  They pick it up, make a QR code out of it, share it, and the next phone over displays the record.  In the following example, they know somebody named Altick Kelly gave Candace a vaccination.  That's enough for whatever screener involved to call up Altick Kelly to confirm the vaccination.  That's all that's needed.  Anything more is a bit extraneous.  </p>\n<p><a href=\"/user_uploads/10155/caC9jLJDBUCKF-R-PELsxAW4/IMG_7196.PNG\">IMG_7196.PNG</a><br>\n<a href=\"/user_uploads/10155/Q7S9onX0obXctZ-DKUp0NCab/IMG_5F42D2DBD176-1.jpeg\">IMG_5F42D2DBD176-1.jpeg</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/caC9jLJDBUCKF-R-PELsxAW4/IMG_7196.PNG\" title=\"IMG_7196.PNG\"><img src=\"/user_uploads/10155/caC9jLJDBUCKF-R-PELsxAW4/IMG_7196.PNG\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Q7S9onX0obXctZ-DKUp0NCab/IMG_5F42D2DBD176-1.jpeg\" title=\"IMG_5F42D2DBD176-1.jpeg\"><img src=\"/user_uploads/10155/Q7S9onX0obXctZ-DKUp0NCab/IMG_5F42D2DBD176-1.jpeg\"></a></div><p>Don't get me wrong.  If we can get Apple and others to support the JWT tokens as ride-alongs, that's gravy.  I'm all for it.  But as far as the current state of things go, the app developer would need to act as a (re)issuer and assign the JWT, which is what I mean by acting as a notary.</p>",
        "id": 232025433,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616789607
    },
    {
        "content": "<p>Next step of course, is writing to a ledger somewhere, either permanent or temporary.</p>",
        "id": 232026192,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1616789961
    }
]