[
    {
        "content": "<p><a href=\"http://histalk2.com/2017/04/03/the-blockchain-interview-with-jason-goldwater/\" target=\"_blank\" title=\"http://histalk2.com/2017/04/03/the-blockchain-interview-with-jason-goldwater/\">http://histalk2.com/2017/04/03/the-blockchain-interview-with-jason-goldwater/</a></p>",
        "id": 153880829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491251747
    },
    {
        "content": "<p>it's not going to help when it starts with non-sensical stuff like this:</p>",
        "id": 153880830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491251769
    },
    {
        "content": "<p>\" Essentially translated, that means the data is not all residing in one place. The data is residing in various different locations. Every time a change to the data is made, that change is reflected across all the locations of which the data is stored. If there are going to be threats or hacks to data, it’s easier, to some extent, to hack into a centralized location to find a large amount of patient-generated data, whereas it’s more difficult to be able to get a large amount of patient data when it’s distributed across a large number of networks\"</p>",
        "id": 153880831,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491251781
    },
    {
        "content": "<p>I was in attendance at Mr Goldwater's talk at the Healthcare Blockchain Summit; and, FWIW (and notwithstanding the rambling verbatim captured above) , a lot of what he has to say makes a lot of sense.  In any case, and IMHO, we're all going to be talking a lot more about blockchained solutions in the years ahead</p>",
        "id": 153881044,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1491426958
    },
    {
        "content": "<p>Yeah, I followed the interview.  Not sure if he needed to start out talking about hacking/security; he may have been a bit hand-wavy there.  But everything else seemed to align with what was in that blockchain demo the Nucleus folks released; and I wouldn't say anything he wrote was wrong or inaccurate or incorrect.  </p>\n<p>My take away from the interview and having fussed with a blockchain audit log a bit is that the distributed ledger is going to need to be aware of FHIR Endpoint resources.  Which means that Endpoints are going to need to all be standardized; which means people are going to need to conform to a tool like Touchstone or Crucible.  Unfortunately, it doesn't look like Touchstone has tests for FHIR Endpoint yet.</p>",
        "id": 153881144,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1491500189
    },
    {
        "content": "<p>what in endpoint needs to be standardised?</p>",
        "id": 153881161,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491510658
    },
    {
        "content": "<p>The existing schema structure for Endpoint is fine, I'm sure.  But it's the nitty-gritty of making sure that querying <a href=\"http://somewhereintheether.com/fhir-3.0.0/Endpoint/some-hash-i-got-from-a-blockchain-ledger\" target=\"_blank\" title=\"http://somewhereintheether.com/fhir-3.0.0/Endpoint/some-hash-i-got-from-a-blockchain-ledger\">http://somewhereintheether.com/fhir-3.0.0/Endpoint/some-hash-i-got-from-a-blockchain-ledger</a> will successfully return the parameters for an actual endpoint.  Everybody will need to be on the same page on that.  My hunch is that people are basically going to blob tinyurls directly into the blockchain to get all the functionality that's described in the interview.  And Endpoint seems to be the closest resource we have to hydrate a tinyurl into a proper endpoint description.  So, if that's all going to work, we're going to need to make sure that everybody's REST implementations of the Endpoint resource are consistent.  Which means getting in contact with the Touchstone and Crucible folks, and making sure the Endpoint test suites are available.</p>",
        "id": 153881166,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1491512099
    },
    {
        "content": "<p>well, I think that base standard mandates enough consistency, and the testing requirement is not any different to anywhere else</p>",
        "id": 153881172,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491514284
    },
    {
        "content": "<p>Except that the 'anywhere else' for Patient, Practitioner, Organization, AuditEvent etc all include test suites on Touchstone and Crucible, so people can verify conformance to the base standard.  ie. no accidental typos, no PUTs instead of POSTs, etc.  Endpoint doesn't have that.  No test definitions to compare against yet.  There's no sidewalk yet.  </p>\n<p><a href=\"/user_uploads/10155/PL9R7jwwc-s02luQ6p0mPGOx/Screen-Shot-2017-04-06-at-4.36.11-PM.png\" target=\"_blank\" title=\"Screen-Shot-2017-04-06-at-4.36.11-PM.png\">Screen-Shot-2017-04-06-at-4.36.11-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/PL9R7jwwc-s02luQ6p0mPGOx/Screen-Shot-2017-04-06-at-4.36.11-PM.png\" target=\"_blank\" title=\"Screen-Shot-2017-04-06-at-4.36.11-PM.png\"><img src=\"/user_uploads/10155/PL9R7jwwc-s02luQ6p0mPGOx/Screen-Shot-2017-04-06-at-4.36.11-PM.png\"></a></div>",
        "id": 153881174,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1491514630
    },
    {
        "content": "<p>ahh ok. well, I would expect that this will get done as they update more completely for R3 </p>",
        "id": 153881179,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491515135
    }
]