[
    {
        "content": "<p><a href=\"https://blog.andreacoravos.com/where-are-the-healthcare-blockchains-8fcf6a3e28f8\" target=\"_blank\" title=\"https://blog.andreacoravos.com/where-are-the-healthcare-blockchains-8fcf6a3e28f8\">https://blog.andreacoravos.com/where-are-the-healthcare-blockchains-8fcf6a3e28f8</a></p>",
        "id": 153917668,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1509820205
    },
    {
        "content": "<p>And this is just a partial list, with as many more to be announced next year. At least one of them will be optimized around FHIR;-)</p>",
        "id": 153917676,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1509830851
    },
    {
        "content": "<p>The attached HIMMS article IMHO does a pretty good job (in its point #1) summarizing how and why FHIR (itself a decentralized architecture at its heart) and blockchains (of a certain type) are made for each other!  At least, shouldn't we be looking for real projects aimed to prove (or disprove) that case? <a href=\"https://health2con.com/news-iteam/8992/\" target=\"_blank\" title=\"https://health2con.com/news-iteam/8992/\">https://health2con.com/news-iteam/8992/</a></p>",
        "id": 153917682,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1509896919
    },
    {
        "content": "<p>`another interesting piece from HIMSS.  I particularly liked this CMIO's take on FHIR: \"No longer will the enterprise vendors have a near monopoly on innovative ways to use and present health data.\" True enough, at least in principle. Broadened Trust options (at the authentication and authorization layer) will IMO complete health systems' ability to step out further still. <a href=\"http://www.himss.org/news/cmios-perspective-health-20\" target=\"_blank\" title=\"http://www.himss.org/news/cmios-perspective-health-20\">http://www.himss.org/news/cmios-perspective-health-20</a></p>",
        "id": 153917883,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1510001746
    },
    {
        "content": "<p>Thanks for the interesting reads from all of you, and links. It helps to try and form some opinion.<br>\nI stumbled upon this one after reading one of the above (would hate to explain that one to my CEO)<br>\n<a href=\"https://hackernoon.com/yes-this-kid-really-just-deleted-150-million-dollar-by-messing-around-with-ethereums-smart-2d6bb6750bb9\" target=\"_blank\" title=\"https://hackernoon.com/yes-this-kid-really-just-deleted-150-million-dollar-by-messing-around-with-ethereums-smart-2d6bb6750bb9\">https://hackernoon.com/yes-this-kid-really-just-deleted-150-million-dollar-by-messing-around-with-ethereums-smart-2d6bb6750bb9</a></p>",
        "id": 153918752,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1510285790
    },
    {
        "content": "<p>I'm still not seeing the benefit of decentralising the 'permissions and identity management'. All the data is still stored somewhere where it's owned by... something. So I'm able to trade away a central point of control for... lots of central points of control. That sounds like moving the deckchairs around to me. While giving me problems with lack of revocability on my control layer (sounds bad)</p>",
        "id": 153918759,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510290161
    },
    {
        "content": "<p>also, I suspect that there's very few countries where the correlation forces means that there's enough infrastructure to get your data, bit little enough governance that the government doesn't prohibit putting healthcare data on the block chain</p>",
        "id": 153918762,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510293027
    },
    {
        "content": "<p>I went to a blockchain conference yesterday. All the experts were clear that this early days. Caution, but excitement and encouragement to try stuff out. All recognized that there is much misinformation and hype. All recognized anyone using blockchain is taking a big risk. No surprise, we here have all said this too. They are focused on the financial flows (banking, insurance, payments, etc), when pressed it was because these things can be made fully virtual, leverage the fact money is a concept in blockchain, and the biggest problem these flows have is the double-spend problem. The double-spend problem is well addressed in blockchain.  Failure-mode is simply loss of money.</p>",
        "id": 153918855,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510324704
    },
    {
        "content": "<p>So the opportunity comes from use of smart-contracts, and using the blockchain as a public way to advertise availability. Smart-contracts can exist elsewhere, indeed our FHIR Consent and OAuth (UMA) are two examples of smart-contracts. The difference being that a specific chain has a specific smart-contract language, and mechanism to execute that specific language.  So a patient might offer access to their data (which is elsewhere) to anyone that can satisfy a smart-contract they put into a public chain.    Unfortunately this best opportunity is what I described over a year ago given Grahame's original ask  <a href=\"https://healthcaresecprivacy.blogspot.com/2016/05/healthcare-blockchain-big-data.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2016/05/healthcare-blockchain-big-data.html\">https://healthcaresecprivacy.blogspot.com/2016/05/healthcare-blockchain-big-data.html</a></p>",
        "id": 153918856,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510324781
    },
    {
        "content": "<p>I elaborated on that theme <a href=\"https://healthcaresecprivacy.blogspot.com/2017/11/healthcare-use-of-blockchain-thru.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/11/healthcare-use-of-blockchain-thru.html\">https://healthcaresecprivacy.blogspot.com/2017/11/healthcare-use-of-blockchain-thru.html</a></p>",
        "id": 153918897,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510331666
    },
    {
        "content": "<p>I think that makes the intersection of consent, request, availability and oauth ever more interesting</p>",
        "id": 153918926,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510349142
    },
    {
        "content": "<p>Please forgive my ever-elusive references to the forthcoming FHIR®Blocks* Project; but we'll soon be coming forward with a White Paper as well open source code posted to GitHub on a new protocol overlaying OAuth/HEART that we refer to as SMOAC (supplemental method of open access control).  The goal of SMOAC is to provide a decentralized identity and permission fabric (upon HyperLedger FABRIC) that is both extremely secure and trusted as well as enabling of new architectural and business model options. It fully adheres to all of John's proscriptions (e.g., FHIR Resources never touch the FHIRBlockchain, it focuses upon expansionary use of smart contracts, etc); indeed IMHO it could serve to further FHIR's essentially decentralized architecture (by finishing the job of allowing health system IDNs to engage patients directly in the access &amp; control of their own PHI &amp; PII--w/o necessarily relying upon EHR vendor authorization)</p>\n<p>The operative phrase in the last sentence above is <em>\"could serve to further FHIR...\"</em> .  Much work will remain to be done if/when the idea were to get traction within the FHIR community--e.g., as Grahame's observations point out, the use of a permissioned blockchain implies more of an ecosystem governance challenge than a technical breakthrough. All we'll be humbly asking for next month (when we more completely disclose the concept) is that you give it a careful look and consider reviewing the current <em>proof of concept</em> work now underway.  And, if all that pans out, perhaps John could consider taking this idea up in his Security WG?</p>\n<hr>\n<p>*FHIR, of course, is a registered trademark of HL7 Intl</p>",
        "id": 153919801,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1510767003
    }
]