[
    {
        "content": "<p><a href=\"https://medium.com/@preethikasireddy/fundamental-challenges-with-public-blockchains-253c800e9428\" target=\"_blank\" title=\"https://medium.com/@preethikasireddy/fundamental-challenges-with-public-blockchains-253c800e9428\">https://medium.com/@preethikasireddy/fundamental-challenges-with-public-blockchains-253c800e9428</a></p>",
        "id": 153924577,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513109233
    },
    {
        "content": "<p>The 'overall vision' paragraph (#2) in this article is certainly challenging - from a credibility viewpoint...<br>\n<a href=\"https://www.linkedin.com/pulse/why-blockchains-transform-healthcare-bernard-marr/?trackingId=h2mrdoNLEQtbcd0qQfIEMA%3D%3D\" target=\"_blank\" title=\"https://www.linkedin.com/pulse/why-blockchains-transform-healthcare-bernard-marr/?trackingId=h2mrdoNLEQtbcd0qQfIEMA%3D%3D\">https://www.linkedin.com/pulse/why-blockchains-transform-healthcare-bernard-marr/?trackingId=h2mrdoNLEQtbcd0qQfIEMA%3D%3D</a></p>",
        "id": 153928102,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1515483050
    },
    {
        "content": "<p>The overall vision is a useful overall vision for all working in HealthIT. I find nothing new in the article. I guess I should rewash some of my old blockchain articles to get some clicks...</p>",
        "id": 153928125,
        "sender_full_name": "John Moehrke",
        "timestamp": 1515503928
    },
    {
        "content": "<p>IMHO the problem with so many blockchain discussions, particularly healthcare-related ones, is that they aim to disrupt too many extant systems and processes too quickly; thus, they get no real traction. Even FHIR's own heroic efforts to move EHR into the 21st century seem to combat status-quo headwinds that they don't really deserve. That said, a few, more incremental, proposals may slip in a bit earlier than expected.  For example, even as it approaches a normative standard, FHIR will still face inter-EHR interoperability challenges. Could permissioned blockchain-enabled dAAA (decentralized Authentication, Authorization and Administrative domain management extensions upon OAuth2) point  the way to more dynamic, effective and economical HIE?</p>",
        "id": 153928752,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1515937504
    },
    {
        "content": "<p>well, you'd have to explain how the issues that make inter-EHR interoperability a challenge are in any way addressed by a non-tamperable public ledger.</p>",
        "id": 153928761,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515959170
    },
    {
        "content": "<p>I'd be delighted: to take a crack at briefly outlining a way that distributed ledger technology [DLT] may address certain inter-EHR challenges.  <br>\nFirst, we need to stress that the open-source protocol being developed under the banner of FHIRBlocks* directly effects neither PHI nor various other FHIR Resources (e.g., profiles, scopes, contexts, tags, etc).  Rather, it deals with the always-difficult problems of private-virtual AAA (open network authentication, authorization &amp; ddministration) in general and inter-enterprise trust in particular. It starts with privacy &amp; security and moves up through real and perceived end-user confidence, control and engagement.  Specifically, the <em>smart contracts</em> contained within a permissioned blockchain can facilitate, among other things, DLT removal of centralized honeypots (e.g., conventional OAuth2 servers) while directly involving <em>certified self-sovereign</em> end-users themselves in higher-trust authentication, authorization and fine-grained Resource access permissioning/sharing over multiple EHRs, care providers, managers and others.<br>\nI'm afraid that this may be a bit too tightly packed nutshell; but, I'd be happy to elaborate over a more appropriate format at your convenience.          <br>\n<strong><em>_</em></strong>__</p>\n<ul>\n<li>FHIR remains, of course, HL7's registered trademark</li>\n</ul>",
        "id": 153928795,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1515980875
    },
    {
        "content": "<p>Honestly It all sounds like word salad to me. How does it actually work?</p>",
        "id": 153928818,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516009833
    },
    {
        "content": "<p>As I said, it's a bit much to cram into a single paragraph. But, the way it \"actually works\" is this: the OAuth2/OIDC server is virtualized within a permissioned blockchain nominally comprising nodes operated by each participating health systems', or IDNs', EHRs.  Moreover, the peer-to-peer IDNs can then allow their various users to create self-sovereign identities on the blockchain wherein inter-system and multi-user permissions can be irrefutably established. These fine-grained permissions, in turn, operate within <em>smart contracts</em> that are able to generate access tokens available to the permissioned Apps on demand.<br>\nhope that helps</p>",
        "id": 153928870,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516025574
    },
    {
        "content": "<p>So the EHR systems are expected to externalize both their user-identification mechanisms and the logic that determines who's allowed to see what?  That doesn't seem like a near-term winner to me...  I'm also having trouble wrapping my head around the notion of a public ledger of either users or their permissions given that both are private information.</p>",
        "id": 153928882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516032071
    },
    {
        "content": "<p>Lloyd, thanks for the clarifying question &amp; comment.  The aim of FHIRBlocks is NOT to \"externalize user identification [nor authorization/admin] mechanisms.\"  Rather it is to virtualize them on a more secure <strong>private</strong> peer-to-peer/common ledger, thus facilitating inter-EHR interoperability and multi-user collaboration.  Moreover, it's built upon standard OAuth/HEART methods: methods that, left to their own devices, arguably externalize some of these functions  already (but in a demonstrably less-secure manner). Your point on self-sovereign users, empowered to participate directly in the access permissioning process, is also well taken; and IMHO it's a development with interesting implications worth careful consideration in this forum</p>",
        "id": 153928891,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516034810
    },
    {
        "content": "<p>I'm trying to understand what's private from whom.  Who has access to the list of users?  Who controls access to that list?  Who controls access to the permission rules?</p>",
        "id": 153928905,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516041338
    },
    {
        "content": "<p>Good questions Lloyd. <em>Really!</em> Indeed, the nuances between what's permissioned/permissionless vs. what's private/public  vs who can read/write/validate  into a blockchain goes to the heart of a lot of confusion and arguments that are also occurring in other DLT circles.<br>\nFortunately we don't need to resolve all that to begin answering your questions<br>\nThe forthcoming and open-source FHIRBlocks protocol provides for a permissioned (private) blockchain wherein participating IDN nodes validate transactions (e.g., RESTful data transfers and AAA signals) in near real-time and allow IDN-selected App's to <em>read</em> the ledger; and, where/when appropriate, App's can then request JWT access tokens. Apps <em>write</em> to the ledger only for admin/audit purposes (any/all read/write to FHIR servers themselves of course remain under FHIR protocols' control).  Under certain carefully controlled circumstances, Users can both <em>read</em> and <em>write</em> to the common ledger--e.g., to establish certified self-sovereign identities and to participate in the granting and management of 3rd-party access permissions.<br>\nOne last point: in addition to TLS on all data transmissions, Users' PII (outside of any FHIR Patient Resources) is fully psuedonymized and transactions are all hash coded into the DLT<br>\nHope this helps.</p>",
        "id": 153928907,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516042438
    },
    {
        "content": "<p><code>hope that helps</code></p>\n<p>Not really.  Lets start just with users and forget everything else.  Who can write to the chain?  Who can read from the chain?  What can those who can read see?  Who are the trusted parties who \"host\" the chain and thus ensure that we don't need the expense of proof of work?</p>",
        "id": 153928939,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516056084
    },
    {
        "content": "<p>OK. Thanks for helping frame the issues.<br>\nThe actors here are the actual End-Users (patients and/or care-providers represented in this DLT by <em>certified self-sovereign Identities</em>, or CSI's (held within Users' digital wallets); the App running on their mobile devices; the permissioned Blockchain itself; and the FHIR Servers. <br>\nIn order of your questions then...<br>\n1) Apps, bound to and signed by registered CSI's, can  write certain permissions into the Blockchain pursuant to certain interactions with End-Users<br>\n2) Registered App's can read from the Blockchain (to query it for CSI/App-specific permissions) and/or to request access tokens to permitted Resources  (to be remitted to appropriate FHIR Servers)<br>\n3) App's can read CSI-specific permissions (note that CSI's are pseudonymous; thus the App cannot directly identify real names of Users); different App's can also read the Blockchain's Merkle Trees (to review/confirm previous transactions)<br>\n4) Light-weight nodes (that may eventually be integrated into FHIR Servers and/or provided by proxy) within the EHRs and other \"trusted\" peers on the Blockchain, validate transactions using a non-POW consensus protocol (e.g., Linux/HyperLedger's RBFT method)<br>\nLet's keep this Q/A going!</p>",
        "id": 153928950,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516059442
    },
    {
        "content": "<p>Ok.  So each patient and each practitioner needs to have a digital wallet.  Is that like an apple wallet or do they need to install a special app?  You jumped into permissions.  I don't care about permissions yet.  Lets just focus on user identity only.  Is user identity written to the block chain?  By whom?  How is user identity verified?  What information can systems see about users?  Do users need to trust all of the EHRs involved as block-chain validators?  What other \"trusted\" peers do you anticipate and who decides that they are \"trusted\"?</p>",
        "id": 153928973,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516063687
    },
    {
        "content": "<p>Terrific questions...thanks again!<br>\nAs you know, self-sovereign identity mgmt is a complicated topic onto itself; and, for my money (pardon the pun), it may emerge as a more pervasive blockchain App than cryptocurrency itself;-)<br>\nNow, back to your questions...<br>\n1) In fact, our current POC implementation is built entirely upon a forthcoming extension on iOS' UDID PassPort (though Android and Windows equivalents are planned)<br>\n2) There's a <em>smart contract</em> facility in the blockchain that assists the User configure a FHIRBlocks wallet; but, the CSI (identity itself) resides in the wallet (though we're alos planning a uPort-like key/wallet recovery mechanism which could involve DLT- identified \"trusted witnesses\"<br>\n3) Another <em>smart contract</em> facility creates the full equivalent of a client-side <em>digital certificate</em> . It accomplishes this through \"verifying\" interactions with 3rd-party information bureaus working in conjunction with the Health Systems' own MRN (and perhaps FHIR Patient Resources?).<br>\n4) FHIRBlocks expose no personal information to anyone, including EHRs; to the extent to which the App itself is empowered to reveal information is beyond FHIRBlocks' scope<br>\n5) Users need not trust anyone (beyond perhaps their own care providers); indeed, FHIRBlocks could produce detailed reports on resources consumption. Validators validate pseudonymous transactions; thus, they cannot reveal user information that they can't otherwise identify<br>\n6) Other trusted peers could include payers, regulators, CIN/ACO adminstrators, etc. But, again, this is more a governance than a technical question.<br>\nKeep 'em  coming!</p>",
        "id": 153928977,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516064805
    },
    {
        "content": "<p>well, I'll ask then. What would I have to do on the server side to buy into this eco-system?</p>",
        "id": 153929772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516427320
    },
    {
        "content": "<p>As we've discussed previously, there are perhaps larger non-technical/business aspects to these questions: questions that, frankly, we've yet to rejoin fully. And, if I may, I'd like to take a crack at your instant question along with a closely related one.</p>\n<p>First, on the technical side, presupposing the IDN's (or health system's) EHR/IT dept has deployed its own FHIR Adapter (or server), minimal adjustments are required--i.e., to equip it to accept OAuth/FHIR-formatted authorization tokens from an alternative source (in FHIRBlocks architecture, from smart contracts contained in a permissioned blockchain).<br>\nWhere the picture grows a bit more murky is when the IDN/IT staff needs to turn to their legacy vendors to make an adjustment that's not on the vendor's own product roadmap.</p>\n<p>And that, of course, brings me to the second half of my incomplete answer: how does something like FHIRBlocks lay down with various stakeholders' business interests?</p>\n<p>Depends, I think, on the \"stakeholder.\"   To me it's a bit ironic that we have to ask how interested the royal \"we\" <em>really</em> are in broadened <em>interoperability</em> (let alone prospective cost savings). But we do. And it's not unprecedented! Most other vertical industry segments have all gone through their own resistance to shared network economies and full inter-enterprise connectivity. And the friction in that pervasive migration has also always been, more-or-less, the same: Trust (in its multi-layered manifestions) or more-specifically, lack of Trust beyond one's own Administrative Domain. Heathcare's own somewhat higher Trust thresholds have left it somewhat behind the web services/eCommerce curve.</p>\n<p>FHIRBlocks' business bet, then, rests upon three things: first, the demonstrably P2P Trust that permissioned blockchain technology can bring to inter-enterprise networks; second, the superior economics that a common Administrative Domain brings (vis-a-vis centralized hierarchical HIE-like alternatives); all coupled with an exponentially growing pressure to enable inter-EHR application support (e.g., ACO, CRO, CIN, CHR, IoMT, etc)</p>\n<p>FHIRBlocks greatest risk then IMHO has less to do with its technology nor the inevitability of its (or its equivalent) architecture. Rather, like the barons of enterprise networks before it (e.g., SNA, intranet/routers, MNS, etc vendors), the question is how long they can hold the status-quo?  Clearly FHIR's current DTSU state doesn't necessarily demand this natural evolution happen in 2018. But, what about in its post-Noramative Standard state beyond?</p>",
        "id": 153929776,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516458027
    },
    {
        "content": "<p>\" minimal adjustments are required--i.e., to equip it to accept OAuth/FHIR-formatted authorization tokens from an alternative source\" - which are what exactly?</p>",
        "id": 153929786,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516475594
    },
    {
        "content": "<p>on the subject of the economics... it will be a long game...</p>",
        "id": 153929787,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516475613
    },
    {
        "content": "<p>OK.  I'll try to give you as detailed summary as this space allows (if you like, I can also give you direct access to the (private) GitHub Repo for the actual code?)<br>\nFirst, as stated previously, FHIRBlocks has no direct interface to FHIR Apps <em>per se</em>; rather, it assumes that the App's run on User devices and that Resources all remain \"off-chain\" (behind the EHRs' FHIR servers). Moreover, the current implementation builds upon HEART and presumes that the FHIR server has been implemented upon RFC-6749 compliant AOuth2 libraries. <br>\nThat, in fact, could be considered the short answer to your question. But, presupposing that you'd like further detail, here's how FHIRBlocks' SMOAC (Supplemental Method on Open Access Control) works.<br>\nGenerally speaking, the steps are...<br>\n1) Application retrieves the authorization token from an HTTP request to the FHIR Server.   Note that the token has three parts: header, body, and signature<br>\n2) Smart Contract (SC) running within the permissioned FHIRBlocksChain (FBC) validates that the JWT body has been properly signed. This is performed using an ECDSA signing algorithm, and may be validated with the knowledge of the FBC nodes’ public key (each node possess a key)<br>\n3) SC examines the body to determine whether/how to answer the call.   Within the body, are base permission information as well as a Certified Self-sovereign Identity (CSI) of the original grantor of permission.<br>\n4) The body also contains HEART specific information (this is where \"fine-grained permissions\" begins), specifically:<br>\n  a) Which resources are allowed to be accessed: Patient, Encounter, etc<br>\n  b) What level of access to the permissions is allowed:  read/write, both<br>\n  c) The confidentiality level permissioned: this is a HEART specific concept:  refer to that doc for details,  and is one aspect of “fine grained permissioned”<br>\n  d) Which sensitivity levels are permissioned:  things like STD information,  celebrity info, pysch, etc.       <br>\n For further detail, consult HEART docs. The FHIR implementer is left to his own devices, per HEART, to determine how this should be implemented within the App</p>",
        "id": 153930244,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516681054
    },
    {
        "content": "<p>Also, FWIW &amp; IMHO, any number of market and regulatory forces <em>could</em> accelerate inter-EHR FHIR timeframes</p>",
        "id": 153930246,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516681169
    },
    {
        "content": "<p>And anyone with access to the chain would thus have access to the smart chain and thus know what users had what permissions to access which patient's data down to a fine-grained level of detail?</p>",
        "id": 153930255,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516684114
    },
    {
        "content": "<p>Not really.  First, it's a <em>permissioned</em> blockchain ,only registered Users/App's have access to read it; and, only EHR nodes can validate writing.  More importantly, however, is the fact that not only are all transfers double encrypted, self-sovereign user ID's are all pseudonymous; thus, only correspondent end-points can know real identities (and, in some cases, not even they can)</p>",
        "id": 153930261,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516686502
    },
    {
        "content": "<p>so the FHIRBlocks part is actually all private to the AS in the heart scheme? the RS is not related - that's how I read that</p>",
        "id": 153930691,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516887390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194675\">@Doug Bulleit</span> can you clarify which HEART profiles you're building on? (\"vanilla\" OAuth or UMA?) I'm still having trouble following.</p>",
        "id": 153930697,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1516890788
    },
    {
        "content": "<blockquote>\n<p>so the FHIRBlocks part is actually all private to the AS in the heart scheme? the RS is not related - that's how I read that</p>\n<p>Yes, I think (but not sure) we're together; the FHIRBlocksChain (a privately*-configured HyperLedger) does not handle Resources nor does it directly interface the FS. It's all about virtualizing the AS so as to accomplish two things: first to provide for common (inter-EHR) permission management; second, to directly involve \"self sovereign\" patients in establishing certian permissions themselves ( <em>aka</em> self-authorization)</p>\n<hr>\n<p>*There's a somewhat confusing difference between a public/private axis running normal to permissionless/persmissioned. But we can take up teh nuance on the 2x2 that that strikes another time;-)</p>\n</blockquote>",
        "id": 153930805,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516941063
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"194675\">@Doug Bulleit</span> can you clarify which HEART profiles you're building on? (\"vanilla\" OAuth or UMA?) I'm still having trouble following.</p>\n</blockquote>\n<p>Yes, for the time being we're using only standard \"vanilla\" (so far not found much market traction on UMA). Plus, it's also possible that some App Developers my choose to authorize at a very-fine grained Resource-by-Resource level. Current POC supports either, but we still have a lot to learn about how the developer community best meets Patient/IDN/EHR needs</p>",
        "id": 153930806,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516941519
    },
    {
        "content": "<p>ok. so i think I'm getting a feel for it. Why is it called \"FHIRBlocks\"? What's FHIR specific about it?</p>",
        "id": 153930810,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516957849
    },
    {
        "content": "<p>Good question! (As would be <em>`why do we need a blockchain anyway?</em> ) And the answer is that FHIRBlocks <em>would</em> work on any standard and widely accepted API; but, FHIR is likely to be the best (if not the only) game in EHR town.<br>\nWhat FHIR may lack is inter-EHR/multi-user Trust: more specifically, inter-enterprise AAA (authentication, authorization &amp; administration) capabilities. IOW, network Trust that spans multiple <em>administrative domains</em> brings different requirements: functions that ordinary OAuth2/HEART can't accommodate. Thus, a permissioned blockchain can provide a common P2P (in several senses of that word) permissioning and proving platform.</p>",
        "id": 153930816,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516970346
    },
    {
        "content": "<p>And, as I've noted previously, emerging inter-heath-system agenda( e.g., ACOs) could induce earlier adoption of a more inter-enterprise-capable FHIR</p>",
        "id": 153930834,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1516985860
    }
]