[
    {
        "content": "<p>Is or was there an blockchain connectathon track done?</p>",
        "id": 153945102,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1521128109
    },
    {
        "content": "<p>what would it be testing? There has not yet been any use-case that has been clearly identified as combining blockchain and FHIR</p>",
        "id": 153945109,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521128294
    },
    {
        "content": "<p>if you look at my blog, it's conceivable that we could do a connectathon track around using hyperledger for GDPR compliance record tracking, for instance. <em>if</em> we think that there's an interoperability question there - which has not been established.</p>",
        "id": 153945207,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521139790
    },
    {
        "content": "<p>Yes. I read the blog. A colleague of mine is working with hacking health and they were looking for some standard API that exposes healthcare data. I told them I know an example ;-)</p>",
        "id": 153945249,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1521151473
    },
    {
        "content": "<p>They want to try out blockchain icw healthdata. Don't know the details yet, but at least they will use FHIR test-servers to get the data from.</p>",
        "id": 153945250,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1521151506
    },
    {
        "content": "<p>See what they come up with. I also shared your (Grahame) blog.</p>",
        "id": 153945251,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1521151557
    },
    {
        "content": "<p>ok. I'm happy to work with Hacking Health again</p>",
        "id": 153945252,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521153667
    },
    {
        "content": "<p>ProviderDirectory on BigChain would be a far simpler Connectathon using optimized smart contracts.  Hyperledger is a considerably more difficult use case because of generalized contracts; but could be reasonably modeled with Patient, Practitioner, Condition, and either AuditRecord or Consent/Contract (depending on how much people want to dive into OAuth).</p>",
        "id": 153945274,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521163212
    },
    {
        "content": "<p>I'm not sure I follow a business justification for that one...</p>",
        "id": 153945277,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521163758
    },
    {
        "content": "<p>It's just the Clinical Credential Tracking use case you wrote about in your Health Intersections article.</p>\n<p>Every hospital needs an up-to-date copy of the National Provider Directory and which physicians/nurses are certified and credentialed.  It's a ~5GB file that needs to be kept in sync among ~5000 hospitals.  So, ostensibly the same business justification as keeping the National Provider Directory in the first place.  </p>\n<p>Problem being that hospitals wind up with out-of-date data, stale copies of the directory; network partitions and DDosS and other downtime make the ONC copy unavilable; etc.   And yes, with an optimized contract, the use case isn't much different than a synchronized distributed database.  (But that's also exactly the point.)  </p>\n<p>Office of the National Coordinator has been evaluating rollout of the NPD on blockchain.  Talked with Bob Yencha, I think it was, from ONC at 2018 Working Group about it actually.  </p>\n<p>Also, there are the Argonaut Provider Directory clinical scenario and Touchstone test scripts, which means it's an established use case and there are supporting materials.  The major difference being that instead of querying a private centralized directory, one would query a distributed public ledger of credentialed providers.</p>",
        "id": 153945444,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521217572
    },
    {
        "content": "<p>Something like the above is the most likely to result in a successful connectathon...  lots of supporting materials, something that can be done in just 2 days, and it avoids the really complicated question of smart contracts by using a chain built with optimized contracts.  </p>\n<p>That being said, the hyperledger / ethereum chains with smart contracts is where the big interoperability wins would be.  But people would have to dive into the really thorny question of how to design interoperable smart contracts; which mirrors the problem of how to design interoperable legal agreements between states and nations.  It also might dive deep into OAuth architecture.  And I'm simply not sure all of that can be done in a 2 day connectathon.  </p>\n<p>Unless we're talking about the Legal Assurance on Audit Trail use case, the next most talked about use for Hyperledger seems to be tracking ACL permissions via HIPAA Consents and Advanced Directives.  Sandeep Giri has two excellent blog posts which are really relevant on this topic.  </p>\n<p><a href=\"http://blog.hl7.org/hl7_fhir_connectathon16_patientconsent_oauth2\" target=\"_blank\" title=\"http://blog.hl7.org/hl7_fhir_connectathon16_patientconsent_oauth2\">http://blog.hl7.org/hl7_fhir_connectathon16_patientconsent_oauth2</a> <br>\n<a href=\"http://blog.hl7.org/hl7_fhir_connectathon16_patientconsent_oauth2-0\" target=\"_blank\" title=\"http://blog.hl7.org/hl7_fhir_connectathon16_patientconsent_oauth2-0\">http://blog.hl7.org/hl7_fhir_connectathon16_patientconsent_oauth2-0</a></p>\n<p>My guess is that a Hyperledger connectathon track would need to dive into the details of how to put FHIR Consents onto the hyperledger to track OAuth permissions.  Possibly with FHIR Contracts as well.</p>",
        "id": 153945448,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521220129
    },
    {
        "content": "<p>consents within blockchain -- most likely this would be just using the smart-contract language and not using the FHIR Consent. Unless somehow someone was to write a generic smart-contract code that read the terms in a Consent resource.   There have been people who said they could do equivilant of consent rules as blockchain smart contracts... In these cases, this is interesting, but not really FHIR specific. The question still is, are there two or more participants that have implemented something that they want to cross-test at FHIR connectathon, or even prototype. If it is just one party, then it is more of a 'presentation of their solution'...</p>",
        "id": 153945456,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521222586
    },
    {
        "content": "<p>medication supply-chain tracability -- the blockchain use that seems most likely to me is using blockchain to follow the supplychain of medications, from manufacture to dispense. This would leverage the strong work ongoing right now to apply blockchain for this purpose generically to supplychain. Again, the question I have is what is the FHIR relevance, except that the 'supply' identifier can be looked up using FHIR, or the FHIR representation of that manufactured good could be preserved on the blockchain... The big advantage of this: it is something the supplychain industry is looking at, and it is NOT patient data.    Do we have interest from the medication supply chain?</p>",
        "id": 153945457,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521222791
    },
    {
        "content": "<p>Audit log non-repudiation -- I would be interested in seeing how this is mocked up. I don't yet know that it is a legitimate use, but it seems useful to mock up. I don't think it is right to put the AuditEvent onto the blockchain, too likely to have sensitive information. However giving read-only access to a signing service, for the purpose of creating a merkle-tree of signatures, to be preserved occationally in a block on a blockchain, does seem reasonable. Thus each organiation keeps their audits to themselves, exposing only for the purposes of this blockchain signature algorithm. This preserves the sensitivity, while putting evidence that can be used during a dispute for non-repudiation....  Using the non-repudiation mechanism would clearly need to expose the whole log to that which is validating... but that action is only during dispute, and often done in high confidence.</p>",
        "id": 153945460,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521223043
    },
    {
        "content": "<p>provider-credentialiint -- this was also the major use-case given at the big presentation on blockchain at HIMSS by Brian Behlendorf (our friend from the Direct Project days) -- <a href=\"http://www.himss.org/news/potential-blockchain-technology-hit\" target=\"_blank\" title=\"http://www.himss.org/news/potential-blockchain-technology-hit\">http://www.himss.org/news/potential-blockchain-technology-hit</a> -- it was not clear to me how this was proposed to work, but the use-case need and the logic of why blockchain (as a decentralized system ledger) was logical.    Might be fun to figure out the relationship. I would guess that the Provider needs to be fully described so that all parties know that they are attributing evidence to the right human, but that then says that the human is non-privately described.... and when something bad is asserted, they are publicly punished...  even if that assertion is later found to be wrong...   which leads me to believe that no provider would ever subject themselves to this kind of a public ledger</p>",
        "id": 153945461,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521223364
    },
    {
        "content": "<p>Lacuna Health has been interested in and providing resources towards ProviderDirectory on Bigchain/IPDB.  FHIRBlocks is definately interested and contributing resources towards Hyperledger OAuth/Consent/ACL.</p>\n<p>Symptomatic has prototypes for both of the above, and could put together a simple Narcotics Tracking or Organ Donor Lists prototype very quickly (which would be part of the supply chain conversation).  We also have the AuditEvent prototype on Ethereum (but I'm sour on the Ethereum community, and would rather reimplement AuditEvents on Bigchain or Hyperledger).</p>",
        "id": 153945462,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521223391
    },
    {
        "content": "<p>All are good possibilities... what is needed is a number (larger than 1) of participants that are willing to work on it...</p>",
        "id": 153945463,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521223479
    },
    {
        "content": "<p>Understood.  I'm just reporting the &gt;1 feedback I'm getting from non-forum participants.  And listing interested parties, to suggest there are people ready to sit at the table and participate.</p>",
        "id": 153945465,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1521223559
    },
    {
        "content": "<p>While I'm here.. does this make sense for a connectathon:<br>\n- some one sets up a blockchain in the cloud (using hyperledger)<br>\n- read is open, posting requires authentication<br>\n- any FHIR server can post to to if authenticated using some described API<br>\n- we describe some criteria for the kind of information that gets posted to it<br>\n- people can write analytical tools against it</p>",
        "id": 153946994,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521668668
    },
    {
        "content": "<p>all good.. but the big open question is what is posted? This is the critical question. Everything else is just out-of-the-box hyperledger in Permissioned mode. So all you would be testing is hyperledger, not a usecase. This drives the desire to post. This drives the desire to read. This drives the block assembly. This drives the block validation. This drives the smartcontract use..... without this, you are just...   <a href=\"/user_uploads/10155/vFjPR6Lwx_Qctk-VxHpM04nA/20170911_132022.jpg\" target=\"_blank\" title=\"20170911_132022.jpg\">20170911_132022.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/vFjPR6Lwx_Qctk-VxHpM04nA/20170911_132022.jpg\" target=\"_blank\" title=\"20170911_132022.jpg\"><img src=\"/user_uploads/10155/vFjPR6Lwx_Qctk-VxHpM04nA/20170911_132022.jpg\"></a></div>",
        "id": 153947221,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521730226
    },
    {
        "content": "<p>well, my experience is that putting up infrastructure like this drives exactly that question. I agree that's the important question</p>",
        "id": 153947316,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521746540
    },
    {
        "content": "<p>agreed... seems like a reasonable start.</p>",
        "id": 153947483,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521807881
    },
    {
        "content": "<p>so then, should we also then standup another possible storage/communications infrastructure based on Facebook? Or Avian Carrier? Or Pingfs?</p>",
        "id": 153947484,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521808025
    },
    {
        "content": "<p>extending this perhaps: <a href=\"https://en.wikipedia.org/wiki/IP_over_Avian_Carriers\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/IP_over_Avian_Carriers\">https://en.wikipedia.org/wiki/IP_over_Avian_Carriers</a> . ?  Another take on cloud (or in-the-sky) storage?</p>",
        "id": 153947549,
        "sender_full_name": "David Hay",
        "timestamp": 1521830205
    },
    {
        "content": "<p>only if people want</p>",
        "id": 153947556,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521832969
    },
    {
        "content": "<p>given all the computers at FHIR Connectathon, PingFS might work nicely...</p>",
        "id": 153947581,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521837751
    },
    {
        "content": "<p>well, then, if we're going to do it, I nominate some facebook based storage while we can still use facebook</p>",
        "id": 153947593,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521844422
    },
    {
        "content": "<p>So, you don't like my drug supply chain proposal...  From those presented at HIMSS (especially Behlendorf <a href=\"https://twitter.com/johnmoehrke/status/971474144062656512\" target=\"_blank\" title=\"https://twitter.com/johnmoehrke/status/971474144062656512\">https://twitter.com/johnmoehrke/status/971474144062656512</a> ). The only other one that doesn't have patient data on the blockchain (<a href=\"https://twitter.com/johnmoehrke/status/971481728995901440\" target=\"_blank\" title=\"https://twitter.com/johnmoehrke/status/971481728995901440\">https://twitter.com/johnmoehrke/status/971481728995901440</a>) is where Provider information is on the block chain... Clinician Certifications tracking, an augmentation to a Provider Directory. Where the community submits evidence they find on certifications, lack of certifications, good outcomes, and bad out comes.  Thus collaboratively finding the evidence, rather than each Provider Organization needing to do their own investigation, possibly missing critical points.</p>",
        "id": 153947940,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522069571
    },
    {
        "content": "<p>I'm interested in that case, yes. <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> did you investigate this with Da Vinci yet?</p>",
        "id": 153948189,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522090986
    },
    {
        "content": "<p>okay. we could have standalone Provider Directory like we have been doing this far, where blockchain is used for the supporting evidence? Using Provider _id as the linkage between the two worlds.</p>",
        "id": 153948197,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522091996
    },
    {
        "content": "<p>So the blockchain would be Permissioned but Public? That is only a select set of writers and validaters, but everyone can see the content? Or do we want it to be Permissioned and Private? Closed on reads too?</p>",
        "id": 153948200,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522092155
    },
    {
        "content": "<p>Health care groups to use #blockchain to improve provider directory accuracy <a href=\"https://cnet.co/2GswcdH\" target=\"_blank\" title=\"https://cnet.co/2GswcdH\">https://cnet.co/2GswcdH</a></p>",
        "id": 153949889,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522696199
    },
    {
        "content": "<p>do we have any connection to this? It would make sense for them to leverage the VHDir work, no?</p>",
        "id": 153949895,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522697766
    },
    {
        "content": "<p>That would make sense for sure, as the structured data that is stored.</p>",
        "id": 153950065,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1522720221
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194659\">@Daniel Chaput</span> , might be interesting</p>",
        "id": 153950066,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1522720259
    }
]