[
    {
        "content": "<p>someone claimed to me the other day that we don't need OAuth2 because *blockchain*</p>",
        "id": 153877439,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489664955
    },
    {
        "content": "<p>I couldn't make sense of that. Am I wrong? </p>",
        "id": 153877440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489664966
    },
    {
        "content": "<p>What I have seen is the use of blockchain based smart-contracts to enable a third-party (who satisfies the contract terms) to gain access. From what I understand this contract satisfaction is used by an OAuth authorization service to issue a classic OAuth token, that is then used in classic OAuth ways to access the data via http/REST - FHIR. --- This would be a model that would enable the kind of Research advertisement --&gt; use of data. Like I outline in <a href=\"https://healthcaresecprivacy.blogspot.com/2016/05/healthcare-blockchain-big-data.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2016/05/healthcare-blockchain-big-data.html\">https://healthcaresecprivacy.blogspot.com/2016/05/healthcare-blockchain-big-data.html</a>  In this case the http/REST access looks just like we all have been doing with SMART, HEART, or IHE-IUA. Just the pre-authorization step is different, based on a blockchain enforced contract, that is based on blockchain identities, which are public/private key backed.</p>",
        "id": 153877468,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489670386
    },
    {
        "content": "<p>I wouldn't contend that blockchains obviate OAuth. Indeed, depending upon how the blockchain handles its own IAM, its inherent PKI/Hashing methods could be viewed as a material enhancement upon the OAuth2/OIDC framework. But, IMHO, that's only part of the better overall Trust story. And, as John points out, the Smart Contracting capability of more advanced blockchains opens whole new FHIR-app possibilities</p>",
        "id": 153877582,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489710651
    }
]