[
    {
        "content": "<p>A simple decision tree to help you understand when to use block chain:</p>",
        "id": 153921002,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511352156
    },
    {
        "content": "<p><a href=\"http://philippe.ameline.free.fr/wordpress/?p=1979\" target=\"_blank\" title=\"http://philippe.ameline.free.fr/wordpress/?p=1979\">http://philippe.ameline.free.fr/wordpress/?p=1979</a></p>",
        "id": 153921003,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511352160
    },
    {
        "content": "<p>Grahame, <em>much truth passes in jest</em> notwithstanding, the uber-simple decision tree in the above BLOG speaks to widely-held misapprehensions that Blockchains are blockchains are blockchains. Perhaps this diagram would be a little more useful if it depicted one more question/branch reading something like \"Are you creating a cryptocurrency OR  are you trying to solve a real business problem?\" And the subtending branches would then respectively flow toward very different kinds of  <em>permissionless</em> and <em>permissioned</em> blockchains.<br>\nA \"real business problem\" that Decentralized Ledger Technology (DLT, aka, a permissioned blockchain) can be helpful in solving is how Trust can be built within a true P2P ecosystem. Case in point: inasmuch as <em>some</em> (not all) health systems and application providers may be interested in empowering <em>self-sovereign</em> Patients (and/or other end-users) to self-authenticate &amp; authorize access to their own PHI, DLT can be overlayed upon OAuth/HEART to enable more extensible FHIR Resource-enabled uses case and business models.</p>",
        "id": 153921069,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1511374778
    },
    {
        "content": "<p>I posted it here because it's funny. Not serious....</p>",
        "id": 153921135,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511391196
    },
    {
        "content": "<p>That's the way I took it: as \"in jest;-)\"  But, I just couldn't resist the opportunity to take a swing at a serious question that we get  with distressing regularity.<br>\nAnyway, I know that tomorrow is an American holiday: but I'll presume to speak for everyone on this board in voicing thanks for your tireless  thought leadership</p>",
        "id": 153921173,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1511399336
    },
    {
        "content": "<p>yhanks</p>",
        "id": 153921177,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511399665
    }
]