[
    {
        "content": "<p>Hi again, I'm very new to these forums. I cannot find anything regarding persisting FHIR to a noSQL DB like CouchDB.   Is anyone aware of something like this please ?</p>",
        "id": 153956648,
        "sender_full_name": "Danny Marandola",
        "timestamp": 1525717011
    },
    {
        "content": "<p>FHIRBlock is a product... It is not a part of HL7 or FHIR.</p>",
        "id": 153956661,
        "sender_full_name": "John Moehrke",
        "timestamp": 1525718024
    },
    {
        "content": "<p>Ah... thank you John.  That makes more sense.</p>",
        "id": 153956683,
        "sender_full_name": "Danny Marandola",
        "timestamp": 1525721520
    },
    {
        "content": "<p>you could ask the couchdb question on the implementers channel. Generally, there are a number of implementations using CouchDB or equivalent. Some are open source.</p>",
        "id": 153956883,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525758436
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194675\">@Doug Bulleit</span> might want to comment further on fhirblocks</p>",
        "id": 153956884,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525758447
    },
    {
        "content": "<p>Grahame: Thanks for keeping us in mind (though the FHIR*Blocks Project has gone into something akin to a stealth mode pending the announcement of several pilot implementations that we're trying to finalize). And Danny,  I wouldn't call FHIRBlocks a product <em>per se</em> ; rather it comprises a DLT/blockchain protocol that builds on top of FHIR, OAuth2/HEART and others to effect <em>certified self-sovereign identities</em> and an added degree of UMA/interoperability. Indeed the open source repositories of it are in GitHub already but are not yet public (pending permission from several code base contributors and the more illustrative pilot announcement alluded above).  All that said, if you need an earlier view, feel free to reach out and we'll get something arranged.</p>\n<hr>\n<p><em>FHIR is a registered trademark of HL7 and is being used, with HL7 permission, in connection with the above open source FHIRBlocks Project</em></p>",
        "id": 153956928,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1525779881
    },
    {
        "content": "<blockquote>\n<p>Hi again, I'm very new to these forums. I cannot find anything regarding persisting FHIR to a noSQL DB like CouchDB.   Is anyone aware of something like this please ?</p>\n</blockquote>\n<p>There's far greater traction with using MongoDB as a FHIR database.  It's actively being used in data warehouses, blockchains, personal health records, and a number of other applications.  Is CouchDB somehow a hard requirement for you?  If you're simply looking for an object/document oriented database for storing FHIR resources, you'll find a lot more leads with MongoDB.</p>",
        "id": 153962040,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1526487282
    }
]