[
    {
        "content": "<p>John asked me to post here.  I hae another use case for user authorization to address override and electronic signature (not necessarily digital signature) use cases.  Rather than go into long detail, see <a href=\"http://motorcycleguy.blogspot.com/2018/04/additional-smart-on-fhir-authorizations.html\" target=\"_blank\" title=\"http://motorcycleguy.blogspot.com/2018/04/additional-smart-on-fhir-authorizations.html\">http://motorcycleguy.blogspot.com/2018/04/additional-smart-on-fhir-authorizations.html</a> for a detailed description.</p>",
        "id": 153953159,
        "sender_full_name": "Keith Boone",
        "timestamp": 1524146274
    },
    {
        "content": "<p>The question I have about this use-case first starts with understanding the use-case more fully. It is presented purely as a need for secondary confirmation authorization for some individuals submitting data. Where that second level authorization is used to effectively \"Do you really mean to submit that data?\".    What I don't see in the use-case is what the downstream portion of the use-case. Is there expected that 10 years later when that data are looked at, is there a need to have evidence of the secondary authorization step? If so, then Provenance seems to be a critical portion. If Provenance is critical, then the secondary authorization could be included in the first submission with the inclusion of appropriate Provenance in that original submitted Bundle...  Not trying to conclude, just trying to get full use-case understood.</p>",
        "id": 153953164,
        "sender_full_name": "John Moehrke",
        "timestamp": 1524147502
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Yes, there is clearly a need for that as well in the use case.  Provenance is important in this.  I didn't specify how that secondary authorization is captured.  My first thought was about how an App would obtain that authorization <strong>from the user</strong> in a way that was consistent with SMART on FHIR application workflows.  Having obtained it, the next step would be to determine how to include it within a create/update API call where information in question is used.  PUT/POST take a resource, not a bundle, and I would see this as an additional flow that works with existing create/update API so that applications that support additional authorization can succeed where applications that do not, at least can fail gracefully.</p>\n<p>Such a graceful failure occurs today in browsers where if you get a 401 response, the browser has a clue what to do to get the authorization.  This would be a similar case, the user tried to do something that needed further authorization, and the App could have a clue about how to get it.</p>\n<p>In any case, there's clearly a need to flesh this out in much more detail.</p>",
        "id": 153953184,
        "sender_full_name": "Keith Boone",
        "timestamp": 1524149375
    },
    {
        "content": "<p>Coincidentally, we are working on a workflow for this exact problem that leverages the concept of a transactional scope. In short, the RS signals the client that an additional authorization step is required for a particular transaction by returning a 403 error. You can see the full workflow here:<br>\n<a href=\"http://appstudio.interopengine.com/transactional-authorization-for-fhir\" target=\"_blank\" title=\"http://appstudio.interopengine.com/transactional-authorization-for-fhir\">http://appstudio.interopengine.com/transactional-authorization-for-fhir</a><br>\nAny comments or suggestions are welcome!</p>",
        "id": 153953202,
        "sender_full_name": "Luis Maas",
        "timestamp": 1524153325
    },
    {
        "content": "<p>I don't feel great about seeing these things as relationships between the RS and AS, actually. Luis' case is presumably something like transactional authentication for pharmacy dispense (usually done with a physical token) ... but that's exactly why I don't feel great about using the AS: there's nothing inherent in the session that expires - it's a business rule on the transaction.</p>",
        "id": 153953238,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524163581
    },
    {
        "content": "<p>also, note this, which is more like Keith's case:</p>",
        "id": 153953239,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524163646
    },
    {
        "content": "<p><a href=\"#narrow/stream/102-questionnaire/subject/Challenge\" title=\"#narrow/stream/102-questionnaire/subject/Challenge\">https://chat.fhir.org/#narrow/stream/102-questionnaire/subject/Challenge</a></p>",
        "id": 153953240,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524163658
    },
    {
        "content": "<p>it doesn't deal with 3rd party authorizations (that's something else again).... but perhaps it could be extended to deal with confirming identity.</p>",
        "id": 153953241,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524163701
    },
    {
        "content": "<p>I agree with Grahame, but am willing to understand the use-case. I will note that this kind of flow is built into SAML, but is not built into OAuth. So there might be some thinking of the SAML mechanism.</p>",
        "id": 153953243,
        "sender_full_name": "John Moehrke",
        "timestamp": 1524164148
    }
]