[
    {
        "content": "<p>With the \"threat\" of AuditEvent going Normative in R5, there has been a number of critical (in a good way) Change Requests. Some of them are persuasive in ways that I really would like to get critical input from the implementer community.</p>",
        "id": 245308693,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625748988
    },
    {
        "content": "<p>AuditEvent.entity.lifecycle -- this element seems to not be clearly obvious what the use-case is, or how it is to be used. It has a binding to the Lifecycle Event vocabulary. Which is bringing up more concern, as the lifecycle Event vocabulary is about \"Events\" not \"States\". I had historically understood the .lifecycle element would be available to be populated with a state of that entity ---when that state is important to the event.  If this is really intended to be the object lifecycle \"state\", then a very different vocabulary should be given, and likely be just an example set of \"state\" values.<br>\nThe other alternative is to move it to a core extension, like we have done with other elements defined in the IETF / DICOM schema, where the element is not clearly generally needed.</p>",
        "id": 245309173,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625749235
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192546\">@Gary Dickinson</span> -- does the ISO EHR audit specification use the lifecycle element on entity? Or does it just use lifecycle events as a events worthy of recording an auditEvent (i.e. auditEvent.subtype)?  It is pointed out that the use of event vocabulary to describe an object is nonsensical. One might have a set of lifecycle states that could be used this way, but not lifecycle events.</p>",
        "id": 245467381,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625849292
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-32470\">https://jira.hl7.org/browse/FHIR-32470</a></p>",
        "id": 245467566,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625849393
    },
    {
        "content": "<p>John,</p>\n<p>Let’s talk.  I’m not sure I fully understand what you’re asking/suggesting.</p>\n<p>Thanks and Regards,</p>\n<p>Gary</p>",
        "id": 245468014,
        "sender_full_name": "Gary Dickinson",
        "timestamp": 1625849601
    },
    {
        "content": "<p>okay. I must say that I have just this week had an awakening to the distinction of the lifecycle events as events and that this same vocabulary is not properly (or able to be) applied as a state/status indicator. Thus it is feeling like the use of lifecycle events vocabulary in AuditEvent.entity is wrong, while it is still very appropriate that a lifecycle event vocabulary is useful as trigger events and thus AuditEvent.subtype.  Today they are in both places.</p>",
        "id": 245481692,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625856137
    }
]