[
    {
        "content": "<p>Discussion has been going on in HAPI stream on auditing a query, and specifically what action vocabulary to use . Those involved are <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> .. At issue is that today the specification, aligned with the DICOM Audit Event and ATNA, says to use the action \"Execute\" for a things including \"..query/search\".   This is the pattern used in DICOM and IHE for an audit log message when the action was a query or search. This in contrast to what a native REST person would think it would simply be a \"Read\", as \"Execute\" would be for things like $operation.   This REST perspective is logical to me, and if we were starting with no history I would put it this way... BUT there is history of 20 years of ATNA going back to RFC3881. So Although it is unusual for REST perspective, I would like to see it stay the way it is.    I don't see an advantage to changing FHIR in this one way to be different, when there is really no benefit to the change. <br>\ndiscuss...</p>",
        "id": 172214761,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564661600
    },
    {
        "content": "<p>I don't really think that the fundamentals are different - I think we use the words slightly differently, and we could just add clarifying language. FHIR Search - which is sometimes called query - is reading a set of resources that meet some predefined criteria. It's not really a 'query' in that ask the server to figure something out. We do have things like that, and they are E not R</p>",
        "id": 172214869,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564661720
    },
    {
        "content": "<p>so 'Execute' is a catch-all phrase in the scope of computer science, right? Whether you read, manipulate or search or whatever, something is executed to some extent</p>",
        "id": 172215201,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564662004
    },
    {
        "content": "<p>When you search or read or query, something is also executed, but to some extent it qualifies better as a 'read'</p>",
        "id": 172215266,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564662076
    },
    {
        "content": "<p>a Read is pulling an identified resource... A search/query is providing parameters and asking for a set of resources that match the parameters. Hence why historically a query is handled as an execute, because it takes some processing to understand what the results would be</p>",
        "id": 172215385,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564662184
    },
    {
        "content": "<p>so does a read ...depending of scope</p>",
        "id": 172215404,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564662216
    },
    {
        "content": "<p>but I think we are sort of aligned here.</p>",
        "id": 172215468,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564662245
    },
    {
        "content": "<p>Nevertheless, I would mark up 'execute' with operations that does not naturally qualify to other existing terms</p>",
        "id": 172215507,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564662298
    },
    {
        "content": "<p>a read is a search with id = X</p>",
        "id": 172215538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564662344
    },
    {
        "content": "<p>yep</p>",
        "id": 172215541,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564662352
    },
    {
        "content": "<p>I would like to see it changed to better match what is being done</p>",
        "id": 172215655,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564662468
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I see your argument, I just don't buy it</p>",
        "id": 172215792,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564662584
    },
    {
        "content": "<p>The problem is that to change it is to make a breaking change in the alignment with the standards from which it is derived.</p>",
        "id": 172216007,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564662787
    },
    {
        "content": "<p>What is of most value to you/the community. Consistency to the terms or to the standards from which it is derived?</p>",
        "id": 172216219,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564663005
    },
    {
        "content": "<p>the world is not pure FHIR... some audit record repositories will be receiving audit events from ATNA nodes, and some from FHIR nodes... I want the audit messages to be consistently understood.</p>",
        "id": 172216321,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564663085
    },
    {
        "content": "<p>In IHE we have one definition for how to record a security relevant event, and the actor has the choice to record it using historic standards or FHIR.</p>",
        "id": 172216389,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564663143
    },
    {
        "content": "<p>sure</p>",
        "id": 172216416,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564663166
    },
    {
        "content": "<p>and we have a query of the audit record using FHIR AuditEvent API... which returns all audit log events regardless of how they were recorded.</p>",
        "id": 172216524,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564663229
    },
    {
        "content": "<p>still - (disclaimer: strong generalization from my side) most developers =&gt; developers outside the healthcare perspective would probably think of a search as a read operation - not an execution.</p>",
        "id": 172216722,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1564663416
    },
    {
        "content": "<p>well, their audit logs would be recorded... they just might not be seen if a audit log analysis application is overly specific.. and I always remind audit log analysis applications to be very loose with their specifications so as to deal best with dirty data.</p>",
        "id": 172216962,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564663661
    },
    {
        "content": "<p>In the end, the folks the audit most needs to make sense to is patients and care-givers.  Which leads me to side with the \"query = read\" - because that's going to make sense to the person whose data it is.  They could care less about ATNA or other standards.  We break consistency with lots of HL7 standards too and it creates mapping challenges, but we do it when the end result is clearer and cleaner.  I think that's the case here.  \"Execute\" is a pretty poor term because it's all-encompassing - it seems like a generic abstract of all the other operations.</p>",
        "id": 172229389,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564672123
    },
    {
        "content": "<p>I don't think we want to redefine anything. I think we just want to explain what words mean in what contexts</p>",
        "id": 172275819,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564708914
    },
    {
        "content": "<p>The .type and .subtype elements are far more likely to be the ones shown to the user. The .action is just CRUDE. So I think the patient will be well informed... and caregivers are not the target audience of AuditEvent... the Privacy, Security, and Safety office are the target of the AuditEvent. clinicians are the target of Provenance</p>",
        "id": 172315165,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564757751
    },
    {
        "content": "<p>is that policy? or just likely? if it's useless such that we don't care about it, why does it exist?</p>",
        "id": 172345116,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564782573
    }
]