[
    {
        "content": "<p>Why does JSON c14n compress whitespace? I think you'd need to do more to make it emit the same document as <a href=\"https://www.w3.org/TR/xml-c14n11/\">https://www.w3.org/TR/xml-c14n11/</a> .</p>",
        "id": 230819679,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616049659
    },
    {
        "content": "<p>c.f. <a href=\"https://www.hl7.org/fhir/json.html#canonical\">https://www.hl7.org/fhir/json.html#canonical</a></p>",
        "id": 230819710,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616049710
    },
    {
        "content": "<p>It seems like ability to hash a FHIR document itself (rather than some serialization) would outweigh the value of using out-of-the-box c14n tools on the specific representations, especially since it could be autogenerated from the StructureDefinition (invoke a <code>hashThysefl()</code> that visited the hierarchy in the same order as the parsers. In Java, it could be run either off the <code>RuntimeResourceDefintion</code> or just be printf'd code like <code>equalsDeep()</code>.</p>",
        "id": 230820260,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616050235
    },
    {
        "content": "<p>what would you recommend? This is a very immature space, especially with json. Note that the c14n is purely for calculating the signature in a reliable way.</p>",
        "id": 230852309,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616069683
    },
    {
        "content": "<p>i guess some proliferation of c14n methods isn't bad, so long as they have different use cases. all signature protocols that i know of include an identifier for the method so it's not like having more than one leads to ambiguity.</p>",
        "id": 230853325,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616070238
    },
    {
        "content": "<p>i can imagine using XML c14n for XML toolchains, RFC8785 for JSON tool chains and RDF Dataset normalization for RDF</p>",
        "id": 230853785,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616070469
    },
    {
        "content": "<p>the prob is that each of those leaves you in a silo. anyone wanting to test that signature will have to convert to the same format before following the rest of the verification protocol</p>",
        "id": 230853917,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616070518
    },
    {
        "content": "<p>so i like the option i described above where there be a FHIR-based c14n method, which you can use regardless of what serializaition format (if any) your system uses</p>",
        "id": 230854060,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1616070596
    },
    {
        "content": "<p>I added <a href=\"http://jira.hl7.org/browse/FHIR-31566\">FHIR-31566</a> to at least align our JSON canonicalization recommendation with our goals for JSON canonicalization (I'd be interested to know if anyone has implemented them in their current form.)</p>",
        "id": 230867161,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616075809
    }
]