[
    {
        "content": "<p>I'm looking at a use case in which patients are asked in a questionnaire whether they previously gave a particular consent. That is, the patient is not giving (or denying) consent to anything but merely giving information about such a consent being given (or not) in some other context. This information, in itself, does not affect what can or can not be done - the actual consent information (with actual consequences) is, presumably, stored somewhere else.</p>\n<p>As long as it is just a \"raw\" questionnaire answer, that's all no problem. But now I want to map this to an individual FHIR resource and am asking myself which one it should be. One the one hand, this is information about consents to Consent seems the obvious choice. On the other hand, this information is \"one step removed\" and does not constitute a legal/procedural/etc. consent, something that must be clearly communicated so people do not act on it as if it were an actual consent. Which might argue for using another resource, say, Observation.</p>\n<p>Has anyone encountered smt. ike this or have good arguments for one option vs. the other?</p>",
        "id": 273943343,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1646298565
    },
    {
        "content": "<p>Storing it in a Consent makes sense, but you'll need to demarkate it as not a consent for action.  You could mark it inactive/draft, perhaps?</p>",
        "id": 273974529,
        "sender_full_name": "David Pyke",
        "timestamp": 1646315344
    },
    {
        "content": "<p>Yes the Consent resource can be used simply to hold the state of: has the patient been presented with the privacy policy.</p>",
        "id": 273976866,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646316318
    },
    {
        "content": "<p>That makes sense, but the problem is that in my case, I'm not capturing a stage in the lifecycle of a \"real\" (actionable) consent - only the statement that there was such a process (with a certain outcome) elsewhere. Yet the allowed R4 <code>Consent.status</code> codes all seem to refer to this lifecycle, e.g. \"inactive\" is \"The consent is terminated or replaced\" and \"draft\" is \"The consent is in development or awaiting use but is not yet intended to be acted upon\". Neither of those seem to apply to my case . My worry is that using them could leave the false impression that e.g. this is a \"real\" consent that might soon be activated.  (R5 is not an option for me but the situation there seems similar.) Or are the <code>status</code> code description overly narrow?</p>\n<p>To use a FHIR comparison: For medication, there is the workflow sequence MedicationRequest -&gt; MedicationDispense -&gt; MedicationAdministration, but  I need smt. more like MedicationStatement (aka MedicationUsage) that is explicitly outside the sequence.</p>",
        "id": 274088319,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1646377163
    },
    {
        "content": "<p>The meaning of the consent is up to the meaning of the policy the consent points at. If that thing it points at says; \"Privacy Policy was given to patient.\" then that is all that that instance of Consent resource means. Much like a MedicationStatement for a placebo.</p>",
        "id": 274126931,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646400116
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> is there a CR on Consent to add a use-case / example for this kind of Consent? I would be happy to write it up. ( I notice the current build has eliminated the sections on use-cases)</p>",
        "id": 274127447,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646400366
    },
    {
        "content": "<p>Not yet!  Go for it</p>",
        "id": 274128907,
        "sender_full_name": "David Pyke",
        "timestamp": 1646401000
    },
    {
        "content": "<p>given how the other use-cases have been removed from the Consent page, i am not sure how to suggest this use-case be discussed. What was the rational for removing the other use-cases?</p>",
        "id": 274133151,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646402738
    },
    {
        "content": "<p>Some were moved to the P&amp;S page or were felt not to be part of the core need.  Examples can hold use cases.</p>",
        "id": 274133948,
        "sender_full_name": "David Pyke",
        "timestamp": 1646403092
    },
    {
        "content": "<p>Opening a ticket can start a conversation</p>",
        "id": 274133985,
        "sender_full_name": "David Pyke",
        "timestamp": 1646403110
    },
    {
        "content": "<p>ah, the P&amp;S page might be a more informal place. Might even justify specifically a privacy.html page that could discuss all the privacy principles, not just consent.</p>",
        "id": 274134886,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646403552
    },
    {
        "content": "<p>Sounds like a good idea</p>",
        "id": 274134914,
        "sender_full_name": "David Pyke",
        "timestamp": 1646403566
    },
    {
        "content": "<p>the old text on the consent page was mostly intended to make the examples more visible. Alternative would be to give the examples more descriptive names, and have notes on the Consent page pointing to 'various examples'..</p>",
        "id": 274135055,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646403641
    },
    {
        "content": "<p>It would be better if each of the examples explained their use case and how that example illustrates it</p>",
        "id": 274135092,
        "sender_full_name": "David Pyke",
        "timestamp": 1646403672
    },
    {
        "content": "<p>yes</p>",
        "id": 274135135,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646403696
    },
    {
        "content": "<p>All the examples need to be tossed and remade but that's never been high enough on anyone's priorities</p>",
        "id": 274135219,
        "sender_full_name": "David Pyke",
        "timestamp": 1646403726
    },
    {
        "content": "<p>Well, yes the examples should be useful and accurate. they once were.</p>",
        "id": 274135354,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646403814
    },
    {
        "content": "<p>Yep, the whole set needs to be redone.  I have done edits to them periodically but never had the time to redo them from scratch</p>",
        "id": 274136105,
        "sender_full_name": "David Pyke",
        "timestamp": 1646404186
    },
    {
        "content": "<p>Requests for others to do one or two have not been fruitful</p>",
        "id": 274136174,
        "sender_full_name": "David Pyke",
        "timestamp": 1646404204
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Ah right, good point about the policy, that should probably work.</p>\n<p>BTW explained Consent example for different use cases would be worth their virtual weight in gold (many details = many potential devils) - the generations to come will thank you <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 274145900,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1646408076
    },
    {
        "content": "<p>Submissions of use cases with accompanying examples are gleefully accepted</p>",
        "id": 274150232,
        "sender_full_name": "David Pyke",
        "timestamp": 1646409764
    },
    {
        "content": "<p>Touché <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 274359162,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1646639861
    }
]