[
    {
        "content": "<p>I'm looking at the R4 consent - it no longer has a basic policy like Consent.policyRule to which exceptions apply to. If, when I'm processing the R4 Consent, none of the provisions  apply, how do I know whether the default answer is yes or no?</p>",
        "id": 159312274,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551069506
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"192248\">@Alexander Mense</span></p>",
        "id": 159312280,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551069537
    },
    {
        "content": "<p>Also, I'd like to clarify the use of Consent.provision.actor.role - what would the right role be for the person using the restful interface to get information about the patient?</p>",
        "id": 159312372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551069698
    },
    {
        "content": "<p>The .policyRule is still at the root. <br>\nIm not happy about it either.. but the group chose to force all of that into the first provision. So you would put that base policy into the first provision, and nested provisions in provision.provision would be counter access rules, with potential to have provision.provision.provision counter rules to those.     It seems that each provision should have had a .policyRule?</p>",
        "id": 159341797,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551105836
    },
    {
        "content": "<p>The actor.role is a policy decision.  We simply allow for filtering based on that</p>",
        "id": 159351003,
        "sender_full_name": "David Pyke",
        "timestamp": 1551112388
    },
    {
        "content": "<p>Both Consent.policy and Consent.policyRule exist at the root.  Where are you looking to see that it no longer applies or am I reading your comment wrong?</p>",
        "id": 159351201,
        "sender_full_name": "David Pyke",
        "timestamp": 1551112512
    },
    {
        "content": "<p>I want to add that the outcome of evaluating a consent resource against an access request is not necessarily either a yes or a no. It can be neither, as captured by the XACML <code>NotApplicable</code>. Whether or not a <code>NotApplicable</code> eventually results in denying or permitting access depends on the overarching policies and is beyond the scope of an individual consent policy.</p>",
        "id": 159359389,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551119111
    },
    {
        "content": "<p>ok it did not change. But what's a consent engine to do if it runs through the provisions, and none of them apply?</p>",
        "id": 159381379,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551136366
    },
    {
        "content": "<p>and I don't understand the response about actor role - if I'm making a consent statement, but I don't know how to describe what I'm consenting to, how can that work?</p>",
        "id": 159381415,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551136417
    },
    {
        "content": "<p>in that case then that consent doesn't apply... this will happen... a Consent that authorizes a Research project will NOT apply to a Treatment usecase</p>",
        "id": 159381430,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551136435
    },
    {
        "content": "<p>so. that raises question for me... how would a server know what the use case is?</p>",
        "id": 159381602,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551136588
    },
    {
        "content": "<p>I don't believe that we've described that (or any options for that). The nearest we've come is: <a href=\"http://hl7.org/fhir/security-labels.html#break-the-glass\" target=\"_blank\" title=\"http://hl7.org/fhir/security-labels.html#break-the-glass\">http://hl7.org/fhir/security-labels.html#break-the-glass</a></p>",
        "id": 159381625,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551136626
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nAs I mentioned above, in this case the result should be <code>NotApplicable</code>. This is a common case in policy evaluation by an authorization engine.<br>\n\"Grahame Grieve: ok it did not change. But what's a consent engine to do if it runs through the provisions, and none of them apply?\"</p>",
        "id": 159381761,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551136747
    },
    {
        "content": "<p>well, ok. have we defined a way for patient to say anything about the global outcome?</p>",
        "id": 159381908,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551136863
    },
    {
        "content": "<p>actually, I guess, I'm asking whether we've defined anything about whether to stop processing and say that you've found an answer, or whether to keep looking for further exceptions to the rule</p>",
        "id": 159381949,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551136909
    },
    {
        "content": "<p>Within one Consent, one walks all the provisions. When one finds a provision that applies and none of the nested exceptions apply; then that provision (PERMIT/DENY) applies...  The vision that I originally had, which has been slightly upset by the redesign, was to lay the structure of the provisions very similar to XACML. Where in XACML the top most rule is the default that will be enforced if no underlying exceptions apply. This is somewhat how I explained the Consent provisions above.   The main difference I had with XACML is that provisions are nested to show precidence, where in XACML it is an ordered list of rules with the last one stated in the policy-set is the default to use if no previous rule fired. The unknown is how exhaustively one must search the provisions, that is to say, how does one know that a provision applies 'better' than a provision that is listed later. XACML deals with this with ordered rules. <br>\nHow one knows which Consent applies and which ones don't apply at all; likely requires exhaustive search.</p>",
        "id": 159428489,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551191993
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> XACML uses <code>target</code> essentially as a mechanism to index policies/rules to match them against an incoming request. The idea is to have a simple condition (e.g. PoU) based on which rules can be indexed so that a quick scan of that index can narrow down the set of potentially applicable target policies/rules to examine further. More complex conditions are then expressed in the <code>condition</code> element which should be evaluated exhaustively for every matching target rule. <br>\nThis model has been criticized and some have called to deprecate <code>target</code> and only use <code>condition</code> but I think it provides a flexible indexing/look-up mechanism in cases where the number of rules/policies is large. <br>\nIn the case of Consent, I think the patient ID and the date provides a very efficient way to index and narrow down the search space for an incoming request in most use-cases (bulk access could be an exception) so we already have something like <code>target</code>. </p>\n<p>XACML also uses decision-combining algorithms for resolving potentially conflicting decisions from different matching rules/policies and the order-based precedence you mentioned is just one of them. I think the more common ones are <code>deny-overrides</code> and <code>permit-overrides</code>.  Personally, I think this is less complicated compared to the hierarchical rule structure currently defined in the consent resource. I think when we think of expressing access control rules, intuitively we often think of <code>AND/OR</code>-ing  exceptions rather than a deep chain of exceptions to other exceptions. </p>\n<p>Aside from that, I think the most important thing that is missing from the Consent specifications right now is defining the semantics of the rule language in the <code>provision</code> element. It is currently not clearly defined how these rules must be processed and interpreted. I think we should have at least an informal definition for the semantics to answer some of the questions in this thread.</p>",
        "id": 159441523,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551202373
    },
    {
        "content": "<p>Note that we did loose a section on how to interpret the consent -- see this historic <a href=\"http://hl7.org/fhir/2016Sep/consent.html#int\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/consent.html#int\">http://hl7.org/fhir/2016Sep/consent.html#int</a></p>",
        "id": 159442206,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551202982
    },
    {
        "content": "<p>it wasn't great, but it did try to cover some of this.</p>",
        "id": 159442341,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551203076
    },
    {
        "content": "<p>we did explictly not take on all of the complexity of XACML, with th expectation that if someone really needs that complexity then they should use XACML and not .provisions</p>",
        "id": 159442388,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551203113
    },
    {
        "content": "<p>I am certainly interested in the rule language of the provision element. I’m not sure that ‘semantics’ is quite the right word. I want to choose a subset of it, and find a way to have consistent implementations across the RESTful API</p>",
        "id": 159488088,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551251592
    },
    {
        "content": "<p>What I haven’t figured out right now is, I can see how I process a set of provisions in a single Consent resource... but I have a set of resources. Do I have to decide which applicable provision is the narrowest? Can you supersede a consent agreement with an additional one on one specific provision without rendering the entire original consent invalid?</p>",
        "id": 159488143,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551251688
    },
    {
        "content": "<p>the easy answer is: thats policy... but I expect that you do need to exhaustively process all consents. Usually we recommend that harmonization of a set of consents should be done when consents are created/updated; so that processing consents in real-time are not burdened. This sometimes results in a policy that allows only one consent, thus finding more than one is a policy failure.</p>",
        "id": 159519600,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551278131
    },
    {
        "content": "<p>In our preliminary demo, the Consent Decision Point would look at all the consents applicable to a patient and then use a <code>most-recent-overrides</code> strategy for resolving any potential conflicts. This implementation would still needs to fetch and parse all the Consents for the given patient before being able to determine whether the Consent is applicable to the current access request (because the patient may have different consents focused on different purposes, organizations, etc.) One area I think we can improve and elaborate in an implementation guide is how to use search parameters to narrow this down so a more precise set of applicable Consents is fetched, parsed, and examined.</p>",
        "id": 159558090,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551305950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span> what is \"all the consents applicable to a patient\"?</p>",
        "id": 159739285,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551466691
    },
    {
        "content": "<p>just checking because it reads similarly to \"purpose\" and I am always afraid that we use consent for purpose.</p>",
        "id": 159740071,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551467314
    },
    {
        "content": "<p>This was a simple query based on <code>Consent.patient</code> which would return all the consents applied to the given patient. I agree that this query can definitely improved to filter out consents with other purposes etc.</p>",
        "id": 159754519,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551478792
    }
]