[
    {
        "content": "<p>Kantara has a summer project. It is not Healthcare or FHIR specific, but certainly could be a foundation upon which healthcare and FHIR rely for certain parts of Patient Privacy Consent.</p>\n<p>In this new work stream the consent receipt is being updated in content and name in accordance with the new ISO standards and drafts as a Notice Receipt (NR). The consent receipt work was written over the last 5 years and is included as an Appendix B in the ISO 29184 Online Privacy Notices and Consent standard, which was just published in June 2020.   The work will align with  this standard and the consent receipt work in the ISO SC 27 which has announced the 27560 Consent Record Information Structure which complements ISO 29184.  The information structure in the Consent Receipt (CR) v1.1 is the starting point.   </p>\n<p>Our summer project will take the need for Digital Ledger Consent (DLC) as a touchstone use case for what we are referring to as the Notice &amp; Consent Project Reference Implementation.  It will build on the existing ISO/Kantara standards (Consent Receipt 1.1 and ISO 29184) as a contribution for the next drafts and eventually the ISO 27560 Consent Record Information Structure standard.  It doing so we plan to evolve the CR 1.1 to Notice Receipt (NR) 1.2 and then NR 1.3. We than plan to share the NR as a Kantara Specification and then make then available to the wider consent and notice ecosystem.</p>\n<p>We are going to make a push to put into place this work as the basis for new global standards and technologies with a reference implementation that works across and is consistent with global notice and consent efforts.  A first set of outputs will take place by July 10th (see timeline below).  We then plan to host a mid-summer workshop to  introduce these on July 15th.  Following on the workshop we plan to publish as a specification a notice structure that can be used in the DLC reference implementation.   </p>\n<p><a href=\"https://kantarainitiative.org/confluence/pages/viewpage.action?pageId=129565634\">https://kantarainitiative.org/confluence/pages/viewpage.action?pageId=129565634</a></p>",
        "id": 201268377,
        "sender_full_name": "John Moehrke",
        "timestamp": 1592487421
    },
    {
        "content": "<p>Oh dear, we've lost him.  He's now a Blockchain lover.  Send donations to \"Blockchainers Anonymous\"</p>",
        "id": 201268665,
        "sender_full_name": "David Pyke",
        "timestamp": 1592487569
    },
    {
        "content": "<blockquote>\n<p>Oh dear, we've lost him. He's now a Blockchain lover. Send donations to \"Blockchainers Anonymous\"</p>\n</blockquote>\n<p>Let me fix that:<br>\nOh dear, we've lost him.  He's now a Consent lover.  Send donations to \"Consent Lovers Anonymous\"</p>",
        "id": 201269643,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592488010
    },
    {
        "content": "<p>Consent is a good thing.  Blockchain?  Well..</p>",
        "id": 201272395,
        "sender_full_name": "David Pyke",
        "timestamp": 1592489245
    },
    {
        "content": "<p>I see little conflict here. A verifiable statement of consent / dissent seems very useful. When the terms of the agreement are not sensitivity exposing, it seems perfectly legitimate to be in a blockchain.</p>",
        "id": 201295401,
        "sender_full_name": "John Moehrke",
        "timestamp": 1592498976
    },
    {
        "content": "<p>I also see blockchain as a legitimate Provenance Service... as long as sensitive nature can be prevented, and I think there is hope there too.</p>",
        "id": 201295592,
        "sender_full_name": "John Moehrke",
        "timestamp": 1592499045
    },
    {
        "content": "<p>now, I am still strongly believing that blockchain is overkill, slow, inefficient, and dangerous for these use-cases.. but if we don't try, we will never succeed</p>",
        "id": 201295682,
        "sender_full_name": "John Moehrke",
        "timestamp": 1592499091
    },
    {
        "content": "<p>If it's slow, inefficient, and dangerous...why use it?</p>",
        "id": 201353345,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1592543879
    },
    {
        "content": "<p>$$</p>",
        "id": 201356177,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592547531
    }
]