[
    {
        "content": "<p>Since this came up a few times in other threads and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  alluded to it again in the conversation today, I wanted to bring this to everyone's attentions in a separate thread. <br>\nI think by adding a <em>combining</em> or <em>conflict resolution</em> strategy, the current nesting <code>provision</code> structure in the Consent resource can be simplified to a flat array instead of the nested structure. Here are some arguments in favour of this:</p>\n<ul>\n<li><strong>Simpler and more Intuitive Semantics:</strong> A flat structure is easier to understand and corresponds better with the way we usually articulate policies and preferences (e.g. checkboxes in a form). Nested provisions deeper than two levels are too hard to follow to correspond to a user interface like a form and using them to model complicated policies soon leads to mental gymnastics which uses the nesting to implement something that can most likely be modelled in a simpler way. Single-layer nesting (\"general rule... except...\") which seems to be the only form realistically corresponding to real use-cases can easily be flattened into an array [general rule, exception rule] together with a suitable <code>deny-override</code> or <code>permit-override</code> conflict resolution strategy. </li>\n<li><strong>Existing best practice:</strong> two most notable existing authorization/rights language, XACML and ODRL use this strategy. XACML defines <a href=\"http://docs.oasis-open.org/xacml/3.0/xacml-3.0-core-spec-cd-1-en.html#_Toc229296445\" target=\"_blank\" title=\"http://docs.oasis-open.org/xacml/3.0/xacml-3.0-core-spec-cd-1-en.html#_Toc229296445\">decision combining algorithms</a> to be associated with a policy to adjudicate possible conflicting outcomes from individual rules. Similarly, ODRL defines a <a href=\"https://www.w3.org/TR/odrl-model/#conflict\" target=\"_blank\" title=\"https://www.w3.org/TR/odrl-model/#conflict\">policy conflict property</a> to adjudicate any disagreements between the set of permissions and prohibitions in a policy. </li>\n<li><strong>Implementation:</strong> Having an array of provisions with a combining/conflict resolution strategy fits perfectly with the <em>map</em> and <em>reduce</em> processing model common in most modern programming languages. This makes the logic for evaluating the provisions straightforward, i.e. <em>map</em> each rule to a decision and then <em>reduce</em> based on the combining strategy. Nested provisions in contrast are arguably more complicated to implement and understand.</li>\n</ul>",
        "id": 160056411,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551833821
    },
    {
        "content": "<p>The simplification message got a bit complicated at the end there but I was feeling good about it to that point</p>",
        "id": 160058495,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551836378
    },
    {
        "content": "<p>the and/or thing scares me; I know how that has played out elsewhere (e.g. value sets). Bad enough for programmers let alone general public.</p>",
        "id": 160058558,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551836413
    },
    {
        "content": "<p>I like where this is going, and have very much been against the infinite nesting concept. But I am not clear on what it would look like. I think what you are describing is one  repetition of something like .provision, with a combining rule for combinging repetitions, and within each provision one can have one layer of exceptions to that provision? Thus the root .provision goes to 0..*, remove the infinite .provision.provision, add in a provision.exception.</p>",
        "id": 160094510,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551878668
    },
    {
        "content": "<p>Here is an example of what I mean. The <code>provisions</code> element includes one property for combining strategy and an array of provisions (each of which more or less follows the form of the existing provision element in the Consent resource minus the nesting). <br>\nFor example the following means access is granted by default except for the purpose of research.</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"s2\">&quot;provisions&quot;</span><span class=\"err\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">&quot;combine&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;deny-override&quot;</span><span class=\"p\">,</span>\n    <span class=\"nt\">&quot;provision&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n        <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;type&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;permit&quot;</span>\n        <span class=\"p\">},</span>\n        <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;type&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;deny&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;purpose&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;research&quot;</span>\n        <span class=\"p\">}</span>\n    <span class=\"p\">]</span>\n<span class=\"p\">}</span>\n</pre></div>\n\n\n<p>In essence, this is (almost) semantically equivalent to a simplified XACML policy (without support for obligations, complex conditions, and <code>AnyOf</code> and <code>AllOf</code> match types).</p>\n<p>I think the <code>combine</code> attribute should be <code>0..1</code> so that it can be skipped when the <code>provision</code> element contains only a single provision –and therefore no combining is necessary.</p>",
        "id": 160117506,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551894421
    },
    {
        "content": "<p>At that point, using XACML is far more efficient.</p>",
        "id": 160118140,
        "sender_full_name": "David Pyke",
        "timestamp": 1551894874
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>  I agree. I think as much as we should keep the provisions simple and avoid re-inventing XACML or ODRL, it is also appropriate to keep this model close to these existing best practices so that <br>\na) we don't re-invent a completely different authorization language, and <br>\nb) people who use <code>provision</code> for simple use-cases can smoothly switch to more complex authz/rights languages without a lot of cognitive overhead as/when their requirements get more complex .</p>",
        "id": 160118864,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551895409
    },
    {
        "content": "<p>sorry for out-of-context question, but is this discussion really specific for consent? or is it related to permission for using data (which imo may be consent or something else)?</p>",
        "id": 160130867,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551903646
    },
    {
        "content": "<p>Permission (from the patient) to use data is the use case for patient-privacy consent.  If this isn't patient based, then it's something else.</p>",
        "id": 160131021,
        "sender_full_name": "David Pyke",
        "timestamp": 1551903733
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> this thread is specifically about the structure of the <code>provision</code> element in the <code>Consent</code> resource.</p>",
        "id": 160131034,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551903749
    },
    {
        "content": "<p>in other words, do we expect to have a resource for \"permission to use data\" (currently handled by security labels), and when we do, will the same discussion apply?</p>",
        "id": 160131065,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551903774
    },
    {
        "content": "<blockquote>\n<p>Permission (from the patient) to use data is the use case for patient-privacy consent.  If this isn't patient based, then it's something else.</p>\n</blockquote>\n<p>don't understand \"it's something else\" - do you mean \"this discussion does not apply\"?</p>",
        "id": 160131209,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551903865
    },
    {
        "content": "<p>if so, i am good.</p>",
        "id": 160131216,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551903872
    },
    {
        "content": "<p>This discussion is specifically around the stucture of the Consent resource which is based around patient-granted consent.  For other forms of permission, security labels is the basics of what you're looking for</p>",
        "id": 160131290,
        "sender_full_name": "David Pyke",
        "timestamp": 1551903940
    },
    {
        "content": "<p>ok. just asking for a friend who does GDPR :) (where we could end up needing something elaborate, and imo consent is not a safe ground)</p>",
        "id": 160131418,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551904033
    },
    {
        "content": "<p>thanks and sorry for distracting.</p>",
        "id": 160131423,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551904043
    },
    {
        "content": "<p>No, that's no problem.  In fact there is a project to review FHIR and GDPR.  You may want to look here and join in <a href=\"https://confluence.hl7.org/display/SEC/FHIR+-+GDPR\" target=\"_blank\" title=\"https://confluence.hl7.org/display/SEC/FHIR+-+GDPR\">https://confluence.hl7.org/display/SEC/FHIR+-+GDPR</a></p>",
        "id": 160131508,
        "sender_full_name": "David Pyke",
        "timestamp": 1551904085
    },
    {
        "content": "<p>We meet Mondays at 12PM ET</p>",
        "id": 160131552,
        "sender_full_name": "David Pyke",
        "timestamp": 1551904127
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>  and <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>. I'm going to re-up the last couple of posts to resume where we left off with the original topic.</p>",
        "id": 160137250,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551908537
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span>: Here is an example of what I mean. The <code>provisions</code> element includes one property for combining strategy and an array of provisions (each of which more or less follows the form of the existing provision element in the Consent resource minus the nesting). <br>\nFor example the following means access is granted by default except for the purpose of research.</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"s2\">&quot;provisions&quot;</span><span class=\"err\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">&quot;combine&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;deny-override&quot;</span><span class=\"p\">,</span>\n    <span class=\"nt\">&quot;provision&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n        <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;type&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;permit&quot;</span>\n        <span class=\"p\">},</span>\n        <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;type&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;deny&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;purpose&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;research&quot;</span>\n        <span class=\"p\">}</span>\n    <span class=\"p\">]</span>\n<span class=\"p\">}</span>\n</pre></div>\n\n\n<p>In essence, this is (almost) semantically equivalent to a simplified XACML policy (without support for obligations, complex conditions, and <code>AnyOf</code> and <code>AllOf</code> match types).</p>\n<p>I think the <code>combine</code> attribute should be <code>0..1</code> so that it can be skipped when the <code>provision</code> element contains only a single provision –and therefore no combining is necessary.</p>\n<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>: \"At that point, using XACML is far more efficient.\"</p>\n<p><span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span>: I agree. I think as much as we should keep the provisions simple and avoid re-inventing XACML or ODRL, it is also appropriate to keep this model close to these existing best practices so that <br>\na) we don't re-invent a completely different authorization language, and <br>\nb) people who use <code>provision</code> for simple use-cases can smoothly switch to more complex authz/rights languages without a lot of cognitive overhead as/when their requirements get more complex .</p>",
        "id": 160137254,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551908541
    },
    {
        "content": "<blockquote>\n<p>ok. just asking for a friend who does GDPR :) (where we could end up needing something elaborate, and imo consent is not a safe ground)</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> the Consent resource is intended to cover the larger scope that you are asking about.</p>",
        "id": 160142888,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551909745
    },
    {
        "content": "<p>I hope that we can cover basic privacy authorizations in the Consent. More complex use-cases should be expected to leverage more comprehensive rules languages like XACML, where the Consent resource is still available to provide the linkage reference. This said, what we need to determine is what level of basic rules are worthy of doing in a FHIR specific way, and what is the line where the need is more complex? I have high hope that the set of basic rules is near 80% (ish) of the overall need.  If it is only at the 20% of the overall need, then we should abandon all expectation that we can do something in a FHIR way for privacy rules.</p>",
        "id": 160144336,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551909989
    },
    {
        "content": "<p>I agree with all the points about expressiveness and the pareto principle, but to clarify, the rationale for this proposal (i.e. flattening the recursive provisions) is not to increase expressiveness. I don't think making the structure a flat array will enable the consent resource to model more complex rules and in fact (without having done any formal semantics comparison) I suspect that the expressiveness remains more or less the same should this change take place.<br>\nThe rationale behind the proposed change is to avoid the infinite nesting in order to:<br>\n- make the provisions simpler to understand and more intuitive.<br>\n- use a more similar approach to existing best practices of authz/rights policy languages.<br>\n- stay closer to existing authz/rights languages so that transition of policies from(to) those languages to (from) consent provisions is smooth and easy to follow.<br>\n- make it easier for implementers to understand and write the processing logic for provisions.</p>",
        "id": 160148924,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1551912863
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> i do not think a resource called \"consent\" should convy anything other than \"a healthcare consumer’s choices, which permits or denies\".</p>",
        "id": 160171927,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551938214
    },
    {
        "content": "<p>from GDPR view, consent must be free and explicit. which in healthcare it is not really a given.</p>",
        "id": 160171943,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551938261
    },
    {
        "content": "<p>i am not a lawyer, but a patient's frail condition can be argued to be why a consent in healthcare may not be freely given</p>",
        "id": 160172019,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551938356
    },
    {
        "content": "<p>Personally, if I go to a hospital and I get a paper that says \"sign here and we will use your data to make money out of pharma industry or lab results\" i will gladly sign it just to see a physician.</p>",
        "id": 160172022,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551938365
    },
    {
        "content": "<p>that is about consent, and why i think it is a very valid resource but hospitals need to support GDPR and they will typically not do it via consent.</p>",
        "id": 160172079,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551938404
    },
    {
        "content": "<p>they will do it via a valid purpose for processing.</p>",
        "id": 160172106,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551938449
    },
    {
        "content": "<p>this is why i did not feel i would be very hopeful in discussions around consent.</p>",
        "id": 160172174,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551938530
    },
    {
        "content": "<p>If the discussion is about \"how do we capture the processing of data, the corresponding purposes and lawfulness\", then my experience may be helpful.</p>",
        "id": 160172215,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551938623
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> you keep bringing this up.. what is your alternative for the scope that we have been asked to cover? Note that the scope is beyond privacy consent, we are also asked to cover medical treatment consent, research consent, etc.. This word 'Consent' is understood globally to cover these cases. I don't disagree with you at all that in Principle Consent must be informed and given freely. I don't disagree with your GDPR perspective. We even cover these differences in the spec and papers.  However we are at the technical level, not at the politics or ethics side of the argument.  I would move very quickly to a different name than Consent if you offer a useful one.  Picking a Resource name is hard, and a community effort.</p>",
        "id": 160196279,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551965012
    },
    {
        "content": "<p>Note that Consent can be used 100% compliant in GDPR environments. There is no way to make a standard that can't be used illegally, but we have done everything possible to make it able to be used legally.</p>",
        "id": 160199532,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551967660
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Consent means consent, which means \"consent to share data\" or \"consent to operate\", or \"consent to visit\".... and i do not want to change anything there.</p>",
        "id": 160208526,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973310
    },
    {
        "content": "<p>We have talked in the past about the potential need for a DataAccess resource which, either the Consent would be a user or would be a possible profile on Consent.</p>",
        "id": 160208643,
        "sender_full_name": "David Pyke",
        "timestamp": 1551973380
    },
    {
        "content": "<p>I am just not sure our GDPR requirements are clear.</p>",
        "id": 160208663,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973393
    },
    {
        "content": "<p>I think i will write something. From GDPR perspective, the notion of consent does not solve much of GDPR (IMO, it solves very little because of \"consent must be free\"..). It does not mean cosnent is useless or incompatible for GDPR - if I gave that impression, I apologize</p>",
        "id": 160208784,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973500
    },
    {
        "content": "<p>You mean \"data access\" a profile of Consent? That does not compute</p>",
        "id": 160208825,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973539
    },
    {
        "content": "<p>You can already extend the scope of Consent for non-patient based data use.  So, creating a specific profile on consent with a new use case is easily done</p>",
        "id": 160208915,
        "sender_full_name": "David Pyke",
        "timestamp": 1551973594
    },
    {
        "content": "<p>so, we would profile Consent for other data access?</p>",
        "id": 160208938,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973623
    },
    {
        "content": "<p>that i do not understand.</p>",
        "id": 160208974,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973656
    },
    {
        "content": "<p>You can look at the Australian HPD use case.  They're using consent for provider directory data.  Creating a use case and model of what you want we can work to make it part of a profile or scope addition</p>",
        "id": 160209097,
        "sender_full_name": "David Pyke",
        "timestamp": 1551973741
    },
    {
        "content": "<p>Sorry for distraction, but my point is simple - consent is not sufficient to cover GDPR. The other things we need are not consent-related, and if we profile consent to cover those other things, this is not something that I would like to see.</p>",
        "id": 160209124,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973768
    },
    {
        "content": "<p>And that's being reviewed as part of the Security Work Group GDPR project that I linked to earlier.  You really should have a look at that and join the weekly calls</p>",
        "id": 160209221,
        "sender_full_name": "David Pyke",
        "timestamp": 1551973826
    },
    {
        "content": "<p>I will write something down in terms of GDPR requirements for discussion.<br>\nFor now, i just wanted to see if we are using Consent for any kind of consent(as in agreement), or if we are trying to make Consent fit into GDPR uses.</p>",
        "id": 160209310,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973902
    },
    {
        "content": "<p>We have done considerable work on GDPR requirements.  Please have a look at the <a href=\"https://confluence.hl7.org/display/SEC/FHIR+-+GDPR\" target=\"_blank\" title=\"https://confluence.hl7.org/display/SEC/FHIR+-+GDPR\">https://confluence.hl7.org/display/SEC/FHIR+-+GDPR</a></p>",
        "id": 160209434,
        "sender_full_name": "David Pyke",
        "timestamp": 1551973964
    },
    {
        "content": "<p>i need to write something down first, because otherwise it would be a debate without requirements, which would be less efficient.</p>",
        "id": 160209439,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551973966
    },
    {
        "content": "<p>Also: <a href=\"https://docs.google.com/spreadsheets/d/1--6HKnMY7QCqsorpJXdgIm9lC-MJ-O_qIPTcjPdUGKg/edit#gid=0\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/1--6HKnMY7QCqsorpJXdgIm9lC-MJ-O_qIPTcjPdUGKg/edit#gid=0\">https://docs.google.com/spreadsheets/d/1--6HKnMY7QCqsorpJXdgIm9lC-MJ-O_qIPTcjPdUGKg/edit#gid=0</a></p>",
        "id": 160209483,
        "sender_full_name": "David Pyke",
        "timestamp": 1551973989
    },
    {
        "content": "<p>I know, and I have done conseiderable work in implementing GDPR, so I just want to help, even if I ask strange questions.</p>",
        "id": 160209498,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551974007
    },
    {
        "content": "<p>We would love your input.  Please have a look and join the calls</p>",
        "id": 160209518,
        "sender_full_name": "David Pyke",
        "timestamp": 1551974027
    },
    {
        "content": "<p>and yes, I will catch up, perhaps things have changed since last time i saw the docs.</p>",
        "id": 160209595,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551974062
    },
    {
        "content": "<p>Thanks</p>",
        "id": 160209596,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1551974063
    }
]