[
    {
        "content": "<p>The <code>Consent.provision</code> is defined as <em>An exception to the base policy of this consent. An exception can be an addition or removal of access permissions</em>. The description for <code>Consent.provision.type</code> indicates that it should specify a <em>permit or deny - when the rule conditions are met. Not permitted in root rule, required in all nested rules</em>.</p>\n<ul>\n<li>Does <em>root rule</em> here mean the root Provision? If this means that the root <code>provision</code>must not have a type, some of the Consent examples  (e.g., <a href=\"https://www.hl7.org/fhir/consent-example-notOrg.json.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/consent-example-notOrg.json.html\">this one</a>) do not conform to this constraint.</li>\n<li>Moreover, how must one interpret a base policy of<code>OPT-IN</code> (per <code>policyRule</code> attribute) with a root provision  without a <code>type</code>? How is this exception to the general opt-in must be interpreted? Is it implied that the the provision is describing a set of conditions to deny? If <code>type</code> is implied to be the opposite of the outer element, then why do we need it at all?</li>\n</ul>\n<p>I think the language and examples around the provisions needs some clarification and improvement, perhaps a diagram that can demonstrate the relationship between <code>policyRule</code>, root <code>provision</code> and the nested provisions (which also makes me wonder why there is a <code>policyRule</code> and why the root <code>provision</code> is not used to record what <code>policyRule</code> is capturing to simplify the model).</p>\n<p>I am happy to contribute the CRs if we can clarify the semantics here.</p>",
        "id": 186596574,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1580001161
    },
    {
        "content": "<p>We would appreciate your input into clarifying.  If you will be at the WGM, we can discuss it there, otherwise, please put in a CR and we can discuss it after the WGM</p>",
        "id": 186624463,
        "sender_full_name": "David Pyke",
        "timestamp": 1580049708
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> I am happy to put in some CRs but wanted to make sure I understand the intentions and nuances behind the current structure (I'm hoping maybe <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> clarify some of the questions I raised as he has done before). <br>\nI will definitely put together some CRs to add diagrams, clarifications, and hopefully fix any non-conforming example.</p>",
        "id": 186644292,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1580083873
    },
    {
        "content": "<p>I am not a fan of the current model with a zeroth provision as a context setting ... I have argued against this model since it first happened. The context setting should be root elements, with the provisions starting with exceptions to that context. As it stands, I think that the model sets up the zeroth provision as nothing more than setting the context. Thus it is most clear when the policyRule is a policy written in PERMIT terms. Thus the current discussion about what it means to have a policyRule that is negative (e.g. OPT-OUT) with a root provision of PERMIT? I would far prefer we go back to separation of context setting, from rules.</p>",
        "id": 186648550,
        "sender_full_name": "John Moehrke",
        "timestamp": 1580092059
    },
    {
        "content": "<p>Your objections have been noted.  Thank you for your input.</p>",
        "id": 186679000,
        "sender_full_name": "David Pyke",
        "timestamp": 1580130030
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . <br>\nDo you think our effort should be focused on clarifying the existing semantics by adding more documentation and fixing the examples, or should we focus on improving the model based on John's concerns and mine? Depending on what direction we lean towards, I will start working on CRs and will report here.</p>",
        "id": 186697438,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1580141904
    },
    {
        "content": "<p>John's concerns have been discussed and we have decided to not restructure the model.  Please focus on the documentation</p>",
        "id": 186699206,
        "sender_full_name": "David Pyke",
        "timestamp": 1580142952
    },
    {
        "content": "<p>everyone is free to enter their concerns as Change Requests. That my concerns have been dismissed should not prevent others from bringing up their concerns. This resource is FMM 2, so it should be considered very open to change</p>",
        "id": 186889464,
        "sender_full_name": "John Moehrke",
        "timestamp": 1580307911
    },
    {
        "content": "<p>We certainly accept CRs and encourage them.  However, as we're shooting for Normative for R5, we are carefully considering breaking changes.</p>",
        "id": 186889905,
        "sender_full_name": "David Pyke",
        "timestamp": 1580308253
    },
    {
        "content": "<p>THAT is not governance for FMM2. That is the governance that kicks in at FMM5.</p>",
        "id": 186889979,
        "sender_full_name": "John Moehrke",
        "timestamp": 1580308314
    },
    {
        "content": "<p>I didn't say we were not accepting breaking changes, just carefully considering them.  They will need a strong case before they're accepted simply because we don't want to refactor everything because someone doesn't like the current structure</p>",
        "id": 186890481,
        "sender_full_name": "David Pyke",
        "timestamp": 1580308625
    },
    {
        "content": "<p>It's not a question of \"like\", it's a question of \"does it work\" and \"is it as easy to use/understand as we can make it\"?  I would be surprised to see Consent on the normative track for R5 because I haven't seen it in nearly the same level of widespread use that most of the other resources being contemplated for Normative are (e.g. AllergyIntolerance, Condition, Procedure, Practitioner, etc.)  Changes should be evaluated based on their merits, not based on a work group's preferred timelines for maturity progression.  If the resource currently meets the criteria for level 4 or 5, the work group can certainly solicit implementer feedback about a proposed change using the established mechanisms.  If there's a better way and the community agrees that the new way is better, then the change should be made - even if that extends the time before the resource can hit normative.  (On the other hand, if the community doesn't feel the change is worth the impact on existing systems, we need to take that into account.)</p>",
        "id": 186903690,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580316102
    },
    {
        "content": "<p>So far, we have had a few discussions on the merits of John's suggestion and, each time, it has been decided that it's not the way we want to go.  If someone has a business case that shows a different need, we will always give it further consideration.  So far, it's been only academic discussion</p>",
        "id": 186904371,
        "sender_full_name": "David Pyke",
        "timestamp": 1580316454
    },
    {
        "content": "<p>I still see Consent being twisted to play the role of Permission. I'd like to figure that out before thinking normative. I'm more conservative on going Normative and I think that Consent is too important. I'd say hold on until the neighbor resource types are clear.</p>",
        "id": 186904583,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580316570
    },
    {
        "content": "<blockquote>\n<p>So far, we have had a few discussions on the merits of John's suggestion and, each time, it has been decided that it's not the way we want to go.  If someone has a business case that shows a different need, we will always give it further consideration.  So far, it's been only academic discussion</p>\n</blockquote>\n<p>There has been only one meeting where this was discussed and it was when I was not available. Since then my issues have been swept away with the statement that they were previously discussed with a different group of people who have never shown up again.</p>",
        "id": 186905078,
        "sender_full_name": "John Moehrke",
        "timestamp": 1580316845
    },
    {
        "content": "<p>I'm not comfortable with needing a strong case for breaking changes. Now is the time to evaluate and redesign if needed. Otherwise we are saying our initial design was the best and we had a strong case to make it like this, when perhaps it was just the consensus at the time with a given scope.</p>",
        "id": 186907426,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580318240
    },
    {
        "content": "<p>I remember suggesting renaming and rescoping medicationPrescription to  medicationOrder and being told that this would never happen because 'this has been discussed at length and we cannot change the name and cope of a resource like that'.</p>",
        "id": 186907435,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580318247
    },
    {
        "content": "<p>The consent resource has evolved frantically from John's original design and we continue to make changes. John's request is a breaking change that we have discussed more than once and rejected. We are not adverse to change but if it's breaking, it needs a real world use case after 2.5 years of revisions</p>",
        "id": 186913135,
        "sender_full_name": "David Pyke",
        "timestamp": 1580321866
    },
    {
        "content": "<p>true, but I recall that medicationPrescription did change the name.. :)</p>",
        "id": 186916215,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580323959
    },
    {
        "content": "<p>I agree that before cementing the structure we need to make sure that it works at least for some implementers. I am in the course of implementing a consent processor module and I found the design counter-intuitive. But the lack of documentation and some (perhaps legacy) non-conforming examples makes it very confusing and impossible to understand if I were to only rely on the specs. <br>\nI think the relevant question at this point in the thread is the experience of other implementers with the current <code>provision</code> structure, particularly the way the top provision is interpreted. Has anyone implemented this part? Does it work? Would it work better if it were to change?</p>",
        "id": 186945339,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1580345737
    }
]