[
    {
        "content": "<p>Just to confirm: samhsa, omh, opwdd, and oasis flags - are these all supported as meta security (data sensitivity) flags? (These are all US specific AFAIK, so it's hard for me to determine for all of them quite what they are in FHIR terms)</p>",
        "id": 219819381,
        "sender_full_name": "René Spronk",
        "timestamp": 1607939660
    },
    {
        "content": "<p>Does the <a href=\"https://www.hl7.org/fhir/v3/InformationSensitivityPolicy/vs.html\">https://www.hl7.org/fhir/v3/InformationSensitivityPolicy/vs.html</a> value set contain all concepts required to cover whatever is described by the samhsa, omh, opwdd, and oasis flags ?</p>",
        "id": 219945594,
        "sender_full_name": "René Spronk",
        "timestamp": 1608018309
    },
    {
        "content": "<p>I don't know.. as I am not a SME on those specific domains. You might try the CBCP mailing list, but I suspect the SAMSA experts are no-longer particiapting.</p>",
        "id": 219985371,
        "sender_full_name": "John Moehrke",
        "timestamp": 1608042193
    },
    {
        "content": "<p>SAMHSA has stopped all participation.  That codelist was compiled quite some time ago but was complete for their use at that time.  No significant changes have happened to ActCode in some years</p>",
        "id": 219985889,
        "sender_full_name": "David Pyke",
        "timestamp": 1608042415
    },
    {
        "content": "<p>Who in the FHIR community would be in the know about this? I'm pretty far removed from this US specific topic, so it would be good to find someone who's involved in these sensitivity flags. (as for the CBCP mailing list, I have no clue what that acronym stands for)</p>",
        "id": 220086859,
        "sender_full_name": "René Spronk",
        "timestamp": 1608106067
    },
    {
        "content": "<p>Community-Based Care and Privacy work group.   I'm only aware that Kathleen Conner would be the best source for information</p>",
        "id": 220117277,
        "sender_full_name": "David Pyke",
        "timestamp": 1608126815
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> general questions on the sensitivity vocabulary are good here. But to ask about compliance to a regulation is what I was saying is not my area of expertise. I try to stay away from perception that I am a Lawyer. I am not a Lawyer, which is required to answer questions of compliance with the law.</p>",
        "id": 220132632,
        "sender_full_name": "John Moehrke",
        "timestamp": 1608133875
    },
    {
        "content": "<p>Further... the questions you are asking are best answered by an organization that has cast the vocabulary, identities, roles, and consents into a trust-framework. It is the trust-framework that provides the answers you seek. A trust framework could make the vocabulary value \"tunaSandwich\" be the key code. There is nothing special, regarding regulations or trust-framework, about the codes published in the HCS, HL7, or anywhere else.</p>",
        "id": 220132957,
        "sender_full_name": "John Moehrke",
        "timestamp": 1608134028
    }
]