[
    {
        "content": "<p>FHIR recommends use of HTTPS, so we at least have a server certificate. Given that this is typical of all http REST, actually all http anything, do we need to say anything in the FHIR specification about Certificate Management?</p>",
        "id": 153950156,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522764047
    },
    {
        "content": "<p>My opinion falls in line with other similar questions we've raised around existing security topics (eg, CORS) -- there is already a ton of documentation around security best practices for certificate management and more broadly TLS configuration.</p>\n<p>Additionally, certificate and TLS configuration is an ever growing topic and there are always new best practices popping up. For instance, HPKP is no longer recommended and CT has gotten a lot more visibility. I don't think we'd keep up on an up-to-date set of best practices.</p>",
        "id": 153950221,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522769007
    },
    {
        "content": "<p>at most, we might point out that clients should be able to deal with client certificate rejection in the implementers check list</p>",
        "id": 153950252,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522779316
    },
    {
        "content": "<p>some basic certificate management recommendations as part of the checklist is easy... (we do have some notes in the http communication section, which we just agreed to up our recommendation to TLS 1.2)</p>",
        "id": 153950306,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522783160
    },
    {
        "content": "<p>...which we now need to update to TLS 1.3. <span class=\"emoji emoji-1f604\" title=\"smile\">:smile:</span></p>",
        "id": 153950318,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522783616
    },
    {
        "content": "<p>not so fast... TLS 1.3 has been approved for publication, but has not yet been given a number and published...</p>",
        "id": 153950321,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522783709
    },
    {
        "content": "<p>Eh, it's already been implemented which is what really matters :-)</p>",
        "id": 153950324,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522783783
    },
    {
        "content": "<p>I can see where the ability to specify a CA bundle in an IG might be useful, but also could clearly be out of scope. DirectTrust would be an example of this.</p>",
        "id": 153950355,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1522792416
    },
    {
        "content": "<p>Direct Trust is actively involved in FHIR Connectathon tracks leveraging their track record and experience in certificate based authentication supporting secure communication. <a href=\"http://wiki.hl7.org/index.php?title=201805_Direct/Certificates_Track\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201805_Direct/Certificates_Track\">http://wiki.hl7.org/index.php?title=201805_Direct/Certificates_Track</a>  It would be good to get others involved to help drive toward an understanding of what should (could) be said in the FHIR standard that supports but does not tie us to a specific CA solution.</p>",
        "id": 153952959,
        "sender_full_name": "John Moehrke",
        "timestamp": 1524064458
    }
]