[
    {
        "content": "<p>I am hoping to learn from the experts to answer a question about the relationship between the CMS Interoperability and Patient Access (IPA) final rule requirements, and the current state of industry standards.  Background: The CMS Final Rule requires entities to use FHIR V4.  When I look at the HL7 page for SMART Application Launch Framework IG, it is based on FHIR R3 and SMARTv1.  To use FHIR R4, I need to use the SMART IG v1.1.0 which is still in ballot mode.  Documentation that I have reviewed seems to require public clients to use the OAuth authorization flow with PKCE, which won't be available until SMARTv2 is official.  That would tell me that whatever I'm using as an authorization service to do IAM will need to use SMARTv1 with some additions to support PKCE.  Question: Where can I test the SMART v1 that has been modified to support PKCE? The Inferno test page does not allow public clients using authorization flow to use PKCE.  I feel like I'm missing some critical piece of information that will make this all clear.</p>",
        "id": 241433557,
        "sender_full_name": "Sam Dikeman",
        "timestamp": 1622745311
    },
    {
        "content": "<p>If I wasn't clear, we are starting to develop out API and would use Inferno to test our IAM flow to be able to hit the API.</p>",
        "id": 241433739,
        "sender_full_name": "Sam Dikeman",
        "timestamp": 1622745389
    },
    {
        "content": "<p>Hi Sam,</p>\n<p>The SMART App Launch Framework specifies that it is valid with any version of FHIR DSTU2 or higher (<a href=\"http://hl7.org/fhir/smart-app-launch/#profile-audience-and-scope\">Profile audience and scope</a>), so there is no requirement for a newer version.</p>\n<p>There is a <a href=\"https://github.com/smart-on-fhir/smart-launcher/pull/47\">draft PR</a> for adding the SMART v2 features (including PKCE) to the <a href=\"http://launch.smarthealthit.org/\">SMARTHealthIT launcher</a>.  I believe there is no rush to merge until the spec is finalized, given that anything is subject to change until then.</p>\n<p>In the meantime, there is a test server at <a href=\"http://smart.argo.run\">http://smart.argo.run</a> , which is used for testing the v2 changes (e.g., at connectathons).  It is just a fork of the SMARTHealthIT launcher where development has been taking place.  If you select any of the 'standalone' launch types, there will be the additional option of launching the 'Granular Control Test App', which includes the client-side PKCE code.  I would recommend checking out the connectathon report pages for SMARTv2 as well - I believe there are several sandbox environments that support PKCE, but cannot say off the top of my head.</p>\n<p>Finally, in general if you have SMART specific questions, you'll get the best responses on the <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a> stream.</p>\n<p>Hope this helps!</p>",
        "id": 241439039,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1622747832
    },
    {
        "content": "<p>Thanks so much Gino.  Will make sure I jump into the other stream for this kind of stuff.</p>",
        "id": 241439952,
        "sender_full_name": "Sam Dikeman",
        "timestamp": 1622748276
    },
    {
        "content": "<p>No problem!  I'm pretty sure there is a lot of overlap between these two streams, but the SMART one is more focused on those types of specifics.  Cheers!</p>",
        "id": 241441367,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1622748950
    }
]