[
    {
        "content": "<p><a href=\"https://truthonthemarket.com/2019/05/24/gdpr-after-one-year-costs-and-unintended-consequences/\" target=\"_blank\" title=\"https://truthonthemarket.com/2019/05/24/gdpr-after-one-year-costs-and-unintended-consequences/\">https://truthonthemarket.com/2019/05/24/gdpr-after-one-year-costs-and-unintended-consequences/</a></p>",
        "id": 166969476,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559280303
    },
    {
        "content": "<p>i find some the comments are more enlightening than the tone of the article.</p>",
        "id": 166973197,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559285552
    },
    {
        "content": "<p>There was at least one school not wanting to publish their student's grades at the end of the year because of GDPR. And IIRC some politicians hiring public nominees and not disclosing their name \"because of privacy\". That is not GDPR, that is ignorance IMO.</p>",
        "id": 166973315,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559285743
    },
    {
        "content": "<p>the fact that some companies are closing down or not operating as they were in Europe - well, not too bad.</p>",
        "id": 166973372,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559285815
    },
    {
        "content": "<p>but more interestingly for us, this: “[B]iomedical researchers fear that the EU’s new General Data Protection Regulation (GDPR) will make it harder to share information across borders or outside their original research context.”.<br>\nWe could always share sufficiently anonymized data, both before and after GDPR. if researchers (many? a few? two?) are afraid, that is a matter of education and perhaps we can publish some guidance.</p>",
        "id": 166973618,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559286076
    },
    {
        "content": "<p>I expect that they sought legal advice, and they got uncertainty back .</p>",
        "id": 166973694,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559286172
    },
    {
        "content": "<p>doubt we can publish anything that will change that</p>",
        "id": 166973712,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559286189
    },
    {
        "content": "<p>which is common. i had an it manager asking if they should just rather prepare to wipe their entire DW.</p>",
        "id": 166973808,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559286275
    },
    {
        "content": "<p>i think if we publish guidance on some use cases and mention \"how does this touch GDPR\", that could bring some light. It's just an idea. <br>\nI agree there is lots of uncertainty.</p>",
        "id": 166973899,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559286380
    },
    {
        "content": "<p>We do have <a href=\"https://confluence.hl7.org/display/SEC/FHIR+-+GDPR\" target=\"_blank\" title=\"https://confluence.hl7.org/display/SEC/FHIR+-+GDPR\">https://confluence.hl7.org/display/SEC/FHIR+-+GDPR</a>   Comments are welcome</p>",
        "id": 166989684,
        "sender_full_name": "John Moehrke",
        "timestamp": 1559303153
    },
    {
        "content": "<p>In one project we have the notion of \"access matrix\" which says who can access what information. This is identical to the resource I suggested - having a definition of what can be accessed under which circumstances (i am calling it Permission to avoid that it gets swallowed by Consent discussions).</p>",
        "id": 169432227,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562015962
    },
    {
        "content": "<p>Consent can hang from that, but is not the same. Use case (proposed by me, I can confirm if this is something we want to go live with): <br>\nMedication information is visible to all physicians with a therapeutic relation with the patient.<br>\nPsychiatry-related drugs, observations and treatment are visible to <br>\na) all clinicians in the therapeutic area <br>\nb) entire care team IF the patient has given consent for this (from which we hang the consent).</p>",
        "id": 169432397,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562016103
    },
    {
        "content": "<p>This is not unique to GDPR...   The underlying security policy is indeed something that is independent of Consent. I think the only disagreement we have is if it is important for FHIR to have a Resource specific to this underlying security policy. FHIR does not need to cover everything, it just needs to cover healthcare specific things.</p>",
        "id": 169478107,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562072461
    },
    {
        "content": "<p>Here <a href=\"http://wiki.hl7.org/index.php?title=Security_%26_Privacy_DAM\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Security_%26_Privacy_DAM\">http://wiki.hl7.org/index.php?title=Security_%26_Privacy_DAM</a> is a early draft of our Privacy and Security DAM. (Formal document is hard to reference and read)..... You can see the permission and many other things</p>",
        "id": 169478162,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562072517
    },
    {
        "content": "<blockquote>\n<p>I think the only disagreement we have is if it is important for FHIR to have a Resource specific to this underlying security policy. FHIR does not need to cover everything, it just needs to cover healthcare specific things.</p>\n</blockquote>\n<p>Agree that is where we may disagree. <br>\nI don't see this as a security policy, it's lower level than that, but that's not important. What matters is that I hear that we want to cover  a few use cases, and we use Consent where Consent does not fit, and then IIRC the definition of Consent is not fixed yet...<br>\nGDPR introduced the notion of \"valid permissions to use data\" and consent became less overruling. If we don't want to cover GDPR beyond consent that is a fair statement, but I disagree. And if we want to have operations like $erase, we do not have in Consent enough information.</p>",
        "id": 169513536,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562097058
    },
    {
        "content": "<p>Note that I want to ensure there is a common language to these things - i promised to make a proposal to a \"Permission-like\" resource, but if that is not desired, then we can discuss further or i stop execting it. <br>\nGDPR is important in my project and I will a) use what FHIR has, or b) propose improvements, or c) just make custom solutions. 2 out of these 3 approaches will work; 2 out of these 3 approaches will be interoperable.</p>",
        "id": 169513818,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562097269
    },
    {
        "content": "<p>So, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> and <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> : as discussed, I plan to propose a mechanism for exposing permission to use the data - not eviddence to patient-expressed consent , but \"stated permission to use which data\". As discussed we can see what is in Consent and look at GraphDefinition or any other ways to achieve what we need.<br>\nI do not want to do some small edits on Consent for that, especially keeping the name, because the name would be misleading. And discussion is already overloaded, now imagine if we had a resource that means different things to different people.<br>\nI plan to use that concept for my project. Hopefully we can show GDPR working on FHIR.</p>",
        "id": 169514365,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562097718
    },
    {
        "content": "<p>understood. and I support any experimentation. I just wanted it to be clear that not everything need be encodable in FHIR... Note that Consent is just for when a individual (patient) gives consent for some action, and a Privacy consent is when they give rules around how their data is allowed to be used. There are other things that Contract would cover... I imagine a Permission like thing to be something that both Contract and Consent could use, and possibly some other organizational structure for overall rules encoding... So I am not against you working on this, just not convinced that it is something that 'should' be a FHIR Resource.</p>",
        "id": 169514949,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562098130
    },
    {
        "content": "<p>as we discussed those changes, I understood indeed your encouragement to experiment. And I did have the impression of hearing that Consent resource was supposed to be more than just the patient-expressed consentment but I may be wrong and i'd disagree anyway. So we are good.<br>\nLet me materialise (not only concepts but example) and i will bring it up. For now I was just happy to realise that a national group of experts had a similar idea and they call it \"access matrix\".</p>",
        "id": 169515552,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562098534
    },
    {
        "content": "<p>Typically a Consent resource is just the evidence that the patient has agreed to a 'policy'. The 'policy' is not encoded in the Consent, but the Consent does point at the 'policy'. If there are variables in the 'policy' (e.g. life-time when expires), they can be recorded in the consent. If there are exceptions the patient has with the 'policy' (e.g. Not Dr Bob), those exceptions are expressed in the consent provisions. If there are additional permissions the patient defines (e.g. Steve is my legal guardian), those would be expressed in the consent provisions. But the 'policy' body of the rules is managed externally to the Consent resource. The body of the 'policy' rules is common to all patients. Thus there is only one encoding of this overall policy.</p>",
        "id": 169520785,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562102901
    },
    {
        "content": "<p>i really want to escape the Consent gravity field.</p>",
        "id": 169522914,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562104898
    },
    {
        "content": "<p>patient agreeing or reading policy or not is not relevant for this use case, so that is not the starring point.</p>",
        "id": 169522976,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562104943
    }
]