[
    {
        "content": "<p>I've been asked to review a paper for JIMR that describes a MITM attack on the v2 LLP. It's super-trivial, really - they wrote an ARP agent to redirect IP packets from a blood gas matchine, captured the insecure traffic, altered it, and forwarded it to the EHR after alterations.</p>",
        "id": 195542431,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588068699
    },
    {
        "content": "<p>In the mitigations section, the mention LAN segmentation as a possible defense - well, duh! But that made me wonder - can anyone here comment on the operation use of LAN segmentation for things like blood gas analysers? Is it a no-brainer, would always be done correctly, or is that not the case? It seems to me that it would require some additional network hardening to avoid physical changing of the network cables, which might be easy to do in a busy hospital ward</p>",
        "id": 195542600,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588068831
    },
    {
        "content": "<p>Do we have any numbers on this</p>",
        "id": 195542657,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588068853
    },
    {
        "content": "<p>There are some use of VLAN to virtually create a LAN that just hosts the medical devices. There are other configurations that place a VPN router between the devices and the servers they talk to (X-Ray device and the PACS). I have no statistics on this, NEMA might.  <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span> ?<br>\nThe NEMA imaging workgroup still regularly meets and addresses various things like this that come up in the market <a href=\"https://www.nema.org/Standards/Pages/Cybersecurity-for-Medical-Imaging.aspx\" title=\"https://www.nema.org/Standards/Pages/Cybersecurity-for-Medical-Imaging.aspx\">https://www.nema.org/Standards/Pages/Cybersecurity-for-Medical-Imaging.aspx</a><br>\nOf course, better is that all endpoints use mutually-authenticate-TLS using managed certificates with revocation checking -- ala ATNA.</p>",
        "id": 195569415,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588083037
    },
    {
        "content": "<p>No I don't have any statistics for this, but network segmentation is typical for imaging. Generally it is for bandwidth management, rather than security though.</p>",
        "id": 195573208,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1588084615
    },
    {
        "content": "<blockquote>\n<p>all endpoints use mutually-authenticate-TLS using managed certificates with revocation checking</p>\n</blockquote>\n<p>That's kind of rather theoretical. No one is going to be able to do with a PoC testing device using MLLP</p>",
        "id": 195616135,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588103160
    },
    {
        "content": "<p>I would agree that mutual-auth-TLS is far more realistic when both ends are within the management of one organization.</p>",
        "id": 195621960,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588105520
    },
    {
        "content": "<p>but it is also very usable where two endpoints are within organizations managed by an organization --- CommonWell ADT for example. (someone check my assertion as I am not 100% sure)</p>",
        "id": 195622094,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588105581
    },
    {
        "content": "<p>if you had indicated the problem was FHIR apps, then I would have not called upon mutual-auth-TLS.. but rather server auth https with OAuth... This accomplishes the same function (when done right).</p>",
        "id": 195622180,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588105630
    },
    {
        "content": "<p>Note that ATNA secure communications transaction has flavors for all these kinds of communications.. Including using S/MIME to secure email (similar to Direct Project), and WS-I async SOAP.   (soon an AS4 option, won't that be fun).</p>",
        "id": 195622628,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588105817
    },
    {
        "content": "<p>that is to say that ATNA is not just mutual-auth-TLS... much to the surprise of many who believe that</p>",
        "id": 195622784,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588105885
    },
    {
        "content": "<p>I think Graham is pointing out that a Point of Care device (like a blood gas machine) is unlikely to properly manage the certificates needed for TLS (whether it's MLLP or HTTPS).</p>",
        "id": 195636672,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1588113088
    },
    {
        "content": "<p>does anyone even use MLLP using mutual TLS?</p>",
        "id": 195637674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588113713
    },
    {
        "content": "<p>We did almost 20 years ago - though we also used v2.xml, so we were a bit weird... :)</p>",
        "id": 195637762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588113766
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> are the specs for this still around?</p>",
        "id": 195778487,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588199533
    },
    {
        "content": "<p>I doubt it.  Don't believe they were public even then.</p>",
        "id": 195783559,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588203435
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> which part are you referencing - v2.xml, or TLS for MLLP?</p>",
        "id": 195793371,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1588214546
    },
    {
        "content": "<p>TLS for MLLP.</p>",
        "id": 195793714,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588215122
    },
    {
        "content": "<p>Wouldn't that be just referencing <a href=\"https://tools.ietf.org/html/bcp195\" title=\"https://tools.ietf.org/html/bcp195\">BCP 195</a>?   <br>\nAFAIK, DICOM and the IHE ATNA profile do just that.</p>",
        "id": 195796140,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1588218654
    },
    {
        "content": "<p>I'm not sure whether we need to say more about :</p>\n<ul>\n<li>graceful initiation or fall back (security issues, I know but how do we make this practical?)</li>\n<li>mutual TLS?</li>\n<li>a certificate management protocol?</li>\n</ul>",
        "id": 195797321,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588220538
    },
    {
        "content": "<p>I may have more informed opinions in a month or three, but right now I don't see managing TLS for MLLP significantly different from managing HTTPS, and in one small way, they might be easier to manage - if two systems using MLLP are both senders and receivers of HL7 messages, trusting one side's server certificate means the same side's client certificate will also be trusted (assuming the same issuer)</p>",
        "id": 195798772,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1588222906
    },
    {
        "content": "<p>right. but PoC devices... not much of a UI.... how to manage certs?</p>",
        "id": 195798817,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588222952
    },
    {
        "content": "<p>Pure speculation, but I assume that even PoC devices need to have a method of updating their software. Since common solutions like OpenSSL look for certificates in specific files, these files can be updated like the rest of the software...</p>",
        "id": 195799207,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1588223479
    },
    {
        "content": "<p>Certificate management on a PoC device is really not that hard. The mechanics behind \"Lets Encrypt\" have been standardized in RFC8555 and can be used by PoC devices with no user impact. These result in a certificate being issued to the device that can then be used for either side of TLS. The thing that ACME does not do is create a trust relationship to a specific user or use-case; this would be part of the setup procedure. That setup procedure is typical for any PoC in that it asks for a few things using browser UI.</p>",
        "id": 195833724,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588251004
    },
    {
        "content": "<p>I think you're assuming that it has a general purpose OS with a full functional UI attached so that letsencrypt can be used</p>",
        "id": 195833813,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588251058
    },
    {
        "content": "<p>im not</p>",
        "id": 195833833,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588251067
    },
    {
        "content": "<p>the UI comes from a browser session on the users phone, tablet, or computer</p>",
        "id": 195833859,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588251087
    },
    {
        "content": "<p>I just did one of these with a web camera. The web camera has no UI.</p>",
        "id": 195833905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588251119
    },
    {
        "content": "<p>Check out this book - Dan is security for IoT at Amazon - full disclosure - he is a long time friend of mine - <a href=\"https://www.amazon.com/Cloud-Security-Control-2nd-Griffin/dp/1494966247/ref=dp_ob_image_bk\" title=\"https://www.amazon.com/Cloud-Security-Control-2nd-Griffin/dp/1494966247/ref=dp_ob_image_bk\">https://www.amazon.com/Cloud-Security-Control-2nd-Griffin/dp/1494966247/ref=dp_ob_image_bk</a></p>",
        "id": 195984392,
        "sender_full_name": "Tom Jones",
        "timestamp": 1588353318
    },
    {
        "content": "<p>or you can look at a presentation he gave 2 years ago <a href=\"https://www.amazon.com/Cloud-Security-Control-2nd-Griffin/dp/1494966247/ref=dp_ob_image_bk\" title=\"https://www.amazon.com/Cloud-Security-Control-2nd-Griffin/dp/1494966247/ref=dp_ob_image_bk\">https://www.amazon.com/Cloud-Security-Control-2nd-Griffin/dp/1494966247/ref=dp_ob_image_bk</a></p>",
        "id": 195984919,
        "sender_full_name": "Tom Jones",
        "timestamp": 1588353555
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> so I don't think that PoC devices come with that kind of functionality - or am I wrong?</p>",
        "id": 196007345,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588365680
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> if you are asking if a consumer can ADD security that is not designed into an PoC??? No. But a PoC manufacture can design security into the product. They can also design Privacy into the product.</p>",
        "id": 196018662,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588373578
    },
    {
        "content": "<p>but do they? do we know?</p>",
        "id": 196019278,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588374206
    },
    {
        "content": "<p>well, that is the rub... it is next to impossible for a common consumer to be able to tell if the product they have purchased/chosen is safe, secure, and privacy protecting.  That impossibility tends to be a good reason for regulation to step in. Example is the regulated safety requirements for automobiles.  The drawback is that this adds overhead in terms of delayed releases, expensive procedures, expensive labs, etc..</p>",
        "id": 196064874,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588445359
    },
    {
        "content": "<p>note that a consumer can't tell that their Firewall and VPN are working right either... so that is not really a solution</p>",
        "id": 196064884,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588445387
    },
    {
        "content": "<p>intermediate solution is to have authorities inspect and declare -- Consumer Reports Labs, or even  smart-person-I-know says so.</p>",
        "id": 196066005,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588447246
    },
    {
        "content": "<p>seems to me that we or IHE should host a connectathon around MLLP over TLS (as opposed to an IPSec tunnel), and also someone should post a open end point on the net somewhere to serve as a reference test case</p>",
        "id": 196122423,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588538915
    },
    {
        "content": "<p>I suspect that is already done with Gazelle, and thus available today. Ill check into it.</p>",
        "id": 196128872,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588549321
    },
    {
        "content": "<p>It would surely have been tested with XDS testing, which requires ATNA, and also requires PIX or PDQ (both HL7 v2)...</p>",
        "id": 196129880,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588550984
    },
    {
        "content": "<p>hmm I had not paid attention to this. PIX and PDQ require secure transport? And ATNA is not in scope for PoC testing devices?</p>",
        "id": 196129927,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588551033
    },
    {
        "content": "<p>right, XDS is not really a PoC use-case... yet.</p>",
        "id": 196129942,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551070
    },
    {
        "content": "<p>but, yes XDS mandated ATNA... when ATNA is mandated it is mandated for the whole system... which means the PIX or PDQ one uses to do patient lookup must be (able to be) secured by mutual-auth-TLS</p>",
        "id": 196129954,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551116
    },
    {
        "content": "<p>In theory.. that ATNA (virus) spreads to all communications in/out of your system...  but that is likely not tested beyond the PIX/PDQ use with XDS.</p>",
        "id": 196130001,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551168
    },
    {
        "content": "<p>ok good. That's not quite an answer to my question about ATNA though - ATNA itself is not in scope for PoC testing devices? (I know XDS is not)</p>",
        "id": 196130019,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588551201
    },
    {
        "content": "<p>I would need to get someone from the devices domain to speak authoratively on that. I don't know all the domain specifications that have mandated, or recommended ATNA... or more specifcally tested it is fact vs theory</p>",
        "id": 196130079,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551259
    },
    {
        "content": "<p>it would seem that IHE is closer to this - I would encourage IHE to unbundle secure v2 comms out of the XDS use case and make it available for testing in it's own right, to increase accessibility</p>",
        "id": 196130085,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588551261
    },
    {
        "content": "<p>it is available for ALL profiles</p>",
        "id": 196130091,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551280
    },
    {
        "content": "<p>grouping with ATNA is available for any use-case</p>",
        "id": 196130095,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551300
    },
    {
        "content": "<p>i'll ask my question differently: is there any functional or business benefit to a PoC device in implementing ATNA ?</p>",
        "id": 196130113,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588551321
    },
    {
        "content": "<p>security</p>",
        "id": 196130115,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551335
    },
    {
        "content": "<p>I get the feeling that you see a drawback</p>",
        "id": 196130165,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551417
    },
    {
        "content": "<p>note that ATNA now has FHIR R4 AuditEvent as an alternative for auditing rather than SYSLOG/DICOM/RFC3881</p>",
        "id": 196130176,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551464
    },
    {
        "content": "<p>and of course, audit logging is allowed to be turned off or locally stored... so it is a low bar.</p>",
        "id": 196130228,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551553
    },
    {
        "content": "<p>I'm just looking at from the pov of the buyers and sellers of the devices - what is the least expensive route to get an IHE approval that is meaningful? looking at ATNA, I feel as though it includes some thing that will cost manufacturers - and therefore buyers - real dollars without delivering any actual benefit. If those things can be moved out of the bundle, then it will cost less $$ to get secure and certified by IHE. Which will improve actual security</p>",
        "id": 196130229,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588551564
    },
    {
        "content": "<p>would welcome a constructive recommendation on making it easier. I don't think it is as hard as you guess.</p>",
        "id": 196130290,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551644
    },
    {
        "content": "<p>Especially if  the PoC implements ACME for certificate issuing. (which I think is what Gazelle test service supports for the IHE Connectathon)</p>",
        "id": 196130306,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551701
    },
    {
        "content": "<p>note I do have a rant against ACME, as it totally lacks any Identity Proofing... but that Proofing could be added by a human workflow, like I did with my web-camera... Once specifically proofed, it is added to a whitelist. So cert is used for security, and existance on the whitelist authorizes use.</p>",
        "id": 196130417,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551855
    },
    {
        "content": "<p>so according to <a href=\"https://wiki.ihe.net/index.php/Audit_Trail_and_Node_Authentication\" title=\"https://wiki.ihe.net/index.php/Audit_Trail_and_Node_Authentication\">https://wiki.ihe.net/index.php/Audit_Trail_and_Node_Authentication</a>, requirements:</p>\n<ul>\n<li>limit access to authorized users - I sure hope that they are doing this, but is it allowed to say that anyone who has physical possession of the device is an authorised user? </li>\n<li>requires the use of bi-directional certificate-based node authentication for connections to and from each node - does it need to be bi-directional for a PoC device?</li>\n<li>Audit Trail - it appears that the profile requires that there be an audit trail. I'm dubious as to the business value of this in a device</li>\n</ul>",
        "id": 196130418,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588551856
    },
    {
        "content": "<p>see previous comments on audit logging</p>",
        "id": 196130447,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551909
    },
    {
        "content": "<p>on access control, that is a functional requirement that is fully in the control of the PoC system... so this is a non issue</p>",
        "id": 196130453,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551946
    },
    {
        "content": "<p>yes, bi-directional is important</p>",
        "id": 196130454,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588551956
    },
    {
        "content": "<p>unless you are going to use OAuth for client.. which is a fine alternative....  but if you are going to just have server side http, then what is the value add?</p>",
        "id": 196130505,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588552009
    },
    {
        "content": "<blockquote>\n<p>see previous comments on audit logging</p>\n</blockquote>\n<p>\"audit logging is allowed to be turned off or locally stored\" - but it still must be implemented. So I think that's the thing I think should be unbundled for PoC devices.</p>",
        "id": 196130507,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588552010
    },
    {
        "content": "<blockquote>\n<p>just have server side http, then what is the value add?</p>\n</blockquote>\n<p>We're worried about MITM right? So if you write a client that authenticates the server, and follows a revocation list, that sorts out MITM, no? Or we do we assume that the revocation list part is too fragile?</p>",
        "id": 196130567,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588552095
    },
    {
        "content": "<p>Client can do good validation which would include revocation checking , expiration checking , and server name validation (all things covered in BCP195). But this does not address malicious clients reading, creating, or updating data. This is what the client auth is for.</p>",
        "id": 196194897,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588605362
    },
    {
        "content": "<p>client auth can be by TLS client cert, or by OAuth, or by some other method... These are all recognized in ATNA.   So there is nothing burdensome identified yet.</p>",
        "id": 196195068,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588605425
    },
    {
        "content": "<p>auditing must be implemented.</p>",
        "id": 196229795,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588621089
    },
    {
        "content": "<p>IHE Gazelle has a Security Suite that was developed by the Kereval team in Europe.   Its capabilities have evolved over time.  It includes:</p>\n<ul>\n<li>Issuing digital certificates.   I don’t know what software underlies their PKI.</li>\n<li>TLS simulators for client &amp; server, including support for the new ATNA options for various flavors of TLS compliance.</li>\n<li>validator for ATNA audit records, syslog format, including transaction-specific contraints</li>\n<li>Audit Record Repository actor simulator (syslog only).   I have requested FHIR AuditEvent support.</li>\n<li>XUA SAML STS. Requested support for IUA  OAuth</li>\n</ul>\n<p>User documentation is here: <a href=\"https://gazelle.ihe.net/gazelle-documentation/Gazelle-Security-Suite/user.html\" title=\"https://gazelle.ihe.net/gazelle-documentation/Gazelle-Security-Suite/user.html\">https://gazelle.ihe.net/gazelle-documentation/Gazelle-Security-Suite/user.html</a></p>\n<p>Testing the HL7 v2 is done independent, with the presumption that grouping is just logical assembly of the HL7 v2 messaging within a TLS tunnel.</p>",
        "id": 196654411,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588780154
    }
]