[
    {
        "content": "<p>Here is a security hole found in the Spanish COVID Vaccine Credential system that exposes personal demographics (might be more). Likely because there is no access control check if you are providing an id. Creative use of an API must always be considered in a system design.<br>\n<a href=\"https://www.eldiario.es/tecnologia/fallo-web-sanidad-madrid-deja-descubierto-datos-rey-miles-personas_1_8114359.html\">https://www.eldiario.es/tecnologia/fallo-web-sanidad-madrid-deja-descubierto-datos-rey-miles-personas_1_8114359.html</a></p>",
        "id": 245300688,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625744099
    },
    {
        "content": "<p>These kinds of mistakes are particularly likely when organizations rush a service to production (e.g., to meet a regulatory deadline that comes into effect without sufficient time  for careful implementation). </p>\n<p>I'm not even sure this is creative use of the api; more like an oversight in access control.</p>",
        "id": 245389350,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625792116
    },
    {
        "content": "<p>my use of \"creative\" was in humor.  A system must be designed to do the right thing regardless of client creativeness. Hackers are 'creative'.</p>",
        "id": 245432352,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625831247
    },
    {
        "content": "<p>Sure thing. My main point is that this system was apparently not protected <em>at all</em>, and just configured to return any data to anyone. There are lots of complex failure modes for security systems, but this sounds like a dead simple one.</p>",
        "id": 245456209,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625843756
    },
    {
        "content": "<p>My understanding is that the normal use was through a Search api, and that filtered out the patient name... But this was a GET api, that they never guessed someone would figure out how to put in id values.</p>",
        "id": 245460729,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625845984
    },
    {
        "content": "<p>Yeah -- that's saying there's an entirely unprotected API endpoint. This isn't an obscure or subtle \"miss\". It's... an open database hosted on the web.</p>",
        "id": 245475762,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625853221
    }
]