[
    {
        "content": "<p>This was brought up at the Security WG meeting and I wanted to raise it within the broader community here. Are there any use-cases or rationale for putting high-watermark labels on FHIR bundles? I am wondering since a bundle is not quite the same as an outer envelope and does not bear routing information (at least as far as I understand) in what scenario the client could benefit for high-watermark labeling given that the client has full access to the labeled resources in the bundle.</p>\n<p>This takes me to the my next question: isn't it more useful to interpret the semantics of a security label on the bundle as \"applies to all of the entries\" instead of high watermark? There is a clear rationale for this since it  enables the server to avoid repeating labels on potentially a large number of resources within the bundle, especially when those labels are transaction-dependent and not inherent to the resources within the bundle. For example, if there is a PoU restriction or Delete-after-use handling instruction that only pertains to the transaction at hand, it can be assigned to the bundle instead of repeating it on every single resource within the bundle.</p>",
        "id": 196670985,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1588786918
    },
    {
        "content": "<p>I am not sure I understand the distinction you are making...</p>",
        "id": 196690518,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588795953
    },
    {
        "content": "<p>the concept of high water can ONLY be applied to the confidentialityCode, which has a linear relationship</p>",
        "id": 196691439,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588796392
    },
    {
        "content": "<p>all other codes are independent facts or actions</p>",
        "id": 196691505,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588796403
    },
    {
        "content": "<p>that said.. I think if you are suggesting there be guidance on what the bundle.meta.security should have related to the content; very much agree it would be great if there was an algorithm. I suspect that algorithm will be highly influenced by Policy, which is another way of saying that the algorithm will not be standardized.</p>",
        "id": 196691642,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588796483
    },
    {
        "content": "<p>Let  me clarify my point:<br>\nThere are two ways to interpret <code>meta.security</code> on a bundle. </p>\n<ol>\n<li>HWM, i.e. we will look at the resources in the bundle, and compute a HWM and assign it to the <code>meta.security</code>. For example, if a bundle contains two resources one <code>R</code> and one <code>M</code>, the bundle is set to <code>R</code>. </li>\n<li>Grouping, i.e. when we assign a label to the bundle, it means that the consumer must assume that that label applies to all the resources in the bundle. For example, we assign <code>R</code> to a bundle (instead of assigning it to every single resource in the bundle) and it means all resources in the bundle are <code>R</code>.</li>\n</ol>\n<p>I'm suggesting (2) is useful especially for transaction-specific labels because it saves the server from repeating labels on potentially a large number of resources. I am also asking if there is any real use-case or rationale for (1).</p>",
        "id": 196695095,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1588798141
    },
    {
        "content": "<p>PS: At least theoretically, HWM for unordered valuesets is defined based on set-theoretic conjunction. For example, if there is an <code>HIV</code> resource and an <code>SCA</code> resource in a collection, the HWM would be <code>{HIV, SCA}</code>.</p>",
        "id": 196695113,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1588798154
    },
    {
        "content": "<p>I'm not in favor of 2 as it would be a type of context inheritance which we strenuously work to avoid in FHIR.  If you want to know the characteristics of a resource, you should only ever have to look at the resource.  Putting stuff on the Bundle that conducts to the resource means you'd have to transform the resources when you extract them as individual instances.  Much better to declare the same thing on 1000 different resources .</p>",
        "id": 196700699,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588800730
    },
    {
        "content": "<p>I have always expected the Bundle.meta.security would be metadata about the bundle, not necessarily the data contained within. As Lloyd points out each resource contained in a bundle has a .meta.security you can inspect. Thus I expect the bundle.meta.security to mainly hold PurposeOfUse for which the data are allowed, obligations that must be imposed because of the conditions of the creation of the bundle, and refrains that must be respected because of the conditions of the creation. It would seem a confidentiality code is useful, but it is not clear it is solely based on the content.</p>",
        "id": 196844748,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588895458
    },
    {
        "content": "<p>I think I find  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> 's argument about context inheritance compelling here. It seems like the burden and  complexity imposed on the client in computing resource labels outweighs the minuscule comfort for the server in such a grouping strategy. <br>\nAlthough I agree with you <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  that at a conceptual level the bundle and the resources are separate entities, any obligations (like restricted purpose of use or delete after use) associated with the bundle as a result of the context of the transaction, ultimately applies to the individual resources in the bundle. Since the bundle is an ephemeral data structure and is usually not persisted, the client still needs to apply such obligations to individual resources within the bundle before persisting them (for example, in an exchange scenario).<br>\nIn any case, it will be helpful if we can clarify this in the security labeling specs with examples.</p>",
        "id": 196928958,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1588960633
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span> You are imposing a storage requirement as an Interop requirement. We need to focus on interop communications, and not define storage requirements.</p>",
        "id": 196938023,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588965152
    },
    {
        "content": "<p>That is to say that a recipient can store the obligations however they need to store them in order to enforce them. To presume that the data resources must be tagged by the sender is not necessary. I really don't think that these kinds of communications policies should be updated in the data object, as they are not meta about the data; they are meta about the communications. This separation of layers is an important systems design. This separation of layers does not forbid a recipient from doing as you are suggesting and updating the data .meta.security tagging, but by separating these layers we enable recipients to keep these policy statements elsewhere, (like in a XACML database).</p>",
        "id": 196938567,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588965429
    },
    {
        "content": "<p>Storage is just one example of  processing and handling. Any processing of resources received in a bundle depends on those bundle labels.<br>\nTo be clear, again, I don't disagree with your point from a conceptual perspective, but I am just pointing out that this directly ties to the concern that Lloyd raised earlier about the self-sufficiency of resources. When labels on a bundle apply to the resources in the bundle, this _is_ context inheritance.</p>",
        "id": 196955277,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1588975129
    },
    {
        "content": "<p>Labels on a Bundle apply to the Bundle.  They can't apply to the resources within the Bundle.  If there are rules for the individual resources, they need to be declared on the individual resources.</p>",
        "id": 196963665,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588982973
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/Meaning.20of.20Security.20Labels.20on.20Bundles/near/196963665\">said</a>:</p>\n<blockquote>\n<p>Labels on a Bundle apply to the Bundle.  They can't apply to the resources within the Bundle.  If there are rules for the individual resources, they need to be declared on the individual resources.</p>\n</blockquote>\n<p>I agree with this mostly, but want  to be very careful about the meaning of your point.     I am mostly very concerned about \"..They can't apply to the resources within the bundle\". The word I am concerned with  is \"apply\".  There are uses of the english word \"apply\" that I would definitely agree with, but others that I would disagree with. My point of separating Bundle.meta.security being different than the resources.meta.security. The tags on the resources are tags about that data independent of policies that can change dynamically (e.g. current consent status, as that can change over time totally independent of tags on data).  Tags on the bundle level are about (meta) the bundle, which is highly influenced by the data within the bundle, context of the request that caused the bundle to exist, and current policies (e.g. consent status).</p>",
        "id": 197146148,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589204290
    },
    {
        "content": "<p>This is not to say that data can't point at policies that affect future uses of that data. Hence why data can't have tags that indicate that the data are sensitive to HIV status.  This is a meta statement about the data. This fact is used during a future decision, based on dynamic policy like consent status related to HIV status disclosure.</p>",
        "id": 197146419,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589204413
    },
    {
        "content": "<p>but data should not be tagged with transitory policy rules that could change dynamically. This is simply good systems design.   Security standards have recognized this for decades, this is not new to healthcare.   All domains do tend to occationally forget this, tag data with dynamic information, and then realize it was a really bad idea.  This lesson was a huge mistake that IHE made with the original release of the BPPC profile, that was painful but eventually changed. I don't want FHIR to make this mistake as it will be far more painful.</p>",
        "id": 197146757,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589204590
    },
    {
        "content": "<p>if we look at all the codes in the HCS. There are some codes that we expect to see on data (sensitivity, confidentiality, and integrity). Sometimes purposeOfUse  (and broader compartment ) are also on data when the database is itself not dedicated to singular purpose (e.g. an EHR) and in this case there is a need to record why the data was collected (Note that can also be done through other means like Provenance).</p>",
        "id": 197147242,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589204817
    },
    {
        "content": "<p>but there are other codes like Obligations, Refrain, and Policy; that are not appropriate for data. They are appropriate as part of a release of data. (e.g. I am releasing this data to you but you must Encrypt this data where ever you store it).   This obligation can be inspected by the recipient; where they can decide they can't abide so they will discard, or they recognize that their system can deal with encryption). This recipient can choose to record this obligation however it wants. It could put this obligation into the data. But it doesn't have to put it into the data. This obligation was about the release action that produced the Bundle. This release included the data, so the obligation does 'apply' to the data; but the release obligation is not a fundamental 'meta' about the data, it was about the release.</p>",
        "id": 197148081,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589205241
    },
    {
        "content": "<p>The basic point is if I receive a resource in a Bundle and nothing about the Bundle disallows me from removing a resource from the Bundle (that I'm contractually obligated to follow), then I can yank the resource from the Bundle and <em>only</em> pay attention to the tags on the resource and totally ignore the Bundle tags once the resource has been extracted.</p>",
        "id": 197195837,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589226677
    },
    {
        "content": "<p>there is always some  contractual obligation that causes you to look at anything.   There is nothing in any data-model that compels one to enforce anything. So this distinction you are trying to make between a bundle and the resources within is not a distinction with any difference.<br>\nThe data holder would need to assess if you were trustworthy to give the data to in the first place. That decision to provide data is what I am referencing as where the obligations and refrains come from. That decision, in this example, came to the conclusion that these residual obligations and refrains were possible for the recipient to enforce. If the recipient is not trustworthy to get the data or enforce the obligations/refrains, then the bundle would not be created at all.  I am simply making the recommendation that when the recipient can be trusted with these residual obligations and refrains, that they would be best carried in the bundle.meta.security and not replicated across all the data within the bundle (unless they were already marked that way).</p>",
        "id": 197197616,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589227542
    },
    {
        "content": "<p>\"always\" is a statement I always reject ;)</p>",
        "id": 197198513,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589227968
    },
    {
        "content": "<p>The key point is you <em>cannot</em> expect a receiver to propagate any tags on the Bundle to be tags on the content within the Bundle.  If you want a policy to apply to a resource within the Bundle, you need to declare it on that resource.</p>",
        "id": 197198595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589228021
    },
    {
        "content": "<p>so what do you do when there are two policies that apply to the data. Something like \"do not print\" for payers, and \"do not re-disclose for clinicians\", while the patient has no restrictions????? These are policies that are dynamic and NOT about the data. They are NOT META.</p>",
        "id": 197212231,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589235690
    },
    {
        "content": "<p>You can give this a try. In one or two years you will realize your mistake. I can't stop you. But I will continue to try to prevent you from doing a bad thing.</p>",
        "id": 197212297,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589235722
    },
    {
        "content": "<p>PLEASE look at the codes I am talking about... Obligations and Refrain. I am NOT making any comments about sensitivity, confidentiality, or integrity codes. I am all for marking data with meta tags about the data (confidentiality, sensitivity, and integrity). I am simply against putting obligations and refrain codes on data.</p>",
        "id": 197212479,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589235835
    },
    {
        "content": "<p>As I understand the concept of security label it is an advisement to the consumer extra ordinary handling of received content is in order... the nature and scope of such handling is specific to the business relationships between the parties and the associated obligations as a result. If this basic presumption is correct then there is a distinct role for labeling aggregate information (i.e. the bundle). There are many cases where the association of data in a single unit raises the overall sensitivity of unit. One simple use case is the result of queries with subjects with a particular condition. More complex cases exist for example a bundle of vital signs from a platoon to the field. The vitals themselves may have some sensitivity, but the key concern to a consumer is be aware that the composition of the platoon is also sensitive information.</p>",
        "id": 197776240,
        "sender_full_name": "Jerry Goodnough",
        "timestamp": 1589603288
    },
    {
        "content": "<p>Thanks Jerry for this very subtle and helpful use-case! I think using the <code>meta.security</code> on the bundle in such use-case is perfectly aligned with the earlier conversations in this thread about the conceptual difference between a bundle and its contents.</p>",
        "id": 198097346,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1589908047
    },
    {
        "content": "<p>I especially like the point that a search set can be more sensitive than the data it contains. Such as the example of a search set that might contain only normal data, but for which the search criteria was to return the patients with a sensitive observation. Thus the data contained in the bundle would be normal patient resources, but clearly their association within a bundle on a sensitive query is sensitive. This is a concrete example of my distinction of the bundle having a reason to exist that must be factored into the bundle meta.security values in a way that is related but independent to purely the contents of the bundle.</p>",
        "id": 198098661,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589908629
    },
    {
        "content": "<p>Wouldn't the sender of the platoon's vital signs be smarter to group those in another container type resource - e.g., List and label the list as \"restricted\" confidentiality and perhaps a sensitivity code related to the risk of revealing military intelligence because the list contents could reveal the composition of the platoon? <br>\n Then the Bundle.meta.security would also have have \"restricted\" confidentiality, but not the sensitivity code for military sensitivity.  The List would remained appropriately labeled even when the Bundle gets dropped.<br>\nHowever, that gets us back at where Mohammad started this discussion: Do high water marks work in FHIR.  I think there needs to be a way to encrypt the contents of a bundle so that only authorized recipients are able to access the information.  But there doesn't seem to be a way to do this with FHIR.</p>",
        "id": 198268396,
        "sender_full_name": "k connor",
        "timestamp": 1590015925
    },
    {
        "content": "<p>the high water concept is different than a functionality to encrypt.   Generally all communications of FHIR are over encrypted channels, which so far has been seen as sufficient.</p>",
        "id": 198326590,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590071118
    },
    {
        "content": "<p>John I think the encrtption Kathleen is referring to here is beyond the channel encryption; for example if one particular resource is masked for a specific end-user on the recipient's side. My understand about such use-cases though is that we can have some attributes in a resource masked without having to mask the entire resource, especially the resource metadata including <code>meta.security</code>. <br>\nIt's also unclear to me how masking an entire resource would work considering that it will break the bundle schema so we need some IG if there is a compelling use-case for this, but that's a separate discussion.</p>",
        "id": 198331688,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1590073577
    },
    {
        "content": "<p>I understand that.. but that is not the topic.  I am not against talking about that, but it is orthogonal. It is very different than common REST use. And would definitely be a different type of Bundle that does not yet exist</p>",
        "id": 198331949,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590073703
    },
    {
        "content": "<p>so my understanding is that Kathleen is suggesting that HWM on bundle makes sense if the content of the bundle resources (including the resource security labels) are hidden from the client by encryption. Essentially when the bundle resembles the concept of outer envelope.</p>",
        "id": 198332214,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1590073817
    },
    {
        "content": "<p>I don't agree. The bundle is a resource, so the .meta.security should represent the content of the bundle. The concept of high-water-mark is that there is some algorithm (yet to be defined, right?) that can be used to calculate the high-water-mark for the bundle given the content.</p>",
        "id": 198332867,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590074024
    },
    {
        "content": "<p>Now I don't think that the high-water-mark is as critical as a well defined meaning of the bundle.meta.security to hold obligations and refrains.. but if this topic will be addressed elsewhere, then that discussion can happen elsewhere. (much like a new type of bundle that has encrypted parts)</p>",
        "id": 198333037,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590074092
    }
]