[
    {
        "content": "<p>Hi FHIR and Security community<br>\nWe have not been getting good attendance at the scheduled FHIR Security call. I want to find a better time to hold these weekly meetings. I want to get more participation from those that are addressing security problems.  <br>\nLooking for those interested, so that I can assure a doodle poll starts with a good core group.<br>\nThese topics include some discussions that have popped up on zulip, but have never been brought to the security workgroup</p>\n<ul>\n<li>Basic Provenance in FHIR</li>\n<li>AuditEvent supporting Patient Empowerment</li>\n<li>Additional guidance for the core security pages</li>\n<li>Security around FHIR Subscription </li>\n<li>Security around bulk-data access</li>\n<li>Security around multi-organization interactions (e.g. HIE)</li>\n<li>App dynamic registration</li>\n<li>Updating of SMART-on-FHIR with next kind of use-case (tbd)</li>\n<li>Templating of IG to drive Security Considerations</li>\n<li>Templating of IG to drive consistent use of Provenance, AuditEvent, and Signatures</li>\n<li>Definition of a new Resource for Permission use-cases </li>\n<li>Creation of a library of security/privacy focused IG that can be included in 'other' IG as modular security solutions (similar to how SMART-on-FHIR is used today, but supporting other security models). This might be where the subscription, bulk-data, and multi-organization solutions are organized for easy use.</li>\n</ul>\n<p>First I want to get in touch with people who might want to participate. From that group we will define a set of potential timeslots to put into a doodle poll to find a new timeslot. Please contact me directly if you are interested in the above topics.<br>\nIf no one shows interest, then the above items will continue to be dreams...</p>",
        "id": 179344191,
        "sender_full_name": "John Moehrke",
        "timestamp": 1572365086
    },
    {
        "content": "<p>Here is a doodle poll looking for weekly meeting time <a href=\"https://www.doodle.com/poll/4rtybz87rqf5f8ra\" target=\"_blank\" title=\"https://www.doodle.com/poll/4rtybz87rqf5f8ra\">https://www.doodle.com/poll/4rtybz87rqf5f8ra</a></p>",
        "id": 180375445,
        "sender_full_name": "John Moehrke",
        "timestamp": 1573413113
    }
]