[
    {
        "content": "<p><a href=\"https://datatracker.ietf.org/doc/html/rfc8693\">RFC8693</a> was introduced in January of 2020 and gives the semantics for Delegation and Impersonation in OAuth.  </p>\n<p>Has anyone read through this and have thoughts about it?  Are there issues with it?  Has anyone implemented it?</p>",
        "id": 249851178,
        "sender_full_name": "David Pyke",
        "timestamp": 1629294411
    },
    {
        "content": "<p>I'll give a promise of half a cheese sandwich to anyone that has information about this RFC</p>",
        "id": 249870290,
        "sender_full_name": "David Pyke",
        "timestamp": 1629301869
    },
    {
        "content": "<p>You may get better responses in the <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a> stream.  (holds out hand for half-sandwich ;-)</p>\n<p>That said, this looks complementary to several RFCs that SMART App Launch already references (especially in the draft of v2)..  e.g., the next version has information about <a href=\"http://build.fhir.org/ig/HL7/smart-app-launch/token-introspection.html\">token introspection</a>, with links to <a href=\"https://datatracker.ietf.org/doc/html/rfc7662\">RFC7662</a>, which <a href=\"https://datatracker.ietf.org/doc/html/rfc8693\">RFC8693</a> also references.</p>\n<p>My quick gut reaction is that this defines things that are compatible with SMART v2, but that have so far been left out of scope for it.  That said, I would highly recommend getting the opinion of someone smarter than me (see what I did there? =).</p>",
        "id": 249876116,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1629304452
    },
    {
        "content": "<p>Did you mean \"someone FHIR SMARTer than me\"?</p>",
        "id": 249876391,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1629304586
    },
    {
        "content": "<p>This is more about the token exchange aspect and if anyone has implemented but you have a promise of half a cheese sandwich.</p>",
        "id": 249876948,
        "sender_full_name": "David Pyke",
        "timestamp": 1629304838
    },
    {
        "content": "<p>I'll post it in SMART and see what they say</p>",
        "id": 249876972,
        "sender_full_name": "David Pyke",
        "timestamp": 1629304851
    },
    {
        "content": "<p>Nice.  I was going to do the capitalization, but I thought I would leave some work for the reader  =).  I missed the opportunity for the 'FHIR' substitution entirely.  I tip my <span aria-label=\"top hat\" class=\"emoji emoji-1f3a9\" role=\"img\" title=\"top hat\">:top_hat:</span> to you.</p>",
        "id": 249877002,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1629304865
    },
    {
        "content": "<p>Yes, the token exchange portion hasn't been addressed (in SMART) yet.  SMART v2 just added the introspection piece (which is compatible), so this <del>is the next layer</del> would be another layer on top of that.</p>\n<p>It's getting close to publication, so I don't know that a scope change of that size would still be possible this round, but there's nothing (that I know of) that would stop someone from using this either.</p>",
        "id": 249877304,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1629304984
    },
    {
        "content": "<p>We've had plenty of discussion on token exchange over the years; it's not something we've put in scope for SMART App Launch or for SMART Backend Services though.</p>",
        "id": 249877651,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629305138
    },
    {
        "content": "<p>The semantics of token exchange are most straightforward when you're creating a derived token with a set of scopes that's a strict subset of what you've already got -- but even there, the \"underlying permissions system\" that enforces additional rules based on a given client registration or a given user's privileges... these have to be intersected too. It's significant complexity, and we haven't needed it for our core use cases yet.</p>",
        "id": 249877828,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629305226
    },
    {
        "content": "<p>most all of this is not special to healthcare... and hence why I have resisted pulling peice-by-peice into healthcare. The interaction between the security layer and the healthcare layer is important for us to characterize (such as scopes, and attributes).</p>",
        "id": 249891192,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629310892
    }
]