[
    {
        "content": "<p>Discussion topic: Given that FHIR has a generalization categorization into security categories - <a href=\"http://hl7.org/fhir/security.html#SecPrivConsiderations\">http://hl7.org/fhir/security.html#SecPrivConsiderations</a></p>\n<ul>\n<li>Anonymous Read</li>\n<li>Business Sensitive</li>\n<li>Individual Sensitive</li>\n<li>Patient Sensitive</li>\n<li>Not Classified</li>\n</ul>\n<p>Which shows up at the green bar at the top of each Resource as a \"Security Category\"....</p>\n<p>Patient resource itself is classified as Patient, <a href=\"http://hl7.org/fhir/patient.html\">http://hl7.org/fhir/patient.html</a></p>\n<p>which seemed logical... but I think it might be better to think of this as Individual. All the data pointing at a Patient would be Patient category.</p>\n<p>as in the access to the Patient resource should be similarly protected to access to Practitioner, Person,  RelatedPerson, etc... all the individuals... (Note Person and RelatedPerson seems improper at Patient category. )</p>\n<p>This is not the way it is identified today, but it seems more proper use of Individual category vs Patient category.</p>",
        "id": 278223515,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649364166
    },
    {
        "content": "<p>if Practitioner and PractitionerRole are the only thing in Individual, then this category seems not very helpful. They might as well be Business?</p>",
        "id": 278223577,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649364223
    },
    {
        "content": "<p>I think that Individual should group all those resources that identify an individual; such that one would consider the risks to that individual regardless of functional role implied by the Resource type.</p>",
        "id": 278223909,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649364397
    },
    {
        "content": "<p>This recognizes that a Patent directory (e.g. an MPI) is protecting identity, not medical sensitive topics...   Yes, the Patient holds identifiers, and yes the Patient is the link into the clinical data repository. But a Patient directory is focused on identity. Well managed Patient resource content can be used to keep exposure limited. (not uncommon for a national patient directory to have limited elements populated).</p>",
        "id": 278224412,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649364668
    },
    {
        "content": "<p>The fact that a patient has been treated at a specific clinic can be sufficient information to cause a problem for that patient.  As such, leaving the Patient resource as Patient Sensitive makes sense</p>",
        "id": 278224590,
        "sender_full_name": "David Pyke",
        "timestamp": 1649364759
    },
    {
        "content": "<p>I mentioned that... Those that will ignore good identity management, will allow derogatory comments to be in the notes fields that indicate that the patient is a jerk.</p>",
        "id": 278224772,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649364858
    },
    {
        "content": "<p>im just struggling with why Patient, Person, and RelatedPerson are in the Patient category. Seems a disconnect. (Now we did indicate these were tendency and that any tendency means nothing when you use the data differently, such as synthentic data is clearly not patient data)</p>",
        "id": 278224905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649364953
    },
    {
        "content": "<p>RelatedPerson is tied to a single patient record.  Person <em>could</em> be used in a manner that's not patient-specific but typically will be patient-specific.  It'd be reasonable to tie it to both Patient and Individual categories if that were supported.  However, if you have to pick one, Patient subsumes Individual.</p>",
        "id": 278225194,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649365092
    },
    {
        "content": "<p>right, that is how we got here. but being here is not helping those on the outside understand the set of rule differences between identity resoruces and clinical resources</p>",
        "id": 278225345,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649365183
    },
    {
        "content": "<p>the goal of the category was to be helpful. The inital problem was directory resources vs clinical resources... so identity resources were not as fully fleshed out. I am now recognizing that identity resources --may-- need a new perspective.</p>",
        "id": 278225565,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649365266
    },
    {
        "content": "<p>Or permit multiple categories?</p>",
        "id": 278496057,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1649634513
    },
    {
        "content": "<p>Multiple categories... might as well go back to no categories. There is nothing preventing someone from putting patient data into a CapabilityStatement, and nothing preventing purely anonymous data from being in an Observation. So, permitting multiple categories is to say that all resources can be in all categories... which we already say.</p>",
        "id": 278542889,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649678546
    },
    {
        "content": "<p>if the resource is really indeterminant, than categorize it as \"Not Classified\"</p>",
        "id": 278543125,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649678703
    },
    {
        "content": "<p>My current approach is to make sure each category are clear, and that is why I am unclear about Individual, and thus why I am wondering why Patient, Person, and RelatedPerson are not in Individual.</p>",
        "id": 278543176,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649678751
    },
    {
        "content": "<p>I don't think the multiple categories suggestion is so catastrophic. Multiple categories would not be used to describe \"anything that could possibly appear in a resource\"; rather they would be used to describe the things that are likely and expected to occur in a resource when used within its intended scope.</p>\n<p>In this circumstance for Related Person: when used as intended, the whole point of related person is to store a bit of information about the related individual, which is identifiable information about that individual like a name and phone number and street address... As well as an indication of their relationship to the patient which is to say this is the aunt or the chauffeur or the guardian or the ex-husband ..  which is of course also information about the individual patient because it leaks the fact that they have an ex-husband or a guardian or whatever.</p>",
        "id": 278553251,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649683770
    },
    {
        "content": "<p>which I think is why it is Patient category now.   So, what then is the use in keeping the Individual category, as today it has exactly one resource in it, Practitioner. Thus, the alternative is to eliminate the Individual category. It clearly is not being found useful.</p>",
        "id": 278558321,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649685931
    },
    {
        "content": "<p>Yeah I guess I have not followed the history on this. What is the party line on why practitioner role is not listed as Individual as well? <a href=\"http://hl7.org/fhir/practitionerrole.html\">http://hl7.org/fhir/practitionerrole.html</a> suggests it is... I'm really not clear on Person.</p>",
        "id": 278559931,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649686678
    },
    {
        "content": "<p>I think the reason is.... well, that Individual is not well defined...  :-)</p>",
        "id": 278561308,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649687157
    },
    {
        "content": "<p>I could see the argument that PractitionerRole is more closely aligned with business knowledge, where as Practitioner is reusable among many relationships to many organizations.</p>",
        "id": 278561447,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649687207
    },
    {
        "content": "<p>my latest use-case is around purely a patient registry. This registry has no clinical data, so __that__ patient registry can treat the patient resources purely as Identity category.</p>",
        "id": 278561716,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649687300
    },
    {
        "content": "<p>not to say that Identity is not sensitive, but rather to say that Identity is different sensitive than clinical data.</p>",
        "id": 278561772,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649687329
    },
    {
        "content": "<p>purely \"different\", not higher or lower or bigger or smaller.. just different.</p>",
        "id": 278561846,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649687355
    },
    {
        "content": "<p>I think I made a mistake when I didn't originally put Patient, RelatedPerson, and Person into Identity category.</p>",
        "id": 278562085,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649687454
    },
    {
        "content": "<p>That's fair, and I think it'd make sense to have those all under Identity. (And also putting Patient and Person in the patient category makes sense to me).</p>\n<p>Generally I find these classifications quite useful, imperfect as they may be.</p>",
        "id": 278571305,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649690967
    }
]