[
    {
        "content": "<p>A use-case has come forward where the Patient authorizes communications between two backend services. For example where the Patient as part of a CarePlan, endorses a specific clinician to be part of the CarePlan. The overall use-case is not specific to CarePlan, this is just one case. The point is that the backend services are authorized to communicate with each other by way of the Patient authorization.</p>",
        "id": 153950157,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522764435
    },
    {
        "content": "<p>This might be enabled by an OAuth token? This might be enabled by a Consent resource? What are the specific characteristics?</p>",
        "id": 153950158,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522764478
    },
    {
        "content": "<p>Are there some pilot projects that might inform us?</p>",
        "id": 153950159,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522764503
    },
    {
        "content": "<p>This sounds like the Sync for Science and Apple Health app use case: the patient authorizes an app (S4S or Apple Health app) that runs a backend process that periodically retrieves their data via FHIR.</p>",
        "id": 153950204,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522767148
    },
    {
        "content": "<p>That is one perspective. I would agree that SfS can be used here. It does require a specific token configuration for long term use. I think the question is if this is intended by SfS, or not? Is it obvious to the patient, or not?</p>",
        "id": 153950207,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522768077
    },
    {
        "content": "<p>It's not just S4S -- the Apple Health app works in the same way.</p>",
        "id": 153950208,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522768153
    },
    {
        "content": "<p>It is the authorization server's responsibility to make the patient aware as to what they are agreeing to. I think it is a fair question as to whether the patient understands what they are agreeing to. With the latest Facebook data sharing (both Cambridge Analytica and the Fb Android app permission with call logs) conversation in the public right now would say people do not really understand what they are agreeing to.</p>",
        "id": 153950212,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522768297
    },
    {
        "content": "<p>I am not clear on the specifics that <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  brought this to us. Is this simply documenting SfS as a solution? Or is there a specific problem with SfS here?</p>",
        "id": 153950214,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522768418
    },
    {
        "content": "<p>¯\\_(ツ)_/¯</p>",
        "id": 153950225,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522769220
    },
    {
        "content": "<p>no this is more that s4s. At present, if I wanted to use smart app launch the way s4s does, to enable to health services to communicate with each other, one has to offer a sync client, and there's a distinct directionality to it. That's definitely not the same as 'instruct 2 health providers to communicate about me'</p>",
        "id": 153950253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522779644
    },
    {
        "content": "<p>Can you elaborate on this use case, Grahame?</p>",
        "id": 153950264,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522780441
    },
    {
        "content": "<p>the use case came to me from several VA related providers, but <span class=\"user-mention\" data-user-id=\"194138\">@Aaron Seib</span> may describe it better</p>",
        "id": 153950266,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522780534
    },
    {
        "content": "<p>at present, in USA, my providers may communicate about me to each other using direct. if they have the appropriate trust relationships set up with each other. Which holds patients to what institutions can agree. But the patient can make their own agreements. Instructing 2 institutions to share data about a patient is different to providing one instutition with access to my patient summary information from another <br>\nAnd in lots of jurisdictions, what the providers can/must say to each other is different from what the patient has access to.</p>",
        "id": 153950267,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522780696
    },
    {
        "content": "<p>So, the question we have is why is Sync For Science method of enabling a service to talk to an app not sufficient. Where the one provider's backend is the app, and the other is the service? Thus the patient authorizes the two to bidirectionally talk (over a client/server relationship).</p>",
        "id": 153950305,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522783090
    },
    {
        "content": "<p>it's not really bi-directional then is it?</p>",
        "id": 153950307,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522783170
    },
    {
        "content": "<p>is that the key differentiatior?</p>",
        "id": 153950310,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522783247
    },
    {
        "content": "<p>no. for me, there 3 key differentiators:<br>\n- true bi-directional communications (not one as client, one as server)<br>\n- institutions can trust each other as opposed to having to trust the patient (not established by S4S at this time) <br>\n- authorized by the patient without requiring all institutions to be registered with each other</p>",
        "id": 153950311,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522783364
    },
    {
        "content": "<p>if you can sort that out on the existing smart app launch spec... I'm all ears</p>",
        "id": 153950312,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522783380
    },
    {
        "content": "<p>so it is differentiated from backend trust, in that it is dynamically created by the patient? That is that it isn't a persistent trust (DURSA)? Is backend trust looking at bi-directional communication, or is that new here too?</p>",
        "id": 153950319,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522783641
    },
    {
        "content": "<p>backend trust would be where the institutions have the trust arrangement. There's a big place for that, but it's not this problem</p>",
        "id": 153950320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522783679
    },
    {
        "content": "<p>understood, and I think I recognized that fact.... but I am still not sure what all the new characteristics are.</p>",
        "id": 153950323,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522783764
    },
    {
        "content": "<p>It seems like there are two pieces here--the patient directed authorization and the actual cross-system authentication. The patient directive can identify the systems who are authorized to share data about him/her (assuming authorization isn't already implicit via regulatory avenues such as TPO under HIPAA). However, a reliable and trustworthy way for the systems to authenticate each other is still needed since it seems this use case assumes the participants may not have pre-existing relationships. This is the same issue we were addressing in the Direct/Certificates track at the New Orleans connectathon to enable cross-system data access using certificate-based trust networks for provider system authentication without n*(n-1) preregistration events. It seems like the authentication piece of this use case would be a good fit to add to the Direct/Certificates track.</p>",
        "id": 153951903,
        "sender_full_name": "Julie Maas",
        "timestamp": 1523463761
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  This seems to be aligned with the work we did which was based on using a Consent resource as the governing policy over issuing UMA/OAuth tokens. The goal was to use UMA/OAuth while not necessarily requiring active involvement of the patient since the use-case takes place between two backend systems. I think that report can inform this discussion. <a href=\"https://gforge.hl7.org/gf/project/security/docman/CCDE%20Consumer%20Centered%20Data%20Exchange%20Connectathon/CCDE%20Interim/UMA_Consent_Management_Service-2017-11-27.pdf\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/security/docman/CCDE%20Consumer%20Centered%20Data%20Exchange%20Connectathon/CCDE%20Interim/UMA_Consent_Management_Service-2017-11-27.pdf\">https://gforge.hl7.org/gf/project/security/docman/CCDE%20Consumer%20Centered%20Data%20Exchange%20Connectathon/CCDE%20Interim/UMA_Consent_Management_Service-2017-11-27.pdf</a></p>",
        "id": 153953491,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1524347872
    }
]