[
    {
        "content": "<p>IMHO the XACML 'Policy' term encompasses (at least) the content of the FHIR Consent and Permission resources.  Some policies may be fairly generic (e.g. GP/PCP is allowed to see all lab results), others (like consents) could be very specific ('Dr X is allowed to use lab result Y').<br>\nIf you agree, then why don't we have a Policy resource, but two separate FHIR resources ?</p>",
        "id": 222059072,
        "sender_full_name": "René Spronk",
        "timestamp": 1610103331
    },
    {
        "content": "<p>The way that current build looks is certainly confusing. Permission is intended to cover all policy space related to data access policy (as distinguished from dress-code-policy).  Yes, Permission should end up looking much like XACML, but in FHIR form and using FHIR terms like Resource. Once that is done, then that concept will be removed from Consent, and Consent will be a resource specific to management of the patient specific policy. This would include the elements around when the consent ceremony happened, when it needs to happen again. This includes pointing at the scanned image of any paperwork that was part of the ceremony. The policy specifics would be in a Permission(s).</p>",
        "id": 222063510,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610106656
    },
    {
        "content": "<p>what is holding us back... there is few interested in moving the Consent forward, and it has a business driver. Far fewer wanting to write a generic policy resource.   So, please help us uncover those interested in this.</p>",
        "id": 222063611,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610106735
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/dZxjiwKsfKcC0Ti_knCBdicn/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/dZxjiwKsfKcC0Ti_knCBdicn/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/dZxjiwKsfKcC0Ti_knCBdicn/image.png\"></a></div>",
        "id": 222063715,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610106835
    },
    {
        "content": "<p>Permission is right side. Policy is top row (I think. sorry for rough schema)</p>",
        "id": 222063812,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610106878
    },
    {
        "content": "<p>Consent is bottom row</p>",
        "id": 222063843,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610106899
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> actually all of those are in the scope of what we call in FHIR \"Consent\". I have tried very hard to separate that we call it \"Consent\" from a region's legal definition of the word \"Consent\".  We need to pick words that can be broadly understandable and simple. This regional legal definition of a word is not what we are covering in FHIR (a global standard)</p>",
        "id": 222065537,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610108040
    }
]