[
    {
        "content": "<p>In our recent discussions, we have started looking at the privacy impact of using Documents vs Resources.<br>\nDocuments are esaier to manage in terms of segmentation - It's relatively easy / slow-changing to say \"this document contains this information, so it may be seen by these actors\".<br>\nIf we look at Resource-level access, this becomes much more complicated.</p>",
        "id": 199590337,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591171684
    },
    {
        "content": "<p>My current view is that this is simply a matter of data segmentation (albeit a slightly skewed notion of \"segmentation\"). <br>\nIs this true? What should we consider there?</p>",
        "id": 199590344,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591171689
    },
    {
        "content": "<p>well ... Documents are resources - so its more: a single resource vs. a collection of resources</p>",
        "id": 199596505,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1591175914
    },
    {
        "content": "<p>Yes, <br>\n\"documents\" =  \"defined, coherent, immutable, authored sets of resources\" (not only the fact it is a collection)<br>\n\"resources\" = granular access to data</p>",
        "id": 199597105,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591176310
    },
    {
        "content": "<p>security will always be a pain in the bum - especially for documents as it may contain information where parts of it shouldn't be viewed by \"everybody\".</p>",
        "id": 199618795,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1591190764
    },
    {
        "content": "<p>as Jens indicates, there is no fundamental access-control difference between documents and resources. Especially when one recognizes that a resource can contain other resources.     There are entry-level segmentation tagging methods for CDA documents, similar to FHIR (although FHIR is more clean and distinct).   the access control decision either allows the object to be used in the way the requester asked, or denies access. It does not matter if it is a document, or a resource.</p>",
        "id": 199638289,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591199863
    },
    {
        "content": "<p>I do prefer documents as a useful sized object to apply external access control against, where as there certainly are more scale issues with FHIR Resource. But this is just scale issue, not fundimentals.</p>",
        "id": 199638437,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591199914
    },
    {
        "content": "<p>lastly, when one releases FHIR resources to an external body they will be delivering a set of resources in a Bundle. Either a FHIR Document, Search Set, Message, Batch/Transaction, etc... thus the Bundle in that case is very similar to the Document in your case. In that the top level assessment is about the whole Bundle / Document; where there can be segmentation indicators (Security tags/labels) on various distinct content within that Bundle / Document.</p>",
        "id": 199638776,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591200031
    }
]