[
    {
        "content": "<p>On the Basic Provenance call we stumbled over what \"Basic Provenance\" should include when data are transformed. This is a clear need when one is transforming something radically, like CDA -&gt; FHIR. </p>\n<p>This transform use-case is already within FHIR Core <a href=\"http://build.fhir.org/provenance.html#import\" target=\"_blank\" title=\"http://build.fhir.org/provenance.html#import\">http://build.fhir.org/provenance.html#import</a></p>\n<p>BUT, once we start down this path we need to address the kind of transforms that are purely algorithmic. Such as a FHIR transform of a FHIR JSON into a FHIR XML; or even a de-seralization - re-seralization. -- HOW can we identify these non-consequential transforms?  Would like to hear that there is a term for this kind of transformation as different from one that might be more concequential relative to failure-modes.</p>",
        "id": 183000966,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575926084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span></p>",
        "id": 183001209,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575926219
    },
    {
        "content": "<p>agent = device</p>",
        "id": 183001480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575926387
    },
    {
        "content": "<p>did you want more than that?</p>",
        "id": 183001487,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575926394
    },
    {
        "content": "<p>What is it that makes the transformation non-consequential?  XML -&gt; JSON loses comments.  Is that consequential?  What if someone creates their own transform but it throws away certain extensions?</p>",
        "id": 183001742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575926559
    },
    {
        "content": "<p>Personally, I lean towards signing only applying to a bit-exact representation, with any changes using some sort of claim chaining.<br>\nI feel like trying to define allowed transformations is a) a slippery slope (e.g., does changing units count as a change?) and b) raises the bar for implementers (e.g., a signature is for XML, but I'm working in JSON.. validation would at minimum require me to change the representation).</p>",
        "id": 183003126,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1575927491
    },
    {
        "content": "<p>Im not asking about signature.. I am asking about what is the trigger (how much of a change) is necessary to cause a \"Basic Provenance\"..  Im am also NOT advising against Provenance on every non-consequential transform, you want to do that then you are free to do that. However the point is that at some level of transform one crosses from non-consequential to consequential.<br>\nto further emphasize ... there is a form of transformation that happens at every Internet Protocol (IP) gateway as the packets are transformed from electrical signal to digital representation, then back to electrical signal... This transform we are happy ignoring at the FHIR Provenance... right? Is there a FHIR transform from core json to core xml that we are happy with?</p>",
        "id": 183004005,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575928179
    },
    {
        "content": "<blockquote>\n<p>What is it that makes the transformation non-consequential?  XML -&gt; JSON loses comments.  Is that consequential?  What if someone creates their own transform but it throws away certain extensions?</p>\n</blockquote>\n<p>This is indeed the question...If we don't define some level that is consequential vs non-consequential; then every transaction with a FHIR server WILL need to have a Provenance attached for every Resource, and that Provenance must also have a Provenance attached, etc... I am trying to find the point at which \"basic provenance\" is not further interesting, vs when a transform is clearly interesting (like unit conversion to use Gino's example).</p>\n<p>I don't expect the answer to be easy... hence why I ask</p>",
        "id": 183004325,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575928420
    },
    {
        "content": "<p>I don't understand why we care. This is in respect to a particular IG?</p>",
        "id": 183007210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575930716
    },
    {
        "content": "<p>It's a question of whether a server should create a Provenance record every time data goes from one syntax to another (or even from syntax to object?)</p>",
        "id": 183008291,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575931552
    },
    {
        "content": "<p>in what context?</p>",
        "id": 183008400,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575931620
    },
    {
        "content": "<p>Receive JSON.  Convert to XML for processing.  Generate XML response.  Convert to JSON prior to transmission.  Is that 0 Provenance, 1 or 2?</p>",
        "id": 183008704,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575931845
    },
    {
        "content": "<p>that depends on policy. That's not the sort of thing we can make rules about in the base spec. Which is why I keep asking what the context is</p>",
        "id": 183008742,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575931875
    },
    {
        "content": "<p>So, having implemented a non-consequential transformation from V2 to FHIR in a production environment, and planning to do same for CDA, I can say that I want a provenance resource associated with the resulting FIR Resource that tells the message or document it came from, and where in that artifact (Segment ID or index), or document (XPath) that the content originated from, and the version of the software (device) And/or its configuration resources. That provenance is useful for a) diagnostics, b) tracebility.  These are purely algorithmic, and in same cases, even lossless, transformations, but the syntax is different enough, and the transform complex enough, that I want a record of it somewhere.</p>\n<p>I go so far as to add extensions to MY provenance record to report field content mapping rules that have been applied, but we only turn those on in test, not production.  They are expensive.</p>",
        "id": 183009208,
        "sender_full_name": "Keith Boone",
        "timestamp": 1575932154
    },
    {
        "content": "<p>they would be expensive ;-)</p>",
        "id": 183009738,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575932437
    },
    {
        "content": "<p>my “policy” is that if the transformation is complicated enough to require support (an engineer has to look at something related to it) in the future, that provenance is needed.  If you can (as for FHIR json to xml and back) essentially verify round tripping with NO data loss (in canonical form) in the Transformation, it’s not what I would consider to be consequential.</p>\n<p>if augmenting the resource via even mildly complex algorithm (e.g., terminology mapping Via simple lookup), it’s consequential enough for provenance for me.</p>",
        "id": 183010134,
        "sender_full_name": "Keith Boone",
        "timestamp": 1575932708
    },
    {
        "content": "<p>I don't mind recommending something along those lines in the spec, and i think it would be good to add an example</p>",
        "id": 183010192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575932756
    },
    {
        "content": "<p>I usually do this on the system level, not on instance level - describing the transformation itself, not every transformed instance. But I think it makes sense to allow this on instance level.</p>",
        "id": 183031898,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1575957709
    },
    {
        "content": "<p>Question on top of this: (how) do we add the notion of permission ? i.e. explaining not only \"from where\" but \"why\" did we get this data, or what the next link must know to eventually use the data</p>",
        "id": 183032012,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1575957852
    },
    {
        "content": "<blockquote>\n<p>So, having implemented a non-consequential transformation from V2 to FHIR in a production environment, and planning to do same for CDA, I can say that I want a provenance resource associated with the resulting FIR Resource that tells the message or document it came from, and where in that artifact (Segment ID or index), or document (XPath) that the content originated from, and the version of the software (device) And/or its configuration resources. That provenance is useful for a) diagnostics, b) tracebility.  These are purely algorithmic, and in same cases, even lossless, transformations, but the syntax is different enough, and the transform complex enough, that I want a record of it somewhere.</p>\n<p>I go so far as to add extensions to MY provenance record to report field content mapping rules that have been applied, but we only turn those on in test, not production.  They are expensive.</p>\n</blockquote>\n<p>Keith, that is NOT the non-consequential I am talking about. I agree that the use-case you give is clearly consequential. And this is documented on the FHIR core spec for Provenance.</p>",
        "id": 183059721,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575985315
    },
    {
        "content": "<blockquote>\n<p>Receive JSON.  Convert to XML for processing.  Generate XML response.  Convert to JSON prior to transmission.  Is that 0 Provenance, 1 or 2?</p>\n</blockquote>\n<p>Lloyd understands the kind of technical transform that I don't believe requires a Provenance record (except in the absolute extreme policy, which I would never forbid).</p>",
        "id": 183059864,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575985401
    },
    {
        "content": "<blockquote>\n<p>I don't mind recommending something along those lines in the spec, and i think it would be good to add an example</p>\n</blockquote>\n<p>I am not right now looking to update the FHIR core... I am working on the \"Basic Provenance\" IG. So we do have a policy set that is trying to set the minimal viable \"basic\" provenance. Which for the most part is: Must be who you received it from, and author if you know it.</p>",
        "id": 183060059,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575985548
    },
    {
        "content": "<p>So, HOW do we describe the kinds of \"Transforms\" that must be recognized with a Provenance, from the kind of \"transforms\" (xml--&gt;json, json--&gt;xml) that are clearly not necessary to record in a Provenance when working in the Basic Provenance IG policy space.</p>",
        "id": 183060280,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575985681
    },
    {
        "content": "<p>I see Lloyd used the word \"syntax\" translation?</p>",
        "id": 183060454,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575985800
    },
    {
        "content": "<p>Lloyd also mentioned that no transformation is necessarily irrelevant.  While we have high confidence that the reference implementation transforms are lossless, not everyone will use that code (or use it unchanged).  So the question of \"how confident are you in no information loss\" needs to be answered</p>",
        "id": 183071016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575992295
    },
    {
        "content": "<p>fully agree. I do think that there is some bright-line that can be drawn.  I think the confidence question can always be used to increase the number of Provenance relevant events. We are not trying to put a limit, just trying to set realistic expectations.</p>",
        "id": 183073608,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575993927
    },
    {
        "content": "<p>A definition that seems to be emerging: A non-consequential transform is one that is performed by automated algorithm that is without loss of data and fully reversible.  Is this clear? Is this proper?</p>",
        "id": 183074473,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575994479
    },
    {
        "content": "<p>Seems this covers FHIR json&lt;--&gt;xml; network layer; and internal system processing. Do the things that we consider concequential fall outside that definition? Use of the HL7 published CCDA-on-FHIR transform? Automated conversion of v2 messages to FHIR? Disassembly of CDA into FHIR resource?</p>",
        "id": 183074903,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575994740
    },
    {
        "content": "<p>What about taking a serialized FHIR-Document (Bundle) and serving the resources within using FHIR REST query/read? Should this be a consequential Transform? Is it so close to the line that we need to call it out explicitly?</p>",
        "id": 183075076,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575994842
    },
    {
        "content": "<p>My current practice when implementing data lineage is that there is no clear line. Transformations will evolve. All transformations must be accounted for and have an owner. The owner is then responsible for evaluating the transformation along its life cycle, deciding what are the risks and controls at any time</p>",
        "id": 183078061,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1575996753
    }
]