[
    {
        "content": "<p>I'm having trouble understanding the definition of removal:</p>",
        "id": 201594824,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592825678
    },
    {
        "content": "<blockquote>\n<p>A derivation for which the entity is removed from accessibility usually through the use of the Delete operation</p>\n</blockquote>",
        "id": 201594834,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592825688
    },
    {
        "content": "<p>does this mean:</p>\n<ul>\n<li>the source contained information that lead to the target being removed?</li>\n<li>the source contained information has been removed from the target? </li>\n<li>something else?</li>\n</ul>",
        "id": 201594880,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592825724
    },
    {
        "content": "<p>Also, the provided value sets for Provenance.agent.type and Provenance.agent.role rather confuse things. I note that the US core profile for Provenance uses type for what I would've thought was role?</p>",
        "id": 201596026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592826737
    },
    {
        "content": "<p>Hi Grahame - John Moehrke and I know that we need to redo the Provenance.agent.type and Provenance.agent.role value sets to differentiate between the functional role/what the actor did in the workflow codes (agent.type) and the structural roles/competencies (agent.role).  It's a mess right now.  Obviously need to prioritize this especially because IG writers are getting discombobulated with their Provenance agent.type/agent.role code choices. On my to do list.</p>",
        "id": 201813446,
        "sender_full_name": "k connor",
        "timestamp": 1592977407
    },
    {
        "content": "<p>It would be good to stop using v3 codes that weren't designed for the purpose as part of the process.</p>",
        "id": 201814242,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592978996
    },
    {
        "content": "<p>it would be good to have a statement of intent about what we're going to try to achieve</p>",
        "id": 201814811,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592979941
    },
    {
        "content": "<p>having engagement from people trying to use this is fantastic. Theory and reality are different. Please bring on the CR to help.</p>",
        "id": 202308183,
        "sender_full_name": "John Moehrke",
        "timestamp": 1593437196
    },
    {
        "content": "<p>I was thinking that a record of Provenance of a delete would be needed, but we never quite finished the modeling as we didn't get use-cases to help inform what we would need to do. The use-case we have is simply to record WHO deleted the resource WHEN and WHY.</p>",
        "id": 202308491,
        "sender_full_name": "John Moehrke",
        "timestamp": 1593437367
    }
]