[
    {
        "content": "<p>From <a href=\"http://build.fhir.org/security-labels.html#core\">http://build.fhir.org/security-labels.html#core</a></p>\n<blockquote>\n<p>The Security Label vocabulary has three patterns of use: (1) Bundle: Security/Privacy considerations of a data set, (2) Context: Describe security/privacy context of a request for data, and (3) Meta Data: to indicate security/privacy meta about that data.<br>\n...<br>\nContext: Requests (e.g. Read, Query, message triggers) - would describe the context of the request using purposeOfUse and compartment/clearance. The request might declare the highest confidentiality desired. It is unlikely to see in a request a declaration of sensitivity or integrity. It is also unlikely to see Obligations within a Request. (See Bundle for Response, where these are appropriate)<br>\n...<br>\nPurpose of Use    These Purpose of Use (system = <a href=\"http://terminology.hl7.org/CodeSystem/v3-PurposeOfUse\">http://terminology.hl7.org/CodeSystem/v3-PurposeOfUse</a>) is an indication of a reason for performing one or more operations on information. which may be permitted by source system's security policy in accordance with one or more privacy policies and consent directives. Such as collecting personal health information for research or public health purposes.<br>\nNotes may be used as:<br>\nThe rationale or purpose for a request for data<br>\nThe use limitation on a data Bundle<br>\nSee discussion on HCS below</p>\n</blockquote>\n<p>However it is unclear how to implement POU with requests. So for CDEX we are proposing the following for <em>Task-based requests for data</em>:</p>\n<ol>\n<li>\n<p>The intent and meaning when using the <code>Task.meta.security</code> element to \"describe the context of the request using purposeOfUse\" codes was unclear.  Instead we elected to use purposeOfUse codes in a <code>Task.input</code> parameter to indicate the context of the request.</p>\n</li>\n<li>\n<p>It is unclear whether the The Purpose of Use Codes (system = <a href=\"http://terminology.hl7.org/CodeSystem/v3-PurposeOfUse\">http://terminology.hl7.org/CodeSystem/v3-PurposeOfUse</a>) can be used to Describe the context of a request for data or are they limited to Security/Privacy considerations of a data set or about that data.  For example, can <a href=\"http://hl7.org/fhir/v3/ActReason/cs.html#v3-ActReason-CLMATTCH\">CLMATTCH</a> be used to indicate that a data request is for a claims-audit?</p>\n</li>\n</ol>",
        "id": 258429917,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634758477
    },
    {
        "content": "<p>see <a href=\"https://hackmd.io/pFbvLQb0TK-5jdyI1M0OeA#Example-use-in-Task-using-Purpose-of-Use-Extension\">this Example</a></p>",
        "id": 258430462,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634758590
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I am not clear on what you are asking. Mostly because there is context that I am unaware of. I think it would be best to have a discussion rather than hope that this can be resolved on zulip.</p>",
        "id": 258438738,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634761746
    },
    {
        "content": "<p>in a Query, the PurposeOfUse(s) would tend to be passed in as part of the security context. This is why it was added to SMART-on-FHIR and why it is fundamental to IHE IUA implementation guides. It might be implied by the security context, part of the trust-framework (all entities authorized within a given CA have agreed to policy that is stated as limited to a set of PurposeOfUse). Thus it is not always needed in every transaction. It is used as part of the authorization decision and enforcement. Any data returned in a response is expected to be usable for those PurposeOfUse that were in the request, and thus the data is not given for PurposeOfUse outside that request.</p>",
        "id": 258440040,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634762201
    },
    {
        "content": "<p>on the vocabulary... If you have a concept that is not represented, then please use the vocabulary process to have your purposeOfUse added. If you don't think it is legitimate to add to HL7 vocabulary (THO), then you are free to create your own PurposeOfUse vocabulary, such as within your IG.  Just like with any codesystem.</p>",
        "id": 258440336,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634762337
    },
    {
        "content": "<p>Thanks John .... I think you answered my the questions in part.</p>",
        "id": 258443662,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634763681
    },
    {
        "content": "<p>that is scary</p>",
        "id": 258443910,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634763778
    },
    {
        "content": "<blockquote>\n<p>in a Query, the PurposeOfUse(s) would tend to be passed in as part of the security context. This is why it was added to SMART-on-FHIR </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  I just did a search of the Smart spec and did not find any mention of PurposeofUse.  Can you point out the salient section?</p>",
        "id": 258444389,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634763990
    },
    {
        "content": "<p>remind me when are the Security calls?</p>",
        "id": 258444676,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634764113
    },
    {
        "content": "<p>that would be in the version 2. -- <a href=\"http://build.fhir.org/ig/HL7/smart-app-launch/\">http://build.fhir.org/ig/HL7/smart-app-launch/</a></p>",
        "id": 258450197,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634766719
    },
    {
        "content": "<p>seems they have downplayed the capability I saw in the ballot . <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> ?</p>",
        "id": 258450629,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634766937
    },
    {
        "content": "<p>It still seems to be in the UDAP spec - <a href=\"https://build.fhir.org/ig/HL7/fhir-udap-security-ig/branches/main/b2b.html\">https://build.fhir.org/ig/HL7/fhir-udap-security-ig/branches/main/b2b.html</a></p>",
        "id": 258450743,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634766993
    },
    {
        "content": "<p>It is in the IHE spec <a href=\"https://profiles.ihe.net/ITI/IUA/index.html\">https://profiles.ihe.net/ITI/IUA/index.html</a> - look for purpose_of_use</p>",
        "id": 258450934,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634767092
    },
    {
        "content": "<p>FHIR Security calls are Mondays at 12 eastern</p>",
        "id": 258451047,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634767166
    },
    {
        "content": "<p>After reviewing the 3 references spec above, I see three distinct \"standard\" ways  to do Purpose of Use for Direct Queries using Authorization Layer.  -   see my analysis <a href=\"https://hackmd.io/pFbvLQb0TK-5jdyI1M0OeA#Purpose-of-Use-for-Direct-Queries-using-Authorization-Layer\">here</a></p>\n<p>am I mistaken?</p>",
        "id": 258612563,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634848323
    },
    {
        "content": "<p>Do we have a requirement for \"purpose of use\" for direct queries?  I thought our only requirement was for the asynchonous Task-based requests - and for those, we need to pass it as a parameter to the Task.  The various header mechanisms are all about the \"purpose of use for the current action\" - which is posting a Task.  They wouldn't deal with the purpose of use of the action the Task is soliciting.</p>",
        "id": 258657002,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634873135
    },
    {
        "content": "<p>I had not understood the distinction Lloyd is making. So the Task itself is the embodyment of a set of actions that are ALL under a set of PurposeOfUse? I could see how this would be useful element of the Task instance. It then might drive that all accesses to the Task must agree with that PurposeOfUse, right?</p>",
        "id": 258703129,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634905144
    },
    {
        "content": "<p>The Task is saying \"please go find this data/execute this query/filter as appropriate/package it up for my consumption - and return it to me\".  We also want to say \"and by the way, the way I intend to use this information (which might affect what you choose to give me/how you choose to filter), is the following\".</p>",
        "id": 258751454,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634926603
    },
    {
        "content": "<p>So, there's no real \"purpose of use\" for the posting of the Task.  The purpose of use is for \"what will happen to the data you give me assuming you execute the Task\".</p>",
        "id": 258751540,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634926645
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  my <a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/Purpose.20of.20Use.20Labeling.20for.20request.20questions/near/258612563\">question above</a>is not related to Task based requests. I think my questions about Task and the reuse of POU terminololy have been sufficiently answered.  But in CDEX we also cover direct queries and obliquely reference the aforementioned standards the the IG notes.  I am trying to get my head around the current  state  for the request authorization layer.  Doing some extra credit reading....Gotta keep up!  :-)</p>",
        "id": 258796745,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634954129
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/Purpose.20of.20Use.20Labeling.20for.20request.20questions/near/258751540\">said</a>:</p>\n<blockquote>\n<p>So, there's no real \"purpose of use\" for the posting of the Task.  The purpose of use is for \"what will happen to the data you give me assuming you execute the Task\".</p>\n</blockquote>\n<p>the distinction between those two things is easily conflatable and why I keep questioning why they are not the same.  I give up for now on arguing that they are, and I imagine by not using <a href=\"http://Task.meta.security\">Task.meta.security</a> it will be avoided.  Reluctantly agreeing with Lloyd.  ;-)</p>",
        "id": 258797178,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634954656
    },
    {
        "content": "<p>I think that purpose of use shouldn't be associated with the OAuth content. I don't want to have to re-login when I decide to look up some information for treatment as opposed to research.</p>",
        "id": 258916059,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635136858
    },
    {
        "content": "<p>and the spec defines how to associate security labels with requests, if that's appropriate: <a href=\"https://hl7.org/fhir/security-labels.html#break-the-glass\">https://hl7.org/fhir/security-labels.html#break-the-glass</a></p>",
        "id": 258916074,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635136898
    },
    {
        "content": "<p>the purposeOfUse should be declared in the security context. The fact that the v2 of SMART does not have this is due to implementer pushback on how hard it is, I don't disagree. Security is hard, doing it right is very hard.  The break-the-glass hack is outside the security context, and hence why it is dragon warning.</p>",
        "id": 258948265,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635163069
    }
]