[
    {
        "content": "<p>Hi <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> I'm trying to understand whether it is possible to use a single instance of Provenance  to carry digital signatures for multiple resources (say, when uploading a whole bundle of resources). Both <code>Provenance.target</code> and <code>Provenance.signature</code> have cardinality <code>0..*</code>, but it is not quite clear to me if this use case can be covered. In particular,  I'm not sure how one can clearly show which signature goes with which resource (other than by adopting a convention saying that the entry with index <em>i</em> in <code>signature</code> corresponds to the entry with index <em>i</em> in <code>target</code>). Is there any guidance on this?</p>",
        "id": 202807816,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1593785657
    },
    {
        "content": "<p>anything is possible. The core specification is intentionally flexible.</p>",
        "id": 202821281,
        "sender_full_name": "John Moehrke",
        "timestamp": 1593794400
    },
    {
        "content": "<p>That said, the multiplicy on signature is more to support variations on the type of signature (xml signature, json signature, ink signature). The expectation is that the signature would cover all the resources pointed to by the .target. In the case of xml signature, the xml signature standard covers the manifest of objects included and how they are seralized.</p>",
        "id": 202821448,
        "sender_full_name": "John Moehrke",
        "timestamp": 1593794525
    },
    {
        "content": "<p>OK thanks, I'll look into the signature standards.</p>\n<blockquote>\n<p>That said, the multiplicy on signature is more to support variations on the type of signature (xml signature, json signature, ink signature).</p>\n</blockquote>\n<p>This sounds a bit like the discussion around multiple entries in <code>DocumentReference.content</code> cf. <a href=\"https://jira.hl7.org/projects/FHIR/issues/FHIR-23732\">Issue #23732</a>. Might it similarly be worth extending the documentation in the spec to describe the meaning of/use cases for multiple signatures? - it was not clear to me from reading the current description (I'd be happy to put in an issue for it).</p>",
        "id": 202891585,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1593897181
    },
    {
        "content": "<p>There is much  that will happen in the signature space. We point at a page where we have itemized many issues that we can't resolve without engagement from the community actually using signature.</p>",
        "id": 202983704,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594039687
    }
]