[
    {
        "content": "<p>We are generating de-identified data and want to add security labels to the resources and bundles. One of the de-identification methods we use is perturbation, in which specific values are replaced with equally specific, but different, values. Date-shifting is one example of it. However, I do not see any  tag in the v3 value set that perturbation can map to.  <a href=\"https://www.hl7.org/fhir/v3/ObservationValue/cs.html#v3-ObservationValue-_SecurityObservationValue\" title=\"https://www.hl7.org/fhir/v3/ObservationValue/cs.html#v3-ObservationValue-_SecurityObservationValue\">https://www.hl7.org/fhir/v3/ObservationValue/cs.html#v3-ObservationValue-_SecurityObservationValue</a></p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> any recommendation?</p>",
        "id": 193524754,
        "sender_full_name": "Ranvijay Kumar",
        "timestamp": 1586476494
    },
    {
        "content": "<p>I would not think that one would label data with the method used for de-identification. I realize that there are some methods in the vocabulary, but they are in there more to be used in policy.</p>",
        "id": 193559919,
        "sender_full_name": "John Moehrke",
        "timestamp": 1586518081
    },
    {
        "content": "<p>The recommendation given on the security page <a href=\"http://build.fhir.org/secpriv-module.html#deId\" title=\"http://build.fhir.org/secpriv-module.html#deId\">http://build.fhir.org/secpriv-module.html#deId</a>  is to tag the data with the high-level method, not the specific method --  ANONYED, MASKED, PSEUDED, REDACTED. So the perturbation on some indirect-identifiers is specific to that element. The high-level method would be a statement of what was done to the dataset.</p>",
        "id": 193560232,
        "sender_full_name": "John Moehrke",
        "timestamp": 1586518371
    },
    {
        "content": "<p>the most specific would be to have recorded under authorized access only, the full algorithm used on the dataset including risk analysis, element analysis, methods, and proof. This record would be given a unique identifier, aka the policy. That policy unique identifier would be recorded in a Provenance.policy; where the Provenance.target points at all of the dataset. -- this is part of a CR <a href=\"http://jira.hl7.org/browse/FHIR-18874\" title=\"http://jira.hl7.org/browse/FHIR-18874\">J#18874</a> that I have been looking to write.<br>\nThe point of this, is that you can record the complete algorithm, but that it is very specific (and protected appropriately).</p>",
        "id": 193560526,
        "sender_full_name": "John Moehrke",
        "timestamp": 1586518712
    },
    {
        "content": "<p>Thanks for you response. Depending on the need one can apply masking, redaction, and pseudonymization at the same time on different elements of a resource. In such cases, what security label should be used at the high level? Should we use multiple labels, or pick one that broadly communicates the meaning?</p>",
        "id": 193602616,
        "sender_full_name": "Ranvijay Kumar",
        "timestamp": 1586543903
    },
    {
        "content": "<p>CR <a href=\"http://jira.hl7.org/browse/FHIR-18874\" title=\"http://jira.hl7.org/browse/FHIR-18874\">J#18874</a> looks very interesting. Looking forward to it.</p>",
        "id": 193602689,
        "sender_full_name": "Ranvijay Kumar",
        "timestamp": 1586543959
    }
]