[
    {
        "content": "<p>It's been brought to my attention that some members of the community are seeking to prohibit the use of GET for search requests in particular IGs, and possibly more broadly. </p>\n<p>I think we should have a clear view on this across the community. Some background:</p>\n<ul>\n<li>mostly, this is a question of logging - HTTP logs offer an access route to PHI through whatever PHI the URLs contain</li>\n<li>in general, HTTP logs do not log the body. At least, not by default. But they can, and sometimes do.  There is (and never will be) any normative rule that they can't </li>\n<li>any organization collecting logs of FHIR RESTful calls is a party to PHI and needs to manage their logs accordingly. Given a secure connection to the app server, only the organisation should have access to the call to log it</li>\n<li>I think we should assume that if the logging agent is malicious (MITM etc) they'll be logging the body as well</li>\n<li>other arguments for not using GET relate to web pages, not web applications (referrer, visible in the address bar for other users)</li>\n</ul>\n<p>For these reasons, the specification has never made any rule about this not using GET, but it does say that servers SHALL accept POST searches, mainly for this reason, so that clients can use POST instead of GET if they want.</p>\n<p>Individual IGs are welcome to make their own rules, but in general, I would recommend against hard SHALL NOT use GET, since this is actually based on bad threat analysis (as outlined above). I would recommend that <br>\n- we explain this a little better in the specification<br>\n- IGs repeat the guidance in the specification</p>",
        "id": 178790808,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571772808
    },
    {
        "content": "<p>I think it is appropriate for us to state that there exists a risk of un-managed audit logging (managed is by definition managed).  I do not see that this risk of un-managed audit logs is a rational to forbid the use of GET and mandate of use of POST. (especially as Grahame points out there is nothing stopping an un-managed audit log from logging POST body).</p>",
        "id": 178792423,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571773886
    },
    {
        "content": "<p>I would agree with the above. </p>\n<p>I agree in that there is a risk of propagating the \"misunderstanding\" of \"SHALL NOT use GET mitigates\" a certain risk. </p>\n<p>It also eliminates a potentially useful action (namely, GET) that may not have been fully explored or utilized.  I don't have anything particularly in mind for this, but it seems dreadfully overly restrictive for what such a prohibition would actually deliver.</p>\n<p>Finally, the existing recommendation to utilize https/secure transport mitigates much of this concern while addressing security in turn by measures at the proper layers of the OSI model.</p>",
        "id": 178796475,
        "sender_full_name": "Matt Blackmon",
        "timestamp": 1571776411
    },
    {
        "content": "<p>Do we have anything about this in a security guide? It's such a common misunderstanding, I'm curious if we have a similar list of bullets and considerations for reference</p>",
        "id": 178799751,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571778667
    },
    {
        "content": "<p>I know we've talked about this quite a bit over the years</p>",
        "id": 178799780,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571778704
    },
    {
        "content": "<p>We could also add guidance in the IG- guidance IG.</p>",
        "id": 178800007,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571778944
    },
    {
        "content": "<p>Adding my comment for the Security WG RE this:<br>\n<a href=\"https://confluence.hl7.org/display/SEC/Share+with+Protection+-+Technical+Approaches?refresh=1571761141503&amp;refresh=1571761208716&amp;focusedCommentId=66926111&amp;refresh=1571770267086#comment-66926111\" target=\"_blank\" title=\"https://confluence.hl7.org/display/SEC/Share+with+Protection+-+Technical+Approaches?refresh=1571761141503&amp;refresh=1571761208716&amp;focusedCommentId=66926111&amp;refresh=1571770267086#comment-66926111\">https://confluence.hl7.org/display/SEC/Share+with+Protection+-+Technical+Approaches?refresh=1571761141503&amp;refresh=1571761208716&amp;focusedCommentId=66926111&amp;refresh=1571770267086#comment-66926111</a></p>\n<p>There's also some draft language if we want to address and mention this in the security/privacy page.</p>\n<p>I also think that instead of a SHALL NOT, we should suggest this as a possible design choice which mitigates some risks.</p>",
        "id": 178801427,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1571780101
    },
    {
        "content": "<p>Interesting on assumption of TLS terminating. In public clouds, we've been given guidance that TLS in transit is recommended for all sensitive health data (which would matter depending on how deep the stack/logging goes)</p>",
        "id": 178801584,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571780272
    },
    {
        "content": "<p>I know of a few frameworks that default to logging bodies on POSTs for failure</p>",
        "id": 178801636,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571780287
    },
    {
        "content": "<p>And a few reverse proxies that parse bodies for similar TLS or URL manipulation issues for architectures referenced there</p>",
        "id": 178801668,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571780322
    },
    {
        "content": "<p>(to make sure the URL going outbound matches what the caller used inbound when behind a termination or proxy of some sort)</p>",
        "id": 178801688,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571780348
    },
    {
        "content": "<p>Essentially: everything your data transits through unencrypted has to be considered part of the model to protect data</p>",
        "id": 178801714,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571780383
    },
    {
        "content": "<blockquote>\n<p>Do we have anything about this in a security guide?</p>\n</blockquote>\n<p>No. Hence my proposal above to say something explicitly</p>",
        "id": 178802673,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571781308
    },
    {
        "content": "<p>RE • GG \"any organization collecting logs of FHIR RESTful calls is a party to PHI and needs to manage their logs accordingly. Given a secure connection to the app server, only the organisation should have access to the call to log it\"</p>\n<p>Unfortunately, it doesn't matter that the organization has access to the logs in scenarios where the entities accessing the PHI in logs have no laws restricting how they use PHI, in particular, where a US consumer releases PHI to entities not governed by HIPAA (and now no longer PHI and perhaps vaguely governed by Consumer Protection laws), perhaps it makes sense for IG authors to restrict queries to POST especially when their IGs are about \"Consumer-centric control of their information.  </p>\n<p>Thankfully, some are developing API consumer privacy protective guidelines such as Xcertia Guidelines <a href=\"https://xcertia.org/wp-content/uploads/2019/08/xcertia-guidelines-2019-final.pdf\" target=\"_blank\" title=\"https://xcertia.org/wp-content/uploads/2019/08/xcertia-guidelines-2019-final.pdf\">https://xcertia.org/wp-content/uploads/2019/08/xcertia-guidelines-2019-final.pdf</a> and CARIN Alliance Code of Conduct <a href=\"https://www.carinalliance.com/wp-content/uploads/2019/05/2019_CARIN_Code_of_Conduct_05082019.pdf\" target=\"_blank\" title=\"https://www.carinalliance.com/wp-content/uploads/2019/05/2019_CARIN_Code_of_Conduct_05082019.pdf\">https://www.carinalliance.com/wp-content/uploads/2019/05/2019_CARIN_Code_of_Conduct_05082019.pdf</a>, which may decide that restrictive conformance requirements are appropriate for the policy context in which they operate. Providing approaches to Sharing Consumer Information with Protections would be a useful FHIR P&amp;S, to which IGs wishing to distinguish their Consumer Centric Capabilities could assert conformance.</p>",
        "id": 178806936,
        "sender_full_name": "k connor",
        "timestamp": 1571785266
    },
    {
        "content": "<blockquote>\n<p>in scenarios where the entities accessing the PHI in logs have no laws restricting how they use PHI, in particular, where a US consumer releases PHI to entities not governed by HIPAA (and now no longer PHI and perhaps vaguely governed by Consumer Protection laws), perhaps it makes sense for IG authors to restrict queries to POST</p>\n</blockquote>\n<p>That's the core confusion here: if the organization is collecting logs, it doesn't matter whether you use a post or a get since they may collect the bodies.</p>",
        "id": 178808191,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571786421
    },
    {
        "content": "<p>Those able to log PHI because they're the end point is one problem that can't be solved with POST vs GET.  It's the intermediaries logging the GET HTTP headers, who aren't even covered by the Consumer Protection Laws that are the other issue.</p>",
        "id": 178809046,
        "sender_full_name": "k connor",
        "timestamp": 1571787308
    },
    {
        "content": "<ol>\n<li>\n<p>There should be no intermediaries not covered by consumer protection laws. How would that happen?</p>\n</li>\n<li>\n<p>If there are such intermediaries, they can log the POST bodies too, and sometimes do.</p>\n</li>\n</ol>\n<p>The whole idea that intermediaries only log the URL is bad security analysis that we shouldn't allow</p>",
        "id": 178809340,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571787633
    },
    {
        "content": "<p>The US FTC has some consumer protection laws if the terms of agreement in Apps are not followed. No protections against intermediaries for the most part.  Even HIPAA X12 transactions have to be opened beyond the envelope by whatever Clearinghouse among any number of Clearinghouses (and not necessarily with Business Associate Agreements with the Source/Recipient Covered Entity) happens to need to find out the transaction end points.  Likely there needs to be more analysis/research on existing analysis about the lack of protections by intermediaries.  I don't think any of us has enough research to make any assertions about what intermediaries are doing with GET Header or POST Header/Body.  Doesn't hurt to try to minimize damage.  Suggest that a more comprehensive review of the literature/practices be done so that we can give appropriately tuned guidance about the risks HL7 implementers should be considering/mitigating against.</p>",
        "id": 178813348,
        "sender_full_name": "k connor",
        "timestamp": 1571791990
    },
    {
        "content": "<p>May want to check out Data sharing practices of medicines related apps and the mobile ecosystem: traffic, content, and network analysis BMJ 2019; 364 doi: <a href=\"https://doi.org/10.1136/bmj.l920\" target=\"_blank\" title=\"https://doi.org/10.1136/bmj.l920\">https://doi.org/10.1136/bmj.l920</a> (Published 20 March 2019)</p>",
        "id": 178813564,
        "sender_full_name": "k connor",
        "timestamp": 1571792284
    },
    {
        "content": "<p>Here's FTC Medical App guidance <a href=\"https://www.ftc.gov/tips-advice/business-center/guidance/mobile-health-app-developers-ftc-best-practices\" target=\"_blank\" title=\"https://www.ftc.gov/tips-advice/business-center/guidance/mobile-health-app-developers-ftc-best-practices\">https://www.ftc.gov/tips-advice/business-center/guidance/mobile-health-app-developers-ftc-best-practices</a></p>",
        "id": 178813757,
        "sender_full_name": "k connor",
        "timestamp": 1571792493
    },
    {
        "content": "<p>The ONC and CMS interoperability rules are going to require providers to push health information to consumers via apps at a pace never before seen. There are no substantive privacy protections for consumers using apps and since the information is leaving the covered entity space, HIPAA obviously won't apply. Certified APIs should need to check for app attestation to whether they adhere to industry guidelines around app development and data use (Xcertia Guidelines, CARIN Code of Conduct, FTC Best Practices), as well as whether they provide consumers with easy-to-understand, model privacy notices (e.g., ONC's Model Privacy Notice).  Otherwise apps are free to do what they want with health information on patients and their families.</p>",
        "id": 178813982,
        "sender_full_name": "Laura Hoffman",
        "timestamp": 1571792712
    },
    {
        "content": "<p>right. So obviously there are concerns here, and only using POST is a mitigation.. but my point is - it's a very minor mitigation, far less than people think. Doing your client crypto good is a far better protection, to reduce the prospect of accidental leakage - you will be connected directly to the source, who can log whatever they want</p>",
        "id": 178815105,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571793871
    },
    {
        "content": "<p>Intermediaries <em>can</em> indeed log POST bodies but in most cases they don't because that will lead to large volume of log data. It's much more likely for intermediaries to log URLs than full HTTP bodies. Note that this is about the customery configurations rather than what each entity can <em>technically</em> see and log. <br>\nAs I mentioned in the writeup for the security WG, we can't deny that URLs are usually more <em>exposed</em> in logs compared to POST bodies. <br>\nI copy the example from a heroku default router log which is created after TLS termination. We see the URL parameters and the source IP which is very common to log.</p>\n<div class=\"codehilite\"><pre><span></span>2019-10-21T14:20:41-07:00 test heroku/router at=info method=GET path=&quot;/endpoint?parameter1=value1&quot; host=test.herokuapp.com request_id=87eef4da-3eb2-4cdc-a9ee-914607fbbaa9 fwd=&quot;70.66.172.102&quot; dyno=web.1 connect=0ms service=42ms status=200 bytes=515 protocol=https\n</pre></div>\n\n\n<p>Once again, people can configure things to cease generating these logs or filter them. What we are saying is that using POST is <em>also</em> an additional mechanism to subject sensitive parameters to less exposure and mitigate the risk of exposure via logs due to possible misconfiguration. This is not about a definitive prescription; it's just bringing to attention a possible mitigating measure.</p>",
        "id": 178815123,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1571793897
    },
    {
        "content": "<p>so I agree to bring it people's attention as a mitigating factor. But not to support that by bad analysis.</p>",
        "id": 178819939,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571801898
    },
    {
        "content": "<p>In these cases, who are the intermediaries that have access to the unencrypted payload but are NOT covered by your BA/within your 4 walls? If they're part of the consumer side app only (which is a concern we all have re:how a patient will choose a good/well behaving app that they can trust with their health data), how does doing a POST help if the data is unencrypted and traveling through this system?</p>",
        "id": 178856634,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571839518
    },
    {
        "content": "<p>Even if you ignore the body and URL, there are sensitive authentication headers passing through these systems unencrypted... which is even scarier</p>",
        "id": 178856790,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571839610
    },
    {
        "content": "<p>I'm confused.</p>\n<p>If third parties are logging details from inside requests, the channel isn't secure and the data is compromised (e.g., they are in the channel, so  request parameters are the least of your concerns - someone has access to your server's responses, can impersonate clients, etc.).</p>\n<p>If an implementer is logging their own requests, I would assume the guidance should be to treat logs as if they contain/are PHI (e.g., having a sequence of resource/terminology requests from a particular IP Address can likely be considered PHI).  The GET/POST discussion is then just about how <em>much</em> PHI you tend to leak.</p>\n<p>I worry that framing it as anything other than that would give the impression that logging GET requests results in clean logs.</p>",
        "id": 178866718,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1571845350
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I agree.</p>\n<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span>  When an app is deployed on the cloud provider, arguably, it's already out of the organization's \"4 walls\" and you're trusting the cloud provider. The traffic is in plaintext after TLS termination until it hits the webservers (original traffic attributes are added in <code>X-forwarded</code> headers to inform the app that the traffic was originally https). The argument is that the traffic is plaintext inside the cloud provider network and between their servers (between router/loadbalancers and the app containers) and you already have trusted the cloud provider (they already have your entire app and its secrets hosted on their servers and could technically access its traffic from within the app/container). I agree with you nonetheless that this deployment model, especially TLS termination, is risky.</p>",
        "id": 178866747,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1571845371
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> I definitely agree that this should not be framed to give the impression that using POST <em>makes</em> logs secure. Like I said earlier, this is just to highlight one possible mitigating measure with respect to common logging configurations.</p>",
        "id": 178867265,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1571845664
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span>  The cloud providers we've worked with tell us that we need/should/must encrypt traffic in transit within their systems if it contains any sensitive data. Any logs written during that are typically secured and what goes in them is governed by sensitivity rules.</p>",
        "id": 178868890,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571846752
    },
    {
        "content": "<p>The URLs are the least of your worries here</p>",
        "id": 178868995,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571846826
    },
    {
        "content": "<p>I understand that and I agree. What I'm saying is that, again, we're not saying this is a solution for keeping traffic confidential on a cloud provider's network. It's a mitigating measure with respect to common logging configurations and practices.</p>",
        "id": 178869145,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1571846934
    },
    {
        "content": "<p>But another common configuration in most public clouds is a way to \"trace\" or \"debug\" those calls. This typically logs all data</p>",
        "id": 178869187,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571846968
    },
    {
        "content": "<p>And while some provide ways to filter out those logs by blacklisting certain fields, that won't help for bodies (where almost everything is sensitive or PII)</p>",
        "id": 178869212,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571846987
    },
    {
        "content": "<p>We could take this to the extreme and talk about buckets left misconfigured and open to the public, which is more common than most would want as well</p>",
        "id": 178869293,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571847032
    },
    {
        "content": "<p>But the result is the same: you have to secure you system with intention and confirm</p>",
        "id": 178869308,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571847047
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191920\">@Mohammad Jafari</span> , I understand what you are saying, but I disagree.</p>\n<p>In your Confluence post, you say:</p>\n<blockquote>\n<p>It is always emphasized to developers to make sure they do not log any sensitive data in the application logs because logs are usually subject to fewer protective measures ... So developers must be constantly reminded to ensure they remove sensitive parameters if they are logging the HTTP URL ...</p>\n</blockquote>\n<p>I think we need the opposite guidance, saying that logs <em>are</em> sensitive data and MUST be treated as such.  If that means changing the vetting process for a cloud provider or changing how the system is designed, that is what a developer should do.</p>\n<p>If we consider a sequence: <code>POST-search</code>, <code>GET-Patient/xyz</code>, <code>GET-snomed/103412005</code>, from an IP address that resolves to a physical address (not  uncommon where I live), this log gives a strong hint that someone at that location is patient 'xyz' and they have an HIV result.  Implicit in this data are also items like which facility this patient receives care from, etc.</p>\n<p>If the chain includes something like a medication request or terminology lookup for a medication, it is easy to tell the result is positive.</p>\n<p>Other chains reveal plenty of information as well, like receiving requests for four different patients (GET by ID) in the same session to reveal relationships, etc.</p>\n<p>In my mind, this is all PHI.  What is gained by providing/following that guidance?</p>",
        "id": 178869322,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1571847057
    },
    {
        "content": "<p>We should definitely have guidance that calls all of this out, and not send the wrong signal that POST is helping someone not need to think about the intricacies here.</p>",
        "id": 178869361,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1571847088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> I agree. these are addressed in my initial write-up on top of that confluence page (above the comment).</p>",
        "id": 178869636,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1571847244
    },
    {
        "content": "<p>I think the intention of The POST vs. GET has been misunderstood here. This is not intended to <em>solve</em> one or all of the confidentiality and inference problems. It's one possible mitigating measure which we propose should be noted. That's all.</p>",
        "id": 178869914,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1571847402
    },
    {
        "content": "<p>But I understand from this conversation that the framing is crucial and it can be counterproductive if this is framed incorrectly to give such an impression.</p>",
        "id": 178870271,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1571847603
    }
]