[
    {
        "content": "<p>What does a purpose of use label on a request resource mean?  For example I have Task to fetch some data.  If it had a <a href=\"http://meta.security\">meta.security</a> of COVERAGE.  What does that mean exactly?</p>\n<ol>\n<li>The Task POU is COVERAGE ?</li>\n<li>The completed Task including the references to <code>Task.output</code> POU is COVERAGE ? ( breaking the rule on prohibiting context conduction)</li>\n<li>Does is at least communicate that the Task.output POU should be COVERAGE?</li>\n<li>Do you have to label all the output resources with POU = Coverage?</li>\n<li>What if they are contained?</li>\n</ol>",
        "id": 248560718,
        "sender_full_name": "Eric Haas",
        "timestamp": 1628217523
    },
    {
        "content": "<p>I am not clear what you mean by \"request resource\".</p>",
        "id": 248611225,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628256881
    },
    {
        "content": "<p>A tag on data, should be 'meta' about that data.   Thus if one sees a purposeOfUse vocabulary tag on a FHIR Resource (.meta.security), I would understand that as the purpose of use for which that data was captured. (This following privacy principles that data are captured for given purposes and are only allowed to be used for the purposes for which the data were captured. Where secondary use beyond those initial purposes must be explicitly authorized (Consent).)</p>",
        "id": 248611510,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628257015
    },
    {
        "content": "<p>In an EHR, the data is implicitly known to have TPO (TREAT + HPAYMT + HOPERAT). The data could be explicitly labeled this way, but often is not due to it being obvious.</p>",
        "id": 248611766,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628257143
    },
    {
        "content": "<p>I have proposed that transaction outputs are an appropriate place to tag the transaction Bundle with context of the authorized communication. Thus a Query Response Bundle may be tagged with the PurposeOfUse(s) for which the data are authorized to be used by the recipient. This would be at the Bundle level, as it is a condition of release. The resources in the bundle would not have this decoration as the meta of the data is possibly different than the meta of the bundle.</p>",
        "id": 248612071,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628257285
    },
    {
        "content": "<p>This all said.. you are asking about Task resource. and I am unclear what you are looking for with these questions on Task.  I would expect Task to be no different than any data. It is just another FHIR resource.</p>",
        "id": 248612201,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628257337
    },
    {
        "content": "<p>If the question is around the use of the word \"authorization\" used in the description meaning of the Task resource, this authorization is a business authorization; not a security/privacy. The business authorization (this process can happen because the business is happy it should happen) should be informed and supported by security and privacy; but is a different level of decision.  Thus this is simply yet-another-meaning of the word \"authorization\" (contextual meaning).</p>",
        "id": 248612464,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628257468
    },
    {
        "content": "<p>Request resource is anything that implements (or is supposed to implement) the Request pattern.  I think Eric's question is whether the purposeOfUse on a Request refers to the purpose of the request being shared, or of the purpose of the results of the request.</p>",
        "id": 248639665,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628269804
    },
    {
        "content": "<p>by request resources, I mean resources like servicerequest, task, communicationrequest.  I am not talking about authorization,  I am talking about the POU for the request.</p>\n<blockquote>\n<p>I would understand that as the purpose of use for which that data was captured.</p>\n</blockquote>\n<p>would this mean that if I requested resource X using a request resource with POU of COVERAGE then the resource X ( Bundle or some other resource) that is returned to me would implicitedly have a POU of COVERAGE- would that need to be explicit and spelled out by tagging the returned data too?</p>",
        "id": 248640573,
        "sender_full_name": "Eric Haas",
        "timestamp": 1628270214
    },
    {
        "content": "<blockquote>\n<p>the purposeOfUse on a Request refers to the purpose of the request being shared, or of the purpose of the results of the request.</p>\n</blockquote>\n<p>These are the same to me</p>",
        "id": 248640677,
        "sender_full_name": "Eric Haas",
        "timestamp": 1628270267
    }
]