[
    {
        "content": "<p>Hi All,</p>\n<p>This is regarding FHIR resource validation and XSS attack. I would like to seek advice from the community about suggestion and recommendations on FHIR input validation on cross site scripting (XSS) attack. </p>\n<p>For instance a client can interpret JavaScript instructions used by a threat actor to conduct a cross site scripting (XSS) attack . For example, the datatype for 'givenName' under HumanName is string and the attacker can send it as &lt;script&gt; somescript&lt;/script&gt; which may blow up the portal screen when the resource is read. <br>\nI guys these rules varies from project to project but just wanted to check with the group to understand if there is any common FHIR guideline in this space</p>",
        "id": 199705492,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1591246809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 199705604,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591246980
    },
    {
        "content": "<blockquote>\n<p>the attacker can send it as &lt;script&gt; somescript&lt;/script&gt;</p>\n</blockquote>\n<p>how would they do that?</p>",
        "id": 199714144,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591256636
    },
    {
        "content": "<p>however: there is no conformant way to do this, and there is no way to do this that is not tested by the validator.</p>",
        "id": 199714202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591256655
    },
    {
        "content": "<p>one of my todo items is to add a flag to the validator so that it runs in security mode - it only enforces security related rules (very very fast compared to everything else it does)</p>",
        "id": 199714238,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591256690
    },
    {
        "content": "<p>I presume you are asking about elements in FHIR Resources that can carry XHTML?  <a href=\"http://build.fhir.org/security.html#narrative\">http://build.fhir.org/security.html#narrative</a> <br>\nIn these cases we have limited the xhtml capabilities.  <a href=\"http://build.fhir.org/narrative.html#security\">http://build.fhir.org/narrative.html#security</a><br>\nAre you asking for advice on how to do that check in your code? That would be an implementation detail, you might find solutions in some of the open-source projects, but it would not be something that would be said in the core FHIR spec.</p>",
        "id": 199741012,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591274950
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/XSS.20Attack/near/199714144\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>the attacker can send it as &lt;script&gt; somescript&lt;/script&gt;</p>\n</blockquote>\n<p>how would they do that?</p>\n</blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I will collect more information about the scenario from our project security team and provide the details.</p>",
        "id": 199824850,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1591316521
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/XSS.20Attack/near/199741012\">said</a>:</p>\n<blockquote>\n<p>I presume you are asking about elements in FHIR Resources that can carry XHTML?  <a href=\"http://build.fhir.org/security.html#narrative\">http://build.fhir.org/security.html#narrative</a> <br>\nIn these cases we have limited the xhtml capabilities.  <a href=\"http://build.fhir.org/narrative.html#security\">http://build.fhir.org/narrative.html#security</a><br>\nAre you asking for advice on how to do that check in your code? That would be an implementation detail, you might find solutions in some of the open-source projects, but it would not be something that would be said in the core FHIR spec.</p>\n</blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> This can be applied  at any element in a FHIR resource  which is defined as String. I am trying to findout if there is generic guideline from FHIR on XSS Attack</p>",
        "id": 199826027,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1591317853
    },
    {
        "content": "<p>yes our generic guidance is: don't allow it. I don't understand this:</p>\n<blockquote>\n<p>This can be applied at any element in a FHIR resource which is defined as String</p>\n</blockquote>\n<p>Unless you mean, someone could be foolish enough to forget to escape a user-supplied string value when building an output html page... sure. That could happen. We can't stop stupid. I suppose it would be good to provide some attack examples</p>",
        "id": 199829081,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591321750
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193760\">@Shovan Roy</span> I welcome a Change Request with the words you would like to see at the location you would like to see them. The specification is a work of the community, you are part of that community.</p>",
        "id": 199866730,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591358911
    },
    {
        "content": "<p>I tend to think that all of these are not unique to FHIR, and are already better covered in general IT web app and API security frameworks.</p>",
        "id": 199867306,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591359313
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> </p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I agree that \"XSS Attack\" is more of a general IT web app and API security topic. As I mentioned in my initial post, \"XSS Attack\" prevention strategy may highly vary from project to project and may not be appropriate to say something generic, but thought of verifying this with the community. <br>\nWhen I looked at the security page(<a href=\"https://www.hl7.org/fhir/security.html\">https://www.hl7.org/fhir/security.html</a>), I can see good degree of details provided already. For an example clarity is provided on 'Digital Signature\". (Though I am unclear on how to use Provenance resource as signature of a HTTP Read in a JSON based interaction, but that's  a separate topic to this one. That something I have to explore more) <br>\nI can see another point \"11. Input Validation\" which talks about injection attack, however clicking that link on \"Input Validation\" is taking me to \"Narrative\"<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , in our project, we are trying to ensure we block receiving information which may contain script attack (e.g.:&lt;script&gt; somescript&lt;/script&gt;) before persisting in our database.  I am yet to receive more details on the attack example from the project security team and I will keep you updated on this.</p>",
        "id": 200163954,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1591655577
    },
    {
        "content": "<p>the only place you can get <code>&lt;script&gt; somescript&lt;/script&gt;</code> is in the narrative - that's why we talk about it</p>",
        "id": 200168016,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591659020
    },
    {
        "content": "<blockquote>\n<p>the only place you can get <code>&lt;script&gt; somescript&lt;/script&gt;</code> is in the narrative - that's why we talk about it</p>\n</blockquote>\n<p>I think for the XML representation, it is the only place that passes schema validation - maybe that is a detail that may not be always obvious...</p>",
        "id": 200170228,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1591661104
    },
    {
        "content": "<p>well, I think that you can make up any kind of xml you like, but it won't be valid. The standard has to assume that the resources are valid.</p>",
        "id": 200170519,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591661449
    },
    {
        "content": "<p>but that's why there's going to be a security checks version in the validator</p>",
        "id": 200170536,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591661472
    },
    {
        "content": "<p>In our implementation, we are using JSON. I will have to check if \"lastName\": \"abcd&lt;script&gt;somescript&lt;/script&gt;\" is valid as data. <br>\nwill wait for the security check version of the validator</p>",
        "id": 200170680,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1591661600
    },
    {
        "content": "<p>the validator will call that valid content, unless you apply a regex to the element in your profile. However, the fact that this contains a character sequence that is meaningful html in a plain string reminds me of this: <a href=\"https://xkcd.com/327/\">https://xkcd.com/327/</a></p>\n<p><strong>Always escape your inputs when rendering to HTML</strong></p>",
        "id": 200170979,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591661897
    },
    {
        "content": "<p>.. and we didn't write this into the spec because, honestly... how could you not?</p>",
        "id": 200170988,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591661922
    },
    {
        "content": "<p>Thanks Grahame, in our implementation, since we are data hub, we don't know in what form and in which level data tampering can happen. Our source of data could be varies client systems (web based/integration system etc) who are not controlled by us.  We are trying to make sure that once we receive the data, we validate it and thus the whole point of rejecting the request if it has any injection attack content.  I will explore applying regex to the profile content.</p>",
        "id": 200171847,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1591662760
    },
    {
        "content": "<p>all right the next release of the validator will support the parameter <code>-security-checks</code>. In this mode, it will return an error if any string value has anything that looks like an HTML tag in it. Note that this check doesn't apply to xhtml, obviously, since that will contain HTML tags. Note that it already checks that there's no active content in the xhtml, and it'd be nice if your security team tried to penetrate the validator on this</p>\n<p>Technically, for those interested, the content is considered a security risk if the string content contains any text between a <code>&lt;</code> and a <code>&gt;</code> that meets this regex: <code>[a-zA-Z]\\w*(((\\s+)(\\S)*)*)</code></p>",
        "id": 200180431,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591675395
    },
    {
        "content": "<p>this is not the same as 'security checks only' - I'll work on that later</p>",
        "id": 200180436,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591675425
    },
    {
        "content": "<p>Will the security checks run for default validation too - e.g. when using the publisher?</p>",
        "id": 200181760,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591677537
    },
    {
        "content": "<p>no. Rules are different there</p>",
        "id": 200185505,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591683674
    },
    {
        "content": "<p>I think that is a wrong test. This is valid string.  To add a random html script check while not looking for 100% scripting languages is security-theater. Why not look for UNIX command-line script, DOS command-line script, adobe postscript script, even fonts have script (ADV200006).</p>",
        "id": 200216263,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591705080
    },
    {
        "content": "<p>further you would only be finding single depth attacks. What about double escaping attacks?</p>",
        "id": 200216380,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591705140
    },
    {
        "content": "<p>doing more than validating against the FHIR datatype definition may seem like a good idea, but it is something that you must do completely, while not having false-positives or false-negatives.</p>",
        "id": 200216502,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591705217
    },
    {
        "content": "<blockquote>\n<p>Why not look for UNIX command-line script, DOS command-line script, adobe postscript script,</p>\n</blockquote>\n<p>because no one asked. And HTML+SQL issue is 99%+ of non-movie threats</p>",
        "id": 200220938,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591706486
    },
    {
        "content": "<p>but maybe you could explain how double escaping attacks are in scope here?</p>",
        "id": 200221076,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591706551
    },
    {
        "content": "<p>my point was not to encourage you to add more tests, but rather to stop at validating purely to the datatype specification. As soon as you try to go beyond, you go over a cliff.</p>",
        "id": 200224237,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591708221
    },
    {
        "content": "<p>If security validation is going to yell about an example, the publisher should yell about it too.  (In part so we can check if the security validation is being over-zealous.)</p>",
        "id": 200234707,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591712412
    },
    {
        "content": "<p>by default, the validator stops at the data type specfication</p>",
        "id": 200280467,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591732196
    },
    {
        "content": "<p>For performance reasons?</p>",
        "id": 200284990,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591734217
    },
    {
        "content": "<p>no for conformance reasons. If you want more, you have to ask for it</p>",
        "id": 200285480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591734478
    },
    {
        "content": "<p>I'm not really following.  My concern is creating an implementation guide that contains an example that would trigger this security validation issue.  Wouldn't we want to know if we were publishing content that was going to create a security warning?  (Either because we'd done something inappropriate in the example, or because the security warning was being triggered in inappropriate circumstances.)</p>",
        "id": 200286135,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591734771
    },
    {
        "content": "<p>I certainly don't expect IG authors t manually trigger validation with custom settings when they're authoring their stuff...</p>",
        "id": 200286198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591734801
    },
    {
        "content": "<p>umm, I was explaining why the validator defaults to conformance to the specification</p>",
        "id": 200288737,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591735968
    },
    {
        "content": "<p>So the publisher <em>could</em> check this too?</p>",
        "id": 200293905,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591738499
    },
    {
        "content": "<p>it could.</p>",
        "id": 200295738,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591739547
    },
    {
        "content": "<p>Is there any reason why we think it shouldn't?</p>",
        "id": 200296287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591739863
    },
    {
        "content": "<p>I think there are diminishing returns to adding this kind of a check to the IG build. We don't have any evidence that an IG author is going to be including an attack like this, and if they were they would just escape it around the validator. Thus we would just be slowing down 100% of legitimate IG publishing for the sake of the non-existent chance.</p>",
        "id": 200409762,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591792652
    },
    {
        "content": "<p>I'm actually more interested in IGs containing tags in text that are there for legitimate reason and making sure our validation process doesn't yell about them.</p>",
        "id": 200426424,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591800610
    },
    {
        "content": "<p>that'll still crop up as a hint not an error</p>",
        "id": 200469193,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591819356
    },
    {
        "content": "<p>actually, maybe the most useful thing I could do would be autogenerate a set resources that include exploit text as part of generating an IG</p>",
        "id": 200471064,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591820345
    },
    {
        "content": "<p>I don't understand what you're proposing...</p>",
        "id": 200480544,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591825186
    }
]