[
    {
        "content": "<p>I created a branch on a clone of master core.. it is not building... but I started another clone that is building... so How do I abandon the branch on the bad clone, and kill that old clone so I get my harddrive (ssd) space back?</p>",
        "id": 154013323,
        "sender_full_name": "John Moehrke",
        "timestamp": 1540837080
    },
    {
        "content": "<p>I'm not sure what you mean by a \"clone\".  If you want to delete a local branch, click on \"switch branches\", click on the elipses, right-click on the local branch and hit \"delete\".</p>",
        "id": 154013334,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540839047
    },
    {
        "content": "<p>I am not sure about terminology with GIT... so I said clone, as that is the first step one takes <a href=\"https://github.com/HL7/fhir/wiki/Using-TortoiseGit-with-FHIR#create-a-local-clone\" target=\"_blank\" title=\"https://github.com/HL7/fhir/wiki/Using-TortoiseGit-with-FHIR#create-a-local-clone\">https://github.com/HL7/fhir/wiki/Using-TortoiseGit-with-FHIR#create-a-local-clone</a></p>",
        "id": 154013341,
        "sender_full_name": "John Moehrke",
        "timestamp": 1540839780
    },
    {
        "content": "<p>my previous clone is failing on build... so I did another clone to a different location on my local drive... the new clone builds... so I want to abandon the old failing clone</p>",
        "id": 154013342,
        "sender_full_name": "John Moehrke",
        "timestamp": 1540839829
    },
    {
        "content": "<p>I do have a branch on that old broken clone... so I figure I must first kill that branch, before I can kill the  clone</p>",
        "id": 154013343,
        "sender_full_name": "John Moehrke",
        "timestamp": 1540839898
    },
    {
        "content": "<p>I still can't get rid of this. If I try as Lloyd has recommended --- Could not delete reference. libgit2 returned: cannot delete branch 'refs/heads/moehrke_ii' as it is the current HEAD of the repository</p>",
        "id": 154013387,
        "sender_full_name": "John Moehrke",
        "timestamp": 1540845733
    },
    {
        "content": "<p>If it's just a local copy, you can delete the copy.  If you've committed a branch, your other copy will retrieve that branch and make it available to switch to locally.  If you never committed, then deleting the copy will delete the only reference to the local branch.  It'll also delete any changes you've made to files in that copy.</p>",
        "id": 154013401,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540847376
    }
]