[
    {
        "content": "<p>I'm having a challenge getting the -intro.md  and -notes.md files included with the StructureDefinition resources I'm creating using the IG Builder.  I'm sure it's something simple, like I'm not putting them in the right place, or not doing something to tell the system where to find them, or similar, but I cannot figure out what I'm doing wrong, and I can't find an example project using them to show me how to do it write.</p>\n<p>If you are using -notes.md or -intro.md with your StructureDefinition files in your IG Builder project, send me a link to where I can find them so I can see what I'm doing wrong.</p>",
        "id": 188400684,
        "sender_full_name": "Keith Boone",
        "timestamp": 1581966416
    },
    {
        "content": "<p>your intro and notes need to be listed in your implementationGuide xml, where as the structureDefinitions will be found</p>",
        "id": 188402330,
        "sender_full_name": "John Moehrke",
        "timestamp": 1581968338
    },
    {
        "content": "<p>are you using a template?</p>",
        "id": 188412863,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1581981849
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> That's not correct.  The intro and markdown should files should be put in the same folder as other pages.  The filenames should be the same as the page name on which the intro or notes should appear.  E.g. StructureDefinition-someid.md</p>",
        "id": 188414398,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581984254
    },
    {
        "content": "<p>(Assuming you're using the current base template or one derived from it.</p>",
        "id": 188414404,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581984270
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I dunno.  I'm building an IHE IG, so I assume so, and that I'm using the IHE specified templates (because I get the IHE logo and such)</p>",
        "id": 188415506,
        "sender_full_name": "Keith Boone",
        "timestamp": 1581986153
    },
    {
        "content": "<p>IHE template is not updated for that yet. more discussion in IHE stream</p>",
        "id": 188422548,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1581999152
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 188422596,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1581999289
    }
]