[
    {
        "content": "<p>I need some help understanding using the solicited communication with Task. Reading this (<a href=\"http://hl7.org/fhir/us/davinci-cdex/2019Jun/Request_(Solicited_Communication).html#solicited-communication-with-task\">http://hl7.org/fhir/us/davinci-cdex/2019Jun/Request_(Solicited_Communication).html#solicited-communication-with-task</a>) it is unclear when the Information Request Sender actor creates the Task. After the communication request?</p>",
        "id": 232821704,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1617309643
    },
    {
        "content": "<p>And why does the profiled Task focus on an instance of a Communication rather than a CommunicationRequest? Is the idea here that the Information Request Sender must first POST a CommunicationRequest, wait for receipt of a Communication, and then POST the Task? That doesn't make sense.</p>",
        "id": 232821767,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1617309677
    },
    {
        "content": "<p>And in the Solicited Communication without Task (which seems straightforward), how would errors get communicated? For example, no document could be located for the specified patient for the specified encounter?</p>",
        "id": 232822832,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1617310167
    },
    {
        "content": "<p>Sequence diagrams would help. The existing diagrams are confusing. For example, after POST of a Task, the label in the Receiver column says to the received Task explains what to do with CommunicationRequest. So why, again, is Task referencing a Communication in the focus property and not the CommunicationRequest?</p>",
        "id": 232825354,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1617311281
    },
    {
        "content": "<p>note that the <a href=\"http://build.fhir.org/ig/HL7/davinci-ecdx/\">CDEX</a> and <a href=\"http://build.fhir.org/ig/HL7/davinci-ehrx/\">HREX</a> guides have been completely rewritten and are currently undergoing ballot reconciliation.  Check out the HREX build for the overview of <a href=\"http://build.fhir.org/ig/HL7/davinci-ehrx/\">Task</a> and the corresponding <a href=\"http://build.fhir.org/ig/HL7/davinci-ecdx/specification.html#task-based-approach\">Task based approach</a> in CDEX</p>",
        "id": 232851182,
        "sender_full_name": "Eric Haas",
        "timestamp": 1617329416
    }
]