[
    {
        "content": "<p>Obviously we're going to need a hook to cover patient-independent hook, as the existing CDS Hooks have patientId as a mandatory element.  However, I'm wondering whether we should leverage the existing <a href=\"https://cds-hooks.org/hooks/medication-prescribe/\" target=\"_blank\" title=\"https://cds-hooks.org/hooks/medication-prescribe/\">medication-prescribe</a> and <a href=\"https://cds-hooks.org/hooks/order-review/\" target=\"_blank\" title=\"https://cds-hooks.org/hooks/order-review/\">order-review</a> hooks for patient-identified action.  Those are the natural business locations to invoke checks from and they already have some of the key information built in.  All we'd need to add is an expectation for support for retrieving the patient's Coverage resources, presumably as part of pre-fetch.  <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> <span class=\"user-mention\" data-user-id=\"191929\">@Jeff Danford</span> <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> - thoughts?</p>",
        "id": 153979212,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532905007
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span></p>",
        "id": 153979438,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532963726
    },
    {
        "content": "<p>Hey Lloyd, from my limited understand of the CRD workflow, it seems like we should definitely be using the existing hooks and/or defining new hooks that describe workflow events that aren't specific to just this integration. Careful identification of the \"natural business locations\"/ workflow events is the key.</p>\n<p>And exactly as you say, Coverage should simply be a pre-fetch element. Overall, we don't want or need to create integration-specific hooks. </p>\n<p>Mind saying more about the patient-independent use-case? What's the workflow event? If a specific user action is required (user click's button/link), it's probably more appropriate as a simple SMART app.</p>",
        "id": 153979444,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1532966530
    },
    {
        "content": "<p>I'm not sure that Coverage is a pre-fetch.  Or at least it's not the same sort of thing.  When you invoke one of the standard hooks on a payor application, you're only going to do so if the patient in question has a relationship with that payor and there's reason to believe the payor might be involved in paying for the service that's happening/being ordered.  The insurance information shared would be the Coverage that's specific to that particular payor/patient/proposed service combination.  Typically there would just be 1, though in some cases there would be more than one.  The key thing is that it would be hard to define a query that would bring back only the relevant Coverage.  It's really intended to be determined by the EHR.  So what I was envisioning was defining an additional (optional) parameter for the existing hooks similar to 'patient' and 'encounter' that provide context for the hook invocation - and which could then be referenced in pre-fetch queries.</p>",
        "id": 153979449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532966798
    },
    {
        "content": "<p>The patient-independent hook would fire at the same time as the current medication/order/encounter hooks, but it has a limitation of not allowing the exchange of patient-identifiable information.  So rather than saying \"I'm drafting this order for patient X, what payor-specific information should I know?\" you'd instead say \"I'm ordering this type of service (code) to be delivered by this location (Location) and expect to bill under this type of plan (code) - what payor specific information should I know?\"</p>",
        "id": 153979453,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532966922
    },
    {
        "content": "<p>In the patient-independent one we can't really use the MedicationRequest/ServiceRequest/[other]Request resources because those are all tied to the Patient.  Instead we'd need to convey the nature of the service in a single code.</p>",
        "id": 153979454,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532966979
    },
    {
        "content": "<p>Lloyd, your patient-independent idea feels really similar to the <a href=\"#narrow/stream/17-cds-hooks/subject/Anonymized.20CDS\" title=\"#narrow/stream/17-cds-hooks/subject/Anonymized.20CDS\">Anonymized CDS idea</a></p>",
        "id": 153979455,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1532967026
    },
    {
        "content": "<p>Perhaps.  It's not clear that there's actually an intention to support querying for additional data in the non-patient-identified situation.  The real reason for using the hook mechanism in that case isn't to allow the service to query data, it's just to ensure that the user gets relevant data (cards) at the appropriate times in the workflow.</p>",
        "id": 153979458,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532967257
    },
    {
        "content": "<p>Back to your question of whether there are additional workflow points required, the only other possible one would be an \"I'm thinking about ordering X\" - sort of a \"what if\" scenario.  I'm not sure if/how that's supported in the current EHRs.  And my guess is that what you'd actually do in that case would be to fire off the \"I'm ordering\" hooks at that workflow location too - because you'd want exactly the same information back and whether it was a draft order or a proposal wouldn't/shouldn't matter to the decision support being invoked.</p>",
        "id": 153979461,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532967382
    },
    {
        "content": "<p>I see this is confusing -- many of the tabs are there to start the conversation regarding profiles -- the only ones that are \"complete\" are the tabs for eligibilityrequest, eligibilityresponse and coverage.  Sorry for the delay in responding -- will review the work book this evening and post a new copy clarified information</p>",
        "id": 153979500,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1532974632
    },
    {
        "content": "<p>Ok.  The use of EligibilityRequest/Response is actually in question as we move to CDS Hooks.  We may not need them.  (And if we do use them, we'll probably use more core elements and less extensions.)  I'm writing up a complete list of issues for us to discuss which should be out this evening.</p>",
        "id": 153979501,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532974773
    }
]