[
    {
        "content": "<p>Vor einiger Zeit kam im Interop-Forum mal die Frage auf, wie man ein KV-Verordnungsformular standardisiert abbilden könnte.<br>\nDa das sicherlich für einige Entwickler interessant sein könnte, und auch auf andere Medizinische FOmrulare übertragbar ist, zitiere ich hier mal aus der Antwort des FHIR TCs:</p>\n<blockquote>\n<p>Unsere Idee war, solche Formulare als \"FHIR-Questionnaires\" zu modellieren. <br>\nDie Uni Münster hat ein Portal, auf dem man medizinische Formulare in standardisierten Formaten abrufen kann, unter anderem auch FHIR:<br>\n<a href=\"https://medical-data-models.org\" target=\"_blank\" title=\"https://medical-data-models.org\">https://medical-data-models.org</a></p>\n<p>Dort gibt es bereits fertige  KBV-Verordnungsformulare, zum Beispiel dieses hier:<br>\n<a href=\"https://medical-data-models.org/forms/17525\" target=\"_blank\" title=\"https://medical-data-models.org/forms/17525\">https://medical-data-models.org/forms/17525</a></p>\n<p>Man kann es als FHIR Resource herunterladen (wenn man angemeldet ist).</p>\n<p>Weiterhin gibt es bspw. eine Initiative in Australien, die eine Web-App zum Anzeigen, Speichern und Versenden von FHIR-Questionnaires entwickelt und einen öffentlichen Testserver betreibt.<br>\nLäd man den FHIR-Fragebogen dort hoch, kann man ihn direkt online ausfüllen:</p>\n<p><a href=\"http://smartq.azurewebsites.net/Home/Survey?questionnaireId=https://sqlonfhir-dstu2.azurewebsites.net/fhir/Questionnaire/1d15d76f6264457f978edf06e0797f42&amp;fhirServiceUrl=https://sqlonfhir-dstu2.azurewebsites.net/fhir/\" target=\"_blank\" title=\"http://smartq.azurewebsites.net/Home/Survey?questionnaireId=https://sqlonfhir-dstu2.azurewebsites.net/fhir/Questionnaire/1d15d76f6264457f978edf06e0797f42&amp;fhirServiceUrl=https://sqlonfhir-dstu2.azurewebsites.net/fhir/\">http://smartq.azurewebsites.net/Home/Survey?questionnaireId=https://sqlonfhir-dstu2.azurewebsites.net/fhir/Questionnaire/1d15d76f6264457f978edf06e0797f42&amp;fhirServiceUrl=https://sqlonfhir-dstu2.azurewebsites.net/fhir/</a></p>\n<p>Wirklich interessant wird es erst, wenn eine solche App in das SMART-Framework eingebettet würde, so dass das Formular aus einem KIS oder Praxissystem mit Patientenkontext aufgerufen, mit bereits bekannten Patienten- und Versicherungsinformationen vorbelegt, und das ausgefüllte Formular im aufrufenden System gespeichert werden kann.</p>\n</blockquote>",
        "id": 153893078,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1496991694
    },
    {
        "content": "<p>@medical data models<br>\nLeider hat der Kollege der die FHIR Funktionalität hier eingepflegt hat die Uni Münster verlassen, daher werden diese data models meines Wissens nach vorerst auf FHIR DSTU2 bleiben.<br>\nWir versuchen momentan Kontakt über Herrn Dugas herzustellen um den FHIR Bereich dieses tollen Projekts nicht verkümmern zu lassen.</p>",
        "id": 153893234,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1497260377
    },
    {
        "content": "<p>Wir haben in unserer Forschungsgruppe eine XSD Konvertierung von ODM to STU3 geschrieben. Ich denke, die können wir bereitstellen. Am Mittwoch ist in Berlin ein Workshop zu dem MDM-Portal, dort wollte ich sowieso den Stand der Dinge ansprechen. </p>",
        "id": 153893236,
        "sender_full_name": "Hannes Ulrich",
        "timestamp": 1497260657
    },
    {
        "content": "<p>Im Rahmen meiner Werksstudenttätigkeit und Bachelorarbeit untersuche ich derzeit die Abbildung medizinischer Formulare in FHIR und fand diesen Chat. Kann mir jemand sagen, wie sich das Thema im allgemeinen seit 2017 weiter entwickelt hat?</p>",
        "id": 166624479,
        "sender_full_name": "Julia Schönmann",
        "timestamp": 1558951744
    },
    {
        "content": "<p>Das ist eine sehr unspezifische Frage. Was ist mit Formularen gemeint, Questionnaires? Da hat sich einiges getan, gerade im Mapping zwischen (semantisch) unstrukturierten Questionnaire und strukturierten FHIR Ressourcen: <a href=\"http://build.fhir.org/ig/HL7/sdc/\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/sdc/\">http://build.fhir.org/ig/HL7/sdc/</a></p>",
        "id": 166628969,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1558956642
    },
    {
        "content": "<p>Dass sich die Questionnaires an sich als Ressource weiter entwickelt haben, ist ja keine Frage. Es würde mich mehr interessieren, ob es noch weitere Vorgaben oder Vorschläge bezüglich der Umsetzung der KBV Formulare in FHIR und im speziellen als Questionnaires gab.</p>",
        "id": 166630577,
        "sender_full_name": "Julia Schönmann",
        "timestamp": 1558958128
    },
    {
        "content": "<p>Die KBV hat im Rahmen der Spezifikation der Archiv- und Wechselschnittstelle und auch im Kontext des Verordnungsmanagements einen Teil ihrer Formulare auf FHIR-Ressourcen gemappt. Diese Spezifikationen sind über die KBV veröffentlicht.</p>\n<p>Questionnaires zu den aktuellsten Versionen gibt es m.W. von offizieller Seite nicht.<br>\nEine entsprechende Umsetzung wäre natürlich möglich, wobei da sicher der oben verlinkte SDC Implementation Guide beachtet werden sollte.</p>",
        "id": 166634940,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1558962036
    },
    {
        "content": "<p>Ah genau ein paar Unterlagen bezüglich der Schnittstelle habe ich hier. Das hilft mir dann schon viel weiter. Dankschön!</p>",
        "id": 166696838,
        "sender_full_name": "Julia Schönmann",
        "timestamp": 1559034581
    }
]