[
    {
        "content": "<p>Wer bin ich und wenn ja, wie viele?</p>",
        "id": 153922789,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512401776
    },
    {
        "content": "<p>Lasst uns diesen Thread nutzen, um uns alle kurz vorzustellen und Neulingen den Einstieg in unser Forum zu erleichtern. </p>\n<p>Ich mache mal den Anfang:<br>\nIch bin CTO der <a href=\"http://www.gefyra.de/search/label/FHIR\" target=\"_blank\" title=\"http://www.gefyra.de/search/label/FHIR\">Gefyra GmbH</a>, die Schulungen, Beratung und Tooling für FHIR anbietet. Weiterhin leite ich das <a href=\"http://wiki.hl7.de/index.php?title=TC_FHIR\" target=\"_blank\" title=\"http://wiki.hl7.de/index.php?title=TC_FHIR\">technische Komitee für FHIR bei HL7 Deutschland</a> und bin Mitglied des FHIR Core Teams.<br>\nBei HL7 International bin ich überwiegend in der Arbeitsgruppe \"Patient Administration\" aktiv. <br>\nAuf unserer Firmen-Seite blogge ich (mehr oder weniger) regelmäßig über Neuigkeiten und Aktivitäten rund um FHIR.<br>\nWeitere Infos gibt's auf meinem <a href=\"https://www.xing.com/profile/Simone_Heckmann\" target=\"_blank\" title=\"https://www.xing.com/profile/Simone_Heckmann\">XING-Profil</a> oder auf <a href=\"https://www.linkedin.com/in/simone-heckmann-16a96179/\" target=\"_blank\" title=\"https://www.linkedin.com/in/simone-heckmann-16a96179/\">LinkedIn</a></p>",
        "id": 153922932,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512469430
    },
    {
        "content": "<p>Tolle Idee mit der Vorstellungsrunde ;)</p>\n<p>Ich arbeite bei IBM im Insurance-Bereich (PKV und GKV) in unterschiedlichen Projekten. Wir bieten Services an, bei denen beispielsweise Rechnungsdaten direkt an eine PKV oder Beihilfe gesendet werden können (in einem HL7-v3-basiertem Format) oder bauen Apps, mit denen (in der PKV-Welt) Belege eingereicht werden können oder in denen sich der Versicherte Daten der Versicherung anzeigen lassen kann (PKV und GKV). Mit der Techniker Krankenkasse bauen wir eine elektronische Gesundheitsakte auf. Bei der eGA setzen wir im Backend ein FHIR-basiertes Modell ein. Darüber hinaus machen wir in meinem Team klassisches Input Management.</p>\n<p>Mich findet man auf LinkedIn: <a href=\"https://de.linkedin.com/in/evelyndroege\" target=\"_blank\" title=\"https://de.linkedin.com/in/evelyndroege\">https://de.linkedin.com/in/evelyndroege</a></p>",
        "id": 153922941,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1512474750
    },
    {
        "content": "<p>Ich bin Inhaber von Lang Health IT Consulting. Als Berater, Projektleiter und auch Implementierer meist aktiv in der Fachdomäne Onkologie.<br>\nStellvertretender Leiter des technischen Komitees FHIR bei HL7 Deutschland.<br>\nIm HL7-Kontext schwerpunktmäßig im Bereich \"Patient Care\" sowie bei \"Cancer Interoperability\" engagiert.</p>\n<p>Xing: <a href=\"https://www.xing.com/profile/Stefan_Lang118\" target=\"_blank\" title=\"https://www.xing.com/profile/Stefan_Lang118\">https://www.xing.com/profile/Stefan_Lang118</a><br>\nLinkedIn: <a href=\"https://www.linkedin.com/in/stefan-lang-4a7a2aa1/\" target=\"_blank\" title=\"https://www.linkedin.com/in/stefan-lang-4a7a2aa1/\">https://www.linkedin.com/in/stefan-lang-4a7a2aa1/</a></p>",
        "id": 153922944,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1512476903
    },
    {
        "content": "<p>Hallo,<br>\nIch bin wissenschaftlicher Mitarbeiter an der Universitätsmedizin Greifswald mit dem Arbeitschwerpunkt Forschungsdatenmanagement. Hier ist  im Rahmen des DFG-geförderten Projektes MOSAIC ein Werkzeug zur Verwaltung von digitalen Einwilligungen (Informed Consent) entstanden. Der gICS (<a href=\"https://mosaic-greifswald.de/werkzeuge-und-vorlagen/einwilligungsmanagement-gics.html\" target=\"_blank\" title=\"https://mosaic-greifswald.de/werkzeuge-und-vorlagen/einwilligungsmanagement-gics.html\">https://mosaic-greifswald.de/werkzeuge-und-vorlagen/einwilligungsmanagement-gics.html</a>) steht unter AGPLv3 und wir derzeit in 8 Forschungsprojekten eingesetzt.</p>\n<p>Im Rahmen einer neuen DFG-Förderung soll nun ein FHIR-basiertes Austauschformat entstehen, das es gestattet mittels TMF Consent Wizard (<a href=\"http://www.tmf-ev.de/News/articleType/ArticleView/articleId/223.aspx\" target=\"_blank\" title=\"http://www.tmf-ev.de/News/articleType/ArticleView/articleId/223.aspx\">www.tmf-ev.de/News/articleType/ArticleView/articleId/223.aspx</a>) entworfene Einwilligungsvorlagen für die direkte Weiterverarbeitung in den gICS zu übernehmen. Ein erster Entwurf wurde auf der GMDS 2017   (<a href=\"http://www.egms.de/static/en/meetings/gmds2017/17gmds146.shtml\" target=\"_blank\" title=\"http://www.egms.de/static/en/meetings/gmds2017/17gmds146.shtml\">http://www.egms.de/static/en/meetings/gmds2017/17gmds146.shtml</a>) vorgestellt und auf dem InteropForum in Köln im Dez. 2017 diskutiert.</p>\n<p>Research Gate: <a href=\"https://www.researchgate.net/profile/Martin_Bialke\" target=\"_blank\" title=\"https://www.researchgate.net/profile/Martin_Bialke\">https://www.researchgate.net/profile/Martin_Bialke</a></p>",
        "id": 153923171,
        "sender_full_name": "Martin Bialke",
        "timestamp": 1512566064
    },
    {
        "content": "<p>Ping für alle Neuzugänge!</p>",
        "id": 153970125,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1529070582
    },
    {
        "content": "<p>Hallo zusammen,<br>\nmein Name ist Jörg Mehlbrech. Ich arbeite als Software-Architekt bei Cerner für ein deutsches KIS. Wir verwenden FHIR derzeit intern (zwischen zwei Produkten) und dehnen demnächst die Nutzung wohl aus...<br>\nGrüße<br>\nJörg</p>",
        "id": 153970960,
        "sender_full_name": "Joerg Mehlbrech",
        "timestamp": 1529587344
    },
    {
        "content": "<p>Hallo,<br>\nmein Name ist Ralf Herzog und ich arbeite als Connectivity Architect bei Roche Diagnostics. <br>\nMomentan versuche ich für interne Projekte FHIR Lösungen zu finden.<br>\nGruss<br>\nRalf</p>",
        "id": 153970962,
        "sender_full_name": "Ralf Herzog",
        "timestamp": 1529588009
    },
    {
        "content": "<p>Hallo zusammen,<br>\nich bin Entwickler beim SAP Health Innovation Hub in Potsdam, wo wir u.a. neue analytische Werkzeuge für Ärzte und Krankenhäuser entwickeln. FHIR taucht bei uns mitlerweile in vielen Zusammenhängen auf. Ganz konkret arbeite ich zurzeit an einem öffentlich gefördertes Projekt (MACSS), wo wie durch Datenaustausch (mit FHIR, natürlich) die Behandlung von Nierenpatienten unterstützen wollen. Bin übrigens Däne, weshalb mir die deutsche Grammatik manchmal beim Schreiben in die Quere kommt....<br>\nViele Grüße,<br>\nMorten</p>",
        "id": 153971064,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1529656570
    },
    {
        "content": "<p>Hallo,<br>\nich bin wissenschaftliche Mitarbeiterin an der Hochschule Osnabrück. Für uns ist FHIR im Rahmen unseres Forschungsprojekts \"PosiThera\" interessant, da wir FHIR verwenden, damit unsere einzelnen Systeme Daten miteinander austauschen können. Aber wir werden auch sicher darüber hinaus noch mit FHIR arbeiten.</p>",
        "id": 153972078,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1530106586
    },
    {
        "content": "<p>Hallo Community,<br>\nwir arbeiten in HIGHMED, GENEALYSE und Medikationsplan PLUS intensiv mit FHIR. Ich freue mich über viele Fragen zu Terminologien, bin TC Leiterin Terminologien bei HL7 Deutschland. <br>\nViel Freude ! Bitte lasst uns Projekte mit SNOMED/LOINC und FHIR  beantragen und implementieren! Bitte hier auch über Erfolge berichten.</p>",
        "id": 153976825,
        "sender_full_name": "Sylvia Thun",
        "timestamp": 1532082454
    },
    {
        "content": "<p>Hallo,<br>\nich bin Software Architekt beim sog. omicsDIC (Highmed) und bin bei der Universität Heidelberg angestellt.<br>\nMeine Aufgabe ist dabei mich um die Interopabilität unserer Bioinformatik Komponenten in Verbindung mit FHIR/IHE/OpenEHR zu kümmern.<br>\nIch freue mich auf die zusammenarbeit und generell mehr über FHIR etc. zu erfahren.</p>",
        "id": 153978296,
        "sender_full_name": "Severin Kohler",
        "timestamp": 1532605998
    },
    {
        "content": "<p>Hallo zusammen,<br>\nich bin Wissenschaftliche Mitarbeiterin in der Medizininformatik und arbeite am Berliner Institut für Gesundheitsforschung in der Arbeitsgruppe von Frau Thun. Ich soll mich in meiner Arbeit u.A. intensiv mit FHIR beschäftigen. Ich freue mich auf die Zusammenarbeit!</p>",
        "id": 153979308,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1532933585
    },
    {
        "content": "<p>Toll soviele engagierte Menschen!<br>\nIch stelle mich gerne auch kurz vor. Ich bin im Projektmanagement beim RZV in verschiedenen eHealth Themen unterwegs. FHIR ist dabei natürlich nichts neues. Erste Entwicklungen auch zu Anbindung an unsere eHealth-Plattform existieren bereits.<br>\nDaneben bin ich TC Leiter für V3 CDA und XML bei HL7 Deutschland. Es gibt viele Dinge die sich aus der Welt übertragen lassen. Ich hoffe wir können viel gemeinsam gestalten und entwickeln!</p>",
        "id": 153984076,
        "sender_full_name": "Mathias Aschhoff",
        "timestamp": 1533815013
    },
    {
        "content": "<p>Ich bin zur Zeit noch Masterstudent der Hochschule Bonn-Rhein-Sieg. <br>\nDort habe ich den Studiengang \"Informatik Spezialisierung Bio-/Medizinische Informatik\" belegt. Im Moment schreibe ich an meiner Masterthesis.<br>\nIm Rahmen meiner Masterthesis arbeite ich sowohl am Fraunhofer Institut für wissenschaftliches Rechnen in Birlinghoven, als auch an der Universitätsklinik Bonn. Dort entwickle ich eine Lösung, die es Ärzten und Anwendern ermöglichen soll, Patientendaten effizienz zu durchsuchen (denn im KIS oder per SQL ist das eher mühselig für den Mediziner). Als Basis dafür haben wir uns im Projekt für FHIR entschieden. <br>\nDaher habe ich auch vor einiger Zeit einen FHIR-Workshop in Berlin belegt und wusele mich nun in durch Tücken und Wunder von FHIR und HAPI.</p>",
        "id": 153991210,
        "sender_full_name": "Kilian Krockauer",
        "timestamp": 1535452928
    },
    {
        "content": "<p><span class=\"emoji emoji-2764\" title=\"heart\">:heart:</span> -lich Willkommen an alle neuen Mitglieder von der HL7/IHE-Jahrestagung 2018!</p>",
        "id": 154006970,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1539088736
    },
    {
        "content": "<p><span class=\"emoji emoji-1f596\" title=\"vulcan salute\">:vulcan_salute:</span></p>",
        "id": 154006973,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1539089490
    },
    {
        "content": "<p><span class=\"emoji emoji-1f919\" title=\"call me hand\">:call_me_hand:</span></p>",
        "id": 154006975,
        "sender_full_name": "Dora Walter",
        "timestamp": 1539090505
    },
    {
        "content": "<p>Ich arbeite im Klinikrechenzentrum an der Uniniklinik Freiburg. Wir haben hier eine sehr lange Tradition der Eigenentwicklung rund um das Patientenverwaltungssystem und die klinschen Arbeitsplatzsysteme in engem Kontakt mit den Anwendern unserer Software.<br>\nIch selbst entwickle und betreue neben der Ambulanzabrechnung und Datawarehouse-Schnittstellen die unterschiedlichsten Datenaustauschformate (xDT, DALE, §301) und Schnittstellenstandards  (HL7 Querys und IHE konformen ADT-Strom, FHIR, DICOM). Ebenso gehört die Anbindung an die Telematik-Infrastruktur zu meinen Arbeitsfeldern.</p>",
        "id": 154010815,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1540149722
    },
    {
        "content": "<p>Noch ein bisschen Werbung. Wir suchen derzeit Verstärkung für unser Team. Bei Interesse siehe: <br>\n<a href=\"https://live.solique.ch/Microsites/showPublication/acb09e86-180e-4133-8f02-49ef82dae45d\" target=\"_blank\" title=\"https://live.solique.ch/Microsites/showPublication/acb09e86-180e-4133-8f02-49ef82dae45d\">https://live.solique.ch/Microsites/showPublication/acb09e86-180e-4133-8f02-49ef82dae45d</a></p>",
        "id": 154010816,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1540149801
    },
    {
        "content": "<p><span class=\"emoji emoji-1f44d\" title=\"+1\">:+1:</span></p>",
        "id": 154019412,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542547552
    },
    {
        "content": "<p><strong> Helmut Ristok FINSOZ e.V.</strong><br>\nIch bin Vorstandsmitglied im FINSOZ e.V., dem Fachverband für Informationstechnologie in Sozialwirtschaft und Sozialverwaltung e.V. Wir beschäftigen uns mit IT.Lösungen in der ambulanten und stationären Altenhilfe (d.h. Langzeitpflege), aber auch mit den Bereichen Jugend- und Behindertenhilfe.<br>\nIch leite dort die Arbeitsgruppe Interoperabilität, die aktuell den Datenaustausch zwischen Einrichtungen und das \"Recht auf Datenmitnahme\" nach DSGVO mit einem neuen Standard auf der Basis von FHIR festlegen will.<br>\nDazu würden wir zunächst die Anforderungen de Langzeitpflege einbringen wollen- mittelfristig FHIR aber auch als Datenaustauschstandard in der Sozialwirtschaft - also auch für die Jugend- und Behindertenhilfe etablieren wollen.<br>\n<strong> Sorry</strong> Nun nochmals im richtigen Topic</p>",
        "id": 154019414,
        "sender_full_name": "Helmut Ristok",
        "timestamp": 1542547751
    },
    {
        "content": "<p>Willkommen im Chat <span class=\"user-mention\" data-user-id=\"197454\">@Ole Lilienthal</span></p>",
        "id": 154019574,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542637989
    },
    {
        "content": "<p>Hallo, <br>\nich bin Entwickler der Frey ADV GmbH und kümmer mich um Anforderungen bzgl. Archivierungs-/Wechselschnittstelle.</p>",
        "id": 154020073,
        "sender_full_name": "Marco Rudolph",
        "timestamp": 1542796762
    },
    {
        "content": "<p><em>Ping</em> für alle Neuzugänge im Forum</p>",
        "id": 154025391,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1544722110
    },
    {
        "content": "<p>Okay, dann fange ich mal hier an, bevor ich meine Fragen poste... ich arbeite für die Firma GS Elektromedizinische Geräte G. Stemple GmbH und hinter diesem unaussprechlich langen Namen steckt die Marke \"corpuls\". Wir stellen Defibrillatoren, Patientenmonitore und Reanimationsgeräte für den Rettungsdienst her und sind in diesem Segment Marktführer in DACH und vielen weiteren Ländern. Ich bin als Produktmanager und Teamleiter zuständig für die Software corpuls.web, mit der wir u.a. Livedatenübertragung vom Notfallort in die Kliniken ermöglichen. Diese Daten sollen - wer hätte es gedacht - auch irgendwann im KIS und umliegenden Systemen landen. Wir haben von Beginn an auf FHIR gesetzt und mit dem alten Kram gar nicht erst angefangen, doch nun stehen wir vor dem Problem der Integration in Kliniken, deren IT beim Begriff \"FHIR\" eher an die Feuerwehr denkt als an modernen Datenaustausch. Entsprechende Fragen zu unseren Problemen werde ich dann in geeigneter Runde stellen und freue mich auf die Mitwirkung in der Community :-)</p>",
        "id": 156837564,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1548405357
    },
    {
        "content": "<p>Ich arbeite für Philips Medizin Systeme in Böblingen an Datenschnittstellen unserer Patientenmonitore. Hier läuft noch vieles über proprietäre Datenformate, zukünftig hoffentlich mehr über standardisierte Protokolle und Terminologien. Dazu bin ich in verschiedenen Workgroups dabei, die sich mit ISO/IEEE 11073 und HL7 FHIR befassen.</p>",
        "id": 156860205,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1548430265
    },
    {
        "content": "<p>Hallo zusammen,<br>\nich bin Leiter des Datenintegrationszentrums am UK Erlangen (Miracum Konsortium). Wir müssen ETL-Strecken zur Füllung unserer Forschungsdatenrepositories bauen und wollen dabei FHIR bei den Zwischenformaten einsetzen. Auch an anderen Stellen wird später FHIR zum Einsatz kommen.  <br>\nIch habe von 1996 bis 2010 intensiv mit HL V2 und CDA am Klinikum gearbeitet, bin danach aber in andere Bereiche verschlagen worden. Jetzt versuche ich die letzten Jahre HL7 Entwicklung aufzuholen, um beim Design der ETL-Strecken mitreden zu können.</p>",
        "id": 161257659,
        "sender_full_name": "Detlef Kraska",
        "timestamp": 1553095521
    },
    {
        "content": "<p>Willkommen in der Community, Detlef!<br>\nFalls du einen Schnelleinstieg in FHIR brauchst, kann ich diesen Kurs empfehlen: <a href=\"https://www.ztg-nrw.de/veranstaltungen/fhir-workshop-im-mai-in-muenster/\" target=\"_blank\" title=\"https://www.ztg-nrw.de/veranstaltungen/fhir-workshop-im-mai-in-muenster/\">https://www.ztg-nrw.de/veranstaltungen/fhir-workshop-im-mai-in-muenster/</a><br>\n...aber ich bin da voreingenommen ;-)</p>",
        "id": 161258172,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1553095899
    },
    {
        "content": "<blockquote>\n<p>Willkommen in der Community, Detlef!<br>\nFalls du einen Schnelleinstieg in FHIR brauchst, kann ich diesen Kurs empfehlen: <a href=\"https://www.ztg-nrw.de/veranstaltungen/fhir-workshop-im-mai-in-muenster/\" target=\"_blank\" title=\"https://www.ztg-nrw.de/veranstaltungen/fhir-workshop-im-mai-in-muenster/\">https://www.ztg-nrw.de/veranstaltungen/fhir-workshop-im-mai-in-muenster/</a><br>\n...aber ich bin da voreingenommen ;-)</p>\n</blockquote>\n<p>Danke! Schau ich mir mal an. <br>\nMomentan interessiert mich vor allem die Frage, ob und wie man FHIR in Umgebungen mit hohem Durchsatz performant einsetzt, also bei typischen ETL-Jobs mit hunderttausenden Zeilen. Den \"Bulk data\" Stream habe ich abonniert und den Vortrag im Topic \"Systemwechselschnittstelle\" angeschaut. Da würden mich real-world Beispiele interessieren.</p>",
        "id": 161259328,
        "sender_full_name": "Detlef Kraska",
        "timestamp": 1553096676
    },
    {
        "content": "<p>Google mach viel ETL nach FHIR auf Basis von Massendaten. Deren ProtoBuf Implementierung ist zwar Open Source verfügbar, aber die Speicher-/Analyse nur in der Cloud.</p>\n<p>Beim DMI verwenden wir Cloverleaf für die Transformation und FHIR-Transactions, um unseren FHIR-Server (Vonk) zu betanken. </p>\n<p>Input sind proprietäre XMLs mit Metadaten zu je ~3000 Dokumenten.<br>\nParsen und Transformieren dauert ca 2 Min. Vor allem aber weil wir pro Dokument mehrere Daten in div. externen Datenbanken nachschlagen müssen.</p>",
        "id": 161266466,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1553100562
    },
    {
        "content": "<p>Die Pakete zerfallen in ca 100 Transaction Bundles mit je ca 150 Ressourcen, die untereinander verlinkt sind und über conditional Updates verarbeitet werden müssen. Also recht komplexe Brocken. Der Vonk Server schluckt die jedoch innerhalb von 1-2 sec.</p>",
        "id": 161266831,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1553100756
    },
    {
        "content": "<p>Für einen Bulk Load von ca. 1.000.000 Dokumentendaten sind die beiden gut ein paar Stunden beschäftigt. Aber mit dem üblichen Datenaufkommen pro Tag kommen Sie gut klar, daher stand Performance Tuning bisher nicht so sehr im Vordergrund. Aber ich bin sicher, da geht noch was ;-)</p>",
        "id": 161267258,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1553100977
    },
    {
        "content": "<p>Danke, das sind schon mal ein paar schöne Anknüpfungspunkte! Wenn ich weitere Fragen habe, mache ich wohl am Besten einen eigenen Thread auf.</p>",
        "id": 161620337,
        "sender_full_name": "Detlef Kraska",
        "timestamp": 1553498819
    },
    {
        "content": "<p>Hallo in die Runde - ich möchte mich auch kurz vorstellen: André Sander -ich beschäftige mich bei ID Berlin mit der FHIR Schnittstelle zur Abbildung der Terminologie- und Medikations-Ressourcen. Für letzteres brauchen wir natürlich auch den ganzen \"Rattenschwanz\" vorneweg, sprich Patient/Encounter/Condition/MedicationRequest. <br>\nDie Community hat mir schon mal sehr bei der Entscheidung ob nun Encounter oder EpisodeOfCare richtig ist geholfen. <br>\nJetzt aktuell stellt sich mir noch die Frage, wie wohl am besten ein \"Service\" implementiert werden kann, der ein Freitext auf ein oder mehrere Terminologie-Konzepte mappt (z.B. ValueSet/[ID]/$expand?filter=\"\"). <br>\nGibt es da schon einen Thread?</p>",
        "id": 161662955,
        "sender_full_name": "André Sander",
        "timestamp": 1553532675
    },
    {
        "content": "<p>Der von Dir genannte Call wäre auch mein Tipp. Aber es gibt einen separaten, internationalen Thread „Terminology“, da tummeln sich die diesbezüglichen Experten. Die können das sicherlich genauer sagen...</p>",
        "id": 161663182,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1553532819
    },
    {
        "content": "<p>Hallo zusammen<br>\nhier schreibt Axel Biernat. Ich arbeite bei Cerner Deutschland im Solution Design, u.a. für das KIS Produkt i.s.h.med. Mein Schwerpunkt liegt im Requirements Engineering. Freue mich darauf mit Euch zusammen FHIR in DACH weiter voranzubringen.<br>\nSchöne Grüsse aus Berlin</p>",
        "id": 162234280,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1554122322
    },
    {
        "content": "<p>Ich sehe viele neue Namen und Gesicherter in diesem Chat, daher <em>ping</em></p>",
        "id": 169206771,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1561710007
    },
    {
        "content": "<p>Hi zusammen, ich kümmere mich an der Hochschule Krefeld in den Forschungsprojekten um hpts. LOINC und SNOMED Mappings.</p>",
        "id": 169209543,
        "sender_full_name": "Elisabeth Pantazoglou",
        "timestamp": 1561713058
    },
    {
        "content": "<p>Salut, wir bauen in der German Biobank Alliance Stores basierend auf FHIR, die das Suchen und Finden von Biomaterial für Forschungszwecke ermöglichen sollen <span class=\"user-mention\" data-user-id=\"197470\">@Alexander Kiel</span> hat unseren CQL-Indexer gestern vorgestellt und <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> ist hands on mit FHIR-profilierung beschäftigt <a href=\"https://github.com/samply/bbmri-fhir-ig\" target=\"_blank\" title=\"https://github.com/samply/bbmri-fhir-ig\">https://github.com/samply/bbmri-fhir-ig</a> - work in progress</p>",
        "id": 169209853,
        "sender_full_name": "Cecilia Engels",
        "timestamp": 1561713377
    },
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> <span class=\"user-mention\" data-user-id=\"243666\">@Linus Barkow</span></p>",
        "id": 178319116,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1571252690
    },
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> <span class=\"user-mention\" data-user-id=\"244806\">@Susanne Seuchter</span></p>",
        "id": 178322193,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1571255305
    },
    {
        "content": "<p>Hallo zusammen,<br>\nich bin Tobias Käfer und arbeite als Lead Architect bei der vitasystems/vitagroup. Wir entwicklen Software im Gesundheitswesen um Lösungen der Primärsystemhersteller, Krankenkassensysteme, Patientenakten interoperabel zu vernetzen. Wir sind auch aktiv im HighMED Konsortium und openEHR aktiv.</p>",
        "id": 178938326,
        "sender_full_name": "Tobias Käfer",
        "timestamp": 1571912489
    },
    {
        "content": "<p>Hallo, ich bin Hendrik und oute mich hier als gematiker. Wir wollen die Arbeitsweise und Arbeitsergebnisse der gematik modernisieren und u.a. FHIR für das E-Rezept verwenden.</p>",
        "id": 190878785,
        "sender_full_name": "Hendrik Jablonski",
        "timestamp": 1584464212
    },
    {
        "content": "<p>Hi Hendrik</p>",
        "id": 190880210,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584464747
    },
    {
        "content": "<p>Hallo, ich bin Marc und leite ein kleines Team für den Bereich »Mobile Applications« bei der KAIROS GmbH in Bochum. Aktuell arbeiten wir an einer App, die Covid-19-Patienten in häuslicher Isolation sowie in stationärer Behandlung begleitet. Dabei machen wir natürlich ausgiebig von den Questionnaires bzw. QuestionnaireResponses Gebrauch.<br>\nIch bin ursprünglich diplomierter Grafikdesigner, komme also aus dem UX/UI-Bereich, habe aber auch einen Programmier-Background und entwickle bei der KAIROS auf der iOS-Plattform in Swift.<br>\nIch freue mich, nach gestriger Einladung von <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> , in Zukunft öfter mal hier reinzuschauen. :)</p>",
        "id": 198199023,
        "sender_full_name": "Marc Eden",
        "timestamp": 1589981781
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"303882\">@Marc Eden</span> schön dass du hier dabei bist. Wir bei MOLIT haben eine questionnaire renderer web component entwickelt die open-source ist. Evtl. wäre das auch was für euch?<br>\nMomentan ist diese Component noch Vue basiert, wir evaluieren aber gerade den Umstieg auf Stencil um Framework unabhängig zu werden.</p>",
        "id": 198199699,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1589982132
    },
    {
        "content": "<p>Danke, Patrick! Ich würde da gerne mal draufschauen, auch weil ich ursprünglich aus dem Web-Umfeld komme. Die Apps entwickeln wir allerdings nativ in Swift bzw. Kotlin auf der Android-Plattform. Aber neugierig bin ich auf jeden Fall! :)</p>",
        "id": 198199972,
        "sender_full_name": "Marc Eden",
        "timestamp": 1589982273
    },
    {
        "content": "<p>Hallo! Ich heiße Sven und bin an der MII (MIRACUM) in Dresden. Ursprünglich bin ich Arzt mit Schwerpunkt Kinderheilkunde. Ich arbeite gerade viel mit dem GECCO-Datensatz (<a href=\"https://art-decor.org/art-decor/decor-datasets--covid19f\">https://art-decor.org/art-decor/decor-datasets--covid19f</a>) und würde mich da gerne in die weitere Ausarbeitung einbringen (nicht nur FHIR, eher Terminologien, Value-Sets). Vielleicht bin ich hier nicht ganz richtig, ich habe aber z.B. schon <span class=\"user-mention\" data-user-id=\"194952\">@Julian Sass</span> gesehen. Wo kann ich mich denn am besten einbringen?</p>",
        "id": 200101047,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1591624854
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"306822\">@Sven Helfer</span> und willkommen. Ich mache für's Thema Gecco-Datensatz ein substream auf. Alle Anmerkungen gerne da rein <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 200102617,
        "sender_full_name": "Julian Sass",
        "timestamp": 1591625568
    },
    {
        "content": "<p>Hallo an die deutsche FHIR Community,</p>\n<p>ich habe bis zum Sommer 2019 am SAP Health Innovation Hub gemeinsam mit <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> am Telemedizinprojekt MACSS gearbeitet. Dort haben wir einen FHIR-basierten inter-sektoralen Austausch zwischen Patienten, Krankenhaus und niedergelassenen Ärzten von Vital- und Medikationsdaten (Medikationsplan+) prototypisch mit der Charité realisiert. Mit einem kurzen Zwischenstop bei Data4Life bin ich jetzt bei der gematik mit diversen FHIR-Initiativen beschäftigt. Ich freue mich auf den Austausch mit euch <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> </p>\n<p>Marco</p>",
        "id": 202426461,
        "sender_full_name": "Marco Wedekind",
        "timestamp": 1593519269
    },
    {
        "content": "<p>Guten Tag Zusammen,</p>\n<p>mein Name ist Daniel Frensemeier, ich bin ITler in einem kleinen Paderborner Krankenhaus und kümmere mich hauptsächlich um alle Themen rund ums KIS bei uns. Vom User-Support bis hin zu unserer HL7-Kommunikation. Des Weiteren ist unsere KH in dem Projekt \"Digitale Gesundheitsplattform OWL\" vertreten, wo durch ich auch bei meinen ersten Berührungspunkten auf diesen Chat gestoßen bin. Ich bin absoluter FHIR-Neuling und finde es spannend die Chats zu verfolgen und mich etwas einzulesen. Super das es zu dem Thema-Fhir, so eine aktive Community gibt.</p>",
        "id": 206788718,
        "sender_full_name": "Daniel Frensemeier",
        "timestamp": 1597304967
    },
    {
        "content": "<p>Hallo zusammen!<br>\nMein Name ist Julius Severin und ich arbeite seit ein 2017 Jahren bei data4life.<br>\nParallel bin ich nun gerade in den letzten Zügen meines Master Studiums in Digital Health am Hasso-Plattner-Institut in Potsdam und plane aktuell mich im Laufe meiner Masterarbeit mit der Suche auf ende-zu-ende verschlüsselten FHIR Daten zu beschäftigen. <br>\nIch freue mich auf den Austausch mit euch!</p>",
        "id": 207124340,
        "sender_full_name": "Julius Severin",
        "timestamp": 1597657613
    },
    {
        "content": "<p>Hallo in die Runde!<br>\nMein Name ist Thies Eggers, ich arbeite bei fbeta, einer Beratung im Bereich der digitalen Vernetzung von Krankenkassen. <br>\nIch wende die CDA-Leitfäden in Projekten in der Selektivvertraglichen Versorgung an (Beispiel eAU: Schon über 270.000 versendete CDA's) und interessiere mich dieses Mal besonders für CDA-Leitfäden Telederm und eEinweisung / eEntlass sowie für Interoperabilität 2025 und die Zukunft von HL7 / IHE.</p>",
        "id": 209981246,
        "sender_full_name": "Thies Eggers",
        "timestamp": 1600075426
    },
    {
        "content": "<p>Ich bin CEO der <a href=\"http://www.gefyra.de/search/label/FHIR\">Gefyra GmbH</a>, die Schulungen und Beratung für FHIR anbietet. <br>\nWeitere Infos gibt's auf meinem <a href=\"https://www.xing.com/profile/Simone_Heckmann\">XING-Profil</a></p>",
        "id": 209981536,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1600075634
    }
]