[
    {
        "content": "<p>In Medication.ingredient.amount kann sowohl ein „numerator“ als auch ein „denominator“ angegeben werden. Beide nutzen das UCUM zur Kordierung. Das UCUM-Bezeichnungsschema erlaubt jedoch bereits das Darstellen von Einheiten als Bruch, z.B. „mg/ml“. Wie ist in solchen Fällen mit nominator und denominator umzugehen?</p>",
        "id": 159715056,
        "sender_full_name": "Willi Roos",
        "timestamp": 1551448608
    },
    {
        "content": "<p>Man gibt jeweils die spezifische Einheit im Nominator und Denominator an. Bspw so:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"nt\">&lt;amount&gt;</span>\n        <span class=\"nt\">&lt;numerator&gt;</span>\n          <span class=\"nt\">&lt;value</span> <span class=\"na\">value=</span><span class=\"s\">&quot;2&quot;</span><span class=\"nt\">/&gt;</span>\n          <span class=\"nt\">&lt;system</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://unitsofmeasure.org&quot;</span><span class=\"nt\">/&gt;</span>\n          <span class=\"nt\">&lt;code</span> <span class=\"na\">value=</span><span class=\"s\">&quot;mg&quot;</span><span class=\"nt\">/&gt;</span>\n        <span class=\"nt\">&lt;/numerator&gt;</span>\n        <span class=\"nt\">&lt;denominator&gt;</span>\n          <span class=\"nt\">&lt;value</span> <span class=\"na\">value=</span><span class=\"s\">&quot;1&quot;</span><span class=\"nt\">/&gt;</span>\n          <span class=\"nt\">&lt;system</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://unitsofmeasure.org&quot;</span><span class=\"nt\">/&gt;</span>\n          <span class=\"nt\">&lt;code</span> <span class=\"na\">value=</span><span class=\"s\">&quot;mL&quot;</span><span class=\"nt\">/&gt;</span>\n        <span class=\"nt\">&lt;/denominator&gt;</span>\n      <span class=\"nt\">&lt;/amount&gt;</span>\n</pre></div>",
        "id": 159724299,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1551455158
    },
    {
        "content": "<p>Perspektivisch kann das so verfeinert weden, dass für nominator und denominator etwas kleinere value sets gebildet werden, in denen dann bloß noch solche Einheiten auftauchen, die an der Stelle sinnvoll möglich sind. zB für Angaben der Wirkstärke.</p>",
        "id": 159725143,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1551455808
    },
    {
        "content": "<p>wenn man das möchte.</p>",
        "id": 159725164,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1551455826
    },
    {
        "content": "<p>Ich halte die Frage, warum amount als Ratio abgebildet ist (und nicht als Quantity) allerdings durchaus für berechtigt.<br>\nAlso: gibt es Fälle, wo man das explizit trennen muss? Oder geht es eher darum, dass der denominator möglichst gleich der Einnahme-Einheit sein soll (\"1 Tablette\")?</p>",
        "id": 159737219,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1551465102
    },
    {
        "content": "<p>Der Grund hier ist (soweit ich das noch richtig erinnere aus den Pharmacy WG Meetings) dass Ratio einen code für Nominator und Denominator erlaubt. Mit Quantity wäre es nicht möglich zu sagen 250mg/ Tablette.</p>",
        "id": 159912539,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1551705794
    },
    {
        "content": "<p>So kann man die mg ucum codieren und die Tablette als Snomed CT code o.ä.</p>",
        "id": 159912575,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1551705825
    },
    {
        "content": "<p>Ich vermute, das kommt aus den \"good practices\" aus den Zeiten der Mainframe Computer und terminalbasierten Erfassungsformulare. Im Bereich Medikationsdaten gibt es starke Anforderungen aus den regulatorischen Behörden, die bei der Standardisierung natürlich zu berücksichtigen sind. Ist wohl bei der Erfassung einfach wesentlich weniger fehlerträchtig (und auch \"Integer-kompatibel\"), die Messgröße und die Bezugsgröße separat zu erfassen. Wie <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> richtig sagt: der Vorteil heute liegt in der Option, passende kleinere ValueSets für Zähler und Nenner zu vereinbaren, wo es Sinn macht. Also z. B. auch die gewohnten \"units of presentation\" zu erlauben, wo eine \"1\" eigentlich die Aufgabe erfüllen würde.</p>\n<p>Die subtil transportierte semantische \"Doppelbedeutung\" des Nenners (z. B. Tablette, aber signifikanter bei Volumenangaben der Dosis) wird vermutlich in Zukunft an Bedeutung verlieren. Inzwischen haben wir genügend andere Möglichkeiten, solche Informationen strukturiert zu erfassen, wie z. B. das Volumen einer Ampulle (200 mg / 5 ml) usw.</p>",
        "id": 159954729,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1551736631
    },
    {
        "content": "<p>Der Knackpunkt ist die Kompatibilität mit kommenden IDMP-Spezifikationen: Die Wirkstärke ist ein Bestandteil des Identifikators. Und wenn die aus \"Zähler/Nenner\" konstruiert wird, dann sollten wir das auch so abbilden.</p>\n<p>Es gab damals etliche Diskussionen, das Thema \"Wirkstärke\" auch gleich in der ISO 11240 mit abzuhandeln. Auch deswegen gibt es für ISO 11240 ja keinen \"Implementation Guide\", in dem das geregelt wird, wie für die anderen vier IDMP-Standards (ISO 11239, 11238, 11615, 11616). Man wollte hier damals bewusst nur die Maßeinheiten standardisieren - und nicht die Ausdrücke für die Wirkstärke...</p>",
        "id": 159956715,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1551738109
    }
]