[
    {
        "content": "<p>Die deutschen FHIR®-Basisprofile verfolgen das Ziel,</p>\n<ul>\n<li>Use Case übergreifend relevante Vorgaben für die Implementierung von FHIR in Deutschland zu machen, um die Interoperabilität sicher zu stellen.</li>\n<li>Use Case-spezifischen Profilen eine gemeinsame Basis zu bieten, um die Interoperabilität der Use Case-übergreifenden Kerninformationen zu gewährleisten.</li>\n<li>Allgemeingültige Codesysteme und Value Sets zu definieren</li>\n<li>Allgemeingültige Nomenklaturen festzulegen (NamingSystems)</li>\n</ul>\n<p>Die Arbeitsversionen werden auf GitHub unter <a href=\"https://github.com/hl7germany/basisprofil-de\" target=\"_blank\" title=\"https://github.com/hl7germany/basisprofil-de\">https://github.com/hl7germany/basisprofil-de</a> verwaltet und auf der FHIR-Registry “Simplifier“ unter <a href=\"https://simplifier.net/BasisprofilDE\" target=\"_blank\" title=\"https://simplifier.net/BasisprofilDE\">https://simplifier.net/BasisprofilDE</a> publiziert. Der entsprechende Implementierungsleitfaden ist unter <a href=\"https://simplifier.net/ui/ig/LeitfadenBasisDE\" target=\"_blank\" title=\"https://simplifier.net/ui/ig/LeitfadenBasisDE\">https://simplifier.net/ui/ig/LeitfadenBasisDE</a> verfügbar.<br>\nKommentare können nach Anmeldung in GitHub als \"Issue\" eingegeben werden, per eMail an <a href=\"mailto:tc@fhir.de\" title=\"mailto:tc@fhir.de\">tc@fhir.de</a> oder direkt hier im Chat.</p>\n<p>Gut durchdachte, vollständige und getestete Basis-Profile sind die Grundvoraussetzung für die Erstellung sämtlicher Implementierungsleitfäden in Deutschland. Das Technische Komitee bittet daher <strong>bis zum 15. Oktober 2017</strong> um die Kommentierung der bisher erarbeiteten Conformance-Ressourcen.<br>\nDie Diskussion und Auflösung der eingegangenen Kommentare findet <strong>hier</strong> und auf den Meetings des Interoperabilitätsforums statt.<br>\nDie Teilnahme steht jedem offen!</p>",
        "id": 153909779,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1506022680
    }
]