[
    {
        "content": "<p>Ich habe ja dieses Issuelein eingericht, das hoffentlich schnell aus dem Weg geräumt werden kann:</p>\n<p><a href=\"https://github.com/hl7germany/basisprofil-de/issues/108\" target=\"_blank\" title=\"https://github.com/hl7germany/basisprofil-de/issues/108\">https://github.com/hl7germany/basisprofil-de/issues/108</a></p>\n<p>Kommentar (etwas verkürzt):</p>\n<blockquote>\n<p>Im Medication-Profil steht z.Z. in der Definition vom Feld Medication.code: \"Die Verwendung der PZN ist in Deutschland z.T. verpflichtend.\" Das erweckt den Eindruck, dass jede Medication-Resource eine PZN enthalten muss. Dabei gibt es durchaus Fälle, wo ein Medikament ohne PZN auftreten kann (oder muss) (...).</p>\n<p>Siehe auch dazu <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/PZN.20in.20Medication.20verpflichtend.3F\" title=\"#narrow/stream/179183-german-(d-a-ch)/topic/PZN.20in.20Medication.20verpflichtend.3F\">diese Diskussion im FHIR Chat</a>.</p>\n<p>Es wäre schön, dass etwas klarer zu Dokumentieren (und ggf. auch die Profil selbst anzupassen, falls es Regeln gibt, die auch durch Profilierung dargestellt werden können):</p>\n<ul>\n<li>Klarstellen, dass eine PZN nicht zwingend notwendig ist</li>\n<li>Klarstellen, unter welchen Umständen eine PZN ggf. mitgegeben werden sollte bzw. mitgegeben werden muss</li>\n<li>Falls es Regeln für den Umgang mit fehlenden PZNs gibt (vgl. \"nullFlavors\" von CDA), auch diese Dokumentieren</li>\n</ul>\n</blockquote>\n<p>Aus meiner sicht würde es erstmals ausreichen, einfach die Desription vom Slice <code>pzn</code> in <code>Medication.code.coding</code> zu ändern. Eine Minimallösung wäre:</p>\n<p><em>Vorher</em>: \"Die Verwendung der PZN ist in Deutschland z.T. verpflichtend.\" <br>\n<em>Nachher</em>: \"Die Verwendung der PZN ist in Deutschland weit verbreitet.\"</p>\n<p>Falls zutreffend könnte man auch einen \"Best Practice\"-Satz hinzufügen z.B. \"Falls verfügbar sollte die PZN eines Medikamentes immer mitgegeben werden\".</p>",
        "id": 161947871,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1553776940
    }
]