[
    {
        "content": "<p><a href=\"https://github.com/hl7germany/basisprofil-de-r4/issues/55\" title=\"https://github.com/hl7germany/basisprofil-de-r4/issues/55\">Issue#55:Strasse/Hausnummer</a><br>\n<span class=\"user-mention\" data-user-id=\"192713\">@Thomas Liebscher</span> </p>\n<blockquote>\n<p>Straße und Hausnummer zur Adresierung eines Gebäudes ist zwar ein verbreitetes Konzept in Deutschland, aber es gibt Gegenbeispiele, bei denen die Adresszeile das geeignetere generischere Konzept ist.</p>\n<p>Das bekannteste Beispiel ist vermutlich das Stadtzentrum von Mannheim, bei denen nicht die Straßen sondern die Häuserblocks Bezeichner haben (hier Quadratebezeichnungen nach Buchstaben und Ziffern, bspw. O5, P6). Ein solches Quadrat hat 4 angrenzende Straßen, die zum Block gehörenden Häuser teilen sich aber die Blockbezeichnung. Zwei Häuser die sich an gegenüberliegenden Straßenseiten befinden, haben andere Blöcke und damit andere Bezeichnungen vor der Hausnummer (O5, 5 und P5, 5). Die gleiche Hausnummer kann dadurch zweimal in der gleichen Straße vorkommen.<br>\nAnderes seltenes Beispiel ist Hilgermissen in Niedersachsen, welches keine Straßennamen hat, sondern nur Hausnummern.</p>\n<p>Würde O5 in Mannheim in der addres line extension als Straße behandelt werden?</p>\n</blockquote>",
        "id": 194894918,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1587539428
    },
    {
        "content": "<p>Dazu: Wir haben uns das nicht ausgedacht ;-)<br>\nIn der Tat ist die Darstellung, wie sie im FHIR Standard gewählt ist, nämlich lediglich mit einem oder mehreren <code>line</code>-Elementen, die dann Strasse, Hausnummer,Postfach, Appartmentnummer, Planquadrat, Zustellungshinweis usw. usf. enthalten können, für die meisten Systeme (einschließlich jenen der Deutschen Post) völlig ausreichend.<br>\nAllerdings machen viele im Deutschen Gesundheitssystem üblichen Datenformate genau diese Unterscheidung: Strasse, Hausnummer, Postfach.<br>\nSpontan fällt mir VSDM und xDT ein, vermutlich auch einige KBV-Formulare (<span class=\"user-mention\" data-user-id=\"195854\">@Maximilian Reith</span> ?).<br>\nFolglich haben wiederum viele Hersteller ihre Datenbankstrukturen daran angepasst, weshalb wir mit den Extensions die (optionale!!) Möglichkeit bieten wollen, dies auch in FHIR abzubilden.<br>\nAus unserer Sicht ist jedoch die ausschließliche Verwendung der <code>line</code> immer ausreichend. Die Antwort auf die Frage nach den Monnemer Adressen wäre also </p>\n<div class=\"codehilite\"><pre><span></span><span class=\"nt\">&lt;address&gt;</span>\n   <span class=\"nt\">&lt;line</span> <span class=\"na\">value=</span><span class=\"s\">&quot;O5,5&quot;</span><span class=\"nt\">/&gt;</span>\n   <span class=\"nt\">&lt;city</span> <span class=\"na\">value=</span> <span class=\"s\">Mannheim&quot;/</span><span class=\"nt\">&gt;</span>\n<span class=\"nt\">&lt;/address&gt;</span>\n</pre></div>",
        "id": 194895408,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1587539852
    },
    {
        "content": "<p>Die Klärung der Frage, wie das zu den Extensions passt, würde ich an die Autoren von IGs delegieren, die die Verwendung der Extensions verpflichtend machen.</p>",
        "id": 194895504,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1587539911
    },
    {
        "content": "<p>Das sehe ich genauso...Die Möglichkeit der dezidierten Abbildung ist vorhanden, aber kein muss...</p>",
        "id": 194904985,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1587546605
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192713\">@Thomas Liebscher</span>  Können wir das Issue damit schließen?</p>",
        "id": 196146799,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1588576015
    },
    {
        "content": "<p>Ping <span class=\"user-mention\" data-user-id=\"194539\">@Thomas Liebscher</span>  <span class=\"user-mention\" data-user-id=\"192713\">@Thomas Liebscher</span>  (weiß nicht, welcher der richtige ist <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> )</p>",
        "id": 196614826,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1588761021
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> und <span class=\"user-mention\" data-user-id=\"195854\">@Maximilian Reith</span> , ja, ich weiss, dass die nutzenden IGs hier Vorgaben machen können. Ich bin glaube im Kontext des Impfpass IGs drüber gestolpert. Ich würde aber empfehlen, das solche Dinge einheitlich eben im Basisprofil geregelt werden. Sonst kann es dazu kommen, dass die nutzenden IGs es unterschiedlich nutzen und dann eben so lustige Adressen wir im o.g. Beispiel nicht mehr funtionieren oder zur Verwirrung beim Implementierer führen.</p>",
        "id": 196616228,
        "sender_full_name": "Thomas Liebscher",
        "timestamp": 1588761944
    },
    {
        "content": "<p>Sind übrigens beide richtig. Wohl historisch auch mit der privaten E-Mail registriert.</p>",
        "id": 196616315,
        "sender_full_name": "Thomas Liebscher",
        "timestamp": 1588761999
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"194539\">Thomas Liebscher</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/.5BBASIS.5D.20Issue.2355.3A.20Strasse.2FHausnummer/near/196616228\" title=\"#narrow/stream/179183-german-(d-a-ch)/topic/.5BBASIS.5D.20Issue.2355.3A.20Strasse.2FHausnummer/near/196616228\">said</a>:</p>\n<blockquote>\n<p>Ich würde aber empfehlen, das solche Dinge einheitlich eben im Basisprofil geregelt werden. Sonst kann es dazu kommen, dass die nutzenden IGs es unterschiedlich nutzen und dann eben so lustige Adressen wir im o.g. Beispiel nicht mehr funtionieren oder zur Verwirrung beim Implementierer führen.</p>\n</blockquote>\n<p>Hm... einerseits: ja. <br>\nAndererseits: wie können wir das verhindern? Das würde bedeuten, dass ein Constraining der beiden Extensions \"Straße und Hausnummer\" auf 1..1 in abgeleiteten Profilen unterbinden müssen. Das wäre ja die Situation, in der die Mannheimer Adressen problematisch werden.<br>\nTechnisch wäre das so ohne weiteres nicht möglich. Wir könnten es allerdings als CAVE in der Beschreibung der Extensions einfügen.</p>\n<p>Mich würde mal interessieren, was bei Spezifikationen, die die Trennung von Straße und Hausnummer fest vorgesehen haben (z.B.: VSDM), mit solchen Adressen gemacht wird... Ist dann - um beim Beispiel zu bleiben - \"O5\" die Straße und \"5\" die Hausnummer?</p>",
        "id": 196626942,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1588768367
    }
]