[
    {
        "content": "<p><a href=\"https://github.com/hl7germany/basisprofil-de/issues/164\" target=\"_blank\" title=\"https://github.com/hl7germany/basisprofil-de/issues/164\">https://github.com/hl7germany/basisprofil-de/issues/164</a></p>\n<blockquote>\n<p>Observation<br>\n(allgemein)</p>\n<p>Für einzelne der vorgegebenen Observations sinnlose Elemente<br>\nsollte gestrichen werden (z. B. bodySite für Schwangerschaft oder<br>\nStillzeit).</p>\n</blockquote>\n<p>Eingereicht durch: <span class=\"user-mention\" data-user-id=\"192422\">@Jörg Caumanns</span></p>",
        "id": 160554915,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1552382866
    },
    {
        "content": "<p>Meine (noch etwas undifferenzierte) Meinung dazu:<br>\nGrundsätzlich bin ich dagegen, Elemente auf 0..0 zu constrainen, nur weil sie in einem bestimmten Kontext nicht benötigt werden, da dies unmittelbar zu Inkompatibilitäten mit jeglichen Profilen führt, die dies erfordern.<br>\nZu einem solchen Schritt würde ich nur greifen wollen, wenn das Vorhandensein eines Elementes in dem konkreten Kontext \"stört\", also explizit gefordert werden soll, dass das Element immer leer sein <em>muss</em>.</p>\n<p>Daher jetzt die konkrete Frage am Beispiel: Würde das Vorhandensein einer bodySite bei einer Schwangerschaft stören? Es wäre eine sinnlose Angabe, aber sollte die Entgegennahme einer Instanz deswegen abgelehnt werden?</p>",
        "id": 160555368,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1552383340
    },
    {
        "content": "<p>0..0 constraints in Basisprofilen sollten nur genutzt werden falls unbedingt nötig, also wenn ohne diese Constraint die Interpretierbarkeit der Ressource nicht gegeben ist, bzw. nicht eindeutig ist wo die Information innerhalb der Ressource enthalten ist. Bspw. falls bei einem Profil  alle Informationen innerhalb von Observations.Component transportiert werden böte es sich an Observation.value(x) auf 0..0 zu restricten</p>",
        "id": 160556116,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1552384002
    },
    {
        "content": "<p>bodySite bei Schwangerschaft oder Stillzeit stört nicht, aber wenn ich in meinem System (warum auch immer) alle Observations einer bodySite querien möchte würde ich auch bei Schwangerschaft oder Stillzeit diese befüllen.</p>",
        "id": 160556274,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1552384138
    },
    {
        "content": "<p>kurz gesagt 0..0 kann Interoperabilität erschweren bzw. sogar verhindern.</p>",
        "id": 160556417,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1552384235
    },
    {
        "content": "<p>nachvollziehbar. Ich sehe meinen Kommentar  #164 zu den Basisprofilen damit als erledigt an.</p>",
        "id": 160941118,
        "sender_full_name": "Jörg Caumanns",
        "timestamp": 1552723403
    }
]