[
    {
        "content": "<p>Hallo!</p>\n<p>Wir verwenden in unserer FHIR-Darstellung die Ressource Practitioner. Der Practitioner hat einen Namen. In das Prefix des Namens schreiben wir derzeit die Anrede, was \"Herr\"/\"Frau\" und akademische Titel einschließt. Das dt. Basisprofil sieht nur den akademischen Titel vor, der Rest der Anrede soll auf das Geschlecht gemappt werden. Ist es denn laut Basisprofil auch falsch, wenn man das nicht tut? Gibt es im deutschsprachigen Raum Beispielumsetzungen? Wir haben uns bisher an der HumanName-Ressource orientiert, bei der \"Mr\" ein Prefix ist: <a href=\"http://hl7.org/fhir/datatypes.html#HumanName\" target=\"_blank\" title=\"http://hl7.org/fhir/datatypes.html#HumanName\">http://hl7.org/fhir/datatypes.html#HumanName</a> </p>\n<p>Wir wollen einerseits möglichst kompatibel zu anderen FHIR-Umsetzungen in Deutschland sein, uns andererseits aber Aufwand im Mapping sparen. Es steht \"Frau/Herr\" in den Stammdaten und in der Anwendung - wir müssten also nur für FHIR auf gender mappen und wieder von gender zurück auf die Ursprungsschreibweise.</p>\n<p>Hat jemand schon ähnliche Probleme gehabt und falls ja: wie gelöst?</p>",
        "id": 153921032,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1511361057
    },
    {
        "content": "<p>Ich denke, das Mapping ist unumgänglich bei der Anrede, schließlich muss man ja auch wissen, ob es \"sehr geehrte\" oder \"sehr geehrter\" heißen muss... <br>\nDass in der Tabelle im Standard \"Mr\" als Beispiel für Prefix angegeben ist, überrascht mich etwas. Die weiteren Beispiele nutzen das Feld m.E. koorekt z.B. für \"Dr. \" oder \"Abu\":<br>\n<a href=\"http://hl7.org/fhir/datatypes.html#HumanName\" target=\"_blank\" title=\"http://hl7.org/fhir/datatypes.html#HumanName\">http://hl7.org/fhir/datatypes.html#HumanName</a></p>",
        "id": 153921033,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511361428
    },
    {
        "content": "<p>Ich habe mal ein Konsil angefordert: <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/.22Mr.2E.22.20as.20part.20of.20HumanName!.3F\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/.22Mr.2E.22.20as.20part.20of.20HumanName!.3F\">https://chat.fhir.org/#narrow/stream/implementers/topic/.22Mr.2E.22.20as.20part.20of.20HumanName!.3F</a></p>",
        "id": 153921036,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511361619
    },
    {
        "content": "<p>Soweit mir bekannt, ist es für Applikationen eher unüblich, den Patientennamen mit Anrede darzustellen. Männlein/Weiblein wird oft mit Mars/Venus-Symbol oder Schriftfarbe gekennzeichnet, also eine direkte Funktion des Geschlechtes.<br>\nDie Anrede \"Herr\"/\"Frau\" spielt dann nur bei der Erstellung von Dokumenten/Anschreiben eine Rolle, wo ohnehin bei mehreren Formulierungen geschlechtsabhängig unterschieden werden muss, so dass die Kenntnis der Anrede nicht ausreicht und ebenfalls auf Geschlecht als Unterscheidungsmerkmal zurückgegriffen werden muss.</p>",
        "id": 153921041,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511363086
    },
    {
        "content": "<p>Siehe: <a href=\"http://www.management-krankenhaus.de/sites/management-krankenhaus.de/files/images/special/1303373__original.jpg\" target=\"_blank\" title=\"http://www.management-krankenhaus.de/sites/management-krankenhaus.de/files/images/special/1303373__original.jpg\">http://www.management-krankenhaus.de/sites/management-krankenhaus.de/files/images/special/1303373__original.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"http://www.management-krankenhaus.de/sites/management-krankenhaus.de/files/images/special/1303373__original.jpg\" target=\"_blank\" title=\"http://www.management-krankenhaus.de/sites/management-krankenhaus.de/files/images/special/1303373__original.jpg\"><img src=\"http://www.management-krankenhaus.de/sites/management-krankenhaus.de/files/images/special/1303373__original.jpg\"></a></div>",
        "id": 153921042,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511363316
    },
    {
        "content": "<p>oder <a href=\"http://www.einweiserportal.net/img/falluebersicht.png\" target=\"_blank\" title=\"http://www.einweiserportal.net/img/falluebersicht.png\">http://www.einweiserportal.net/img/falluebersicht.png</a></p>\n<div class=\"message_inline_image\"><a href=\"http://www.einweiserportal.net/img/falluebersicht.png\" target=\"_blank\" title=\"http://www.einweiserportal.net/img/falluebersicht.png\"><img src=\"http://www.einweiserportal.net/img/falluebersicht.png\"></a></div>",
        "id": 153921044,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511363457
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194622\">@Evelyn Dröge</span> Wo genau verwendet ihr die Anrede? In welchem Kontext?</p>",
        "id": 153921045,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511363614
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Das betrifft bei uns nur den Practitioner, nicht den Patient. Direkt angeredet wird mit der Anrede also keiner, es kann aber der Anzeige dienen und erscheint so im Datenexport.</p>",
        "id": 153921062,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1511371405
    },
    {
        "content": "<p>Anrede und akademischer Titel sind in den meisten Systemen, die ich kenne, getrennt; \"Herr\" und \"Frau\" werden, wie Simone es beschrieben hat, oft aus dem Geschlecht generiert.</p>\n<p>Leider ist gender ein Code mit required binding und kein CodeableConcept, sonst könnte man da schön einen alternative Display Name \"Herr\"|\"Frau\" dran hängen.<br>\nWenn also unbedingt \"Herr\" und \"Frau\" in der Practitioner-Ressource stehen sollen, sehe ich gerade 2 Möglichkeiten:<br>\n- Extension an gender (\"Briefanrede\" o.ä. - müsste man mal schauen, ob es da international schon was gibt)<br>\n- \"Herr\"|\"Frau\" einfach in Practitioner.name.text reinschreiben, also \"Herr Dr. Max Mustermann\" (das muss natürlich auch irgendwo herkommen...)</p>\n<p>Aber eigentlich ist es ja nur eine Lookup-Operation wie für N andere Codes auch, von daher wären diese Ergänzungen wohl mit Kanonen auf Spatzen geschossen ;-)</p>",
        "id": 153921083,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511380050
    },
    {
        "content": "<p>Gegen die Verwendung von Practitioner.name.text hätte ich den Einwand, dass die meisten Systeme die Anrede wohl ungefähr so implementieren \"Sehr geehrte(r) Herr|Frau &lt;name.text&gt;, ...\". Wenn die Anrede dann im Text bereits konkateniert wird, kommt ein Doppel-Gemoppel dabei heraus. Daher: wenn überhaupt, dann eher in einer Extension, die von anderen Systemen -wenn nicht bekannt- einfach ignoriert würde.</p>",
        "id": 153921254,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511431367
    },
    {
        "content": "<p>man könnte in HumanName DE auch einen weiteren Slice einfügen für die Briefanrede, dies wäre aber bei akademischen Anreden redundant zu akad. prefix</p>",
        "id": 153921281,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1511441032
    },
    {
        "content": "<p>Im Prinzip ja. Ich warte aber noch auf die Antwort zur Frage, die ich gerade zum zweiten Mal gestellt habe ;-)</p>",
        "id": 153921283,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511441522
    },
    {
        "content": "<p>(in besagtem Thread im implementers-Stream: <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/.22Mr.2E.22.20as.20part.20of.20HumanName!.3F\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/.22Mr.2E.22.20as.20part.20of.20HumanName!.3F\">https://chat.fhir.org/#narrow/stream/implementers/topic/.22Mr.2E.22.20as.20part.20of.20HumanName!.3F</a> )</p>",
        "id": 153921284,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511441603
    },
    {
        "content": "<p>Die Extension hat ein required binding und das ValueSet erlaubt, so weit ich sehe, nichts in Richtung \"Anrede\" alias \"salution\".</p>",
        "id": 153921286,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511441688
    },
    {
        "content": "<p>Wenn wir im Core-ValueSet einen Code dafür bekommen, wäre ich glaube ich zufrieden mit 2 Slices für prefix</p>",
        "id": 153921287,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511441740
    },
    {
        "content": "<p>daran dachte ich auch schon, dann hätte man es redundant bei akad. oder Nobility  Titeln. Aber sauber getrennt.</p>",
        "id": 153921290,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1511443365
    },
    {
        "content": "<p>Man könnte ja auch platt sagen, prefix = Anrede, aber das bricht dann wieder mit der Extension.</p>",
        "id": 153921291,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1511443386
    },
    {
        "content": "<p>Nobility gibt's ncht in Deutschland, nur Namenszusätze ;)))<br>\nNur 1x prefix für Anrede bricht wiederum mit VSDM ...</p>",
        "id": 153921296,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511444868
    },
    {
        "content": "<p>Danke für die vielen Beiträge! Doppel-gemoppel bei Anreden fände ich persönlich nicht schlimm. Gegen die fixe Anrede könnte auch noch sprechen, dass zumindest beim Herr die Briefanrede sich ändern würde, je nachdem ob es gerade um die Anschrift geht (An Herrn Max Müller) oder um die Anrede (Sehr geehrter Herr Müller). Die Generierung aus dem Geschlecht muss das natürlich auch nicht richtig machen, aber es würde schon mehr Sinn ergeben, die richtige Variante zu generieren, statt dann unterschiedliche feste Werte zu haben. </p>\n<p>Diese Anrede ist aber gar nicht unser Use Case. Wir diskutieren erst einmal intern weiter, ob wir jetzt Herr oder Frau überhaupt noch wollen...</p>\n<p>Davon abgesehen fände ich es aber super, gäbe es national und international nicht unterschiedliche Richtlinien an dieser Stelle. Das hätten wir aus der Dokumentation heraus ohne weiteren Hinweis vermutlich auch nicht mehr erkannt, gerade weil wir uns beim Aufbau der Ressourcen stark an den Beispiel-Ressourcen zu Practitioner &amp; Co. der FHIR-Website orientiert haben.</p>",
        "id": 153921309,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1511451914
    },
    {
        "content": "<p>Auch wenn's ein Detail ist - auf die Basisprofile könnte es halt einen Einfluss haben.<br>\nIch bezweifle allerdings, dass wir international einen Konsens für die eine oder andere Sicht verbindlich bekommen. Rene hat ja die Unterschiede für Europa schon aufgezeigt, und für die native English people scheint Mr/Mrs gesetzter Namensbestandteil zu sein - dort ist allerdings auch schon die Grammatik deutlich einfacher, wie geehrte(r) und Herr(n) zeigt.</p>",
        "id": 153921340,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511474125
    },
    {
        "content": "<p>Wir schreiben den Namen des Arztes so in die Akte: Anrede + Titel + Vorname + Nachname. Bisher sind Anrede und Titel als Prefixes und auch in der prefix-Liste voneinander getrennt. Das sollten wir dem Basisprofil nach aber nicht tun. Stefan, wenn ich deine Vorschläge richtig verstehe, soll das Prefix für Titel bleiben (und die Anrede raus), der Name, so wie wir ihn voll benötigen und anzeigen wollen, dann mit Anrede + Titel + Vorname + Nachname in Practitioner.name.text. Das wäre dann in Ordnung?</p>",
        "id": 153921418,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1511515303
    },
    {
        "content": "<p>Eine Extension wollen wir nicht einführen, das ist wirklich mit Kanonen auf Spatzen geschossen.</p>",
        "id": 153921419,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1511515325
    },
    {
        "content": "<p>Die internationale Diskussion dazu ist ja noch offen. Von daher steht auch noch nicht wirklich fest, ob/wie wir das Basisprofil evtl. anpassen.<br>\nSimones Anmerkung zu name.text ist natürlich valide.</p>\n<p>Andererseits sind die Basisprofile generell offen. Heißt hier konkret: niemand hindert Euch an dieser Stelle daran, ein Anrede-Prefix parallel zum Prefix für akademische Titel zu haben.<br>\nAkademische Titel sollten halt über die Core-Extension als \"AC\" gekennzeichnet sein - das ist wichtig für VSDM (alias: den eGK-Datensatz). Der kennt nämlich ak. Titel, aber keine Anrede.</p>\n<p>Im Moment  tendiere ich dazu, Lloyds Vorschlag anzunehmen, einen Anrede-Code ins ValueSet der Extension aufzunehmen.</p>",
        "id": 153921420,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511515880
    },
    {
        "content": "<p>Im Grunde brauchen wir dann beim Basisprofil gar nichts zu machen - der neue Code wäre automatisch erlaubt, wenn er im Core-ValueSet drin ist</p>",
        "id": 153921421,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511516144
    },
    {
        "content": "<p>Naja, die internationale Diskussion zeigt ja, dass es da wohl keine einheitliche Zwangsvorgabe geben wird, da der Gebrauch in den verschiedenen Länden so unterschiedlich ist. <br>\nDas Problem, dass die Anrede in manchen Fällen nicht unverändert stehen bleiben kann um der korrekten Grammatik genüge zu tun, scheint ja zum Beispiel ein rein deutsches zu sein ;-)</p>\n<p>Daher sollten wir uns darauf fokussieren, eine einheitliche Regelung für DE zu finden. <br>\nM.E. ist es für ein System immer einfacher, die Anrede aus dem Geschlecht zu ermitteln als herauszufinden, ob das Präfix nun ein Titel ist und zwischen Anrede und Nachnamen eingefügt werden muss oder ob es bereits die Anrede enthält und ggf. weggelassen werden muss, um Verdopplungen oder falschen Kasus zu verhindern.</p>",
        "id": 153921424,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511516712
    },
    {
        "content": "<p>Es sei denn, wir fügen die Qualifier-Extension hinzu, was dann wiederum - und da gebe ich Evelyn recht - eine ziemliche Overkill-Lösung darstellen würde...</p>",
        "id": 153921425,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511516774
    },
    {
        "content": "<p>Eine gangbare Alternative wäre es, sich tatsächlich auf name.text als Anrede+Name zu verständigen, so dass die Systeme entscheiden können, entweder darauf zurückzugreifen, oder Anrede, ermittelt aus gender+prefix+given+family selbst zusammenzubasteln.</p>",
        "id": 153921426,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511517051
    },
    {
        "content": "<p>name.text löst auch \"Herr\" vs. \"Herrn\" nicht ...<br>\nAlso aus dem Bauch raus ist gender die Lösung, die ich im allgemeinen kenne und auf die man früher oder später grammatik-bedingt sowieso zurückgreifen muss.</p>",
        "id": 153921427,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511517135
    },
    {
        "content": "<p>Rene hat das ja quasi auch bestätigt</p>",
        "id": 153921428,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511517168
    },
    {
        "content": "<p>Damit könnten wir auch den Fall \"Mein Titel ist Prof. Dr. med Dr. sc hum hc. Abu al Husseini, aber nennen Sie mich \"Doktor\"\" abbilden.</p>",
        "id": 153921429,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511517178
    },
    {
        "content": "<p>Das ist jetzt nicht unbedingt ein üblicher Use Case, aber: ja :D</p>",
        "id": 153921430,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511517238
    },
    {
        "content": "<p>\"name.text löst auch \"Herr\" vs. \"Herrn\" nicht ...\"<br>\nDoch, eigentlich schon... wenn ich weiß, dass ich flektieren muss (heißt das so...?), dann muss ich die Anrede selbst bauen, an sonsten, kann ich einfach auf name.text als default zurückgreifen</p>",
        "id": 153921431,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511517260
    },
    {
        "content": "<p>Aber dann bräuchtest Du schon 2 name.text, einen für die Briefadresse und einen für die Briefanrede ...<br>\nIch glaube, die meisten Systeme lösen das wirklich an den passenden Stellen mit einem if(gender ....) in der Display-/Report-/Dokument-Generierung.</p>",
        "id": 153921432,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511517370
    },
    {
        "content": "<p>Wenn wir also damit leben können, dass uns aus dem englischsprachigen Raum auch mal ein \"Mr. John Doe\" als Name erreicht und das dann vielleicht im Output hässlich aussieht: pro gender, contra prefix, contra name.text</p>",
        "id": 153921433,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511517499
    },
    {
        "content": "<p>Wenn wir es international kompatibler halten wollen, braucht es halt die extension und dann sinnigerweise auch den zusätzlichen Code.</p>",
        "id": 153921435,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511517774
    },
    {
        "content": "<p>Andererseits: da es eine Extension ist, somit außerhalb der 80%, können wir uns eh nicht darauf verlassen, diese auch übermittelt zu bekommen...</p>",
        "id": 153921436,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511517913
    },
    {
        "content": "<p>(bei internationalem Datenaustausch meine ich jetzt)</p>",
        "id": 153921437,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511517942
    },
    {
        "content": "<p>Ich wäre pro gender, contra prefix, pro name.text als Kompromiss. Dann ist beides drin und wir verletzen das Prefix nicht.</p>",
        "id": 153921438,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1511518042
    },
    {
        "content": "<p><span class=\"emoji emoji-1f44d\" title=\"+1\">:+1:</span></p>",
        "id": 153921440,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511518066
    },
    {
        "content": "<p>...auch wen der Einwand berechtigt ist, dass es schwierig wird, für Briefumschläge den Umbruch reinzufrickeln, aber irgendwas is ja immer und wer sendet heute eigentlich noch Briefe? :D</p>",
        "id": 153921441,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511518129
    },
    {
        "content": "<p>Briefe schon. Als PDF im Mail-Anhang :D</p>",
        "id": 153921442,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511518155
    },
    {
        "content": "<p>ad pro/contra/pro: da es beim Datenaustausch ohnehin sauberer ist, auf die Einzelkomponenten zu schauen, ist name.text IMHO eine eher interne Sache des jeweiligen Systems.</p>\n<p>tl;dr: d'accord <span class=\"user-mention\" data-user-id=\"194622\">@Evelyn Dröge</span></p>",
        "id": 153921443,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511518228
    },
    {
        "content": "<p>Aber schön, dass wir mal drüber gesprochen haben <span class=\"emoji emoji-1f602\" title=\"joy\">:joy:</span></p>",
        "id": 153921444,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511518271
    },
    {
        "content": "<p>Schön dass wir eine Lösung gefunden haben, ohne eine breaking change am Datentyp HumanName vornehmen zu müssen. Sonst müsste ich mich für den Rest meines Lebens vor Grahame verstecken :D</p>",
        "id": 153921445,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511518380
    },
    {
        "content": "<p>Ach, sowas ist nur 1x pro Leben erlaubt? <span class=\"emoji emoji-1f602\" title=\"joy\">:joy:</span></p>",
        "id": 153921447,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1511518421
    },
    {
        "content": "<p>Ich hab ein Issue erstellt: <a href=\"https://github.com/hl7germany/basisprofil-de/issues/72\" target=\"_blank\" title=\"https://github.com/hl7germany/basisprofil-de/issues/72\">https://github.com/hl7germany/basisprofil-de/issues/72</a></p>",
        "id": 153921448,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511518795
    },
    {
        "content": "<p>Soeben erreicht mich folgende Anfrage:</p>\n<blockquote>\n<p>Ich habe mich die letzten Tage mit dem HumanName-Profil in FHIR beschäftigt und habe lange gesucht, wo ich denn die Anrede (\"Herr\" / \"Frau\") hinpacken kann.<br>\nIm internationalen Basisprofil sollte es durch HumanName.Prefix abgedeckt werden. Im deutschen Profil habe ich jetzt aber in den Details folgende Erläuterung gefunden: </p>\n<p>\"Hinweis zur Repräsentation von Anreden: Diese sollten, sofern erforderlich, ausschließlich in HumanName.text erscheinen (z.B. \"Frsu Dr. Martha Musterfrau\"). Nach Möglichkeit sollte die Anrede aus dem Geschlecht der Person abgeleitet werden. Das Element prefix wird nur für akademische Titel und andere Namensbestandteile verwendet.\"<br>\n<a href=\"https://simplifier.net/BasisprofilDE/humanname-de-basis-0.2/~details\" target=\"_blank\" title=\"https://simplifier.net/BasisprofilDE/humanname-de-basis-0.2/~details\">https://simplifier.net/BasisprofilDE/humanname-de-basis-0.2/~details</a></p>\n<p>Nun meine Frage: inzwischen unterstützen wir ja in Deutschland (wie in vielen anderen Ländern) auch rechtlich ein drittes Geschlecht (\"divers\"), sowie \"unbestimmt\". Wenn ich nun solch eine Person erfasse, würde ich sie normalerweise fragen \"Wie möchten Sie angesprochen / angeschrieben werden\". D.h. die Anrede ist nun nicht mehr 100%ig vom Geschlecht ableitbar.</p>\n<p>Wissen Sie, ob da evtl. eine Änderung geplant ist, die eine explizite Anrede im Profil unterstützt? Oder gibt es hierfür bereits eine Möglichkeit, die ich übersehen habe?</p>\n</blockquote>",
        "id": 162518268,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554379904
    },
    {
        "content": "<p>...ich neige fast zu einer \"präferierteAnrede\"-Extension (Typ: code, Werte: männlich|weiblich|neutral)</p>",
        "id": 162518729,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554380366
    },
    {
        "content": "<p>wobei das schon wieder stark mit Gender-Identity überlappt: <a href=\"http://hl7.org/implement/standards/fhir/valueset-gender-identity.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/valueset-gender-identity.html\">http://hl7.org/implement/standards/fhir/valueset-gender-identity.html</a>...</p>",
        "id": 162519385,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554380925
    },
    {
        "content": "<p>Ja, bzw. der entsprechenden Extension: <a href=\"http://hl7.org/implement/standards/fhir/extension-patient-genderidentity.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/extension-patient-genderidentity.html\">http://hl7.org/implement/standards/fhir/extension-patient-genderidentity.html</a></p>",
        "id": 162519518,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554381005
    },
    {
        "content": "<p>Im Kontext der Anrede würde ich auf jeden Fall maximal für ein extensible binding plädieren (die Core-Extension hat nur Example-Binding an das ValueSet)</p>",
        "id": 162519609,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554381091
    },
    {
        "content": "<p>Wobei da auch nicht aus allen Werten eine klare Präferenz bezüglich der Anrede abzulesen wäre. Ich weiß nicht, wie viel Aufwand man den Entwicklern zumuten kann, um zur passenden Anrede zu kommen!? Wenn Gender unklar, dann gender-identity auf Anrede mappen, Ergebnis ggf. weiterhin unklar? :-/</p>\n<p>Wir hätten bei FHIR  die \"Facebook-Lösung\" verwenden sollen:<br>\nGeschlecht: männlich, weiblich oder Freitext. Wenn Freitext, dann Anrede auswählen (männlich/weiblich/neutral). <br>\nZulässige Eingabe: Geschlecht = <span aria-label=\"unicorn\" class=\"emoji emoji-1f984\" role=\"img\" title=\"unicorn\">:unicorn:</span> <span aria-label=\"rainbow\" class=\"emoji emoji-1f308\" role=\"img\" title=\"rainbow\">:rainbow:</span> , präferiert Anrede: <span aria-label=\"womens\" class=\"emoji emoji-1f6ba\" role=\"img\" title=\"womens\">:womens:</span></p>",
        "id": 162519898,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554381351
    },
    {
        "content": "<p>Für mich leitet sich die Anrede auch direkt aus der genderidentity ab. Eine präferierte Anrede Extension würde hier ja das gleiche ValueSet verwenden wie die genderidentity.</p>",
        "id": 162520009,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1554381425
    },
    {
        "content": "<blockquote>\n<p>Für mich leitet sich die Anrede auch direkt aus der genderidentity ab. Eine präferierte Anrede Extension würde hier ja das gleiche ValueSet verwenden wie die genderidentity.</p>\n</blockquote>\n<p>Ich finde, um eine klare Anrede abzuleiten ist genderIdentitiy immer noch zu wischi-waschi....</p>",
        "id": 162520590,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554381853
    },
    {
        "content": "<p>Da bräuchte man im Prinzip nochmal eine ConceptMap die den Werten eine Anrede zuweist (sofern möglich). Das wäre dann also zweifache Indirektion mit unklarem Ausgang ...</p>",
        "id": 162521351,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554382438
    },
    {
        "content": "<p>Nebenbei: Gibt es in DE überhaupt eine Alternative zu männlich/weiblicher Anrede? Geht \"neutral\" überhaupt? Ich weiß in Englisch gibt's das...</p>",
        "id": 162521494,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554382508
    },
    {
        "content": "<p>Binnenmajuskel? Gendersternchen?</p>",
        "id": 162521676,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554382604
    },
    {
        "content": "<p>Worauf ich hinaus will: Kann/darf die Ermittlung der Anrede ergebnis-offen verlaufen, oder muss am Ende immer ein \"männlich\" oder \"weiblich\" herauskommen?</p>",
        "id": 162521871,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554382737
    },
    {
        "content": "<p>Exzellenz, da müssten ja ggf. auch noch prefix, suffix, und so mamches andere bemüht werden, um dem Knigge genüge zu tun...</p>",
        "id": 162522504,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1554383141
    },
    {
        "content": "<p>\"Guten Tag, Max Musterdivers...\" habe ich gerade als mögliche Neutralform ergoogelt :)</p>",
        "id": 162522632,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554383213
    },
    {
        "content": "<p>Angenommen, neutrale Anrede ist eine Option: Warum würde jemand sein amtliches Geschlecht auf \"divers\" setzen lassen, dann aber auf eine männliche oder weibliche Anrede bestehen? Ist der gesamte Sinn und Zweck von \"divers\" nicht der, dass sich diese Personen eben <em>nicht</em> auf das eine oder andere festlegen wollen? <br>\nLiegt die Notwendigkeit einer vom amtlichen Geschlecht abweichenden Anrede nicht eher in dem Fall, wo eine Person z.B. amtlich (noch) \"männlich\" ist, sich jedoch als weiblich identifiziert, was ja über genderIdentity = TransgenderFemale abzubilden wäre... ?</p>\n<p>Ich brauche bitte Szenarien, die mir beim Denken helfen...</p>",
        "id": 162525350,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554384946
    },
    {
        "content": "<p>Ein Wort: Freitext.<br>\nWer will, kann sich ja an den String ein ValueSet binden ...</p>",
        "id": 162526672,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554385869
    },
    {
        "content": "<p>Dämliche Frage: Wieso slicen wir nicht prefix und definieren ein slice als Anrede? Auch Grahame verweißt bei Anrede auf prefix</p>",
        "id": 162537682,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1554392185
    },
    {
        "content": "<p>Hatten wir in der Historie schon mal in Betracht gezogen, aber verworfen weil es <br>\na) keinen geeigneten Qualifier-Code gab und<br>\nb) weil die direkte Angabe von z.B. „Herr“ als Präfix zwar korrekt, in der Deutschen Sprache aber leider nicht immer zu gebrauchen ist (z.B. Adresse „Herrn“) oder man oft trotzdem die Unterscheidung männlich/weiblich braucht („geehrter/r“)</p>",
        "id": 162542108,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554394879
    },
    {
        "content": "<p>Mag im Englischen Sprachraum so funktionieren, aber für uns wäre die Lösung zu einfach  :P</p>",
        "id": 162542216,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554394933
    },
    {
        "content": "<p>Ich erinnere mich.. doch bevor wir eine Extension nutzen würde ich den Prefix vorziehen.</p>",
        "id": 162543362,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1554395669
    },
    {
        "content": "<p>Würde ich unterschreiben, wenn du mir sagen kannst, wie das Präfix für eine Person lautet, die geschlechtsneutral angesprochen werden möchte :)</p>",
        "id": 162543701,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554395883
    },
    {
        "content": "<p>Sag jetzt nicht „Guten Tag“ :D</p>",
        "id": 162543734,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554395913
    },
    {
        "content": "<p>Bisher ist mir nur „Sehr geehrt*“ untergekommen. Und „es“ als Pronomen. Präfix hätte ich im Deutschen leer erwartet.</p>",
        "id": 162545554,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1554397198
    },
    {
        "content": "<p>Schade das es kein *x Präfix gibt Mx ist so schön einfach im Englischen <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 162545681,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1554397258
    },
    {
        "content": "<p>Ich wiederhole mich mal: Freitext und nicht weiter drüber nachdenken, solange eigentlich niemand was genaues weiß.</p>\n<p>prefix wäre trotz Grahames Aussage nicht ganz korrekt, da prefix ein Namensbestandteil sein soll: \"Part of the name that is acquired as a title due to academic, legal, employment or nobility status, etc. and that appears at the start of the name.\"</p>",
        "id": 162559081,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554405584
    },
    {
        "content": "<p>Oder gibt es einen entsprechenden Bundesverband der Diversgeschlechtlichen, die dazu verbindlich Auskunft geben könnten?</p>",
        "id": 162559208,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554405661
    },
    {
        "content": "<p>Wo tätest du den Freitext den hintun?</p>",
        "id": 162559999,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554406233
    },
    {
        "content": "<p>Formal korrekt tatsächlich in eine Extension direkt an HumanName.<br>\nAber ich wäre jetzt auch nicht so dogmatisch, gegen eine Mehrheit aus \"prefix\"-Befürwortern anzukämpfen ;-)</p>",
        "id": 162560912,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554406864
    },
    {
        "content": "<p>Oder sogar nicht an HumanName, sondern an die entsprechenden Einzelressourcen. Aber das wäre evtl. zu unpragmatisch.</p>",
        "id": 162560966,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554406909
    },
    {
        "content": "<p>Das einzige was ich mit Freitext nicht ausdrücklich darstellen könnte ist, dass explizit keine Anrede zu wählen ist. Oder gibt’s dafür auch ne Möglichkeit?</p>",
        "id": 162594030,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1554440720
    },
    {
        "content": "<p>Nach dem Motto: „Bitte mach kein Fallback auf eine binäre Mann/Frau Anrede, das auslassen ist explizit“</p>",
        "id": 162594159,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1554440934
    },
    {
        "content": "<p>Ich bin bei Stefan und Freitext, da hat man keine unnötige Einschränkungen &amp; erzwingt keine unnötige \"Rate- Logik\" bei den Clients. Und \"bitte gar keine Anrede\" könnte man ja auch kommunizieren, in dem man die Extension reinschreibt, den entsprechenden Text aber leer lässt (würde sogar mit den dümmsten Text-Concatenation funktionieren <span aria-label=\"smirk\" class=\"emoji emoji-1f60f\" role=\"img\" title=\"smirk\">:smirk:</span>  )</p>",
        "id": 162597261,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1554445555
    },
    {
        "content": "<p>Achtung: Leere Werte sind in FHIR verboten! Alle Elemente müssen entweder einen Wert oder eine Extension haben (gilt auch für Extensions). In der Praxis würde das bedeuten, dass man die Extension mit einer Null-Flavor-Extension extenden müsste, um sie \"explizit leer\" zu lassen.   ...suboptimal...</p>\n<p>Wenn ich das Problem mal kurz mit Fantasie-Zahlen durchrechnen darf: Ich schätze, dass etwa 50-70% aller Systeme überhaupt Anreden verwenden, wobei die meisten davon vermutlich nur zwischen männlich/weiblich unterscheiden können und davon wiederum ein großer Prozentsatz die Anrede hart mit dem Geschlecht verdrahtet.<br>\nWeiterhin würde ich schätzen, dass der Anteil von Menschen mit Geschlecht \"divers\" momentan im Promille-Bereich liegt (in Zukunft sicherlich steigend). Das Problem fällt aber auf jeden Fall aus der 80%-Regel heraus, weshalb ich hier klar für \"Extension\" votieren würde.<br>\nDas Gefrickel mit Präfix würde m.E. in Systemen, die sich um Anreden nicht scheren, bzw, diese hart mit \"Geschlecht\" verdrahten, nur zu unnötiger Verwirrung führen.</p>\n<p><em>national vs. international</em>: <br>\nWir haben ja bereits festgestellt, dass es sich hier um eine Komplikation der Deutschen Sprache handelt, daher rechne ich nicht mit überwältigender Begeisterung, wenn wir die Extension international ansiedeln wollten. Es mag sein, dass andere Sprachen eine ähnliche Problematik kennen, aber dort könnten wiederum die Lösungsmöglichkeiten (z.B: andere Ausprägungen von  \"neutral\") anders aussehen.</p>\n<p>(edit: Konsultiere diesbezüglich mal die Patient Administration WG)</p>\n<p><em>Datentyp</em>: Mein Votum wäre \"code\" mit required binding an \"männlich | weiblich | neutral\", da es für mich nicht absehbar ist, dass da in naher Zukunft weitere Ausprägungen möglich sein werden... <br>\nSyteme, die keine neutrale Anrede unterstützen, könnten die Werte entsprechend einschränken.</p>\n<p><em>Context</em>:<br>\nDa bin ich unentschlossen. Patient/Practitioner root-level? gender? HumanName?<br>\nTendenz: HumanName, dann hätten wir's automatisch überall dort, wo es theoretisch gebraucht werden könnte (Patient, Next of Kin, Practitioner...)</p>",
        "id": 162598633,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554447270
    },
    {
        "content": "<p>Extension fände ich auch gut. Wenn einen Code, dann wäre ich aber für einen \"extensible binding\", der Haltbarkeit halber - ich bin mir nicht so sicher, dass keine Szenarien gibt, in den man ggf. andere eingschlägige Möglichkeiten kodieren möchte. Unbekannte Codes könnte man wie \"neutral\" behandeln (sicherlich auch nicht perfekt, aber da kommen wir wohl  eh nicht hin...).</p>",
        "id": 162600810,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1554449999
    },
    {
        "content": "<p>Ja, wenn Code, dann extensible.</p>",
        "id": 162601308,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554450535
    },
    {
        "content": "<p>wenn extensible dann CodeableConcept</p>",
        "id": 162601349,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554450592
    },
    {
        "content": "<p>Ja :)</p>",
        "id": 162601853,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554451160
    },
    {
        "content": "<p>Ich habe den Thread gerade nochmals komplett gelesen, und ich glaube wir drehen uns bei diesem Problem etwas im Kreis (schon vor dem Thread). Deutsch ist eine doofe Sprache um sie in Datenfelder zu packen. <br>\nWas wäre denn in Anrede drinnen? Herr, Herrn, Sehr geehrter Herr ?<br>\nFür mich ist die Anrede doch einfach Businesslogik und soll von den Systemen welche eine Anrede benötige in ihrem Kontext passend aus A-Gender, oder Gender Identity gebaut werden.</p>",
        "id": 162627505,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1554474157
    },
    {
        "content": "<p>Ich würde sogar den Hinweis bezüglich: \"Hinweis zur Repräsentation von Anreden: Diese sollten, sofern erforderlich, ausschließlich in HumanName.text erscheinen\" aus HumanName nehmen. <br>\nWir benutzen bspw. HumanName.text in Auswahllisten. Wenn hier Dame, oder gar sehr geehrte Damen steht ist das erstmal komisch.<br>\nFür mich ist text der komplette Name, incl. aller Namensbestandteile in der korrekten Reihenfolge. Und eine einfache Anrede ist für mich kein Namensbestandteil.</p>",
        "id": 162627729,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1554474337
    },
    {
        "content": "<p>Ja. Mal eine ganz naive Frage: Das gehört doch nicht in Maschinendaten, sondern ist explizit für die Menschenlesbarkeit. Also passt das ggf. in die text-representation einer Resource? Vielleicht mit best practices für die Business-Logik. Ich stelle mir eine Resource “Anrede” oder Begrüßung vor.</p>",
        "id": 162627834,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1554474398
    },
    {
        "content": "<p>Wäre denn die folgende Logik vertretbar: Anrede ergibt sich aus gender (Male/female); falls gender = other, dann ist die Anrede stets neutral, es sei denn genderIdentity = Male/Female</p>",
        "id": 162627873,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554474433
    },
    {
        "content": "<p>Also eine Spezialisierung, in der die Resource (und also der Text) eine bestimmte Funktion hat.</p>",
        "id": 162627905,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1554474468
    },
    {
        "content": "<blockquote>\n<p>Also passt das ggf. in die text-representation einer Resource? </p>\n</blockquote>\n<p>in text gehören für mich alle Namensbestandteile in der richtigen Reihenfolge. Anrede gehört hier, falls kein akad. Titel, nicht dazu.</p>",
        "id": 162628744,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1554474991
    },
    {
        "content": "<p>Daher sagte ich ja: Spezialisierung einer Resource. Damit der text dann für diesen Resourcen-Zweck spezifisch \"Ich bin eine Anredefloskel\" erfüllen darf. Kann ja irgendeine Resource sein, die im inneren auf die eigentliche Person Resource refernziert (Geht sowas in FHIR?) Composition.section.text (mit spezifischer section, die nur Anrede und Grußfloskeln enthält: Sehr geehrte Frau Dr. XYZ, wir berichte über Ihren patienten...)</p>",
        "id": 162629751,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1554475789
    },
    {
        "content": "<p>Wo taucht denn z. B. in einer Composition der Empfänger auf? Braucht es dafür nicht eh irgendeinen eigenen Abschnitt? Da hätte \"text\" dann eben diese Bedeutung?</p>",
        "id": 162630067,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1554476004
    },
    {
        "content": "<p>Anrede in Composition wäre section.text</p>",
        "id": 162630353,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554476179
    },
    {
        "content": "<p>Das ginge dann aber Richtung CDA Level 2 ...<br>\nM.E. entfernt sich das gerade noch weiter von der (soweit ich verstehe) ursprünglichen Frage, wie die Anrede <em>innerhalb der strukturierten Ressourcen</em> abzubilden ist, wenn man das denn tun möchte.</p>\n<p>Und viele Systeme tun das, oft sogar separat nach Anrede \"Frau\" und Briefanrede \"Sehr geehrte Frau\".</p>\n<p>Composition.section.text kann man natürlich füllen. Das beantwortet aber nicht die Frage, wo man die Information zur Person zugeordnet ablegt.</p>",
        "id": 162656497,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554494958
    },
    {
        "content": "<p>Ebenfalls noch mal zurück zu der Frage, die diesen Thread \"wiederbelebt\" hat: es geht klar um folgendes: </p>\n<p><em>Die Anrede ist nicht mehr eindeutig vom Geschlecht ableitbar. Wohin packt man die Anrede?</em></p>\n<p>Wenn die Ableitbarkeit doch gegeben ist (es also für \"divers\" und \"unbestimmt\" eine klare Anrede gibt), ist die Frage mit \"Passt doch\" abzuweisen. Das ist aber offensichtlich nicht der Fall.</p>\n<p>Jedes ValueSet, das nicht feiner granuliert ist als \"M/W/D/U\", scheidet damit automatisch als alleinige Lösung ebenfalls aus.</p>\n<p>Bleiben im Grunde erst mal drei Optionen:</p>\n<p>A) das vorhandene gender-identity<br>\nB) ein feiner granuliertes ValueSet<br>\nC) Freitext</p>\n<p>Für A bzw. B muss bekannt sein, was denn nun die jeweilige textuelle Anrede (vulgo: die Bedeutung des Codings) sein soll.<br>\nDas kann, soweit ich überblicke, niemand der hier diskutierenden mit Bestimmtheit sagen. Also brauchen wir fachlichen Input, der uns sagt, was als Anrede erlaubt bzw. möglich ist. </p>\n<p>Oder wir gehen vorerst den einfachen Weg mit Variante C.</p>\n<p>Oder dann:<br>\nD) Ein sinnvoller Kompromiss wäre m.E. (wie evtl. auch von Simone gemeint) eine CodeableConcept-Extension mit Binding in erster Version an ein ValueSet \"M/W\" - hierfür sind die Anreden klar bekannt. Im Fall einer anderen geschlechtlichen Identität bleibt eben CodeableConcept.coding weg und man schreibt den Freitext nach CodeableConcept.text.</p>\n<p>In einer zukünftigen Iteration kann man dann schauen, ob sich typische Anreden für divers entwickeln und diese ggf. als neue Codes ergänzen.</p>\n<p>Das ganze formal korrekt als Extension, die im Kontext der Ressourcen Patient, Practitioner, RelatedPerson und Person erlaubt ist, denn die Anrede ist nicht Teil des Namens.</p>\n<p>D) wäre meine Motion</p>",
        "id": 162658874,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554496801
    },
    {
        "content": "<p>Wenn und falls sich die community weiterhin mit der Formalisierung der menschenlesbaren Anrede in maschinenlesbarer Form beschäftigen möchte, bin ich erstmal raus.</p>",
        "id": 162662348,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1554499267
    },
    {
        "content": "<p>Ich versuche mich hier mal an der Formulierung des <em>gefühlten</em> Konsens (...man möge mir widersprechen...)<br>\nWir erstellen eine Deutsche Extension \"anrede\" mit Datentyp CodeableConcept und einem preferred(?) Binding an ein ValueSet mit den Werten \"männlich|weiblich|neutral\" (Nach meinen initalen Recherchen ist die <em>Neutrale Anrede</em> in der Tat ein Ding und wird von Personen mit dem Geschlecht \"divers\" i.d.R präferiert. In Briefen wird dann mit \"Guten Tag, &lt;Vorname&gt; &lt;Nachname&gt;...\" angeredet.</p>",
        "id": 163446873,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1555399335
    },
    {
        "content": "<p>klingt gut, ich würde beim Binding zu extensible tendieren. Eine Verständnisfrage hierzu: Dupliziert dies nicht die Funktion der gender identity extension? Bzw. enthält die gleichen Values?</p>",
        "id": 163450086,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1555403029
    },
    {
        "content": "<p>jaaa...jein... das Problem mit GenderIdentity ist, dass die Werte dort mehrheitlich keine klare Aussage über die Anrede machen (\"transgender-female-to-male, nonbinary,...). Es wäre  zu diesem Zwecke nur verwendbar, wenn man diese nochmals auf etwas eindeutiges mappt (\"trangender-male-to-female\" -&gt; weiblich, \"transgender-female-to-male\"-&gt; männlich und bei \"nonbinary\" wäre man kein Stück schlauer...</p>",
        "id": 163465215,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1555418574
    },
    {
        "content": "<p>...was sagt der ursprüngliche Anfrager <span class=\"user-mention\" data-user-id=\"217019\">@Markus Nitsche</span> dazu?</p>",
        "id": 163535756,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1555483389
    }
]