[
    {
        "content": "<p>Hallo zusammen, <br>\nWie auf dem Interop-Forum angekündigt, haben wir eine neue Resource erstellt, die verwendet werden soll, um aus erbrachten Leistungen eine Rechnung zu erstellen (z.B. an den Patienten, einen abweichenden Rechnungsempfänger, eine Praxis o.ä.)<br>\n<a href=\"http://build.fhir.org/invoice.html\" target=\"_blank\" title=\"http://build.fhir.org/invoice.html\">http://build.fhir.org/invoice.html</a><br>\nIch bitte um Kommentare, Kritik, Fragen, Vorschläge.<br>\nBitte nicht zu lange zögern, da in einer Woche der code freeze für R4 beginnt :)</p>",
        "id": 153923658,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512718535
    },
    {
        "content": "<p>Die Detail-Definitionen zu denen man gelangt, wenn man auf den Element-Namen klickt, bitte nicht beachten, die sind noch nicht gepflegt...</p>",
        "id": 153923659,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512718663
    },
    {
        "content": "<p>Ich habe leider nicht ganz so viel Zeit, daher habe ich nur ganz schnell drüber geschaut. Sollte man die Ressource auch bei PKV-Rechnungen verwenden können? Dann fehlen mir auf dem ersten Blick Felder für Faktor, Analogzifferndarstellung, Begründungen (auf Item-Ebene), Minderungen + stationäre Aufenthalte (i.d.R. auf Rechnungsebene - für letzteres eine Referenz auf eine Ressource, bei der diese Daten eingetragen werden können). Bei Zahnrechnungen würde mir die Möglichkeit Zahnregionen anzugeben fehlen. Ist note auch für Rechnungstexte gedacht oder fehlt hier was? Können Auslagen und Honorar voneinander unterschieden werden?  Wie kann man die Diagnosen von der Rechnung referenzieren? Das deckt natürlich nicht alles ab, aber würde mir bei einer 80%-Lösung fehlen (wie gesagt, wenn auch PKV-Rechnungen mit dargestellt werden sollen).</p>",
        "id": 153923690,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1512732293
    },
    {
        "content": "<p>Ich versuche mal zu dröseln... :-)<br>\n<strong>Auf- und Abschläge</strong> kann man mit Invoice.lineItem.priceComponent ausdrücken<br>\ntype = surcharge | discount<br>\ncode = genaue Bezeichnung/Code für den Auf-/Abschlag<br>\namount = Betrag der aufgeschlagen oder abgezogen wurde<br>\n<strong>Analogzifferndarstellung</strong> k.A. , muss ich erst Googlen... ;-)<br>\n<strong>Begründung</strong> könnte man pro ChargeItem in ChargeItem.reason angeben<br>\n<strong>stationäre Aufenthalte</strong> sind über den Account verlinkt (Invoice.account  = Encounter.account)<br>\nIn Encounter findet man dann Dinge wie Aufnahme-/Entlassdatum, Hauptdiagnose, Fallart, etc.<br>\n<strong>Zahnregion</strong> befände sich in ChargeItem.bodySite<br>\n<strong>Rechnungstexte</strong> Dafür hätten wir wahlweise note oder paymentTerms um Text strukturiert zu persistieren. Darüber hinaus kann man natürlich jedes Rechnungsdokument (z.B. PDF), das aus der Invoice generiert wird mit beliebigen Texten \"aufhübschen\".<br>\n<strong>Minderungen auf Rechnungsebene</strong> das wäre dann Invoice.totalPriceComponent mit type=discount</p>",
        "id": 153923710,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512735850
    },
    {
        "content": "<p>Danke Simone :) Ich hätte wohl mal in das ChargeItem schauen sollen...</p>\n<p>Ein paar Ergänzungen:</p>\n<p><strong>Minderungen auf Rechnungsebene</strong> Minderung ist ja nicht gleich Rabatt. Wenn es auf einer Rechnung beides gibt, kann man das unterscheiden? <br>\n<strong>Analogziffern</strong> Arzt erbringt eine Leistung, die es in GOÄ oder GOZ nicht gibt und rechnet Analog ab (andere Ziffer + A). Sonderfall, da es eine erbrachte und eine abgerechnete Leistung gibt. <br>\n<strong>Faktoren</strong> fehlen noch, oder?</p>",
        "id": 153923717,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1512737118
    },
    {
        "content": "<p><strong>Minderungen</strong> Könnte man unterscheiden, da man zu jeder Component noch einen (beliebigen) code angeben kann<br>\nalso<br>\nInvoice.totalPriceComponent<br>\ntype = discount<br>\ncode = Vielfliegerrabatt<br>\nInvoice.totalPriceComponent<br>\ntype = discount<br>\ncode = Minderung<br>\nIch wäre aber auch nicht abgeneigt, einen zusätzlichen type-code dafür einzufügen, wenn uns ein griffiges englisches Wort dafür einfällt.<br>\n<strong>Analogziffern</strong> verstehe ich das richtig so: Im GOÄ gibt es nur die Ziffer 12345 für \"Appendektomie minimal-invasiv\" aber der Arzt hat \"Appendektomie mit Nanosonden\" durchgeführt, was es im GOÄ nicht gibt, also rechnet er 12345A ab und schreibt irgendwo einen Freitext dazu, dass er in Wirklichkeit etwas anderes gemacht hat und schlägt 20% auf den Preis für 12345 auf...?<br>\nFalls so oder so ähnlich könnte ich mir das als ChargeItem mit factorOverride oder priceOverride und overrideReason vorstellen.<br>\n<strong>Faktoren</strong> müssen die in der Rechnung explizit ausgewiesen werden? Oder reicht es, den berechneten Aufschlag anzugeben?</p>",
        "id": 153923785,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512757217
    },
    {
        "content": "<p>Nachtrag zu <strong>Minderung</strong>:<br>\nLaut Google Translate erscheinen mir \"discount\", \"reduction\" und \"deduction\" ziemlich synonym zu sein. <br>\nWenn die Begriffe nicht klar voneinander abgrenzbar sind, würde ich keinen zusätzlichen type-code einführen wollen.<br>\nAber ich wäre offen für die Umbenennung von \"discount\" in \"reduction\" oder \"deduction\", falls einer der Begriffe weiter gefasst wäre...</p>",
        "id": 153923788,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512757471
    },
    {
        "content": "<p>Ich muss mir die Einzelheiten noch genauer ansehen. Aber normalerweise wird für einen Abzug in den Gebühren oder auch in Beiträgen der Begriff \"deduction\" verwendet. .</p>",
        "id": 153924050,
        "sender_full_name": "Andreas Schultz",
        "timestamp": 1512921337
    },
    {
        "content": "<p>Gerne. Ich finde auch, dass \"discount\" etwas zu sehr nach \"Supermarkt\" klingt ;-)</p>",
        "id": 153924064,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512923951
    },
    {
        "content": "<p>\"Herztransplantationen: Heute im Super-Sonderangebot!\"</p>",
        "id": 153924065,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512924020
    },
    {
        "content": "<p>Kaufen Sie zwei Packungen Cholesterinsenker und erhalten Sie einen BigMac gratis dazu! :D</p>",
        "id": 153924067,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512924081
    },
    {
        "content": "<p>Faktoren müssen immer explizit ausgewiesen werden bei GOÄ und GOZ (zu jeder Leistungsposition in der Rechnungstabelle - sind also so unverzichtbar wie eine Anzahl).</p>\n<p>Minderungen gibt es auf <strong>jeder</strong> stationären Rechnung. Rabatte kommen viel seltener vor. Für Minderungen verwenden wir in unseren v3-basierten Modell \"Deduction\". Rabatte haben (bei uns) keine eigene Klasse und Namen, da sie viel seltener sind. Hier würde ich aber tatsächlich so etwas wie \"Discount\" vorschlagen (da das tatsächlich Dinge wie Kollegen- oder Studentenrabatte sind - zumindest in der Theorie). Macht sie unterscheidbar. Deduction wäre dann nur den Minderungen vorbehalten.</p>\n<p>Analogziffern: Ob da etwas aufgeschlagen wird, weiß ich nicht. Ist mir so nicht bekannt. Wichtig wäre mir hier, dass der Leistungstext und die Ziffer abweichen kann. Wenn man also einfach angeben kann, dass es sich bei der Analogziffer um eine Analogziffer handelt, wäre das gut. Vielleicht ist das aber auch zu speziell und sollte über eine Extension geregelt werden.</p>\n<p>Möchte man die Ressource für eine PKV-Rechnung verwenden, geht es nicht ohne Minderung und Faktor. Die Minderung muss unterscheidbar vom Rabatt sein, da sonst nicht nachberechnet werden kann, ob sie stimmt.</p>",
        "id": 153924212,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1512985009
    },
    {
        "content": "<blockquote>\n<p>Wie auf dem Interop-Forum angekündigt, haben wir eine neue Resource erstellt, die verwendet werden soll, um aus erbrachten Leistungen eine Rechnung zu erstellen (z.B. an den Patienten, einen abweichenden Rechnungsempfänger, eine Praxis o.ä.)<br>\n<a href=\"http://build.fhir.org/invoice.html\" target=\"_blank\" title=\"http://build.fhir.org/invoice.html\">http://build.fhir.org/invoice.html</a></p>\n</blockquote>\n<p>Bei \"LineItem\" fehlen mir noch reine Textzeilen, also Erläuterungen am Beginn und Ende einer Rechnung, bzw. eines Blocks innerhalb der Rechnung.</p>\n<p>Bei den Verweisen wird direkt auf Patient und Organisation verwiesen. Was ich noch vermisse einen (optionalen) Verweis auf das Versichertenverhältnis und auf den administrativen Fall (encounter und/oder claim) - oder habe ich was übersehen?</p>\n<p>Nützlich (aber nicht zwingend erforderlich - hängt vom Anwendungsfall ab, den man damit abdecken will) wären zudem weitere Datumsfelder (neben dem Rechnungsdatum). Typischerweise hat bei uns eine Rechnung noch ein Buchungsdatum, eine Liste von Daten, wann ein Ausdruck der Rechnung erfolgt ist, wann die Rechnung storniert wurde, wann die Rechnung bezahlt wurde.</p>",
        "id": 153924222,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1512988566
    },
    {
        "content": "<p><strong>Coverage</strong> und <strong>Encounter</strong> sind über den Account verlinkt. </p>\n<p>Da jedes lineItem aus einem ChargeItem besteht, welches wiederum über ein Element ChargeItem.note verfügt, könnte man da schon <strong>Vermerke</strong> hinzufügen. Wobei zu klären wäre, ob unbedingt jede Notiz an einem ChargeItem auf der Rechnung erscheinen sollte, oder ob das nicht eher für Notizen zum internen Gebrauch verwendet wird.</p>\n<p>Bzgl: <strong>Minderung</strong>: Was spricht dagegen, alle Typen von Abzügen als \"deduction\" zu  bezeichnen und für die Unterscheidung verschiedene Codes (\"Minderung\", \"Studenten-Rabatt\", \"Mitarbeiter-Rabatt\"...) zu verwenden? Gibt es viele verschiedene Codes für \"Minderung\", so dass diese nicht eindeutig anhand des Codes zu erkennen wären?</p>\n<p><strong>Faktor</strong> sehe ich ein. Wir basteln zwar gerade noch parallel an eine ChargeItemDefinition-Resource, die die ganzen Preise, Faktoren, Zu- und Abschläge für eine Abrechnungsziffer enthalten soll, die dann zur Berechnung herangezogen werden, aber diese kann ja pro Abrechnungsziffer verschiedene Faktoren enthalten, die jeweils unter verschiedenen Bedingungen greifen, daher müsste man in der Rechnung tatsächlich konkret ausweisen, welcher Faktor hier verwendet wurde.</p>",
        "id": 153924291,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1513015427
    },
    {
        "content": "<p>Wie wäre es, wenn wir zu priceComponent ein Element factor (Decimal) hinzufügen...?<br>\n<a href=\"/user_uploads/10155/rkNefqg9gw3Dtn_IfDZhxLuV/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/rkNefqg9gw3Dtn_IfDZhxLuV/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/rkNefqg9gw3Dtn_IfDZhxLuV/pasted_image.png\"></a></div>",
        "id": 153924292,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1513015577
    },
    {
        "content": "<p>Analog dann auch zu totalPriceComponent...</p>",
        "id": 153924293,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1513015592
    },
    {
        "content": "<p>Hallo,</p>\n<p><strong>Faktoren</strong> braucht man nur auf Element-Ebene, nicht beim Total. Falls sich das unterscheiden lässt, würde ich also nur da ein Decimal \"factor \" hinzufügen. Ich habe in meiner Erklärung oben nicht deutlich gemacht, dass sie auch nur bei GOÄ- und GOZ-Positionen vorhanden sind, nicht bei reinen Auslagen. Sie sollten daher nicht verpflichtend sein (sollten sie aber wohl auch nicht, weil eine Invoice nicht immer nur eine PKV-Abrechnung ist). Sie kommen maximal 1x pro Zeile vor. Auf der Papierrechnung wird der Faktor beispielsweise bei Laborziffern nicht immer explizit ausgewiesen, ist aber immer vorhanden. Das ist wie beim Rechnungsdatum: das steht in der Rechnungstabelle manchmal auch nur an oberster Stelle und gilt so lange, bis ein neues Datum auftaucht. Manche Abrechnungssoftware oder Abrechnungsstelle wählt ein solches Layout - was dann aber nicht bedeutet, dass die Position kein Datum oder keinen Faktor hat. Auch Anzahlen müssen nicht immer explizit aufgeführt werden - wenn auf dem Papier nichts steht, ist in der Regel die Anzahl 1 gemeint.</p>\n<p><strong>Minderungen</strong>: Deduction für alle Abzüge zu verwenden finde ich gefährlich. Wenn ihr das aber unbedingt so machen möchtet, okay. Ich wäre dann aber dafür, dass der Code verpflichtend ist, wenn das umsetzbar ist. Minderungen gibt es nur zu 15% oder 25%. Sie können auf Positionsebene und/oder Rechnungsebene ausgewiesen werden. Auslagen werden nicht gemindert. Davon ab gilt die Minderung für die ganze Rechnung. </p>\n<p>Wäre es eine Option, Abzüge die keine Minderungen sind nicht als Deduction, sondern als negative Auslagen zu modellieren? Das fände ich passender als Minderungen und Rabatte gleich zu benennen.</p>",
        "id": 153924463,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1513071539
    },
    {
        "content": "<p>Hallo,</p>\n<p>ich habe eine neue Version committed, mit folgenden Features:</p>\n<ul>\n<li>detailed descriptions: <a href=\"http://build.fhir.org/invoice-definitions.html\" target=\"_blank\" title=\"http://build.fhir.org/invoice-definitions.html\">http://build.fhir.org/invoice-definitions.html</a></li>\n<li>factor in priceComponent: <a href=\"http://build.fhir.org/invoice.html#Invoice.lineItem.priceComponent\" target=\"_blank\" title=\"http://build.fhir.org/invoice.html#Invoice.lineItem.priceComponent\">http://build.fhir.org/invoice.html#Invoice.lineItem.priceComponent</a></li>\n<li>die Strukturen von priceComponent und totalPriceComponent sind jetzt die gleichen (ist pflegeleichter)</li>\n<li>zusätzlicher code für priceComponent.type: deduction<br>\n<a href=\"http://build.fhir.org/invoice.html\" target=\"_blank\" title=\"http://build.fhir.org/invoice.html\">http://build.fhir.org/invoice.html</a></li>\n</ul>",
        "id": 153924947,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1513202183
    },
    {
        "content": "<p>Zur Info: Das Proposal für die Invoice-Resource wurde auf dem letzten WGM angenommen. Invoice wird daher Bestandteil der nächsten FHIR-Version R4 sein.</p>",
        "id": 153964057,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1526988971
    }
]