[
    {
        "content": "<p>Im Rahmen des Kommentierungsverfahrens hat uns folgender Kommentar erreicht:</p>\n<blockquote>\n<p>Datenobjekt Diagnose (Condition)<br>\nDie obligatorische Unterstützung (Must Support) des Elements onset als auch die Bereitstellung eines zugehörigen Search Parameters ist zu hinterfragen. Im heutigen gesetzlich festgelegten Umfang der Diagnosendokumentation (vgl. §301 SGB V iVm Deutsche Kodierrichtlinien sowie BfArM Anleitung zur Verschlüsselung) ist diese Information nicht verfügbar. Dieses Element sowie der Suchparameter sollten als KANN Anforderung umgesetzt werden.</p>\n</blockquote>\n<p>Dazu hätten wir gerne eine Meinungsbild: Ist es tatsächlich unüblich, dass der Zeitpunkt des Eintretens einer Diagnose (z.B. im Rahmen einer Anamnese) erhoben wird? Wir hatten uns hier an den Vorgaben der KBV für die MIOs orientiert und neben der Angabe von konkreten Daten auch Lebensphasen ermöglicht.</p>\n<p>Profil in IsiK: <a href=\"https://simplifier.net/isik/diagnose\">https://simplifier.net/isik/diagnose</a><br>\nValueSet zur Angabe der Lebensphase: <a href=\"https://simplifier.net/basisprofil-de-r4/valuesetlebensphasede\">https://simplifier.net/basisprofil-de-r4/valuesetlebensphasede</a></p>\n<p>Wir bitten hier um ein Meinungsbild: Was ist implementierbar? Wie häufig und mit welcher Genauigkeit werden Diagnosedaten erfasst?<br>\nCAVE: Es geht hier um den Zeitpunkt des Auftretens einer Erkrenkung, nicht um den Zeitpunkt der Erfassung einer Diagnose!</p>",
        "id": 234857914,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1618581691
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  ich denke Du musst die Frage konkretisieren. Diagnosedaten wie Du fragst ist sehr breit und deckt alles von der Klinischen Aufnahme bis hin zur Diagnosencodierung ab.</p>\n<p>Da das Profile auf codierte Diagnose abzielt ist für SAP Patient Management/i.s.h.med festzuhalten, dass dort diese Erfassung derzeit nicht erfolgt. <br>\n<span class=\"user-mention\" data-user-id=\"191964\">@Bettina Lieske</span>  <span class=\"user-mention\" data-user-id=\"193158\">@Udo Siefker</span>  ergänzt gerne.<br>\nDies basiert auf der Erforderlichkeit gemäß den gesetztlichen Vorgaben im SGB V. Die MIOs haben hier die ärztliche Perspektive als Grundlage der Modellierung gewählt. Aber dies ist ein ganz anderer Ansatz.</p>",
        "id": 235129273,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1618809912
    },
    {
        "content": "<p>Ok, also das Erfassen einer codierten Diagnose heißt implizit immer \"der Patient hat das <em>jetzt</em>\". Erkrankungen, die in der Vergangenheit liegen werden nicht codiert, da man sie ohnehin nicht abrechnen kann...? Diagnosen aus der Vergangenheit im Sinne einer Anamnese werden demzufolge eher als Freitext erfasst? Hab ich das richtig verstanden?</p>",
        "id": 237371429,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1620151265
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330861\">@Nils Kohl</span>, könnte das auch für die MIOs problematisch sein?</p>",
        "id": 237472940,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1620210829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392581\">@Thomas Zacher</span> betrifft euch das auch?</p>",
        "id": 237492357,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1620220413
    },
    {
        "content": "<p>Es gibt jedenfalls (unabhängig von §301 u.a.) Systeme, die (z.B. anamnestisch) Vorerkrankungen abfragen, ohne nach einem Beginn der Erkrankung zu fragen. Das sind oft erkrankungsspezifische Dokumentationssysteme.</p>\n<p>Manche Mediziner stehen auch auf dem Standpunkt, man kann den Beginn einer Erkrankung nur in den seltenstem Fällen überhaupt wissen, d.h. onsetDate wäre aus dieser Sicht sinnfrei und es würde ein assertedDate benötigt, (das in Condition nicht vorkommt).</p>\n<p>Der Diagnoseleitfaden kennt tatsächlich Feststellungsdatum, Dokumentationsdatum und den klinisch relevanten Zeitraum kennt:<br>\n<a href=\"https://wiki.hl7.de/index.php?title=IG:Diagnoseleitfaden#Feststellungsdatum_der_Diagnose\">https://wiki.hl7.de/index.php?title=IG:Diagnoseleitfaden#Feststellungsdatum_der_Diagnose</a></p>\n<p>Faktisch dürfte in der überwiegenden Zahl der Use Cases das Feststellungsdatum gemeint sein, wenn vom \"Diagnosedatum\" die Rede ist. Genau dafür gibt es in Condition kein Element, aber immerhin eine Core-Extension: <a href=\"http://www.hl7.org/fhir/extension-condition-asserteddate.html\">http://www.hl7.org/fhir/extension-condition-asserteddate.html</a></p>\n<p>Evtl. wäre das Problem also durch Einbinden der Extension (teilweise) zu lösen.<br>\nTrotzdem bleibt ein gewisser Anteil Use Cases, wo einfach dokumentiert wird \"Patient hat Diabetes\".</p>",
        "id": 237499611,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1620223299
    },
    {
        "content": "<p>Beispiel: am 30.07.2020 bildet sich bei Martin Mustermann die erste Tumorzelle eines Colonkarzinoms.<br>\nAm 15.01.2021 bemerkt Martin Mustermann Blut im Stuhl. Als dieses nicht verschwindet, geht er am 30.01.2021 zum Hausarzt, der einen Verdacht auf Darmkrebs hat und den Patienten zur Koloskopie schickt.<br>\nBeim Koloskopietermin am 20.02.2021 wird eine Raumforderung im Colon transversum festgestellt und biopsiert.<br>\nDer Pathologe beurteilt schließlich das Präparat am 25.02.2021 als malignes Adenokarzinom und der Kliniker schließt hieraus am 26.02.2021 eine bösartige Neubildung im Colon transversum.</p>\n<p>Das ergibt:</p>\n<p>Condition 1: C18.9V, onsetDate 30.07.2020 (weiß aber niemand, wird vielleicht sogar als 15.01.2021 dokumentiert), assertedDate 30.01.2021, recordedDate 30.01.2021</p>\n<p>Das Blut im Stuhl wäre erstmal eine Observation, aber man könnte es auch als weitere Condition wahrnehmen (\" in some cases a persistent symptom, e.g. fever, headache may be captured as a condition before a definitive diagnosis can be discerned by a clinician\").</p>\n<p>Condition 2:  C18.4V, ohne onsetDate (der koloskopierende Arzt weiß nicht, wann etwas aufgetreten ist), assertedDate 20.02.2021, recordedDate 20.02.2021</p>\n<p>Condition 3: C18.4 (stationär) bzw. C18.4 G (beim Niedergelassenen oder stationär zur internen Dokumentation), onsetDate leer oder 15.01.2021 oder 2020 als vermuteter Beginn der Erkrankung, assertedDate 25.02.2021, recordedDate 26.02.2021</p>",
        "id": 237502571,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1620224399
    },
    {
        "content": "<p>tl;dr: Condition.onset ist unabhängig von IsiK eh Schmuh?  <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 237508780,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1620226587
    },
    {
        "content": "<p>Zumindest möglicherweise in seiner originalen Bedeutung nicht so verbreitet ;-)</p>",
        "id": 237521562,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1620230737
    }
]