[
    {
        "content": "<p>Hallo,<br>\nin Kürze startet die Abstimmungsphase zu den FHIR Ressourcen des Medikationsplans: <a href=\"https://simplifier.net/medikationsplanplus\" target=\"_blank\" title=\"https://simplifier.net/medikationsplanplus\">https://simplifier.net/medikationsplanplus</a><br>\nIch erwarte, dass es hier im Forum einige Diskussionen diesbezüglich geben wird. Um den Überblick zu bewahren, würde ich darum bitten, bei Fragen und Anmerkungen zu den jeweiligen Ressourcen einen Thread mit dem Titel \"[mpp] &lt;Name des Profils&gt;\" bzw. \"[mpp] &lt;Thema&gt; anzulegen.<br>\nIch hoffe auf rege Beteiligung...</p>",
        "id": 153900805,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502173157
    },
    {
        "content": "<p>Hier nochmal die Ankündigung im Wortlaut:</p>\n<blockquote>\n<p>Abstimmungsankündigung \"Medikationsplan Plus\" vom 5. Juli 2017<br>\nDer Patientenbezogene Medikationsplan (PMP) ist eine umfassende Aufzeichnung der Medikamente des Patienten (Verordnungen, nicht verschreibungspflichtige Medikamente, Kräuterprodukte, Nahrungsergänzungsmittel und andere) für den Patienten. Zur vereinheitlichten elektronischen Wiedergabe derartiger Medikationspläne wurde bereits 2015 ein offizieller CDA-basierter Medikationsplan in ISO/HL7 27932:2009 Fassung vorgelegt und abgestimmt.</p>\n<p>Zwischenzeitlich ist der Medikationsplan auch im so genannten eHealth-Gesetz verankert, wonach ab dem 1. Oktober 2016 für Patienten unter bestimmten Gegebenheiten einen gesetzlichen Anspruch auf einen einheitlich definierten und papiergebundenen Medikationsplan (genannt Bundeseinheitlicher Medikationsplan, §31a SGB V) haben. Ab dem Jahr 2018 soll dieser Medikationsplan auch auf der elektronischen Gesundheitskarte vorliegen und eine Basis für softwaregestützte Prüfungen im Bereich der Arzneimitteltherapiesicherheit (AMTS) bilden. In 2016 wurde die Version 2.3 des Bundeseinheitlichen Medikationsplans herausgegeben, seit dem 30. April 2017 liegt die Fortschreibung in der Version 2.4 vor.</p>\n<p>Für den im Bundeseinheitlichen Medikationsplan verwendeten Barcode wurde das so genannte Ultrakurzformat (UFK) definiert, ein von HL7 FHIR abgeleitetes Format für kapazitätslimitierte Datenträger wie dem Barcode oder auch der Gesundheitskarte. Die Spezifikationen dazu finden sich im Addendum zum Implementierungsleitfaden Patientenbezogener Medikationsplan: Ultrakurzformat für kapazitätslimitierte Datenträger (UKFPMP). Das Format wurde in von der Kassenärztlichen Bundesvereinigung (KBV), dem Deutschen Apothekerverband (DAV) und der Bundesärztekammer (BÄK) herausgegeben und in Zusammenarbeit mit dem Bundesverband der Deutschen Apothekensoftwarehäuser (ADAS e.V.), dem Bundesverband Gesundheits-IT e. V. (bvitg e. V.) und HL7 Deutschland e. V. entwickelt.</p>\n<p>Im Rahmen des EFRE-Förderprojektes Medikationsplan PLUS werden aktuell Entwicklungsmöglichkeiten bezüglich der intersektoralen Nutzbarkeit von semantischen Standards im bundeseinheitlichen Medikationsplan und seinen Fortschreibungen untersucht und umgesetzt.</p>\n<p>Die in Kürze zur Abstimmung stehende Spezifikation \"Medikationsplan PLUS\" beinhaltet im normativen Teil die angepasste Version des Patientenbezogenen Medikationsplans in CDA-Fassung inkl. der funktionalen Beschreibung, die zugehörigen entsprechenden FHIR-Resourcen (STU3) und deren Verbindung zur funktionalen Beschreibung sowie das angepasste Ultrakurzformat für kapazitätslimitierte Datenträger. Konversion-Skript zur Umwandlung der Formate ineinander werden informativ mitgeliefert. Bei der Spezifikation werden die im EFRE-Förderprojekt zum Thema semantischen Standards gewonnen Erkenntnisse berücksichtigt. Sie bieten für die Fortschreibung des Bundeseinheitlichen Medikationsplans nach §31a SGB V sowie den Medikationsplan auf der elektronischen Gesundheitskarte wichtige Vorlagen an.</p>\n<p>In diesem Durchgang des Verfahrens gelangen alle neu erstellten Templates (CDA, UKF), Value Sets und FHIR-Profile zur Abstimmung.</p>\n<p>Wichtige Zeitangaben:</p>\n<p>Ankündigung des Ballots: 5. Juli 2017<br>\nEröffnung des Abstimmungsverfahrens: 6. August 2017<br>\nSchließen des Abstimmungsverfahrens: 25. September 2017<br>\nBesprechung und Auflösung der Kommentare erfolgt auf dem Treffen des Interoperabilitätsforums am 28. und 29. September 2017 in Berlin.<br>\nDas PDF zur Abstimmung mit der gesamten Spezifikation sowie ein Excel-Spreadsheet wird bei Beginn des Abstimmungsverfahren veröffentlicht.</p>\n<p>Eine formlose Email als Anmeldung zum Abstimmungsverfahren an <a href=\"mailto:info@hl7.de\" title=\"mailto:info@hl7.de\">info@hl7.de</a> oder <a href=\"mailto:info@interoperabilitaetsforum.de\" title=\"mailto:info@interoperabilitaetsforum.de\">info@interoperabilitaetsforum.de</a> ist erforderlich. Wir bitten um rege Beteiligung. Für Fragen stehen wir Ihnen gerne zur Verfügung unter <a href=\"mailto:info@hl7.de\" title=\"mailto:info@hl7.de\">info@hl7.de</a> / <a href=\"mailto:info@interoperabilitaetsforum.de\" title=\"mailto:info@interoperabilitaetsforum.de\">info@interoperabilitaetsforum.de</a>.</p>\n</blockquote>",
        "id": 153900806,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502173220
    },
    {
        "content": "<p>An keiner Stelle wird darauf hingewiesen, dass die Kommentierung hier oder in github stattfindet. Verwirrt mich vollständig</p>",
        "id": 153902149,
        "sender_full_name": "Mathias Aschhoff",
        "timestamp": 1502455962
    },
    {
        "content": "<p>Das ist hier ja auch keine Kommentierung, sondern eine Diskussion, aus der vielleicht Kommentare entstehen können.</p>",
        "id": 153902155,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502459019
    },
    {
        "content": "<p>...bzw. die Diskussion der bereits entstandenen Kommentare. Die Reconciliation der eingegangenen Kommentare - FHIR betreffend - müssen vom TC FHIR diskutiert und beschieden werden. GitHub ist unsere Arbeitsplattform für die Nachverfolgung der eingegangenen Kommentare, dieser Chat ist die Arbeitsplattform für die Diskussion der Kommentare. Wenn uns weitere Kommentare (per Excel-Sheet/eMail) erreichen, werden sie ebenfalls in GitHub eingegeben und hier diskutiert.  Wenn wir uns selbst mit Kommentaren bestäuben, geben wir diese direkt in GitHub ein. Der Umweg über Excel macht nur dann Sinn, wenn der Kommentar ein anderes TC betrifft...</p>",
        "id": 153902470,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502779485
    },
    {
        "content": "<p>Der Vollständigkeit halber wäre es wohl sinnvoll, hier auch den Link zum Leitfaden zu posten:<br>\n<a href=\"http://wiki.hl7.de/index.php?title=IG:Patientenbezogener_Medikationsplan_Plus\" target=\"_blank\" title=\"http://wiki.hl7.de/index.php?title=IG:Patientenbezogener_Medikationsplan_Plus\">http://wiki.hl7.de/index.php?title=IG:Patientenbezogener_Medikationsplan_Plus</a></p>",
        "id": 153902482,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502780896
    }
]