[
    {
        "content": "<p>Betreffend der <a href=\"https://simplifier.net/basisprofil-de-r4/gender-amtlich-de\">CodeSystem</a>/<a href=\"https://simplifier.net/basisprofil-de-r4/gender-amtlich-de-vs\">ValueSet</a> URL der Codes für die Geschlechts-<a href=\"https://simplifier.net/basisprofil-de-r4/genderamtlichde\">Extension zur Differenzierung der Geschlechtskennzeichen</a> \"unbestimmt\" und \"divers\" (in FHIR Core zusammengefaltet unter dem Code \"other\") erreichte und folgender Kommentar des BfArm:</p>\n<blockquote>\n<p>\"Der symbolic name ist sehr allgemein gehalten, obwohl das value set nur zwei administrative gender-Varianten umfasst. Unser Vorschlag wäre: „gender-other-amtlich\"\"</p>\n</blockquote>\n<p>Frage: wollen wir diesem Vorschlag folgen und die Canonical URL anpassen (was einem BREAKING CHANGE, also einer nicht-kompatiblen Änderung gegenüber früheren Versionen entspräche) oder wollen wir langfristig mit der Ungenauigkeit in der Bezeichnung  leben?</p>\n<p>Ich möchte das Thema hier schon mal zur Diskussion stellen um über die finale Entscheidung dann im nächsten <a href=\"https://calendar.google.com/event?action=TEMPLATE&amp;tmeid=MmNsdXZmZGFqbGIwOXFvZHVtbGdoM29nazhfMjAyMTA3MjJUMTcwMDAwWiBnZWZ5cmEuZGVfMGEyOWw1N3EzMnJ2M3ZlZjhmdTUzMHRlbThAZw&amp;tmsrc=gefyra.de_0a29l57q32rv3vef8fu530tem8%40group.calendar.google.com&amp;scp=ALL\">TC Meeting am 26.8.</a> abzustimmen.</p>",
        "id": 249562114,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1629102998
    },
    {
        "content": "<p>+1 für Breaking Change</p>",
        "id": 249564107,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1629104619
    },
    {
        "content": "<p>Es ist nicht der erste Kommentar zu diesem Namen, für nicht klingt es so als würde der Name bei einigen Leuten zu Unklarheiten führen.</p>",
        "id": 249564385,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1629104782
    },
    {
        "content": "<p>Dies zu ändern würde von vorneherein besser signalisieren wofür das ValueSet eigentlich verwendet werden soll. Von daher +1 für Breaking Change. Lieber früh anpassen wenn es Verwirrung stiftet.</p>",
        "id": 249686123,
        "sender_full_name": "Yannick Börner",
        "timestamp": 1629184839
    },
    {
        "content": "<p>Wir sollten bedenken, dass es sich bei Canonical URLs lediglich um UniqueIdentifier eines Artefakts handelt, die mit der Spezifikation verknüpft werden können. Es ist m.E. nicht die Aufgabe eines Identifiers, das Artefakt semantisch korrekt und vollständig zu definieren. Sämtliche Erläuterungen, Abgrenzungen,  Hinweise gehören in die <em>Definition</em> des Artefakts, nicht in den Link.<br>\nDass wir statt OIDs mit URLs arbeiten, hat den Vorteil, dass die Links einen besseren (Wieder-)Erkennungswert haben, dieser ist m.E. mit der existierenden URL hinreichend gegeben. </p>\n<p>Wer meint, aus dem Namen einer Canonical auf die Definition eines Artefakts schließen zu können, ohne die tatsächtliche Definition des Artefaktes (die nur einen Klick entfernt ist !!!) berücksichtigen zu müssen, macht ganz grundsätzlich einen Fehler. </p>\n<p>Den Anspruch, dass Canonicals semantisch 100% korrekt sein müssen, würde ich von vorne herein ablehenen. Damit machen wir ein Fass auf, das uns künftig immer wieder in die Situation bringen wird, Canoicals ändern/anpassen zu müssen und die Links zunehmend unhandlich macht.</p>\n<p>...und uns irgendwann den semantik-freien OIDs hinterhertrauern lassen wird.</p>",
        "id": 249689104,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1629187343
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 249693696,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1629191089
    },
    {
        "content": "<p>Mich würde in diesem Zusammenhang interessieren, wer das CodeSystem / ValueSet schon verwendet. Können diese Einrichtungen, Firmen etc. sich einmal (ggf. mit Meinung) melden? (Gerne auch einfach bei dieser Nachricht mit Daumen hoch, wenn ja, und Daumen runter wenn nein). Dann bekommen wir auch einen Eindruck, wie viele von dem Breaking Change betroffen wären.</p>",
        "id": 249703459,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1629198609
    },
    {
        "content": "<p>Die Extension ist in sämtlichen KBV-, MI-I- und Gematik-Spezifikationen verbaut. <span aria-label=\"oh no\" class=\"emoji emoji-1f615\" role=\"img\" title=\"oh no\">:oh_no:</span></p>",
        "id": 250357552,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1629728141
    },
    {
        "content": "<p>Naja, ich finde den langen Kommentar von Simone womöglich nicht besonders zielführend oder gar suggestiv. Selbstverständlich sollen Namen und Bezeichner eine Sache im Kern treffen. Genau dazu sind sie da. Sonst können wir auch gleich <a href=\"http://fhir.de/banane123\">fhir.de/banane123</a> nehmen oder OIDs nutzen. Das wollen wir ja nicht. Dass diese URL nicht unproblematisch ist, zeigen die Rückfragen. Egal wie in diesem Fall abgestimmt wird, ich empfehle eine treffende Wahl von Bezeichnungen anzustreben und es muss natürlich Wege geben, um problematische (oder gar fehlerhafte) Spezifikationen fachgerecht nachzubessern, bei sorgfältiger Abwägung von Kosten und Nutzen.</p>",
        "id": 250367551,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1629732360
    },
    {
        "content": "<p>Ich will nur verhindern, dass wir künftig URLs der Form <a href=\"http://fhir.de/CodeSystem/alle-farbcodes-fuer-EU-bananen-außer-RAL-farben\">http://fhir.de/CodeSystem/alle-farbcodes-fuer-EU-bananen-außer-RAL-farben</a> verwenden müssen, um unseren selbst gestellten semantischen Ansprüchen gerecht zu werden.<br>\nInsbesondere wenn wir über die technischen Mittel verfügen, die Antworten auf alle eventullen Rückfragen hinter genau der selben URL zu verlinken.</p>\n<p>Damit könnten wir die Stabilität der URLs über eine längere Zeit hinweg nicht mehr gewährleisten, weil sich zum Beispiel Nutzungsszenarien ändern und Beschreibungen die vorher noch akkurat waren plötzlich nicht mehr so ganz passen.</p>\n<p>Als Kompromiss für die konkrete Anfrage würde ich folgendes vorschlagen:</p>\n<p>Die Aufgabe eines CodeSystems ist es, einen abgeschlossenen Namensraum zu definieren und da ist das CS gender-amtlich-de unbestritten nicht gut drin, da die Deutschen amtlichen Geschlechtskennzeichen ja noch weitere Codes umfassen. Steng genommen macht es ohnehin keinen Sinn, ein halbes CS zu verfassen, wenn der gesamte Namensraum abschließend definiert ist. \"Wir nehmen nur das was wir brauchen\" fällt ja in den Aufgabenbereich von VS.</p>\n<p>Also wäre mein Vorschlag, den Namen zu belassen und schlicht die fehlenden Codes zu ergänzen.</p>\n<p>Das ValueSet, an das die Extension zur Differenzierung von \"other\" gebunden ist, sollte jedoch weiterhin nur die beiden Codes \"X\" und \"D\" enthalten. Meinetwegen können wir das VS dann auch korrekt in \"other-de-amtlich\" umbenennen. Da die URL des VS nur in der Spezifikation und nicht in der Instanz verwendet wird, stellt dies m.E. keinen Breaking Change dar.</p>",
        "id": 250635927,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1629905337
    },
    {
        "content": "<p>Sehr guter Vorschlag, Simone und alle, bitte so auch dem BfArM mitteilen</p>",
        "id": 250753198,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1629974827
    },
    {
        "content": "<p>Das Thema wurde im gestrigen TC-Meeting besprochen und (einstimmig) beschieden. Das Ergebnis ist <a href=\"https://docs.google.com/document/d/1JublzuRT79WAQnfOA0PWQqPqcnjQcH9a5zgp3_E5dHA/edit#heading=h.j6g0v61s22ci\">hier</a> nachzulesen. Ich werde die Entscheidung der FHIR-Community dem BfArM heute per Mail zur Kenntnis geben.</p>",
        "id": 250896701,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1630051090
    }
]