[
    {
        "content": "<p>Hi,<br>\nfolgende Frage ist sicher nicht FHIR spezifisch, aber es wäre interessant zu wissen, wie so die Best Practice sind.</p>\n<p>Wenn man Codes (z.B. für eine Observation) angibt, schlägt das Code System die Bezeichnung dieses Codes vor. Im Beispiel von LOINC sind das dann englische Bezeichnungen. <br>\nJetzt stellt sich die Frage, ob man immer auch diese englische Bezeichnung des Codes für \"Code/Display\" angeben soll oder ob auch z.B. die deutsche Übersetzung angegeben werden kann. Laut Beschreibung  von \"Code/Display\" sollte der vom Code System vorgeschlagene Anzeigetext übergeben werden.<br>\nZudem gibt es im Codeable Concept auch noch das Attribut \"text\". Rein theoretisch könnte man hier auch die Übersetzung mitgeben.<br>\nOder sind alle verbundenen Systeme / Anwendungen angehalten selbst die Übersetzungen zu den Codes zu pflegen und im \"Code/Display\" steht dann immer die englische Bezeichnung.</p>\n<p>Mich würde interessieren wie andere damit umgehen.</p>",
        "id": 186197678,
        "sender_full_name": "Marco Strauch",
        "timestamp": 1579622927
    },
    {
        "content": "<p>Best Practice wäre:<br>\nDas DIMDI erarbeitet die \"offiziellen\" deutschen Übersetzungen.<br>\nDaraus generieren wir dann ein CodeSystem-Supplement mit den Deutschen DisplayValues für LOINC.<br>\nEin \"schlauer\" Terminologieserver erlaubt es, ValueSets mit unterschiedlichen Sprachen zu expanden und sucht sich die jeweiligen Übersetzungen in den Supplements.<br>\nVoilà: LOINC-ValueSets mit Deutschen Display-Values.<br>\nFolglich können dann auch die Deutschen Displays in den Instanzen verwendet werden und validieren trotzdem.</p>\n<p>Allerdings ist diese Tool-Chain noch etwas lückenhaft <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 186198222,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1579623231
    },
    {
        "content": "<p>Also sollte man zusammengefasst doch eher die englischen Begriffe aktuell verwenden? So wie ich das verstehe, ist das so noch nicht realisiert? Korrekt? Zudem fehlt dann vieleicht auch eine Kennzeichnung in welche Sprache der Text angegeben ist, oder?</p>",
        "id": 186199890,
        "sender_full_name": "Marco Strauch",
        "timestamp": 1579624111
    },
    {
        "content": "<p>Wenn die Codes mit Standard-Validatoren validierbar sein sollen: ja.<br>\nIch würde in der Tat vorschlagen, das text Element für die deutsche Bezeichnung zu verwenden, insbesondere wenn die „offizielle“ Übersetzung des LOINC Codes fehlt.</p>\n<p>In welcher Sprache die Display-Werte (und alle anderen menschenleersten Felder wie strings, markdown, Narrativ usw.) angegeben sind, ergibt sich aus dem Language Element der Instanz.</p>",
        "id": 186270229,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1579686406
    },
    {
        "content": "<p>Anhand des Language Tags sollten Validatoren dann (in Zukunft) auch wissen, in welcher Sprache die Display-Werte validiert werden sollen und dann, sofern die Übersetzungen als CodeSystem supplement bekannt sind, auch Codings mit deutschen Displays validieren können....</p>",
        "id": 186270372,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1579686529
    },
    {
        "content": "<p>Kleine Korrektur: nicht jede Instanz muss zwangsläufig das Language Tag mitführen, es reicht auch, wenn das Profil, gegen das validiert werden soll, die Sprache festlegt. </p>\n<p>Wenn eine Instanz tatsächlich mehrsprachige Display-Werte mitführen soll, dann müsste man mit der translate-Extension arbeiten.</p>",
        "id": 186270662,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1579686753
    },
    {
        "content": "<p>Bislang MUSS als Displaytext die offizielle Bezeichnung übermittelt werden. Das ist faktisch immer Englisch. Damit müssen deutsche Texte als Übersetzung beigefügt werden.</p>\n<p>Wir sollten uns Mal dafür einsetzen, dass ein Affiliate die Sprache definieren kann, die primär geliefert werden soll, wenn vorhanden.</p>\n<p>Bei Loinc gibt es mehrere deutsche Übersetzungen. Hier sollten wir über Dimdi/Bfarm die deutschen Übersetzungen erarbeiten und abstimmen.</p>",
        "id": 186367787,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1579768617
    },
    {
        "content": "<p>...bzw. eine der offiziellen Bezeichnungen, wie <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> schreibt, kann das auch eine deutsche sein. <br>\n\"If the 'display' element is populated, the string used in display SHALL be one of the display strings defined for that code by the code system (code systems may define multiple display strings for a single code).\" <br>\nWas kann ein Affiliate hier zusätzlich definieren?</p>",
        "id": 186394562,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1579790422
    },
    {
        "content": "<p>Ein Supplement CodeSystem mit deutschen concept designations können wir definieren</p>",
        "id": 186395092,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1579790793
    },
    {
        "content": "<p>Mit den Regeln der FHIR Resource CodeSystem ist der Display-Wert durch die ResourceLanguage der CodeSystem Resource festgelegt. <br>\n\"The display is equivalent to a special designation with an implied designation.use of \"primary code\" and a language equal to the Resource Language.\"</p>",
        "id": 186395110,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1579790812
    },
    {
        "content": "<p>nächster Satz: \"The designations can provide additional displays for other language, as well as designations for other purposes. When using concepts, applications use the display and designation unless the language or usage in context provides a reason to use one of the designations.\"</p>",
        "id": 186395593,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1579791095
    },
    {
        "content": "<p>Dann nimmt man original CS + supplement und expanded sich sein ValueSet und gibt beim Expanden: displayLanguage an. Dann wird die VS expansion in der gewünschten Sprache erstellt.</p>",
        "id": 186395766,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1579791185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> ja, das Recht haben wir laut AffiliateAgreement jedenfalls für CodeSystems, die \"HL7 Material\" sind. In anderen Fällen wären ggf. Vereinbarungen erforderlich. Wir beschäftigen uns damit gerade im Zusammenhang mit Patient Summary in EU.</p>",
        "id": 186395789,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1579791202
    },
    {
        "content": "<p>Ist ja prinzipiell ok, nur dann sollte man dafür sorgen, dass alle Direktiven zueinander konsistent sind.<br>\nMWn. gibt es für Codesysteme nur eine primary Designation, und die muss dann genommen werden. Wenn das in ein Expansion Set expandiert wird, OK. In die Daten müssen dann trotzdem die primary Designation eingetragen werden.</p>",
        "id": 186435899,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1579813835
    },
    {
        "content": "<p>SELECT designation.value FROM designation WHERE designation.use=\"primary designation\" AND designation.language=\"DE-de\"</p>",
        "id": 186437164,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1579814577
    },
    {
        "content": "<p>Hallo liebe Community,</p>\n<p>ich arbeite momentan an einem Questionnaire (+ QuestionnaireResponse), wobei sich die Antwortoptionen einiger Items durch LOINC Answer Lists und die jeweiligen Codes als ValueSet abbilden ließen (Quesionnaire.item.answerValueSet). Zu diesen Codes existieren allerdings nur die englischen Bezeichnungen.</p>\n<p>Es wäre aber schön, wenn zu den betreffenden LOINC Codes ebenso die deutsche Übersetzung der Bezeichnungen angeboten würden. Dazu habe ich bereits ein CodeSystem Supplement mit den ensprechenden Übersetzungen erstellt (noch nicht ganz final). Das CodeSystem Supplement und die entsprechenden Quellen der Übersetzungen sind in einem Github-Repository bzw. dessen Wiki unter <a href=\"https://github.com/helict/fhir-valuesets-loinc-de\">https://github.com/helict/fhir-valuesets-loinc-de</a> (und noch nicht in Simplifier, da Arbeitsstand) zu finden.</p>\n<p>Meine Fragen:</p>\n<ol>\n<li>\n<p>Bei wem genau reiche ich (Vorschläge für) Übersetzungen ein? (DIMDI/BfArM, Deutsche LOINC User Group, HL7 Deutschland, LOINC International / Regenstrief)</p>\n</li>\n<li>\n<p>Welche Anforderungen müssen die einzureichende Übersetzungen erfüllen? (sonst könnte ja jede/r beliebige Übersetzungen in einem beliebigen Format einreichen)</p>\n</li>\n<li>\n<p>Wie wird mit der Urheberschaft von einzureichenden Übersetzungen umgegangen? (die Übersetzungen entstammen teilweise einer anderen Quelle, nicht von mir persönlich)</p>\n</li>\n</ol>\n<p>Danke im Voraus für die Hilfe!</p>",
        "id": 214715360,
        "sender_full_name": "Marcel Susky",
        "timestamp": 1603812242
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194953\">@Heike Dewenter</span> <span class=\"user-mention\" data-user-id=\"247046\">@Christine Haas</span> <span class=\"user-mention\" data-user-id=\"212996\">@Elisabeth Pantazoglou</span></p>",
        "id": 214715615,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1603812360
    },
    {
        "content": "<p>Ad 3: Im Allgemeinen tritt man die Urheberschaft mit einer Einreichung ab. Deshalb sollte sichergestellt sein, dass es später hier keinen Ärger gibt.</p>",
        "id": 214728673,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1603817354
    },
    {
        "content": "<p>Danke für die Kontakte <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>. Wenn ich hier von den genannten Kontakten keine zeitnahe Rückmeldung erhalte, mit welchem Kontakt sollte ich mich zuerst via Mail/Telefon in Verbindung setzen?</p>\n<p>Danke auch für den Hinweis <span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span>. Die Urheber*innen werde ich vorher selbstverständlich kontaktieren. Momentan entstammen die Übersetzungen aus wissenschaftlichen Publikationen, die sich bspw. mit der Reliabilität/Validität der Übersetzung vom Englischen ins Deutsche befassen.</p>",
        "id": 214832017,
        "sender_full_name": "Marcel Susky",
        "timestamp": 1603890021
    },
    {
        "content": "<p>Ich hab deine Kontaktdaten ans DIMDI weitergegeben. Fr. Haas wird sich bei dir melden.</p>",
        "id": 216221887,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605019751
    },
    {
        "content": "<p>Sorry für die hohe Latenz, ich lagge momentan etwas, was die Nachverfolgung diverser Kommunikationskanäle angeht... <span aria-label=\"sleeping\" class=\"emoji emoji-1f634\" role=\"img\" title=\"sleeping\">:sleeping:</span></p>",
        "id": 216222107,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605019840
    },
    {
        "content": "<p>Super, danke dir. Und kein Problem wegen der spaeten Antwort. Die Mailadresse von Fr. Haas ist leider nicht mehr aktuell und eine aktuellere habe ich nicht finden koennen. Die Mailadresse der LOINC User Group Deutschland geht auch nicht mehr. Letztlich habe ich noch das Kontaktformular der BfArM bemueht bzgl. Klassifikationsthemen. Bisher aber COVID-bedingt auch noch keine Antwort erhalten.</p>\n<p>Bei einigen Projekten, in die ich nur am Rande involviert bin, werden wieder die gleichen Fragen zur Uebersetzung und dem Mehrwert der Kodierung von Questionnaire Items und AnswerOptions aufkommen. Die Tendenz ist dann oft dahingehend, dass die Kodierung z.B. mittels LOINC-Kodes infrage gestellt wird, da kein offensichtlicher/unmittelbarer Mehrwert entsteht, sondern eher Doppelarbeit (Kodes suchen und Uebersetzungen erstellen). Und so wird oder werden zukuenftig u.U. immer wieder die gleichen Aufwaende und Arbeiten durch unterschiedliche Akteure/Anwender betrieben, was jedoch als Argument fuer den Mehraufwand nur bedingt Gewicht findet.</p>",
        "id": 216251201,
        "sender_full_name": "Marcel Susky",
        "timestamp": 1605032112
    }
]