[
    {
        "content": "<p>Hallo, gibt es irgendwo ein frei verfügbares Mapping für die Übersetzungen der Felder der FHIR Profile ins Deutsche ? Ich meine damit nicht Übersetzungen von ValueSets sondern der Fields der Profile selbst, z.B. dass \"Patient.birthDate\" \"Geburtsdatum\" bedeutet. Mit welchem Werkzeug aus dem FHIR-Kosmos wird solch ein Mapping definiert ?</p>",
        "id": 174873602,
        "sender_full_name": "Georg Fette",
        "timestamp": 1567597915
    },
    {
        "content": "<p>Im Bereich \"Zulassung von Arzneimitteln\" arbeitet ein Team bei ISO/TC 215 WG6 daran: <br>\n<a href=\"https://www.iso.org/standard/77744.html\" target=\"_blank\" title=\"https://www.iso.org/standard/77744.html\">https://www.iso.org/standard/77744.html</a></p>\n<p>Dabei sicher auch etliches wiederverwendbare für andere Bereiche.</p>",
        "id": 175011002,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1567714744
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span> ,<br>\nich glaube nicht, dass es \"offizielle\" Übersetzungen der Feldnamen geben wird, da die Labels, die ich dem Anwender anzeigen möchte stark abhängig von System, UseCase und Publikum sind. Für einen Patienten würde man vermutlich eine andere Darstellung wählen, als für einen Arzt. Für einen Laborbefund hätten die Felder einer Observation vielleicht andere Bezeichnungen als für eine textuelle Sozialanamnese.<br>\nNichts desto trotz wäre es sinnvoll, die UseCase/System-spezifischen Bezeichnungen in den Profilen zu hinterlegen und damit austauschbar und wiederverwendbar zu machen.<br>\nSpontan würde mir dazu als Option mapping, alias oder die <a href=\"http://hl7.org/fhir/extension-translation.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-translation.html\">translation-Extension</a> einfallen.<br>\nDie Translation-Extension wäre sicher die richtige Wahl, wenn man mehrsprachige Übersetzungen im Profil mitführen möchte, Mapping wäre eher geeignet, um die Namen der FHIR-Elemente auf system-interne Bezeichnungen zu mappen. </p>\n<p>Ich bin mir ehrlich gesagt selbst nicht sicher, ob Mapping dafür gedacht ist, und würde daher mal die int. Community konsultieren...</p>",
        "id": 175070917,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567780798
    },
    {
        "content": "<p>Man könnte diesen usecase ganz gut mittels FHIR SDC Questionnaires abdecken, innerhalb des Questionnaires definieren welche Frage/label angezeigt wird, und dann zurück mappen auf die Profile mittels $extract</p>",
        "id": 175071169,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1567780982
    },
    {
        "content": "<p>Ich komme gerade nicht dahinter, ob urn:ietf:bcp:13, das an ElementDefinition.mapping.language gebunden ist, auch Codes für Sprachen (wie de-DE) usw. enthält...</p>",
        "id": 175072099,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567781573
    },
    {
        "content": "<p>das sind doch mime types? oder?</p>",
        "id": 175072330,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1567781740
    },
    {
        "content": "<p>Keine Ahnung, was da alles drin ist...</p>",
        "id": 175072452,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567781819
    },
    {
        "content": "<p>Was ist denn das Ziel der Übersetzung der Feld<em>namen</em>?<br>\nIn der Serialisierung müssen es ja ohnehin die Original-Elementnamen sein.</p>\n<p>Das Thema hatten wir schon mal bei der Übersetzung der Ressourcennamen  auf dem Interopforum diskutiert und waren damals zu dem Schluss gekommen, dass wenn, dann eher Beschreibungen übesetzt werden sollten.</p>\n<p>Oder verstehe ich hier was falsch?</p>",
        "id": 175072731,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567781984
    },
    {
        "content": "<p>es geht um Anzeigenamen denke ich, darum der SDC Ansatz</p>",
        "id": 175072929,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1567782099
    },
    {
        "content": "<p>In dem Fall macht der SDC-Ansatz tatsächlich Sinn.</p>\n<p>Ansonsten wäre das für mich einfach ein CodeSystem mit allen Elementnamen (full path) nebst einer Designation \"deutsch\"</p>",
        "id": 175073158,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567782241
    },
    {
        "content": "<p>Ich versuche openEHR Archetypes 1zu1 in StructureDefinitions zu transformieren. Archetypes sind ziemlich spezifisch und nicht so vielfältig verwendbar sind wie die offizielle FHIR Profile, daher ist deren Einsatzgebiet und damit auch deren Übersetzungen nicht so vielfältig. In den Archetypes stehen die Übersetzungen mit drin und ich suche irgendeinen Container auf der FHIR-Seite in die ich diese Übersetzungsinformationen der verschiedenen Felder reingiessen kann, damit sie nicht verloren gehen bei der Transformation.<br>\nDie Idee mit dem CodeSystem scheint mir am praktischsten. Mit Translation-Extensions müsste man ja jedes einzelne Feld eines Profils extenden, oder ?</p>",
        "id": 175085084,
        "sender_full_name": "Georg Fette",
        "timestamp": 1567790720
    },
    {
        "content": "<p>Ja, jeweils die Element.names. Allerdings fände ich Element.mapping gegenüber eines CodeSystems in so fern praktischer, dass man damit die Übersetzungen immer direkt an den Elementen findet.<br>\nDeutsche Bezeichnungen direkt im Profil zu haben könnte auch bei der Generierung von Narratives hilfreich sein...</p>",
        "id": 175085663,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567791161
    },
    {
        "content": "<p>Im europäischen eHDSI project haben wir solch ein valueset zum Zweck der Generierung mehrsprachiger HTML renderings: <br>\n<a href=\"https://art-decor.ehdsi.eu/art-decor/decor-valuesets--epsos-?id=1.3.6.1.4.1.12559.11.10.1.3.1.42.46&amp;effectiveDate=2017-11-07T14:06:21&amp;language=en-US\" target=\"_blank\" title=\"https://art-decor.ehdsi.eu/art-decor/decor-valuesets--epsos-?id=1.3.6.1.4.1.12559.11.10.1.3.1.42.46&amp;effectiveDate=2017-11-07T14:06:21&amp;language=en-US\">https://art-decor.ehdsi.eu/art-decor/decor-valuesets--epsos-?id=1.3.6.1.4.1.12559.11.10.1.3.1.42.46&amp;effectiveDate=2017-11-07T14:06:21&amp;language=en-US</a></p>\n<p>Das ist in alle Sprachen der Projektteilnehmer übersetzt.</p>",
        "id": 175086192,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1567791558
    },
    {
        "content": "<p>Allerdings kann man sowas, wie Label „Mobilnummer“ an Patient.telecom.where(system=‚phone‘ &amp; use=‚mobile‘) nur mit SDC wuppen! <br>\n... und es gibt sicherlich viele Stellen, an denen das Sinn macht!</p>",
        "id": 175087209,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567792241
    },
    {
        "content": "<p>Allerdings kann man sowas, wie Label „Mobilnummer“ an Patient.telecom.where(system=‚phone‘ &amp; use=‚mobile‘) nur mit SDC wuppen! <br>\n... und es gibt sicherlich viele Stellen, an denen das Sinn macht!</p>",
        "id": 175088237,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567792892
    },
    {
        "content": "<p>So eine Mapping-Tabelle, die FhirPath-Expressions mit Labels assoziiert, könnte, wenn man‘s richtig macht, super nützlich sein. Damit könnte man algorithmisch sowohl die SDC Questionnaires für die Datenerfassung erzeugen, als auch ein Narrative-Template. (Ganz unabhängig von der Übersetzung in andere Sprachen) Ich bin mir bloß nicht sicher, ob CodeSystem da die richtige Wahl ist...</p>",
        "id": 175093544,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567796302
    },
    {
        "content": "<p>Ich würde das gerne mal in der int. Community diskutieren...</p>",
        "id": 175093663,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567796390
    },
    {
        "content": "<p>Frag vielleicht erstmal <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> , der hat sich dazu auch schon Gedanken gemacht.</p>",
        "id": 175099828,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1567800996
    },
    {
        "content": "<p>Verstehe ich es richtig, dass es eigentlich um die deutschen Übersetzungen der gemappten Archetype.Felder geht?<br>\nWäre das nicht etwas für z.B. element.label?</p>",
        "id": 175101279,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567802130
    },
    {
        "content": "<p>Also natürlich, wenn man aus den Archetypen sinnvolle Profile generieren will, wo dann label und ggf. auch mapping (als Verweis auf die technische Feldbezeichnung im Archetyp) gesetzt sind</p>",
        "id": 175101571,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567802315
    },
    {
        "content": "<p>Diesbezüglicher Stream im internationalen Forum: <a href=\"#narrow/stream/179177-conformance/topic/Associating.20FHIRPath.20Expressions.20with.20Display.20labels\" title=\"#narrow/stream/179177-conformance/topic/Associating.20FHIRPath.20Expressions.20with.20Display.20labels\">https://chat.fhir.org/#narrow/stream/179177-conformance/topic/Associating.20FHIRPath.20Expressions.20with.20Display.20labels</a><br>\nTenor: Entweder Questionnaire (wenn die Daten bei der Repräsentation vorher konvertiert/aggregiert/maskiert werden müssten oder die translate-Extension für die 1:1 Übersetzung der Element-Namen.</p>",
        "id": 175241242,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1568035911
    },
    {
        "content": "<p>^ diesbezüglich: ich bin mit den Mods in Kontakt, um das abzustellen....</p>\n<p>(edit) ein Autoresponder hat das Forum mit inzwischen gelöschten Abwesenheitsnotizen eines Users besprenkelt.</p>",
        "id": 175312679,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1568100169
    }
]