[
    {
        "content": "<p>Ich wurde gerade gefragt, wie ein:e Angestellte:r abgebildet wird. Ich habe vorgeschlagen, einen normalen Practitioner mittels PractitionerRole mit einer Organization zu verbinden und (a) davon auszugehen, dass, sollte keine PractitionerRole existieren, die jemand als Inhaber, Vorstandsmitglied identifiziert, davon auszugehen, dass der Practitioner ein:e Angestellte:r ist, oder b) explizit den Code \"Angestellte:r\" in PractitionerRole.code einzufügen.</p>\n<p>Gibt es aus der Community dazu Erfahrungen oder Meinungen?</p>",
        "id": 255563693,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1633004742
    },
    {
        "content": "<p>In welchem Kontext wird ein Angestellter benötigt? <br>\nIn einer PractitionerRole sind ja gerade nur Practitioner (Leistungserbringer) oder Institutionen in Relation zueinander zu setzen. Es gilt der medizinische Kontext. In welchem medizinischen Kontext würde der Angestellt benötigt werden?</p>",
        "id": 255564792,
        "sender_full_name": "Peter Osburg",
        "timestamp": 1633005166
    },
    {
        "content": "<p>Dazu kann ich gerade wenig sagen, da ich den Kontext nicht genau kenne. Ich hatte auf jeden Fall angeregt, dass die Fragesteller sich hier im Forum melden.</p>",
        "id": 255589334,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1633014086
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"447358\">@Peter Osburg</span> Die Beschränkung auf bestimmte Leistungserbringer würde ich nicht so eng sehen. Im (example) valueSet sind ja sehr vielfältige Konzepte vorhanden <a href=\"https://www.hl7.org/fhir/valueset-practitioner-role.html\">https://www.hl7.org/fhir/valueset-practitioner-role.html</a>  - Translator, Hospital Manager, Medical record administrator... Recht hast Du allerdings mit dem \"medizinischen Kontext\", in den ein so generisches Konzept wie \"Angestellter\" nicht reinpasst. </p>\n<p>Ein IG für Occupational Data for Health verwendet dafür eine Observation: <a href=\"http://hl7.org/fhir/us/odh/StructureDefinition-odh-EmploymentStatus.html\">http://hl7.org/fhir/us/odh/StructureDefinition-odh-EmploymentStatus.html</a></p>\n<p>In einigen spezifischen Fällen (Audit, Consent, Provenance etc.) wird auf <a href=\"https://www.hl7.org/fhir/valueset-participation-role-type.html\">https://www.hl7.org/fhir/valueset-participation-role-type.html</a> verwiesen.</p>",
        "id": 256245330,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1633440643
    }
]