[
    {
        "content": "<p>Folgende Idee: Wäre es sinnvoll, zum Zwecke der Nachvollziehbarkeit den original-VSDM-Datensatz als Attachment an der Coverage mitzuführen?<br>\nDas wäre ggf. nützlich um auf die Originaldaten zugreifen zu können, wenn z.B. eingelesene Patientendaten manuell geändert werden (aktuellere Adresse...)<br>\nAußerdem würde es empfangenden Systemen ggf. das Zurückmappen auf VSDM ersparen.<br>\nMeinung?</p>",
        "id": 153918825,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1510309238
    },
    {
        "content": "<p>Der Zugriff auf die Originaldaten ist ein wichtiger Aspekt. Ein KBV zertifiziertes System muss die  Patientendate der Karte getrennt speichern. Bei manchen Formularen sind sogar die Daten der Karte denen im Patientenverwaltungssystem vorzuziehen, auch wenn letztere die aktuelleren sind. Dazu dann aber die schöne FHIR-Welt verlassen und auf das VSDM-XML zugreifen - da blutet einem das Herz...</p>",
        "id": 153918857,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1510324842
    },
    {
        "content": "<p>Wir würden es ja in einer Binary-Resource verstecken, dann sieht's von außen fast wie FHIR aus  :)</p>",
        "id": 153918858,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1510324932
    },
    {
        "content": "<p>Verstecken ist gut :-)<br>\nPrinzipiell könnte der Verweis auf</p>\n<p>subscriber     Σ   0..1    Reference(Patient | RelatedPerson)  Subscriber to the policy</p>\n<p>Im Falle des Verweises auf die Originaldaten eine \"RelatedPerson\" sein (Relationship: ONESELF). Dann hätte man alle Daten in strukturierter Form. <br>\nDie Original-VSDM Datensätze hätten sich auch ihren Reiz. Aber man würde dann 3 Anhänge benötigen. Oder würdest Du die zu einem zusammfassen?</p>",
        "id": 153918862,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1510327039
    },
    {
        "content": "<p>sind die nicht sowieso zu einem Paket gezippt auf der Karte? Würde ich dann genau so dranhängen...</p>",
        "id": 153918863,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1510327256
    },
    {
        "content": "<p>Auf der Karte sind es auch 3 Dateien</p>",
        "id": 153918864,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1510327312
    },
    {
        "content": "<p>Hm... dann bin ich da ziemlich emotionslos. Wenn man im UseCase immer entweder alle oder keinen der Datensätze benötigt, dann würde ich alles zusammenzippen und Anhängen.<br>\nWenn ein selektiver Zugriff auf einzelne der Dateien benötigt wird, dann müssten wir sie auch einzeln anhängen...</p>",
        "id": 153918866,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1510327510
    },
    {
        "content": "<p>In welchem UseCase würde man das benötigen? Könnte die Welt irgendwann so aussehen, dass ein FHIR-Server im Mittelpunkt eines KIS oder einer Praxis-EDV steht? Und es letztlich APPs gebe, die aus diesen Daten die Abrechnung für einen bestimmten Zweck durchführen?</p>",
        "id": 153918879,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1510330333
    },
    {
        "content": "<p>Generell fände ich 3 Dateien besser, da dann von aussen klar ist, was drin ist. Sonst habe ich eine gezippte Datei, die überall anders aussehen könnte.</p>",
        "id": 153918880,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1510330399
    },
    {
        "content": "<p>Vorschlag: Ich reiche einen Change Request ein, um der Coverage-Resource ein element attachment(Attachment) 0..* hinzuzufügen. Das sollte bis R4 klappen, dann haben wir das bis nächstes Jahr.<br>\nInzwischen diskutieren wir hier die Constraints für den Datentyp Attachment: <a href=\"http://build.fhir.org/datatypes.html#attachment\" target=\"_blank\" title=\"http://build.fhir.org/datatypes.html#attachment\">http://build.fhir.org/datatypes.html#attachment</a><br>\nFalls jemand einen UseCase hat, der das Element benötigt und nicht auf  R4 warten kann, dann lösen wir das über eine temporäre Extension.</p>",
        "id": 153919022,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1510398916
    }
]