[
    {
        "content": "<p>Hallo zusammen. <br>\nim internationen #implementers-Stream wird gerade imTopic \"medication manufacturer\" darüber diskutiert, welche Organisation bei einem Medikament angegeben werden soll: Der manufacturer, der sponsor, der registrant, der labeler, der marketing authorization holder, und was es da sonst noch alles gibt.<br>\nDa ich mich in dem Bereich Medikamente bei uns nicht so auskenne, wollte ich in die Runde fragen, ob jemand, der in Medikamentenbeschreibungen etwas firmer ist, bei der Diskussion die deutschen Anforderungen äußern kann? Ansonsten kann es sein, dass wir hinterher unsere Bedarfe nur noch per extensions abbilden können.<br>\nHerzliche Grüße und vielen Dank</p>",
        "id": 208526310,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1598857985
    },
    {
        "content": "<p>IDMP and the EMA will probably be leading in this, and given that Rik Smithies is taking part in the conversation, I'm fairly sure the outcome with fit at least with the EMA requirements. One would hope the German requirements when it comes to this aren't too different from the EMA.. (but one never knows)</p>",
        "id": 208526889,
        "sender_full_name": "René Spronk",
        "timestamp": 1598858520
    },
    {
        "content": "<p>Thanks for the insight. <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span> <br>\nI don't know about our requirements, that's why I'm asking people to join and contribute to the discussion <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 208527081,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1598858650
    },
    {
        "content": "<p>Zumindest beim Verordnen müsste das eigentlich der \"Anbieter\" der das bei der IFA GmbH angemeldet hat sein. Bei Reimporten ist das dann nicht der Hersteller sondern der Reimporteur. Die IFA GmbH hat da auch Richtlinien dazu, die Beschreibt was sich dahinter versteckt: <a href=\"http://www.ifaffm.de/mandanten/1/documents/02_ifa_anbieter/richtlinien/IFA-Richtlinien_Datenmeldung.pdf\">http://www.ifaffm.de/mandanten/1/documents/02_ifa_anbieter/richtlinien/IFA-Richtlinien_Datenmeldung.pdf</a></p>",
        "id": 209303759,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1599490312
    }
]