[
    {
        "content": "<p>Hallo,<br>\nich entwickle aktuell in der Version 3.0.1 basierend auf den HL7-Profilen und den deutschen Basisprofilen. Ich habe gesehen, dass die HL7-Profile in der Version 3.0.2 verfügbar sind. Gibt es auch eine Version 3.0.2 bei den deutschen Basisprofilen? Falls nicht, wäre es ratsam die HL7-Profile in Version 3.0.2 und die deutschen Basisprofile in Version 3.0.1 parallel zu verwenden? Vielen Dank für ihre Unterstützung.</p>",
        "id": 182329124,
        "sender_full_name": "Katarina",
        "timestamp": 1575280055
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"221154\">@Katarina</span>, 3.0.2 ist erst ein paar Wochen alt, einige Tools (Forge, Simplifier) müssen noch auf diese Version geupdatet werden. Dies kann jedoch noch einige Zeit dauern (möglicherweise erst Anfang 2020). Wenn man auf diese Tools angewiesen ist, dann wäre mein Ratschlag noch ein wenig abzuwarten. Sobald Forge mit 3.0.2 verfügbar bist werden die Deutschen Basisprofile in dieser Version veröffentlicht.</p>",
        "id": 182331141,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1575281643
    },
    {
        "content": "<p>Generell sollte man jedoch keinen Unterschied merken, da es sich hier nur um minimale Technical Corrections handelt.</p>",
        "id": 182331173,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1575281686
    },
    {
        "content": "<p>Vielen Dank <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> Können Sie mir auch sagen, wann mit dem Release der Deutschen Basisprofile in R4 zu rechnen ist?</p>",
        "id": 182340667,
        "sender_full_name": "Katarina",
        "timestamp": 1575290475
    },
    {
        "content": "<p>An den deutschen Basisprofilen in R4 wird fleißig gearbeitet. Der aktuelle Arbeitsstand kann unter <a href=\"https://simplifier.net/Basisprofil-DE-R4\" target=\"_blank\" title=\"https://simplifier.net/Basisprofil-DE-R4\">https://simplifier.net/Basisprofil-DE-R4</a> eingesehen werden.</p>",
        "id": 182340781,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1575290558
    },
    {
        "content": "<p>Viele Hände, schnelles Ende :)</p>",
        "id": 182342623,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1575292011
    }
]