[
    {
        "content": "<p>Hallo zusammen,<br>\nich stehe aktuell vor der Fragestellung Behandlungsarten über FHIR Ressourcen abzubilden. Bisher finde ich weder in der ADT Domäne (Base)  noch im Abrechnungskontext (Financial) passende Attribute in irgendwelchen Ressourcen.<br>\nKönnte mir jemand ein Schups in die richtige Richtung geben?<br>\nAls Behandlungsarten bilden wir bspw. \"Einbettzimmer mit Chefarztbehandlung\" oder \"Mehrbettzimmer mit Chefarztbehandlung\" oder ähnliches ab.</p>\n<p>Danke&amp;Gruß,<br>\nHeiko</p>\n<p>PS: falls dieses Thema bereits irgendwo besprochen wurde und ich es nur nicht gefunden habe, auch gerne einfachen Verweis auf das topic!</p>",
        "id": 245826259,
        "sender_full_name": "Heiko Heckmann",
        "timestamp": 1626183809
    },
    {
        "content": "<p>Hallo,<br>\nwir haben die Abrechnungsarten mal als CodeSystem zusammengefasst: <a href=\"https://simplifier.net/basisprofil-de-r4/aufnahmeart-duplicate-5\">https://simplifier.net/basisprofil-de-r4/aufnahmeart-duplicate-5</a><br>\nAber ich denke, das ist nicht die Antwort auf die Frage.</p>\n<p>Die beschriebene Behandlungsart haben wir m.W. noch nicht diskutiert. Es klingt nach einer Extension auf Encounter oder Account. Die Frage ist  jedoch, ob sich das Standardisieren lässt, oder ob da jede Einrichtung ihre eigenen Behandlungsarten definiert...?</p>",
        "id": 245864769,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1626199801
    },
    {
        "content": "<p>Wobei... bie genaurem Hinsehen gibt es unter den Abrechnungsarten auch Codes für diverse Wahlleistungen.<br>\nDas CodeSystem ist dazu gedacht, an Account.type gebunden zu werden, um dort - wie der Name schon sagt - die Art fer Abrechnung anzuzeigen.<br>\nAllerdings haben wir noch kein Profil für Account erstellt und daher zunächst nur die Terminologie in die Basisprofile aufgenommen.</p>",
        "id": 245868681,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1626201603
    },
    {
        "content": "<p>Hallo,<br>\nDanke für die zeitnahe Antwort! <br>\nDie Frage ist, ob es im Financial -alleine- richtig angesiedelt ist. Es stellt zwar ein abrechnungsrelevantes Thema dar, wirkt sich aber eigentlich mehr auf administrative Prozesse aus (Bettenplanung, wenn es ein Einbettzimmer ist / Ressourcenplanung, wenn es ein Chefarzt ist / ...).<br>\nEs wird am Ende nur die tatsächlich erbrachte Leistung abgerechnet! Nur weil jemand Anspruch auf ein Einbettzimmer hat, bedeutet es nicht, dass die Behandlung tatsächlich in einem solchen stattfinden konnte.</p>\n<p>Deswegen die Frage, ob es nicht trotzdem sinnvoll ist im Encounter mit aufzunehmen? Eventuell sogar als Teil des ValueSets für Encounter.type?</p>",
        "id": 245931810,
        "sender_full_name": "Heiko Heckmann",
        "timestamp": 1626250866
    },
    {
        "content": "<p>Ginge das nicht in Richtung Encounter.hospitalization? Generell würde ich Wahlleistungen dort abbilden, wobei noch kein passendes Element existiert.</p>",
        "id": 245997218,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1626285870
    },
    {
        "content": "<p>Ja, im weitesten Sinne sowas wie Encounter.hospitalisation.specialCourtesy oder eine Extension an hospitalization. Allerdings würde ich dort dann nur Codes für spezielle Wahlleistungen (WLU, WLA) verwenden wollen, nicht die gesamte Liste der Abrechnungsarten.<br>\nDie Wahlleistung IGEL würde hier auch nicht reinpassen, da ambulant. War aber auch nicht die Frage ;-)</p>",
        "id": 246058316,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1626332500
    },
    {
        "content": "<p>Wenn ich hier ein paar nach oben gerichtete Daumen sähe, wäre ich einer Wahlleistungs-Extension mit extensible Binding auf VS (WLA,WLU) in den Deutschen Basisprofilen gegenüber nicht abgeneigt. Diesen UseCase sehen wir sicherlich öfter...<br>\n<span class=\"user-mention\" data-user-id=\"191964\">@Bettina Lieske</span> ...?</p>",
        "id": 246058419,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1626332610
    }
]