[
    {
        "content": "<p>Ich schaue mir gerade die KBV Patientkurzübersicht (PKÜ) MIO an, das ja gerade kommentiert wird.  Mir ist die Beziehung zu den IPS IG aber noch nicht ganz klar.  Einerseits werden <a href=\"https://simplifier.net/PKU/~introduction\">in der PKÜ-Introduktion auf Simplifier</a> die International Patient Summary -Standards mehrmals erwähnt, z.B.:</p>\n<blockquote>\n<p>Die Definition des MIOs PKÜ erfolgt auf Basis der DIN EN 17269 und verfolgt analog zur Intention der CEN EN 17269 als Anwendungsszenarien sowohl die ungeplante als auch geplante medizinische Versorgung einer Person, die der behandelnden Person unbekannt ist.</p>\n</blockquote>\n<p>Anderseits scheint die PKÜ einen ganz anderen Profilierungsansatz als der IPS FHIR IG zu nehmen, da die Profile - zumindest in einigen Fällen - ziemlich \"eng\" sind, mit vielen Elementen ganz wegprofiliert usw. , s. z.B. der <a href=\"https://simplifier.net/pku/kbvprmiopsobservationbodyheight\">Profil für Body Height</a>.</p>\n<p>Ich sehe, dass der  Notfalldatensatz (NFD) auch ein wichtiger Input war, aber mir ist nicht klar,  wie zwischen IPS und NFD vermittelt wurde, szs.. Insbesondere frage ich mich, ob ein direkter mapping zwischen PKÜ und IPS möglich sein sollte (z.B. in dem jede valide PKÜ-Bundle automatisch eine valide IPS-Bundle ist)? Oder sind die Beziehung eher auf einen höhere, thematische Ebene?  Vielleicht gibt es ja dazu Beschreibung, die ich noch nicht gefunden habe...?</p>",
        "id": 251220565,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1630325810
    },
    {
        "content": "<p>Ich habe mir das noch nicht näher angesehen, aber nachdem was auf dem Stakeholdermeeting vorgestellt wurde, ist es eine Schwesterspezifikation, die Ideen von IPS aufgegriffen hat. Damit ist sie a priori inkompatibel.</p>",
        "id": 251676712,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1630568012
    },
    {
        "content": "<p>Für alle Interessierten veranstaltet die mio42 am 8. September von 15-18h Uhr eine Web-Session zum neuen MIO PKA, u.a. um Fragen zu klären. Dort wird eingangs auch kurz die PKA zur PKÜ abgegrenzt. Infos und Zoom-Link unter <a href=\"https://mio.kbv.de/display/PKA\">https://mio.kbv.de/display/PKA</a></p>",
        "id": 252186614,
        "sender_full_name": "Samer Schaat (mio42)",
        "timestamp": 1630939956
    },
    {
        "content": "<p>Danke für den Input! - ich werde am 8. auch dabei sein.</p>",
        "id": 252252373,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1630991393
    }
]