[
    {
        "content": "<p>Hallo zusammen,<br>\nZwei Anliegen meinerseits: </p>\n<p>1) Der HL7 DE FHIR Server sagt in seinem CapabilityStatement (löblicherweise), dass er $document unterstützt. Jedoch zeigt die URL der OperationDefinition zu \"OperationDefinition/Composition-i-document\" anstelle von \"<a href=\"http://hl7.org/fhir/OperationDefinition/Composition-document\" target=\"_blank\" title=\"http://hl7.org/fhir/OperationDefinition/Composition-document\">http://hl7.org/fhir/OperationDefinition/Composition-document</a>\". Nur ein kleiner Hinweis ;)</p>\n<p>2) Da nun Support für $document vorhanden ist, könnte man auch dementsprechend CapabilityStatement.document setzten. Hier stellt sich mir nur die Frage, ob wir einen Change Request einbringen wollen um CapabilityStatement.document.profile von 1..1 auf 1..* setzen zu lassen? Mir scheint es jedenfalls nur bedingt sinnvoll, dass eine Instanz stets nur ein Dokument-Typ erstellen darf, also z.B. nur den Medikationsplan-Plus. Oder lese ich hier die Spec falsch?</p>",
        "id": 155368844,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1547758947
    },
    {
        "content": "<p>CS.document ist ja bereits 0..*<br>\nUnd da darunter auch .mode und .documentation liegen, die tendenziell spezifisch für das document-Profil sind, macht es IMHO Sinn, wie es ist.</p>",
        "id": 155369537,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1547759477
    },
    {
        "content": "<p>Kurz: Einfach für jedes document-Profil ein eigenes document-Element ins CapStmt</p>",
        "id": 155369690,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1547759562
    },
    {
        "content": "<p>Ups, danke! Irgendwas macht gerade keinen Sinn <span class=\"emoji emoji-1f605\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 155369959,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1547759774
    },
    {
        "content": "<p>Müsste es dann aber nicht bedeuten, dass $document noch einen weiteren Parameter bräuchte durch welchen ich angeben kann, welches Profil mein erzeugtes Bundle haben soll?</p>",
        "id": 156324156,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1547763392
    },
    {
        "content": "<p>Interessante Frage. Folgt zwar m.E. nicht aus dem obigen gelösten Problem, aber es gibt m.W. hier auch keine Möglichkeit, ein meta.profile zu setzen.<br>\nDie Frage ist: will man das im Standard?<br>\nEdit: Unfug entfernt</p>",
        "id": 156333820,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1547771427
    },
    {
        "content": "<p>Bei $document kann man als Parameter die Referenz zu einer GraphDefinition übergeben, die die genauen Inhalte des document definiert.<br>\nIm Profil der Composition geht das m.W. aber nicht.<br>\nMan kann also z.B. auch die Rekursionstiefe nur zur Laufzeit maschinenverarbeitbar definieren (zumindest im Kontext der FHIR-Spec).<br>\nDass der Client diese GraphDefinition im Kontext von Composition-Profil XY übergeben muss, kann m.W. nur textuell spezifiziert werden. Ist somit Sache der Business Logic. Das gilt auch, wenn der Server so intelligent (bzw. von IG dazu verpflichtet wird) ist, diese GraphDefinition automatisch anzuwenden, wenn $document auf Compositions vom Profil XY angewendet wird.</p>\n<p>Kurz: Business Logic muss ich in jedem Fall dahinter stehen haben, wenn ich $document auf profilierte Compositions/Bundles anwende.</p>\n<p>Es wäre aber IMHO durchaus interessant, ob es genügend Interesse gibt, profilierte documents per $document rein mittels FHIR-Standard durchzudefinieren.<br>\nOhne jetzt weiter darüber nachzudenken, könnte da aber noch die eine oder andere Falle lauern.</p>",
        "id": 156334505,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1547772253
    },
    {
        "content": "<p>Vollkommen richtig, egal wie man es dreht und wendet, man braucht immer eine Composition und GraphDefinition, wenn man möchte, dass es die Regeln maschinen-lesbar ausgedrückt werden und in FHIR spezifiziert sind. Meiner Meinung macht die Angabe von verfügbaren Document Profilen im CapabilityStatement jedoch nur Sinn, wenn ich sie irgendwo auch übergeben kann. Ansonsten müsste der Server nachdem das Dokument fertiggestellt wurde anhand der Struktur \"erkennen\" was das nächstbeste Profil ist, welches passen könnte.</p>\n<p>Hat jemand eigentlich schonmal ausprobiert, wie gut oder schlecht, dass mit der GraphDefinition funktioniert?</p>",
        "id": 156431638,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1547893567
    },
    {
        "content": "<p>Gute Frage. Vielleicht besser mal im implementers-Stream stellen?</p>",
        "id": 156441092,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1547911985
    }
]