[
    {
        "content": "<p>Hallo zusammen, ich bin gerade dabei mich in die Profilierung von FHIR-Ressourcen einzuarbeiten und bin dabei auf eine Frage gestoßen. </p>\n<p>Ich habe ein Valueset mit Codes und möchte dazu eine entsprechende Antwort übertragen. Instiktiv hätte ich eine Observation genommen, da kann ich aber nur einen Code mit entsprechender Antwort übertragen. Natürlich könnte man alles auch im Element component übertragen, aber widerspricht das nicht dem Konzept der kleinen diskreten Informationseinheiten? Oder mache ich mir zu viele Gedanken? ;-) Also meine Frage: Wie bilde ich eine solche Auswahlliste mit Antworten korrekt ab?  Was ist da das Best-Practice?</p>",
        "id": 198301733,
        "sender_full_name": "Peter Müller",
        "timestamp": 1590053395
    },
    {
        "content": "<p>Willkomnen im Club.<br>\nWenn es sich bei dem Value Set um eine Frageliste handelt, dann wäre hier ein Questionaire + Response besser. Eine Observation ist für genau eine Beobachtung. Mehrere Antworten würden dann mehrere Observations sein.</p>",
        "id": 198348687,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1590081123
    },
    {
        "content": "<p>Hallo Herr Oemig, <br>\nvielen Dank für die Antwort. Ich habe mir jetzt die Questionnaire- und die Questionnaireresponse-Ressource samt Beispielen angeschaut. Es sieht so aus, als ob jedes einzelne Item der Frageliste mitsamt Antwort beschreiben müsste. Ich hatte etwas gehofft, dass ich nur das Valueset mit Fragen sowie den Antworttypen angeben muss. Wenn ich jede Frage einzeln beschreiben müsste: warum brauche ich an dieser Stelle dann überhaupt noch ein ValueSet?</p>",
        "id": 198411772,
        "sender_full_name": "Peter Müller",
        "timestamp": 1590131531
    },
    {
        "content": "<p>Um die Missverständnisse hier auszuräumen:</p>\n<ul>\n<li>Untersuchungen/Beobachtungen von Symptomem sind Observations </li>\n<li>Observation.code repräsentiert die Fragestellung, Observation.value die Antwort.</li>\n</ul>",
        "id": 198412030,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590131779
    },
    {
        "content": "<p>Auswahlliste klingt erstmal nach Questionnaire, hier wäre das eine Verlinkung auf ein VS mittels Questionnaire.answerValueset</p>",
        "id": 198412088,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590131869
    },
    {
        "content": "<p>Sie haben ihren use-case nicht beschrieben, ich vermute aber, dass ein Questionnaire nicht nötig ist.</p>",
        "id": 198412137,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590131907
    },
    {
        "content": "<p>In einem Profil würde man den code fest setzen, und den value an eine Answerlist binden.</p>",
        "id": 198412178,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590131963
    },
    {
        "content": "<p>Was Frank sagt ist richtig: Mehrere Antworten = mehrere Observation(-Instanzen)<br>\nDas muss aber nicht zwangsläufig heißen, dass man für jede ein eigenes Observation-Profil braucht.<br>\nWenn die Antwortmöglichkeiten z.B. immer die gleichen sind (ja/nein/weiß nicht), dann könnte man auch Observation.code an ein ValueSet der Frage-Codes  binden und Observation.value an die Antwortmöglichkeiten.</p>\n<p>Wenn sich die Fragen jedoch strukturell unterscheiden wird man um einzelne Observation-Profile nicht drum herum kommen.<br>\nWobei immer zu hoffen ist, dass sich für einige davon bereits fertige (international abgestimmte) Profile finden lassen.</p>\n<p>Questionnaire ist dann interessant, wenn man nicht nur die Persistenz und Kommunikation der Antworten standardisieren möchte, sondern auch deren Präsentation gegenüber dem Anwender, z.B. deren Reihenfolge, welche Fragen sind Pflicht, welche freiwillig, Vorbelegung, bedingte Aktivierung usw...<br>\nUm die gegebenen Antworten danach(jenseits eines konkreten Questionnaires)  interoperabel zu machen, sollten sie unbedingt in Observations konvertiert werden!!</p>",
        "id": 198412692,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1590132435
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 198413122,
        "sender_full_name": "Robert Fruth",
        "timestamp": 1590132889
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191450\">Simone Heckmann</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Codes.20mit.20Antworten/near/198412692\">said</a>:</p>\n<blockquote>\n<p>Das muss aber nicht zwangsläufig heißen, dass man für jede ein eigenes Observation-Profil braucht.<br>\nWenn die Antwortmöglichkeiten z.B. immer die gleichen sind (ja/nein/weiß nicht), dann könnte man auch Observation.code an ein ValueSet der Frage-Codes  binden und Observation.value an die Antwortmöglichkeiten.</p>\n</blockquote>\n<p>Hallo Frau Heckmann,<br>\njetzt kommen wir dem Problem sehr nahe. Mir ist bewusst, dass ich ein ValueSet an Observation.code hängen kann. Jetzt kommt aber mein Knoten im Kopf.</p>\n<p>Beispiel: Ich habe ein Valueset mit fünf Ja/nein-Fragen. Das hängt an Observation.code, ich habe aber jedoch nur ein value[x] für die Antwort. Wie würde dann eine entsprechende Instanz dieses Profils aussehen? Oder wird dann die entsprechende Observation fünf-mal übertragen?</p>",
        "id": 198413475,
        "sender_full_name": "Peter Müller",
        "timestamp": 1590133239
    },
    {
        "content": "<p>Sie meinen wahrscheinlich ein VS mit 5 Konzepten welche beantwortet werden sollen.<br>\nDies wäre 5 Observation Instanzen, eine je code. Jeweils mit der ja/nein Frage im Value.</p>",
        "id": 198414447,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590134110
    },
    {
        "content": "<p>Als Profil kann man hier die Observation.code an das VS binden. Genauso das AnswerVS.</p>",
        "id": 198414475,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590134142
    },
    {
        "content": "<p>Ein Übertragung in Komponenten wäre nur nötig wenn ein Code(Frage) nicht mittels eines Values beantwortet werden könnte. StandardBeispiel Blutdruck.</p>",
        "id": 198414557,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590134184
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"304130\">Peter Müller</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Codes.20mit.20Antworten/near/198413475\">said</a>:</p>\n<blockquote>\n<p>Beispiel: Ich habe ein Valueset mit fünf Ja/nein-Fragen. Das hängt an Observation.code, ich habe aber jedoch nur ein value[x] für die Antwort. Wie würde dann eine entsprechende Instanz dieses Profils aussehen? Oder wird dann die entsprechende Observation fünf-mal übertragen?</p>\n</blockquote>\n<p>Genau! Schönes Beispiel: Das Observation-Profil hätte in Observation.code ein Binding, das alle fünf Frage-Konzepte zulässt.<br>\nObservation.value wäre stets gebunden an das ja/nein/vielleicht ValueSet, oder evtl sogar einfach constained auf den Datentyp boolean.</p>\n<p>Jede der fünf beantworteten Fragen wäre dann eine Instanz einer Observation, wobei jedoch alle fünf Observations valide wären gegen das Profil.</p>",
        "id": 198414920,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1590134453
    }
]