[
    {
        "content": "<p>Hallo zusammen,</p>\n<p>ich bin momentan damit beschäftigt eine Composition-Profil zu definieren. Dabei bin ich über das Constraint cmp-1 in der Compositon.section gestolpert. Die Regel besagt, dass eine Section immer mindestens eines der Elemente text, entry oder eine sub-section enthalten muss. <br>\nIn dem konkreten Anwendungsfall werden die sub-section und das Element text ausgeschlossen. Das Element entry wird mit der Kardinalität 0..* versehen. Für den Fall, dass die Instanz keinen entry enthält, soll der emptyReason befüllt werden.<br>\nNach dem oben beschriebenen Constraint wäre dieses Vorgehen nicht valide. Wenn eine section jedoch kein text, entry oder eine sub-section enthält, sollte es doch valide sein, lediglich einen emptyReason anzugeben, oder liege ich da falsch?<br>\nDer emptyReason würde in dem Fall ja klar machen, warum die Section keine weiteren Informationen enthält. Ich würde demnach erwarten, dass der emptyReason ebenfalls im Constraint cmp-1 aufgeführt wird.</p>\n<p>Für Hinweise wäre ich euch sehr dankbar!</p>",
        "id": 207238200,
        "sender_full_name": "Nils Kohl",
        "timestamp": 1597741730
    },
    {
        "content": "<p>Sieht nach einem Fehler in der Spec aus.</p>",
        "id": 207240213,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597743390
    },
    {
        "content": "<p>Habe das mal auf die internationale Ebene gehoben: <a href=\"#narrow/stream/179166-implementers/topic/Validation.20issues.20with.20Bundle.2Etype.20.3D.20document.20%28STU3%29/near/207240366\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Validation.20issues.20with.20Bundle.2Etype.20.3D.20document.20%28STU3%29/near/207240366</a></p>",
        "id": 207240392,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597743544
    },
    {
        "content": "<p><code>text.exists() or entry.exists() or section.exists() or emptyReason.exists()</code>wäre korrekt.</p>",
        "id": 207240408,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597743573
    },
    {
        "content": "<p>Die Logik von section.emptyReason finde ich sowieso eigenartig. Eine section kann also non-empty sub-sections haben, und trotzdem einen emptyReason - solange entry.empty() ?? Das ist nicht genau der Text von cmp-2 \"A section can only have an emptyReason if it is empty\".</p>",
        "id": 207501005,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1597913126
    },
    {
        "content": "<p>ok ist defekt, Jira ticket eröffne ich noch</p>",
        "id": 207509841,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597920717
    }
]