[
    {
        "content": "<p>Hallo,<br>\nbitte mal die Augen über die überarbeitete \"Coverage\" Resource gleiten lassen.<br>\nEinige unserer Forderungen vom letzten WGM wurden eingearbeitet (z.B. den direkten Link auf den Patienten), andere nicht (z.B. \"bin\" in extensions verschieben). Auch die Forderung, den \"issuer\" in \"payor\" umzubenennen und sowohl auf Organization als auch auf Patient referenzieren zu lassen, um damit auch Selbstzahlerverhältnisse ausdrücken zu können, ist (noch) nicht wiederzufinden.  </p>",
        "id": 153815438,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1457978077
    },
    {
        "content": "<p>Hallo,<br>\nich bitte um Input zu der Frage, was wir in einem Basis-Profil für die Coverage-Resource erwarten würden:<br>\n<a href=\"http://hl7.org/implement/standards/fhir/coverage.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/coverage.html\">http://hl7.org/implement/standards/fhir/coverage.html</a></p>\n<p>Es geht jetzt zunächst mal um allgemeine Dinge, die wir unabhängig von der <strong>Art</strong> der Versicherung konsistent halten wollen.</p>\n<p>Frage 1: Welche Versicherungs-Arten gibt es in DE überhaupt?<br>\nOder, in Tech-Sprech: Welche Codes aus dem ValueSet  für Coverage.Type wollen wir zulassen?<br>\nBenötigen wir zusätzliche Codes?<br>\n<a href=\"http://hl7.org/implement/standards/fhir/valueset-coverage-type.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/valueset-coverage-type.html\">http://hl7.org/implement/standards/fhir/valueset-coverage-type.html</a></p>",
        "id": 153888226,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1494241781
    },
    {
        "content": "<p>PAY = Selbstzahler<br>\nEHCPOL = private Zusatzversicherung<br>\nMANDPOL = gesetzl. Versicherung?<br>\nSOCIAL = Sozialamt?<br>\nWCBPOL = BG?</p>\n<p>...oder finden wir das ValueSet so schräg, dass wir lieber gleich unser eigenes definieren?</p>",
        "id": 153888234,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1494242781
    },
    {
        "content": "<p>Es ist ein \"Preferred\"-Binding, ein eigenes ValueSet zu verwenden wäre daher legal, wenn auch nicht optimal im Sinne einer Interoperabilität jenseits der Landesgrenzen. Allerdings ist es fraglich, in wie weit die korrekte Typisierung deutscher Versicherungsverhältnisse außerhalb Deutschlands eine Rolle spielt.</p>",
        "id": 153888253,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1494251912
    },
    {
        "content": "<p>Hallo alle, <br>\nbitte um Meinungen hierzu: <a href=\"#narrow/stream/implementers/topic/payor's.20bank.20account.20information\" title=\"#narrow/stream/implementers/topic/payor's.20bank.20account.20information\">https://chat.fhir.org/#narrow/stream/implementers/topic/payor's.20bank.20account.20information</a></p>\n<p>Hintergrundinfo: Wir haben dieses Rad erst kürzlich für V2 gedreht, mit folgendem Ergebnis:<br>\n<a href=\"http://wiki.hl7.de/index.php?title=SepaHl7V2\" target=\"_blank\" title=\"http://wiki.hl7.de/index.php?title=SepaHl7V2\">http://wiki.hl7.de/index.php?title=SepaHl7V2</a><br>\nNun geht es darum, das nach FHIR zu übersetzen!</p>\n<p><span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> : ..und wir dachten, wir hätten's hinter uns :D</p>",
        "id": 153890803,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495475993
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span><br>\ndafür hab ich eben neben der Ausprägung \"DWZ\" noch ein<br>\n\"DWSKGW (der wem sein Konto genommen wird)\" gefunden :grin:</p>",
        "id": 153890909,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495526742
    },
    {
        "content": "<p>Während Du hier rumalberst, hab ich mal die Struktur beschrieben <img alt=\":joy:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/joy.png\" title=\":joy:\"></p>",
        "id": 153890911,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495527418
    },
    {
        "content": "<p>gefühlt sieht die Struktur einfach falsch aus,<br>\nich weiss nur im Moment noch nicht wie man es besser machen könnte</p>\n<p>Meine Bauchschmerzen liegen a) darin das meines Erachtens eine Kontonummer niemals ein Identifier einer Person sein kann (vor allem dann nicht wenn die betreffende Person nicht einmal der Kontoinhaber ist)<br>\nEs passt aber eben auch nicht zur Definition von Identifier bei einer Person (A human identifier for this person)</p>\n<p>Zudem ist mir das Konstrukt für den von mir beschriebenen komplizierten  Fall,<br>\n\"Mutter ist die Zahlende für ihr Kind, nutzt aber das Konto ihres Lebensabschnittsgefährten für das sie eine Vollmacht hat.\"<br>\nsehr kontraintuitiv.</p>\n<p>Irgendwie werde ich hier das Gefühl nicht los, das uns hier einfach noch entweder eine Ressource oder ein Datentyp fehlt</p>\n<p>Oder anders augedrückt: Wenn es kompliziert aussieht ist es falsch.</p>",
        "id": 153890916,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495529350
    },
    {
        "content": "<p>vielleicht warten wir mal ab, was an input aus anderen Zeitzonen eintrudelt</p>",
        "id": 153890917,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495529393
    },
    {
        "content": "<p>Genau, \"unverbesserlich hässlich\" :-/<br>\nWegen der Identifier-Thematik würde ich wahrscheinlich wirklich eine komplexe Extension bevorzugen. Oder, falls das in die 80% zu packen ist, eine Anpassung/Erweiterung von Coverage.payor.<br>\nIch hoffe wirklich, da kommt aus den anderen Zeitzonen noch was. Heute Nacht wäre ja schon Gelegenheit gewesen ...<br>\nGibt's eventuell jemand speziellen, den man dazu-pingen könnte?</p>",
        "id": 153890920,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495529824
    },
    {
        "content": "<p>Also ich bin ebenfalls der Meinung, dass die gesamte Bank-Verbindungs-Information an die Coverage gehört, nicht an die Person, da niemand eine pauschale Einwilligung erteilt, sich zeitlich unbegrenzt  von dessen Konto zu bedienen, sondern die Einzugsermächtigung/Mandatsreferenz/Kreditkarteninformation erteilt man immer zweckgebunden.<br>\nZ.B. zum Begleichen der Telefonrechnung. Und eine solche service-bezogene Kostenübernahme entspräche nach meinem Verständnis einer Coverage.</p>",
        "id": 153890928,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495539314
    },
    {
        "content": "<p>Sehe ich auch so.</p>\n<p>Wir müssen aber aufpassen die korrekten Begrifflichkeiten zu verwenden:</p>\n<p>Einzugsermächtigung : gibt es nicht mehr sie wurde ersetzt durch<br>\n=&gt; SEPA Mandat --&gt; dieses wird bei dem Gläuber mit einer <br>\n==&gt; Mandatsferenz versehen, die der späteren Idenfikation des Mandats dient und  die er bei einer SEPA Lastschrift zusammen mit der Gläubiger-ID bei der Transaktion angibt.</p>\n<p>Kreditkarteninformation wiederrum ist nichts anderes als eine besondere Form eines Kontos. Wobei es hier aber keinerlei rechtlich sichere Form einer Ermächtigung gibt, es sei denn es wird vom Kreditkarteninhaber ein irgend geartetes schriftliches Dokument mit rechtsverbindlicher Unterschrift ausgefertigt das den Zugriff auf das Kreditkartenkonto regelt. Andernfalls hat der Gläubiger bei dem Einzug via Kreditkartenkonto ein leichtes Beweisproblem wenn er keinen unterschriebenen Transaktionsbeleg vorweisen kann oder die Transaktion online über Kartenleser und PIN autorisiert wurde.</p>",
        "id": 153890932,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495541085
    },
    {
        "content": "<p>Was für mich an Coverage nicht schlüssig ist, ist die Kardinalität 0..* von payor. Wenn es mehrere payors gäbe, muss die Bankverbindung irgendwie darauf referenzieren, und das macht es hässlich.<br>\nKonsequent wäre ein CRQ für payor 0..1 in Verbindung mit neuen Attributen für die Bankverbindung.<br>\nDie Mandatsreferenz wäre dann tendenziell eine Extension. Oder (hier tatsächlich) ein Identifier der Coverage?<br>\nBleibt evtl. noch die Zahlungsmethode, die im deutschen v2-Profil vorkommt</p>",
        "id": 153890934,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495541939
    },
    {
        "content": "<p>Ob die Bankverbindung an Coverage oder Coverage.payor hängt, wäre im Grund mit payor 0..1 egal. Ich tendiere dann allerdings auch direkt zu Coverage</p>",
        "id": 153890935,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495542053
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> Covereage kann ja auf Contract verlinken, in so fern könnte man schon das schriftliche Dokument mit der rechtsverbindlichen Unterschrift unterbringen....</p>",
        "id": 153890936,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495542088
    },
    {
        "content": "<p>payor 0..* kommt m.W. daher, dass es in den USA nicht unüblich ist, dass Kosten prozentual geteilt werden (50% der Patient, 50% die Versicherung) Das ist bei uns mit Zahn-Zusatz ja ähnlich. Fraglich ist nur, ob man das dann über eine Coverage abbilden muss, oder ob das nicht zwei Coverages sein können, die mit je 50% den gleichen Account abdecken...</p>",
        "id": 153890937,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495542230
    },
    {
        "content": "<p>Die prozentuale Verteilung ist in Coverage.payor aber nicht abgebildet, auch nicht die Priorisierung (wenn \"eh klar\" ist, dass einer 80% übernimmt und einer den Rest) von daher ist es in dieser Form nicht schlüssig. Eine Priorisierung existiert allerdings in Account.coverage ....</p>",
        "id": 153890940,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495542468
    },
    {
        "content": "<p>Was imho auf 2 Coverages deutet, mit je einem payor</p>",
        "id": 153890941,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495542560
    },
    {
        "content": "<p>Die Verlinkung von Coverage auf Contract ist aber lediglich die rechtsverbindliche Unterschrift für die Kostenübernahme selber, nicht jedoch für eine einzelne Kreditkartentransaktion. Das sind 2 völlig unterschiedliche Paar Schuhe.</p>\n<p>De facto wird so was zwar immer wieder gemacht, aber de jure kann das für den Gläubiger ein Problem werden.</p>",
        "id": 153890961,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1495547075
    },
    {
        "content": "<p>Die Tendenz der Patient Administration WorkGroup geht in die Richtung, ein BackboneElement für Coverage.payor einzuführen, um die Bankdaten zu hinterlegen. Die Frage ist, wie müsste ein solches Element aussehen, um unseren Anforderungen zu genügen?<br>\nMir wäre daran gelegen, dass wir bis spätestens nach dem kommenden Interop-Forum einen Konsens formen, den ich als Vorschlag in die Arbeitsgruppe einbringen kann.</p>",
        "id": 153891910,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1496300366
    }
]