[
    {
        "content": "<p>Liebe Gemeinde,<br>\nnun, da das Tooling rund um FHIR R4 weitgehend stabil ist,  haben wir, das Technische Komitee für HL7 FHIR, mit der Migration der Basisprofile von <a href=\"http://ig.fhir.de/basisprofile-de/0.2.1/\" target=\"_blank\" title=\"http://ig.fhir.de/basisprofile-de/0.2.1/\">STU3</a> auf R4 begonnen.<br>\nAufgrund der gewonnenen Erfahrungen, den eingereichten Kommentaren aus der Abstimmung und dem Feedback der Nutzer werden wir einige strukturelle Änderungen einführen.<br>\nEine weitere wichtige Änderung wird sein, dass wir uns künftig stark an den <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/index.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-ips/index.html\">International Patient Summary</a> anlehnen werden, um eine bestmögliche <em>internationale</em> Interoperabilität zu gewährleisten.<br>\nWer uns beim Arbeiten zuschauen, mitarbeiten, kommentieren oder kritisieren möchte, findet die neue - im Aufbau befindliche - Spezifikation <a href=\"https://simplifier.net/guide/basisprofil-de-r4/Home\" target=\"_blank\" title=\"https://simplifier.net/guide/basisprofil-de-r4/Home\">hier</a>.<br>\nAlle Diskussionen rund um die Entwicklung des neuen Leitfadens werden wir hier im Chat führen. Die darauf bezogenen Themen sollten - der Übersichtlichkeit halber -  mit dem Präfix  \"[Basis-R4]\" gekennzeichnet werden.<br>\n<strong>Wir bitten jedoch ausdrücklich um Beachtung der Tatsache, dass es sich um eine Baustelle in einem sehr frühen Stadium handelt!!!</strong><br>\nUnser Ziel ist es, bis im September eine stabile Version zu haben, die wir bei HL7 Deutschland in die Abstimmung geben können.</p>",
        "id": 169699062,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1562322542
    },
    {
        "content": "<p>Für alle, die heute nicht auch dem Interop-Forum waren, hier nochmal die Durchsage:<br>\nWir sind aktuell noch dabei, den FHIR Basisleitfaden R4 zu erstellen: <a href=\"https://simplifier.net/guide/basisprofil-de-r4/home\" target=\"_blank\" title=\"https://simplifier.net/guide/basisprofil-de-r4/home\">https://simplifier.net/guide/basisprofil-de-r4/home</a><br>\nIm Oktober werden wir ein weiteres Ballot ankündigen. Vorher würden wir aber gerne noch so viele Inhalte wie möglich in den Leitfaden aufnehmen. Wer also Vorschläge, Kritik oder Hinweise hat, kann diese jederzeit hier im Chat diskutieren, oder einfach direkt ein Issue in unserem GitHub-Repository erstellen: <a href=\"https://github.com/hl7germany/basisprofil-de-r4/issues\" target=\"_blank\" title=\"https://github.com/hl7germany/basisprofil-de-r4/issues\">https://github.com/hl7germany/basisprofil-de-r4/issues</a></p>",
        "id": 174779480,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567510492
    },
    {
        "content": "<p>Hallo,<br>\nwie sieht den aktuell der Zeitplan für die \"offizielle\" Freigabe der deutschen Basisprofile R4 aus?<br>\nSteht das schon zeitnah an, oder muss aufgrund der aktuellen Lage hier mit einer längeren Verzögerung gerechnet werden?</p>",
        "id": 197972092,
        "sender_full_name": "H. Ristok",
        "timestamp": 1589824209
    },
    {
        "content": "<p>Hallo,<br>\n\"Verzögerung\": ja, \"länger\" eher nicht.<br>\nWir versuchen, so bald wie möglich die Version 1.0 fertig zu haben, da dies jedoch Arbeit von Freiwilligen ist, bitten wir um Verständnis, dass wir keine verbindlichen Termine nennen können...</p>",
        "id": 198025018,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1589868323
    }
]