[
    {
        "content": "<p><a href=\"https://www.din.de/de/service-fuer-anwender/normungsportale/gesundheit/aktuelles/weltweite-versorgung-von-patienten-durch-eine-internationale-patienten-kurzakte-ips--753702\">Weltweite Versorgung von Patienten durch eine internationale Patienten-Kurzakte (IPS)</a></p>\n<p>Wir gehen wir in der Community damit um, dass diese Norm offenbar relevant, aber nicht frei verfügbar ist...?</p>",
        "id": 230338318,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615812523
    },
    {
        "content": "<p>Die DIN Norm ist die deutsche Übersetzung des CEN Norm, da steht nichts mehr oder weniger drin, außer deutschen Begriffe stehen also alle Weisheiten in der CEN Norm<br>\nDas Problem bleibt aber gleich.</p>",
        "id": 230338658,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1615812699
    },
    {
        "content": "<p>CEN Norm kostet auch?</p>",
        "id": 230338771,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615812740
    },
    {
        "content": "<p>Anders gefragt: Wenn ich weder CEN noch-DIN-Norm gelesen habe, mich bei der FHIR-Spezifikation jedoch an IPS orientiere, verpasse ich dann was?</p>",
        "id": 230339607,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615813165
    },
    {
        "content": "<p>CEN Normen sind genauso kostenpflichtig.  Die Normen sind nun einmal das \"Produkt\" das DIN verkauft - wenn wir die Normen nicht mehr verkaufen, können wir auch keine Mitarbeiter finanzieren. Es gab schon mal Überlegungen, ob evtl. Ministerien evtl. Normen \"freikaufen\" können, das ist aber m. E. gescheitert. Auch mit dem Argument, dass man sich die Tastatur ja auch kaufen muss, wenn man einen Text am PC schreibt. Eine Norm ist zwar kein Schnäppchen, aber m. E. durchaus bezahlbar.</p>",
        "id": 230340683,
        "sender_full_name": "Heike Moser",
        "timestamp": 1615813692
    },
    {
        "content": "<p>In einer Community wie dieser hier, in der sich die meisten ehrenamtlich und in ihrer Freitzeit für die Interoperabilität engagieren, ist das nicht praktikabel. Das wird de facto einfach nur zur Folge haben, dass die Norm keiner liest.</p>",
        "id": 230341353,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615813998
    },
    {
        "content": "<p>Liebe Simone, das ist mir klar, aber leider kann ich das nicht ändern. DIN wiederum muss verständlicherweise einen finanziellen Ausgleich haben, bevor es die Norm kostenlos zur Verfügung stellen kann. Immerhin werden Entwürfe  jetzt kostenlos zur Verfügung gestellt, aber das sind halt  leider nicht die finalen Dokumente.</p>",
        "id": 230342166,
        "sender_full_name": "Heike Moser",
        "timestamp": 1615814361
    },
    {
        "content": "<p>Vor einem Jahr hat NEN das Dokument für \"eHMSEG and eHN members\" zur  Verfügung gestellt (mit im PDF auf jeder Seite eingedruckten Lizenztext. \"Dit document is door NEN onder licentie verstrekt aan: / This document has been supplied under license by NEN to: eHMSEG and eHN eHMSEG and eHN members 2020-04-23 11:01:31\"). Alle fachlichen Mitarbeiter in den jeweiligen eHN/eHMSEG-Projekten zu Patient Summary können so das Dokument nutzen. Ob für diese Nutzungsmöglichkeit Geld geflossen ist, weiß ich nicht.</p>",
        "id": 230392619,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1615831571
    }
]