[
    {
        "content": "<p>Guten Tag , gibt es hier jemand welcher sich mit den Signaturen in den unterschiedlichen Objekten Verordnung, Quittungsdatensatz etc. auskennt in Bezug auf FHIR Formaten ?</p>",
        "id": 213144234,
        "sender_full_name": "Gollenbeck",
        "timestamp": 1602590967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"269444\">@Hendrik J.</span> ...?</p>",
        "id": 213147138,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1602592711
    },
    {
        "content": "<p>Hallo DACH-Community. Ich habe mal zwei Anliegen für unsere Spezifikationen zum E-Rezept.</p>\n<ol>\n<li>\n<p>Wir brauchen einen Exit aus der E-Rezept-App, um auf den Warenkorb einer Apotheke mit Versandoption verlinken zu können. Das betrifft nicht nur, aber auch Versandapotheken mit eigener App. Wir dachten da an eine URL mit reichlich Entropie auf einen Warenkorb, der anschließend in einer separaten App oder auch einem Online-Portal geöffnet werden kann. Meine Frage, kann man diese URL in Communication.instantiatesUri transportieren?  Eine sinngemäße Übersetzung der Definition dieses Felds verweist auf ein ORDERSET das von dieser Bestell-Communication ADHERED ist... Wie ist eure Meinung, passt das oder eher ist das fachlich zu weit weg?</p>\n</li>\n<li>\n<p>Die E-Rezept-App soll in einem Apothekenverzeichnis nach \"relevanten\" Apotheken im Umkreis des Users suchen. Zusätzliche, verschiedene Filteroptionen sind alle sinnvoll aber die initiale Abfrage könnte fast immer lauten: <br>\n\"Gib mir alle Organizations, deren Location in einem 5km-Radius liegen und deren HealthcareService einen Notdienst bereitstellt.\"<br>\nDas hab ich mit meinen bescheidenen FHIR-Kenntnissen mal versucht in eine Abfrage zu verfassen, die aber nicht richtig funktioniert:<br>\n<a href=\"http://hapi.fhir.org/baseR4/Organization?_revinclude=Location:organization.near=52.454755|13.394500|5|km&amp;_revinclude=HealthcareService:organization.service-type=http://terminology.hl7.org/CodeSystem/service-type|117\">http://hapi.fhir.org/baseR4/Organization?_revinclude=Location:organization.near=52.454755|13.394500|5|km&amp;_revinclude=HealthcareService:organization.service-type=http://terminology.hl7.org/CodeSystem/service-type|117</a> <br>\nWas mache ich hier falsch?</p>\n</li>\n</ol>",
        "id": 223137112,
        "sender_full_name": "Hendrik Jablonski",
        "timestamp": 1610985337
    },
    {
        "content": "<p>on a _(rev)include one can't specify any conditionalities. That only works on _has , and on the standard parameters that apply to the focal resource of your search. GET  HealthcareService?location.near=xxx&amp;organization.type=zzz&amp;_include=HealthcareService.organization may do the trick, filter the result bundle for organizations. Does your server support 'near' ? Seems complex in its implementation, so servers may not support it.</p>",
        "id": 223142967,
        "sender_full_name": "René Spronk",
        "timestamp": 1610988502
    },
    {
        "content": "<p>Thanks Rene, very helpful answer. For the moment we go with a HAPI standard server, that does support \"near\"-search. For productie use we are still examing.<br>\nSo, for my Organization-Search I need to query that resource with most significant (difficult = token)-search and make use of both references to Location and Organization. In my sample data I only used references pointing to the Organization. I will have a try, thanks for now.</p>",
        "id": 223195182,
        "sender_full_name": "Hendrik Jablonski",
        "timestamp": 1611042361
    },
    {
        "content": "<p>Once again, great help Rene, thanks a lot.<br>\nI gave it a try with the HAPI reference system and some sample data: <a href=\"http://hapi.fhir.org/baseR5/HealthcareService?location.near=52.50892873|13.371629331|3|km&amp;service-type=http://terminology.hl7.org/CodeSystem/service-type|117&amp;_include=HealthcareService:organization\">http://hapi.fhir.org/baseR5/HealthcareService?location.near=52.50892873|13.371629331|3|km&amp;service-type=http://terminology.hl7.org/CodeSystem/service-type|117&amp;_include=HealthcareService:organization</a></p>\n<p>My problem was asking to \"give me all Organizations that have a Location nearby and also a HealthcareService of special type\". <br>\nI see the point asking directly for \"some special HealthcareServices nearby and please include the Organization\".</p>\n<p>I love this FHIR Community.</p>",
        "id": 223232891,
        "sender_full_name": "Hendrik Jablonski",
        "timestamp": 1611066350
    },
    {
        "content": "<p>does anyone have an idea for my other question regarding: Communication.instantiatesUri ?<br>\nWe want to communicate a shopping cart-URL to a client. Is instantiatesUri the appropriate field?</p>",
        "id": 223389242,
        "sender_full_name": "Hendrik Jablonski",
        "timestamp": 1611156775
    },
    {
        "content": "<p>Meine Tendenz wäre hier eher Communication.payload.contentAttachment.url</p>\n<p>Die URL ist ja der Inhalt, der hier kommuniziert werden soll...</p>",
        "id": 223390051,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1611157116
    },
    {
        "content": "<p>Communication.instantiatesURI bedeutet nach meiner Interpretation eher „wir senden diese Nachricht, weil das verlinkte Protokoll das so vorschreibt“, speziell bei automatisch versendeten Nachrichten....</p>",
        "id": 223390430,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1611157282
    },
    {
        "content": "<p>Danke <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> klingt super.</p>",
        "id": 223527073,
        "sender_full_name": "Hendrik Jablonski",
        "timestamp": 1611244162
    },
    {
        "content": "<p><a href=\"https://simplifier.net/erezept-workflow/gemerxcommunicationinforeq\">https://simplifier.net/erezept-workflow/gemerxcommunicationinforeq</a><br>\nCommunication.about referenziert das Medikationsprofil. Aber warum ist es möglich, Communication.about mehrmals einzufügen? Jede Verordnung enthält doch nur eine Medikation? Und nach meinem Verständnis macht es auch nur Sinn, wenn in Communication auf eine Medikation referenziert wird, weil Communication.payload auch nur einmal eingefügt werden kann. Sonst würden sich die payload-Infos auf alle about-Medikationen beziehen. Die Frage lautet also, warum kann about mehrfach eingefügt werden?<br>\nDanke euch!</p>",
        "id": 233655564,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1617889999
    },
    {
        "content": "<p>Ich kann zwar zu dem Problem leider nichts beitragen, möchte aber ein bisschen Verwirrung durch die Terminologie vorbeugen: Ein FHIR Medication-Objekt entspricht einem Medikament, also einem Arzneimittel. Eine Medikation ist eine Behandlung mit einem Medikament und wird in FHIR in einem MedicationStatement abgebildet.</p>",
        "id": 233663030,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1617892543
    },
    {
        "content": "<p>Vielen Dank für die Klarstellung,  Johannes. Ich meinte schon ein FHIR Medication Objekt, das in diesem Kontext ein verschriebenes Arzneimittel repräsentiert. Die Verfügbarkeit (z.B.) dieses Arzneimittels möchte der anfragende Versicherte bei der ausgewählten Apotheke klären. Allerdings enthält eine eRezept-Verordnung nur ein Arzneimittel. Deshalb verstehe ich die 1..* Kardinalität von Communication.about nicht.</p>",
        "id": 233667042,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1617893882
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"265502\">@Theodor Szymkowiak</span></p>",
        "id": 233694234,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1617902826
    },
    {
        "content": "<p>Elektronisch sollte jedes Medikament ein einzelnes Rezept darstellen. Es gibt aber Ausnahmen, wenn Medikamente nur zusammen abgegeben bzw. eingenommen werden sollen. Deshalb 1..*</p>",
        "id": 233711548,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1617909003
    },
    {
        "content": "<p>Wir müssen also beim Empfang der Anfragen vorsehen, dass eine Anfrage mehrere Artikel beinhalten kann, korrekt?</p>",
        "id": 233774730,
        "sender_full_name": "Timo Rosenblatt",
        "timestamp": 1617950381
    },
    {
        "content": "<p>IIRC war die Überlegung die, dass der Patient beim einlösen eines Rezeptes eventuell zusätzlich noch ein OTC Medikament benötigt und beides in der selben Apotheke holen will. Folglich soll auch die Verfügbarkeit von mehreren Medikamenten in einer Communication abgefragt werden können.<br>\n(bitte bestätigen oder widersprechen, <span class=\"user-mention\" data-user-id=\"265502\">@Theodor Szymkowiak</span> <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> )</p>",
        "id": 233775475,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1617950979
    },
    {
        "content": "<p>D.h., dass der Versicherte im FdV mehrere Medikamente (aus verschiedenen eRezepten) für eine Nachricht bündeln kann? Denn wenn ich es richtig verstehe, ist ein OTC Medikament letztlich ja auch nur ein Medikament, das in einem eRezept verordnet wird.</p>",
        "id": 233801535,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1617965738
    },
    {
        "content": "<p>OTC = over the counter, d.h. ohne Rezept?!</p>",
        "id": 233832955,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1617979406
    },
    {
        "content": "<p>Sehr interessant. Für ein Medikament ohne Rezept gibt es folglich auch kein Task-Objekt, kein Verordnungs-Bundle, etc. D.h. der Versicherte müsste dann im FdV in der Lage sein, ein FHIR Medication-Objekt  zu erstellen, um dieses zusätzlich über Communication.about bei einer Anfrage einzubeziehen. Z.B. er gibt einen Text ein und das FdV macht ein Medication_Freetext-Objekt daraus. Oder er wählt aus einer Liste von OTC-Medikamenten aus und das FdV erstellt daraus ein Medication_PZN-Objekt. Dann wird für mich ein Schuh draus. Hab mir die Spec vom FdV nicht angesehen, da müsste das ja drin sein. Klingt aber schwer vorstellbar.<br>\nNaja, anyway. Offenbar muss man für irgendeinen exotischen Fall die Möglichkeit mehrerer Medication-Objekte in einer Anfrage einbeziehen, für die dann sinngemäß der gleiche Communication.payload gilt.<br>\nVielen Dank an Euch! <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 234032969,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1618135649
    },
    {
        "content": "<p>In Kombination mit bestimmten Rx Fertigarzneimitteln können OTC auch bei der Kasse abgerechnet werden und wären dann auch wieder auf einem Rezept. Ich denke also, dass wir nur von dieser Kombination sprechen, in der es auch ein E-Rezept zu dem OTC FAM gibt.</p>",
        "id": 234106850,
        "sender_full_name": "Timo Rosenblatt",
        "timestamp": 1618206852
    },
    {
        "content": "<p>Im About soll zurzeit nur das Medikament eingetragen werden,  welches im E-Rezept Bundle angegeben ist (siehe gemSpec_eRp_FdV A_19194-2). In Zukunft könnte sich das aber ändern, sodass wir bei der FHIR-Profilierung auf die Kardinatität 1..* setzen. Die Durchsetzung, dass nur ein Medikament angegeben wird erfolgt dann über die Spezifikation und die von uns erstellte App. OTC Medikamente sollen im Payload der Communication als Freitext angegeben werden.</p>",
        "id": 234124565,
        "sender_full_name": "Theodor Szymkowiak",
        "timestamp": 1618217604
    },
    {
        "content": "<p>Vielen Dank für die Klarstellung! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 234275519,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1618295911
    },
    {
        "content": "<p>Frei erhältliche Dokumente, wie bspw. Aspirin, sind in der Dokumentation mitunter zu berücksichtigen. Aktuell ist es aber so, dass jeder Arzt nur \"seine\" Medikamente berücksichtigt, obwohl ein BMP eigentlich genau das angehen sollte. Insofern ist ein Rezept eine Sache, die Dokumentation eine ganz andere.</p>",
        "id": 234290994,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1618304243
    }
]