[
    {
        "content": "<p>...ich habe hiermit an Interessierte weitergeleitet:</p>\n<blockquote>\n<p>Öffentliche Kommentierung der eAU – FHIR-Profile in der Version 1.0.0</p>\n<p>Der Gesetzgeber hat im Zuge der Anpassung des § 295 Abs. 1 SGB V mit Wirkung zum 1. Januar 2021 festgelegt, dass die an der vertragsärztlichen Versorgung teilnehmenden Ärzte und Einrichtungen verpflichtet sind, die von Ihnen festgestellten Arbeitsunfähigkeitsdaten aufzuzeichnen und an die Krankenkassen zu übermitteln.</p>\n<p>Zu diesem Zwecke wurden unter <a href=\"https://simplifier.net/eau\" target=\"_blank\" title=\"https://simplifier.net/eau\">https://simplifier.net/eau</a> die FHIR-Profile für die eAU durch die KBV erstellt.</p>\n<p>Die veröffentlichten FHIR-Profile können von allen Interessierten bis zum 13. März 2020 kommentiert werden. Für die Kommentierung benutzen Sie bitte das unter dem Link ftp://ftp.kbv.de/ita-update/Ankuendigung/Kommentierung_eAU/ veröffentlichte Kommentierungsprotokoll, welches Sie per E-Mail an <a href=\"mailto:ita@kbv.de\" title=\"mailto:ita@kbv.de\">ita@kbv.de</a> einreichen können. Unter diesem Link finden Sie auch das zugehörige Informationsmodell, welches ebenfalls kommentiert werden kann.</p>\n<p>Öffentliche Kommentierung der eRezept – FHIR-Profile in der Version 1.0.0</p>\n<p>Der Gesetzgeber hat im § 86 Abs. 1 SGB V festgelegt, dass zuerst die Verordnung von Arzneimittel und weiteren nach §31 SGB V in die vertragsärztliche Versorgung einbezogenen Produkte elektronisch ermöglicht werden muss. Die Kassenärztliche Bundesvereinigung und der Spitzenverband Bund der Krankenkassen müssen hierzu im Rahmen des Bundesmantelvertrag-Ärzte bis zum 31. März 2020 entsprechende Vereinbarungen treffen.</p>\n<p>Zu diesem Zwecke wurden unter <a href=\"https://simplifier.net/erezept\" target=\"_blank\" title=\"https://simplifier.net/erezept\">https://simplifier.net/erezept</a> die FHIR-Profile für die eRezept durch die KBV erstellt.</p>\n<p>Die veröffentlichten FHIR-Profile können von allen Interessierten bis zum 13. März 2020 kommentiert werden. Für die Kommentierung benutzen Sie bitte das unter dem Link ftp://ftp.kbv.de/ita-update/Ankuendigung/Kommentierung_eRezept/ veröffentlichte Kommentierungsprotokoll, welches Sie per E-Mail unter <a href=\"mailto:ita@kbv.de\" title=\"mailto:ita@kbv.de\">ita@kbv.de</a> einreichen können. Unter diesem Link finden Sie auch das zugehörige Informationsmodell, welches ebenfalls kommentiert werden kann.</p>\n<p>Alle eingehenden Kommentare werden vor der Veröffentlichung der FHIR-Profile beachtet und aufgrund der knappen gesetzlichen Pflichten erst im Laufe des April 2020 beantwortet.</p>\n<p>Gerne können Sie den Aufruf zur öffentlichen Kommentierung an weitere Interessierte weiterleiten.</p>\n<p>Mit der Bitte um Beachtung und freundlichen Grüßen</p>\n<p>i.A.</p>\n<p>Lydia Typlt</p>\n<p>Kassenärztliche Bundesvereinigung</p>\n<p>Dezernat Digitalisierung und IT</p>\n<p>IT in der Arztpraxis</p>\n<p>Herbert-Lewin-Platz 2, 10623 Berlin</p>\n<p>Postfach 12 02 64, 10592 Berlin</p>\n</blockquote>",
        "id": 189310908,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1582897811
    }
]