[
    {
        "content": "<p>Aktuell haben wir im Kontext der Verwendung von FHIR ein zentrales und gewichtiges Problem: Encounter vs. EpisodeOfCare/Fall vs. Bewegung – auch im Kontext SAP. Hat jemand von Euch Erfahrungen dabei in welchem Kontext welche Ressource wie eingesetzt wird. Gibt es dazu schon Entwicklungen? Leider war die SAP Präsentation auch nicht sehr aufschlussreich. Danke!</p>",
        "id": 154004361,
        "sender_full_name": "Mathias Aschhoff",
        "timestamp": 1538479506
    },
    {
        "content": "<p>Hallo Mathias,<br>\nEin <code>Encounter</code> ist wörtlich zu nehmen: Eine Begegnung mit einem Patienten (ambulant/stationär/virtuell).<br>\n<code>EpisodeOfCare</code> ist eine Klammer, mit der man mehrere solche Begegnungen mit medizinischem Kontext zusammenfassen kann.<br>\n(z.B. vorstat+stat+nachstat zur Behandlung der selben Diagnose)<br>\nFür die Zusammenfassung mehrerer Besuche zu einem Abrechnungskontext (der ja völlig anders aussehen kann als der medizinische Kontext) gibt es <code>Account</code></p>",
        "id": 154004377,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1538484230
    },
    {
        "content": "<p>Ping an <span class=\"user-mention\" data-user-id=\"191964\">@Bettina Lieske</span> bezüglich der Auffassung von SAP</p>",
        "id": 154004378,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1538484250
    },
    {
        "content": "<p>Encounter hat zum Zwecke der Klammerung 0..* Referenzen sowohl zu Account als auch EpisodeOfCare.</p>",
        "id": 154004385,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1538484456
    },
    {
        "content": "<p>Danke <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>, der Tipp mit dem Account war schonmal super.</p>",
        "id": 154004408,
        "sender_full_name": "Mathias Aschhoff",
        "timestamp": 1538486360
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192505\">@Mathias Aschhoff</span> Encounter vs. EpisodeOfCare wurde kürzlich auch hier diskutiert: <a href=\"#narrow/stream/27-german-(d-a-ch)/subject/MI-I-Kerndatensatz.3A.20Entgelte\" title=\"#narrow/stream/27-german-(d-a-ch)/subject/MI-I-Kerndatensatz.3A.20Entgelte\">https://chat.fhir.org/#narrow/stream/27-german-(d-a-ch)/subject/MI-I-Kerndatensatz.3A.20Entgelte</a> <br>\nIch finde es in dem Zusammenhang erwähnenswert, dass ein stationärer Encounter ja auch mehrere Untersuchungen umfassen kann. Je nach Aufenthalt wären das dann mehrere Begegnungen pro Encounter (falls mit Begegnung der Kontakt zwischen einem Patient und einem Practitioner  gemeint war <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>).</p>",
        "id": 154004649,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1538491929
    },
    {
        "content": "<p>Eigentlich eher der gesamte (stationäre) Besuch...</p>",
        "id": 154004655,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1538492291
    },
    {
        "content": "<p>Verlegungen können über location 0..* und location.period abgebildet werden (<a href=\"http://build.fhir.org/encounter\" target=\"_blank\" title=\"http://build.fhir.org/encounter\">http://build.fhir.org/encounter</a>)</p>",
        "id": 154004671,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1538493404
    },
    {
        "content": "<p>Ambulanter Besuch bei stationärem Aufenthalt (aka Konsil) würde ich jetzt intuitiv als Encounter(ambulant) mit partOf-Referenz auf Encounter(stationär) betrachten</p>",
        "id": 154004674,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1538493481
    },
    {
        "content": "<blockquote>\n<p>Eigentlich eher der gesamte (stationäre) Besuch...</p>\n</blockquote>\n<p>Ja genau, so meinte ich das auch. Der ganze Aufenthalt inkl aller Untersuchungen = ein Encounter und wenn man mag bildet man weitere Encounters für Einzeluntersuchungen während dieses Aufenthaltes.</p>",
        "id": 154004821,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1538502701
    },
    {
        "content": "<p>Sitze gerade in Patient Administration WG und wir diskutieren über das Tracking von Bewegungen innerhalb eines Encounters (Verlegungen)<br>\nDie Tendenz ist,  eventuell eine neue Ressource \"Movement\" einzuführen, die die \"beweglichen Teile\" eines Encounters enthält, so dass diese unabhängig aktualisiert/geändert/gelöscht werden können und man beim Abfragen von Encounter-Informationen nicht immer gleich die gesamte Geschichte herunterladen muss. Aber das passiert sicherlich nicht vor R5. Ideen und Meinungen willkommen!</p>",
        "id": 154004868,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1538507895
    },
    {
        "content": "<p>Vielleicht auch kurz nochmal in die German national extension zu IHE ITI PAM reinschauen. Das ist zwar HL7 v2, aber die Thematik ist eng verwandt. Frank ist dafür vermutlich gerne Ansprechpartner.</p>",
        "id": 154004928,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1538516859
    },
    {
        "content": "<p>Naja. Bei der Diskussion geht es weniger um Semantik und Synatx der Elemente als vielmehr um die Frage wie wir mit der komplexen Struktur in einer query-getriebenen RESTful Umgebung umgehen. Glaub nicht, dass V2 uns da helfen kann ;-)</p>",
        "id": 154004935,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1538519752
    },
    {
        "content": "<p>Hallo Mathias, es ist so wie es Simone beschrieben hat. Wir sehen Encounter als Abbildung der tatsächlichen Kontakte (in welcher Granularität auch immer), die EoC als medizinische Klammer in einem klischen System und den Account als Abrechnungsklammer (der alle Kontakte zu Abrechnungszwecken zusammenfasst).</p>",
        "id": 154006255,
        "sender_full_name": "Bettina Lieske",
        "timestamp": 1538744251
    }
]