[
    {
        "content": "<p>Ich eröffne mal eine Diskussion zu  medizinischer Fall, abrechnungstechnischer Fall , Besuch</p>",
        "id": 153861819,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481119054
    },
    {
        "content": "<p>unser System schmeisst da ja einiges an Begriffen in einen Topf die nicht unbedingt was miteinander zu tun haben nämlich Behandlungsfälle und Abrechnungsfälle.</p>\n<p>Für ein konkretes Beispiel fehlt hier die med. Grundlage aber,</p>\n<p>Es gibt Patienten die zur Behandlung einer Erkrankung in eine Klinik kommen<br>\nJe nach Zustand (gemessen über ein Scoring System z.B. Bathel Index) sind sie mal Akut- und mal Reha Patienten. Also in unserem normale Sprech unterschiedliche Fälle</p>\n<p>Die EpisodeOfCare wäre dann die Behandlung wegen der Erkrankung A<br>\nDie Encounter die verschiedenen Reha- und Akut- Fälle</p>\n<p>aber darunter haben wir ja u.U. noch meherer Verlegungen innerhalb der Einrichtung.</p>",
        "id": 153861820,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481119058
    },
    {
        "content": "<p>In meinem Verständnis ist jeder Besuch des Patienten ein Encounter, Akut und Reha sind zwei verschiedene Fälle</p>",
        "id": 153861821,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481119134
    },
    {
        "content": "<p>und somit jeweils eine Episode of Care, einmal die Akut Episode, einmal die Reha</p>",
        "id": 153861823,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481119162
    },
    {
        "content": "<p>Verlegungen innerhalb der Einrichtung während eines Besuchs wäre Encounter.location</p>",
        "id": 153861825,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481119223
    },
    {
        "content": "<p>Ich denke nicht, dass sich eine EpisodeOfCare über einen Akutfall hinaus in den Rehafall hinein erstreckt.<br>\nWohl aber über den Vorstationären Besuch über den stationären Aufenthalt hin zu den Nachstationären Besuchen.</p>",
        "id": 153861826,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481119303
    },
    {
        "content": "<p>Meinem Verständnis nach ist EpisodeOfCare die Klammer, die mehrere Besuche=Encounter zu einem Abrechnungsfall zusammenführt</p>",
        "id": 153861827,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481119341
    },
    {
        "content": "<p>+1</p>",
        "id": 153861828,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481119359
    },
    {
        "content": "<p>z.B. auch der bei uns typische Quartalsfall, der x ambulante Besuche enthalten kann</p>",
        "id": 153861829,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481119394
    },
    {
        "content": "<p>Im Bezug auf die Verlinkung aus Claim heraus:<br>\nWir sollen aber im Blick behalten, dass (gerade am Anfang) einige Systeme evtl. gar nicht mit EpisodeOfCare arbeiten, sondern nur Encounter kennen. Bei einigen ambulanten Kontexten gibt es vll auch gar keine EpisodeOfCare, weil jeder Encounter separat abgerechnet wird (z.B. privat, ambulant)</p>",
        "id": 153861830,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481119576
    },
    {
        "content": "<p>ich habe auch den Eindruck, dass viele Encounter dem Fall gleichsetzen</p>",
        "id": 153861831,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481119617
    },
    {
        "content": "<p>Das sind ausschliesslich aus abrechnungssicht 2 Fälle, an dem Patienten und seiner Behandlung ändert sich absolut nicht, der leigt im selben Bett, wird von denselben Personen mit dem immer noch gülitgen Behandlungsplan behandelt. </p>\n<p>Dann machen wir den gleichen Mist den wir in V2 hatten<br>\nReal gibt es übergeordnete med. Fälle<br>\nhatten wir mit mühen in V2 als alt. VisitID modelliert.</p>\n<p>Aus der EpisodeOfCare Resource:</p>\n<p>In many cases, this represents a period of time where the Healthcare Provider has some level of responsibility for the care of the patient regarding a specific condition or problem, even if not currently participating in an encounter.</p>\n<p>Das heisst die o.a Behandlung ist genau eine EpisodeOfCare weil hier der Patient wg. einer bestimmten Erkrankung behandelt wird.<br>\nDas es mal nach Akut und mal nach REHA Bedingungen abgerechnet wird hat nichts aber auch rein gar nichts mit seiner Behandlung zu tun, sonderrn ausschliesslich mit gesetzlichen Abrechnungsregeln</p>",
        "id": 153861832,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481119633
    },
    {
        "content": "<p>These resources are typically known in existing systems as:</p>\n<p>EpisodeOfCare: Case, Program, Problem, Episode<br>\nEncounter: Visit, Contact</p>",
        "id": 153861833,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481119767
    },
    {
        "content": "<p>Case ist aber nicht gleibedeutend mit unserem Fall</p>",
        "id": 153861834,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481119797
    },
    {
        "content": "<p>ok.</p>",
        "id": 153861835,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481119816
    },
    {
        "content": "<p>Naja, für die Schrullen unseres Abrechnungssystems kann FHIR ja nix. Da werden wir uns halt was einfallen lassen müssen, um das passend zu machen.</p>",
        "id": 153861836,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481119854
    },
    {
        "content": "<p>Nach der Definition von EpisodeOfCare könnte diese auch ein DMP sein....<br>\nund nu ?</p>",
        "id": 153861837,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481119912
    },
    {
        "content": "<p>das wird dann über EpisodeOfCare.type dargestellt</p>",
        "id": 153861838,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481120021
    },
    {
        "content": "<p>Encounter.episodeOfCare ist 0..*<br>\nDer Encounter kann also sowohl zu einem Abrechnungsfall als auch einem DMP-Programm gehören</p>",
        "id": 153861839,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481120025
    },
    {
        "content": "<p>Und der Encounter:<br>\nAn Encounter encompasses the lifecycle from pre-admission, the actual encounter (for ambulatory encounters), and admission, stay and discharge (for inpatient encounters). During the encounter the patient may move from practitioner to practitioner and location to location. </p>\n<p>das sieht dann schon eher nach dem Umfang unserer (Abrechnugs)-Fälle aus</p>",
        "id": 153861840,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481120025
    },
    {
        "content": "<p>type   Σ   0..*    CodeableConcept Type/class - e.g. specialist referral, disease management</p>",
        "id": 153861841,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481120032
    },
    {
        "content": "<p>ein Encounter kann also ein ambulanter Besuch sein, ein Abrechnungsfall kann aber aus mehreren Besuchen bestehen</p>",
        "id": 153861842,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481120079
    },
    {
        "content": "<p>Der Mediziner würde wiederrum sagen, es gibt keine ambulanten Fälle, sondern nur Besuche</p>",
        "id": 153861843,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481120128
    },
    {
        "content": "<p>Ein inpatient-Encounter dauert per Definition auch nur von Aufnahme bis zur Entlassung. Vor-/Nachstationäre Besuche sehe ich als separate Encounter</p>",
        "id": 153861844,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481120141
    },
    {
        "content": "<p>Ich als examiniert Pflegekraft hatte oft Fälle mit mehreren (ambulanten) Besuchen </p>",
        "id": 153861845,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481120169
    },
    {
        "content": "<p>Es gibt die ambulanten Quartalsfälle (Dialyse), oder wurden die inzwischen abgeschafft?</p>",
        "id": 153861846,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481120188
    },
    {
        "content": "<p><img alt=\":cat_face:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/cat_face.png\" title=\":cat_face:\"> </p>",
        "id": 153861847,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481120189
    },
    {
        "content": "<p>Der Mediziner versteht was anderes unter Fall als der Abrechner</p>",
        "id": 153861848,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481120213
    },
    {
        "content": "<p>Die Niereninsuffizienten wären froh wenn das nur ein Quartalsfall wäre, die haben das aber dummerweise zumindest bis zur Transplantation am bein</p>",
        "id": 153861849,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481120261
    },
    {
        "content": "<p>In FHIR können wir doch einen medizinsichen Fall (eine Erkrankung) haben, die ggf. ein halbes Leben dauertm und einen Abrechnungsfall, der ein paar Besuche zur Abrechnung klammert. Über Encounter.episodeOfCare können wir einen konkreten Besuch in beide Tüten stecken und Mediziner und Abrechner sind glücklich. Wir brauchen nur evtl eine Extension an EPisode of Care um Abrechnungsfälle, Medizinische Fälle, DMP und Schlönz voneinander unterscheiden zu können.</p>",
        "id": 153861850,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481120379
    },
    {
        "content": "<p>Meines Erachtens hat der Abrechnungsfall weder was an der EpisodeOfCar noch am Encounter zu suchen, es ist eine financial Resource und keine medizinische (vermtl trifft der account das am ehesten)</p>",
        "id": 153861851,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481120554
    },
    {
        "content": "<p>Wir waren uns in V2 in der Retrospektive eigentlich einig, das wir den abrechnungsfall eigentlich als AccountNumber hätten modellieren müssen, aber als uns die Erkentnis traf hatten wir schon viel zu lange PV1-19 in Benutzung</p>\n<p>Dann wären wir auch aus dem Dilemma der ambulanten Fallanlage rausgekommen, die es in V2 auch nicht gibt.</p>",
        "id": 153861852,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481120680
    },
    {
        "content": "<p>Der Encounter wird ja auch einem Account zugeordnet. In so fern steht uns diese Möglichkeit je ebenfalls offen.</p>",
        "id": 153861856,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481121259
    },
    {
        "content": "<p>Da müssen wir jedenfalls auch noch mal drüber gehen, zumal <br>\n\"8.16.3.1 Expected Implementations</p>\n<div class=\"codehilite\"><pre>Chronic Disease Management Systems\nCommunity Care Systems\n    Tracking progress of a specific condition\n    Tracking government funding\nProblem based General Practice systems\nDisability Support Systems\nAged Care Systems (Community and Residential)\n</pre></div>\n\n\n<p>\" für EpisodeOfCare</p>",
        "id": 153861862,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481121500
    },
    {
        "content": "<p>was nochmal in die Richtung EpisodeOfCare oberhalb von Fall hinweis</p>",
        "id": 153861863,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481121540
    },
    {
        "content": "<p>Joa. \"eDMP on FHIR\" wär auch mal ein nettes Projekt. :)<br>\nWenn sich jemand freiwillig meldet, der das implementiert...</p>",
        "id": 153861866,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481122227
    },
    {
        "content": "<p>DMP ist wahrscheinlich bis auf weiteres vergebliche Liebesmüh :D<br>\nAber wie gesagt, den medizinischen \"Fall\", der über Jahre geht, haben wir auch ganz typisch in der Onkologie. Diagnostik, OP,  ambulante Chemo, 5 Jahre Nachsorge, womöglich ein Rezidiv. Und das ganze in einem eigentlich für FHIR prädestinierten Umfeld von Klinik (meist Organzentrum) und n Niedergelassenen vom Hämato-Onkologen im MVZ bis zum Hausarzt.<br>\nAber das wäre glaube ich schon wieder ein neuer Thread. Und ich würde in Bezug auf Onkologie noch eine hoffentlich kurze Zeit Geduld bitten ;-)</p>",
        "id": 153861895,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481127546
    },
    {
        "content": "<p>Sowohl Encounter als auch EpisodeOfCare referenzieren 0..* auf Account. Kann es andersrum eine Leistung (im Peter-Sinn) geben, die ohne Encounter und/oder EpisodeOfCare auf einen Account referenziert?</p>",
        "id": 153861897,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481128047
    },
    {
        "content": "<p>Ja, wenn z.B. ein Medikament von einer Apotheke an eine Station geliefert wird. Einach nur auf Vorrat, ohne Fall/Patientenbezug</p>",
        "id": 153861910,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481133026
    },
    {
        "content": "<p>Oder wenn die Leistungen nur der Statistik dienen und einfach nur die Anzahl der Untersuchungen, die Leistungsstelle X für Klinik Y erbracht hat gezählt werden, ohne dass Fallzuordnung dabei eine Rolle spielt.</p>",
        "id": 153861911,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481133093
    },
    {
        "content": "<p>OK, d.h. da kommen Pseudo-Accounts für Controlling, In-House-Warentransfer usw. ins Spiel. Damit kommt man dann um eine Referenz auf Account nicht rum.</p>",
        "id": 153861941,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481137990
    },
    {
        "content": "<p>Andererseits wäre es wahrscheinlich ausreichend, wenn man die Referenzierung auf Encounter im Bedarfsfall indirekt über providedService abdeckt.<br>\nDiagnosticReport und Procedure haben die Encounter-Referenz ja schon drin. MedicationDispense und SupplyDelivery nicht. Wobei ich mich frage, welches SupplyDelivery überhaupt in Bezug zu einem Encounter steht.<br>\nAuch MedicationDispense (also die _Bereitstellung_ eines Medikaments) hat noch keinen unbedingten Bezug.<br>\nIst MedicationAdministration evtl. auch eine Leistung im Claim-Sinn? Das hat dann wieder den Encounter</p>",
        "id": 153861948,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481138777
    },
    {
        "content": "<p>tl;dr: Man kann den Encounter dort, wo es sinnhaft ist, über providedService indirekt referenzieren.<br>\nUnd vom Encounter komme ich auch zur EpisodeOfCare, wenn ich will</p>",
        "id": 153861949,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481138887
    },
    {
        "content": "<p>Ich könnte mir aber UseCases vorstellen, die so banal sind, dass es gar keinen kompletten OrderEntry Workflow gibt und das Subsystem außer einer Fallnummer nix weiß, worauf es den Claim buchen könnte.</p>",
        "id": 153861981,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481146908
    },
    {
        "content": "<p>Z.B. irgendein Gerät das irgendwas misst und dafür eine Ziffer sendet, außer einem gescannten Barcode weiß das Teil aber nix von der Welt.</p>",
        "id": 153861982,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481146959
    },
    {
        "content": "<p>Nochmal zurück zum Fall: wir sind uns einig, dass ein Encounter kürzer ist als eine E.of Care -&gt; eine E.ofCare kann mehrere Encounter enthalten. <br>\nEncounter ist also der Aufenthalt. Episode of Care ist der Fall in all seinen Ausprägungen. Der Quartalsfall, DMP, medizinischer Fall welcher über Jahre geht - dies kann über EpisodeOfCare.type abgebildet werden. <br>\nWir wollen ja nicht noch eine 3. ressource erfinden</p>",
        "id": 153862185,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481186859
    },
    {
        "content": "<p>Definitiv nicht. Zumal wir ja noch die Option haben, Abrechnungsfälle über Accounts abzubilden.<br>\nEs kommt nur irgendwann auf uns zu, dass wir IGs für die jeweiligen UseCases schreiben werden und das alles auseinanderdröseln müssen. Erschwerend kommt hinzu, dass die Systeme bisher sehr willkürlich zwischen diesen Dingen unterschieden haben. Und UNDIFFERENZIERT auf DIFFERENZIERT zu mappen wird ...spannend.</p>",
        "id": 153862186,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481187171
    },
    {
        "content": "<p>...was aber kein Grund sein soll, Fehler der Vergangenheit zu wiederholen :)</p>",
        "id": 153862187,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481187219
    },
    {
        "content": "<p>sorry voller text kommt gleich</p>",
        "id": 153862188,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481187292
    },
    {
        "content": "<p>Encounter ist ein Besuch, soweit so gut.<br>\nEpisodeOfCare ist eine assoziation zu einer med. Einrichtung wegen einer speziellen Erkrankung/Behandlung<br>\nim  stationären Kontext kann es identisch mit einem Fall sein, muss es aber wegen der gestrigen Beschreibug nicht zwangsläufig sein,<br>\nim ambulanten Kontext ist es definitiv unterschiedlich<br>\nStichwort Quartalsabrechnung viele encounter bei einem einzelnen niedergelassenen Arzt, die unterschiedlichste medizinische Kontexte habem</p>",
        "id": 153862190,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481187731
    },
    {
        "content": "<p>Es gibt im übrigen noch ein weiteres Szenario über dessen Abbildung wir nachdenken müssen</p>\n<p>Storyline:<br>\nPatient wird zur Behandlung z.B. einer orthopädischen Operation in ein Krankenhaus stationär aufgenommen. (med Context1)<br>\nNoch während der Behandlung erleidet er auf Grund einer koronaren Herzerkrankung einen Infarkt und wird zur behandlung in die Kardiologie verlegt. Also nach deutschem Abrechnugssprech ein Wechsel der Fachrichtung, oder ander gesagt ein völlig neuer Behandlungskontext bei gleicher Fallnummer</p>\n<p>Wäre definitiv eine neue EpisodeOfCare im selben Fall, müsste aber auch nach meinem dafürhalten ein neuer Encounter sein</p>",
        "id": 153862192,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481188682
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191964\">@Bettina Lieske</span> wenn in IS-H ein Fall angelegt wird, wird dann automatisch auch ein Debitor angelegt, oder hängt der an den Versicherungsverhältnissen ?</p>",
        "id": 153862193,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481188833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> Encounter erlaubt ja 0..* EpisodeOfCare. <br>\nIn real life wird es aber wohl durchaus so gehandhabt, dass ein neuer \"Fall\" (im Encounter-Sinn) angelegt wird. Die Frage ist: ist das deutschlandweit und über alle Use Cases so einheitlich, dass man Encounter.episodeOfCare auf 0..1 constrainen könnte?</p>",
        "id": 153862196,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481189847
    },
    {
        "content": "<p>nein nicht auf 0..1 <br>\nhatte wir schon weiter oben: Ein Encounter könnte einem DMP Fall, une einem Behandlungs/Abrechnugsfall gleichzeitig zugeordnet sein</p>",
        "id": 153862197,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481189962
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> zu dem \"doofen Gerät\": das Gerät sendet aber keine Leistungsinformation, sondern eine medizinische Information. Dort hab ich ja die Encounter-Referenz. Oder Denkfehler meinerseits?</p>",
        "id": 153862198,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481189966
    },
    {
        "content": "<p>Nein, es wird kein neuer Fall angelegt, sondern tatsächlich eine Verlegung mit Fachabteilungswechsel und begründender Diagnose, die auch zu einer §301 Meldung an die Kasse führt. Fachabteilungswechsel innerhalb eines Falles sind nicht wirklcih ungewöhnlich</p>\n<p>EpisodeOfCare ist einfach *kein* Fall ! Das wird aus der ganzen Beschreibung von EpisodeOfCare doch eindeutig klar</p>",
        "id": 153862199,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481190012
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> ja richtig, das war die andere Dimension</p>",
        "id": 153862200,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481190017
    },
    {
        "content": "<p>und im niedergelassenen Bereich passt es auch  nicht<br>\nbei einem Encounter können ganz unterschiedliche Sachen gleichzeitig behandelt werden.</p>",
        "id": 153862202,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481190147
    },
    {
        "content": "<p>Korrekt. Patient hat Grippe und bekommt, weil er gerade da ist, die Krebs-Nachsorge.</p>",
        "id": 153862203,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1481190181
    },
    {
        "content": "<p>ist da sogar eher die Regel als die Ausnahme</p>",
        "id": 153862204,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481190219
    },
    {
        "content": "<p>ein Encounter kann ja auf mehrer EofCare verweisen, dadurch hat man doch die verschiedenen Kontexte die innerhalb eines besuchs behandelt werden abgedeckt</p>",
        "id": 153862208,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481190739
    },
    {
        "content": "<p>Ja und dennoch ist EpisodeOfCare auf keinen Fall der Fall wie wir ihn kennen.</p>",
        "id": 153862209,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481191102
    },
    {
        "content": "<p>Im Sinne von Abrechnungsfall? Mit entsprechender profiliertung/extension sollte man das nutzen können. Alternativ bräuchte ich ja eine komplett neue Ressource im financial context</p>",
        "id": 153862211,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481191379
    },
    {
        "content": "<p>Was spricht gegen die Nutzung von Account für den Abrechnungsfall, auch zu besseren Abgrenzung vom medizinischen Fall (Episode of care)?</p>",
        "id": 153862215,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481191718
    },
    {
        "content": "<p>Nein, er ist dafür in keinster Weise gedacht. Die Fehlinterpretation aus Version 2 sollten wir nicht nochmal wiederholen.<br>\nIch brauche auch  keine neue Resource, zum einen haben wir einen Account der finanzielle Aspekte abbildet.<br>\nZum anderen muss man nicht zwingend noch eine Resource oberhalb von Encounter haben, denn alle Beispiele zeigen doch nur, das der Abrechnungsfall ein rein finanzielles Konstrukt ist, das nichts mit der eigentlichen Behandlung zu tun hat.</p>\n<p>Mit einer dummen Ausnahme, das im Krankenhausumfeld die Kontonummer als Identifikator für den Patienten hergenommen wird.</p>",
        "id": 153862216,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481191734
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  eigentlich nichts, bis auf den letzen Satz meines vorangegangnen Posts</p>",
        "id": 153862217,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481191787
    },
    {
        "content": "<p>Ist das schlimm? so lange der Account eindeutig einem Patienten zugeordnet ist...</p>",
        "id": 153862218,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481191842
    },
    {
        "content": "<p>Ich identifiziere Patienten ja auch anhand von anderen Identifiern, die nur indirekt den Patienten identifizieren... <br>\nz.B.: KVNR identifiziert eigentlich einen Versicherten, kann aber zur Identifikation des Patienten herhalten , da Versicherter 1..1 Patient</p>",
        "id": 153862220,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481191966
    },
    {
        "content": "<p>Ob wir den Patienten mit dem Identifier eines Encounters in Verbindung bringen oder mit dem Identifier eines Accounts ist m.E. gleich richtig/falsch, je nachdem ob man das Glas halb voll oder halb leer sehen will ;-)</p>",
        "id": 153862221,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481192071
    },
    {
        "content": "<p>Die viel interessantere Frage wäre m.E. die, ob die Account Resource geeignet wäre den UseCase eines Abrechnungsfalles abzudecken. Da diese ebenfalls in San Antonio auf der Agenda steht, schadet es nicht, dazu schon mal einen Meinung ( und einen separaten Diskussions-Thread) zu haben.</p>",
        "id": 153862222,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1481192172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> Der Debitor hängt am Versicherungsverhältnis, d.h. er wird für den Selbstzahler angelegt, aber nicht automatisch bei der Fallanlage.</p>",
        "id": 153862225,
        "sender_full_name": "Bettina Lieske",
        "timestamp": 1481192299
    },
    {
        "content": "<p>Mein Verständnis bisher war:<br>\n<strong>Encounter</strong> = Kontakt eines Patienten mit einem Healthcare Provider, das kann ein stationärer Aufenthalt sein, ein ambulanter Besuch oder auch nur eine telefonische Beratung.<br>\n<strong>EpisodeOfCare</strong> = faßt mehrere Encounters aus medizinischer Sicht zusammen, dass könnte z.B. ein aufklärendes Gespräch mit den Anästhesisten sein, dann ein stationer Aufenthalt mit OP und schließlich ein post-operativer Besuch.<br>\n<strong>Account</strong> = der Abrechnungsfall, der die Encounters ganz anders gruppieren kann als es in der EpisodeOfCare gemacht wurde.<br>\nGanz verkehrt?</p>",
        "id": 153862236,
        "sender_full_name": "Bettina Lieske",
        "timestamp": 1481194600
    },
    {
        "content": "<p>EpisodeOfCare kann 0..n Encounter haben<br>\nOb eine telefonische Beratung auch unter Encounter fällt ist sicher noch zu überlegen ansonsten passt m.E Dein Verständnis zu Encounter ganz gut.<br>\nAccount: das trifft es ziemlich gut</p>",
        "id": 153862243,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481195071
    },
    {
        "content": "<p>Dann wäre der Fachabteilungswechsel wie oben beschrieben ein neuer Encounter, mit demselben account<br>\nAlso wenn ich mal versuche einen Zeitstrahl zu schreiben:</p>",
        "id": 153862250,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481195403
    },
    {
        "content": "<p>grumpf ASCII Grafik geht nicht wirklich</p>",
        "id": 153862252,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481195569
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/yDhrmPoIDKlCcI0_44LKZvx2/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/yDhrmPoIDKlCcI0_44LKZvx2/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\"><img src=\"/user_uploads/10155/yDhrmPoIDKlCcI0_44LKZvx2/pasted_image.png\"></a></div>",
        "id": 153862253,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481195746
    },
    {
        "content": "<p>oder ein Encounter mit mehreren Locations</p>",
        "id": 153862254,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481195856
    },
    {
        "content": "<p>Nein,  Locations wären es nur bei gleicher Fachabteilung<br>\nhier wechselt ja wirklich der Behandlungskontext</p>",
        "id": 153862255,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481195908
    },
    {
        "content": "<p>ansonsten könnten wir auch die begründende Diagnose nicht unterbringen</p>",
        "id": 153862256,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481196069
    },
    {
        "content": "<p>guter Punkt</p>",
        "id": 153862257,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1481196880
    }
]