[
    {
        "content": "<p>Hallo liebe Community, hier auch direkt mein erstes Topic. Die Ressource Device wurde bis zum R4 ja leider recht stiefmütterlich behandelt und schwebt noch auf Maturity Level 0 - entsprechend viele Staubwolken schwirren auch im zugehörigen Zulip-Stream... daher frage ich mal in diese Runde.</p>\n<p>Wir stellen Geräte her, die i.d.R. entweder präklinisch oder notfallmedizinisch in der Notaufnahme verwendet werden. Neben der Übertragung von Standardressourcen (Patient, Encounter, Observation, etc.) gibt es während der Anwendung der Geräte zahlreiche Einzelereignisse, die für eine Weiterverarbeitung in Drittsystemen durchaus von Relevanz sind.<br>\nBeispiel: von einem Defibrillator werden während einer Reanimation mehrere Schocks an den Patienten abgegeben. Der Zeitpunkt jedes Schocks ist von großer Bedeutung für die medizinische Dokumentation - genauso aber auch technische Details wie bspw. die Schockenergie oder der Modus (manuell vs. semi-automatisch). Darüber hinaus gibt es auch noch weitere technische oder medizinische Ereignisse, die wir gerne in unserer FHIR Schnittstelle bereitstellen würden (Einstellungen einer Schrittmachertherapie, Dokumentationsereignisse oder auch Patientenalarme).</p>\n<p>Ergo: wir haben eine Reihe von Einzelereignissen, die irgendwie in FHIR gemapped werden müssen und ich bin mir nun unsicher, welche Ressourcen sich dafür anbieten. Um Extensions werden wir wohl nicht herum kommen, aber je mehr wir im Standard finden können, desto besser. </p>\n<p>Für die therapeutischen Ereignisse wie Schock oder Schrittmacher könnte man vielleicht noch \"Procedure\" hernehmen - würde das Sinn ergeben? Was ist mit technischen Ereignissen - hat sich damit mal jemand beschäftigt?</p>",
        "id": 156838057,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1548406048
    },
    {
        "content": "<p>Schock und Schrittmacher sind sicher als Procedure darstellbar.<br>\nBei Dokumentation oder Patientenalarm müsste man schauen, was an Inhalten drin steckt. Das könnten im ersten Ansatz Anwendungsfälle für FHIR Messaging sein, mit einem entsprechenden Event-Code in einer MessageHeader-Ressource, plus ggf. relevante Inhalte in weiteren Ressourcen, das ganze in einem Message-Bundle.<br>\nAlso z.B.  Eventcode \"Patientenalarm\", Observation \"Herzstillstand\" und als Value der Observation eine Period (von/bis), oder (je nach erforderlichen Inhalten) mit Observation.component arbeiten.</p>\n<p>Natürlich muss man hier deutlich mehr ins Detail gehen, bevor man Design-Entscheidungen trifft. Also nur als Anregung.</p>",
        "id": 156842962,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1548411805
    },
    {
        "content": "<p>In HL7 WG Health Care Devices wurde  wohl über Abbildung von Alerts mit FHIR gesprochen.</p>",
        "id": 156843300,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548412134
    },
    {
        "content": "<p>Für die Device-Ressource ist übrigens Richtung R5 ein starker Schub bei der Maturity angestrebt, soweit es die Abstimmungen auf dem Work Group Meeting vor 2 Wochen ergeben haben. Die detaillierte Roadmap für R5 wird wohl zum WGM im Mai finalisiert.</p>",
        "id": 156843420,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1548412229
    },
    {
        "content": "<p>Insofern ist natürlich jetzt die Zeit für Gerätehersteller, intensiv Feedback zu geben und ggf. an den entsprechenden Connectathon-Tracks teilzunehmen.</p>",
        "id": 156843495,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1548412316
    },
    {
        "content": "<p>siehe: <a href=\"http://hl7.org/fhir/uv/pocd/2018Sep/\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/pocd/2018Sep/\">http://hl7.org/fhir/uv/pocd/2018Sep/</a></p>",
        "id": 156843632,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548412447
    },
    {
        "content": "<p>Steht dort als \"planned future use case\" - es könnte also sinnhaft sein, sich dort zu engagieren</p>",
        "id": 156843856,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1548412697
    },
    {
        "content": "<p>Danke Stefan und Christof. Wir werden mal mit Schockereignissen als Procedure starten und schauen, wie weit wir damit kommen. Der Hinweis auf Message-Bundles ist eine gute Idee, das schaue ich mir mal genauer an.<br>\nDen PCD Implementation Guide hatte ich auch schon gesehen, nur ist da ja noch nicht viel Guidance zu lesen... Gerne können und wollen wir uns als Gerätehersteller an der weiteren Definition der Device-Ressourcen beteiligen. Wie funktioniert das am besten bzw. an wen muss ich mich wenden, um in der Workgroup mitzuwirken?</p>",
        "id": 156855099,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1548425700
    },
    {
        "content": "<p>Details zur Arbeitsgruppe: <a href=\"http://wiki.hl7.org/index.php?title=Health_Care_Devices\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Health_Care_Devices\">http://wiki.hl7.org/index.php?title=Health_Care_Devices</a></p>\n<p>Alles weitere ist im Prinzip dort verlinkt.<br>\nAnsprechpartner: <a href=\"http://www.hl7.org/Special/committees/healthcaredevices/leadership.cfm\" target=\"_blank\" title=\"http://www.hl7.org/Special/committees/healthcaredevices/leadership.cfm\">http://www.hl7.org/Special/committees/healthcaredevices/leadership.cfm</a> (dürften auch hier im Chat erreichbar sein).</p>\n<p>Mailingliste:  <a href=\"http://www.hl7.org/myhl7/managelistservs.cfm\" target=\"_blank\" title=\"http://www.hl7.org/myhl7/managelistservs.cfm\">http://www.hl7.org/myhl7/managelistservs.cfm</a><br>\n(Dazu benötigt man einen kostenlosen Account auf <a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a>)</p>",
        "id": 156856026,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1548426667
    },
    {
        "content": "<p>Natürlich freuen wir uns seitens des deutschen TC FHIR auch, wenn wir ggf. Deutschland-spezifische Dinge in die deutschen Basisprofile ergänzen können :)</p>",
        "id": 156856141,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1548426778
    },
    {
        "content": "<p>Hallo und Willkommen Christoph!</p>",
        "id": 156856418,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1548427032
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> ist im Leadership der Gruppe genannt <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> sind hier anstehende Aktivitäten geplant, wo man als Einsteiger gut loslegen könnte?</p>",
        "id": 156856529,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1548427136
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> Danke - langsam nehmen wir Fahrt auf <span aria-label=\"rock on\" class=\"emoji emoji-1f918\" role=\"img\" title=\"rock on\">:rock_on:</span></p>",
        "id": 156856560,
        "sender_full_name": "Christoph Graumann",
        "timestamp": 1548427181
    },
    {
        "content": "<p><img alt=\":fhir:\" class=\"emoji\" src=\"https://zulip-avatars.s3.amazonaws.com/10155/emoji/images/1.png\" title=\"fhir\"></p>",
        "id": 156856580,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1548427200
    },
    {
        "content": "<p>Ich bin formal immer noch \"Vocabulary Facilitator\" für die WG. Das beruht auf den besagten Aktivitäten rund um UCUM und Maßeinheiten vor einigen Jahren.</p>",
        "id": 156856739,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1548427320
    },
    {
        "content": "<p>Im Zweifel einen der Co-Chairs fragen.<br>\nFacilitators sind quasi die Verbindungsleute zu anderen Arbeitsgruppen.</p>",
        "id": 156857118,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1548427611
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"197231\">@Christoph Graumann</span>, die \"Devices-on-FHIR\" Workgroup hat ihre wöchentlichen Webmeetings mittwochs von 9:30 bis 10:30 ET (15:30 bis 16:30 MEZ) auf <a href=\"http://FreeConferenceCall.com\" target=\"_blank\" title=\"http://FreeConferenceCall.com\">FreeConferenceCall.com</a>, Meeting ID \"devicesonfhir\". Dein Feedback ist dort herzlich willkommen!</p>",
        "id": 156858123,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1548428425
    }
]