[
    {
        "content": "<p>Hallo an alle,<br>\nich habe die Ehre, dass ich in den kommenden Wochen ein FHIR-Profil bauen darf und mich generell mehr mit dem Thema auseinandersetzen darf. Mit FHIR hatte ich noch keine Berührungspunkte. An den FHIR DevDays durfte ich auch teilnehmen, um einen ersten Überblick zu erhalten.</p>\n<p>Jetzt wollte ich einfach mal die Frage in den Raum werfen wer schon selber ein FHIR Profil erstellt hat? <br>\nHabt ihr Tipps / Tricks / etc. worauf ich bei sowas achten sollte? Fehler die von vornerein vermeidbar sind?</p>\n<p>Zusätzlich tue ich mich auch etwas schwer in diese Materie einzusteigen. Denke aber, dass es mir einfach ein wenig die praktische Erfahrung fehlt. </p>\n<p>Bitte teilt mit mir eure Erfahrungen. Danke! :)</p>",
        "id": 218549224,
        "sender_full_name": "Christian Wollmann",
        "timestamp": 1606912345
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"364895\">@Christian Wollmann</span>, willkommen bei FHIR.<br>\nFür die Erstellung eines oder mehrerer Profile sind folgende Fragen u.a. aus meiner Sicht leitend:</p>\n<ul>\n<li>Was ist mein UseCase?</li>\n<li>Was sind meine Daten und Informationen und wie hängen diese zusammen?</li>\n<li>Welche Ressourcen benötige ich, um die Informationen abzubilden?</li>\n<li>Was gibt es schon auf nationaler und internationaler Ebene, was ich wiederverwenden kann?</li>\n<li>Wie sieht es aus mit Terminologie?</li>\n<li>Inwieweit muss ich die Ressourcen anpassen, damit sie zu meinen Daten und Datenstrukturen passen?</li>\n</ul>\n<p>Das sind bei weitem noch nicht alle Fragen, die man sich stellen muss, aber vermutlich die ersten.</p>\n<p><strong>Was ist mein UseCase?</strong><br>\nDiese Frage klingt vielleicht trivial, weil man selbst den UseCase schon im Hinterkopf hat. Es sich noch einmal aufzuschreiben, kann aber nicht schaden. Will ich Dokumente transportieren? Will ich eine Schnittstelle definieren und festlegen/kommunizieren, was die Schnittstelle können soll/kann? In welchem Bereich bewege ich mich: Ambulant, stationär, intersektoral, interprofessionell, ärztlich, pflegerisch ...? Definiere ich nur lokal oder regional, oder soll das, was ich definiere, national genutzt werden?</p>\n<p><strong>Was sind meine Daten und Informationen und wie hängen diese zusammen?</strong><br>\nEs ist auch immer hilfreich, sich vor Augen zu führen, was man eigentlich darstellen will. In der Diskussion mit anderen entdeckt man vielleicht auch das eine oder andere, was nicht so ganz passt, oder bemerkt fehlende Attribute. Diese Diskussion kann offen oder auch nur innerhalb der eigenen Einrichtung geführt werden, das hängt auch von der Reichweite ab,</p>\n<p><strong>Welche Ressourcen benötige ich, um die Informationen abzubilden?</strong><br>\nFür diese Frage sollte man die einzelnen Ressourcen von FHIR anschauen und ihren jeweiligen Scope. Eine Übersicht gibt es hier: <a href=\"http://hl7.org/fhir/resourcelist.html\">http://hl7.org/fhir/resourcelist.html</a>. Mitunter kann es auch helfen, hier im Chat zu schauen (Suche, auch international), ob dort schon Fragen in diese Richtung gestellt und diskutiert wurden.</p>\n<p><strong>Was gibt es schon auf nationaler und internationaler Ebene, was ich wiederverwenden kann?</strong><br>\nBei unseren Bemühungen sollte Interoperabilität nicht nur zwischen zwei Einrichtungen bzw. einer Schnittstelle, sondern auch auf nationaler und internationale Ebene eine Rolle spielen. Daher sollten nationale Entwicklungen bei der eigenen Erstellung von Profilen eine wichtige Rolle spielen. Für Deutschland gibt es beispielsweise die Deutschen Basisprofile von HL7 Deutschland (<a href=\"https://simplifier.net/Basisprofil-DE-R4/\">https://simplifier.net/Basisprofil-DE-R4/</a>), die man für die eigene Profilierung verwenden darf. Auf internationaler Ebene gibt es zu einigen Ressourcen schon Standard-Erweiterungen (Extensions), die einzelne Ergänzungen schon berücksichtigen, aber die 80%-Regel nicht erfüllen. Bei ähnlichem Use-Case sind diese bevorzugt zu verwenden. Auch kann es sein, dass der eigene oder ein ähnlich gelagerter Use Case schon woanders bearbeitet wurde / wird und man sich von dort Profile oder Ideen holen kann. Dazu gibt es zum Einen die FHIR Registry (<a href=\"https://registry.fhir.org/\">https://registry.fhir.org/</a>) oder die FHIR Implementation Guide Registry (<a href=\"https://www.fhir.org/guides/registry/\">https://www.fhir.org/guides/registry/</a>), aber auch eine Suche bei simplifier lohnt sich (<a href=\"https://simplifier.net/\">https://simplifier.net/</a>). </p>\n<p><strong>Wie sieht es aus mit Terminologie?</strong><br>\nJe nach UseCase kann Terminologie eine mehr oder weniger wichtige Rolle spielen. Fakt ist jedoch: Irgendwann kommt man nicht mehr drum herum. Wenn man z.B. Conditions oder Observations hat, braucht man einen Code, um diese zu spezifizieren: Um was für eine Condition handelt es sich? Was wurde beobachtet? Dazu sollte man nach Möglichkeit (inter)nationale Standards verwenden, z.B. SNOMED CT, LOINC oder ICD-10-GM. Auch dies ist wieder abhängig vom UseCase und der jeweils abzubildenden Information.</p>\n<p><strong>Inwieweit muss ich die Ressourcen anpassen, damit sie zu meinen Daten und Datenstrukturen passen?</strong><br>\nDies ist der Teil, der am aufwändigsten ist: das eigentliche Profiling. Hierzu gibt es eine gute Vorbereitung in der Profiling Academy von simplifier (<a href=\"https://simplifier.net/guide/profilingacademy/home\">https://simplifier.net/guide/profilingacademy/home</a>). Hier sind die wichtigsten Punkte erläutert. Als Tool wird dort Forge verwendet, veröffentlicht werden können die Profile auf simplifier. Aus eigener Erfahrung: Je tiefer man sich mit der Frage nach den Informationen und deren Zusammenhängen beschäftigt hat, desto einfacher ist die Profilierung, weil man genauer weiß, was man machen will/muss.</p>\n<p>Ich denke, damit habe ich meine Haupterfahrungen zusammengefasst. Ich denke, viele Fragen selbst ergeben sich erst während der Profilierung selbst und können dann in diesem Forum (sowohl national als auch international) geklärt werden. Was aber natürlich nicht bedeuten soll, dass einzelne Tipps nicht auch eingebracht werden dürfen <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> <br>\nViele Grüße</p>",
        "id": 218555908,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1606916046
    },
    {
        "content": "<p>Ausdrucken, einrahmen, aufhängen! <br>\n<span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 218625047,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1606945895
    },
    {
        "content": "<p>Hallo und vielen Dank für die sehr ausführliche Antwort. Damit habe ich gar nicht gerechnet. :D <br>\nHat mir aufjedenfall sehr geholfen.</p>",
        "id": 218974170,
        "sender_full_name": "Christian Wollmann",
        "timestamp": 1607239861
    },
    {
        "content": "<p>Gerne doch. Bei weiteren Fragen gerne wieder hier in zulip melden. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 219021131,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1607289948
    },
    {
        "content": "<p>Schöner Beitrag, in dem sich u. a. ein Entscheidungsbaum findet, wann man welche Profile schreibt - und wann besser nicht:<br>\n<a href=\"https://www.devdays.com/wp-content/uploads/2020/12/iuide_201117_yvind_Aassve_Making_FHIR_work_at_the_national_level.pdf\">https://www.devdays.com/wp-content/uploads/2020/12/iuide_201117_yvind_Aassve_Making_FHIR_work_at_the_national_level.pdf</a></p>",
        "id": 219233604,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1607447474
    }
]