[
    {
        "content": "<p>Test</p>",
        "id": 153820040,
        "sender_full_name": "Klaus Urban",
        "timestamp": 1459947694
    },
    {
        "content": "<p>Funktioniert :)</p>",
        "id": 153820041,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459947713
    },
    {
        "content": "<p>reTest :)</p>",
        "id": 153820042,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1459947735
    },
    {
        "content": "<p>Hi, </p>\n<p>mangels besseren Wissens schreibe ich einfach mal in diesem Topic hier, ich hoffe das passt.<br>\nBin ein \"German Beginner\" in Sachen FHIR und tue mich etwas schwer den richtigen Zugang zu finden. Vielleicht kann mir ja mal jemand etwas auf die Sprünge helfen.</p>\n<p>Mein Ziel ist mit Forge zu modellieren und dabei auf bereits vorhandene Modelle in der offiziellen HL7 FHIR Registry zuzugreifen, um passendes zu verwenden, statt es neu anzulegen. Ergebnisse dann in einem Simplifier-Projekt zu speichern und dann in einen Testserver wie HAPI FHIR einzuspielen um Instanzen der modellierten Ressourcen via REST anzulegen, zu validieren etc.<br>\nEin passendes Tutorial dazu habe ich nicht gefunden und andere Tools mit denen man das machen kann, habe ich auch nicht gefunden. <br>\nbtw, als Mac User frage ich mich auch ob es neben Forge auch noch was für Mac gibt... (bis dahin Virtual Box).</p>\n<p>Ich habe Forge nun installiert und ein eigenes Projekt in <a href=\"http://Simplifier.net\" target=\"_blank\" title=\"http://Simplifier.net\">Simplifier.net</a> angelegt, Export von Forge in dieses Projekt funktioniert.<br>\nWürde nun gerne in Forge auf die offiziellen Modelle zugreifen, diese importieren und wo nötig profilieren aber unklar wie das geht.</p>\n<p>Dachte dann, man müsse vielleicht erst in sein eigenes Simplifier Projekt was importieren oder \"forken\" (github grüßt), um es danach nutzen zu können. Scheint aber auch nicht zu gehen.</p>\n<p>Konkrete Frage daher: wie kann man z.B. die Patient Ressource <a href=\"http://hl7.org/fhir/patient.html\" target=\"_blank\" title=\"http://hl7.org/fhir/patient.html\">http://hl7.org/fhir/patient.html</a> in Forge importieren, um sie dann anzupassen?</p>\n<p>VG Torsten</p>",
        "id": 154017458,
        "sender_full_name": "Torsten Schmale",
        "timestamp": 1541949746
    },
    {
        "content": "<p>Hallo Torsten,<br>\nhier bist du genau richtig, Willkommen in der Community :)</p>\n<p>Was mir noch nicht ganz klar ist aus Deiner Fragestellung:<br>\nMöchtest du Profile basierend auf anderen Profilen (z.B. Basisprofile-DE oder IHE-MHD) erstellen oder basierend auf den Ressourcen der FHIR-Spezifikation?</p>\n<p>In letzterem Falle brauchst du gar nichts zu Importieren, denn die Ressourcen sind in Forge bereits \"eingebaut\". <br>\nGeh einfach auf File &gt; new Profile und wähle die Ressource aus, die du profilieren möchtest.<br>\nWenn du bspw. auf den Deutschen Basisprofilen aufsetzen möchtest, müsstest du am einfachsten das gesamte Projekt herunterladen (auf der Startseite des Projektes <a href=\"https://simplifier.net/BasisprofilDE\" target=\"_blank\" title=\"https://simplifier.net/BasisprofilDE\">https://simplifier.net/BasisprofilDE</a> über den Link \"download &gt; ZIP valid resources as XML\"), in einem Unterordner deines Forge-Projektes speichern und dann mit File &gt; new derived Profile darauf ein abgeleitetes Profil erstellen.</p>\n<p>...kennst du schon die Profiling Academy? <a href=\"https://simplifier.net/guide/profilingacademy/modules\" target=\"_blank\" title=\"https://simplifier.net/guide/profilingacademy/modules\">https://simplifier.net/guide/profilingacademy/modules</a></p>\n<p>Hier kann man Profiling Erklär-Bären mieten:<br>\n<a href=\"https://www.gefyra.de/p/unser-schulungsangebot.html\" target=\"_blank\" title=\"https://www.gefyra.de/p/unser-schulungsangebot.html\">https://www.gefyra.de/p/unser-schulungsangebot.html</a><br>\n(FHIR für Spezifizierer) </p>\n<p>...oder einfach hier weiterfragen ;-)</p>",
        "id": 154017470,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1541959406
    },
    {
        "content": "<p>Hallo Simone,<br>\nDanke für doe freundliche Aufnahme und die Infos.<br>\nHat mir insofern schon mal geholfen, dass mir jetzt klar ist wo man die Modelle her bekommt und wie man sie in Forge importiert.<br>\nKann man die Modell nur im Simplifier downloaden oder auch direkt von <a href=\"http://h7.org/fhir\" target=\"_blank\" title=\"http://h7.org/fhir\">h7.org/fhir</a> ?</p>\n<p>Hintergrund:<br>\nwir überlegen ob wir die Business Objekte für ein neues Facharztmodul direkt in der FHIR-Welt modellieren. Wenn die FHIR-Tools brauchbar sind (wovon ich ausgehe), dann hat das  Vorteile für die spätere Integration und Mapping. Insofern geht es weniger um Profiling im engeren Sinne, sondern um Modeling mit Rückgriff auf bereits vorhandene Datentypen und Value Sets.</p>\n<p>Profiling Academy hatte ich gesehen. Hänge momentan aber noch am Grundverständnis: StructureDefinition, Snapshots, Slices etc. <br>\nGibt es ein Tutorial dafür? Also quasi die \"Grundschule\" bevor man sich mit der \"Academy\" beschäftigt?</p>\n<p>FHIR Einführung hatten wir zuletzt auf dem DIT ja gehabt. Sollte zunächst mal reichen, um die ersten Schritte hier zu machen (hoffe ich jedenfalls). Die Erklär-Bären werden wir auch noch brauchen, wenn wir das VO-Modul umsetzen.</p>\n<p>VG Torsten</p>",
        "id": 154017474,
        "sender_full_name": "Torsten Schmale",
        "timestamp": 1541971318
    },
    {
        "content": "<p>Ich würde meine Kollegen gerne davon überzeugen, dass die eigene Implementierung eines FHIR-Servers unwirtschaftlich ist.<br>\nDas ist zur Zeit meine Überzeugung :) ..kenne mich aber leider nicht gut genug aus.<br>\nMein Vorschlag einen Hapi bzw. Vonk - Server zu nutzen, der via Facade unsere Daten in FHIR dupliziert stößt auf Unverständnis.</p>\n<p>Bisher habe ich angeführt, dass Search, FHIR-Versionierung und Historisierung große Baustellen sind, die man als PVS-Hersteller eher abgeben sollte. Zudem ist der zukünftige Pflegeaufwand garnicht einzuschätzen. Mapping der bestehenden Datenstruktur zu KBV Profilen (ValueSets, etc) muss bei beiden Varianten geschehen, denke ich.</p>\n<p>Ich bin für weitere Gründe/Argumentationen pro/contra eigener Implementierung eines FHIR Servers sehr dankbar.</p>",
        "id": 154020109,
        "sender_full_name": "Marco Rudolph",
        "timestamp": 1542798325
    },
    {
        "content": "<p>Willkommen Marco,<br>\nich bin deiner Meinung. Search API, Operations, Versioning, Validierung sowie Valueset bzw Codesystem Handling sind alles keine trivialen Aspekte, die in der Implementierung ordentlich Zeit kosten werden.<br>\nNächster Punkt wäre Standardkompatibilität: nutzt man vorhandene Server oder Facades wurden diese bereits eingehend auf Standardkompatibilität getestet, den eigenen Server müsste man hier kontinuierlich integration testen um zu merken ob man einen Aspekt des Standards etwas anders interpretiert hat als vorgesehen.<br>\nEbenso bezweifle ich, dass es sich unter dem Aspekt: Kosten lohnt hier selbst zu entwickeln.</p>",
        "id": 154020112,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1542800367
    },
    {
        "content": "<p>Hallo Marco, ich teile ebenfalls Deine Auffassung und möchte noch zwei Aspekte hinzufügen: mit gereiften Fassaden, die bereits von verschiedenen Herstellern in verschiedenen Kontexten genutzt werden, erhält man wesentlich bessere Softwarequalität, als wenn man nochmal ganz von vorne anfängt. Außerdem: die Wechselschnittstelle wird nicht die einzige FHIR Schnittstelle bleiben. Würde man selbst implementieren, konzentriert man sich vermutlich zunächst auf die dort geforderten Funktionen und merkt vielleicht später erst, dass man zu kurz gedacht hat. Fassaden sind deutlich Zukunftssicherer, da dort bereits alle Funktionen, auch die, die nicht Bestandteil der KBV-Spezifikation sind, bedacht wurden.</p>",
        "id": 154020130,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542802200
    },
    {
        "content": "<p>Weiterhin: Wenn mehrere Entwickler mit den gleichen Werkzeugen versuchen, die gleichen Probleme zu lösen, dann besteht die Chance, eine Community zu entwickeln, in der man sich gegenseitig unterstützt. (Ich weiß, das ist in der Deutschen Unternehmenskultur so nicht üblich, aber wir können uns ja mal eine Scheibe Mut vom Argonaut-Projekt abschneiden ;-) ) Je mehr wir zusammenarbeiten, um so schneller geht's und um so kostengünstiger wird die Umsetzung der Schnittstellen. Das sollte eigentlich im Interesse Aller sein :)</p>\n<p>Ich denke, dass viele den Fehler machen, auf den ersten Blick anzunehmen, dass die Implementierung von FHIR <em>einfach</em> wäre. Natürlich ist das auch eines der \"Verkaufsargumente\" für FHIR, aber es gilt im konkreten Fall der KBV-Spezifikation leider nur bedingt.<br>\nFHIR ist in so fern <em>einfach</em>, dass es gut skaliert und einfache Probleme einfach gelöst werden können. Aber um's mit den Worten unseres Meister Yoda zu sagen: \"You can move complexity around but you can't make it go away\".<br>\nFür FHIR bedeutet das, dass man versucht, Komplexitäten von den i.d.R. einfach gestrickten Client-Anwendungen fernzuhalten und auf die Server-Seite zu verlagern. Nun fordert die KBV-Schnittstelle aber leider die PVS-Systeme in die Server-Rolle.<br>\nEin weiterer Punkt, der FHIR <em>einfach</em> macht ist, dass es eine engagierte Entwicklercommunity und zahlreiche Tools, Bibliotheken und Frameworks gibt, die verwendet werden können, um die Implementierung zu vereinfachen und zu beschleunigen. Wer diese jedoch verschmäht, muss sich darauf gefasst machen, dass FHIR weder einfach noch schnell zu implementieren ist. Also nur noch \"HIR\", genau genommen....</p>",
        "id": 154020169,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542807291
    },
    {
        "content": "<p>Hallo, ich gehöre dann wohl auch zu den German Beginners.<br>\nIch schreibe gerade meine Masterarbeit. In dieser dreht sich alles um die Datenübertragung zwischen den Klinischen Krebsregistern und der Bundeauswertungsstelle (IQTIG). Übertragen werden sollen ausgewählte Daten des ADT/GEKID-Basisdatensatzes und des organspezifischen Moduls Prostatakarzinom. Realisiert wird das Ganze mit FHIR.<br>\nFür die Modellierung meiner Ressourcen habe ich Forge verwendet, dazu habe ich mir Projekte angesehen, die ähnliche Ansätze haben bzw. sich mit ähnlichen Themen auseinandersetzen (Care Cancer Record on FHIR, oncology der DKTK). Mittlerweile bin ich mit der Modellierung meiner Ressourcen fast fertig und habe soweit alles verstanden. Eine wichtige Frage konnte ich mir jedoch noch nicht beantworten, dabei geht es um die Resource Observation. Warum muss bei Observation.code bspw. auf LOINC und einen entsprechenden Code verwiesen werden? Welchen Hintergrund und Zweck hat dies?<br>\nAufgefallen ist mir dies vor allem auch bei der TNM-Klassifikation. Dort werden die jeweiligen Werte (T,N,M, etc.) mit Hilfe von slicing als component einer Observation angelegt. Auch dort sollte bspw. unter Observation.component:TMT-T.code ein Verweis auf LOINC und einen entsprechenden Code erfolgen. Warum dieser erfolgen sollte ist mir leider noch unklar.<br>\nNun hoffe ich auf eine einfache Erklärung. Danke <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span><br>\nViele Grüße, Luise</p>",
        "id": 197666046,
        "sender_full_name": "Luise Oeppert",
        "timestamp": 1589534311
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"238510\">@Luise Oeppert</span>, herzlich willkommen im Chat.</p>\n<p>Um Deine Frage zu beantworten, muss man sich überlegen, wie die einzelnen Ressourcen, die tatsächlich übermittelt werden, aussehen. <br>\nIch habe dazu einmal zwei Beispiele:</p>\n<ul>\n<li>Pflegegrad nach den deutschen Basisprofilen: <a href=\"https://simplifier.net/basisprofil-de-r4/observation-pflegegrad\">https://simplifier.net/basisprofil-de-r4/observation-pflegegrad</a></li>\n<li>Gesamtergebnis Braden-Skala: <a href=\"https://simplifier.net/germanenursingsummary/observation-braden\">https://simplifier.net/germanenursingsummary/observation-braden</a></li>\n</ul>\n<p>Wenn man die beiden nebeneinander legt, wird man feststellen, dass diese sich primär im Code und ggf. noch im Value unterscheiden. </p>\n<p>Um nun entscheiden zu können, was genau in der Observation transportiert werden soll, wird der Code verwendet. So sagt im ersten Beispiel der Code, dass es sich um einen Pflegegrad handeln soll, im zweiten Fall, dass es sich um einen Wert für die Braden-Skala handelt. </p>\n<p>Nun könnte man natürlich sagen: Da reicht ein Text aus für den Menschen. Da aber die Ressourcen auch von einem PC verstanden werden sollen, ist ein internationaler Code besser, da dieser international verständlich ist (auch in China oder den USA) und der Code unabhängig vom Text auch immer gleich ist.</p>\n<p><strong>Kurz zusammengefasst: Der Code ermöglicht es den empfangenden Systemen, zu verstehen, worum es in der Observation geht.</strong></p>\n<p>Dies gilt auch bei Observations, die primär aus Components bestehen, da auch hier gesagt werden muss, worum es geht. Die Components liefern dann aufgesplittet die Einzelinformationen, aus denen sich die Observation zusammensetzt. <br>\nAnderes Beispiel dazu aus dem Bereich Wundversorgung: Die Wundgröße besteht aus Länge, Breite, Fläche und ggf. Wundtiefe. Die Observation bekommt den Code für die Wundgröße, damit die Systeme wissen: \"Okay, hier kommt eine Wundgröße\". Die Components enthalten dann den Code für Länge, Breite, Fläche bzw. Tiefe und die entsprechenden Angaben.</p>\n<p>Ich hoffe, ich konnte Dir helfen. Wenn nicht: Trau Dich, mache einen Thread auf und frage dezidierter nach.</p>",
        "id": 197667569,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1589535185
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"238510\">@Luise Oeppert</span> ,<br>\nauch von mir ein fröhliches \"Willkommen\"!</p>\n<p>Da in DE momentan einige Projekte parallel am Thema Onkologie arbeiten, haben wir kürzlich dafür einen separaten Stream eröffnet: <a href=\"#narrow/stream/224719-german.2Foncology\">https://chat.fhir.org/#narrow/stream/224719-german.2Foncology</a></p>\n<p>Da ist zwar noch nicht allzuviel Aktivität, aber vielleicht gelingt es Dir etwas Schwung hinein zu bringen <span aria-label=\"smirk\" class=\"emoji emoji-1f60f\" role=\"img\" title=\"smirk\">:smirk:</span> </p>\n<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span>  in Bezug auf \"ADT/GEKID on FHIR\" läuft doch auch schon was, oder...?</p>",
        "id": 197668151,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1589535525
    },
    {
        "content": "<p>ADT-GEKID ist im Grunde Bestandteil unserer Onkologie-Arbeitsgruppe, die unter anderem auch die Cancer Care- und DKTK-Profile vereinen möchte.<br>\nDa sind auch Vertreter der Krebsregister und der ADT beteiligt, von daher: ja, ganz sicher ;)</p>",
        "id": 197669544,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1589536441
    },
    {
        "content": "<p>Mappings von ADT-GEKID auf FHIR (CCR) sind auch in Arbeit -&gt; <span class=\"user-mention\" data-user-id=\"192900\">@Alexander Zautke</span></p>",
        "id": 197670565,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1589536994
    },
    {
        "content": "<p>Das erste Mapping hatte <span class=\"user-mention\" data-user-id=\"192064\">@Stefan Sigle</span> bei uns begonnen: <a href=\"https://docs.google.com/spreadsheets/d/1-_mr3Jd_buxEt-xsnHwoWcPYhRkSfie7sE91H-aWZ8o/edit#gid=0\">https://docs.google.com/spreadsheets/d/1-_mr3Jd_buxEt-xsnHwoWcPYhRkSfie7sE91H-aWZ8o/edit#gid=0</a></p>",
        "id": 197670811,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1589537135
    },
    {
        "content": "<p>ist aber noch sehr sehr WIP</p>",
        "id": 197670833,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1589537149
    },
    {
        "content": "<p>Danke für die Antworten.</p>\n<p><span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span> Deine Antwort war sehr hilfreich. Danke dafür, das hilft mir auf jeden Fall weiter. </p>\n<p>Den anderen Strem kenne ich bereits, war mir aber unsicher wo ich das Thema anbringen soll. Deshalb ist es hier gelandet.</p>",
        "id": 197676696,
        "sender_full_name": "Luise Oeppert",
        "timestamp": 1589541499
    },
    {
        "content": "<p>Das war auf keinen Fall falsch! Erhöht die allgemeine Aufmerksamkeit für den neuen Stream :)</p>",
        "id": 197678173,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1589542490
    },
    {
        "content": "<p>Hallo, ich bin mir nicht sicher in welchen Stream meine Frage am besten passen könnte, deshalb stelle ich sie einfach mal hier.  Und zwar möchte ich ein Medizinprodukt mit der Device Resource abbilden. Da jedes Medizinprodukt eine eigene Klassifizierung laut Medizinproduktegesetz hat, möchte ich diese auch angeben. Gibt es hierfür schon ein eigenes CodeSystem, bzw. welches Element der Resource wäre dafür am besten geeignet?</p>",
        "id": 197923136,
        "sender_full_name": "Armin Griebler",
        "timestamp": 1589803278
    }
]