[
    {
        "content": "<p><a href=\"http://wiki.hl7.org/index.php?title=IG_Publisher_Documentation#Language_Support\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=IG_Publisher_Documentation#Language_Support\">http://wiki.hl7.org/index.php?title=IG_Publisher_Documentation#Language_Support</a> - comments welcome before I start developing</p>",
        "id": 153880582,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490941953
    },
    {
        "content": "<p>Regarding passing untranslated text to an internal translation service: that means some dictionary based automated translation, right?<br>\nAutomation can go horribly wrong, and IGs describe standards, where subtle changes in meaning may be important.</p>\n<p>So I suggest leaving automated translation optional either to the user (who in return would get a button in the UI saying \"translate that for me\") or possibly to leave that decision to the IG editor. Like, a parameter \"automated-translation\" with the options \"disallow\", \"user-select\" and \"force\".</p>",
        "id": 153880589,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1490946649
    },
    {
        "content": "<p>the internal translation service uses a map file edited by the IG author. If the author doesn't probvide a translation, no translation happens</p>",
        "id": 153880631,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490990278
    },
    {
        "content": "<p>I see. So I misinterpreted the following, still undefined, part (\"Sharing Language Translations Across IGs\")</p>",
        "id": 153880634,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1490996372
    },
    {
        "content": "<p>well, I had not thought to introduce anything but manual translation there - no automatic service </p>",
        "id": 153880642,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491013812
    },
    {
        "content": "<p>I still remember the sign on the eiffel tower auto-translated from Frnech explaining that the tower was fallen due to it's genes (or something like that - my rudimentary french was enough to figure out that the really wanted to say 'closed due to work', forget the exact wrong implication in the translation)</p>",
        "id": 153880643,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491013890
    },
    {
        "content": "<p>Such things are what I was afraid of ;-) But maybe the term \"translation service\" is misleading and needs to be clarified</p>",
        "id": 153880649,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1491056623
    }
]