[
    {
        "content": "<p>Zwei IHE-Profile on FHIR (STU3) stehen seit gestern bis zum 16.06. zur Kommentierung:<br>\n- Mobile Care Services Discovery (mCSD)<br>\n- Non-patient File Sharing (NPFS)<br>\n<a href=\"http://ihe.net/Public_Comment/?utm_source=Technical+Frameworks&amp;utm_campaign=5cd2f88cc3-EMAIL_CAMPAIGN_2017_05_17&amp;utm_medium=email&amp;utm_term=0_16719e7a1e-5cd2f88cc3-432633181#IT\" target=\"_blank\" title=\"http://ihe.net/Public_Comment/?utm_source=Technical+Frameworks&amp;utm_campaign=5cd2f88cc3-EMAIL_CAMPAIGN_2017_05_17&amp;utm_medium=email&amp;utm_term=0_16719e7a1e-5cd2f88cc3-432633181#IT\">http://ihe.net/Public_Comment/?utm_source=Technical+Frameworks&amp;utm_campaign=5cd2f88cc3-EMAIL_CAMPAIGN_2017_05_17&amp;utm_medium=email&amp;utm_term=0_16719e7a1e-5cd2f88cc3-432633181#IT</a><br>\nWer sich berufen fühlt, möge sich gern dort einlesen.<br>\nIch denke insbesondere an das Provider Directory, über das wir auch schon mal diskutiert haben und das mit mCSD korrespondiert.</p>",
        "id": 153890355,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495096614
    },
    {
        "content": "<p>Profiling by PDF... <img alt=\":cry:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/cry.png\" title=\":cry:\"> </p>",
        "id": 153890358,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495098741
    },
    {
        "content": "<p>Die Verwendung des Begriffes \"Message\" im Kontext von HTTP GET, daran muss man sich auch erst mal gewöhnen ;-)<br>\nIch dachte erst, die CSD-Anfrage basiert auf dem Messaging-Paradigma! </p>",
        "id": 153890369,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495107113
    },
    {
        "content": "<p>Aber ich denke, das ist ein wirklich schön übersichtlicher UseCase mit einem klar umrissenen Umfang an Resourcen und Such-Parametern, der es den Implementieren leicht machen sollte, den Einstieg zu finden. Ich hoffe, dass IHE die Profile und CapabilityStatements noch nachliefert. Abtippen ist so V2...</p>",
        "id": 153890370,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495107304
    },
    {
        "content": "<p>Das Wording im IHE-Kontext ist in der Tat ein ganz anderes ;)<br>\nEin IHE-Profil ist ja auch was ganz anderes als (z.B.) ein FHIR-Profil (\"An IHE Profile is equivalent to a FHIR Implementation Guide.\").<br>\nOb IHE grundsätzlich FHIR-Profile in Form einer Ressource liefert/liefern will, weiß ich gar nicht ... Immerhin sind ja in den \"Resource Constraints\"-Tabellen tatsächlich FHIR-Profile beschrieben, und für Conformance-Tests wäre doch der per FHIR standardisierte Weg, FHIR-Ressourcen zu validieren, eigentlich der beste ^^<br>\nSollte man (wir) das evtl. als Kommentar einbringen? </p>",
        "id": 153890396,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495121517
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> am WGM in San Antonio dieses Jahres hat es Gespräche zu diesem Thema gegeben zw. HL7 und IHE. Inhalt des Gesprächs war u.a., dass durch die verstärkte Nutzung von FHIR durch die IHE es sinnvoll wäre, wenn IHE ihre Profile als Implementation Guides bei HL7 veröffentlichen würde. Die Stimmung war grundsätzlich positiv dazu. <br>\nEs gibt auch mittlerweile in den diversen IHE Googlegroups angeregte Diskussionen dazu, v.a. in Anbetracht der neuen Versionen von MHD, PIXm &amp; PDQm. Eine offizielle Entscheidung ist aber, soweit ich weiß, noch nicht gefallen.<br>\nBeste Grüße aus Österreich</p>",
        "id": 153891152,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1495638054
    },
    {
        "content": "<p>D.h. man kann das als \"in der Mache\" betrachten, oder wäre es sinnvoll, mit Hilfe eines Kommentars noch einmal zu \"pushen\"?</p>",
        "id": 153891155,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495638165
    },
    {
        "content": "<p>John Moehrke hat es in einem der Diskussionsthreads mal so formuliert:<br>\n\"IHE is investigating the use of Forge and HL7 registry. This is an organization level discussion at this point. I appreciate all IHE membership that can encourage IHE leadership to support this kind of an effort. Please express exactly why you find this important, so that IHE leadership can see the benefit.\"<br>\nEvtl. lässt sich bei euch etwas über die neue Kooperationsplattform IHE &amp; HL7 Deutschland was einkippen? </p>",
        "id": 153891165,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1495639184
    },
    {
        "content": "<p>--&gt;Agenda Interop</p>",
        "id": 153891180,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1495647952
    },
    {
        "content": "<p>daselbst ergänzt</p>",
        "id": 153891186,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1495651236
    }
]