[
    {
        "content": "<p>Hinweis zum <a href=\"https://simplifier.net/basisprofil-de-r4/conditiondeicd10\" target=\"_blank\" title=\"https://simplifier.net/basisprofil-de-r4/conditiondeicd10\">ICD10-Condition-Profil</a> unter R4:<br>\nBei Verwendung der <a href=\"https://simplifier.net/basisprofil-de-r4/icd10gmdiagnosesicherheit\" target=\"_blank\" title=\"https://simplifier.net/basisprofil-de-r4/icd10gmdiagnosesicherheit\">Extension Diagnosesicherheit</a> werden jetzt folgende Regeln geprüft, um die Äquivalenz der Angaben in der Extension zu clinicalStatus und verificationStatus sicherzustellen:</p>\n<ul>\n<li>\n<p>icd-4:Wenn die Diagnosesicherheit \"A (Ausschluss)\" verwendet wird, dann muss clinicalStatus leer bleiben und verificationStaus auf \"refuted\" gesetzt werden.<br>\ncode!='A' or (%resource.verificationStatus.coding.where(code='refuted').exists() and %resource.clinicalStatus.empty())</p>\n</li>\n<li>\n<p>icd-5:Wenn die Diagnosesicherheit \"G (Gesichert)\" verwendet wird, dann muss clinicalStatus auf \"active\" und verificationStatus auf \"confirmed\" gesetzt werden.<br>\ncode!='G' or (%resource.clinicalStatus.coding.where(code='active').exists and %resource.verificationStatus.coding.where(code='confirmed').exists())</p>\n</li>\n<li>\n<p>icd-6:Wenn die Diagnosesicherheit \"V (Verdacht auf)\" verwendet wird, dann muss clinicalStatus auf \"active\" und verificationStatus auf \"provisional\" gesetzt werden.<br>\ncode!='V' or (%resource.clinicalStatus.coding.where(code='active').exists() and %resource.verificationStatus.coding.where(code='provisional').exists())</p>\n</li>\n<li>\n<p>icd-7:Wenn die Diagnosesicherheit \"Z (Zustand nach)\" verwendet wird, dann muss clinicalStatus auf \"resolved\" und verificationStatus auf \"confirmed\" gesetzt werden.<br>\ncode!='Z' or (%resource.clinicalStatus.coding.where(code='resolved').exists() and %resource.verificationStatus.coding.where(code='confirmed').exists())</p>\n</li>\n</ul>\n<p>Derzeit werden nur Warnung ausgegeben. Wäre zu diskutieren, ob das eventuell sogar ein harter Fehler sein soll...</p>",
        "id": 172674361,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1565182190
    },
    {
        "content": "<p>Hier ist ein Beispiel für eine Diagnose, die bei der Validierung durchfällt, weil die Sicherheit nur in der Extension, aber nicht in verificationStatus angegeben wurde: <a href=\"https://simplifier.net/basisprofil-de-r4/condition-invalid-2\" target=\"_blank\" title=\"https://simplifier.net/basisprofil-de-r4/condition-invalid-2\">https://simplifier.net/basisprofil-de-r4/condition-invalid-2</a><br>\nHier ein Beispiel für eine \"gute\" Condition: <a href=\"https://simplifier.net/basisprofil-de-r4/condition-zustand-nach\" target=\"_blank\" title=\"https://simplifier.net/basisprofil-de-r4/condition-zustand-nach\">https://simplifier.net/basisprofil-de-r4/condition-zustand-nach</a></p>",
        "id": 172674560,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1565182328
    },
    {
        "content": "<p>Die geltenden Äquivalenzen sind im IG nochmal aufgeführt: <a href=\"https://simplifier.net/guide/basisprofil-de-r4/Diagnosesicherheit\" target=\"_blank\" title=\"https://simplifier.net/guide/basisprofil-de-r4/Diagnosesicherheit\">https://simplifier.net/guide/basisprofil-de-r4/Diagnosesicherheit</a></p>",
        "id": 172674805,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1565182550
    },
    {
        "content": "<p>Dazu gab es folgenden Einwand bei STU3:</p>\n<blockquote>\n<p>m.E. muss hier alternativ auch \"V\" (Verdacht auf / zum Ausschluss von) =&gt; clinicalStatus = \"active\", verificationStatus=\"differential\" aufgeführt werden. Außerdem fehlt eine Regel, welche clinicalStatus und verificationStatus bei Verwendung erzwingt.</p>\n</blockquote>\n<p>Meine Frage an die Community, bevor ich mich daran setze, das einzuarbeiten: Ist das Konsens? Oder gibt es da noch Diskussionsbedarf?</p>",
        "id": 183137778,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1576054533
    },
    {
        "content": "<p>Scheinbar nicht, daher setze ich mich jetzt mal daran.</p>",
        "id": 183342312,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1576230115
    },
    {
        "content": "<p>Grundsätzlich d'accord, allerdings vermute ich, dass die meisten Szenarien <em>auf</em> FHIR und weniger <em>von</em> FHIR mappen werden. Daher sollten wir wenigsten eine Präferenz oder ein default Mapping für \"V\" vorgeben.<br>\nDa bin ich jetzt allerdings überfragt, welches da geeigneter wäre...</p>",
        "id": 183342538,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1576230299
    },
    {
        "content": "<p>Ich sehe momentan die einzige Möglichkeit darin, auch beide möglichen Varianten hinzuweisen und in Prosa die Problematik zu beschrieben, dass das \"richtige\" Mapping allein aus dem Code \"V\" nicht eindeutig hervorgeht...</p>",
        "id": 183342662,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1576230412
    },
    {
        "content": "<p>So etwas ähnliches war ich auch gerade am schreiben: Im Profil beides erlauben, und im IG auf die Problematik hinweisen.</p>",
        "id": 183342700,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1576230474
    },
    {
        "content": "<p>Ich wärme diesen Thread mal wieder auf: Wir laufen jetzt mit §21 daten genau in diese Problematik. Wir haben nur das V und wissen dementsprechend nicht, was der \"richtige\" Code ist (provisional | differential). Meine Idee war, das einfach auf \"unconfirmed\" zu mappen... Aber das lassen die Invarianten ja nicht zu. Gab es hierzu schon weitere Diskussionen?</p>\n<p>Und: §21 sieht bei postkoordinierten Codes vor, die Diagnosesicherheit für beide Teile einzeln anzugeben <span aria-label=\"see no evil\" class=\"emoji emoji-1f648\" role=\"img\" title=\"see no evil\">:see_no_evil:</span> Mit dem aktuellen Basis-DE-Extensions kann man ja nur eine Diagnosesicherheit für den kompletten Code setzen. Unser aktuellen Workaround ist, bei verschiedenen Sicherheiten einfach keine zu setzen, was gerade bei \"Auschlussdiagnosen\" zu Problemen führen könnte.... Kam das beim Profilieren auf bzw. hat hier jemand eine bessere Lösung parat?</p>",
        "id": 201843193,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1593003352
    },
    {
        "content": "<p>Ich wäre grundsätzlich nicht abgeneigt, die Invariante dahingehend zu erweitern, dass sie das Mapping der Diagnosesicherheit V auf unconfirmed zulässt.</p>\n<p>Die Angabe separater Diagnosesicherheiten für die einzelnen Anteile eines postkoordinierten Codes steht meiner Auffassung nach im Widerspruch zu den Definitionen des DIMDIs, dass es sich bei postkoordinierten Diagnosen um <em>eine</em> Diagnose mit Angabe der Ätiologie handelt und nicht um zwei eigenständige Diagnosen.<br>\nWenn ich \"Glaukom bedingt durch Diabetes Melitus\" postkoordiniert codiere, dann mache ich sowohl in Lateralität als auch in Diagnosesicherheit nur Aussagen zum Primärcode Glaukom.<br>\nWenn ich Details zum Diabetes angeben möchte, dann mache ich das in einem separaten Code, in dem nur der Diabetes steht.</p>\n<p>Oder anders gesagt: Ich würde bei einem Patienten mit diabetischem Glaukom immer auch die Existenz eines \"reinen\" Diabetes-Codes erwarten. Dessen Kodierung erfolgt nicht \"implizit\" durch das postkoordinierte Glaukom.</p>\n<p>Aber: Das ist laienhafte Spekulation meinerseits.</p>\n<p>Erbitte Unterstützung,  <span class=\"user-mention\" data-user-id=\"194953\">@Heike Dewenter</span> <span class=\"user-mention\" data-user-id=\"247046\">@Christine Haas</span> <span class=\"user-mention\" data-user-id=\"195473\">@Sylvia Thun</span> <span class=\"user-mention\" data-user-id=\"212996\">@Elisabeth Pantazoglou</span></p>",
        "id": 201867943,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593014717
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> <br>\nKönnt ihr bitte die Problematik genauer erläutern. Wahrscheinlich bin ich im falschen Film, soweit ich weiß, dürfen Zusatzkennzeichen im stat. Bereich nicht verwendet werden. Die Extension Diagnosessicherheit bezieht sich demnach auf amb. Versorgung. <br>\n\"In der ambulanten Versorgung (§ 295 SGB V) sind die Zusatzkennzeichen für die Diagnosensicherheit obligatorisch. In der stationären Versorgung (§ 301 SGB V) sind die Zusatzkennzeichen für die Diagnosensicherheit verboten, d.h. sie dürfen nicht verwendet werden. In der stationären Versorgung sind stattdessen die hierfür vorgesehenen Schlüsselnummern im Kap. XXI zu verwenden. Außerdem sei auf die Kodierrichtlinien DKR und DKR-Psych verwiesen.\"<br>\nM.M.n. wäre dein Bsp. auch genau andersrum anzuwenden. Das Glaukom wird Stern- und der D.M. Kreuz kodiert. \"Zuerst wird die Ätiologie (d. h. der Primärkode mit Kreuz †), dann die Manifestation (= Sekundärkode mit Stern *) kodiert.\"</p>",
        "id": 201936548,
        "sender_full_name": "Elisabeth Pantazoglou",
        "timestamp": 1593066846
    },
    {
        "content": "<p>In unseren Daten finden sich auch im stationären Bereich Diagnosesicherheiten. Intern kann ja jeder verschlüsseln, wie man will.§21 gibt ja auch die Spalten für Diagnosesicherheit vor. Wenn ich das richtig verstehe, geht es ja <em>nicht nur</em> um das Mapping von Abrechnungsdaten...</p>",
        "id": 201938183,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1593069085
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/bfH1SXUilGHQPYy2yKlWq7QB/Anmerkung-2020-06-25-133456.png\">Anmerkung-2020-06-25-133456.png</a><br>\nDer §21 hat aber tatsächlich zwei Spalten mit Primär- und Sekundärcode und nachfolgend jeweils eine extra Spalte \"Diagnosesicherheit\". Konnte ich erst auch nicht richtig glauben... Die sind aber wohl nur bei Fällen aus der psychatrischen Ambulanz <a href=\"https://www.sozialgesetzbuch-sgb.de/sgbv/118.html\">§118 SGB V</a> erlaubt... OK, d.h. bei den allermeisten Fällen hat man gar keine Diagnosensicherheit im §21, und sonst zwei? <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span> <br>\nWeiß jemand, was es mit den \"hierfür vorgesehenen Schlüsselnummern im Kap. XXI \" auf sich hat? Gibt es die im §21 überhaupt?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/bfH1SXUilGHQPYy2yKlWq7QB/Anmerkung-2020-06-25-133456.png\" title=\"Anmerkung-2020-06-25-133456.png\"><img src=\"/user_uploads/10155/bfH1SXUilGHQPYy2yKlWq7QB/Anmerkung-2020-06-25-133456.png\"></a></div>",
        "id": 201957861,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1593085269
    },
    {
        "content": "<p>Ungeachtet dessen ist aber auch die doppelte Angabe der Lokalisation an dieser Stelle m. M. n. Murks...?</p>",
        "id": 201962796,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593088702
    },
    {
        "content": "<p>Lokalisation der PD und SD, kann schon mal unterschiedlich sein bzw. ist ein Diabetes ja keiner Seite zuzuordnen.</p>",
        "id": 202055230,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1593150845
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221444\">Noemi Deppenwiese</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Invarianten.20f.C3.BCr.20Diagnosesicherheit/near/201957861\">said</a>:</p>\n<blockquote>\n<p>Weiß jemand, was es mit den \"hierfür vorgesehenen Schlüsselnummern im Kap. XXI \" auf sich hat? Gibt es die im §21 überhaupt?</p>\n</blockquote>\n<p>In welchem Zusammenhang ist das? Es geht ja um:</p>\n<div class=\"codehilite\"><pre><span></span><code>Kapitel XXI\nFaktoren, die den Gesundheitszustand beeinflussen und zur Inanspruchnahme des Gesundheitswesens führen\n(Z00-Z99)\n</code></pre></div>",
        "id": 202055271,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1593150961
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306822\">Sven Helfer</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Invarianten.20f.C3.BCr.20Diagnosesicherheit/near/202055271\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"221444\">Noemi Deppenwiese</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Invarianten.20f.C3.BCr.20Diagnosesicherheit/near/201957861\">said</a>:</p>\n<blockquote>\n<p>Weiß jemand, was es mit den \"hierfür vorgesehenen Schlüsselnummern im Kap. XXI \" auf sich hat? Gibt es die im §21 überhaupt?</p>\n</blockquote>\n<p>In welchem Zusammenhang ist das? Es geht ja um:</p>\n<div class=\"codehilite\"><pre><span></span><code>Kapitel XXI\nFaktoren, die den Gesundheitszustand beeinflussen und zur Inanspruchnahme des Gesundheitswesens führen\n(Z00-Z99)\n</code></pre></div>\n\n\n</blockquote>\n<p>Habs gefunden: Kap. XXI enthält Vorsorge und \"Abklärungs-Diagnosen\" (Untersuchung von Organsystem ..., Beurteilung des Entwicklungsstandes...) Das was man eben macht, wenn man einen Verdacht hat bzw. etwas ausschließt ;)</p>",
        "id": 202055403,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1593151134
    },
    {
        "content": "<p>Danke! Auf dieses Kapitel XXI bin ich gar nicht gekommen. OK; dh idR ist die Sicherheit schön durch die Codierung an sich ausgedrückt.</p>",
        "id": 202068483,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1593163236
    },
    {
        "content": "<p>Ich muss hier noch einmal nachhaken. Zwar ist das im stationären Kontext kein Problem, da es dort wie beschrieben keine Diagnosesicherheiten in der ICD-Codierung gibt. Im ambulanten Sektor aber schon, und zwar tatsächlich für die einzelnen Code-Teile (zB Kreuz- und Sterncode, Im §21 Primär und Sekundärcode genannt.). Leider finde ich dazu kein Beispiel beim DIMDI, in der §21 Spezifikation ist das aber nachzulesen (und an echten §21 daten auch so zu beobachten...) Diese tauchen im §21 für die PIA-Fälle (ambulant, aber aus Gründen Teil des §21) auf. Hier gibt es also tatsächlich zwei Diagnosesicherheiten.</p>\n<ol>\n<li>\n<p>Könnte man die Diagnosesicherheit-Extension so abändern, dass sie an den Extensions mit den Code-Teilen (Kreuz, Stern bzw Ausrufezeichencode) sitzt? Vermutlich müsste man dazu eine komplexe Extension als \"zusammenhalter\" bauen, aber sonst könnte man die einzelnen Teile nicht verlustfrei aufsplitten.</p>\n</li>\n<li>\n<p>Es wäre super, wenn es eine Guideline beim Coding-Profil gäbe, die empfiehlt, ob man die Sicherheit mit in das \"code\" Feld schreiben soll oder eben nicht. Ich tendiere zu nicht, da hier <a href=\"https://www.dimdi.de/dynamic/de/klassifikationen/icd/icd-10-gm/kodierfragen/\">https://www.dimdi.de/dynamic/de/klassifikationen/icd/icd-10-gm/kodierfragen/</a> folgendes steht</p>\n</li>\n</ol>\n<blockquote>\n<p>Generell gilt aus klassifikatorischer Sicht, dass Zusatzkennzeichen nicht Bestandteil eines ICD- oder OPS-Kodes sind und somit auch nicht als eine zusätzliche Stelle eines Kodes bezeichnet werden können. D.h., ein vierstelliger Kode wird durch die Angabe eines Zusatzkennzeichens nicht zu einem fünfstelligen Kode.</p>\n</blockquote>\n<p>Gerade dann wäre es aber wichtig, diese Info mit einer Extension an die Codeteile hängen zu können.</p>\n<ol start=\"3\">\n<li>Man müsste zusätzlich noch Regeln festlegen, wie man die möglichen Diagnosesicherheit-Kombinationen auf die Condition.verificationStatus abbildet. zB Sobald ein \"A\" dabei ist immer refuted. Da dies eigene Probleme mit sich bringt, könnte man auch über eine \"Aufteilung\" auf zwei Conditions nachdenken. zB aus B56.0† G G02.8* V eine \"confirmed\" B56.0 und eine \"unconfirmed\"  B56.0† G02.8*. Das klappt natürlich nicht bei allen Kombis, weil es ja auch Kreuzcodes gibt, die nicht alleine stehen dürfen. Von * und ! Codes, für die das ja immer gilt, mal ganz abgesehen...<br>\nMan könnte den verificationStatus bei solchen Geschichten auch verbieten, aber das bringt auch Probleme. Eine einfache Lösung sehe ich leider nicht.</li>\n</ol>",
        "id": 206820690,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1597328571
    },
    {
        "content": "<p>Ich adde mal <span class=\"user-mention\" data-user-id=\"222703\">@Azadeh Nassirian</span> und <span class=\"user-mention\" data-user-id=\"306822\">@Sven Helfer</span> , die sich schon über alternative Modellierungen Gedanken gemacht haben.</p>",
        "id": 207503941,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1597915445
    },
    {
        "content": "<p>Danke Noemi</p>",
        "id": 207503994,
        "sender_full_name": "Azadeh Nassirian",
        "timestamp": 1597915508
    },
    {
        "content": "<p>Hab erst zu einfach gedacht, aber jetzt sehe ich das genauso wie <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> ...</p>",
        "id": 207517023,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1597927130
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 207517187,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1597927218
    },
    {
        "content": "<p>Hattet ihr dazu mal den Diagnoseleitfaden gesichtet, der zwar auf v2/V3 ausgerichtet ist, aber genau darüber nachgedacht hat?</p>",
        "id": 207547584,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1597943095
    },
    {
        "content": "<p>Den kenne ich leider nicht. Ist das ein HL7 oder DIMDI Dokument?</p>",
        "id": 207625509,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1598010965
    },
    {
        "content": "<p>Ich habe das hier <a href=\"https://wiki.hl7.de/index.php?title=cdaab2:ICD-Diagnose_Entry_(Template)#Diagnosesicherheit_2\">https://wiki.hl7.de/index.php?title=cdaab2:ICD-Diagnose_Entry_(Template)#Diagnosesicherheit_2</a> gefunden.<br>\nIn v3 werden die einzelnen Codeteile also tatsächlich getrennt und als unterschiedliche Observations betrachtet, die eine mit einem Attribut versehene Relation haben.  In FHIR würde ich mich allerdings dagegen aussprechen, zwei Condition-Ressourcen zu verwenden, da die ganzen anderen Daten (onset, asserter...) der Condition ja für beide Codeteile gleich sein werden.</p>",
        "id": 207626527,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1598011778
    },
    {
        "content": "<p>Aber vielleicht kann man die Struktur für die Extensions übernehmen? Quasi die v3 referenzierten Observations zu je einer komplexen extension machen.<br>\nDas, was in v3 über den \"typeCode\" ausgedrückt wird, könnte man A) entweder als Attribut einer neuen \"CodePart\"-Extension verwenden oder B)  über die Extension an sich (so wie aktuell, wo es ja eine Kreuzcode, Sterncode und Ausrufezeichencode Extension gibt) ausdrücken.<br>\nIn jedem Fall hätte man komplexe Extensions, die \"unter-Extensions\" mit dem eigentlichen Codeteil und der Sicheheit enthalten würden.<br>\nUnd: In jeden Fall hätte man das Problem, wie man mit dem verficationStatus umgeht.</p>",
        "id": 207627384,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1598012465
    },
    {
        "content": "<p>Ich denke, Frank meint diesen hier:<br>\n<a href=\"https://wiki.hl7.de/index.php?title=IG:Diagnoseleitfaden\">https://wiki.hl7.de/index.php?title=IG:Diagnoseleitfaden</a><br>\naus dem der oben verlinkte Diagnose-Entry dann später ausgelagert wurde.</p>\n<p>Leider ist das sehr CDA-zentrisch, d.h. es gibt genau genommen kein technologieneutrales detailliertes Modell (zumindest nicht dazu, wie nun z.B. Diagnosesicherheit in Beziehung zur Hauptdiagnose steht).<br>\nCDA verwendet dafür Qualifier, die es in FHIR nicht gibt. Die Idee war, dies mit Extensions nachzubilden, um den spezifischen Wünschen nach 1:1-Abbildung der Einzelcodes nachzukommen.<br>\nGleichzeitig aber auch,um konform zu FHIR zu sein, clinicalStatus und verificationStatus entsprechend zu setzen. Und das ist der Ist-Stand.</p>",
        "id": 207636360,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1598017959
    },
    {
        "content": "<p>Ich habe da noch ein anderes Dokument im Sinn, was wir vor Jahren mal zu der Problematik geschrieben und als PDF veröffentlicht haben. Ich muss da nochmal auf die Suche gehen...</p>",
        "id": 207636779,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1598018200
    },
    {
        "content": "<p>Wurde das nicht damals auf Wiki restrukturiert?</p>",
        "id": 207646475,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1598023027
    },
    {
        "content": "<p>Wir hatten da was mit den Templates genacht?! Aber das PDF...?</p>",
        "id": 207718722,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1598093248
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> <span class=\"user-mention\" data-user-id=\"306822\">@Sven Helfer</span>  <span class=\"user-mention\" data-user-id=\"222703\">@Azadeh Nassirian</span> Habt ihr euch Gedanken gemacht bezüglich des Clinical Status im stationären Kontext? Kann man davon ausgehen, dass für der clinicalStatus für die Aufnahmediagnose \"active\" ist mit verfificationStatus confirmed oder unconfirmed? Für die Diagnose welche mit dem MII Abrechnungsfall verbunden ist würde dann clinicalStatus = active, verificationStatus = confirmed gelten, oder?</p>",
        "id": 208065039,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1598430838
    },
    {
        "content": "<p>CC: <span class=\"user-mention\" data-user-id=\"194875\">@Danny Ammon</span> <span class=\"user-mention\" data-user-id=\"197535\">@Josef Schepers</span> <span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span></p>",
        "id": 208065099,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1598430860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>    Vielen Dank für guten Hinweiß. Weil unsere Sourcedatei sind noch P21 Daten. (Die Daten, die wir in FHIR haben, kommen aus ETL Strecke \"p21 to FHIR \"), haben wir noch nicht daran gedacht. Clinicalstatus sowie Verificationstatus sind Optional, das heißt  Condition Resosurcen dürfen keine haben. Ich werde aber in unserem Team darüber diskutieren.</p>",
        "id": 208314217,
        "sender_full_name": "Azadeh Nassirian",
        "timestamp": 1598600796
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 208314586,
        "sender_full_name": "Azadeh Nassirian",
        "timestamp": 1598601130
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193430\">Alexander Zautke</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Invarianten.20f.C3.BCr.20Diagnosesicherheit/near/208065039\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"221444\">Noemi Deppenwiese</span> <span class=\"user-mention silent\" data-user-id=\"306822\">Sven Helfer</span>  <span class=\"user-mention silent\" data-user-id=\"222703\">Azadeh Nassirian</span> Habt ihr euch Gedanken gemacht bezüglich des Clinical Status im stationären Kontext? Kann man davon ausgehen, dass für der clinicalStatus für die Aufnahmediagnose \"active\" ist mit verfificationStatus confirmed oder unconfirmed? Für die Diagnose welche mit dem MII Abrechnungsfall verbunden ist würde dann clinicalStatus = active, verificationStatus = confirmed gelten, oder?</p>\n</blockquote>\n<p>Dem verificationStatus würde ich spontan zustimmen <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span><br>\nOb es im MII-Kontext sinnvoll ist, den ClinicalStatus zu pflegen? Idealerweise ist die Aufnahmediagnode bei Entlassung ja \"resolved\".</p>",
        "id": 209268479,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1599466564
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221444\">Noemi Deppenwiese</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Invarianten.20f.C3.BCr.20Diagnosesicherheit/near/209268479\">said</a>:</p>\n<blockquote>\n<p>Dem verificationStatus würde ich spontan zustimmen <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span><br>\nOb es im MII-Kontext sinnvoll ist, den ClinicalStatus zu pflegen? Idealerweise ist die Aufnahmediagnode bei Entlassung ja \"resolved\".</p>\n</blockquote>\n<p>So ist das leider nicht, ich würde sogar sagen, dass die meisten Diagnosen bei Entlassung noch nicht \"resolved\" sind, maximal \"gebessert\"...<br>\nWas genau meinst du mit \"pflegen\"? Ich denke, wir haben (Stand aktuell) keine belastbaren Daten dazu in den Quellsystemen (mal von NLP-Zeug und regelbasierten Einzelfalllösungen abgesehen). Eine wichtige Information ist es trotzdem und könnte z.B. durch hinzunahme eines EDC-Systems <em>irgendwann</em> integriert werden ;)</p>",
        "id": 209278892,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1599473546
    },
    {
        "content": "<p>Mit \"pflegen\" meinte ich den zu setzen und idealerweise upzudaten. Man könnte natürlich \"active\" setzen, weil zum Zeitpunkt der Aufnahme war der bestimmt \"active\", aber ob wir da ohne ein Updat bei Änderung des Zustandes, das aus den von Dir genannten Gründen ja wahrscheinlich nicht erfolgt, da einen Nutzen haben? Evtl. führt das eher zu Verwirrung, wenn da ein Haufen \"active\" Conditions rumfliegen, die aber schon veraltet sind.</p>",
        "id": 209279692,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1599474094
    },
    {
        "content": "<p>Dann würde ich sagen Stand aktuell: Nicht pflegen. Über die Pflege des ClinicalStatus kann man wahrscheinlich sowieso ganze Abhandlungen schreiben - oder sie sind schon geschrieben und ich habe sie noch nicht gelesen... :D</p>",
        "id": 209281451,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1599475415
    },
    {
        "content": "<p>Und über den verificationStatus der Aufnahmediagnose, muss man wahrscheinlich auch nachdenken. Das ist ja nur die (Verdachts-)Diagnose, die zur Aufnahme geführt hat...</p>",
        "id": 209281677,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1599475594
    },
    {
        "content": "<p>Aber im stationären Kontext ist es ja immer sicher? da kann man ja keinen Verdacht codieren?</p>",
        "id": 209281994,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1599475837
    },
    {
        "content": "<p>Da kodiert man im Zweifel falsch ;)</p>",
        "id": 209282179,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1599475979
    },
    {
        "content": "<p>Im MII-IG zu Fall steht<br>\nEncounter.diagnosis     Die (bestätigte!) Aufnahemdiagnose. Keine Abbildung von reinen Symptomen.<br>\nDa kann man also nicht mehr von einem verdacht ausgehen.<br>\nAller anderen Fälle .... <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 209309481,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1599494172
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221444\">Noemi Deppenwiese</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Invarianten.20f.C3.BCr.20Diagnosesicherheit/near/207627384\">said</a>:</p>\n<blockquote>\n<p>Aber vielleicht kann man die Struktur für die Extensions übernehmen? Quasi die v3 referenzierten Observations zu je einer komplexen extension machen.<br>\nDas, was in v3 über den \"typeCode\" ausgedrückt wird, könnte man A) entweder als Attribut einer neuen \"CodePart\"-Extension verwenden oder B)  über die Extension an sich (so wie aktuell, wo es ja eine Kreuzcode, Sterncode und Ausrufezeichencode Extension gibt) ausdrücken.<br>\nIn jedem Fall hätte man komplexe Extensions, die \"unter-Extensions\" mit dem eigentlichen Codeteil und der Sicherheit enthalten würden.<br>\nUnd: In jeden Fall hätte man das Problem, wie man mit dem verficationStatus umgeht.</p>\n</blockquote>\n<p>Gibt es dazu eigentlich Neuigkeiten? Das Problem \"Mit dem aktuellen Stand kann man Diagnosesichrheiten nach ICD-10-GM nicht richtig abbilden\" besteht ja noch.</p>",
        "id": 210240482,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1600249742
    }
]