[
    {
        "content": "<p>Hallo zusammen, eine Design-Frage:<br>\nIm KIS werden im Rahmen eines Falles Fragebögen erfasst und in der FHIR Repo persistiert. Ein Subsystem holt sich später die Fragebögen, Einstieg dafür ist die Fall-ID. Wie kann ich den Identifier der Fragebögen im Encounter-Objekt platzieren, was wäre die angedachte Lösung für die Referenz auf solch eine spezifische Unterlage im Rahmen des Falls? Diverse Referenzen im Encounter-Profil haben m.E. alle andere Intentionen.<br>\nMein Ansatz:  Verwendung von Encounter.hospitalization.dischargeDisposition.coding    Das gewinnt keinen Schönheitspreis, ich weiß. Hätte aber den Vorteil, dass coding mehrfach verwendet werden darf (es sind 2 Fragebögen) und obendrein das Thema passt - Entlassmanagement.</p>",
        "id": 235189307,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1618842389
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392581\">@Thomas Zacher</span> das Problem ist hier,  das der Fall (administratives Abrechnungskonzept) nicht gleichzusetzen mit einem Encounter (Interaktion/Präsenz mit dem Patienten) ist. Wenn Du mit dem Fall einsteigst, solltest du vom Account auf den Encounter schliessen. Kannst Du kurz erklären, ob wir hier mit DocumentReferences oder Questionaires arbeiten?</p>",
        "id": 235227946,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1618857460
    },
    {
        "content": "<p>Wenn wir von Questionnaires ausgehen, hätte ich erwartet, dass das System für den Kontakt (in diesem Fall der Einrichtungskontakt der abgeschlossen werden soll) eine QuestionnaireResponse Ressource bereitstellt, die teils schon vorausgefüllt ist. In QuestionnaireResponse.encounter kann ich kann den entsprechenden Identifier hinterlegen. Alle weiteren Fragen werden definiert durch das Questionnaire unter QuestionnaireResponse.questionaire.</p>",
        "id": 235241537,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1618863218
    },
    {
        "content": "<p>Die dischargeDisposition ist rein zur Kodierung / Kategorisierung der Location in die entlassen wird: “Category or kind of location after discharge”</p>",
        "id": 235242041,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1618863412
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197429\">@Axel Biernat</span>  Es werden mit Questionnaire die Fragebögen definiert und mit QuestionnaireResponse die beantworteten Ausprägungen persistiert, die vom Subsystem dann von der FHIR Repo geholt werden.<br>\n<span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>  Ja, mit der QuestionnaireResponse als Einstiegspunkt funktioniert es, das war mein erster Ansatz. Das Subsystem bräuchte nur idealerweise die Fall-ID als Einstiegspunkt, deshalb der Workaround.<br>\nIch denke, entweder muss sich das Subsystem anpassen und den Identifier der QuestResp aufrufen oder ich muss mit dem Workaround arbeiten.</p>",
        "id": 235294502,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1618900622
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392581\">@Thomas Zacher</span> QuestionnaireResponse.encounter ist auch ein Suchparameter, somit wäre es nicht zwingend notwendig eine id oder einen Identifier für die QuestionnaireResponse zu übergeben. Vorausgesetzt das der FHIR Store die Suche unterstützt.</p>",
        "id": 235299327,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1618903183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392581\">@Thomas Zacher</span>  ich denke dann ist es am besten, im Subsystem über den Suchparamter Account mit der Fallnummer den Encounter zu finden. Und dann die Questionaires mit dem zugehörigen Suchparamter wie von <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>  vorgeschlagen zu suchen.</p>",
        "id": 235330189,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1618919762
    },
    {
        "content": "<p>Vielen Dank Euch beiden! <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 235345794,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1618926318
    },
    {
        "content": "<p>Wenn die Fallnummer als Identifier in einem oder mehreren Encountern angegeben ist, dann geht das Abrufen aller Fragebögen zu einem Fall auch mit einer Chained Search: /QuestionnaireResponse?encounter.identifier=12345</p>",
        "id": 235488361,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1619001951
    }
]