[
    {
        "content": "<p>Liebe Gemeinde,</p>\n<p>im Hinblick auf die baldige Publikation der ISIK-Spezifikation der Gematik und den Start der Showcase-Implementierungen, wollen wir den Entwicklern hier im Chat ein <a href=\"#narrow/stream/287581-german.2Fisik\">separates Forum</a> zur Diskussion von Fragen, Problemen und Vorschlägen rund um die Umsetzung der exisierenden Module <a href=\"https://simplifier.net/IsiK/~introduction\">\"Basis\"</a> und <a href=\"https://simplifier.net/IsiK-ModulVitalparameter/~introduction\">\"Vitalparameter\"</a> bieten, sowie über die Entwicklung weiterer Module Informieren. </p>\n<p>Wer beim Thema ISIK am Ball bleiben möchte, aber nicht regelmäßig hier im Chat vorbeischaut, kann in den Einstellungen den <a href=\"#narrow/stream/287581-german.2Fisik\">german/isik-Stream</a> abonnieren und eMail-Notifikationen aktivieren:<br>\n<a href=\"/user_uploads/10155/kOJUpCZV7VRfiCZzCA9qYiDb/image.png\">image.png</a> <br>\n<a href=\"/user_uploads/10155/xKyr-4aGZtAbTVv5BTeGO6Hh/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/kOJUpCZV7VRfiCZzCA9qYiDb/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/kOJUpCZV7VRfiCZzCA9qYiDb/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/xKyr-4aGZtAbTVv5BTeGO6Hh/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/xKyr-4aGZtAbTVv5BTeGO6Hh/image.png\"></a></div><p>Frohes FHIRn!</p>",
        "id": 237820158,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1620393268
    },
    {
        "content": "<p>Wie kann man den Diagnosetyp angeben?</p>\n<p>Im KIS wird zwischen Diagnosetypen (Aufnahmediagnose, Entlassdiagnose, Behandlungsdiagnose, ...) unterschieden. Kann man das in ISIKDiagnose abbilden, was ist das dafür vorgesehene Element? <br>\nCondition.verificationStatus kommt dem wohl am Nächsten, gibt aber eben den Status der der Diagnose an, während bei den o .g. offenbar eher der Zeitpunkt der Diagnose festgehalten wird.<br>\nCondition.note als Ausweg?</p>",
        "id": 238116475,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1620641724
    },
    {
        "content": "<p>Formen des Versicherungsverhältnisses</p>\n<p>In ISIK existieren bzgl. Versicherungsverhältnis die beiden Profile  \"VersverhaeltnisGesetzlich\" und \"VersverhaeltnisSelbstzahler\". Dazu gibt es in ISIKPatient die Möglichkeit, eine GKV- und eine PKV-Versichertennummer festzuhalten.</p>\n<p>Zunächst: Was ist mit Selbstzahler gemeint? - Jemand, der den Krankenhausaufenthalt als Selbstzahler aus eigener Tasche bezahlt, ohne Versicherung?</p>\n<p>Im ADT-Datenstrom werden bzgl. Versicherungsverhältnis neben GKV 3 weitere Zustände unterschieden:</p>\n<ul>\n<li>Selbstzahler:  Wie oben beschrieben, ein Patient, der ohne Versicherung bezahlt. Es gibt keine Versichertennummer, aber ein extra Profil.</li>\n<li>Privat Versicherte:  Patient ist in Privatversicherung versichert, Versicherungsnummer ist bekannt und könnte in ISIKPatient gespeichert werden, eigenes Profil existiert aber nicht.</li>\n<li>Berufsgenossenschaft:  Es handelt sich um einen Arbeitsunfall. Wie kann dieses Versicherungsverhältnis festgehalten werden?</li>\n</ul>\n<p>Stimmt die hier formulierte Definition von \"Selbstzahler\" mit den ISIK-Überlegungen überein?<br>\nWie kann der Fall des Arbeitsunfalls bzgl. des Versicherungsverhältnisses festgehalten werden?</p>",
        "id": 238118307,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1620642795
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392581\">@Thomas Zacher</span> Der neuangelegte ISiK-Stream findet sich nun hier: <a href=\"#narrow/stream/287581-german.2Fisik\">https://chat.fhir.org/#narrow/stream/287581-german.2Fisik</a><br>\nIch würde vorschlagen, dass wir dort weiter diskutieren.</p>",
        "id": 238119443,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1620643413
    }
]