[
    {
        "content": "<p>Guten Tag,</p>\n<p>Ich würde gerne die FHIR-Community zu dem Thema KHZG und KHSFV befragen bzw. eine Diskussion dazu anregen.<br>\nIn der Fördermittelrichtlinie (KHSFV - <a href=\"https://www.bundesamtsozialesicherung.de/fileadmin/redaktion/Krankenhauszukunftsfonds/20201201_Foerdermittelrichtlinie.pdf\">https://www.bundesamtsozialesicherung.de/fileadmin/redaktion/Krankenhauszukunftsfonds/20201201_Foerdermittelrichtlinie.pdf</a>) tauchen die Formulierungen \"technische, syntaktische und semantischen Standards\" und \"Interoperabilität\" ja mehr als einmal auf. Auch ist der Verweis auf die MIOs der KBV recht prominent platziert.<br>\nIch überlege daher auf der Frage herum, welche Fördertatbestände am meisten vom FHIR profitieren. <br>\nFür mich hätte ich erstmal die Fördertatbestände 2 (Patientenportale), 3 (digitale Pflege- und Behandlungsdokumentation), 4 (Einrichtung von teil- oder vollautomatisierten klinischen<br>\nEntscheidungsunterstützungssystemen) und 5 (Digitales Medikationsmanagement) identifiziert. Vielleicht noch Nr. 6 (Digitale Leistungsanforderung).  <br>\nÜbersehe ich vielleicht ideale Einsatzszenarien in den anderen Fördertatbeständen oder lassen sich die oben genannten Inhalte vielleicht einfacher mit einem anderen Standard umsetzen?</p>\n<p>Neben dem theoretischen Einsatz von FHIR für diese Bereiche sehe ich aber ein große Herausforderung bei der Implementierung von FHIR-Strukturen in den Krankenhäusern. Ich bin daher sehr gespannt zu sehen, welche Lösungen sich hier durchsetzen.</p>",
        "id": 225978943,
        "sender_full_name": "Kevin Schwahn",
        "timestamp": 1613044135
    },
    {
        "content": "<p>ad 4.) Hier ist <a href=\"https://cds-hooks.org/\">CDS Hooks</a> interessant, das (basierend auf FHIR) eine standardisierte Einbindung von Entscheidungsunterstützungsdiensten in Primärsysteme ermöglich. Setzt aber voraus, dass die dafür benötigten klinischen Daten von den Primärsystemen über eine FHIR-API bereitgestellt werden. Die <a href=\"https://simplifier.net/isik\">ISIK-Spezifikation</a> der Gematik bildet dafür aber schon mal eine solide Grundlage (zunächst mal nur für administrative Daten, kann dann aber immer weiter ausgebaut werden)</p>",
        "id": 225979556,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1613044549
    }
]