[
    {
        "content": "<p>Hallo in die Runde! <br>\nbeim Ausarbeiten der IGs für die MII KDS Module Fall und Diagnose ist mir ein vllt unpassendes Binding aufgefallen, nachdem wir das Thema auch intern diskutiert haben, haben wir entschieden dieses Thema jedoch auch hierüber mal anzusprechen. Konkret geht es um die Fall-Diagnose-Relation, die wir über Encounter.diagnosis herstellen. Dabei war unsere spontane Entscheidung für die Kodierung von Haupt- u/o Nebendiagnose .diagnosis.use zu benutzen, welches ein preferred Binding auf <a href=\"http://hl7.org/fhir/valueset-diagnosis-role.html\">DiagnosisRole</a> hat. Nun ist mir aber in der Core-Spec. <a href=\"http://hl7.org/fhir/encounter-definitions.html#Encounter.diagnosis.condition\">folgende Aussage</a> aufgefallen: </p>\n<blockquote>\n<p>For systems that need to know which was the primary diagnosis, these will be marked with the standard extension primaryDiagnosis (which is a sequence value rather than a flag, 1 = primary diagnosis).</p>\n</blockquote>\n<p>And here's where it gets complicated: wir haben diese standard Extension <em>primaryDiagnosis</em> nicht in der registry finden können, eine kurze Google-Suche ergibt aber folgendes <a href=\"https://www.hl7.org/fhir/v2/0359/index.html\">CodeSystem</a>. Natürlich könnten wir trotzdem die <em>DiagnosisRole</em> für die Kodierung verwenden, aber was würde denn da am ehesten zur Hauptdiagnose passen? Chief Complaint klingt in meinen Ohren eher nach einer Haupt-Beschwerde, also nicht unbedingt die Diagnose sondern vllt eher eine Beschwerde wie Bauchweh oder Übelkeit? Dann gäbe es noch Billing, und da wir (wenn ich mich nicht wieder irre) nach der Hauptdiagnose abrechnen (gerne korrigieren!!^^), könnte auch dieses für die Hauptdiagnose benutzt werden. Aber was wäre dann in dem Fall die Nebendiagnose? Comorbidity ist doch eher eine Begleiterkrankung, klingt für mich nicht so ganz nach Nebendiagnose oder doch? Was ist hier die allg. (Experten-)Meinung dazu?</p>",
        "id": 227433443,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1614088770
    },
    {
        "content": "<p>Diese Extension hat es nicht nach R4 geschafft. DSTU3 Version hier: <a href=\"http://hl7.org/fhir/STU3/extension-encounter-primarydiagnosis.html\">http://hl7.org/fhir/STU3/extension-encounter-primarydiagnosis.html</a></p>",
        "id": 227593282,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1614171364
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 227593485,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1614171450
    },
    {
        "content": "<p>Die Extension wird nicht mehr benötigt, da diagnosis, wie in der Episode-of-Care einen rank hat.</p>",
        "id": 227593669,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1614171543
    },
    {
        "content": "<p>CC für Hauptdiagnose finde ich gut, Comorbidity für Nebendiagnose.</p>",
        "id": 227593989,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1614171695
    },
    {
        "content": "<p>Rank nutzt man aber nur innerhalb gleichartiger diagnosis.use conditions.</p>",
        "id": 227594246,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1614171818
    },
    {
        "content": "<p>Also würde ich diagnosis use mit CC und comorbidity nutzen.</p>",
        "id": 227594374,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1614171860
    },
    {
        "content": "<p>Alles klar! ty! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 227603495,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1614175905
    },
    {
        "content": "<p>Was bedeutet denn in dem Kontext Rank. Use ist mir mit der Erläuterung klar.<br>\nWie wird dieser einheitlich festgelegt und genutzt?</p>",
        "id": 234302667,
        "sender_full_name": "Jan Maluche",
        "timestamp": 1618310283
    }
]