[
    {
        "content": "<p>Wie geht ihr mit mehrkomponentigen Arzneimitteln um?<br>\nMedPlanPlus-Medication-Profil/Basisprofil Hl7 DE:<br>\nMedication.code.coding --&gt; pzn + handelsname</p>\n<p>hier kann mMn nicht differenziert werden zwischen den Komponenten, die zu einer Pzn gehören.<br>\nDie Medications der Komponenten einer PZN würden sich dann ggf. nur in DArreichungsform/Wirkstoffe(Wirkstärke) unterscheiden.</p>\n<p>Das ganze trifft nur auf einen kleinen Teil der zugelassenen Medikamente zu.</p>\n<p>Ich würde ja ggf. eigene Extensions machen, habe dabei aber Bauchschmerzen wegen der Interoperabilität.<br>\nWurden die mehrkomponentigen Medikamente einfach nicht bei der Profilierung der Medications berücksichtigt?</p>\n<p>Hier noch ein paar Beispiele:</p>\n<p><a href=\"/user_uploads/10155/1TK3U1WEcYLY9Z3zMH4gHjv_/grafik.png\" target=\"_blank\" title=\"grafik.png\">grafik.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/1TK3U1WEcYLY9Z3zMH4gHjv_/grafik.png\" target=\"_blank\" title=\"grafik.png\"><img src=\"/user_uploads/10155/1TK3U1WEcYLY9Z3zMH4gHjv_/grafik.png\"></a></div>",
        "id": 188932917,
        "sender_full_name": "Martin Schubert",
        "timestamp": 1582556068
    },
    {
        "content": "<p>Zwei Beiträge zur Klärung:<br>\n1) Es gibt sowohl Kombipräparate, die mehrere Wirkstoffe enthalten, als auch Kombi-Packungen, die mehrere unterschiedliche Arzneimittel und/oder Geräte enthalten (Insulin mit Pen, Clotrimazol Tabl + Creme etc.) Die ersteren sind hier beschreibbar durch Auflistung der Wirkstoffe und -stärken.</p>\n<p>2) Der Medikationsplan ist für den Patienten. Der wird eine Kombipackung voraussichtlich gemäß Anweisungen verwenden. Aus Sicht des Patienten wäre daher PZN/Produktbezeichnung ausreichend. </p>\n<p>Also: Für den Scope des Medikationsplans ist m. E. eine strukturierte Darstellung der versch. Bestandteile einer Kombi-Packung wenig hilfreich.  </p>\n<p>Für sekundäre Nutzung oder AMTS müssen ggf. Zusatzinformationen aus PZN/Handelsname abgeleitet werden. Sowas betrifft aber nicht den Medikationsplan, sondern die Datenstrukturen, die man beim \"Nachschlagen\" einer PZN von den Anbietern diesbezüglicher Datenbanken oder -services erhält.</p>",
        "id": 188972134,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1582582535
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193991\">Christof Gessner</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Medication.20-.20PZN.20und.20Komponenten/near/188972134\" title=\"#narrow/stream/179183-german-(d-a-ch)/topic/Medication.20-.20PZN.20und.20Komponenten/near/188972134\">said</a>:</p>\n<blockquote>\n<p>Zwei Beiträge zur Klärung:<br>\n1) Es gibt sowohl Kombipräparate, die mehrere Wirkstoffe enthalten, als auch Kombi-Packungen, die mehrere unterschiedliche Arzneimittel und/oder Geräte enthalten (Insulin mit Pen, Clotrimazol Tabl + Creme etc.) Die ersteren sind hier beschreibbar durch Auflistung der Wirkstoffe und -stärken.</p>\n</blockquote>\n<p>Es geht nur um zweitere.</p>\n<blockquote>\n<p>2) Der Medikationsplan ist für den Patienten. Der wird eine Kombipackung voraussichtlich gemäß Anweisungen verwenden. Aus Sicht des Patienten wäre daher PZN/Produktbezeichnung ausreichend. <br>\nAlso: Für den Scope des Medikationsplans ist m. E. eine strukturierte Darstellung der versch. Bestandteile einer Kombi-Packung wenig hilfreich.  </p>\n</blockquote>\n<p>Das Problem ist bloß: die Darreichungsform einer Kombipackung ist eine Kombipackung und<br>\nder Patient wird die BESTANDTEILE (Komponenten) laut Anweisung verwenden: Darreichungsform Tablette/Creme etc. und hierbei möglicherweise unterschiedliche Dosiermengen bzw. die Komponenten zu unterschiedlichen Zeitpunkten einnehmen (morgens/abends etc.). Ggf. sind die Wirkstoffbestandteile und deren Stärken in den Komponenten unterscheidlich.<br>\n--&gt; also mehrere MedicationStatements, die dieselbe Medication (Kombipackung) referenzieren?</p>",
        "id": 189000334,
        "sender_full_name": "Martin Schubert",
        "timestamp": 1582619778
    },
    {
        "content": "<p>Der Hintergrund ist einfach auch der, dass ich die Medications initial als Fhir-Resourcen von einer App abrufen lassen möchte, sodass der Patient nach Eingabe einer PZN das Medikament in seinen Medikationsplan aufnehmen und Dosierungsangaben dazu machen kann. Bei mehrkomponentigen Medikamenten müsste er das mMn für jede Komponente machen (solange diese nicht die Kombipackung selbst ist).</p>",
        "id": 189012656,
        "sender_full_name": "Martin Schubert",
        "timestamp": 1582631532
    },
    {
        "content": "<p>Der Medikationsplan sagt m. W. dazu nichts. </p>\n<p>Laut Rahmenvertrag nach § 131 SGB V ist die Information zu allen Komponenten einer Kombipackung (strukturiert??) in den Preis- und Produktinformationen zur PZN enthalten. Siehe hier in Anlage 2, Punkt 7.10:<br>\n<a href=\"https://www.gkv-spitzenverband.de/media/dokumente/krankenversicherung_1/arzneimittel/rahmenvertraege/pharmazeutische_unternehmer/2018-03-26_Arzneimittel_Rahmenvertrag_131_SGB_V.pdf\" target=\"_blank\" title=\"https://www.gkv-spitzenverband.de/media/dokumente/krankenversicherung_1/arzneimittel/rahmenvertraege/pharmazeutische_unternehmer/2018-03-26_Arzneimittel_Rahmenvertrag_131_SGB_V.pdf\">https://www.gkv-spitzenverband.de/media/dokumente/krankenversicherung_1/arzneimittel/rahmenvertraege/pharmazeutische_unternehmer/2018-03-26_Arzneimittel_Rahmenvertrag_131_SGB_V.pdf</a></p>",
        "id": 189016164,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1582634831
    },
    {
        "content": "<p>Wir haben hier jetzt tatsächlich das Problem bei der PZN 09674094 gehabt, die im stationären Bereich verschrieben werden soll. Dabei wird eine Komponente wöchentlich gegeben und und die anderen beiden täglich. Wie kann man das am besten abbilden? Mehrere Requests mit derselben Referenz bringen ja nichts, weil dann immernoch nicht klar ist, auf welche Komponente bzw. Wirkstoff sich die Dosierung bezieht. Und wenn man in Request.medication ein CodeableConcept angibt geht wieder die Referenz zur PZN verloren... M.E. kann man mit FHIR das gar nicht abbilden - was meint die Community?</p>",
        "id": 228934582,
        "sender_full_name": "André Sander",
        "timestamp": 1614942134
    },
    {
        "content": "<p>Ich glaube dass hier weniger FHIR an seine Grenzen stößt, als viel mehr PZN, weil dort zwei eigentlich unabhängige Medikamente mit einem einzigen Code repräsentiert werden, weil sie in einer Packung verkauft werden, oder shee ich das falsch?<br>\nWürde man die beiden Bestandteile separat mit ATC-Codes (siehe <a href=\"https://www.drugbase.de/de/datenbanken/abda-datenbank/aktuelle-infos/artikel.html?tx_ttnews%5Bpointer%5D=5&amp;tx_ttnews%5Btt_news%5D=2183143&amp;tx_ttnews%5BbackPid%5D=115\">hier</a>) darstellen, wäre es vermutlich kein Problem...</p>",
        "id": 228940610,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1614945252
    },
    {
        "content": "<p>Das Problem kennen wir ja auch schon von der \"Anti Baby Pille\". Stichwort Sequenzialpräparate. Wahrscheinlich am besten als Text Anmerkung in der Dosierungsanweisung, und ansonsten 1 Tablette pro Tag...</p>",
        "id": 228959983,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614953703
    },
    {
        "content": "<p>Nein, Anti-Baby-Pille ist trivial - solche Dosierungen lassen sich einfach abbilden. Fr. Heckmann, im Prinzip haben Sie recht aber es ist eben sehr gebräuchlich. Beispiel  Dolomo, das gibt es auch in RxNorm. Das ist ein Schmerzmittel, bei dem in der Packung weiße und blaue Tabletten sind. Die einen nimmt man tagsüber die anderen nachts. Dabei darf man tagsüber 2-3 nehmen, nachts aber nur eine. Man hat also auf einen Tag zwei verschiedene Dosierungen, die sich auf jeweils einen Bestandteil der Packung beziehen. Wenn ich also statt einer PZN eine RxNorm-ID verwende, habe ich hier dasselbe Problem. Ich glaube auch mit einer hierarchischen Modellierung (PZN--&gt;ATC) kommt man hier nicht weiter. Von der Handhabbarkeit mal ganz schweigen. M.E. sollte man Dosage mit einem optionalen Bezug erweitern.</p>",
        "id": 228966182,
        "sender_full_name": "André Sander",
        "timestamp": 1614956123
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"213583\">André Sander</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Medication.20-.20PZN.20und.20Komponenten/near/228966182\">said</a>:</p>\n<blockquote>\n<p>Nein, Anti-Baby-Pille ist trivial - solche Dosierungen lassen sich einfach abbilden. </p>\n</blockquote>\n<p>Beispiel: Biviol PZN: 02710881<br>\n– jede blaue Tablette enthält 0,025 mg Desogestrel und 0,040 mg Ethinylestradiol<br>\n– jede weiße Tablette enthält 0,125 mg Desogestrel und 0,030 mg Ethinylestradiol<br>\n\"Hierbei wird an 22 aufeinander folgenden Tagen täglich 1 Tablette eingenommen, beginnend mit den blauen Tabletten (7 Tage), gefolgt von den weißen Tabletten (15 Tage). Vor jeder weiteren Blisterpackung ist ein 6-tägiges einnahmefreies Intervall einzulegen\"</p>",
        "id": 228984798,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614962726
    },
    {
        "content": "<p>MedicationRequest.dosageInstruction ist 0..*, es könnten also mehrere unabhängige  Dosierungen für ein und das selbe Medikament angegeben werden. Das Problem ist jedoch: Wie ordnet man die Dosierungen einer Komponente zu? Textuell könnte man das in Dosage.additionalInstruction unterbringen (\"die weiße Tablette\")<br>\nWenn man's maschinenlesbar machen will wird's schwierig. Aber die Frage ist:</p>\n<ol>\n<li>gibt es einen UseCase dafür?</li>\n<li>wie könnte man die Komponenten maschinenlesbar unterscheiden? (Wie codiert man \"die weiße Tablette\")?</li>\n</ol>",
        "id": 228986965,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1614963519
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191450\">Simone Heckmann</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Medication.20-.20PZN.20und.20Komponenten/near/228940610\">said</a>:</p>\n<blockquote>\n<p>Würde man die beiden Bestandteile separat mit ATC-Codes (siehe <a href=\"https://www.drugbase.de/de/datenbanken/abda-datenbank/aktuelle-infos/artikel.html?tx_ttnews%5Bpointer%5D=5&amp;tx_ttnews%5Btt_news%5D=2183143&amp;tx_ttnews%5BbackPid%5D=115\">hier</a>) darstellen, wäre es vermutlich kein Problem...</p>\n</blockquote>\n<p>Wie wäre es mit zwei MedicationRequests, die sich jeweils auf eine ATC-codierte Medication beziehen? Beide Requests dann mit MedicationRequest.basedOn an einen übergreifenden MedicationRequest hängen, der sich auf die PZN-codierte Medication bezieht. Bei letzterem dann die dosageInstruction weglassen oder geeignet verallgemeinern.</p>",
        "id": 228987232,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614963607
    },
    {
        "content": "<p>..oooooder: Bei den MedicationRequest.medicationCodeableConcept mehrfach codieren (ATC + PZN).<br>\nJeder Requests hätte dann die Dosis zu dem jeweiligen ATC-Code....</p>",
        "id": 228988520,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1614964028
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191450\">Simone Heckmann</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Medication.20-.20PZN.20und.20Komponenten/near/228986965\">said</a>:</p>\n<blockquote>\n<p>wie könnte man die Komponenten maschinenlesbar unterscheiden? (Wie codiert man \"die weiße Tablette\")?</p>\n</blockquote>\n<p>Farbe etc. kann über MedicationKnowledge.drugCharacteristic bereitgestellt werden. Bleibt die Frage, wie man dann den identifier wählt. Vielleicht PZN/ATC konkatenieren?</p>",
        "id": 228988720,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614964094
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191450\">Simone Heckmann</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Medication.20-.20PZN.20und.20Komponenten/near/228988520\">said</a>:</p>\n<blockquote>\n<p>..oooooder: Bei den MedicationRequest.medicationCodeableConcept mehrfach codieren (ATC + PZN).<br>\nJeder Requests hätte dann die Dosis zu dem jeweiligen ATC-Code....</p>\n</blockquote>\n<p>Geht natürlich, ist aber nicht schön. Verstößt m. E. gegen die Regeln für den Datentyp \"Each coding (also referred to as a 'translation') is a representation of the concept as described above and may have slightly different granularity due to the differences in the definitions of the underlying codes.\"</p>",
        "id": 228989110,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614964239
    },
    {
        "content": "<p>Den Identifier wo von?</p>",
        "id": 228989238,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1614964282
    },
    {
        "content": "<p>den identifier, um auf genau diese MedicationKnowledge zu verweisen.</p>",
        "id": 228989391,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614964336
    },
    {
        "content": "<p>oder geht das vielleicht einfach durch Reference auf die MedicationKnowledge resource in MedicationRequest.supportingInformation?</p>",
        "id": 228990102,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614964592
    },
    {
        "content": "<p>bräuchte man zur Beschreibung der PZN eine oder zwei MedicationKnowledges?<br>\nWenn eine, dann Identifier=PZN. Wenn zwei, dann vielleicht auch, aber diese MK verlinkt dann mit associatedMedication oder relatedMedicationKnowledge auf die Komponenten (Identifier = ATC)...?</p>\n<p>Ich werde aus der Semantik von relatedMedicationKnowledge nicht so richtig schlau, weil kaum Doku dran ist und type kein ValueSet-Binding hat....</p>",
        "id": 228990500,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1614964730
    },
    {
        "content": "<p>Ok, jetzt mal egal wie man die MedicationKnowledge in seinem Catalog organisiert hat. Im use case \"request\" würde man die knowledge halt mit in das request bundle packen, und mit associatedMedication an die richtige Stelle anbinden.</p>",
        "id": 228991115,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614964969
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193991\">Christof Gessner</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Medication.20-.20PZN.20und.20Komponenten/near/228989391\">said</a>:</p>\n<blockquote>\n<p>den identifier, um auf genau diese MedicationKnowledge zu verweisen.</p>\n</blockquote>\n<p>Sorry, wenn ich \"identifier\" sage, meine ich manchmal \"code\". Zur Verwendung von MedKnowledge siehe auch hier: <a href=\"#narrow/stream/179249-Medication/topic/MedicationKnowledge\">https://chat.fhir.org/#narrow/stream/179249-Medication/topic/MedicationKnowledge</a></p>",
        "id": 228993577,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614965894
    },
    {
        "content": "<p>In FHIR ist das etwas lockerer was ein Medication sein kann. Das kann sich um eine Packung handeln, aber womöglich auch um ein Fertigarzneimittel, das in einer Packung steckt. (Das selbe Fertigarzneimittel kann auch in unterschiedlichen Packungen stecken, im einfachsten Fall bei unterschiedlichen Packungsgrößen). Für den Fall, dass es sich bei der Medication um eine Packung handelt können in ingredient mit Referenzen wiederum auf Medication mehrere Arzneimittel verwiesen werden, die in einer Kombipackung enthalten sind. Dann bleibt eigentlich nur die Frage, ob es Sinn macht bei Kombipackungen mehrere MedicationRequests für die mehreren Arzneimittel in einer Packung zu haben.</p>",
        "id": 229281184,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1615201499
    },
    {
        "content": "<p>Zunächst mal mea culpa - dass es den Fall bei Biviol gibt war mir so gar nicht klar. <br>\nDa sowohl Request als auch Administration auf eine Medication Ressource verweisen ist wohl die Modellierung über Medication.ingredient --&gt; Medication am besten. Allerdings liefern die Hersteller der Rohdaten auch keine strukturierten Daten, so dass man so ein Modell gar nicht algorithmisch konstruieren kann.</p>",
        "id": 229433721,
        "sender_full_name": "André Sander",
        "timestamp": 1615275178
    }
]