[
    {
        "content": "<p>Nach einer Frage von einem Implementierer habe ich selber zwei Fragen zu Kombinationen von Abgabeangaben:<br>\n1. Laut MPP-Profil könnte man menhrere Einträge in <code>MedicationStatement.dosage</code> mit den gleichen Kode haben, z.B. zwei Einträge mit \"1 Pille zu CV\". Ich würde denken, dass es keinen Sinn macht, und das man stattdessen einen Eintrag mit \"2 Pillen zu Cv\" machen.</p>",
        "id": 160567885,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1552396016
    },
    {
        "content": "<p>Aber übersehe ich hier einen validen Usecase, wo zwei Einträge mit dem gleichen Kode eine besondere Bedeutung hat?</p>",
        "id": 160567980,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1552396086
    },
    {
        "content": "<p>2. Wie ist es zu verstehen, falls man in <code>dosage</code> Einträge für den Slice \"kodiert\" sowie als auch den Slice \"freitext\" hat? Ist der Freitext dann immer als begleitende Kommentar zu den kodierten Einträgen zu verstehen? Oder gibt es Fälle, in den im Freitext-Eintrag <em>weitere</em> Abgaben  (die sicht nicht in den kodierten Einträgen wiederfinden) definiert sind?</p>",
        "id": 160568649,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1552396675
    },
    {
        "content": "<p>Oder müsste man solche Hybridangaben vermeiden und einfach einen Freitext daraus machen?</p>",
        "id": 160568654,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1552396679
    },
    {
        "content": "<p>Da gibt es vielleicht keine perfekten Antworten, aber vielleicht hat jemanden sich ja schon damit auseinandergesetzt</p>",
        "id": 160568772,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1552396779
    },
    {
        "content": "<p>zu 1. ) Wenn ich mich richtig erinnere, gab es da ein Problem mit dem Slicing, weshalb wir nicht pro Code einen Slice mit 0..1 machen konnten. Das wäre aber die Intention gewesen. Es gab keine Möglichkeit, einen Discriminator auf code zu definieren, der damit klar kommt,  dass es auch einen Slice ohne code geben kann. Das sollte aber in einer späteren Version korrigiert werden, wenn das Tooling komplexe Discriminator unterstützt.  Dann könnte man auch ausschließen, dass codiert und Freitext gleichzeitig vorkommen können. Wobei ich mir da jetzt nicht sicher bin, ob das so gewollt wäre (<span class=\"user-mention\" data-user-id=\"191532\">@dr Kai U. Heitmann</span> , <span class=\"user-mention\" data-user-id=\"194952\">@Julian Sass</span> ?)</p>",
        "id": 160760347,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1552552013
    },
    {
        "content": "<p>Danke <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>, dann weiss ich ja schon, daß ich nicht ganz daneben lag.</p>",
        "id": 160866853,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1552649975
    }
]