[
    {
        "content": "<p>Hallo zusammen,<br>\nwie schon im Rahmen des Interop-Forums besprochen füge ich unter diesem Link (<a href=\"https://docs.google.com/spreadsheets/d/1SGiSNUL4Y4y_jcr7By2lskDRqPH27BmOEPAFblZedSA/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/1SGiSNUL4Y4y_jcr7By2lskDRqPH27BmOEPAFblZedSA/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1SGiSNUL4Y4y_jcr7By2lskDRqPH27BmOEPAFblZedSA/edit?usp=sharing</a>) eine Mapping-Tabelle ausgewählter P21-Datensatz-Items (hier der Link auf dessen Spezifikation: <a href=\"http://www.g-drg.de/Datenlieferung_gem._21_KHEntgG/Dokumente_zur_Datenlieferung/Datensatzbeschreibung\" target=\"_blank\" title=\"http://www.g-drg.de/Datenlieferung_gem._21_KHEntgG/Dokumente_zur_Datenlieferung/Datensatzbeschreibung\">http://www.g-drg.de/Datenlieferung_gem._21_KHEntgG/Dokumente_zur_Datenlieferung/Datensatzbeschreibung</a>) ins FHIR als ersten Vorschlag   für eine weitere Diskussion bei, wie mit der Abbildung in FHIR zu verfahren ist. Diese Tabelle ist eine erste Sammlung möglicher Abbildungen auf Ressourcen, welche die Elemente des MI-I-Kerndatensatzes enthalten würden. Wir wollen ja die Daten weitestgehend als bestehende Ressourcen abbilden und als eventuell nötige neue Attribute etc. dann als Erweiterungen im Basisprofil-DE definieren. Als Erstes ist die Frage, passen die ausgewählten Ressourcen so auf die genannten P21-Items?</p>",
        "id": 153943763,
        "sender_full_name": "Kutaiba Saleh",
        "timestamp": 1520850121
    },
    {
        "content": "<p>Auf den ersten Blick sehe ich da noch Ungereimtheiten. Eine Diagnose z.B. entspricht grundsätzlich einer Condition. Zu den administrativen/FM-Ressourcen kann wahrscheinlich <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> mehr sagen.</p>\n<p>Generell noch einmal zum Begriff \"identifier\", da hier wohl ein systematischer Irrtum vorliegt. Identifier meint unique Business Identifier (\"A numeric or alphanumeric string that is associated with a single object or entity within a given system.\")<br>\nIn der Tabelle werden aber Kategorisierungs- bzw. Versionierunginformationen dorthin gemappt.</p>\n<p>Grundsätzlich hatten wir ja abgestimmt, dass wir die besagten Datenelemente in den Basisprofilen abbildbar machen. Ich denke, es macht Sinn, wenn wir uns hierzu auch im Rahmen der Basisprofil-Weiterentwicklung erstmal Gedanken machen.</p>",
        "id": 153943782,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1520861021
    },
    {
        "content": "<p>Bezüglich \"Institutionskennzeichen des verlegenden Krankenhauses -Fall.CSV.30\": Ich habe in vorauseilendem Gehorsam schon einen ChangeRequest für R4 eingereicht, dass Encounter.hospitalization.origin alternativ auch auf Organization verweisen können muss (statt nur Location). Der Antrag ist bereits angenommen worden und die Änderungen sind für R4 durchgeführt (siehe <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15021\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15021\">GF#15021</a>).<br>\nDa im Kerndatensatz jedoch die Angabe des Identifiers (IK-Nummer) ausreichend ist, würde ich hier ohnehin die Verwendung einer Logical Reference (<a href=\"http://build.fhir.org/references.html#logical\" target=\"_blank\" title=\"http://build.fhir.org/references.html#logical\">http://build.fhir.org/references.html#logical</a>) empfehlen. Anstatt einer Referenz auf eine Organization-Resource würde also nur der Identifier angegeben. Damit sollte die Umsetzung auch in STU3 unproblematisch sein.</p>",
        "id": 153943979,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1520890591
    },
    {
        "content": "<p>Entgelte = ChargeItems?</p>",
        "id": 153943998,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1520893745
    },
    {
        "content": "<p>Hi Simone, siehst Du die logical reference als Ergänzung/Workaround für literal references- oder ersetzend? In diesem Fall, und auch allgemein? Könnten wir mal ein “Designprinzip” für solche Fälle schreiben?</p>",
        "id": 153944213,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1520927035
    },
    {
        "content": "<p>Logical References sind aus meiner Sicht überall dort sinnvoll, wo die Nennung eines (nationalen) Identifiers ausreicht, um ein Objekt für alle an der Kommunikation beteiligten ausreichend zu beschreiben. Es obliegt den empfangenden Systemen, diese logische Referenz dann durch einen \"echten\" Link auf die diesem Identifier entsprechenden Ressource zu ersetzen, oder die logische Referenz beizubehalten.</p>\n<p>Wenn über ein Objekt nichts als der Identifier bekannt ist (IK-Nr. für Organisation, LANR für Practitioner), wäre es Overkill, dafür eine separate Ressource anzulegen, in der nur dieses eine Attribut gefüllt ist. Ob logische Referenzen in einem Use Case erlaubt sind, sollte im jeweiligen Profil festgelegt werden.</p>",
        "id": 153944215,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1520928167
    },
    {
        "content": "<p>Noch sinnvoller wäre die Verwendung von LRs natürlich überall dort, wo nationale Registries im Einsatz sind, also die Details einer Organisation oder eines Practitioners anhand des nationalen Identifiers in einer Registry nachgeschlagen werden können. Dann macht es überhaupt keinen Sinn mehr, diese Details bei jeder Kommunikation auszutauschen. Aber soweit sind wir halt in Deutschland leider noch nicht...</p>",
        "id": 153944216,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1520928323
    },
    {
        "content": "<p>Ist letzteres aber nicht exakt der Use Case für Literal References, die Resource wird darüber per FHIR von der Registry abgeholt? Und: auch bei Verwendung logischer Referenzen muss die Resource (z. B im Bundle) bereitgestellt werden. Oder sprichst Du von Ersetzung der Reference durch einen Identifier? Das ist m. E. dann aber was anderes als eine logical reference.</p>",
        "id": 153944218,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1520928825
    },
    {
        "content": "<p>vgl z B MedicationRequest.medication, auch wenn es hier um CodeableConcept statt Identifier geht.</p>",
        "id": 153944221,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1520929315
    },
    {
        "content": "<p>Logical Reference (<a href=\"https://www.hl7.org/fhir/references.html#logical\" target=\"_blank\" title=\"https://www.hl7.org/fhir/references.html#logical\">https://www.hl7.org/fhir/references.html#logical</a>): </p>\n<div class=\"codehilite\"><pre><span></span><span class=\"nt\">&lt;patient&gt;</span>\n    <span class=\"nt\">&lt;identifier&gt;</span>\n      <span class=\"nt\">&lt;system</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://hl7.org/fhir/sid/us-ssn&quot;</span> <span class=\"nt\">/&gt;</span>\n      <span class=\"nt\">&lt;value</span> <span class=\"na\">value=</span><span class=\"s\">&quot;000111111&quot;</span> <span class=\"nt\">/&gt;</span>\n    <span class=\"nt\">&lt;/identifier&gt;</span>\n  <span class=\"nt\">&lt;/patient&gt;</span>\n</pre></div>\n\n\n<p>Das ist im Endeffekt ja dem der CodeableConcept Referenz sehr ähnlich, benutzt ein system und den value</p>",
        "id": 153944241,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1520930610
    },
    {
        "content": "<p>Bei einer Registry will ich ja über den bekannten identifizierenden value die Organization holen, dies ist der Identifier. Die ID der literal Reference ist mir ja erstmal nicht bekannt. Man könnte natürlich den Auskunftsdienst so bereitstellen, dass die Organization unter /Organization/&lt;IK_NUMMER&gt; erreichbar wäre - aber das ist momentan nicht der präferierte Weg (soweit ich das überblicke). Das Argument hier ist immer, dass die ID vom Server vergeben wird und sich somit bei Transfers von Server zu Server ändern wird. Der Identifier bleibt hingegen bekannt.</p>",
        "id": 153944244,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1520931023
    },
    {
        "content": "<p>Wenn man auf ein Registry verlinkt fände ich &lt;Registry_URL&gt;/RessourceName/Identifier aber auch gar nicht mal so unelegant</p>",
        "id": 153944245,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1520931100
    },
    {
        "content": "<p>\"auch bei Verwendung logischer Referenzen muss die Resource (z. B im Bundle) bereitgestellt werden\" <br>\nNein, wieso?<br>\n\"Mvgl z B MedicationRequest.medication, auch wenn es hier um CodeableConcept statt Identifier geht.\" Hier besteht ja im MPP genau die Situation, dass mehr Infos zu dem Medikament erfasst werden, als nur die PZN, z.B. auch die Darreichungsform.<br>\nUnd das es kein \"offizielles Deutsches Medikamentenverzeichnis\" gibt, in dem man dies bei Bedarf anhand der PZN nachschlagen könnte, muss das halt in jedem MPP enthalten sein...</p>",
        "id": 153944248,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1520931419
    },
    {
        "content": "<p>Wir sprechen vielleicht nicht über die gleiche Sache hier? Es gibt einerseits Resourcen, in denen Reference als Alternative in einer Choice auftaucht (Questionnaire.item.initial[x], ConceptMap.source[x], MedicationStatement.medication[x] etc. ), oder nicht als Choice sondern nebeneinander, wie in DocumentReference.context.related. Andererseits bietet der Datentyp Reference selbst zwei Varianten, eine Resource zu bezeichnen: literal und logical reference. Dabei scheint mir hier die Art der Referenzierung aber keinen Einfluss auf die Anforderungen an die referenzierte Ressource zu haben, sind eben bloß zwei unterschiedliche Arten, diese zu bezeichnen.</p>",
        "id": 153944267,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1520933527
    },
    {
        "content": "<p>Ich denke, dass hier weitgehend Konsens besteht: es geht um die Varianten innerhalb des Reference-Datentyps.</p>\n<p>Zu Logical References vgl. <a href=\"http://hl7.org/fhir/references.html#logical\" target=\"_blank\" title=\"http://hl7.org/fhir/references.html#logical\">http://hl7.org/fhir/references.html#logical</a> : \"<br>\n In many contexts where FHIR is used, applications building a resource may know an identifier for the target of the reference, but there is no way for the application to convert this to a literal reference that directly references an actual resource. This situation may arise for several reasons:<br>\n- There is no server exposing any such resource. This is often the case with national identifiers (e.g. US SSN or NPI), and such identifiers are widely used<br>\n- The server that exposes the resource is not available to the source application, so it has no way to resolve an identifier to a reference<br>\n- The application is not in a RESTful environment - it is creating a message or a document<br>\n\"</p>\n<p>Das beschreibt Use Cases, in denen es z.T. per se unmöglich ist, eine Ressource zum logisch referenzierten Target zu haben bzw. zu kennen. Dann kann man natürlich außer der logischen Referenz (=&gt; dem referenzierten Identifier) auch nichts in ein Bundle bringen.</p>",
        "id": 153944276,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1520934379
    },
    {
        "content": "<p>Klassisches Beispiel:<br>\n(Fast) jedes System in D kennt intern eine Liste der KVen mit IK, Name, Adresse usw.<br>\nEs reicht aber in der Regel völlig, hier die IK zu übermitteln =&gt; logical reference</p>",
        "id": 153944277,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1520934520
    },
    {
        "content": "<p>Wenn ich weiß, dass ich nur den Identifier (oder den Code) brauche, und niemals eine literale Referenz, dann brauche ich an der Stelle auch keinen Datentyp Reference nehmen. Oder ?</p>",
        "id": 153944283,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1520935275
    },
    {
        "content": "<p>Wenn es ein Code ist, ist der Datentyp ja CodeableConcept.<br>\nUm eine Referenz per Identifier (also die logische Referenz) auszudrücken, ist aber genau der Reference-Datentyp vorgesehen.</p>",
        "id": 153944284,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1520935390
    },
    {
        "content": "<p>Dier Option \"logical reference\" wurde kurz vor STU3 eingeführt. Daher haben viele Ressourcen immer noch value[x]-Attribute mit (Reference|Identifier). Diese sollten in R4 jedoch alle auf den Datentyp Reference konsolidiert werden, da die choice damit redundant ist.</p>",
        "id": 153944285,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1520935412
    },
    {
        "content": "<p>Danke sehr, Simone, das beantwortet meine Frage abschließend!</p>\n<p>Und welche Resourcen in das Bundle müssen, ist für eine Composition genau spezifiziert (siehe 2.41.2 in <a href=\"https://www.hl7.org/fhir/composition.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/composition.html\">https://www.hl7.org/fhir/composition.html</a> ). Dazu gehören u. a. auch Composition.custodian und Composition.encounter. Heißt also: auch wenn nur BSNR oder IK-Nr. bekannt, muss die Resource Custodian ins Körbchen.</p>",
        "id": 153944287,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1520936123
    },
    {
        "content": "<p>Ja, bei einer Composition muss diese SHALL Liste als resource mit ins Bundle sofern diese aus Composition heraus Referenziert werden.</p>",
        "id": 153944288,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1520936516
    },
    {
        "content": "<p>Was ich persönlich für nicht optimal erachte, im falle einer Logical Reference sollte das SHALL keinen Bestand haben.<br>\nSollen wir ein Tracker Item erstellen? Oder wurde das schonmal diskutiert?<br>\nEs gibt kein TrackerItem und es wurde noch nicht explizit in diesem Kontext auf Zulip diskutiert, ich erstelle mal...</p>",
        "id": 153944289,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1520936589
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15760\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15760\">GF#15760</a></p>",
        "id": 153944290,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1520937699
    },
    {
        "content": "<blockquote>\n<p>Auf den ersten Blick sehe ich da noch Ungereimtheiten. Eine Diagnose z.B. entspricht grundsätzlich einer Condition. Zu den administrativen/FM-Ressourcen kann wahrscheinlich <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> mehr sagen.</p>\n<p>Generell noch einmal zum Begriff \"identifier\", da hier wohl ein systematischer Irrtum vorliegt. Identifier meint unique Business Identifier (\"A numeric or alphanumeric string that is associated with a single object or entity within a given system.\")<br>\nIn der Tabelle werden aber Kategorisierungs- bzw. Versionierunginformationen dorthin gemappt.</p>\n<p>Grundsätzlich hatten wir ja abgestimmt, dass wir die besagten Datenelemente in den Basisprofilen abbildbar machen. Ich denke, es macht Sinn, wenn wir uns hierzu auch im Rahmen der Basisprofil-Weiterentwicklung erstmal Gedanken machen.</p>\n</blockquote>\n<p>Danke sehr für die Informationen. Ich pflege eure Hinweise in die Tabelle ein.(auch IKs ) <br>\nWir haben dabei auch ermittelt, dass clinicalStatus und verificationStatus für die Abbildung der Diagnosesicherheit im ICD-10 nicht geeignet sind. clinicalStatus bezeichnet den Status einer Erkrankung und verificationStatus den Status einer Diagnose. Die Sicherheit einer Diagnose (Verdacht, ausgeschlossen, gesichert, symptomlos) ist jedoch inhaltlich nochmal etwas anderes. Ggf. gibt es diese Konzepte aber auch bereits im HL7 RIM und es wäre ein erweiterndes Attribut hier noch hilfreich?</p>",
        "id": 153944779,
        "sender_full_name": "Kutaiba Saleh",
        "timestamp": 1521042155
    },
    {
        "content": "<p>Wie die Notation von ICD10-GM in FHIR erfolgen soll wird gerade von <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> und <span class=\"user-mention\" data-user-id=\"194952\">@Julian Sass</span> geklärt. Ich bin aber vorsichtig pessimistisch ob die Zusatzkennzeichen L,R,B sowie die Diagnosesicherheit als postkoordinierter ICD10-GM Code \"erlaubt\" werden.</p>",
        "id": 153944789,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521044869
    },
    {
        "content": "<p>da laut: <a href=\"https://chat.fhir.org/#narrow/stream/german.20(d-a-ch)/subject/ICD-10/near/132320\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/german.20(d-a-ch)/subject/ICD-10/near/132320\">https://chat.fhir.org/#narrow/stream/german.20(d-a-ch)/subject/ICD-10/near/132320</a> ohnehin die Information zusätzlich als Extension enthalten sein sollte wäre die Abbildung über Extensions sinnvoll.</p>",
        "id": 153944791,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521044985
    },
    {
        "content": "<p>related hierzu: <a href=\"https://fhirblog.com/2017/01/10/extending-a-required-valueset-binding/\" target=\"_blank\" title=\"https://fhirblog.com/2017/01/10/extending-a-required-valueset-binding/\">https://fhirblog.com/2017/01/10/extending-a-required-valueset-binding/</a></p>",
        "id": 153944793,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521045148
    },
    {
        "content": "<p>Die Seitenlokalisation (also L, R,B) hatten wir vor Längerem als Condition.bodySite angedacht.<br>\nIch bin mir aber nicht sicher, ob das so ideal wäre. Wahrscheinlich würde man dort eher einen separaten Lokalisations-Code erwarten, also z.B. ICD-O-3-Topographie-Codes oder dergleichen.<br>\nAnsonsen wäre das dann tatsächlich eine Extension. Ich bin hier aber extrem offen für Meinungen und Feedback.</p>",
        "id": 153944805,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521046294
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193846\">@Kutaiba Saleh</span> Es erscheint mir durchaus möglich, die Diagnosesicherung auf clinicalStatus und verificationStatus zu mappen.<br>\ncStatus und vStatus bezeichnen Statusinformationen der Condition, zu deutsch; Gesundheitsstatus/Erkrankung, ausgedrückt durch eine ICD-10-codierte Diagnose.<br>\nWas spricht gegen:</p>\n<p>Verdacht &lt;==&gt; cS \"active\", vS \"provisional\"<br>\nausgeschlossen &lt;==&gt; cS \"active\", vS \"refuted\"<br>\ngesichert &lt;==&gt;  cS \"active\", vS \"confirmed\"<br>\n(symptomloser) Zustand nach &lt;==&gt; cS \"inactive\" [Edit: oder \"resolved\"]</p>\n<p>Man muss diese beiden Status-Informationen sogar entsprechend füllen, da sie Modifier sind - eine ausgeschlossene Diagnose ist ja die Negation einer gesicherten. Ein System, das gerade keine deutschen Profile kennt, muss in der Lage sein, das aus den \"offiziellen\" FHIR Elementen abzuleiten.</p>\n<p>Es erscheint mir allerdings sinnvoll, hier dennoch eine Extension zu haben, die die in ICD-10-GM üblichen Codes dazu enthält. Das ist dann zwar inhaltlich redundant, aber sicher praxis-orientierter.</p>",
        "id": 153944808,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521047438
    },
    {
        "content": "<p>(Genau genommen ist es ICD-10, wo die semantischen Konzepte von clinicalStatus und verificationStatus in die Diagnosesicherungscodes gemischt sind)</p>",
        "id": 153944810,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521047738
    },
    {
        "content": "<p>Wir beschäftigen uns gerade auch mit Diagnosen. Condition.verificationStatus hatten wir auch für die Diagnosesicherheit angedacht. </p>\n<p>Bei der Lokalisation denken wir auch über die Verwendung von Condition.bodySite nach. Da würde man ja dann nur ein CodeSystem für L, R und B benötigen - oder was waren eure Gedanken dazu, <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> ? Ein bisschen merkwürdig bei bodySite ist allerdings schon, dass L, R und B ja nicht sehr spezifisch sind und man bodySite beispielsweise auch für Zahnnummern verwendet. Dadurch ist die Verwendung schon sehr unterschiedlich. Bei der Extension besteht dann nur wieder die Gefahr, dass sie niemand versteht. Ich bin da noch unentschlossen, welche der Alternativen besser ist. </p>\n<p>Zusätzlich wollen wir auch noch aussagen können, ob es sich um eine Haupt- oder Nebendiagnose handelt. Das macht man dem Basisprofil nach via category, richtig?</p>",
        "id": 153945390,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1521205056
    },
    {
        "content": "<p>bodySite ist 0..* daher können wir slicen und fordern, dass immer mindestens eine gültige R/L/B-Angabe gemacht werden muss, man aber zusätzlich auch noch differenziertere Angaben machen kann...<br>\nHaupt/Nebendiagnose sehe ich eher in Encounter.diagnosis.role, da das ja eine Eigenschaft bezogen auf einen Fall ist, nicht direkt eine Eigenschaft der Diagnose.</p>",
        "id": 153945391,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521205742
    },
    {
        "content": "<p>...das ValueSet müssen wir für DE aber noch zurechtfönen...</p>",
        "id": 153945392,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521205843
    },
    {
        "content": "<p>Moment, ist Haupt/Nebendiagnose das gleiche wie Primär/Sekundärdiagnose...? Dann wäre es Encounter.diagnosis.rank!</p>",
        "id": 153945393,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521205927
    },
    {
        "content": "<p>Laut den Beispielen wäre Hauptdiagnose (\"Principal Diagnosis\") so darzustellen:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"c\">&lt;!--    Example of a principal diagnosis with role=CC and rank=1   --&gt;</span>\n  <span class=\"nt\">&lt;diagnosis&gt;</span>\n    <span class=\"nt\">&lt;condition&gt;</span>\n      <span class=\"nt\">&lt;display</span> <span class=\"na\">value=</span><span class=\"s\">&quot;The patient is treated for a tumor&quot;</span><span class=\"nt\">/&gt;</span>\n    <span class=\"nt\">&lt;/condition&gt;</span>\n    <span class=\"nt\">&lt;role&gt;</span>\n      <span class=\"nt\">&lt;coding&gt;</span>\n        <span class=\"nt\">&lt;system</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://hl7.org/fhir/diagnosis-role&quot;</span><span class=\"nt\">/&gt;</span>\n        <span class=\"nt\">&lt;code</span> <span class=\"na\">value=</span><span class=\"s\">&quot;CC&quot;</span><span class=\"nt\">/&gt;</span>\n        <span class=\"nt\">&lt;display</span> <span class=\"na\">value=</span><span class=\"s\">&quot;Chief complaint&quot;</span><span class=\"nt\">/&gt;</span>\n      <span class=\"nt\">&lt;/coding&gt;</span>\n    <span class=\"nt\">&lt;/role&gt;</span>\n    <span class=\"nt\">&lt;rank</span> <span class=\"na\">value=</span><span class=\"s\">&quot;1&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;/diagnosis&gt;</span>\n</pre></div>",
        "id": 153945395,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521206038
    },
    {
        "content": "<p>Ein ValueSet bzw. Codesystem für L/R/B haben wir ja schon:<br>\n<a href=\"https://simplifier.net/BasisprofilDE/s-icd-seitenlokalisation-2\" target=\"_blank\" title=\"https://simplifier.net/BasisprofilDE/s-icd-seitenlokalisation-2\">https://simplifier.net/BasisprofilDE/s-icd-seitenlokalisation-2</a></p>",
        "id": 153945396,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521206168
    },
    {
        "content": "<p>\"Zurechtfönen\" bezog sich auf diagnosis-role</p>",
        "id": 153945397,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521206210
    },
    {
        "content": "<p>Verstanden :)<br>\nIch bezog mich gerade auf Evelyns Frage oben ;)</p>",
        "id": 153945398,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521206250
    },
    {
        "content": "<p>bodySite slicen wäre eine Option.<br>\nWobei natürlich ICD-O-3-Topo wiederum das angehängte L/R/B kennt ...</p>",
        "id": 153945399,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521206302
    },
    {
        "content": "<p>Ich persönlich wäre nicht böse darum, wenn wir die ganze Haupt/Neben/Primär/Sekundär/.... Zuordnung nicht in der Condition drin hätten.</p>\n<p>Allein schon: was für die eine Abteilung die Hauptdiagnose ist, ist für die andere die Nebendiagnose.<br>\nNur weil Patient X plötzlich Krebs hat, ist für die Nephrologie ja nicht plötzlich die Niereninsuffizienz eine Nebendiagnose.</p>",
        "id": 153945400,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521206479
    },
    {
        "content": "<p>Das ist also immer kontextabhängig</p>",
        "id": 153945401,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521206503
    },
    {
        "content": "<p>Auf jeden Fall habe ich mir vorgenommen, den aktuellen Diskussionsstand nächste Woche mal in das condition-de-basis-Profil einzubauen.<br>\nDann hat man eine bessere Basis für weitere Diskussionen.</p>",
        "id": 153945402,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521206820
    },
    {
        "content": "<p>Zum Thema Lokalisation haben wir auch noch <a href=\"http://build.fhir.org/bodystructure.html\" target=\"_blank\" title=\"http://build.fhir.org/bodystructure.html\">http://build.fhir.org/bodystructure.html</a><br>\nDort gibt es z.B. so etwas wie locationQualifier ...</p>",
        "id": 153945403,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521206961
    },
    {
        "content": "<p>Leider kann man das nicht direkt mit Condition verknüpfen.<br>\nIch halte dazu einen CR für sinnvoll. Meinungen?</p>",
        "id": 153945406,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521207085
    },
    {
        "content": "<p>\"for example it can be the target of a Procedure resource or Observation resource\"<br>\n...ist es aber (noch) nicht. Die Ressource scheint noch sehr frisch zu sein...</p>",
        "id": 153945408,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521207315
    },
    {
        "content": "<p>...was in Bezug auf Observation interessant ist, da Kandidat für Normative :P</p>",
        "id": 153945409,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521207377
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=3600&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=3600&amp;start=0\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=3600&amp;start=0</a></p>",
        "id": 153945411,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521207493
    },
    {
        "content": "<p>Ah! das wird über die Extension gemacht: <a href=\"http://build.fhir.org/extension-body-structure.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-body-structure.html\">http://build.fhir.org/extension-body-structure.html</a></p>",
        "id": 153945412,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521207505
    },
    {
        "content": "<p>Die kann man natürlich überall benutzen, einschließlich Condition...</p>",
        "id": 153945413,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521207519
    },
    {
        "content": "<p>Hm, das widerspricht ein bisschen dem gerade verlinkten <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=3600\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=3600\">GF#3600</a></p>",
        "id": 153945414,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521207545
    },
    {
        "content": "<p>...der ist von 2014  :)</p>",
        "id": 153945415,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521207571
    },
    {
        "content": "<p>Ja, aber trotz accepted motion wurde er nicht vollständig umgesetzt:</p>\n<p>'<br>\nMotion for “straw vote for OO direction” for bodysite to be choice of codeableconcept|to-be-developed BodySite Resource<br>\n'</p>",
        "id": 153945416,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521207620
    },
    {
        "content": "<p>Condiiton.bodySite ist nach wie vor CodeableConcept only</p>",
        "id": 153945417,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521207652
    },
    {
        "content": "<p>Aber gut, wenn es eine Extension gibt, hat man sich wohl irgendwann anders entschieden</p>",
        "id": 153945418,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521207680
    },
    {
        "content": "<p>vermutlich.</p>",
        "id": 153945419,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521207703
    },
    {
        "content": "<p>(BodySite wurde irgendwann 2017 nach BodyStructure umbenannt)</p>",
        "id": 153945420,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521207712
    },
    {
        "content": "<blockquote>\n<p>Moment, ist Haupt/Nebendiagnose das gleiche wie Primär/Sekundärdiagnose...? Dann wäre es Encounter.diagnosis.rank!</p>\n</blockquote>\n<p>Das passt aus meiner Sicht. Es hätte da auch noch diese Extension gegeben, aber die passt nicht, weil ich dann nicht wüsste, wie ich den Link zu der speziellen Condition hinbekäme: <a href=\"http://hl7.org/fhir/extension-encounter-primarydiagnosis.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-encounter-primarydiagnosis.html\">http://hl7.org/fhir/extension-encounter-primarydiagnosis.html</a></p>",
        "id": 153946144,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1521455283
    },
    {
        "content": "<p>Die Extension haben wir in R4 entfernt, da es sich mit Encounter.diagnosis.rank abbilden lässt. Daher besser nicht verwenden!</p>",
        "id": 153946145,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521455365
    },
    {
        "content": "<p>Super, danke für den Hinweis!</p>",
        "id": 153946146,
        "sender_full_name": "Evelyn Dröge",
        "timestamp": 1521455411
    },
    {
        "content": "<p>Hallo an alle! Ich bin noch etwas erschlagen von der Struktur hier im Chat, daher hoffe ich, dass es OK ist, diese Frage im Kontext des MI-I Kerndatensatzes zu stellen. Wir wollen uns bei der Modellierung in openEHR bei der Referenzierung von Terminologien an FHIR halten (warum das Rad neu erfinden). Allerdings habe ich im Simplifier keinen URI für OPS finden können. Habt Ihr da schon was überlegt und ich habe es übersehen, oder ist das tatsächlich noch nicht definiert? Besten Dank!</p>",
        "id": 153993633,
        "sender_full_name": "Birger",
        "timestamp": 1536218787
    },
    {
        "content": "<p>Wir hatten mal das ValueSet definiert: <a href=\"https://simplifier.net/basisprofilde/ops\" target=\"_blank\" title=\"https://simplifier.net/basisprofilde/ops\">https://simplifier.net/basisprofilde/ops</a></p>",
        "id": 153993636,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1536219261
    },
    {
        "content": "<p>...aber das expanded nicht, da es a) aktuell keinen Terminologie-Server gibt, der OPS mit FHIR-API hostet und b) die von uns gewählte Schreibweise<br>\n'Include all codes defined in <a href=\"http://fhir.de/CodeSystem/dimdi/ops|*\" target=\"_blank\" title=\"http://fhir.de/CodeSystem/dimdi/ops|*\">http://fhir.de/CodeSystem/dimdi/ops|*</a>' nicht ganz legitim ist <span class=\"emoji emoji-1f47c\" title=\"angel\">:angel:</span></p>",
        "id": 153993637,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1536219359
    },
    {
        "content": "<p>Wir hatten dazu einen Change Request eingereicht, da es im Standard keine Möglichkeit gab, ein ValueSet zu definieren, das <em>alle</em> Versionen eines CodeSystems enthält. Das war uns aber wichtig, da wir die Profile und die Terminologie-Bindings nicht jedes Jahr ändern wollen, wenn ein neuer ICD/OPS-Katalog erscheint.</p>",
        "id": 153993639,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1536219444
    },
    {
        "content": "<p>Unserem CR wurde stattgegeben, allerdings nicht in der ...|* -Notation, sondern es wurde definiert, dass ein Include <em>ohne</em> Angabe einer expliziten Version stets bedeutet \"include all\"</p>",
        "id": 153993640,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1536219517
    },
    {
        "content": "<p>...daher müssten wir das in unserem Profil entsprechend anpassen, wenn die R4-Spezifikation raus ist...</p>",
        "id": 153993641,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1536219546
    },
    {
        "content": "<p>OK, das entspricht ja dem üblichen Vorgehen. Das heißt also, dass wir \"<a href=\"http://fhir.de/CodeSystem/dimdi/ops\" target=\"_blank\" title=\"http://fhir.de/CodeSystem/dimdi/ops\">http://fhir.de/CodeSystem/dimdi/ops</a>\" verwenden sollten, right?</p>",
        "id": 153993642,
        "sender_full_name": "Birger",
        "timestamp": 1536219655
    },
    {
        "content": "<p>Genau. Da beim OPS immer die Version mit angegeben werden muss, würde das in einer FHIR.Instanz dann ungefähr so aussehen:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"nt\">&lt;coding&gt;</span>\n   <span class=\"nt\">&lt;system</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://fhir.de/CodeSystem/dimdi/ops&quot;</span><span class=\"nt\">/&gt;</span>\n   <span class=\"nt\">&lt;version</span> <span class=\"na\">value=</span><span class=\"s\">&quot;2018&quot;</span><span class=\"nt\">/&gt;</span>\n   <span class=\"nt\">&lt;code</span> <span class=\"na\">value=</span><span class=\"s\">&quot;1-2345&quot;</span><span class=\"nt\">/&gt;</span>\n<span class=\"nt\">&lt;/coding&gt;</span>\n</pre></div>",
        "id": 153993643,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1536220054
    },
    {
        "content": "<p>BTW, Willkommen im Chat <span class=\"emoji emoji-1f603\" title=\"smiley\">:smiley:</span></p>",
        "id": 153993644,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1536220124
    },
    {
        "content": "<p>Super, ist bei openEHR das gleiche. Daher auch gerne zukünftig die Trennung nach Benennung und Version beibehalten :) Und Dankeschön, war leider zwischenzeitlich zwischen Urlaub und Ausschreibungen versumpft. Aber jetzt geht das hoffentlich mal fachlich weiter <span class=\"emoji emoji-1f642\" title=\"simple smile\">:simple_smile:</span></p>",
        "id": 153993646,
        "sender_full_name": "Birger",
        "timestamp": 1536220322
    },
    {
        "content": "<p>Ich bin mir nicht sicher ob hier diejenigen mitlesen die auf dem InteropForum danach fragten, falls nicht bitte ggfs. weiterleiten.</p>\n<p>Es wurde nach Tooling für CodeSystem Mappings gefragt. Ich persönlich benutze hierzu (FHIR) ConceptMaps und hapi-fhir-cli und einen HAPI Server.<br>\nConceptMaps lassen sich durch hapi-fhir-cli aus einem CSV File generieren, das Umwandeln des konkreten Codes kann dann der HAPI Server (oder jeder andere Server welche die operation unterstützt).<br>\nDie Operation ist hier die <em>$translate</em> Operation des ConceptMap Endpunktes: <a href=\"https://www.hl7.org/fhir/conceptmap-operations.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/conceptmap-operations.html\">https://www.hl7.org/fhir/conceptmap-operations.html</a></p>",
        "id": 153998649,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537456154
    },
    {
        "content": "<p>Damit das zielführend wird, braucht es wahrscheinlich eine allgemein akzeptierte Definition von “Version” und “Release”. Während meines Wissens für die deutschen Ausgaben vo ICD und OPS jährlich neue codeSystem OIDs (bzw. URL) vergeben werden, bleibt die ID von SNOMED CT und LOINC konstant, so dass ggf. (wann??) die Übermittlung der version sinnvoll/unerlässlich sein könnte.</p>",
        "id": 153999353,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1537734466
    },
    {
        "content": "<p>Frage ist dann, wie mit Nachrichten umgegangen wird, die _keine_ Versionsangabe mitbringen. Ablehnen? Wir haben die Diskussion auch bei eHDSI für die europäischen Value Sets. Wird das version-attribute Pflicht? Und brauchen wir dann noch jährlich neue OIDs für ICD-GM?</p>",
        "id": 153999354,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1537734652
    },
    {
        "content": "<p>Für ICD-10-GM und OPS bilden wir das jährliche \"neue\" Codesystem bereits durch die Kombination URL + Version ab. Das hat vor allem den praktischen Grund, dass anderenfalls jedes Jahr das zugehörige ValueSet \"alle Codes aus allen Jahren\" upgedated werden müsste, weil eine neue URL dazu kommt. Ab FHIR R4 ist in einem ValueSet dann \"CodeSystem URL ohne Version\" gleichbedeutend mit \"alle Versionen eines CodeSystems\".<br>\nWir hatten das vor längerem recherchiert und in diversen Kreisen ja auch diskutiert, mit dem Ergebnis, dass für ICD-10-GM und OPS keine Unterversionen (also unterjährige neue Versionen ohne neue OID) existieren, bzw. zumindest nicht als solche benannt werden.</p>",
        "id": 153999381,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1537773910
    }
]