[
    {
        "content": "<p>Hallo zusammen! <br>\nMir steht bevor vorhandene Patienten-Daten aus einer MySQL-DB über FHIR-API verfügbar zu machen, ich habe mir HAPI-FHIR angeschaut, blicke jedoch noch nicht durch, wie ich es angehen sollte. Hat vielleicht jemand  einen Tip für mich?  :)</p>",
        "id": 153886809,
        "sender_full_name": "Don",
        "timestamp": 1493825905
    },
    {
        "content": "<p>was ist genau die Frage?<br>\nIst hier gut beschrieben: <a href=\"http://hapifhir.io/doc_rest_server.html\" target=\"_blank\" title=\"http://hapifhir.io/doc_rest_server.html\">http://hapifhir.io/doc_rest_server.html</a></p>",
        "id": 153886810,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1493826021
    },
    {
        "content": "<p>damit Baut man sich die nötigen Resourcenprovider und triggert daraus seine ServiceKlassen welche sich wiederum die Infos aus der MySQL DAtenbank zusammensuchen</p>",
        "id": 153886812,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1493826159
    },
    {
        "content": "<p>Danke für Deine Antwort Patrick! Mir ist unklar, wo und wie die DB-Daten in die DataObjects gemappt werden.</p>",
        "id": 153886813,
        "sender_full_name": "Don",
        "timestamp": 1493826794
    },
    {
        "content": "<p>das muss man selber machen, die Beispiele deuten das ja an. Dort werden neue Resourcen erstellt und returnt, beim Erstellen der Resourcen befüllt man dann statt mit Beispieldaten mit den Daten welche man aus der MySQL DB queried</p>",
        "id": 153886815,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1493826905
    },
    {
        "content": "<p>wie komplex soll das denn werden? Es sollen nur die Daten des Patienten gesucht werden?</p>",
        "id": 153886816,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1493827008
    },
    {
        "content": "<p>also z.B. \"gib mir alle Patienten mit Geburtsdatum = X, oder mit Namen = foo?</p>",
        "id": 153886817,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1493827028
    },
    {
        "content": "<p>ein kompletteres Beispiel findet sich hier: <br>\n<a href=\"https://github.com/jamesagnew/hapi-fhir/tree/master/restful-server-example\" target=\"_blank\" title=\"https://github.com/jamesagnew/hapi-fhir/tree/master/restful-server-example\">https://github.com/jamesagnew/hapi-fhir/tree/master/restful-server-example</a></p>",
        "id": 153886818,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1493827081
    },
    {
        "content": "<p>Es sind schon viele Daten, darunter Laborwerte etc., also ist es eine recht aufwendige Angelegenheit, nicht einfach mal schnell zu einer bestehenden API eine FHIR hinzuzufügen :(</p>",
        "id": 153886820,
        "sender_full_name": "Don",
        "timestamp": 1493827136
    },
    {
        "content": "<p>Das ist dann in der Tat ein bisschen komplexer. Zumal ein bereits existierendes Datenbank-Backend ja in der Regel nicht exakt so strukturiert sein dürfte wie die FHIR-Ressourcen. Ein 08/15-autogeneriertes ORM wird typischerweise nicht reichen, wenn nennenswert medizinische Daten in der MySQL-DB enthalten sind.<br>\nDas Mapping musst Du also selbst erstellen, unter Berücksichtigung aller CRUD-Operationen (soweit für den Use Case relevant) bzw. deren Implikationen. Besonders, wenn womöglich sowohl über eine angebundene Applikation als auch über FHIR gelesen und geschrieben werden soll. Aber um das zu diskutieren, müsste man deutlich mehr Hintergrund-Infos haben.</p>",
        "id": 153886821,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1493828070
    },
    {
        "content": "<p>Vielen Dank Stefan, gibt es vielleicht ein Migrationstool, mit dem ich die Daten aus einer vorhandenen DB in eine leere FHIR konform übertragen kann? Daten-Mapping muss natürlich weiterhin selbst erstellen, aber kann mir evtl. die DB-Backend generieren lassen?<br>\nIch muss nicht die vorhandene DB oder Backend mit dem neuen FHIR-Backend synchron halten.</p>",
        "id": 153886960,
        "sender_full_name": "Don",
        "timestamp": 1493890014
    },
    {
        "content": "<p>Hi Don, DB Backend für HAPI gibt es auch schon als Example: <a href=\"https://github.com/jamesagnew/hapi-fhir/tree/master/hapi-fhir-jpaserver-example\" target=\"_blank\" title=\"https://github.com/jamesagnew/hapi-fhir/tree/master/hapi-fhir-jpaserver-example\">https://github.com/jamesagnew/hapi-fhir/tree/master/hapi-fhir-jpaserver-example</a></p>",
        "id": 153886964,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1493890415
    },
    {
        "content": "<p>Ein Migrationstool um die Daten hier rein zu bekommen existiert nicht. Aber hiermit hat man einen FHIR Server mit JPA Backend. Zur Daten Migration würde ich wahrscheinlich den Weg über die REST Schnittstellen des HAPI Servers gehen. Ist zwar langsamer aber man kann auf diesem Weg seine Daten gleich validieren. Direkt auf die DB von HAPI zu migrieren ist riskanter - da ohne validierung</p>",
        "id": 153886965,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1493890524
    },
    {
        "content": "<p>Da stimme ich Patrick in beiden Punkten zu.<br>\nDie Migration muss man zwangsläufig manuell mappen. Ein Tool dafür könnte bestenfalls eine sehr geringe Zahl eigener Codezeilen ersetzen.<br>\nUnd ich würde auf jeden Fall anhand dieses Mappings die MySQL-DB direkt in FHIR-Ressourcen umsetzen, aus den genannten Gründen. Dann erkennt man auch gleich, wo eventuell im Mapping noch Unvollständigkeiten enthalten sind.</p>",
        "id": 153886978,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1493894228
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"193804\">@Don</span> <br>\nschau mal hier: <a href=\"http://www.openmapsw.com/FHIR/FHIR.htm\" target=\"_blank\" title=\"http://www.openmapsw.com/FHIR/FHIR.htm\">http://www.openmapsw.com/FHIR/FHIR.htm</a> <br>\nVielleicht geht das in die Richtung, nach der Du suchst?</p>",
        "id": 153888029,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1494161788
    },
    {
        "content": "<p>Das eigentliche Mapping muss man natürlich auch hier selbst erstellen, aber es gibt immerhin ein Framework dafür...</p>",
        "id": 153888030,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1494161892
    }
]