[
    {
        "content": "<p>Zur Allgemeinen Info hier der Inhalt des IHE-Newletters, der mich soeben erreicht hat:</p>\n<blockquote>\n<p>Two new IHE Profiles are introduced and have wide-reaching implications not only for mHealth:<br>\nMobile Cross-Enterprise Document Data Element Extraction – mXDE Profile and<br>\nQuery for Existing Data for Mobile – QEDm Profile.</p>\n<p>The mXDE Profile combines:<br>\nA/ Either the “coarse grained” IHE XDS Profile - in use today in more than 20 countries or the emerging IHE MHD Profile (Mobile access to Health Documents), which leverages the HL7® trial use standard FHIR® (Fast Healthcare Interoperability Resources).<br>\nPLUS <br>\nB/ The “fine grained data elements” accessed with the new QEDm Profile, which also leverages FHIR that is appropriate for granular queries of clinical data elements.<br>\n1.- Specific data elements are extracted from the structured documents per mXDE Profile.<br>\n2.- Data elements (e.g. allergies) queried using the FHIR based QEDm Profile.<br>\n3.- Each data element is referenced to the document(s) from which it was extracted per mXDE Profile.<br>\n4.- Clinician accesses context of any data element of interest using source documents (XDS, MHD Profiles) providing the clinical context in which the observation was recorded.</p>\n<p>To find out further details please visit <a href=\"http://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction?utm_source=IHE-Europe+Newsletter&amp;utm_campaign=47b170434b-New+ITI+Profiles+both+leveraging+FHIR&amp;utm_medium=email&amp;utm_term=0_cf01e2ec3a-47b170434b-229674877\" target=\"_blank\" title=\"http://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction?utm_source=IHE-Europe+Newsletter&amp;utm_campaign=47b170434b-New+ITI+Profiles+both+leveraging+FHIR&amp;utm_medium=email&amp;utm_term=0_cf01e2ec3a-47b170434b-229674877\">mXDE</a> Profile web page.</p>\n<p>Sincerely<br>\nIHE-Europe Team</p>\n</blockquote>",
        "id": 153913109,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1507553784
    }
]