[
    {
        "content": "<p>Hallo zusammen,<br>\ngerade kam bei uns die Diskussion auf, wie korrekt mit folgendem Sachverhalt umzugehen ist.</p>\n<p>Aus einem ValueSet wird eine bestimmte Untersuchung ausgewählt. Diese hat einen bestimmten quantitativen Messwert eines bestimmten Types. Im ValueSet kommen Untersuchungen mit unterschiedlichen Messtypen vor (Quantität, Ratio, Period, ...). Dies kann über das Slicing von value[x] gelöst werden. Wenn jetzt jedoch auch Referenzwerte zu den Untersuchungen angegeben werden sollen, besteht nur die Möglichkeit eine Quantität anzugeben. Wie kann zB die Ratio oder Period korrekt umgesetzt werden? Extension? Oder eventuell sogar die Erweiterung der Observation.referenceRange.low bzw. high? Meiner Meinung nach ist es sinnvoll, Referenzwerte mit dem gleichen Typ anzugeben, welches auch das Messergebnis hat. <br>\nVG<br>\nRobert</p>",
        "id": 206576922,
        "sender_full_name": "Robert Fruth",
        "timestamp": 1597153776
    },
    {
        "content": "<p>Hast Du Beispiele für Referenzwerte, die sich nicht als Quantity ausdrücken lassen?</p>",
        "id": 206587025,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597158629
    },
    {
        "content": "<p>Ich glaube ich verstehe die Frage nicht. Wenn eine Messung vom Typ \"Period\" wäre, dann hätte sie ja ein Start- und Enddatum (also z.B. \"vom 1.1.2020-2.5.2020\").<br>\nWie würde dazu ein Referenzbereich aussehen? <br>\nWenn eine Dauer gemessen wird (z.B. \"5 Minuten\" dann ist das ja eine Quantity und dann ist auch die Angabe eines Referenzbereiches (\"zwischen 3 und 6 Minuten\") sinnvoll und Problemlos möglich...</p>",
        "id": 206587027,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1597158631
    },
    {
        "content": "<p>Aus diesem Verständnisproblem resultiert meine obige Frage :)</p>",
        "id": 206587234,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597158692
    },
    {
        "content": "<p>Hallo Simone, hallo Stefan, danke schon mal für die Antworten.<br>\nTatsächlich macht es bei der Period nicht wirklich Sinn. Nach Rücksprache bleibt die Frage, wie wir am besten mit der Ratio (zB dem Titer) umgehen. Über dem \"Umweg\" Quantity/UCUM würde es auch gehen, aber macht es nicht mehr Sinn den korrekten Typ zu nutzen?</p>",
        "id": 206676319,
        "sender_full_name": "Robert Fruth",
        "timestamp": 1597225968
    },
    {
        "content": "<p>Ich hatte früher Verhältnisse (bspw %) auch als Ratio modelliert. Dies bietet aber keinen direkten Vorteil gegenüber einer Quantity. Titer als Quantity mit IE/l passt prima.</p>",
        "id": 206681143,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597230206
    },
    {
        "content": "<p>Hallo Zusammen,</p>\n<p>es ist vollkommen klar, dass man die allermeisten Dinge über ein Quantity abbilden kann, aber ist das sinnvoll? Wenn man einen Wert vom Typ Datum hat, sollte dann nicht auch der Referenzbereich  vom gleichen Datentyp sein? Ein Datum als Quantity abzubilden ist im besten Falle ungewöhnlich...</p>\n<p>Daher geht unsere Frage eher in die Richtung, ob das nicht vielleicht als change proposal eingereicht werden sollte?</p>\n<p>Gruß Max</p>",
        "id": 206688432,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597236182
    },
    {
        "content": "<p>Jetzt fehlt aber auch mir die Vorstellungskraft. Hat jemand für mich ein Beispiel, wo jemand in einer Observation einen Datum hinterlegt mit einem Referenzbereich?</p>",
        "id": 206693123,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1597238912
    },
    {
        "content": "<p>Expected delivery, z. B?</p>",
        "id": 206696234,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1597240421
    },
    {
        "content": "<p>Wird da ein Datum oder eine Period angegeben? Und welche Bedeutung hätten dann die Referenzbereiche - Frühgeburt, nicht lebensfähig - Graubereich?</p>",
        "id": 206696389,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1597240487
    },
    {
        "content": "<p>Wäre expectedDelivery, selbst als Datumsbereich, nicht eine eigene Observation?</p>",
        "id": 206696438,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597240517
    },
    {
        "content": "<p>referenceRange meint doch eher die Normalwerte für die Gesamtbevölkerung oder bestimmte Gruppen, nicht einen Wert, der spezifisch für einzelne Pat. ist</p>",
        "id": 206696647,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597240618
    },
    {
        "content": "<p>Beim Geburtsdatum würde ich maximal eine referenceRange low=37 Wochen, high=42 Wochen (o.ä.) erwarten - und das wäre wieder eine Quantity.<br>\nMal ab davon, dass das m.W. eher unüblich ist.</p>",
        "id": 206697421,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597240900
    },
    {
        "content": "<p>Es ging hier auch eher um eine akademische Diskussion: Zum Datum fällt mir (als nicht Mediziner) auch nicht so viel ein, aber sagen wir wir wollen Weihnachten inkl Weihnachtszeit als Observation abbilden <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> :</p>\n<p>Value[x]=24.12<br>\nreferencerange.low= 1.12<br>\nreferencerange.high= 26.12</p>\n<p>Sollte man nicht einfach den gleichen Typ, den es in Value[x] gibt nicht auch als Referenz zur Verfügung haben?</p>\n<p>Konkret geht es uns eigentlich um einen bestimmten Fall, nämlich um die Abbildung von Verdünnungsreihen. Diese müssen nach den Labormedizinern durch eine ratio abgebildet werden. (Ja man könnte mit Anzeige/Umrechnungsvorschriften kommen, aber das wollen/dürfen wir nicht). Daher wäre eine ratio als Referenzbereich auch wichtig...Daher die Frage warum sind im Referenzbereich nur quantities erlaubt?</p>",
        "id": 206804012,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597318368
    },
    {
        "content": "<p>Weihnachtszeit ist ein Appointment/Slot :)</p>",
        "id": 206804411,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1597318717
    },
    {
        "content": "<p>OK, jetzt kommen wir aber mit der Ratio tatsächlich auf einen interessanten Punkt.<br>\nDa ich von Verdünnungsreihen wenig bis keine Ahnung habe: wie sieht denn der Wert und sein Normalwertbereich in Prosa aus (beispielhaft)?</p>",
        "id": 206818182,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597327316
    },
    {
        "content": "<p>(der Punkt hinter diesem hartnäckigen Nachhaken ist: wenn daraus ein Change Request werden soll, muss er gut und nachvollziehbar begründet sein. Da kann ein Beispiel aus dem realen Kontext natürlich sehr hilfreich sein - oder dazu führen, dass man zu einer ganz anderen Lösung kommt)</p>",
        "id": 206818581,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597327506
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Weihnachtszeit ist ein Schedule, Tage in der Weihnachtszeit sind Slots, Bescherung ist ein Appointment, je nach Weltgegend in einem Slot am 24.12. oder 25.12.  ;)))</p>",
        "id": 206819099,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597327778
    },
    {
        "content": "<p>Mir ist aber trotzdem einiges noch nicht klar. Man möge mich korrigieren, wenn ich falsch liege. <br>\nIn einer Verdünnungsreihe wird doch eine Probe (Specimen), z.B. Blutprobe, verdünnt. Ist denn dann das, was dabei herauskommt, eine Observation? Oder eine Substance mit mehreren Ingredients? <br>\nIch denke, man merkt, dass mir das Beispiel noch nicht ganz klar ist. Sorry, wenn da jemand bei mir auf dem Schlauch steht.</p>",
        "id": 206821468,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1597328982
    },
    {
        "content": "<p>Womöglich ist ja sogar Substance die besagte \"ganz andere Lösung\". Aber mal schauen, wie sich die \"Prosa\" dazu darstellt.</p>",
        "id": 206849539,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597342142
    },
    {
        "content": "<p>(Wobei Substance keinen Patientenbezug hat ...)</p>",
        "id": 206850096,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597342463
    },
    {
        "content": "<p>Hinweis: Im Bereich Pathologie haben sich die Kollegen von IHE und DICOM zusammen umfassende Gedanken dazu gemacht, was man mit Specimen und deren Folgeprodukten so alles anstellen kann. Aber vermutlich kann das ja hier schon als bekannt vorausgesetzt werden?</p>",
        "id": 206851671,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1597343283
    },
    {
        "content": "<p>Inclusive technikneutralem  \"real world model\" usw., übrigens.</p>",
        "id": 206851781,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1597343354
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191436\">Stefan Lang</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Observation.2EreferenceRange.20low.2Fhigh/near/206818182\">said</a>:</p>\n<blockquote>\n<p>OK, jetzt kommen wir aber mit der Ratio tatsächlich auf einen interessanten Punkt.<br>\nDa ich von Verdünnungsreihen wenig bis keine Ahnung habe: wie sieht denn der Wert und sein Normalwertbereich in Prosa aus (beispielhaft)?</p>\n</blockquote>\n<p>Ich frage die Mediziner...</p>",
        "id": 206899186,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597382421
    },
    {
        "content": "<p>Von Max angefragt -  ein paar Erläuterungen von mir.</p>\n<p>Am Beispiel Röteln-Virus-Hämagglutinations-Hemmtest (HHT): diese Ergebnisse werden meist in Titerstufen angegeben. Unter Titerstufen versteht man eine Verdünnungsreihe des Blutes. Dazu wird die Blutflüssigkeit (Serum) nach einem fixen Schema verdünnt (1:8, 1:16, 1:32, 1:64 etc.), und anschließend erfolgt die Messung der Antikörper gegen die Röteln-Viren. Jene letzte Verdünnungsstufe, bei der ein positiver Nachweis noch möglich ist, entspricht dann der Konzentration der Antikörper gegen die Röteln-Viren im Blut...</p>\n<p>Für die Bewertung eines ausreichenden Impfschutzes gelten die folgenden Richtwerte:<br>\nHHT 1:&lt;8 – kein ausreichender Impfschutz,<br>\nHHT zwischen 1:8 und 1:16 – Auffrischungsimpfung empfohlen,<br>\nHHT 1:≥32 – ausreichender Impfschutz.</p>\n<p>Einen echten NORMWERT-Bereich als Referenzbereich gibt es hierzu nicht. (Normal wäre ja, die Rötelninfektion nicht gehabt zu haben, also gar keine Antikörper dazu zu haben). Eine solche Sachlage gibt es für einige Virus-Antikörpertests. Da geht es immer um die Immunitätslage, nicht um \"Normalität\".</p>\n<p>Man könnte also den Referenzbereich-Typ (gemäß <a href=\"https://www.hl7.org/fhir/valueset-referencerange-meaning.html\">https://www.hl7.org/fhir/valueset-referencerange-meaning.html</a>...  expansion contains 13 concepts) vielleicht als \"Recommended Range\" angeben. Trifft es m.E. im Detail aber nicht ganz.</p>\n<p>Nach meinem Verständnis müsste man 3 Referenzbereichs-Typen für die RÖTELN-IMMUNLAGE einer Schwangeren (hier als geforderte Angabe für den Mutterpass) definieren:</p>\n<div class=\"codehilite\"><pre><span></span><code>Referenzbereich-Typ: kein ausreichender Impfschutz\nObergrenze   Titer 1: &lt;8\n\nReferenzbereich-Typ: Auffrischungsimpfung empfohlen\nObergrenze =   Titer 1: 8\nUntergrenze =  Titer 1: 16\n\nReferenzbereich-Typ: ausreichender Impfschutz\nUntergrenze   Titer 1:≥32\n</code></pre></div>\n\n\n<p>Man könnte die 3 Referenzbereichs-Typen ggf.  allgemeingültiger formulieren </p>\n<div class=\"codehilite\"><pre><span></span><code>Referenzbereich-Typ: keine ausreichende Immunität anzunehmen\nObergrenze   Titer 1: &lt;8\n\nReferenzbereich-Typ: Immunität als nicht sicher anzunehmen\nObergrenze =   Titer 1: 8\nUntergrenze =  Titer 1: 16\n\nReferenzbereich-Typ: Immunität anzunehmen\nUntergrenze   Titer 1:≥32\n</code></pre></div>\n\n\n<p>Jetzt habt ihr wahrscheinlich mehr Fragen als vorher ;-)<br>\nViele Grüße Martina</p>",
        "id": 206906345,
        "sender_full_name": "Martina Sender",
        "timestamp": 1597391505
    },
    {
        "content": "<p>Nachtrag zum Begriff Titer</p>\n<p>Wie oben von mir erläutert, ist Titer eine Messeinheit. Sie wird auch bei UCUM geführt.</p>\n<p>Umgangssprachlich sagen wir auch \"Antikörper-Titer-Messung\" wenn als Ergebnis ein Wert mit Units/Volume herauskommt (iE/ml). Diese Quantitätsangabe ist in unserer Diskussion ausdrücklich nicht gemeint! Sondern Titer als Messeinheit.</p>",
        "id": 206906629,
        "sender_full_name": "Martina Sender",
        "timestamp": 1597391797
    },
    {
        "content": "<p>Das erscheint mir in der Tat als ein valider Fall.</p>\n<ul>\n<li>Es ist ein Messwert, somit eine Beobachtung =&gt; Observation</li>\n<li>Es ist meines Erachtens eine Form des Normalwerts (im Sinn von: wenn ich ihn über- oder unterschreite, muss ich ggf. Maßnahmen ergreifen (hier: impfen)</li>\n<li>Eine Darstellung als Quantity wäre möglich (1:32 === 0,03125), aber tatsächlich ziemlich ab von einfacher Lesbarkeit/Verständlichkeit.</li>\n</ul>\n<p>Option 1: einfach den Verdünnungsfaktor angeben (also 8, 16, 32) (scheint aber von der Fachseite nicht goutiert zu werden?)<br>\nOption 2: Hat sich die MI-I in den Laborprofilen dazu schon Gedanken gemacht? <span class=\"user-mention\" data-user-id=\"217202\">@Andreas Bietenbeck</span> <span class=\"user-mention\" data-user-id=\"194875\">@Danny Ammon</span> <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> <br>\nOption 3 (bzw. 2-follow-up): die Frage nebst Erläuterung von <span class=\"user-mention\" data-user-id=\"329863\">@Martina Sender</span> mal nach <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> kippen.</p>",
        "id": 206909024,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597394458
    },
    {
        "content": "<p>Ergänzend: was hier gegen die Abbildung als Specimen, Substance o.ä. spricht, ist die Tatsache, dass hier eine Serie von (sukzessiv weiter verdünnten) Proben hergestellt wird, aber nur eines dieser bestimmten Verdünnungsverhältnisse die relevante Information, also den Messwert, darstellt.</p>",
        "id": 206909585,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597395018
    },
    {
        "content": "<p>Wir wollen hier auch nicht den Prozess selbst darstellen, sondern nur das Ergebnis.</p>",
        "id": 206923663,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597407927
    },
    {
        "content": "<p>Vielen Dank <span class=\"user-mention\" data-user-id=\"329863\">@Martina Sender</span>, das macht es aus meiner Sicht wesentlich verständlicher und ist, wie Stefan schrieb, durchaus sinnvoll und valide. Vielen Dank.</p>",
        "id": 206925499,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1597409297
    },
    {
        "content": "<p>Das heißt der Use-Case ist gerechtfertigt und sollte international besprochen werden korrekt?</p>",
        "id": 207116058,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597651096
    },
    {
        "content": "<p>Da Observation normative ist wird sich hier nichts mehr ändern lassen. Ggfs könnte eine Extension auf ReferenceRange denkbar sein.</p>",
        "id": 207116960,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597651867
    },
    {
        "content": "<p>Ein Element zu ergänzen ist grundsätzlich auch bei normativen Ressourcen möglich, solange die Kardinalität nicht auf 1.. gesetzt ist.<br>\nDa aber low und high als Datentyp fest Quantity haben und ein low[x]/high[x] (Quantity|Ratio) tatsächlich einen breaking change darstellen würden bliebe theoretisch noch die Möglichkeit, <em>zusätzliche</em> Elemente lowRatio/highRatio einzuführen, was womöglich eher als Unschönheit angesehen werden dürfte. Zudem müsste dann auch noch das 80%-Kriterium erfüllt sein.</p>\n<p>Es ist also nicht völlig ausgeschlossen, die entsprechende Datenelemente direkt in Observation zu bekommen, aber klar wahrscheinlicher dürfte es auf eine Core-Extension hinauslaufen.</p>\n<p>Oder aber, man bildet doch den Verdünnungsfaktor ab (also 2/4/8/16) ... was in der WG durchaus auch als Empfehlung kommen könnte, wenn dies das einzige Beispiel bleibt.</p>\n<p>Insofern: sinnvollerweise erstmal in #implementers die Quintessenz der Diskussion aus diesem Thread zusammenschreiben und schauen, ob es dazu international schon Lösungen gibt oder z.B. die Leute aus der O&amp;O WG und dem Core Team eine starke Meinung zum Thema haben.</p>",
        "id": 207121297,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597655287
    }
]