[
    {
        "content": "<p>Ich versuche mich gerade darin, die Organisationstruktur einer Klinik auf FHIR-Resourcen abzubilden.<br>\nDa habe ich:<br>\n- Funkionsbereiche<br>\n- Stationen <br>\n- Ambulanzen<br>\n- (med.) Abteilungen<br>\n- Fachabteilungen (im Sinne von Schlüssel 6, Anlage 2 zum  §301: z.B. 0100 Innere Medizin oder nach QM: entsräche einer feineren Unterteilung als nach Schlüssel 6)<br>\n- Kliniken (z.B. Medizinische Klinik)<br>\n- Interdisziplinäre Zentren<br>\n- Organisatorische Einheiten, die für mehrere Stationen/Ambulanzen zuständig sind. Z.B. Patientenanmeldung, Sozialdienst. ...<br>\n- MVZ (Medizinisches Versorgungszentrum)<br>\n- Ermächtigte Ambulanzen</p>\n<p>Eine Station gehört zu einer Klinik. Die Patienten einer Station können von unterschiedlichen med. Abteilungen versorgt werden (häufig ist die Zuordnung aber auch eindeutig). Mehrere medizinische Abteilungen können sich zu Interdisziplinäre Zentren zusammenschließen aber darüberhinaus noch einzeln agieren.  <br>\nEin Funktionsbereich ist tyischerweise die kleinste, planbare Einheit (z.B. Computer-Tomograph, Sprechstunde XY,...) <br>\nEine Ambulanz hat einen oder mehrere Funktionsbereiche. <br>\nEine Ambulanz kann Patienten sowohl im Rahmen einer Ermächtigung (\"Ermächtigte Ambulanzen\") als auch in anderen Kontexten (z.B. Hochschulambulanz) behandeln. Gleiches gilt für ein MVZ: Auch dort können Patienten im Rahmen des MVZ oder auch in einem anderen Kontext behandelt werden. </p>\n<p>Meine Idee wäre jetzt eine Abbildung, die so aussieht:</p>\n<ul>\n<li>Station, Ambulanz -&gt; Location</li>\n<li>Funktionsbereich -&gt; HealthcareService</li>\n<li>Med. Abteilungen -&gt; Organization. Aber auf was verweist dann Partof? (Die Klinik oder die medizinische Fachabteilung?)</li>\n<li>Interdisziplinäre Zentren -&gt; CareTeam (aber welche Category?)</li>\n<li>Klinik  -&gt; Organziation</li>\n<li>Organisatorische Einheiten -&gt; CareTeam (aber auch hier passen die vorhandenen Kategorien nicht wirklich)</li>\n<li>Fachabteilungen (§301 oder nach QM) -&gt; Organziation oder CareTeam</li>\n<li>MVZ, Ermächtigte Ambulanzen -&gt; Organization. </li>\n</ul>\n<p>Aber ganz glücklich bin ich damit noch nicht. Die Kategorien bei CareTeam passen nicht immer. CareTeam sehe ich derzeit aber als einzige Möglichkeit, Polyhierarchie abzubilden, da PartOf immer auf genau eine übergeordnete Einrichtung verweist.</p>\n<p>Da das Problem aber sicherlich alle Kliniken betrifft, würde ich mich daher über eine Diskussion freuen!</p>",
        "id": 154026127,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1545153888
    },
    {
        "content": "<p>interessantes Thema.<br>\nHealthCare Services verstehe ich als die Art von med. Service/Angebot einer Organization (oder Ärzten und sonstigem med. Personal) welche an einer Location erbracht wird.<br>\nDies entspricht auch der Intepretation im vhdir IG, und auch dem HPD welches wir in Chile mit profiliert haben.<br>\nLocation ist also der physikalische Ort, Practicioner oder Organizations oder Group erbringt eine Leistung -&gt; HealthcareService, und Organization exisitiert auf verschiedenen Ebenen. <br>\nIntersdisp. Zentren wären für mich auch eine Organization, ebenso Organisatorische Einheiten. <br>\nBezüglich der Kategorien: diese sind example gebindet und somit nur Vorschläge. Dies für Deutschland mal als eigenes CodeSystem/ValueSet zu definieren wäre aber sicherlich wichtig.</p>",
        "id": 154026187,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1545170370
    },
    {
        "content": "<p>hier der Link zum vhdir: <a href=\"http://build.fhir.org/ig/HL7/VhDir/StructureDefinition-vhdir-healthcareservice.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/VhDir/StructureDefinition-vhdir-healthcareservice.html\">http://build.fhir.org/ig/HL7/VhDir/StructureDefinition-vhdir-healthcareservice.html</a></p>",
        "id": 154026188,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1545170390
    },
    {
        "content": "<p>IHE hat mit dem mCSD ein Profile entwickelt das auch um dieses Theme geht, siehe <a href=\"https://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_mCSD.pdf\" target=\"_blank\" title=\"https://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_mCSD.pdf\">HE_ITI_Suppl_mCSD.pdf</a>, das Profil ist gerade in Überarbeitung auf Release 4   <a href=\"https://github.com/IHE/IT-Infrastructure/tree/master/FHIR-R4\" target=\"_blank\" title=\"https://github.com/IHE/IT-Infrastructure/tree/master/FHIR-R4\">github</a></p>",
        "id": 154026292,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1545204331
    },
    {
        "content": "<p>Im Prinzip was Patrick sagt.<br>\nMan sollte allerdings beachten, dass Organization, HealthcareService und Location administrative Ressourcen sind (gehören ja auch der Patient Administration WG).<br>\nCareTeam kommt aus Patient Care und ist patientenfokussiert: \"The CareTeam resource [,,,] is specific to a particular Patient\" (auch, wenn subject 0..1 ist). Ist also nicht zur Abbildung von Organisationsstrukturen gedacht. Taucht m.W. dementsprechend folgerichtig auch in mCSD nicht auf.<br>\nWenn man will, könnte man (stark vereinfacht gesagt) CareTeam als eine Instantiierung eines HealthcareService oder einer Organization interpretieren.</p>",
        "id": 154026301,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1545209108
    },
    {
        "content": "<p>Zur Zuordnung von Fachpersonal zu $OrganisatorischeEinheit dient nb noch PractitionerRole. Oder/und man verwendet z.B. Group zur generischen, nicht patientenbezogen Abbildung der Mitglieder eines Behandlungsteams</p>",
        "id": 154026303,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1545209591
    },
    {
        "content": "<p>Die Frage nach dem partOf kann spannend sein. Ist die \"§301-Fachabteilung\" evtl. nur ein Code im type der \"Med.Abteilung\"-Organization? Wenn nein: warum nicht? Wie hängen die genannten Organisationseinheiten zusammen? Dazu hat bestimmt jeder eine Vorstellung, aber haben auch alle die selbe?</p>\n<p>Ich mag ja bekanntermaßen Diagramme, daher: kann jemand (evtl. <span class=\"user-mention\" data-user-id=\"194649\">@Michael Sauer</span> als Thread-Ersteller?) dazu ein Klassendiagramm o.ä. hier einstellen?</p>",
        "id": 154026306,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1545210400
    },
    {
        "content": "<p>Kann ich gerne machen (habe ich auch schon in VISIO angefangen, da aber im Kontext eines konkreten Anwendungsfalls). <br>\nIn welchem Format erstelle ich das Diagramm und wo soll ich es ablegen, damit man es vom Chat aus verwenden kann?</p>",
        "id": 154026312,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1545213219
    },
    {
        "content": "<p>Soweit bin ich ganz bei Patrick, ausser bei:</p>\n<blockquote>\n<p>Intersdisp. Zentren wären für mich auch eine Organization, ebenso Organisatorische Einheiten. <br>\nDenn hier habe ich es mit Gruppen von Organisationen zu tun, die nicht Teil einer Monohierarchie (partOf) sind, sondern eher was von \"memberOf\". Ein \"memberOf\" gibt es bei der Resource \"Organization\" aber nicht - deshalb die Überlegung mit dem \"CareTeam\", das mit der Kategorie \"event\" bereits einen nicht patientenspezifischen Kontext hat. <br>\nGroup wäre m.E. noch eine Alternative, die sieht aber keine Organisationen vor und passt auch nicht zu den UseCases. </p>\n</blockquote>\n<p>Ich nehme erstmal Anregung von Stefan Lang auf und versuche das in ein schönes Diagramm zu verpacken...:-)</p>",
        "id": 154026315,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1545217466
    },
    {
        "content": "<p>Mach einfach ein PNG draus und pack es hier als Anhang rein. PDF kann alternativ bzw. zusätzlich noch gut sein, wenn es denn so groß ist, dass man zoomen möchte :)</p>",
        "id": 154026399,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1545241234
    },
    {
        "content": "<p>Ad Interdisz.Zentren: Feste Gruppen von Organisationen sind aber de facto auch wieder Organisationen.<br>\nIch stimme allerdings zu, dass eine Organisation (Klinik, Abteilung, ...) Teil von mehreren interdisziplinären Zentren sein kann. Das ist dann sicher nicht mehr im Scope von partOf.<br>\nCareTeam passt an der Stelle m.E. trotzdem nicht, da die Beschreibung unter Boundaries klar stellt, dass CareTeam im Patientenkontext zu verwenden ist.<br>\nGroup ist in der Tat für Individuen gedacht. Generischer ist List, könnte hier helfen (allerdings wahrscheinlich auch nicht ohne Extensions).</p>\n<p>Aber warten wir mal das Diagramm ab. Wichtig wäre darin noch, beispielhaft die Inhalte zu kennen (also: Ärzte oder Pflegepersonal, oder Organsationsdaten, oder ...)</p>",
        "id": 154026407,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1545241956
    },
    {
        "content": "<p>Sucht ihr das: <a href=\"http://build.fhir.org/organizationaffiliation.html\" target=\"_blank\" title=\"http://build.fhir.org/organizationaffiliation.html\">http://build.fhir.org/organizationaffiliation.html</a> ?</p>",
        "id": 154026412,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1545243564
    },
    {
        "content": "<p>Simone, Du bist Klasse! <span class=\"emoji emoji-1f44d\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 154026603,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1545293206
    },
    {
        "content": "<p>Genau danach habe ich gesucht. </p>\n<p>@Stefan Lang: Das Diagramm mache ich noch - bin mir aber nicht sicher, ob ich es noch vor Weihnachten hinbekomme...</p>",
        "id": 154026604,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1545293305
    },
    {
        "content": "<p>Ich merke, dass es gar nicht so einfach ist, Bilder zu machen, die so generisch wie möglich und so konkret wie nötig sind. </p>\n<p>Anbei habe ich mal meine Entwürfe für die <br>\n- generelle Struktur eines Klinikums<br>\n<a href=\"https://cbt.uniklinik-freiburg.de/sauer/Klinikstruktur.png\" target=\"_blank\" title=\"https://cbt.uniklinik-freiburg.de/sauer/Klinikstruktur.png\">Klinikstruktur.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"https://cbt.uniklinik-freiburg.de/sauer/Klinikstruktur.png\" target=\"_blank\" title=\"Klinikstruktur.png\"><img src=\"https://cbt.uniklinik-freiburg.de/sauer/Klinikstruktur.png\"></a></div><ul>\n<li>\n<p>für ein interdisziplinären Zentrum<br>\n<a href=\"https://cbt.uniklinik-freiburg.de/sauer/Interdisziplin%C3%A4res-Zentrum.png\" target=\"_blank\" title=\"https://cbt.uniklinik-freiburg.de/sauer/Interdisziplin%C3%A4res-Zentrum.png\">Interdisziplinäres-Zentrum.png</a></p>\n<div class=\"message_inline_image\"><a href=\"https://cbt.uniklinik-freiburg.de/sauer/Interdisziplin%C3%A4res-Zentrum.png\" target=\"_blank\" title=\"Interdisziplinäres-Zentrum.png\"><img src=\"https://cbt.uniklinik-freiburg.de/sauer/Interdisziplin%C3%A4res-Zentrum.png\"></a></div></li>\n<li>\n<p>für einen Anmeldebereich (Patientenaufnahme für mehrere Ambulanzen/Stationen):<br>\n<a href=\"https://cbt.uniklinik-freiburg.de/sauer/Anmeldebereich.png\" target=\"_blank\" title=\"https://cbt.uniklinik-freiburg.de/sauer/Anmeldebereich.png\">Anmeldebereich.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"https://cbt.uniklinik-freiburg.de/sauer/Anmeldebereich.png\" target=\"_blank\" title=\"Anmeldebereich.png\"><img src=\"https://cbt.uniklinik-freiburg.de/sauer/Anmeldebereich.png\"></a></div></li>\n<li>\n<p>für die Gruppierung von Organisationseinheiten am Beispiel einer Fachabteilung wie sie im §301 benötigt wird<br>\n<a href=\"https://cbt.uniklinik-freiburg.de/sauer/Fachabteilung.png\" target=\"_blank\" title=\"https://cbt.uniklinik-freiburg.de/sauer/Fachabteilung.png\">Fachabteilung.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"https://cbt.uniklinik-freiburg.de/sauer/Fachabteilung.png\" target=\"_blank\" title=\"Fachabteilung.png\"><img src=\"https://cbt.uniklinik-freiburg.de/sauer/Fachabteilung.png\"></a></div></li>\n</ul>\n<p>Alle bisherigen Anforderungen lassen sich so auflösen - werde es aber noch mit meinen Kollegen weiter abstimmen. <br>\nIch meine auch, dass die Strukturen kein Widerspruch zum mCSD gibt, allerdings sind die Überschneidungen auch gering.<br>\nNicht wundern: Die Ressource \"Practioner\" taucht nicht auf, da die Ärzte als Personen nicht verplant werden. (Das erfolgt über den Dienstplan).</p>\n<p>Ich freue mich über Kommentare von Euch!</p>",
        "id": 154027153,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1545937042
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191964\">@Bettina Lieske</span> : Habt ihr schon irgendwas in der Richtung definiert...?</p>",
        "id": 154664975,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1546971869
    },
    {
        "content": "<p>Hallo, </p>\n<p>Interessante Diskussion, ich arbeite gerade an etwas Ähnliches. Jetzt habe ich eine Situation mit zusätzlichen Konfigurationsdaten, die ich speichern muss, aber ich weiß nicht, wo. Vielleicht hat jemand eine gute Idee. </p>\n<p>Es geht um die Planbetten. In meinem Anwendungsfall hat jede Station (Location-Resource) eine Anzahl von Planbetten, die echte physische Objekte sind. Und für jede medizinische Abteilung (Organization-Resource) haben wir die Anzahl der Betten, die sie auf verschiedenen Stationen belegen dürfen. Ich könnte die Gesamtzahl der Stationsbetten und der Organisationsbetten in ein Extention speichern. Aber dann habe ich noch die Kreuztabelle, die mir sagt, wie viele der Abteilungsbetten auf echte Betten aus den verschiedenen Stationen abgebildet sind. </p>\n<p>Was könnte ein geeigneter Weg sein? Eine weitere Erweiterung in der Organization-Ressource, d.h. eine Reihe von Referenzen auf die Stations-Locations und der Anzahl der Planbetten? Im Moment fällt mir nichts Besseres ein.</p>\n<p>Ich freue mich auf Kommentare. Danke.</p>",
        "id": 161973554,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1553793539
    },
    {
        "content": "<p>Vielleicht eine List von Betten mit subject:Location(Station)?</p>",
        "id": 161974005,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1553793847
    },
    {
        "content": "<p><a href=\"http://hl7.org/implement/standards/fhir/list.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/list.html\">http://hl7.org/implement/standards/fhir/list.html</a></p>",
        "id": 161974011,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1553793853
    },
    {
        "content": "<p>Eine sehr gute Idee, ich habe es anfänglich verworfen, weil Organization nicht als Subject vorgehesen ist. Ich wollte die Verbindung von Organization zu Station machen. Aber du hast völlig recht, man kann es auch umdrehen und man spart sich dann die Extention. </p>\n<p>Danke !</p>",
        "id": 161976753,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1553795689
    },
    {
        "content": "<p>Ich habe übrigens eine kleine Exe gebaut, mit dem man sich Locations und Organizations in eine Baumstruktur leicht zusammenbauen kann. Wenn es jemand interessiert, kann ich es irgendwo hochladen.</p>",
        "id": 161976841,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1553795758
    },
    {
        "content": "<p>Liste allein ist leider nicht ausreichend. Es ist nicht bekannt welche konkrette Betten aus der Station der Fachabteilung zustehen, sondern nur die Anzahl. Ich mache erstmals eine Liste mit Observations, subject:Location(Station) und Performer:Organization(Fachabteilung) und als valueQuantity die Anzahl der Betten. Es sei den jemand hat ganz starke Einwände ?</p>",
        "id": 161985205,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1553801641
    },
    {
        "content": "<p>Ich würde gern auch ein passendes LOINC code benutzen. Wie zB: </p>\n<p><a href=\"https://details.loinc.org/LOINC/52046-0.html\" target=\"_blank\" title=\"https://details.loinc.org/LOINC/52046-0.html\">https://details.loinc.org/LOINC/52046-0.html</a></p>\n<p>LOINC ist aber nicht meine Stärke. Wie sucht man, bzw. entscheided man am besten welche Codes passen?</p>",
        "id": 161985335,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1553801718
    },
    {
        "content": "<p>Ich glaube nicht, dass es dafür einen LOINC gibt. Schwerpunkt sind Observations (Labor, Klink), die irgendwas mit dem Patienten und seinen Subsystemen zu tun haben.</p>",
        "id": 161987538,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1553803327
    },
    {
        "content": "<p>Danke für die Rückmeldung.<br>\nEs fühlt sich tatsächlich ein wenig komisch an, dafür Observations zu benutzen. Ich habe gelesen, dass man sie für Geräte-Konfigurationsparameter außerhalb des Patient/Encounter-Kontextes benutzen kann. Und was ich hier im Grunde brauche sind Konfigurationsparameter für die Stationen, bzw. Fachabteilungen.</p>\n<p>LOINC code habe ich hier gefunden:</p>\n<p><a href=\"https://www.hl7.org/fhir/valueset-c80-doc-typecodes.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-c80-doc-typecodes.html\">https://www.hl7.org/fhir/valueset-c80-doc-typecodes.html</a></p>\n<p>Ist im Grunde für Dokumente wo die Krankenhausbetten beschrieben werden. Andererseits, aus Entwicklersicht im Moment, ist es ein Konfigurationsparameter für meine Anwendung. Wäre aber notwendig und praktisch es von der Krankenhausadministration bearbeiten zu lassen und als Dokument entsprechend zu versionieren, freigeben, tracen usw. </p>\n<p>Ist vielleicht zu kreativ, dafür ist es ohne Extentions machbar ;-)</p>",
        "id": 162024001,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1553844108
    },
    {
        "content": "<p>Ich würde das hier gern ausgraben und nochmal an das Ursprungsthema anknüpfen: Wie sage ich bei einer interdisziplinär belegten Station (Location) aus, dass sie mehreren unabhängigen Kliniken (Organization) zuzuteilen ist? partOf und managingOrganization sind beide 0..1 und die Zuteilung kann sich über die Zeit ändern, so dass eine Aufteilung in Teil-Stationen auch nicht sinnvoll ist <span aria-label=\"worried\" class=\"emoji emoji-1f61f\" role=\"img\" title=\"worried\">:worried:</span></p>",
        "id": 197264254,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1589284670
    },
    {
        "content": "<p>Mittels <a href=\"https://www.hl7.org/fhir/healthcareservice.html\">https://www.hl7.org/fhir/healthcareservice.html</a> kannst du pro Disziplin auf die Location und eine Organization verweisen.</p>",
        "id": 197266850,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1589286167
    },
    {
        "content": "<p>Na ja, im Grunde würde man dann HealthcareService als M:N Link benutzen, so ziemlich genau wie ich die Observation dafür missbraucht habe :-) Hängt tatsächlich etwas vom UseCase. In meinem Fall musste auch noch irgendwo unterbringen, wie viel Betten pro Fachrichtung auf der Station reserviert sind, daher passte die Observation besser. Habe mir aber auch sehr genau das HealthcareService angeschaut. Gibt es da auch nicht ein IHE Profil dafür? Irgendwo habe ich gelesen, dass daraus auch ein IG gemacht wurde. Eventuell hat man es dort andere Ideen gehabt.</p>",
        "id": 197581903,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1589473960
    },
    {
        "content": "<p><a href=\"https://wiki.ihe.net/index.php/Mobile_Care_Services_Discovery_(mCSD)\">https://wiki.ihe.net/index.php/Mobile_Care_Services_Discovery_(mCSD)</a></p>",
        "id": 197607946,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1589485529
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193971\">Stoyan Halkaliev</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Organisationseinheiten.20im.20Krankenhaus/near/197607946\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://wiki.ihe.net/index.php/Mobile_Care_Services_Discovery_(mCSD)\">https://wiki.ihe.net/index.php/Mobile_Care_Services_Discovery_(mCSD)</a></p>\n</blockquote>\n<p>den hatte ich im Hinterkopf.</p>",
        "id": 197612547,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1589487733
    },
    {
        "content": "<p>Hallo zusammen,</p>\n<p>ich habe gerade mir großem Interesse diesen Stream gelesen. Spannende Gedankenansätze!<br>\nIch bin derzeit dabei, Klinikstrukturen von Reha- und Akuthäusern mittels Organization, OrganizationAffiliation und Location auf FHIR abzubilden. Mir ist das Zusammenspiel zwischen Organization und Location noch nicht so klar. Was wird als Organization und was als Location abgebildet und wie interagieren die Objekte miteinander. Sehr hilfreich wäre hierbei eine Beispielmodellierung, welche ein RealWorld-Scenario abbildet. Ich habe gesehen, dass <span class=\"user-mention\" data-user-id=\"194649\">@Michael Sauer</span> bereits Ansätze bereitgestellt hat. Leider sind diese nicht mehr verfügbar. Wäre es möglich, an diese noch einmal heranzukommen? Sehr gerne beteilige ich mich an der Diskussion hier. </p>\n<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  ich hatte auch schon auf diversen FHIR-Testservern nach Beispielstrukturen gesucht, jedoch leider ohne wirklichen Erfolg. Hast Du ansonsten noch eine Idee, wo ich fündig werden könnte?<br>\nEine Frage, die z.B. auch aufkam war, wieso eine Location und nicht eine Organisation Öffnungszeiten hat. Bestimmt liegt hier nur ein Verständnisfehler meinerseits vor, daher wäre es gut, wenn es etwas gibt, womit ich meine Gedanken sortieren kann.</p>\n<p>Besten Dank im Voraus <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 203250507,
        "sender_full_name": "Adrian Lingen",
        "timestamp": 1594203126
    },
    {
        "content": "<p>Location is a physical thing that exists in the real world, it has doors that are open or locked (and opening hours), and a GPS location. An organization is a legal/conceptual thing, that may use many locations. As humans we tend to mix the two:  \"I'll visit Aldi\" - both the organization (the AG), as well as some physical store around the corner in my town. This is a very old discussion in modelling, confusion is quite common. A hospital department may move to a new location, but it'll still be the same department.</p>",
        "id": 203251086,
        "sender_full_name": "René Spronk",
        "timestamp": 1594203533
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> ! But how do they interact exactly? So if we take a organization with several clinics for instance and each clinic has departments. I find \"department\" in both ValueSets for OrganizationType and LocationType. And do we build two architectural streams here in parallel or do both complement each other in any way?</p>",
        "id": 203252274,
        "sender_full_name": "Adrian Lingen",
        "timestamp": 1594204449
    },
    {
        "content": "<p>Aldi AG (organization) is of type 'supermarket', the-Aldi-store-on-Berhammn-strasse-2 (Location) is also of type 'supermarket'. One is a type of organization, the other a kind of location (the interior of that building is suitable for it being a supermarket. It could become a ReWe some day, the location would be the same, but the associated organization would change).</p>",
        "id": 203255337,
        "sender_full_name": "René Spronk",
        "timestamp": 1594206936
    },
    {
        "content": "<p>First of all, we have the organization tree. This is the 'chain of command', and doesn't use any locations.</p>",
        "id": 203255407,
        "sender_full_name": "René Spronk",
        "timestamp": 1594206965
    },
    {
        "content": "<p>A Location has a n..m relationship with organizations(or parts thereof).</p>",
        "id": 203255445,
        "sender_full_name": "René Spronk",
        "timestamp": 1594207002
    },
    {
        "content": "<p>Some countries focus more on the organizational aspect, others on locations, some combine/conflate the two. It'll be up to you to determine how to solve this puzzle in the German context.</p>",
        "id": 203255571,
        "sender_full_name": "René Spronk",
        "timestamp": 1594207125
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"195705\">Adrian Lingen</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Organisationseinheiten.20im.20Krankenhaus/near/203250507\">said</a>:</p>\n<blockquote>\n<p>Sehr hilfreich wäre hierbei eine Beispielmodellierung, welche ein RealWorld-Scenario abbildet. Ich habe gesehen, dass <span class=\"user-mention silent\" data-user-id=\"194649\">Michael Sauer</span> bereits Ansätze bereitgestellt hat. Leider sind diese nicht mehr verfügbar. Wäre es möglich, an diese noch einmal heranzukommen? </p>\n</blockquote>\n<p>Klar, gerne. Das waren die Bilder, die ich damals gepostet habe:</p>\n<p>Allgemeine Organisationstruktur:<br>\n<a href=\"/user_uploads/10155/YME5AZwhIIGSlK_el5sF1ifo/grafik.png\">grafik.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/YME5AZwhIIGSlK_el5sF1ifo/grafik.png\" title=\"grafik.png\"><img src=\"/user_uploads/10155/YME5AZwhIIGSlK_el5sF1ifo/grafik.png\"></a></div><p>Es gibt auch Bereiche, in denen die Sprechstunde nicht allgemein in der Ambulanz, sondern für explizit auf Räume geplant wird. Die Strukur sieht dort so aus:<br>\n<a href=\"/user_uploads/10155/sIpJ_omdhNYl3rYGL-qSnIcK/grafik.png\">grafik.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/sIpJ_omdhNYl3rYGL-qSnIcK/grafik.png\" title=\"grafik.png\"><img src=\"/user_uploads/10155/sIpJ_omdhNYl3rYGL-qSnIcK/grafik.png\"></a></div><p>Eine konkrete Abbildung könnte so aussehen:<br>\n<a href=\"/user_uploads/10155/zfJiQKmuOZPlE_LfwEiKWcgC/grafik.png\">grafik.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/zfJiQKmuOZPlE_LfwEiKWcgC/grafik.png\" title=\"grafik.png\"><img src=\"/user_uploads/10155/zfJiQKmuOZPlE_LfwEiKWcgC/grafik.png\"></a></div><p>Zum interdisziplinären Zentrum gehören mehrere Funktionsbereiche, die in einer eigenen Ressource (OrganizationAffiliation) zusammengefasst werden können. <br>\n<a href=\"/user_uploads/10155/npROG_WzvHzcUtKkKy_AJE4r/grafik.png\">grafik.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/npROG_WzvHzcUtKkKy_AJE4r/grafik.png\" title=\"grafik.png\"><img src=\"/user_uploads/10155/npROG_WzvHzcUtKkKy_AJE4r/grafik.png\"></a></div><p>Ich muss allerdings gestehen, dass unsere tatsächliche Abbildung der FHIR-Ressourcen leicht davon abweicht, was aber eher den Quellsystemen geschuldet ist, die die Daten liefern.</p>\n<p>Was wir mittlerweile noch verfeinert haben ist die PartOf Hierarchie der Lokation - mit dem Ziel den Ort besser beschreiben zu können. Zudem haben wir die Lokation noch mit einer Extention erweitert um sog. \"Assoziierte Lokationen\" abbilden zu können. Das sind Verweise auf Lokationen, die im Kontext einer Lokation interessant sind (z.B. die nächste Straßenbahnhaltestelle, der nächste Parkplatz, die Patientenanmeldung, das nächste Kiosk,...)</p>",
        "id": 203265043,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1594213955
    },
    {
        "content": "<p>Die Beispiele sind jetzt konkrete Instanzen bzw. schon direkt technische Abbildungen. Das sollte mMn unabhängig davon mal aufgemalt werden. Dann kann man besser überlegen, wie das in einer Technologie wie FHIR abgebildet werden kann...</p>",
        "id": 203281062,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594221781
    },
    {
        "content": "<p><a href=\"user_uploads/10155/Bmw_aq1MGnDtpMoUX5tmQWcB/OEs.png\">OEs.png</a><br>\nSowas hier? Ich bin nicht sicher, ob wir das für Krankenhäuser detaillierter abgebildet bekommen, ohne in Hausspezifika zu gelangen…</p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/10155/Bmw_aq1MGnDtpMoUX5tmQWcB/OEs.png\" title=\"OEs.png\"><img src=\"user_uploads/10155/Bmw_aq1MGnDtpMoUX5tmQWcB/OEs.png\"></a></div>",
        "id": 203359006,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1594281346
    },
    {
        "content": "<p>In die Richtung: 1 Krankenhaus, 1 Fachabteilung, 1 Station, und dann jeweils die entsprechenden Beziehungen dazwischen. Zusätzlich Orte etc...</p>",
        "id": 203359217,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594281501
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  Thanks a lot! Internally we used the wording \"Organization\" which is actual a \"Location\" in FHIR.<br>\n<span class=\"user-mention\" data-user-id=\"194649\">@Michael Sauer</span>  Super, vielen Dank! Sicherlich muss man bei der modellieren sehr flexibel bleiben, weswegen ich versuche, einen möglichst generischen Ansatz zu bauen.<br>\n<span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span>  <span class=\"user-mention\" data-user-id=\"194875\">@Danny Ammon</span>  Definitiv. Das Datenmodell sollte man generisch aufbauen und nicht an bestimmte Instanzen hängen. Diese waren aber zunächst sehr hilfreich, um die Verwendung dieser Ressourcen besser zu verstehen. Sobald ich meinen Ansatz fertig modelliert habe, kann ich diesen auch hier posten.</p>",
        "id": 203361396,
        "sender_full_name": "Adrian Lingen",
        "timestamp": 1594283198
    },
    {
        "content": "<p>Bitte hier mal bei den KIS-Systemen anfragen. Die haben jeweils ganz spezielle Beziehungen etabliert, um intern verschiedene Details wie Abrechnungsmodalitäten dranzuhängen. Wenn das nicht berücksichtigt wird, dann dürfte das Mapping sehr aufwändig werden.  Dann ist FHIR auch keine Lösung...</p>",
        "id": 203363228,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594284789
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"194875\">Danny Ammon</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/Organisationseinheiten.20im.20Krankenhaus/near/203359006\">said</a>:</p>\n<blockquote>\n<p>Sowas hier? Ich bin nicht sicher, ob wir das für Krankenhäuser detaillierter abgebildet bekommen, ohne in Hausspezifika zu gelangen…</p>\n</blockquote>\n<p>Vorsicht: Diese Abbildung repräsentiert ein Krankenhaus aus Sicht des 20 JH. Da hat sich viel geändert. Die Skizze berücksichtigt insbesondere weder die diversen Ambulanten Angebote noch interdisziplinäre Behandlungs-Teams die sich aus Mitarbeitern verschiedener Fachabteilungen zusammen setzen. Auch assoziiert es eine starre Struktur - mittlerweile wird das viel dynamischer gehandhabt (Stationen sind nicht mehr einer Fachabteilung zugeordnet - stattdessen belegen Fachabteilungen Betten auf Stationen - je nach Bedarf).</p>",
        "id": 203365901,
        "sender_full_name": "Michael Sauer",
        "timestamp": 1594286678
    },
    {
        "content": "<p>Genau, malt das doch bitte mal auf...</p>",
        "id": 203369446,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594289280
    },
    {
        "content": "<p>Station n:m Fachabteilung</p>",
        "id": 203369506,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594289313
    },
    {
        "content": "<p>Krankenhaus 1:n Fachabteilung</p>",
        "id": 203369526,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594289336
    },
    {
        "content": "<p>O.ä.</p>",
        "id": 203369533,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594289343
    },
    {
        "content": "<p>Schon klar – ich hab das versucht, dadurch auszudrücken, dass von mehreren Fachabteilungen aus Linien zu einer Station gehen, aber das war nur ein Schnellschuss, sorry… So wie von Frank beschrieben muss es natürlich modelliert werden!</p>",
        "id": 203374534,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1594294061
    },
    {
        "content": "<p>N.B.: Wahrscheinlich auch zunehmend:<br>\n<code>Krankenhaus n:m Fachabteilungen</code></p>",
        "id": 203374754,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1594294226
    },
    {
        "content": "<p>Dann aber auch Krh.-Krh.</p>",
        "id": 203379227,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594297837
    }
]