[
    {
        "content": "<p>Hallo zusammen, ich habe ein Problem mit einer lokal eingesetzten HAPI-FHIR Lösung. Ich benutze den HAPI FHIR Server und lege mit Hilfe eines Java Clients Resourcen an. Wenn ich so eine Resource z.B. mit <a href=\"http://localhost:8080/baseDstu3/Observation?subject:Patient._id=1\" target=\"_blank\" title=\"http://localhost:8080/baseDstu3/Observation?subject:Patient._id=1\">http://localhost:8080/baseDstu3/Observation?subject:Patient._id=1</a> durchsuche (Über Observation an einen Patienten mit ID) bekomme ich 0 Ergebnisse. Die selbe Anfrage auf einen Testserver im Netz spuckt hingegen Ergebnisse aus. Die Resourcen sehen m.E. richtig aus (davon abgesehen, dass das alles noch in der Testphase ist)... Anbei die betreffende Resourcen (Observation, Patient), wenn ich sie direkt per GET anfrage. <br>\n<a href=\"/user_uploads/10155/zast-2Zts-TF1I-jG6SUjiYi/Resource.txt\" target=\"_blank\" title=\"Resource.txt\">Resource.txt</a></p>\n<p>Meine Frage nun: Liegt das an der HAPI FHIR-Lösung? Gibt es bessere als diese und wo finde ich Anleitungen zum Aufsetzen besserer Server?</p>",
        "id": 153989767,
        "sender_full_name": "Kilian Krockauer",
        "timestamp": 1534843543
    },
    {
        "content": "<p>Beim offiziellen HAPI-FHIR Testserver funktioniert es: <a href=\"http://fhirtest.uhn.ca/baseDstu3/Observation?subject:Patient._id=1\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu3/Observation?subject:Patient._id=1\">http://fhirtest.uhn.ca/baseDstu3/Observation?subject:Patient._id=1</a><br>\nInsofern würde ich auf ein lokales Problem oder einen mittlerweile behobenen Bug tippen. Evtl. hat <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> da Erfahrungen? Ansonsten einfach im HAPI-Stream nochmal fragen: <a href=\"#narrow/stream/8-hapi\" title=\"#narrow/stream/8-hapi\">https://chat.fhir.org/#narrow/stream/8-hapi</a></p>\n<p>\"Besser\" ist immer so eine Sache ;-)<br>\nHAPI ist schon eine der vollständigsten Implementierungen derzeit, insbesondere als Open Source.<br>\nDie Delphi-Implementierung (der de-facto-Referenzserver) ist sehr vollständig, aber nicht unbedingt für den Produktiveinsatz gedacht.<br>\nAndere Open Source Implementierungen vollständiger FHIR-Server sind m.W. bisher vergleichsweise rudimentär.<br>\nEs gibt noch die Dotnet-Referenzimplementierung, mit Vonk als darauf aufsetzendem kommerziellen Produkt.<br>\nUnd natürlich diverse kommerzielle Produkte, überwiegend von diversen US-Herstellern.<br>\nKurz: im Wesentlichen ist HAPI das Mittel der Wahl, wenn man auf eine Kern-Implementierung aufsetzen und selbst weiter implementieren möchte.</p>",
        "id": 153989773,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1534848125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195430\">@Kilian Krockauer</span> wie hast du deinen lokalen HAPI deployed? HAPI CLI, Spring Boot, oder JPA Example Server auf Tomcat. Benutzt du eine stable Version oder den aktuellen Code Stand?</p>",
        "id": 153989821,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1534867313
    },
    {
        "content": "<p>Wie Stefan schon getestet hatte funktioniert es mit anderen Servern, ich vermute ein lokales Problem oder alte Version?</p>",
        "id": 153989822,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1534867525
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span>  Danke für deine Antwort. Im Grunde möchte ich \"nur\" einen Server haben, auf dem ich FHIR Resourcen 1. ablegen und 2. mit kombinierten GETs alá ?Resource1:Resource2.Attribut, etc. abrufen kann. Da ich das im Rahmen einer Masterthesis mache, das Erstellen der Resourcen allerdings nicht das Hauptthema ist, würde ich gerne von einer Selbtimplementierung einer Server-Logik erstmal absehen.</p>\n<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> Ich benutze die HAPI CLI in Version 3.4.0  unter Java 8 mit den Parametern \"-v dtsu3 --allow-external-refs\"<br>\nWas kann ich unter einem lokalen Problem verstehen? Also, was sind die häufigsten Fehler, die man so machen kann?</p>",
        "id": 153989869,
        "sender_full_name": "Kilian Krockauer",
        "timestamp": 1534883887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195430\">@Kilian Krockauer</span> In dem Fall kommt man an HAPI quasi nicht vorbei ;)</p>",
        "id": 153989881,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1534885155
    },
    {
        "content": "<p>Zu Testzwecken und dem Ablegen bzw. Abrufen von Ressourcen würde ich auch eine einfache Testversion von Vonk anbieten (<a href=\"https://simplifier.net/vonk\" target=\"_blank\" title=\"https://simplifier.net/vonk\">https://simplifier.net/vonk</a>). Läuft auf Windows nativ und auf allen anderen Plattformen per Docker.<br>\nFalls doch noch was dazu implementiert werden müsste, können Plug-Ins (in .NET geschrieben) für den Server hinzugefügt werden. <br>\nDie einzige Einschränkung besteht darin, dass der Server 1x alle 24h neugestartet werden muss.</p>",
        "id": 153989889,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1534887396
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195430\">@Kilian Krockauer</span> <br>\nIch habe das ganze gerade bei mir getestet:<br>\nJava: java version \"1.8.0_181\"<br>\nHAPI CLI: 3.4.0</p>\n<p>Mit deinen Ressourcen getestet (nur den ref auf den Encounter entfernt da ich dieser in deinem TXT fehlte und auch nicht relevant ist)</p>",
        "id": 153990187,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1534948621
    },
    {
        "content": "<p><a href=\"http://localhost:8080/baseDstu3/Observation?subject:Patient._id=1\" target=\"_blank\" title=\"http://localhost:8080/baseDstu3/Observation?subject:Patient._id=1\">http://localhost:8080/baseDstu3/Observation?subject:Patient._id=1</a><br>\nliefert mir das korrekte Ergebnis zurück.</p>",
        "id": 153990188,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1534948663
    },
    {
        "content": "<p>Mit lokalen Problemen meinte ich eigentlich nur eine Fehlkonfiguration (was ja mit der CLI recht schwer geht ;-) )</p>",
        "id": 153990189,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1534948706
    },
    {
        "content": "<p>Aber ein Problem wäre bspw. HAPI 3.4.0 mit Java10 zu starten, das geht erst in der 3.5-SNAPSHOT</p>",
        "id": 153990190,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1534948738
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195430\">@Kilian Krockauer</span> :<br>\nWie sind die Resoucen denn in deinen HAPI reingekommen? Über die API gepostet oder über ein preload/Import? Kann es sein, dass die zwar in der DB gespeichert sind, aber sich irgendwie an der Indexierung vorbeigemogelt haben?</p>",
        "id": 153990197,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1534950717
    },
    {
        "content": "<p>...falls dem so wäre sollte sich das Problem lösen lassen, indem du die Observation einmal über ein PUT updatest.</p>",
        "id": 153990198,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1534950806
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Danke für den Hinweis, werde ich mal austesten, wenn ich wieder vor dem Server sitze. Erstellt habe ich die Resourcen mit einem Java HAPI Client per client.create()...execute() <br>\n<span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> Jetzt bin ich wirklich gespannt, wo mein Fehler liegt.</p>",
        "id": 153990345,
        "sender_full_name": "Kilian Krockauer",
        "timestamp": 1535008291
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Dein Tipp hat es wohl gelöst! Wenn ich eine Ressource per Postman per Hand nochmal mit den selben Daten anlege/update, läuft die Suche. Jetzt muss ich nur noch herausfinden, wieso HAPI das nicht macht...</p>",
        "id": 153991197,
        "sender_full_name": "Kilian Krockauer",
        "timestamp": 1535442788
    },
    {
        "content": "<p>Habe das Problem nun erstmal dadurch gelöst, dass ich am Ende meiner Erstellung der Ressourcen noch einmal über alle Ressourcen gehe und ein simples client().update() auf ihnen ausführe. Ich schätze, dass da irgendwas bei der Reihenfolge des Erstellens der Ressourcen nicht richtig läuft. Da müsste ich mal genauer nachforschen, aber der Workaround läuft erstmal. Vielen Dank an alle!</p>",
        "id": 153991204,
        "sender_full_name": "Kilian Krockauer",
        "timestamp": 1535446413
    }
]