[
    {
        "content": "<p>Ich eröffne hier mal die Diskussion zu der Frage: Was sind die minimalen Qualitätsanforderungen an einen FHIR-Implementierungsleitfaden?  Es sollten möglichst einfach zu überprüfende Kriterien sein, die es dem TC erlauben, möglichst schnell zu entscheiden, ob ein Leitfaden die Mindest-Anforderungen erfüllt, um ein Abstimmungsverfahren zu durchlaufen.</p>\n<p>Hier mal eine grobe Ideensammlung, die ich zur Diskussion stellen möchte:</p>\n<ul>\n<li>verständlich formulierter Implementierungsleitfaden mit menschenlesbaren Repräsentationen der technischen Profile</li>\n<li>valide technische Spezifikation, publiziert als Package, bereitgestellt unter <a href=\"https://registry.fhir.org/\">https://registry.fhir.org/</a></li>\n<li>valide Beispieldaten zu allen enthaltenen Profilen</li>\n<li>Verwendung internationaler Terminologien</li>\n<li>Relevanz</li>\n</ul>",
        "id": 230345355,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615815670
    },
    {
        "content": "<p>Hallo Frau Heckmann,<br>\naus meiner Sicht sollte der IG einen beispielhaften klinischen Ablauf darstellen, damit die zeitliche Reihenfolge der zu verwendenden Ressourcen (soweit vorgesehen) für die Abbildung eines Usecases aus dem IG ersichtlich ist.</p>",
        "id": 230346679,
        "sender_full_name": "Pavlo Dyban",
        "timestamp": 1615816154
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>  Der Quality Check ist in Simplifier erst in der Team Lizenz verfügbar.  Aber vielleicht könnten wir den Check auch auf andere Art zur Verfügung stellen...z.B. in GitHub...?</p>",
        "id": 230346819,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615816203
    },
    {
        "content": "<p>Oh ok, das wusste ich selbst nicht</p>",
        "id": 230347123,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1615816308
    },
    {
        "content": "<p>Das erklärt das Problem von <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span></p>",
        "id": 230347158,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1615816320
    },
    {
        "content": "<p>Das hatte ich mir schon glatt gedacht, daher meine Frage vorhin...</p>",
        "id": 230347266,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1615816343
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"251855\">Pavlo Dyban</span> <a href=\"#narrow/stream/179183-german-(d-a-ch)/topic/QS.20f.C3.BCr.20Implementierungsleitf.C3.A4den/near/230346679\">said</a>:</p>\n<blockquote>\n<p>Hallo Frau Heckmann,<br>\naus meiner Sicht sollte der IG einen beispielhaften klinischen Ablauf darstellen, damit die zeitliche Reihenfolge der zu verwendenden Ressourcen (soweit vorgesehen) für die Abbildung eines Usecases aus dem IG ersichtlich ist.</p>\n</blockquote>\n<p>Ich denke nicht, dass man das als pauschale Voraussetzung sehen kann. Eine FHIR-Spezifikation kann auch einfach nur ein Datenexport-Format festlegen (DiGa/ KBV-AWS) oder einen Verzeichnisdienst (Weisse Liste, Apothekenverzeichnis). Da gibt es keinen klinischen Workflow in diesem Sinne.</p>",
        "id": 230347284,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615816350
    },
    {
        "content": "<p>Es würde nur gehen, wenn man Firely Terminal laufen lässt, aber auch da wäre eine Lizenz notwendig</p>",
        "id": 230347315,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1615816365
    },
    {
        "content": "<p>Schade. Also müssten wir die Packages temporär auf ein HL7-Projekt werfen, QS laufen lassen und dann dem Einreichenden die Fehlerliste zur Korrektur zurückgeben und das ggf in mehreren Iterationen. Suboptimal.</p>",
        "id": 230347619,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615816485
    },
    {
        "content": "<p>Die Frage ist ohnehin, nehmen wir Simplifier in DE als gesetzt an (zumindest in der freien Version), oder müssen wir Kriterien formulieren, die auch mit dem IG Publisher erfüllt werden könnten...? Letzten Endes kommt es ja nur darauf an, dass ein valides Package in der Registry landet. wie das dahin kommt, sollte eigentlich egal sein...</p>",
        "id": 230348544,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615816827
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"251855\">@Pavlo Dyban</span> Ich sehe das ebenfalls kritisch vor dem Hintergrund, dass wir auch Leitfäden für Dokumente haben. Hier ist die Reihenfolge meist nicht so relevant, außer dass die Composition nach den anderen Ressourcen erstellt werden und das Bundle als letztes. Natürlich kann es auch da feste Reihenfolgen geben, aber z.B. bei einem Wundbericht setze ich im Idealfall auf bestehende Ressourcen auf, deren Erstellungsreihenfolge nicht in meinem Scope liegt.</p>",
        "id": 230348993,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1615816984
    },
    {
        "content": "<p>Es müsste einen öffentlichen Endpunkt geben, an dem man ein Package QSsen lassen kann...</p>",
        "id": 230349007,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615816986
    },
    {
        "content": "<p>Ich wollte gerade etwas ähnliches schreiben wie <span class=\"user-mention silent\" data-user-id=\"191450\">Simone Heckmann</span></p>",
        "id": 230349163,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1615817042
    },
    {
        "content": "<p>Könnte man nicht ein Github-ACC mit Firely und hl7 Validator Unterstützung einrichten, so wie Alex es gezeigt hat...Dann könnte die Leute dort einfach ihre Profile hochladen</p>",
        "id": 230350377,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1615817468
    },
    {
        "content": "<p>Jeder kann einen PR erstellen, der dann die QS durchläuft, und die PRs werden einfach nie gemerged... <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> <br>\nKönnte gehen...</p>",
        "id": 230354265,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615818898
    },
    {
        "content": "<p>Wir haben das Thema gestern abend nochmal weiter diskutiert und sind bei folgender revidierten Liste gelandet, die möglichst nicht die Verwendung konkreter Tools voraussetzt und auch die Anmerkung von <span class=\"user-mention\" data-user-id=\"251855\">@Pavlo Dyban</span> berücksichtigt:</p>\n<ul>\n<li>verständlich formulierter Implementierungsleitfaden, der die FHIR-Artefakte textuell oder visuell repräsentiert.</li>\n<li>Beschreibung/Visualisierung des Daten- und oder Workflowmodelles</li>\n<li>valide technische Spezifikation, publiziert als FHIR-Package, bereitgestellt unter <a href=\"https://registry.fhir.org/\">https://registry.fhir.org/</a></li>\n<li>valide, aussagekräftige, repräsentative Beispieldaten</li>\n<li>korrekter Umgang mit Terminologien, Vermeidung proprietärer Codes</li>\n</ul>",
        "id": 230504488,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615898390
    }
]