[
    {
        "content": "<p>Das Basisprofil für MedicationRequest ist ja zum Verordnung von Medikamenten, z.B. im Kontext von Rezepten gedacht. Gibt es schon eine vorhergesehene Stelle um Rezepte von Rezeptlosen Verordnungen (z.B. Musterpackungen) zu unterscheiden? Passt hierfür intent? Und wenn ja welche Werte? Passt für den Status, ob ein Rezept schon gedruckt ist oder noch nicht status?</p>",
        "id": 172499235,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1565007311
    },
    {
        "content": "<p>Eine Festlegung zur Unterscheidung zwischen z.B. Kassenrezept und rezeptloser Verordnung gibt es bisher nicht. Die KBV hat in ihren Profilen z.T. solche Differenzierungen, allerdings m.W. dann auch nur im Kontext der klassischen Formulare.<br>\nintent wäre dafür nicht geeignet, denn proposal/plan/order/instance-order sind fest gebundene Codes, da darf nichts anderes stehen. category von der Beschreibung her auch nicht.</p>\n<p>Zum status müsste man nochmal den Workflow anachauen.<br>\nKönnte im ersten Ansatz passen:<br>\ndraft = in der Software angelegt<br>\nactive = gedruckt (oder elektronisch übermittelt)<br>\ncompleted = Medikament wurde abgegeben</p>",
        "id": 172536508,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1565037799
    },
    {
        "content": "<blockquote>\n<p>Rezeptlosen Verordnungen (z.B. Musterpackungen) </p>\n</blockquote>\n<p>Wie muss ich mir das Szenario vorstellen? Wenn <em>der Arzt</em> eine Musterpackung ausgibt, wäre das dann nicht einfach ein MedicationDispense?</p>",
        "id": 172571943,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1565082912
    },
    {
        "content": "<blockquote>\n<p>Wie muss ich mir das Szenario vorstellen? Wenn <em>der Arzt</em> eine Musterpackung ausgibt, wäre das dann nicht einfach ein MedicationDispense?</p>\n</blockquote>\n<p>würde ich auch so verstehen. Dispense.type könnte  man dann auf \"Musterpackung ausgegeben\" setzen.</p>",
        "id": 172573284,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1565084068
    },
    {
        "content": "<p>Erscheint einleuchtend. (note to self: Antworten nach 22:00 nochmal überdenken).<br>\nEs sei denn, es gäbe die Notwendigkeit, die Verordnung als solche zu dokumentieren, unabhängig von der praktisch zeitgleichen Abgabe des Medikaments? <span class=\"user-mention\" data-user-id=\"197584\">@Johannes Höhn</span></p>",
        "id": 172613686,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1565114562
    },
    {
        "content": "<p>Das mit den Musterpackungen ist nur ein Beispiel. Das Problem das wir haben ist, dass wir Krankenblatteinträge für Medikationen haben, die z.B. auch zum Dokumentieren von händisch ausgestellten Rezepten verwendet werden. Das ist im Grunde ein Sammelbecken für alles wo kein Rezept gedruckt wird. Vielleicht passt auch MedicationStatement wie beim KBV-Profil Dauermedikation bei der Wechselschnittstelle?</p>",
        "id": 172654695,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1565161121
    }
]