[
    {
        "content": "<p>Hallo, in der Schedule Resource scheint es ohne Erweiterung nicht möglich zu sein, ein Schedule nur für Privat versicherte Patienten und ein Schedule für gesetzlich versicherte Patienten zu erstellen / einzuschränken. Das könnte jedoch über eine Erweiterung gelöst werden. Meine Frage wäre hier, ob es Sinn macht so etwas in das DE Profil aufzunehmen, oder ob das ein zu spezieller Anwendungsfall ist?</p>",
        "id": 153898963,
        "sender_full_name": "Markus Ast",
        "timestamp": 1501223902
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"194197\">@Markus Ast</span>! Interessante Frage.<br>\nMit Schedule haben wir uns bei den deutschen Basisprofilen bisher noch nicht befasst. Ich lasse also einfach mal meinen Gedanken freien Lauf.<br>\nGrundsätzlich denke ich, die Unterscheidung PKV vs. GKV ist bei der Terminvergabe ein sehr entscheidendes Kriterium, also meines Erachtens durchaus wert, in den Basisprofilen berücksichtigt zu werden.<br>\nSchedule selbst kennt derzeit tatsächlich keine Klassifizierung in dieser Richtung. Grundsätzlich ist ja die Idee in Schedule, die Information, was scheduled wird, in Actor zu referenzieren.<br>\nEine Option ist also, einen actor(HealthcareService) zu haben, der wiederum über einen Code in eligibility (also z.B. PKV|GKV) den Versicherungstyp einschränkt.<br>\nDas würde ggf. implizieren, dass \"Versorgung von Privatpatienten mit Leistung X\" und \"Versorgung von Kassenpatienten mit Leistung X\" getrennte HealthcareService-Ressourcen sind.<br>\nZusatz-Argument dafür: auch die unter \"Scope and Usage\" genannten Beispiele für HealthcareService ( <a href=\"https://www.hl7.org/fhir/healthcareservice.html#scope\" target=\"_blank\" title=\"https://www.hl7.org/fhir/healthcareservice.html#scope\">https://www.hl7.org/fhir/healthcareservice.html#scope</a> ), z.B. Verzeichnisse sprechen dafür, diese Information im HealthcareService unterzubringen. Es nutzt ja z.B. dem Kassenpatienten wenig, wenn ihm bei der Suche nach einem Neurologen auch Ergebnisse geliefert werden, die er versicherungsbedingt gar nicht nutzen kann.<br>\nDas mal als ersten Aufschlag,.</p>",
        "id": 153898973,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501226906
    },
    {
        "content": "<p>HealthcareService.availableTime spielt ja ebenfalls hier mit rein (\"nachmittags nur Privatpatienten\")</p>",
        "id": 153898975,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501227044
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span>, vielen Dank für die ausführliche Antwort! Ich habe tatsächlich in einem ersten Prototypen die Unterscheidung über eine HealthcareService Resource vorgenommen, wobei mir bisher nicht bewusst war, das HealthcareService eventuell sogar das korrekte Vorgehen sein könnte. Wobei ich es in dem Fall noch nicht über eligibility gelöst habe, was jedoch nach einem guten Ansatz klingt. Ich werde mir die HealthcareService resource mal noch etwas genauer anschauen, danke schonmal für den Hinweis!</p>",
        "id": 153898977,
        "sender_full_name": "Markus Ast",
        "timestamp": 1501227260
    },
    {
        "content": "<p>Falls es passt (und vorbehaltich anderer Kommentare) wäre es sicher nicht verkehrt, das in die Basisprofile aufzunehmen. Der Zeitpunkt ist jedenfalls gerade günstig dafür ;-)</p>",
        "id": 153898978,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501227623
    },
    {
        "content": "<p>Insbesondere ist ein \"it works for me\" natürlich genau das, was wir auch für den normativen Status von Profilen brauchen. Ein Basisprofil, das sich aus einer konkreten Implementierung entwickelt, ist quasi der FHIR-idealfall.</p>",
        "id": 153898980,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501227935
    },
    {
        "content": "<p>Ich vermute, dass dies auch für BG als Versicherungsart relevant ist, daher wäre das ValueSet für eligibility vermutlich identisch mit dem, welches wir ohnehin für CoverageType benötigen. FHIR hat hierfür ein 'preferred' Binding an <a href=\"http://build.fhir.org/valueset-coverage-type.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-coverage-type.html\">http://build.fhir.org/valueset-coverage-type.html</a></p>\n<p>Wollen wir uns dieses ValueSet zurechtbasteln, oder sind wir dreist und nehmen ein eigenes? Ich halte in diesem Punkt die Interoperabilität über Staatsgrenzen hinweg für zweitrangig, daher tendiere ich zu letzterem...<br>\nHöchstens den SELFPAY-Code würde ich zur Adoption in Betracht ziehen, da dieser am ehesten bei ausländischen Patienten zum Tragen kommt.</p>",
        "id": 153898987,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1501231967
    },
    {
        "content": "<p>...ich hatte dazu schon mal vorgeschlagen:</p>\n<p>PAY = Selbstzahler<br>\nEHCPOL = private Zusatzversicherung<br>\nMANDPOL = gesetzl. Versicherung?<br>\nSOCIAL = Sozialamt?<br>\nWCBPOL = BG?</p>\n<p>das wäre der Fall, dass wir uns die Rosinen aus dem vorhandenen ValueSet herauspicken.<br>\nDie Alternative wäre ein eigenes Set aus den handelsüblichen Codes GKV, PKV, BG...</p>",
        "id": 153899012,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1501235720
    },
    {
        "content": "<p>Ich tendiere auch zum eigenen ValueSet und CodeSystem. Die Werte aus coverageType sind eher \"haarscharf daneben\".<br>\nFalls für eligibility nur ein Subset gebraucht wird, kann man ja immer noch ein separates ValueSet aus Teilen dieses CodeSystems ziehen</p>",
        "id": 153899020,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501236116
    },
    {
        "content": "<p>Da gibt es noch nix, oder? V2? V3?</p>",
        "id": 153899268,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1501257821
    },
    {
        "content": "<p>Hat irgendwer das DOC von Frank &amp; Marek bzgl der Versicherungsarten parat. Ich hab's verbummelt!</p>",
        "id": 153899279,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1501260322
    },
    {
        "content": "<p>Nee, hab's: <a href=\"https://drive.google.com/file/d/0B_Prx4RHDXzWZXFXSzFWWEo5TEU/view?usp=sharing\" target=\"_blank\" title=\"https://drive.google.com/file/d/0B_Prx4RHDXzWZXFXSzFWWEo5TEU/view?usp=sharing\">https://drive.google.com/file/d/0B_Prx4RHDXzWZXFXSzFWWEo5TEU/view?usp=sharing</a></p>",
        "id": 153899282,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1501260510
    },
    {
        "content": "<p>darin haben wie SEL, PKV, GKV...<br>\nIn V2 hatten wir PKV, GKV, BG: <a href=\"http://wiki.hl7.de/index.php?title=Segment_IN1#Tabelle_0072:_Insurance_Plan_ID\" target=\"_blank\" title=\"http://wiki.hl7.de/index.php?title=Segment_IN1#Tabelle_0072:_Insurance_Plan_ID\">http://wiki.hl7.de/index.php?title=Segment_IN1#Tabelle_0072:_Insurance_Plan_ID</a></p>",
        "id": 153899283,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1501260766
    },
    {
        "content": "<p>Ich hab das CodeSystem und ValueSet erstellt und hochgeladen, aber der Simplifier-WebHook merkt heute gar nix.</p>",
        "id": 153899286,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1501264791
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194197\">@Markus Ast</span> Zur Info: es gibt im Moment ein paar technische Probleme beim Upload der Basisprofile auf Simplifier. Im Zweifel kann man auch auf GitHub schauen, dort sind immer die aktuellen Draft-Fassungen: <a href=\"https://github.com/hl7germany/basisprofil-de\" target=\"_blank\" title=\"https://github.com/hl7germany/basisprofil-de\">https://github.com/hl7germany/basisprofil-de</a></p>",
        "id": 153899441,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501318391
    },
    {
        "content": "<p>(Falls es eilt - ich hoffe, dass Furore das Problem schnell lösen kann)</p>",
        "id": 153899442,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501318419
    },
    {
        "content": "<p>Wow, ihr seid aber fix! Ich werde im Laufe der nächsten Woche meine Prototypen mal anpassen, dafür reicht mit auch Github (ist mir tatsächlich sogar lieber <img alt=\"👍\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/unicode/1f44d.png\" title=\"👍\">). Danke, dass ihr euch dem Use Case so schnell angenommen habt, hätte eine solche Resonanz gar nicht erwartet, aber das bestärkt mich nur darin, dass auch in DE genügend Leute hinter FHIR stehen, sodass es sich lohnt darauf aufzubauen.</p>",
        "id": 153899443,
        "sender_full_name": "Markus Ast",
        "timestamp": 1501319043
    },
    {
        "content": "<p>Es geht nicht immer ganz so schnell wie im Moment, aber wir schauen schon, dass die Anforderungen aus der Praxis sich in den Basisprofilen niederschlagen ;-)<br>\nWenn der Prototyp steht und passt, würde ich das wie gesagt gern in ein Basisprofil-Draft überführen, falls dem nichts entgegen steht.</p>",
        "id": 153899444,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501319427
    },
    {
        "content": "<p>Ich habe den Prototypen eigentlich schon länger angepasst, hatte jedoch noch keine Rückmeldung gegeben, weil es noch einen Punkt gibt, der mir noch nicht ganz gefällt. Die Actor Liste im Schedule gibt mir genügend Informationen um ein Formular zur Filterung zu befüllen (ID und Name reicht mir dazu), bis auf der Actor HealthcareService, welche als Reference die Eligibility noch nicht beinhaltet. D.h. ich müsste hier entweder einen weiteren Request machen um alle referenzierten HealthcareServices abzurufen oder als Contained Resource hinzufügen. Ersteres würde ich, wenn möglich, gern vermeiden und mit letzterem habe ich mich jetzt noch nicht genauer beschäftigt. Da ich für ein paar Wochen abwesend bin, wollte ich trotzdem schon mal soweit Feedback geben, dass das CodeSystem der Versicherungsart selber für den Use Case an Sich super ist!</p>",
        "id": 153900916,
        "sender_full_name": "Markus Ast",
        "timestamp": 1502201647
    },
    {
        "content": "<p>Top, danke für die Info <img alt=\":thumbs_up:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/unicode/1f44d.png\" title=\":thumbs_up:\"></p>",
        "id": 153900933,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502202264
    }
]