[
    {
        "content": "<p>stream:implementers topic:Using+Coverage+for+Selfpayor<br>\nHier brauche ich Schützenhilfe! <span class=\"user-mention\" data-user-id=\"191532\">@dr Kai U. Heitmann</span> <span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span>  <span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span> </p>",
        "id": 153821818,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460650068
    },
    {
        "content": "<p>Ich schau mal ob ich am WE ein paar Szenarien zusammenschreiben kann.<br>\nWie kam es eigentlich zu der Diskussion? Ich hätte vermutet das Versicherungs- und Selbstzahlverhältnisse ob des primären Anwendungsgebiets von FHIR auf der Prioritätenliste nicht wirklich weit oben stünden</p>",
        "id": 153822080,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460789226
    },
    {
        "content": "<p>Ist richtig so. Aber da die FM-Resourcen jetzt gerade spezifiziert werden, haben wir die einmalige Gelegenheit, unsere UseCases von vorne herein berücksichtigt zu sehen, um uns nicht - wie mit V2 geschehen - hinterher den Standard zurechtbiegen zu müssen. </p>",
        "id": 153822087,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460805228
    },
    {
        "content": "<p>Wenn ich mir die Ressourcen und ihre Verknüpfung so ansehe, denke ich fast bevor wir damit in die internationale Gruppe gehen können müssen wir uns erstmal klar werden, wie die Modelle auf unser System anwendbar sind.</p>\n<p>Wir müssen aufpassen, das wir uns nicht zu sehr von der V2 Denke beeinflussen lassen, da es dort ein paar Fehlentscheidungen bei der Adaptierung gab, die wir tunlichst nicht wiederholen sollten.</p>\n<p>Während der Patient ja noch einigermassen klar identisch zwischen US und DE abgewickelt werden kann, wird es bei allem was die Behandlung angeht schon deutlich komplexer</p>\n<p>Wir haben bis jetzt den Fall fälschlicherweise als Visit abgehandelt, obwohl er je nach Sichtweise entweder die Behandlung einer mehr oder weniger konkreten Erkrankung ist (medizinischer Fall), oder aber wie es in den meisten Fällen durch die monetär fixierung der PDV Systeme bedingt wird, der Abrechnungsfall (was aber kein Fall im eigentlichen Sinne ist, sondern ein Abrechnungskonto)</p>\n<p>Damit kamen wie bei den Episoden dann in die Bedrängnis das Movement Hilfskonstrukt zu generieren das keine entsprechung in HL7 intl hat.</p>\n<p>Bei FHIR sollten wir hier unbedingt auf eine korrektere Umsetzung achten. Bevor wir uns hier aber nicht klar sind, wird es auch schwierig festzulegen wie wir die jeweiligen Kostenträger regeln wollen.</p>",
        "id": 153822135,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460899324
    },
    {
        "content": "<p>Ich hab mal ein fieses Szenario (mit Wechsel zwischen akut und reha) und mehreren Versicherungsverhältnissen in die intl Diskussion geworfen</p>",
        "id": 153822145,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460908582
    },
    {
        "content": "<p><img alt=\":thumbsup:\" class=\"emoji\" src=\"static/third/gemoji/images/emoji/thumbsup.png\" title=\":thumbsup:\"> Lloyds Vorschlag der verschiedenen Accounts des Patienten könnte dies doch abbilden oder?</p>",
        "id": 153822146,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1460908715
    },
    {
        "content": "<p>pro Bezahlkontext gibt es einen Account, im Laufe der Bhdl. wechselt dann einfach der Account, oder habe ich da einen Denkfehler?</p>",
        "id": 153822147,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1460908773
    },
    {
        "content": "<p>Vermutlich nur zum Teil,<br>\ndas was wir so gerne im Krankenhaus als Fall bezeichnen ist ja eigentlich ein Account,<br>\ngrade bei dem Hin- und Her zwischen Reha und Akut wird das recht deutlich, wo es zwar auch einen medizinischen Fall gibt, der aber momentan ob der fiskalzentrierten  PDV Systeme gar nicht abgebildet wird. Daher hat so eine Behandlung obwohl es in Realitas nur ein medizinischer Fall ist unter Umständen tägliche eine neue Fallnummer.</p>\n<p>Zur Zeit ist mir noch nicht wirklich klar, wie man vernünftig die Relationen Patient - Episode od Care - Encounter -Account und Guarantor/Coverage modelliert.</p>",
        "id": 153822148,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460909203
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  na da hast Du ja was losgetreten</p>",
        "id": 153822282,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460969829
    },
    {
        "content": "<p>ok, vorläufiges Ergebnis des WGMs: das Coverage.type ValueSet bekommt einen Code für Selbstzahler, der Issuer wird umbenannt in Payor und kann sowohl auf eine Organisation als auch eine Person verweisen. Damit sehe ich unseren Selbstzahler-UseCase mit der Coverage-Resource gut abgedeckt.</p>",
        "id": 153827412,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1463076052
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> und <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> : bitte denkt daran, dass diese Erkenntnisse auch in unser Wiki sollten, zB \"Best practice\" <a href=\"http://wiki.hl7.de/index.php?title=Kategorie:Best_practice\" target=\"_blank\" title=\"http://wiki.hl7.de/index.php?title=Kategorie:Best_practice\">http://wiki.hl7.de/index.php?title=Kategorie:Best_practice</a></p>",
        "id": 153844415,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1471591256
    }
]