[
    {
        "content": "<p>Hi,<br>\nich habe gesehen, dass  Mitte Mai sehr viel im SIMPLIFIER repo von Medikationsplan PLUS geändert wurde. So ist zum Biespiel auch nur ein Resource-Beispiel übrig geblieben. Weisst jemand, ob da gerade eine größere Umstrukturierung/Update im Gange ist, und wenn ja, mit welchem Zeithorizont? Ich konnte leider in Köln nich dabei sein, und habe so vielleicht einiges verpasst...</p>",
        "id": 153971067,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1529657656
    },
    {
        "content": "<p>Hallo Morten,<br>\nja, wir haben mitte Mai am Aufbau des Testservers für den Medikationsplanplus gearbeitet und dabei noch einige kleinere Fehler an den Profilen festgestellt und behoben. Beispiele findest du reichlich auf <a href=\"http://fhir.hl7.de:8080/\" target=\"_blank\" title=\"http://fhir.hl7.de:8080/\">http://fhir.hl7.de:8080/</a></p>",
        "id": 153971102,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1529674057
    },
    {
        "content": "<p>Es gibt noch ein paar offene Punkte, die kannst du in unserem Issue-Tracker nachlesen: <a href=\"https://github.com/hl7germany/medikationsplanplusplus/issues\" target=\"_blank\" title=\"https://github.com/hl7germany/medikationsplanplusplus/issues\">https://github.com/hl7germany/medikationsplanplusplus/issues</a><br>\n(oder neue dazutun, wenn du welche findest ;-) )</p>",
        "id": 153971103,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1529674176
    },
    {
        "content": "<p>Hi Simone<br>\nsuper, danke! Ich bin schon am reinschauen :)</p>",
        "id": 153971432,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1529917104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Bonus-Frage - sag Bescheid, wenn ich sie lieber in einem neue Topic unterbringen sollte :) Gibt es auch vorgeschriebene Workflows, die Erstellung und Aktualisierungen für einen Medikationsplan Plus (via HTTP) beschreiben? Inbesonders interessiert mich, wie man am besten einen MedPlan <em>qua</em> FHIR Document aktualisiert, zumal es ja keinen einfachen PUT für Documents gibt. Ich vermute , für Klient-Systeme wäre es am einfachsten,  den neuen Plan als Document Bundle zu POSTen, dann hätte man aber mehrere parallele Pläne pro Patient im System (oder man müsste extra die alten Pläne entfernen/invalidieren). Anderseits, wenn man nur die Composition aktualisieren würde und ggf. neue Resources einzeln hinzufügen, müssten Klient-Systeme immer einen \"Diff\" machen , die Richtige referenzen für ggf. schon bestehende Medication/MedicationStatement raussuchen usw., und man hätte nicht die \"einfache Integrität\" eines Document-Bundles. Oder übersehe ich da schönere Alternativen?</p>",
        "id": 153971526,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1529927514
    },
    {
        "content": "<p>spannende Frage welche wir auch in Köln während des Connectathons diskutiert hatten.</p>",
        "id": 153972064,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1530101393
    },
    {
        "content": "<p>qua document aktualisieren ist noch der einfache Fall, hier würde ich das Dokument immer per PUT ersetzen. Der Endpunkt für DocumentBundles ist {base}/Bundle</p>",
        "id": 153972065,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1530101667
    },
    {
        "content": "<p>Was wir für Köln in HAPI ergänzt hatten war die $document operation. Hier hat man alle resourcen einzeln auf dem Server (was den Vorteil der deutlich besseren durchsuchbarkeit hat).  Sobald man dann ein document Bundle benötigt word dieses anhand der COMPOSITION resource erstellt</p>",
        "id": 153972066,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1530102012
    },
    {
        "content": "<p>Hier ist ein Update dann ein Update der \"beteiligten\" resourcen</p>",
        "id": 153972067,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1530102056
    },
    {
        "content": "<p>Angenommen man hat aber resourcen einzeln auf einem Server, und möchte diese mit einem document bundle aktualisieren wird es kompliziert.</p>",
        "id": 153972068,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1530102093
    },
    {
        "content": "<p>Man könnte aus dem Document Bundle eine Transaction Bundle machen und hier jeweils einzelUpdates generieren.</p>",
        "id": 153972069,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1530102167
    },
    {
        "content": "<p>Hi Patrick, </p>\n<p>danke, dann ist es vielleicht einfacher, als ich dachte! Ich hatte von der Doku zu FHIR Documents den Eindruck gekriegt, dass ein ganzes Document Bundle nicht einfach aktualisiert werden darf, da steht ja z.B. (v3.0.1.):</p>\n<blockquote>\n<p>Once assembled into a bundle, the document is immutable - its content can never be changed, and the document id can never be reused. (...) Any additional documents derived from the same composition SHALL have a different document id.</p>\n</blockquote>\n<p>Heisst dass denn nur, dass ein Document Bundle durch einen PUT auf <code>[base]/Bundle</code> aktualisieren darf, solange man den Bundle Identifier auch ändert (ich nehme an, dass das die \"document id\" vom Zitat oben ist)?</p>",
        "id": 153972380,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1530193022
    },
    {
        "content": "<p>Ich denke, das entscheidende ist der wegglassene Satz im Zitat: \"However, the directly referenced content within the document and the presentation of the document cannot change substantially (such that it changes the clinical meaning of the content)\"<br>\nDas ist vor allem eine fachlich-inhaltliche Aussage. Erlaubt im Umkehrschluss durchaus ein update (mit nicht-substanziellen Changes), und das wird wie überall anders auch als PUT [base]/Bundle/[id] ausgeführt.<br>\nInfos dazu hat Abschnitt 2.23.4 in <a href=\"https://www.hl7.org/fhir/documents.html#bundle\" target=\"_blank\" title=\"https://www.hl7.org/fhir/documents.html#bundle\">https://www.hl7.org/fhir/documents.html#bundle</a> : \"This works like a normal end-point for managing a type of resource, but it works with whole document bundles - i.e. a read operation returns a bundle, an update gets a bundle and a search returns a bundle of bundles. Note that if documents are POSTed using a create interaction the <a href=\"http://Bundle.id\" target=\"_blank\" title=\"http://Bundle.id\">Bundle.id</a> will change, but the Bundle.identifier will not\"</p>\n<p>Die genannte \"document id\" hat nichts mit Bundle.identifier zu tun - \"id\" ist immer der systeminterne Identifikator. \"identifier\" ist ein Business Identifier. Der würde beim PUT natürlich den Wert erhalten (oder behalten), der im gePUTteten Bundle steht.<br>\nWürde man das geänderte Bundle POSTen, ohne den identifier zu ändern, hat man hinterher zwei Bundle-Ressourcen mit unterschiedlicher id, aber identischem identifier. Und zwar unabhängig davon, ob im gePOSTeteten Bundle ein id-Element enthalten ist, die wird beim POST verworfen.</p>",
        "id": 153972410,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1530201804
    },
    {
        "content": "<p>Inwiefern das \"SHALL have a different document id\" technisch erzwingbar ist, sei mal dahin gestellt.<br>\nZumindest müsste der Server dann bei einem PUT wissen, welche Änderungen substanziell sind und welche nicht. Das ist zumindest anspruchsvoll.</p>",
        "id": 153972411,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1530202109
    },
    {
        "content": "<p>Hi Stefan,<br>\ndanke, dass klärt einiges auf! Für einen Medikationsplan würde ich eigentlich davon ausgehen, dass die meisten Änderungen substanziell sein werden (oder mindestens, dass man sicherheitshalber diese Annahme machen muss) - er kann ja vom Arzt komplett umgekrempelt werden. Das hiese dann, wenn ich das richtig verstehe, dass man eigenlicht immer Bundle POST machen muss (ggf. mit den gleichen Identifier), obwohl es - konzeptuell gesehen - immer noch der gleiche Medikationsplan ist. Ich glaube, es ist eben dieser Kontrast, was mich etwas verwirrt hat: Ein MedPLan kann beliebig geändert werden und doch \"sich selbst\" bleiben, ein Document eher nicht.</p>",
        "id": 153972512,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1530270863
    },
    {
        "content": "<p>Ob es nach einer substanziellen Änderung noch \"der selbe\" ist, kann man glaube ich ausgiebig diskutieren ;-)<br>\nAuf jeden Fall bildet der Unterschied zwischen id und identifier das ganz gut ab.</p>",
        "id": 153972524,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1530276204
    },
    {
        "content": "<p>War so mein Bauchgefühl (und aus meinem Kontext gesehen), die existentielle Fragen sind nie einfach :) Aber mit der Interpretation, dass die Identität vom MedPlan am Identifier hängt, kann ich auch gut leben.</p>",
        "id": 153972527,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1530276791
    },
    {
        "content": "<p>Beim persönlichen papier-gebundenen Medikationsplan wird ja pro Änderung neu ausgedruckt und der alte verworfen. <br>\nIch denke auch man muss hier grundlegend Unterscheiden zwischen Dokument und Informationen. Wenn ich einen FHIR Server habe der immer den aktuellen Zustand meiner Patienten wiederspiegelt würde ich den Identifier nicht ändern, und immer Updaten (Identifier hier ggfs. = PatID).<br>\nDa ein Dokument ein Zustand zu einem Zeitpunkt beschreibt würde ich hier immer neue Pläne POSTen. (Wobei man auch argumentieren könnte PUT zu nehmen, da per history alle Zeitpunkte verfügbar wären). Wie Stefan schon schrub, darüber kann man prima länglich diskutieren.</p>",
        "id": 153972599,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1530286617
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153972711,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1530457427
    },
    {
        "content": "<p>Zur Migration \"Medikationsplan PLUS\" hin zu tatsächlich FHIR-gerechter Medikations-Dokumention und -Versorgung wird es in Kürze ein Whitepaper geben, welches in Vorbereitung ist und  die verschiedenen Aspekte beleuchtet..</p>",
        "id": 153972721,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1530480318
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> Guter Punkt (Dokument vs Info), damit kann man das etwas klarer beschreiben. Ich tenderiere jetzt auch zu POSTen.</p>\n<p><span class=\"user-mention\" data-user-id=\"191532\">@dr Kai U. Heitmann</span> Spannend, da freue ich mich drauf! Wo wird es erscheinen?</p>",
        "id": 153972836,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1530534738
    }
]