[
    {
        "content": "<p>Hallo an alle, ich kündige schon mal zwei Themen meinerseits für das nächste TC FHIR Meeting an: </p>\n<ol>\n<li><strong>EKG-Profil:</strong> Den Wunsch nach einem EKG Profil haben wir mittlerweile an verschiedenen Ecken und Enden vernommen und ich habe mit <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> zusammen einen Draft gebastelt. Falls euch das Thema interessiert, schaut gerne im Voraus rein und hinterlasst Feedback falls Ihr etwas Unstimmiges findet: <a href=\"https://github.com/hl7germany/basisprofil-de-r4/pull/340/files\">https://github.com/hl7germany/basisprofil-de-r4/pull/340/files</a></li>\n<li><strong>Signaldaten:</strong> Im Rahmen der Vitalparameter wurden Wünsche bezüglich einer Standardisierung von Signaldaten geäußert. Mein Vorschlag wäre es, hier eventuell aus dem Basisprofil IG auf <a href=\"http://build.fhir.org/ig/HL7/uv-pocd/index.html\">http://build.fhir.org/ig/HL7/uv-pocd/index.html</a> zu verweisen. Das Projekt ist anscheinend aktuell, kommt aber nur langsam voran. Was haltet Ihr davon?</li>\n</ol>",
        "id": 254712110,
        "sender_full_name": "Yannick Börner",
        "timestamp": 1632493311
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"307158\">@Björn Andersen</span> - Kommentar dazu?</p>",
        "id": 254715595,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1632494646
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192966\">@Stefan Karl</span> kümmert sich um den IG und <span class=\"user-mention\" data-user-id=\"224056\">@Kathrin Riech</span> hat das Mapping von SDC zu FHIR beigesteuert. Gedacht ist das Projekt für alle Daten von patientennahen Medizingeräten und ist auch entsprechend flexibel konzipiert. Real Time Sample Arrays und Distribution Sample Arrays für Signaldaten sind berücksichtigt. Bzgl. des Fortschritts weiß ich aus zuverlässiger Quelle, dass Mitarbeit herzlich willkommen ist! <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 254719914,
        "sender_full_name": "Björn Andersen",
        "timestamp": 1632496281
    }
]