[
    {
        "content": "<p>Das nächste Interop-Forum naht und es stellt sich die Fragem wie und wofür wir die uns zur Verfügungstehende Zeit am 16.3. nachmittags für die Arbeit an den deutschen Profilen nutzen wollen.<br>\nHat jemand Themenvorschläge, konkrete Fragen, Probleme?</p>",
        "id": 153875006,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1488813093
    },
    {
        "content": "<p>Ein Punkt wäre ja noch Claim, je nachdem, wie die Dinge dort zur Zeit stehen.<br>\nAnsonsten neige ich dazu, wenn nichts anderes anliegt, einfach mal mit strammem Blick auf STU3 die absoluten Basics komplett durchzudeklinieren, beginnend z.B. mit Patient, Organization, Practitioner - auch wenn (oder weil?)  da wahrscheinlich nichts großartiges mehr kommt.</p>",
        "id": 153875013,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1488813882
    },
    {
        "content": "<p>Auf jeden Fall möchte ich den halben Tag unbedingt produktiv nutzen</p>",
        "id": 153875014,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1488813943
    },
    {
        "content": "<p>+1</p>",
        "id": 153875015,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1488813943
    },
    {
        "content": "<p>Macht es ggf Sinn uns mal an den Deutschen V2-Profilen (gemeinsame Elemente) entlang zu hangeln und zu schauen, was wir davon (wieder)verwenden können?</p>",
        "id": 153875019,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1488814214
    },
    {
        "content": "<p>Bin mir nicht sicher ob dies nicht das Pferd vom falschen Ende her aufzäumt.</p>\n<p>Wir hatten doch im Dezember eine relativ lange Diskussion zu Abrechnung auf der einen und den verschiedenen Episoden/Fällen etc <br>\nsollten wir hier nicht noch einmal anknüpfen ?</p>",
        "id": 153875026,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1488814410
    },
    {
        "content": "<p>Was Claim angeht, war/ist glaube ich das Problem, dass da so viele Use Cases in den Köpfen rumschwirren. Damit können wir uns gern auch beschäftigen, wenn dabei Output in Form einer/mehrerer  textuellen Use Case-Beschreibung(en) rauskommt.<br>\nDas wäre für mich allerdings auch etwas, das man (womöglich vorher) in der großen Runde zumindest anreißt, um mehr Input zu bekommen. Die Use Cases sind ja nicht originär FHIR-spezifisch.</p>",
        "id": 153875058,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1488824766
    },
    {
        "content": "<p>Sollten wir das evtl. für 16.3. vormittags als kurzen TOP in die Agenda einbringen?</p>",
        "id": 153875060,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1488824820
    },
    {
        "content": "<p>Die Umsetzung der deutschen Bedürfnisse in FHIR-Profile ist da im Vergleich halt zum jetzigen Zeitpunkt dichter an reinem FHIR-Thema dran.<br>\nAls Grundlage die v2-Profile zu nehmen (und auch mal in CDA / ART-DECOR zu schauen), ist sicher nicht verkehrt, wir dürfen nur nicht den Fehler machen, die Schwächen nach FHIR zu portieren ;-)</p>",
        "id": 153875061,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1488825220
    },
    {
        "content": "<p>Also, was ich vom letzten WGM mitgenommen habe ist, dass der CLAIM ganz klar eine an den KOSTENTRÄGER gerichtete Forderung darstellt. Da die KV aber halt so ihre ganz eigene Vorstellung davon hat, wie eine Abrechnung auszusehen hat, frage ich mich wirklich, ob wir dieses Fass aufmachen wollen. (Es sei denn es gibt dafür einen konkreten UseCase oder ein Projekt).</p>",
        "id": 153875065,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1488827220
    },
    {
        "content": "<p>Die Thematik Encounter vs. Account vs. Episode of Care wäre schon interessant. Darin sollte auch zu einem möglichst frühen Zeitpunkt einvernehmliches Verständnis unter den Implementierern herrschen.<br>\nIch glaube, wir sollten das mal zu einem Best-Practice-Ansatz fürs Wiki aufbereiten.</p>",
        "id": 153875071,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1488827679
    },
    {
        "content": "<p>Vor allem wäre das etwas, was man völlig unabhängig von DSTU2/STU3 diskutieren und darstellen kann. Die Abstraktionebene ist auch hoch genug, ob die Diskussion führen zu können, ohne Sie an einem konkreten USeCase festmachen zu müssen.</p>",
        "id": 153875072,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1488827763
    },
    {
        "content": "<p>Die v2 Profile finde ich eben den völlig falschen Ansatz, sie spiegeln extrem den nachrichtenzentrischen Ansatz von V2 wieder und sind für den objekt zentrierten Ansatz von FHIR eben nicht wirklich sinnvoll. </p>\n<p>Mein Vorschlag wäre da, das wir uns einmal wirklich mit den Fragen nach Fall (abrechnung, medizinisch), Besuchen, Episoden und dem momentan noch etwas nebulösen Episode of Care widmen. Hier fände ich es sinnvoll wenn wir uns einmal zu grundlegenden Definitionen und dann auch Profilierungen der zu Grunde liegenden Resourcen Gedanken machen. Fehler oder Unterlassungen an dieser Stelle fallen uns sonst nämlich zukünftig immer wieder vor die Füsse.</p>",
        "id": 153875716,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489047080
    },
    {
        "content": "<p>Da stimme ich Dir insofern zu, als es sicher grundfalsch wäre, einfach v2-Profile 1:1 in FHIR-Resourcen umzusetzen.<br>\nAllerdings geben die v2-Profile ziemlich klare Hinweise, welche Informationen strukturiert übermittelt werden und überhaupt auch zuallererst strukturiert in Real-Life-Systemen vorliegen.<br>\nDie Aufgabe an diesem Punkt ist sicher, das ganze vom Nachrichten- auf den Objekt-Ansatz zu transferieren. Und das geht natürlich nur, wenn ich den Workflow hinter der Nachricht kenne, letztlich den Use Case.<br>\nUnd an dem Punkt stimme ich Dir auch wieder zu: wenn nicht mal die Begriffe klar sind, sollten wir die in der Tat mal definieren ;-) Das ist allerdings grundsätzlich etwas, das nicht wirklich FHIR-spezifisch ist.</p>",
        "id": 153875732,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489056428
    },
    {
        "content": "<p>Insofern wäre also unsere Agenda (Vorschlag):<br>\n- Begriffsdefinitionen Fall/Besuch/Episode (of Care)/ ...., evtl. gleich als Best Practice-Punkt ins Wiki<br>\n- Profilierung derselben incl. zugehöriger Daten (Patient, Kostenträger, ...) auf Grundlage der einzelnen in v2 übermittelten Daten, angereichert um Hintergrundwissen</p>",
        "id": 153875733,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489056674
    },
    {
        "content": "<p>Tendenziell nicht an einem Nachmittag zu schaffen, aber dort dann einfach mal starten?</p>",
        "id": 153875734,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489056699
    },
    {
        "content": "<p>Nein, V2 ist nun mal ein Nachrichtenparadigma Profilierung erfolgt dort ausschliesslich auf Basis von einzelnen Events im Kontext eines Use Cases. Und das auch noch monofokal auf den klinischen Bereich. Das ist sowas von unpassend für das Resourcenparadigma von FHIR, das geht fast nicht mehr schlimmer.</p>\n<p>Begriffsdefinitionen ist auf jeden Fall passend (aber leider nicht so wie Du sie oben hast<br>\nEpisode ist was völlig anderes als Episode of Care. Von daher wäre es auf jeden Fall einmal notwendig zunächst die Begrifflichkeiten zu bearbeiten und zu klären auf welche Resourcen das jeweils mapped.</p>\n<p>Wenn wir das an einem Nachmittag schaffen dann sind wir schon sehr gut.</p>",
        "id": 153875737,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489057062
    },
    {
        "content": "<p>Die Unterschiede sind mir durchaus bewußt ;-)<br>\nWas ich schlicht meinte (Beispiel): irgendwo in den deutschen v2-Profilen steht, dass es eine LANR gibt, was sie bedeutet und wie die zu übermitteln sind.<br>\nDaraus kann man für die deutschen FHIR-Profile übernehmen: es gibt eine LANR, sie bedeutet (xyz). In welches FHIR-Profil wir das packen und den Kontext drumrum, aus dem das letztlich hervorgeht, können wir aus den v2-Profilen nicht ableiten. So weit d'accord?</p>",
        "id": 153875739,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489057770
    },
    {
        "content": "<p>Und der Kontext sind eben: Begriffe, Use Cases, Workflows</p>",
        "id": 153875740,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489057810
    },
    {
        "content": "<p>Vorschlag: wir denken uns mal einen komplexen medizinischen Krankheitsverlauf aus und machen daran exemplarisch die Begriffe fest.</p>",
        "id": 153875742,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489057937
    },
    {
        "content": "<p>Anhand eines Beispiels lässt sich immer besser diskutieren, finde ich. Also z.B. sowas wie hier:<br>\n<a href=\"http://wiki.hl7.de/index.php?title=IG:%C3%9Cbermittlung_onkologischer_Daten#Beispielf.C3.A4lle_zum_Ablauf_von_Diagnostik_und_Therapie\" target=\"_blank\" title=\"http://wiki.hl7.de/index.php?title=IG:%C3%9Cbermittlung_onkologischer_Daten#Beispielf.C3.A4lle_zum_Ablauf_von_Diagnostik_und_Therapie\">http://wiki.hl7.de/index.php?title=IG:%C3%9Cbermittlung_onkologischer_Daten#Beispielf.C3.A4lle_zum_Ablauf_von_Diagnostik_und_Therapie</a><br>\nWenn man daraus nur mal den administrativen Anteil diskutiert und auf Begriffe und Resourcen zuordnet und die ganzen medizinischen Inhalte vorerst mal ignoriert, wäre das IMHO ein Ansatz.</p>",
        "id": 153875743,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489058135
    },
    {
        "content": "<p>Ich denke, gerade beim Beispiel aus der Onkologie kann man ziemlich gut die Unterschiede der Begriffe herausarbeiten, weil da wirklich alles drin steckt und die Behandlung über Jahre gehen kann</p>",
        "id": 153875745,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489058267
    },
    {
        "content": "<p>Das Beispiel könnte ich vorab schon mal für unsere Zielrichtung anpassen und z.B. ins Google Drive stellen, wenn Ihr da grundsätzlich zustimmt</p>",
        "id": 153875746,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489058436
    },
    {
        "content": "<p>+1 für den Story driven Ansatz die Begrifflichkeiten zu klären</p>",
        "id": 153875760,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1489071560
    },
    {
        "content": "<p>Da es aktuell gerade angestoßen wurde, sollten wir uns auch nochmal mit verlinkten Diagnosen befassen respektive mit den Extensions, die hier benötigt werden.</p>",
        "id": 153876158,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489397736
    },
    {
        "content": "<p>Und da ich gerade ein bisschen in die Best Practice-Seiten schaue: für die Global Location Number fehlt noch der FHIR-Part</p>",
        "id": 153876162,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489403772
    },
    {
        "content": "<p>Für die GLN fehlt noch vor allem die Anwendung ;)</p>",
        "id": 153876165,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489405033
    },
    {
        "content": "<p>Zumindest gibt's schon eine (nicht reviewte) Beschreibung für v2 ;)</p>",
        "id": 153876166,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489405304
    },
    {
        "content": "<p>Ja da ist vemutlich Frank mal wieder einfach vorgeprescht. Und übernimmt auch noch ungrprüft Fehler aus dem Wikipedia Eintrag.</p>\n<p>Nur weil jemand von der AGFA ohne weitere Nutzbeschreibung in die Runde gequakt hat das man das brauche <br>\nEs ist meines Erachtens ausgemachter Blödsinn eine Glocal Location Number zur Identifizierung einer Person zu nutzen. Sie kann den Sitz einer Arztpraxis beschreiben aber  niemals den Arzt. </p>\n<p>Wenn ich den V2 Teil lese stellen sich mir die Nackenhaare auf.<br>\nDa findet man so tolle sätze wie:<br>\n\"Generell müssen alle Ärzte, Spitäler, Krankenversicherungen/Garanten eine GLN (alt EAN) als Identifikator haben\"</p>\n<p>Erstens wo steht das, vor allem seit wann hatte ein arzt eine EAN (und wo finde ich den Barcode an ihm :D )</p>",
        "id": 153876177,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489409987
    },
    {
        "content": "<p>Na dann priorisieren wir das mal runter ;-)<br>\nArzt würde ich mal mit \"Arztpraxis\" übersetzen ...</p>",
        "id": 153876183,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489410686
    },
    {
        "content": "<p>das trifft es eher, die GLN beschreibt ganz allgemein ja eine Location das kann ein Firmensitz sein, aber wie die GS.1 Definition schon zeigt auch nur der Sitz einer Abteilung.</p>\n<p><a href=\"http://www.gs1.org/docs/healthcare/GLN_Healthcare_Imp_Guide.pdf\" target=\"_blank\" title=\"http://www.gs1.org/docs/healthcare/GLN_Healthcare_Imp_Guide.pdf\">http://www.gs1.org/docs/healthcare/GLN_Healthcare_Imp_Guide.pdf</a></p>\n<p>Ist aber so dringend wie sonstwas. Eventuell können unsere Schweizer Kollegen da was zu beisteuern, da scheinen alle Praxen schon eine GLN zu haben. Die findet sich bei dem von Frank verlinkten Suchdokument auch bei der Anschrift</p>",
        "id": 153876184,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489410856
    },
    {
        "content": "<p>Ja, das scheint insgesamt aus der Schweiz angestoßen zu sein.</p>",
        "id": 153876185,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489411359
    },
    {
        "content": "<p>Ich bin sowieso irritiert,das eine einzelne AGFA Anfrage schon zu einer best-practice Seite führt, die öffentlich einsehbar ist obwohl noch nicht einmal darüber diskutiert worden wurde</p>",
        "id": 153876187,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489411443
    },
    {
        "content": "<p>Da es mir noch untergegangen war auf Deinen Vorschlag Stefan aus einer Krankheitsverlauf die Begrifflichkeiten zu klären einzugehen:<br>\nIch denke das ist der beste Ansatz.</p>\n<p>Allerdings bin ich mir noch nicht sicher ob wir gleich mit dem komplexen Fall anfangen, oder ob es besser ist mit dem einfachen Fall anzufangen und den im Laufe der Betrachtung immer weiter verkomplizieren. Ich denke da an den spätern Leser eines Artikels, der ansonsten vor dem komplexen Beispiel stehen könnte wie ein Ochs vor dem Berg. Aber das können wir am Donnerstag in Ruhe angehen.</p>\n<p>Wenn wir das Thema an diesem Termin weitestgehen durchbekommemn haben wir was tolles geschafft</p>",
        "id": 153876191,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489415305
    },
    {
        "content": "<p>Ich denke, den komplexen Fall muss man ohnehin im Hinterkopf haben, sonst kann man die Unterschiede nicht herausarbeiten.<br>\nAuf jeden Fall bereite ich mal auf Basis des komplexen Beispiels was vor; sich dann bei Bedarf einzelne Details rauszuholen, ist ja relativ schnell zu machen.</p>",
        "id": 153876197,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489417714
    },
    {
        "content": "<p>Das bedeutet ja nicht, dass man das hinterher (für den Leser) nicht auf einfachere Beispiele aufsplitten kann</p>",
        "id": 153876198,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489417805
    },
    {
        "content": "<p>Ich hab noch ein Meta-Thema: Un dzwar müssten wir uns mal ganz genrell damit auseinandersetzen, wie die Erstellung von Implementation Guides in FHIR / Simplifier von statten geht, Das können wir gerne anhand des Prose-Textes machen, den wir uns zum Thema \"Begriffsdefinitionen von Encounter/EpisodeOfCare\" machen.<br>\nIch glaube die wichtigste Diskussion, die wir führen müssen ist die, wie der Titel unseres ersten Implementation Guides lauten soll.<br>\n\"FHIR im klinisch-administrativen Kontext\" ...oder so?</p>",
        "id": 153876249,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1489433999
    },
    {
        "content": "<p>Autsch....</p>",
        "id": 153876525,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489482005
    },
    {
        "content": "<p>Ich bin für \"oder so\" :D</p>",
        "id": 153876536,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1489483403
    },
    {
        "content": "<p>+1 :D</p>",
        "id": 153876586,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1489498399
    }
]