[
    {
        "content": "<p>Hallo zusammen, </p>\n<p>ich versuche gerade, für den eWundbericht, den wir u.a. später in FHIR gestalten wollen, die Ressourcen zu identifizieren. Insgesamt klappt es (hoffentlich) ganz gut. Ich hänge jedoch bei dem Punkt \"Bisherige Ergebnisse der Behandlung\". Hier soll beschrieben werden, wie sich der Behandlungsplan für die Wunde auf ebendiese ausgewirkt hat. Beispieltext wäre hier: \"Wundstadium hat sich verbessert\", \"Wundfläche gleichgeblieben\" o.ä.. Ist das ein Annotation zu der zugehörigen Wunde bzw. zum Behandlungsplan zur Wunde? Oder gibt es für derartige Veränderungsbeschreibungen eine eigene Ressource? </p>\n<p>Vielen Dank für Eure Hilfe!</p>",
        "id": 161866956,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1553698515
    },
    {
        "content": "<p>Wenn man die einzelnen Informationsteile getrennt und strukturiert erfassen will, sind das im ersten Ansatz jeweils einzelne Observations, ggf. klammerbar z.B. in einem DiagnosticReport. Oder referenzierbar in Goal.outcomeReference. Und das Goal ist dann wiederum referenziert aus dem CarePlan, in dem Du vermutlich den Behandlungsplan abbildest.</p>\n<p>Haben die Informationen eher untergeordnete Bedeutung (im Sinn von \"muss nicht großartig auswertbar sein\"), und werden vielleicht über die Dauer gar nicht persistiert, reicht möglicherweise auch CarePlan.activity.progress aus, um einen Zwischenstand zu dokumentieren.</p>",
        "id": 161875590,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1553703498
    },
    {
        "content": "<p>Genau, aktuell plane ich, die Behandlungsplan als CarePlan  abzubilden. Dieser referenziert auch entsprechend die Goals. Die OutcomeReference im Goal habe ich irgendwie überlesen. Vielen Dank dafür! Ich glaube, ich muss mir noch ein paar tiefergehende Gedanken machen, um die finale Entscheidung zu treffen. <br>\n<span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> Vielen Dank!</p>",
        "id": 161930450,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1553759057
    }
]