[
    {
        "content": "<p>Wer hat bereits Erfahrung mit der TestScript Ressource (<a href=\"http://build.fhir.org/testscript.html\">http://build.fhir.org/testscript.html</a>) und ggf. Touchstone (<a href=\"https://touchstone.aegis.net/touchstone/\">https://touchstone.aegis.net/touchstone/</a>)? Wie habt ihr die TestScript Ressource für euch sinnvoll nutzbar gemacht? Ich freue mich, von euren Erfahrungen zu hören.</p>",
        "id": 202426868,
        "sender_full_name": "Marco Wedekind",
        "timestamp": 1593519574
    },
    {
        "content": "<p>Bei Cerner haben wir uns mit die den Ansatz mit TestScript und Touchstone evaluiert. Im Ergebnis stand vor ca 1 Jahr fest, dass dies sehr spezifisch für Touchstone funktioniert. Wir haben uns dann für einen anderen Ansatz basierend auf einer CI/CD Toolchain entschieden. Die Test wurden dann als Testklassen mit üblichen Frameworks für Jenkins implementiert. Zusätzlich konnte auch noch der FHIR Validator  (<a href=\"http://hl7.org/fhir/validation.html\">http://hl7.org/fhir/validation.html</a>) eingebunden werden.</p>",
        "id": 202434701,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1593523767
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197429\">@Axel Biernat</span> Stellt das dann eine \"komplementäre\" Ergänzung des generischen FHIR-Validators dar? Oder eine Alternative zu einer Spezialisierung des FHIR-Validator für eigene Zwecke?</p>",
        "id": 202656960,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593674154
    },
    {
        "content": "<p>Erinnert mich an die parallel eingesetzten Testmethoden für CDA-Profile: <a href=\"https://gazelle.ihe.net/content/gazelle-objectschecker\">https://gazelle.ihe.net/content/gazelle-objectschecker</a> vs. <a href=\"https://art-decor.org/mediawiki/index.php?title=Schematron-validation\">https://art-decor.org/mediawiki/index.php?title=Schematron-validation</a></p>",
        "id": 202657242,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593674336
    },
    {
        "content": "<p>Validatoren testen nur die Inhalte, Touchstone testet die API.<br>\nMit Touchstone kann man z.B. prüfen, ob ein Server Updates richtig verarbeitet, ob die Suchparameter korrekt implementiert sind usw.<br>\nDie Validierung der zurückgegebenen Inhalte gegen Profile gehört aber natürlich auch dazu...</p>",
        "id": 202663912,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593680008
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197429\">@Axel Biernat</span> Danke für das Teilen deiner/eurer Erfahrung <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> Das bestätigt meinen ersten, oberflächlichen Eindruck, das die TestScript Ressource noch nicht so breit unterstützt wird.</p>",
        "id": 202665420,
        "sender_full_name": "Marco Wedekind",
        "timestamp": 1593681168
    },
    {
        "content": "<p>Meiner Kenntnis nach ist Touchstone aktuell die einzige Implementierung, die TestScript unterstützt. <br>\nMuss aber nicht so bleiben, an sich ist das Konzept schon gut durchdacht, siehe <a href=\"https://www.hl7.org/fhir/testing.html\">https://www.hl7.org/fhir/testing.html</a></p>",
        "id": 202665745,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593681414
    },
    {
        "content": "<p><a href=\"https://inferno.healthit.gov/inferno/\">Inferno</a> testet ebenfalls APIs, scheint aber nicht so generisch angelegt zu sein wie Touchstone.<br>\nHier müssen (soweit ich das sehe) die Szenarien, die getestet werden sollen, tool-spezifisch konfiguriert werden.<br>\nOb IHE mit den Gazelle Tools TestScript unterstützt, weiß ich nicht. Aber es wäre schon prima, wenn man die Szenarien einmal definieren und dann zwischen den verschiedenen Test-Tools interoperabel austauschen könnte. Das ist die Idee hinter der TestScript Ressource.<br>\nVermutlich stehen dem aber wieder die Interessen entgegen, die Nutzer an das jeweilige Tool binden zu wollen :-(</p>",
        "id": 202666085,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593681703
    },
    {
        "content": "<p>Es gibr noch <a href=\"https://projectcrucible.org/\">https://projectcrucible.org/</a>, aber ob das mit  TestScript arbeitet war für mich nicht ersichtlich. Ich glaube, das geht vom ConformanceStatement eines Servers aus und schaut dann, ob das auch erfüllt wird.</p>",
        "id": 202666180,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1593681771
    },
    {
        "content": "<p>Bei IHE Gazelle kann ich aus meinen Projekten nur zu CDA was sagen, nicht zu FHIR.</p>",
        "id": 202666193,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593681783
    },
    {
        "content": "<p>Relevant: <a href=\"#narrow/stream/179309-inferno/topic/Inferno.20vs.20Crucible\">https://chat.fhir.org/#narrow/stream/179309-inferno/topic/Inferno.20vs.20Crucible</a></p>",
        "id": 202666200,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593681785
    },
    {
        "content": "<blockquote>\n<p>So it seems more likely that we will retire Crucible as a standalone test platform, and pull in the most useful pieces into Inferno.</p>\n</blockquote>\n<p><span aria-label=\"exclamation\" class=\"emoji emoji-2757\" role=\"img\" title=\"exclamation\">:exclamation:</span></p>",
        "id": 202666476,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593681979
    },
    {
        "content": "<blockquote>\n<p>Also, Crucible's plan_executor has some support for TestScript execution, though it hasn't been maintained since FHIR STU3. We chose to not use TestScripts in Inferno in part because many of the requirements we needed to test (most notably SMART on FHIR) could not be represented in TestScripts. If there is strong demand from the IG authoring community to author tests in that manner then we could pull in that component from Crucible.</p>\n</blockquote>",
        "id": 202666540,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593682045
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> Genau es ging uns um die automatisierte Testung unter Einbeziehung von verfügbaren Tools.</p>",
        "id": 202667482,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1593682758
    },
    {
        "content": "<p>MWn ist Touchstone hier führend. Die Ressourcen werden auch dadurch vorangetrieben.<br>\nHersteller können hier auf der Basis eigene Tests definieren und dann automatisiert durchführen. Damit lassen sich dann ganze Workflows automatisiert durchtesten.</p>",
        "id": 202668616,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1593683685
    },
    {
        "content": "<p>Inferno (<a href=\"https://inferno.healthit.gov/\">https://inferno.healthit.gov/</a> ) scheint (noch) US-spezifisch zu sein. Man kann einen eigenen, öffentlich verfügbaren FHIR Server gegen auswählbare Testszenarien testen. Auch eigene Testszenarien können entwickelt und der Community vorgeschlagen werden. Damit kann wohl die Kompatiblität zu verbreiteten (US-)Szenarien und Standardisierungsinitiativen wie Argonaut oder den US core Profilen getestet werden.</p>\n<p>Der Touchstone Ansatz scheint eher für meine Zwecke geeignet zu sein. Touchstone bietet sich als TaaS (Testing as a Service) <span aria-label=\"rock on\" class=\"emoji emoji-1f918\" role=\"img\" title=\"rock on\">:rock_on:</span> an. Das minimiert hoffentlich den Setup Aufwand und macht das Testen auch ziemlich ortsunabhängig. Die aktuelle Touchstone Version 5 vom 29.6.2020 (<a href=\"https://touchstone.aegis.net/touchstone/\">https://touchstone.aegis.net/touchstone/</a>) soll es Organisationen möglich machen, eigene Zertifizierungsprogramme aufzulegen. Man soll gegen Touchstone Testserver als auch zwischen verschiedenen FHIR Servern Tests abfahren können usw. Klingt alles sehr vielversprechend.</p>",
        "id": 202686046,
        "sender_full_name": "Marco Wedekind",
        "timestamp": 1593695787
    },
    {
        "content": "<p>Klar, mit der Community-Edition von Inferno ist man auf sich alleine gestellt, kostet dafür aber nix :)<br>\nTouchstone ist eher ein Rundum-Sorglos-Paket, gegen $$$.<br>\nEine Zielgruppe gibt's sicherlich für beides  :)</p>",
        "id": 202687480,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593696370
    }
]