[
    {
        "content": "<p>Ich würde mich gerne auch in das UKF des Medikationsplans einbringen. Gibt es schon fertige Profile für die Ausgangsresourcen? Auf <a href=\"http://wiki.hl7.de/index.php?title=IG:Ultrakurzformat_Patientenbezogener_Medikationsplan\" target=\"_blank\" title=\"http://wiki.hl7.de/index.php?title=IG:Ultrakurzformat_Patientenbezogener_Medikationsplan\">http://wiki.hl7.de/index.php?title=IG:Ultrakurzformat_Patientenbezogener_Medikationsplan</a> wird von Konversionsskripts gesprochen welche aber noch nicht verlinkt sind. <br>\nGibt es schon Kontakt mit der internationalen Community ob das UKF generell verwendet werden soll? Ich würde gerne das Mapping auf das UKF in das Ausgangsprofil mit einbetten, mit Extensions wäre dies aber nur relativ umständlich möglich.</p>",
        "id": 153817610,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1458726395
    },
    {
        "content": "<p>Patrick, hervorragend wenn du dich einbringen willst. Die Konversionskripts sind sicher noch verbesserungswürdig, wir sollten hierzu nach oOOoOo telefonieren. Was meist du mit \"Kontakt zur internationalen Community\"? Das UFK soll sicher nicht generell angewendet werden, wir müssen uns im Klaren sein, dass die Nutzung dieses Formats eher peinlich ist für das ach so digitalisierte Deutschland. Das Mapping folgt meist strikten Regeln, eine \"Einbringung\" in ein Ausgangsprofil ist wünschenswert (und geht nur über Extensions) aber eben auch eine Herausforderung. Hier muss man abwägen, ob das der effizienteste Weg ist.</p>",
        "id": 153817938,
        "sender_full_name": "dr Kai U. Heitmann",
        "timestamp": 1458841037
    },
    {
        "content": "<p>Hier im Zulip gibt es diesen Thread: <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Low.20bandwith.20serialisation\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Low.20bandwith.20serialisation\">https://chat.fhir.org/#narrow/stream/implementers/topic/Low.20bandwith.20serialisation</a></p>",
        "id": 153818121,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1458930443
    },
    {
        "content": "<p>Da hatte Simone das Format des Medikationsplans schon einmal reingeworfen. Low Bandwidth/Low Storage gibt es ja nicht nur auf der eGK</p>",
        "id": 153818122,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1458930545
    },
    {
        "content": "<p>Den einen oder anderen (für mich schon relativ konkreten) Anwendungsfall im Device-Bereich sehe ich auch, insofern würde ich mich da auch gern für einen Kontext über den Medikationsplan hinaus einbringen</p>",
        "id": 153818126,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1458930795
    },
    {
        "content": "<p>Der Standard bringt eigentlich alles mit, was man für unser UKF braucht. Beim erstellen von Profilen kann ich jedem Attribut ein Mapping auf einen anderen Namensraum zuweisen. Alternativ könnte man auch das Feld \"Alias\" verwenden, um den UKF-Attributsnamen im Profil zu definieren. Allerdings müsste das Komprimierungsskript noch mehr tun, z.B.:</p>\n<ul>\n<li>alle Narratives entfernen</li>\n<li>alle Attribute mit \"fixed\" values (ebenfalls im Profil festgelegt) entfernen</li>\n<li>alle nicht verwendeten Felder entfernen (im Profil wäre da die Kardinalität auf 0..0 gesetzt)</li>\n<li>und schließlich: die Attributnamen durch die Aliase ersetzen<br>\nMeines erachtens lassen sich aber alle anzuwendenden Regeln mit den Mechanismen der Standard-Profile ausdrücken. EIne Notwendigkeit für Extensions sehe ich nicht.</li>\n</ul>",
        "id": 153818730,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459244380
    },
    {
        "content": "<p>Etwas komplizierter wäre die Dekomprimierung. Da müssten dann die Feldnamen zurückgemapped, aber auch alle fehlenden Felder mit fixed Values ergänzt werden. Den Narrativ neu zu generieren wäre dann noch das einfachste...</p>",
        "id": 153818733,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459244551
    },
    {
        "content": "<p>Genial wird der Coup dann, wenn wir die (De-)Kompression als online-Dienst über das FHIR Operations Framework anbieten können, z.B. <a href=\"http://offiziellerUKFKompressor.de/Bundle/$compress\" target=\"_blank\" title=\"http://offiziellerUKFKompressor.de/Bundle/$compress\">http://offiziellerUKFKompressor.de/Bundle/$compress</a> </p>",
        "id": 153818735,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459245334
    },
    {
        "content": "<p>Als Parameter wäre dann die URL des Profils anzugeben, das die Regeln definiert, sowie das zu komprimierende Bundle.</p>",
        "id": 153818736,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459245379
    },
    {
        "content": "<p>Ja genau sowas in der Art würde ich gerne bauen</p>",
        "id": 153818737,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1459245385
    },
    {
        "content": "<p>Das Framework wäre dann für beliebige Profile nutzbar</p>",
        "id": 153818738,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459245399
    },
    {
        "content": "<p>Glückwunsch, du hast den Job! :D</p>",
        "id": 153818739,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459245423
    },
    {
        "content": "<p>Ich hatte mit Forge schon mal angefangen Profile zu definieren, hauptsächlich um mich mit dem Slicing vertraut zu machen, das wir für die Sektionen des Dokumentes benötigen. Können wir uns am Freitag ja mal anschauen.</p>",
        "id": 153818740,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459245487
    },
    {
        "content": "<p>Das Nette ist, dass ich für jeden Slice einen anderen Alias angeben kann, so dass beim Komprimieren nicht die Info verloren geht, um was für eine Section es sich handelt. Da die LOINC-Codes, die die Sections identifizieren nämlich fixed values sind, würden diese beim Komprimieren abgeschnitten. Statt dessen kann man aber einfach jedem Slice/jeder Section einfach einen anderen Alias (z.B. s1, s2 usw. zuweisen).</p>",
        "id": 153818741,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459245639
    },
    {
        "content": "<p>ich war am überlegen ob man dazu 2 profile erstellt oder nur eins. Also einmal Profil für das Bundle unkomprimiert + Profile für die Transformation - oder ob man das lieber gleich in 1 Profil packt. Kurz und Langversion. Ich favorisiere aktuell Option2.</p>",
        "id": 153818742,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1459245656
    },
    {
        "content": "<p>Ich denke, dass ein Profil ausreicht. Das müsste dann in dritter Aufgabe auch noch zur Validierung der übermittelten Langformate dienen. Was nicht validiert dürfte dann auch nicht komprimiert werden, da es potentiell ungültige Codes enthält, verbotene Attribute, für die es keine Entsprechung im UKF gibt oder zusätzliche Informationen, die beim komprimieren verloren gehen würden. Kurz gesagt, das Profil wäre hier der Dreh- und Angelpunkt des Ganzen. Ich würde vorschlagen, das von Kai definierte Dokument nochmals extrem zu verschlanken (z.B. zu einem Dokument, das nur eine Section und  nur MedicationStatements enthält) und damit einen Proof-of-Concept zu implementieren...</p>",
        "id": 153818743,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1459246095
    },
    {
        "content": "<p>sehr guter Vorschlag, können wir gerne am Freitag weiter besprechen (falls du kommst, aktuelle sind nur 2 Studenten im Schwerpunkt, Christian wollte sich noch bei dir melden deswegen) Ich ziehe mir mal weiter Slicing rein .. :)</p>",
        "id": 153818746,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1459246280
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153818781,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1459258163
    }
]