[
    {
        "content": "<p>Für die Basisprofile in der Schweiz wollen wir ein Unfallkennzeichen und Datum abbilden. Die administrative Systeme in der Schweiz senden die zwei Attribute «Unfallkennzeichen» (ob ein Unfall zum Eintritt führte) und «Unfalldatum». Das Unfallkennzeichen könnte aus Encounter.reasonCode[*] abgeleitet werden, allerdings stellt sich die Frage, welche SnomedCT-Codes den Unfall als ursächlich für den aktuellen Fall kennzeichnen. Wir sind vor dem Entscheid ob wir eine Extension einführen sollen, siehe auch <a href=\"https://github.com/hl7ch/ch-core/issues/41\">https://github.com/hl7ch/ch-core/issues/41</a>. Ist diese Thema bei euch in Deutschland (<span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> ) und Österreich (<span class=\"user-mention\" data-user-id=\"191890\">@Reinhard Egelkraut</span> ) auch ein Thema oder habt ihr sogar da schon etwas gemacht?</p>",
        "id": 206548552,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1597132158
    },
    {
        "content": "<p>In den deutschen Basisprofilen haben wir dazu noch nichts.<br>\nDie KBV hat im Kontext von Rezept und Arbeitsunfähigkeitsbescheinigung hier eine Extension definiert, die allerdings gemäß deutscher Notwendigkeiten auch separat den Arbeitsunfall und das Versorgungsleiden kennt:<br>\n<a href=\"https://simplifier.net/evo/evoexursache\">https://simplifier.net/evo/evoexursache</a></p>",
        "id": 206554351,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597136958
    },
    {
        "content": "<p>Das bezieht sich allerdings auf ServiceRequest (bzw. ggf. auch MedicationRequest). Im Encounter finde ich reasonCode durchaus überlegenswert</p>",
        "id": 206554496,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597137107
    },
    {
        "content": "<p>Von der Modellierung her gehört das m. E. in den Bereich \"Financial\", wo es unter Claim.accident auch die erforderlichen Datenfelder gäbe. Für den Patient bzw. die Patientenakte gäbe es das Konstrukt ExplanationOfBenefit (ungefähr \"Patientenquittung\"), das auch eine Kopie des accident aus dem Claim enthalten kann. Claim bzw. ExplanationOfBenefit referenzieren Encounter (nicht umgekehrt).</p>",
        "id": 206598094,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1597163940
    },
    {
        "content": "<p>Vom Datenmodell her mag das stimmen.<br>\nAllerdings ist IMHO diskussionswürdig, ob eine ausschließliche Abbildung in Claim den üblichen Workflows gerecht wird.</p>",
        "id": 206625093,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597176720
    },
    {
        "content": "<p>Sprich: \"wann wird der Claim generiert\" versus \"wann erhalte ich die Information, dass es sich um einen Unfall handelt\"</p>",
        "id": 206625295,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1597176820
    },
    {
        "content": "<p>ggf kann das sehr früh passieren: z B \"preauthorization - where the provision of goods and services is proposed and authorization and/or the reservation of funds is desired.\"</p>",
        "id": 206633411,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1597181217
    },
    {
        "content": "<p>Das trifft ja die reale Lage: zum Zeitpunkt der Versorgung ist die Vergütung noch nicht geklärt. Also wird vorsorglich eine entsprechende Notiz als Claim erfasst.</p>",
        "id": 206633689,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1597181384
    },
    {
        "content": "<p>Im Verordnungsmanagement haben wir mehrere CDA-Templates dazu, weil jedesmal andere Details interessieren. Es wäre toll, dazu eine gemeinsame Abstraktion zu finden, die man dann spezialisieren und dann in CDA und FHIR profilieren kann..</p>",
        "id": 206664676,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1597215052
    },
    {
        "content": "<p>Ist „mehrere Templates, weil jedesmal andere Details interessieren“ der offizielle CDA-Euphemismus für „lauter inkompatible Profile“?<br>\n/s</p>",
        "id": 206804950,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1597319130
    }
]