[
    {
        "content": "<p>Hallo liebe Community,</p>\n<p>an dieser Stelle nur ein kurzer Hinweis:</p>\n<p>Die Festlegung der VoS-SST in der Version 1.20.0 wurde durch den Vorstand der KBV beschlossen. Die neue Version umfasst kleine Anpassungen zur Unterstützung des E-Rezepts und muss bis zum 01.01.2022 in den Systemen umgesetzt worden sein. Die entsprechenden Dokumente inkl. eines Changelogs, eines neuen FAQ-Dokumentes, den Kommentaren und Antworten aus der öffentlichen Kommentierung, sowie aus der Benehmensherstellung sind unter <a href=\"https://update.kbv.de/ita-update/371-Schnittstellen/Verordnungssoftware-Schnittstelle/\">https://update.kbv.de/ita-update/371-Schnittstellen/Verordnungssoftware-Schnittstelle/</a> abrufbar. Die FHIR-Profile werden zusätzlich auf Simplifier <a href=\"https://simplifier.net/verordnungssoftware-schnittstelle\">https://simplifier.net/verordnungssoftware-schnittstelle</a> zur Verfügung gestellt. </p>\n<p>Die Softwareprodukte, die eine gültige VoS-SST-Prüfnummer haben, müssen die Umsetzung nicht erneut zertifizieren lassen. Die Testdatenvalidierung des Zertifizierungsportals kann unterstützend zum Testen der Implementierung genutzt werden. Das Zertifizierungsthema „SST-VOS_V1.20.0“ und die dazugehörige Testdatenvalidierung ist im Zertifizierungsportal zu finden.</p>\n<p>Hinweis: Der Ordner …/291d-Schnittstellen/Verordnungssoftware-Schnittstelle/ ist auf dem Update-Server – wie angekündigt – ab sofort nicht mehr verfügbar.</p>",
        "id": 247295528,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1627363404
    },
    {
        "content": "<p>Wenn ich es richtig verstehe, ist dies ein schönes Beispiel, wie wir mit Nutzung der DocumentReference unterschiedliche FHIR-Versionen (hier STU3 und R4) zusammen einsetzen können. </p>\n<p>Verständnisfrage eines Nicht-Implementierers: Spielt 74_PR_VoS_Rezept (<a href=\"https://simplifier.net/verordnungssoftware-schnittstelle/74prvosrezept\">https://simplifier.net/verordnungssoftware-schnittstelle/74prvosrezept</a> ) hier künftig auch noch eine Rolle? Oder wird in der Praxis eigentlich nur noch über 74_PR_VoS_DokuRef und KBV_PR_ERP_Prescription (<a href=\"https://simplifier.net/erezept/kbvprerpprescription\">https://simplifier.net/erezept/kbvprerpprescription</a> ) gearbeitet?</p>",
        "id": 247308502,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1627375808
    }
]