[
    {
        "content": "<p>Folgendes Szenario (IPSObservation und MyObservation sehen für Profile auf Observation)</p>\n<p>IPSObservation.subject referenziert auf targetProfile IPSPatient.<br>\nEin Profil MyObservation leitet von IPSObservation ab und fügt bei MyObservation.subject einen weiteren targetProfile MyPatient hinzu. MyPatient ist aber nicht von IPSPatient abgeleitet und es kann Instanzen geben, die gegen MyPatient valide sind, aber nicht gegen IPSPatient. </p>\n<p>Wie verhält sich hier die Validation? Wäre eine Instanz von MyObservation die auf einen Patient referenziert, der nicht valide gegen IPSPatient ist valide...?</p>",
        "id": 191097506,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1584615712
    },
    {
        "content": "<p>Danke Simone. Ergänzend zur Generalisierung: verhält sich FHIR bezüglich Vererbung (Polymorphismus etc.) analog zu objektorientierten Programmiersprachen wie JAVA etc.?</p>",
        "id": 191097849,
        "sender_full_name": "Marcel Klötgen",
        "timestamp": 1584615908
    },
    {
        "content": "<p>Dass man bei der Profilierung weitere targetProfiles hinzufügt wäre ja sinnvoll, da man ggf. zusätzliche Constraints haben möchte, aber die ElementDefintion  verstehe ich so, dass bei der Angabe mehrerer Profile die Regel gilt \"one must apply\" (<a href=\"http://hl7.org/fhir/elementdefinition-definitions.html#ElementDefinition.type.targetProfile\" target=\"_blank\" title=\"http://hl7.org/fhir/elementdefinition-definitions.html#ElementDefinition.type.targetProfile\">http://hl7.org/fhir/elementdefinition-definitions.html#ElementDefinition.type.targetProfile</a>). Also wäre eine Instanz mit Referenz auf einen ungültigen IPSPatient ggf. gegen MyObservation valide, aber nicht gegen IPSObservation, was ja irgendwie der Idee von abgeleiteten Profilen widersprechen würde...</p>",
        "id": 191097882,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1584615928
    },
    {
        "content": "<p>Logisch wäre für mich auf jeden Fall, dass eine Instanz mit Referenz auf einen ungültigen IPSPatient nicht valide gegen MyObservation sein darf. Fraglich ist für mich nur, ob das Tooling (sprich: der Validator) das in dieser Konstellation merken würde, da er ja nur gegen den Snapshot von MyObservation validiert, der m.M.n zwei oder-verknüpfte targetProfiles enthalten dürfte. Würde der Validator gegen MyObservation <em>und</em> IPSObservation separat validieren würde er's merken...</p>",
        "id": 191098921,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1584616598
    }
]