[
    {
        "content": "<p>Gibt es auch schon eine Extension für die Versiegelung von Fällen oder Dokumenten, bzw. auch das temporäre Brechen oder stornieren solch eines Siegels?</p>",
        "id": 182021363,
        "sender_full_name": "Henrik Blau",
        "timestamp": 1574863462
    },
    {
        "content": "<p>Betrifft das im Falle des Falles nur den Fall (Encounter) oder sämtliche Dokumentation, die da dran hängt...?</p>",
        "id": 182021457,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574863530
    },
    {
        "content": "<p>Der Fall ist samt aller Dokumente gesperrt. Hintergrund: Die Sperrung auch an Subsysteme (DMS, PACS,...) zu kommunizieren.</p>",
        "id": 182021556,
        "sender_full_name": "Henrik Blau",
        "timestamp": 1574863587
    },
    {
        "content": "<p>Oha! Also würde würde man im FHIR-sprech das gesamte <a href=\"http://hl7.org/fhir/compartmentdefinition.html\" target=\"_blank\" title=\"http://hl7.org/fhir/compartmentdefinition.html\">Compartment Encounter</a> sperren...</p>",
        "id": 182021752,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574863737
    },
    {
        "content": "<p>Spontan kann ich mir das jetzt nur als eine Operation vorstellen, die ein Client bei einem Server aufrufen kann, mit Fallnummer als Parameter, die auf dem Server einen Business-Logik triggert, die den Fall und alles was dran hängt, sperrt. (Vielleicht nicht <em>alles</em>, die interne Implementierung könnte da etwas genauer differenzieren...). <br>\nUm die Sperrung intern zu implementieren, würde ich dazu tendieren, die betroffenen Ressourcen mit einem entsprechenden <a href=\"http://hl7.org/fhir/security-labels.html\" target=\"_blank\" title=\"http://hl7.org/fhir/security-labels.html\">Security-Flag</a> zu versehen...</p>",
        "id": 182022101,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574863973
    },
    {
        "content": "<p>Gibt es denn da eine konkrete Vorgabe wie so eine Fall-Sperrung aussehen soll? Wie lange dauert die Sperrung, wer darf sie wieder aufheben, mit welcher Begründung... Entscheidet das jedes System selbst, oder gibt es da eine (gesetzliche/regulatorische) Grundlagen?</p>",
        "id": 182023341,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574864813
    },
    {
        "content": "<p>Ich frag mal die Schwarm-Intelligenz...<br>\n<a href=\"#narrow/stream/179166-implementers/topic/Sealing.20an.20Encounter\" title=\"#narrow/stream/179166-implementers/topic/Sealing.20an.20Encounter\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Sealing.20an.20Encounter</a></p>",
        "id": 182024072,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574865245
    },
    {
        "content": "<p>Die regulatorische Grundlage ist die Orientierungshilfe Krankenhausinformationssysteme (OH KIS).</p>",
        "id": 182024194,
        "sender_full_name": "Henrik Blau",
        "timestamp": 1574865326
    },
    {
        "content": "<p>Link?</p>",
        "id": 182024230,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574865350
    },
    {
        "content": "<p><a href=\"https://www.isdsg.de/sites/default/files/DGK_Hinweise_zur_Orientierungshilfe_KIS_Maerz_2014.pdf\" target=\"_blank\" title=\"https://www.isdsg.de/sites/default/files/DGK_Hinweise_zur_Orientierungshilfe_KIS_Maerz_2014.pdf\">https://www.isdsg.de/sites/default/files/DGK_Hinweise_zur_Orientierungshilfe_KIS_Maerz_2014.pdf</a><br>\nHängt natürlich immer von der Handhabung ab. OH KIS sagt nicht, dass dies an Subsysteme kommuniziert werden muss, Sinn macht es trotzdem.</p>",
        "id": 182024361,
        "sender_full_name": "Henrik Blau",
        "timestamp": 1574865411
    },
    {
        "content": "<p>Kapitel 3.1?</p>",
        "id": 182025781,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574866256
    },
    {
        "content": "<p>Einiges davon müsste man nicht an die Subsysteme kommunizieren (Entlassung, Verlegung usw. bekommen die Subsysteme ja ohnehin mit). Ich vermute, es geht also um die Implementierung von Zugriffsregeln, die an ein Event geknüpft sind, das nur das  Primärsystem mitbekommt, z.B. Eingang einer Rechnung oder so ähnlich...<br>\nEs wird auch nicht genau gesagt, wie diese \"Zugriffsbeschränkung\" genau aussehen soll (BTG, read-only, komplett-sperrung).<br>\nSinnvoll wäre also in der Tat eine parametrierbare Operation, bei der das jeweils zutreffende/gewünschte Security-Flag, das im Subsystem gesetzt werden soll, mitgegeben werden kann...</p>",
        "id": 182028708,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574868202
    },
    {
        "content": "<p>Hallo, wir haben vor kurzem in einem unserer Subsysteme eine Art Versiegelung umgesetzt und dabei ist der Workflow so, dass eine bestimmte Rolle die Versiegelung temporär brechen kann, dabei aber immer eine Begründung angeben muss. Mein erster Gedanke, das mit Fhir zu machen wäre jetzt, die \"versiegelte\" Instanz mit einer verpflichtenden Referenz auf ein AuditEvent zu versehen. Dabei müsste man aber beim AuditEvent noch ein Profil ableiten, bei dem die Beschreibung o.ä. verpflichtend ist?! Was sagen die Profis ;)<br>\nDer Workflow ist übrigens sehr ähnlich, wie die Versiegelung auch in Orbis von Agfa umgesetzt ist.</p>",
        "id": 182039863,
        "sender_full_name": "Jonas Schön",
        "timestamp": 1574875279
    },
    {
        "content": "<p>Im Prinzip entspricht das dem <a href=\"http://hl7.org/fhir/security-labels.html#break-the-glass\" target=\"_blank\" title=\"http://hl7.org/fhir/security-labels.html#break-the-glass\">\"Break-The-Glass\"-Protokoll</a>.<br>\nDafür gibt es auch ein definiertes Security-Label, das man verwenden könnte, um die Resourcen zu \"versiegeln\".</p>",
        "id": 182045293,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574879092
    },
    {
        "content": "<p>Ich tue mich noch schwer mit der Definition der Values in <a href=\"http://terminology.hl7.org/ValueSet/v3-ConfidentialityClassification\" target=\"_blank\" title=\"http://terminology.hl7.org/ValueSet/v3-ConfidentialityClassification\">http://terminology.hl7.org/ValueSet/v3-ConfidentialityClassification</a>. <br>\nIm Valueset <a href=\"http://hl7.org/fhir/valueset-security-labels.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-security-labels.html\">http://hl7.org/fhir/valueset-security-labels.html</a> werde ich schon eher fündig. Kann ich dieses nicht auch in Meta.Security nutzen und somit als Metainformation zum Encounter anhängen? Oder verstehe ich das falsch und muss das Meta.Security-Label an jeder einzelnen Ressource setzen?</p>",
        "id": 182088751,
        "sender_full_name": "Henrik Blau",
        "timestamp": 1574927573
    },
    {
        "content": "<p>Aber schon mal vielen Dank für den vielen Input!</p>",
        "id": 182088777,
        "sender_full_name": "Henrik Blau",
        "timestamp": 1574927610
    },
    {
        "content": "<p>Ja, das ValueSet kann man an meta.security verwenden. Man könnte das ValueSet sogar erweitern, falls es für diesen konkreten UseCase nichts passendes gibt.<br>\nIch denke aber schon, dass man alle Ressourcen, die versiegelt werden sollen, einzeln mit dem Flag versehen müsste. Ich wüsste sonst nicht, wie eine Access Control Engine die Regeln sonst umsetzen sollte.<br>\nVermutlich ist es auch völlig zweitrangig, wie genau ein System <em>intern</em> die Versiegelung implementiert.<br>\nFür ein FHIR-natives backend würde es vermutlich tatsächlich genau so aussehen, dass alle Ressourcen im Encounter-Compartment mit dem Security-Flag versehen werden müssen, während ein anderes System, das lediglich über eine FHIR-Fassade verfügt, in der eigenen Datenbank etwas ganz anderes tut.<br>\nAndere Systeme wiederum könnten die Daten ano-/pseudonymisieren anstatt den Zugriff zu sperren...das sollte m.E. dem Subsystem überlassen sein. Die Richtlinie ist da ja maximal vage, was genau unter \"Zugriffsbeschränkung\" zu verstehen ist.</p>\n<p>Viel wichtiger wäre es meines Erachtens, sich auf die Art und Weise zu einigen, wie die Aufforderung zur Versiegelung kommuniziert werden soll. <br>\nIch wäre also durchaus offen dafür, ein entsprechende Operation zu definieren und in den Deutschen Basisprofilen zu publizieren.<br>\nEine Notwendigkeit, das auf höherer/internationaler Ebene festzunageln sehe ich aktuell nicht, da es sich ja um die Implementierung einer <em>deutschen</em> Richtlinie handelt.</p>",
        "id": 182097411,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1574936801
    },
    {
        "content": "<p>Deutsche Anforderungen nicht auf eine internationale Ebene zu heben war schon (und ist noch) immer ein Problem. Unsere Historie zeigt doch, dass wir mit vielen unserer Überlegungen früher dran sind als andere Länder. Nur dass diese später die gleiche Anforderungen einbringen, nur halt anders. Und dann wundern wir uns wieder, dass das \"amerikanische\" Standards sind.<br>\nInsofern sollten wir unsere Vorschläge als German realm core profiles abliefern, und nicht \"geheim\" halten.</p>",
        "id": 182235634,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1575113451
    }
]