[
    {
        "content": "<p>Ich würde hier gerne <a href=\"https://github.com/hl7germany/basisprofil-de-r4/issues/105\">Issue #105</a> diskutieren.</p>\n<p>Konkret die Fragen, wie ein Deutsches Basisprofil einer <a href=\"http://hl7.org/fhir/documentreference.html\">DocumentReference</a>  aussehen sollte.</p>\n<ol>\n<li>\n<p>Konform zu IHE MHD <br>\na) <a href=\"https://github.com/IHE/fhir/blob/master/StructureDefinition/structuredefinition-IHE_MHD_Provide_Minimal_DocumentReference.xml\">minimal</a><br>\nb) <a href=\"https://github.com/IHE/fhir/blob/master/StructureDefinition/structuredefinition-IHE_MHD_Provide_Comprehensive_DocumentReference.xml\">comprehensive</a><br>\n...sorry, ich finde dafür keine gerenderte Darstellung :-(</p>\n</li>\n<li>\n<p>mit einem preferred, extensible oder required Binding an die ValueSets von IHE-DE?</p>\n</li>\n<li>\n<p>welche weiteren Ressourcen sollten wir für Deutschland profilieren? DocumentManifest? Composition? ...?</p>\n</li>\n<li>\n<p>Sollten die Profile jeweils als \"Deutsche Basisprofile\" bezeichnen oder sind IHE-konforme Profile bereits eine Spezialisierung der Basisprofile? Falls letzteres: was wäre der Unterschied zwischen einem Deutschen Basisprofil und einem Deutschen IHE-Profil?</p>\n</li>\n</ol>",
        "id": 210105240,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1600160243
    },
    {
        "content": "<p>Was sind jetzt Profile? In meinen Verständnis sind das Ressourcen oder Use Case, und keine Extensions oder Datentypen, weil die nicht alleine stehen können. In Fhir tun sie das zwar auch, ich bezeichne so etwas lieber als Komponente, die man verwenden kann..</p>",
        "id": 210150855,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1600186230
    },
    {
        "content": "<p>Insofern würde ich 4. eher als 1. lösen, d.h. mit zusätzl. Constraints für D., als Valueset Binding kompatibel zu XDS mit den aus AD exportierten Valuesets + was auch immer...</p>",
        "id": 210151097,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1600186352
    },
    {
        "content": "<p>Rerenderte Darstellung DocumentReference: <a href=\"https://build.fhir.org/ig/IHE/ITI.MHD/IHE.MHD.Provide.Comprehensive.DocumentReference.html\">https://build.fhir.org/ig/IHE/ITI.MHD/IHE.MHD.Provide.Comprehensive.DocumentReference.html</a><br>\n(Dort unter Diff/Snapshot)</p>\n<p>Zu (1) ich votiere für comprehensive; auch würde ich votieren für ein Profil, das die gematik-ePA vor das eigentliche XDS stellt:<br>\nAus meiner Sicht wäre ein solches Profil eine alternative Möglichkeit auf Daten zuzugreifen.<br>\nZu (2) Bindung an ValueSets wäre ein große Hilfe Richtung Einheitlichkeit; \"extensible\" wäre aus meiner Sicht das sinnvollste - \"required\" würde für mich nur maximal dort Sinn machen, wo XDS und gematik-ePA identisch sind;<br>\nZu (3) Die nächst-wichtigste Baustelle wäre aus meiner Sicht die Angabe des XDS-Author / Institution. Aus meiner Sicht entspräche es einem Profil zu PractitionerRole, das in DocumentReference.author angegeben werden würde. Aus diesem Profil ergäben sich dann wiederum Profile für die Person des Autors (Practitioner), die Institution des Autors (Organization vs. healthcareService)?<br>\nZu (4) bin mir nicht sicher, ob ich Frage vollständig verstanden habe. XDS kompatible Profile wäre aus meiner Sicht für einige Server stets ein alternativer Zugriff auf DocumentReference.</p>",
        "id": 210245478,
        "sender_full_name": "Joerg Mehlbrech",
        "timestamp": 1600253463
    }
]