[
    {
        "content": "<p>Hallo,<br>\nhat jemand schon Erfahrungen mit Zugriffsberechtigungen in HL7 FHIR gemacht. Mit den Compartments bietet HL7 FHIR die Möglichkeit Ressourcen zu gruppieren und mit Zugriffseinschränkungen zu versehen (<a href=\"https://www.hl7.org/FHIR/2015Dec/compartments.html\" target=\"_blank\" title=\"https://www.hl7.org/FHIR/2015Dec/compartments.html\">https://www.hl7.org/FHIR/2015Dec/compartments.html</a>). Ich kann bestimmte Ressourcen ein oder mehreren Compartments zuordnen und die Compartments wiederum bestimmten Personen(-gruppen).<br>\nFolgende Ressourcen sind als Compartments zugelassen: Patient, Encounter, RelatedPerson, Practitioner, Device. Diese passen für uns nicht. Wir brauchen Compartments, die Ordner/Partitionen, die wir beliebig klassifizieren können, abbilden.<br>\nBeispiel:<br>\n-   Patientenfach: nur Patient hat Zugriff auf die Ressourcen<br>\n-   Ordner für die informelle Pflege (z. B. Eltern): Patient und Angehörige haben Zugriff auf die Ressourcen<br>\n-   Pateintenfreigabe: Patient, informelle Pflege und Ärzte haben Zugriff auf die Ressourcen. <br>\nHat jemand Erfahrung, wie man das am besten abbilden kann. Kann man ggf. die Compartments um eine weitere passende Ressource erweitern.<br>\nOder soll dafür einfach Encounter genommen werden?<br>\nVielen Dank!<br>\nGrüße,<br>\nSalima Houta</p>",
        "id": 153851003,
        "sender_full_name": "Salima H",
        "timestamp": 1475043357
    },
    {
        "content": "<p>Zunächst mal würde ich die aktuellste Fassung der Spezifikation zurate zu ziehen, da sich gerade auf dem Feld der Security viel bewegt: <a href=\"http://hl7-fhir.github.io/compartmentdefinition.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/compartmentdefinition.html\">http://hl7-fhir.github.io/compartmentdefinition.html</a>.</p>",
        "id": 153851005,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1475043611
    },
    {
        "content": "<p>Wenn ich da mal so grob diagonal lese, würde ich sagen, dass die CompartmentDefinition-Resource genau dafür geschaffen wurde, dass jeder seine eigenen Compartments definieren kann. Ihr könntet damit also individuell und projektspezifisch festlegen, welche Compartments es auf eurem Server gibt und was da jeweils drin ist, bzw. wie die Resourcen in einem Compartment miteinander im Verhältnis stehen.</p>",
        "id": 153851006,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1475043805
    }
]