[
    {
        "content": "<p>Grahame still maintains the 2016May release for one client that has a significant production implementation using that release and who continues to put out new specifications based on that release.  There were some issues with the package content that were impacted to how polymorphic types (e.g. value[x] in extensions) were represented and a few other problems that were identified.  I've corrected and tested the package and Grahame has merged the changes into the source-of-truth for the package.  However, FMG approval is still required before he pushes the corrected .tgz file up to <a href=\"http://hl7.org/fhir\" target=\"_blank\" title=\"http://hl7.org/fhir\">http://hl7.org/fhir</a>.  So I'm asking the FMG to provide that approval - most likely via a vote at our next call (when neither Grahame nor I will be present).</p>",
        "id": 185957802,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579295582
    },
    {
        "content": "<p>well, it's not just that. In order to post a new package (packages, actually, for the FHIR spec), I need to post a new version of the spec- that is, a full technical correction. So that version of FHIR will be changed from 1.4.0 to 1.4.1.</p>",
        "id": 185958464,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1579295936
    },
    {
        "content": "<p>Does it make sense to do that given that it's not an official release and there's only one known user?</p>",
        "id": 185958687,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579296065
    },
    {
        "content": "<p>I have to change the package release number</p>",
        "id": 185964303,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1579300196
    },
    {
        "content": "<p>So to confirm, we'll be asked to approve a technical correction? Is there a more detailed list of the changes? (There sounds like there were a few of them...) . Would it be better to delay the vote until either Lloyd or Grahame can be present?</p>",
        "id": 186221154,
        "sender_full_name": "David Hay",
        "timestamp": 1579636963
    },
    {
        "content": "<p>That would put us at the WGM.  A whole lot of files impacted.  Actual changes weren't that extensive.  Main thing is that this is a technical correction on a release that was a ballot release - so not a formally maintained release from an organizational perspective.</p>",
        "id": 186223674,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579638492
    }
]