[
    {
        "content": "<p>Can we please add an agenda topic about quantitative results for connectathon testing requirement for FHIR IG balloting?  Need to define the requirements so that it is \"easier\" to determine if IG has meet testing requirements.  Also, what is the requirement for using non HL7 Connectathon testing as part of meeting this requirement?</p>",
        "id": 230422802,
        "sender_full_name": "Melva Peters",
        "timestamp": 1615844350
    },
    {
        "content": "<p>Current guidance is \"at least 3 independently developed systems successfully interoperating and covering most (i.e. 80%+) of the solution space defined by the IG.\"  Requirements for non-HL7 connectathon is that the connectathon is publicly announced in advance with sufficient notice  (typically 30 days) to anyone who wants to participate and that anyone who wants to participate can on a non-discriminatory basis.</p>",
        "id": 230427770,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615846184
    },
    {
        "content": "<p>Do we need more than that?</p>",
        "id": 230427939,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615846224
    },
    {
        "content": "<p>Who decides if the testing covers 80%?  So for non-HL7 connectathons, it just has to be advertised?  No requirements for number of systems testing and covering 80%?</p>",
        "id": 230432481,
        "sender_full_name": "Melva Peters",
        "timestamp": 1615847836
    },
    {
        "content": "<p>Same requirements whether HL7 or not.  We generally take the word of the participants at face value, though if someone wants to challenge whether an FMM level is appropriate, they could make their concerns known to the FMG and we could dig further.</p>",
        "id": 230464993,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615875903
    },
    {
        "content": "<p>There should also be a requirement that Jira tickets against the IG are all resolved.</p>",
        "id": 230502204,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615897167
    },
    {
        "content": "<p>Should there be a requirement to have a published test plan? Not necessary to have test tools and procedure; but a written test plan explains to everyone how the IG was tested.</p>",
        "id": 230502354,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615897243
    },
    {
        "content": "<p>with an IG, I am less comfortable with the 80% measure. It would seem that an IG should be measured against 100%.</p>",
        "id": 230502473,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615897305
    },
    {
        "content": "<p>No chance of us requiring that Jira tickets are all resolved - Jira tickets come in continuously, so an IG under active use will never get to 'done'.  It's completely reasonable for a work group to declare a cutoff and, after that, only worry about 'critical' issues that come in until they're published.</p>\n<p>If there was a requirement for a test plan, less than 5% of our IGs would have been published.  The requirement that a connectathon has tested 80% of functionality is to allow you to get FMM 2.  The objective of level 2 is \"This IG has been tested in code and more or less works - i.e. it's not just a 'paper' spec anymore\".  Requiring that you test every single data element, extension, code, etc. isn't reasonable (or necessary) to get an evaluation that a 'reasonable' degree of implementation has occurred and the IG more or less works</p>",
        "id": 230510135,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615900806
    },
    {
        "content": "<p>I think that is unfortunate position by the chair. Is that the decision of FMG? I don't recall this being discussed yet</p>",
        "id": 230517730,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615903747
    },
    {
        "content": "<p>Which?  We've never talked about requiring all tickets to be resolved before you can publish - because there's never been a hope of doing that.  I don't think we've ever had fewer than 200 outstanding tracker items when we've put out a release of FHIR core - and that number has been trending significantly upward.</p>\n<p>We've certainly talked about the notion of FMM 2 being tied to testing 'most' of the functionality, never 'all' of the functionality.</p>",
        "id": 230524177,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615905894
    },
    {
        "content": "<p>Note that there's a base TSC/ANSI requirement to have resolutions for all <em>ballot</em> tracker items before we publish.  That's not in question.</p>",
        "id": 230524323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615905943
    },
    {
        "content": "<p>then I lost track of the target we were discussing. sorry, so this is a definition of criteria to be allowed \"into a ballot\", vs \"publish an STU\", vs \"normative\"...</p>",
        "id": 230525092,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615906130
    },
    {
        "content": "<p>Right.  And it's not a 'hard' requirement for into ballot.  You can ask for a waiver.</p>\n<p>However, even for publishing normative or STU, we'd never require more than all ballot Jiras to be resolved.  We'd never require <em>all</em> Jiras to be resolved.</p>",
        "id": 230525785,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615906330
    },
    {
        "content": "<p>I think that needs to be considered. but that is a bit into our future</p>",
        "id": 230528294,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615907106
    }
]