[
    {
        "content": "<p>From GOM: </p>\n<blockquote>\n<p>Members shall indicate their interest by enrolling in the appropriate consensus group via the HL7 Ballot Desktop during the enrollment period which shall end with the opening of the ballot period.</p>\n</blockquote>\n<p>Can anyone tell me the rationale for this? Why prevent people from signing up for a ballot <em>during</em> the ballot period (e.g., any time before the <em>close</em> of the ballot, rather than any time before the <em>opening</em>)?</p>",
        "id": 245069942,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625591641
    },
    {
        "content": "<p>one reason during balloting with Jira is that the consensus group from the ballot desktop becomes the list of users in Jira that are granted ballot submissions for voting.</p>",
        "id": 245070192,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1625591758
    },
    {
        "content": "<p>This is question-begging though -- I'm wondering even in the Ballot Desktop days: why exclude people who want to join during the ballot window?</p>",
        "id": 245070324,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625591802
    },
    {
        "content": "<p>I believe it is an ANSI requirement, and is intended to prevent ballot manipulation, for example if you see the vote/comments going one way, you can recruit others to vote the other way.</p>",
        "id": 245070334,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1625591807
    },
    {
        "content": "<p>the specific reason for no overlap between the sign up period and the voting period predates my term as ballot manager</p>",
        "id": 245070401,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1625591847
    },
    {
        "content": "<p>That's fascinating <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> . I mean, the game theoretic answer is still \"sign up for everything always\".</p>",
        "id": 245070415,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625591855
    },
    {
        "content": "<p>Don't forget you can pay to join a ballot even if you're not a member, so there might be people who don't regularly \"sign up for everything anyways\" but could be called upon to join if they felt their interest was at risk.</p>\n<p>And I'm just theorizing, I have no idea about where these requirements actually came from.</p>",
        "id": 245070998,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1625592149
    },
    {
        "content": "<p>Thanks -- yeah, I've noticed practical challenges where not everyone manages to sign up on time :-)</p>",
        "id": 245071382,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625592349
    },
    {
        "content": "<p>It is an ANSI requirement.  We didn't used to have this rule.  It used to be possible to sign up while the ballot was open.  ANSI made us change our processes.</p>",
        "id": 245077235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625594924
    },
    {
        "content": "<p>ANSI made us change this process for STU ballots and informative ballots?</p>",
        "id": 245090294,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625601119
    },
    {
        "content": "<p>Is there any history / documentation I could look at, for this?</p>",
        "id": 245090344,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625601132
    },
    {
        "content": "<p>One balloting database, one set of schedules for informative and STU ballots based on the normative example...</p>",
        "id": 245090676,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1625601307
    },
    {
        "content": "<p>Best person to reach out to is Karen van Hentenryk - she's the ANSI coordinator and was the primary contact for the ANSI audit that drove the change (and she's also on the executive committee that would have agreed to the change).</p>",
        "id": 245096550,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625604447
    }
]