[
    {
        "content": "<p>I think the FMG should define some best practices and/or minimum expectations around block votes.  There are a variety of practices - and some of them are pretty bad...</p>",
        "id": 269659641,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643327546
    },
    {
        "content": "<p>Sure. What are you seeing as bad practices (without naming names)?</p>",
        "id": 269668746,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643333102
    },
    {
        "content": "<ul>\n<li>Not doing an @mention or cc of the parties whose issues are being voted on</li>\n<li>Not having the proposed disposition listed in the appropriate issue (resolution + resolution description)</li>\n<li>Not posting a direct link to a spreadsheet or query that shows the issues being voted on, that query or spreadsheet not showing the issue key (with hyperlink), spec, summary, proposed resolution and submitter</li>\n<li>Having a proposed resolution other than 'persuasive' when there are one or more 'in person' individuals listed and no indication that those individuals have accepted the resolution?</li>\n<li>Not indicating exactly when and where the block vote will be voted on</li>\n<li>Not indicating the process to use to pull an issue</li>\n</ul>",
        "id": 269681998,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643340658
    },
    {
        "content": "<p>I agree these are frustrating practices. Not sure I agree that one must include the jira query, seems more of a good thing to do.</p>",
        "id": 269733804,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643375891
    },
    {
        "content": "<p>I have never quite understood how to handle the inperson when the committee agrees with the original authors change. The inperson people might have tagged on because they disagree with the original author change.</p>",
        "id": 269733905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643375942
    },
    {
        "content": "<p>I'm fine with a spreadsheet - but the spreadsheet should include a hyperlink to the issue.<br>\nIf you find the issue Persuasive - i.e. you're going to do what the requester asked as they asked, then you're fine.  If someone <em>else</em> has marked in person, then you need to get confirmation they're ok with the resolution.</p>",
        "id": 269749719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643382424
    },
    {
        "content": "<p>the jira tool produces a nice HTML as well... with hyperlink. I agree, the hyperlink to the issues is the critical</p>",
        "id": 269750092,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643382558
    },
    {
        "content": "<p>inperson.. should the block vote notification go out to all of the inperson as well? because how else do I know that you agreed with the orignal person if I am not notified?</p>",
        "id": 269750256,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643382609
    },
    {
        "content": "<p>the jira tool enables piling-on much better than the old system, so we should recognize that in our recommendation.</p>",
        "id": 269750383,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643382661
    },
    {
        "content": "<p>Yes, notification should go out to all inperson.</p>",
        "id": 269750677,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643382765
    },
    {
        "content": "<p>We should probably set expectations about list serve vs. Zulip vs. both too.</p>",
        "id": 269750792,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643382807
    },
    {
        "content": "<p>what about ballot pile-ons?</p>",
        "id": 269750801,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643382811
    },
    {
        "content": "<p>as much as we here are always on zulip.. the hl7 body is not, and further those who comment may not even know zulip exists... so I vote, both.</p>",
        "id": 269750996,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643382871
    },
    {
        "content": "<p>would seem email to \"the\" owning workgroup is required of governance, right?</p>",
        "id": 269751151,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643382924
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179192-fmg/topic/Block.20vote.20rules/near/269750092\">said</a>:</p>\n<blockquote>\n<p>the jira tool produces a nice HTML as well... with hyperlink. I agree, the hyperlink to the issues is the critical</p>\n</blockquote>\n<p>can we get jira to produce zulip friendly markdown too?</p>",
        "id": 269751313,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643382970
    },
    {
        "content": "<p>Yes, it's probably a good idea to @ all voters too.  Getting Jira to produce a Block Vote report is on the to-do list.</p>",
        "id": 269754940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643384363
    },
    {
        "content": "<p>It would be swell to produce a markdown version of the report for Zulip. ( and then just copy paste to an email.</p>\n<p>I can whip up a set of quick instructions to make it look decent but requires regex.</p>\n<p>Also the in person flag needs to be more prominent, I miss is every  time.  can you make it flash or neon orange (I know I asked before)</p>",
        "id": 269815994,
        "sender_full_name": "Eric Haas",
        "timestamp": 1643411270
    },
    {
        "content": "<p>Making anything flash isn't really possible.  We can control where the field appears on the screen, that's about it.  What we <em>could</em> do is add a check-box to the resolution transition screen that says \"In-person consulted?\" to allow a formal attestation that all those in the in-person list had appropriate and privileged opportunity to present their viewpoint during the formation of the final resolution.  Would that help?  The logic could automatically suppress the requirement it be set if the resolution was Persuasive and the only in-person individual was the submitter.</p>",
        "id": 269818254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643412748
    },
    {
        "content": "<p>No more check boxes!</p>",
        "id": 269820129,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643414008
    },
    {
        "content": "<p>;-) I mean, this might be reasonable. There are just a lot of steps.</p>",
        "id": 269820241,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643414077
    },
    {
        "content": "<p>I know.  It's a trade-off.</p>",
        "id": 269820341,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643414161
    },
    {
        "content": "<p>Thanks for the suggestion but by that point is too late - already  posted to block or discussed and voted.   So no thanks.</p>",
        "id": 269844960,
        "sender_full_name": "Eric Haas",
        "timestamp": 1643439336
    },
    {
        "content": "<p>How is it too late?  If you've voted in WG and are applying the change and it flags that there were \"in person\" individuals and you realize they weren't there, that invalidates the vote and you don't have to apply it.  Or, for a block vote that you're applying, you can retroactively pull the issues for more discussion.</p>",
        "id": 269872908,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643472580
    },
    {
        "content": "<p>yes.</p>",
        "id": 270074269,
        "sender_full_name": "Eric Haas",
        "timestamp": 1643651513
    },
    {
        "content": "<p>I don't think the extra workflow has value because of that. Just document the voting rules like you proposed.</p>",
        "id": 270074461,
        "sender_full_name": "Eric Haas",
        "timestamp": 1643651573
    },
    {
        "content": "<p>Flagging \"in person\" isn't only about block votes though.  It's easy to miss that when you're voting in person too.</p>",
        "id": 270076594,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643652293
    }
]