[
    {
        "content": "<p>(there was a confusion as the call was initially cancelled then re-instated...)</p>",
        "id": 207455573,
        "sender_full_name": "David Hay",
        "timestamp": 1597867567
    },
    {
        "content": "<p>Call on now</p>",
        "id": 208141121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598472153
    },
    {
        "content": "<p>Thanks for the discussion on today's FMG call, re: release planning. I appreciate the candid exploration of possibilities. I certainly don't mean to hold us up or be overly reactionary -- and it's through this kind of discussion and debate that I'm able to iron out my own understanding and articulate my position. Sometimes I have to try out arguments to understand where they work and where they fall down :-)</p>",
        "id": 208152337,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1598477879
    },
    {
        "content": "<p>Call on now</p>",
        "id": 208879731,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599077010
    },
    {
        "content": "<p>I'm running late -- am I needed for quorum?</p>",
        "id": 208880080,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599077176
    },
    {
        "content": "<p>no</p>",
        "id": 208880465,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599077366
    },
    {
        "content": "<p>Can someone readmit me to the Zoom?</p>",
        "id": 208885345,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599079588
    },
    {
        "content": "<p>(Also, is it possible to turn off lobby mode for the future overall, or for FMG members at least?)</p>",
        "id": 208885422,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599079629
    },
    {
        "content": "<p>call on</p>",
        "id": 210313166,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600286598
    },
    {
        "content": "<p>Did I break up on the call just now? My point was to say, in clarification:</p>\n<ul>\n<li>The details of how \"Must Support\" works, and the precise semantics and capabilities are still a work in progress. As such, there may be confusion between editorial intent and structured representations. We encourage the designers of formal testing procedures to take editorial intent into account when designing conformance tests.</li>\n</ul>",
        "id": 210317491,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600288737
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/profiling.html#mustsupport\">https://www.hl7.org/fhir/profiling.html#mustsupport</a> defines \"Must Support\" (or seems to)</p>",
        "id": 210318106,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600289049
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/conformance-rules.html#mustSupport\">https://www.hl7.org/fhir/conformance-rules.html#mustSupport</a> also seems to :)</p>",
        "id": 210318256,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600289138
    },
    {
        "content": "<p>To capture my to-do, it's proposing updates to <a href=\"https://confluence.hl7.org/display/FMG/MustSupport+Clarifications\">https://confluence.hl7.org/display/FMG/MustSupport+Clarifications</a></p>",
        "id": 210319499,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600289822
    },
    {
        "content": "<p>Thanks Hans!</p>",
        "id": 210319512,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600289828
    },
    {
        "content": "<p>Discussion with Wayne | Austin about this, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  - it's procedurally comfortable for us to issue an 'errata', even if this is just advising of lack of clarity in the existing specification. We don't have to do it this way, but if the language FMG are working on can be phrased this way, that would be good</p>",
        "id": 210324555,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600292863
    },
    {
        "content": "<p>Here's some proposed wording <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> in place of the bold blue text we discussed yesterday:</p>\n<blockquote>\n<p>As the FHIR specification has matured and worldwide adoption has grown, we've seen strong demand for the precise, computable expression of conformance requirements. This area of the specification -- and especially the precise semantics for describing which data elements a FHIR implementation \"must support\" -- should be viewed as a work in progress. After reviewing how FHIR's \"must support\" flag is being used in implementation guides today, we [FMG?] recognize that in many cases the intent of a specification's editor does not align precisely with the formal implications of the specification's data profiles. We anticipate that the FHIR R4 publication will require technical corrections for clarity and perhaps to provide additional capabilities for expressing more nuanced \"must support\" requirements. After these corrections, implementation guide authors could update their IGs accordingly. In the meantime, we recommend that any formal testing procedures should not automatically treat the \"must support\" flag as applying to the entire hierarchy of data below a flagged element; rather, testing procedures should aim to reflect the editorial intent behind these profiles.</p>\n</blockquote>",
        "id": 210449195,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600375815
    },
    {
        "content": "<p>well politically said.</p>",
        "id": 210461741,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600383701
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> : Thank you!  I made some further modifications to clarify:</p>\n<p>As the FHIR specification has matured and worldwide adoption has grown, we've seen strong demand for the precise, computable expression of conformance requirements. This area of the specification -- and especially the precise semantics for describing which data elements a FHIR implementation \"must support\" -- should be viewed as a work in progress. After reviewing how FHIR's \"must support\" flag is being used in profiles today, we [FMG?] recognize that in many cases the intent of a implementation guide/profile's authors is not fully reflected in the application of the \"must support\" flag and other essential narrative leading to different and unintended interpretations.  As examples, we note that various profiles have used slicing to be more specific, others have used clear narratives, others did not specify any further leaving that to implementers or subsequently further constrained profiles, while many have still ambiguous and conflicting language that lead to varying interpretations, thus leaving much to the implementer to imply or assume.</p>\n<p>Updates to both the FHIR Core specification and to profiles will be needed to better align  use of \"must support\" flags and narratives for the various FHIR elements (attributes, backbone elements, data type elements, reference and target choice list elements, value set elements) with the intent of the implementation guide/profile authors.  Already, discussions and proposals on the ability to use \"must support\" on the various elements of an attribute have started and we expect other methodological and tooling aspects to be addressed as well to fully enable implementation guide/profile authors to more precisely express their more nuanced intents.   After these updates are made available, implementation guide/profile authors should update their IGs accordingly.  </p>\n<p>In the meantime, considering that the underlying intent of the \"must support\" flag in the FHIR Core specification was not to assume a \"must support\" to be automatically applied to all its elements if unless there was specific guidance for each of the elements to provide more varied and flexible \"meaningful\" ways that the profile authors could use describing their intent, we recommend that any formal testing procedures should not automatically treat the \"must support\" flag by applying it the entire hierarchy of data below a flagged element; rather, testing procedures should aim to reflect the editorial intent behind these profiles, and in the absence thereof or having conflicting interpretations consider that the implementer has flexibility to choose which elements it can support.</p>",
        "id": 210462451,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600384176
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> :  considering the update I provided further, not in sync with Josh yet on clarity that is needed so suggest you review the latest.</p>",
        "id": 210521187,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600437229
    },
    {
        "content": "<p>I did not find any problem with your expanded text. I do however think we are marching in the wrong direction. I don't think the problem is in the FHIR Core, it clearly indicates that it applies to the element. I think the problem is more in US-Core where they have defined mustSupport to be something that causes the conflict.  It seems US-Core is the one 'implying' that mustSupport is something closer to mandatory. </p>\n<ul>\n<li>backbone elements seem strange to me to be marked mustSupport. I would be happy if that was defined in FHIR core as explicitly not allowed or as meaningless. But I guess an IG might be able to define something. Maybe I am just not thinking of a useful example.</li>\n<li>In IHE we use mustSupport only the same way we have used R2 in the past, if you have the data you must send it, and a recipient can't complain if data comes in that element. With that definition there is little misunderstanding.  We don't demand that you send all flavors of the element. We don't demand that you must persist what is received. Where a persisting requirement is needed, it is added to the element, not implied in mustSupport.</li>\n<li>That said, a profile can only apply mustSupport to an element, complex datatypes can NOT further be refined. So I can mark an element of type Attachment as mustSupport, but I can't profile the elements within Attachment. (This is a problem MHD has had with DocumentReference).  <strong> Did I hear there is an extension fix for this? </strong></li>\n<li>I  thus think the only thing the FHIR core can say is that the mustSupport definition defined within the IG applies to the 'element'. Thus the IG must be more clear about what that mustSupport means within that element and especially with complex datatypes.</li>\n</ul>",
        "id": 210525339,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600438934
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> : This is a two-way topic: FHIR Core and US Core, so I would not consider this thread the wrong direction, rather that it is incomplete without the US Core discussion which is a different thread.  That is being pursued already with Cross-Project Group/US Core as well so they are not just focusing on next version, but also provide similar guidance as we are doing here for FHIR Core.  Both clarifications are needed: what did FHIR Core allow/intent/working to enable, what does US Core consider intent until their next version is in place to avoid variant expectations that have not been reconciled.</p>",
        "id": 210526066,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600439225
    },
    {
        "content": "<p>mustSupport on backbone elements is totally sensible.  If Patient.contact is mustSupport, then you're expected to handle the contacts of the patients.  If not, you're not.  Backbone and data type elements work exactly the same way.  </p>\n<p>Recipients can't complain about the inclusion of <em>any</em> element that isn't max=0.  The behavior of mustSupport is going to vary by use-case.  If the focus is decision support, then you care about inclusion of the value in the assessment.  If the use-case is storage, then that's going to be part of mustSupport.  One of the challenges for U.S. Core is that it has two different scopes - US Baseline (which should be cautious about declaring mustSupport anywhere, and where the meaning is going to be quite loose) and meaningful use regulations related to EHRs - where setting expectation on storage is wholely reasonable</p>\n<p>Complex data types can <em>absolutely</em> be further refined.  Profiles do this all the time - and it's important to do</p>",
        "id": 210527036,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600439614
    },
    {
        "content": "<p>I have IGs where I walk into data types purely to assert mustSupport of components</p>",
        "id": 210527142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600439646
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179192-fmg/topic/call.20on.20now/near/210527142\">said</a>:</p>\n<blockquote>\n<p>I have IGs where I walk into data types purely to assert mustSupport of components</p>\n</blockquote>\n<p>well, I did say that I thought there was a way.. so, how?</p>",
        "id": 210551658,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600450491
    },
    {
        "content": "<p>Same way you walk into data types to constrain cardinality or vocabulary bindings or anything else.  Just declare the relevant path in your profile.  E.g. Patient.contact.name.first</p>",
        "id": 210552422,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600450916
    },
    {
        "content": "<p>duh, and I have done that. I need a vacation...</p>",
        "id": 210553339,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600451376
    },
    {
        "content": "<p>Are we o.k. with the latest text from an FMG perspective that I posted?  Then that needs to start to flow to FHIR-I/MnM/(Conformance)/TSC.  Separately a discussion needs to progress with CPG/US Core.  I already am engaged there to progress that topic and needed the FMG direction reasonably solid to then put the rest in place to clarify how to interpret MustSupport in US Core until the next version is available.</p>",
        "id": 210557717,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600453541
    },
    {
        "content": "<p>I prefer the shorter and less specific text that I proposed, but I won't hold this up if others are on board with what Hans is suggesting.</p>",
        "id": 210734402,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600691837
    },
    {
        "content": "<p>I agree, it's lengthy. This seems to be the key piece to testers: </p>\n<blockquote>\n<p>should  not automatically treat the \"must support\" flag by applying it the entire hierarchy of data below a flagged element</p>\n</blockquote>\n<p>Next question after this is approved is which elements did the authors intend systems support. For US Core, I am certain <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>/I/other US Core Participants didn't intend systems  support only one (i.e. Observation.valueString)</p>",
        "id": 210737972,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1600693687
    },
    {
        "content": "<p>I agree with the essence and key piece.  The reason I prefer the longer text is to provide better context to the interpreters that took a different view to understand the problem and challenges.  So open to ensure the essence stands out.  We've seen that less words have lead to a wrong interpretation, and from prior IG used for certification testing, assertions, and surveillance, absence of clear tooling/syntax to describe what's optional, required, required but can be empty, etc., or where the condition is not computable, require more words to explain what the real intent is.</p>",
        "id": 210743364,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600696219
    },
    {
        "content": "<p>I'm ok with either</p>",
        "id": 210750420,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600699151
    },
    {
        "content": "<p>Where/when will this be discussed set?</p>",
        "id": 210750568,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1600699213
    },
    {
        "content": "<p>Presume the FMG session on Thur.  (2 Eastern)</p>",
        "id": 210750649,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600699254
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>  Would you be willing to post where you expect to present/discuss new must support language? It seem like this may be covered in more than one work group!</p>",
        "id": 210752467,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1600699954
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> : Absolutely.  Only way to have something to shape.  May share it with you first though to make sure we covered all bases perspectives as components of the write-up.</p>",
        "id": 210762031,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600703944
    },
    {
        "content": "<p>why can't FMG limit this to a single workgroup?  Is terribly inefficient and frankly a waste of a lot of people's time to split over 3-4 WGs</p>",
        "id": 210773609,
        "sender_full_name": "Eric Haas",
        "timestamp": 1600709372
    },
    {
        "content": "<p>FMG has no ability to keep people from talking about stuff.  MnM has authority over methodology changes and FMG has authority over technical corrections.</p>",
        "id": 210775574,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600710320
    },
    {
        "content": "<p>After input/discussion with Josh and Brett, a latest version is here on a confluence page: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=91989782#MustSupportClarifications-DRAFT\">https://confluence.hl7.org/pages/viewpage.action?pageId=91989782#MustSupportClarifications-DRAFT</a>.  The amount of wording somewhere between where Josh and I were heading respectively and Brett's input helped get us somewhere inbetween that might work for everybody.</p>",
        "id": 210876042,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600784251
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : What is a good time to review the latest draft with FHIR-I to ensure they are in agreement with the summary?  While I have the sense that other than wordsmithing you are o.k., should we further review with FHIR-I?</p>",
        "id": 210921541,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600803852
    },
    {
        "content": "<p>I thought we were drafting language for FMG or to support a letter from Wayne. I may have misunderstood the process though ;-)</p>",
        "id": 210927623,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600806807
    },
    {
        "content": "<p>Correct, so the language linked represents the proposed language that includes FMG's perspective discussed so far with examples from a US Core perspective to help clarify that then can be proposed to TSC/Wayne to be formalized.  Just what is in the Draft section, not what is above as that is old material where we started in FMG.  We also talked about needing input from other groups as well, particularly MnM and FHIR-I from a FHIR Core perspective, and CPG/US Core from a profile perspective to make sure we don't over/under state and that US Core examples that clarify where the interpretation variances have come up, before forwarding it to TSC to then finalize with Wayne.</p>",
        "id": 210932418,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1600809477
    },
    {
        "content": "<p>Call should be on now, but Whova is hanging on me...</p>",
        "id": 211168351,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600970541
    },
    {
        "content": "<p>Ditto.</p>",
        "id": 211168386,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600970557
    },
    {
        "content": "<p>I finally managed to log in and Whova tells me no meetings:</p>\n<p><a href=\"/user_uploads/10155/lkr_hPIOFsP4IZydUl13uftv/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/lkr_hPIOFsP4IZydUl13uftv/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/lkr_hPIOFsP4IZydUl13uftv/image.png\"></a></div>",
        "id": 211168410,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600970566
    },
    {
        "content": "<p><del>Can we use our <a href=\"https://zoom.us/j/865863526\">regular weekly Zoom meeting coordinates</a> instead?</del></p>",
        "id": 211168455,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600970589
    },
    {
        "content": "<p>Made it in now. The audio is causing problems though!</p>",
        "id": 211168918,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600970787
    },
    {
        "content": "<p>Two <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> users with feedback</p>",
        "id": 211168941,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600970798
    },
    {
        "content": "<p>whova browser is puking; in contact with whova support</p>",
        "id": 211169063,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1600970865
    },
    {
        "content": "<p>call on now</p>",
        "id": 211812588,
        "sender_full_name": "David Hay",
        "timestamp": 1601496166
    },
    {
        "content": "<p>Call on now</p>",
        "id": 212612116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602101016
    },
    {
        "content": "<p>Call on now</p>",
        "id": 214106806,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603310466
    },
    {
        "content": "<p>and on now!</p>",
        "id": 214890062,
        "sender_full_name": "David Hay",
        "timestamp": 1603915287
    },
    {
        "content": "<p>Can somebody let me in on the call?</p>",
        "id": 214894461,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1603917535
    },
    {
        "content": "<p>Or is there no meeting today?</p>",
        "id": 214894635,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1603917619
    },
    {
        "content": "<p>We just finished.</p>",
        "id": 214894683,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603917654
    },
    {
        "content": "<p>Ahh, that explains it.   Thank you!</p>",
        "id": 214894715,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1603917672
    },
    {
        "content": "<p>We're on now - almost qurate</p>",
        "id": 217196356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605733400
    },
    {
        "content": "<p>we've got no co-chairs?</p>",
        "id": 218619361,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1606943025
    },
    {
        "content": "<p>Call on now</p>",
        "id": 218619458,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606943057
    },
    {
        "content": "<p>Call on now</p>",
        "id": 219397055,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607547662
    },
    {
        "content": "<p>Should be on in 1-2 min.</p>",
        "id": 219397100,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1607547681
    },
    {
        "content": "<p>Use link from Whova</p>",
        "id": 224406879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611874884
    },
    {
        "content": "<p>Call on now</p>",
        "id": 225907193,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612990912
    },
    {
        "content": "<p>regrets from me, I have IHE virtual-face-to-face</p>",
        "id": 226724502,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613595566
    },
    {
        "content": "<p>Call on now</p>",
        "id": 226724971,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613595728
    },
    {
        "content": "<p>Call on now</p>",
        "id": 227672360,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614200640
    },
    {
        "content": "<p>Call on now</p>",
        "id": 228667578,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614805330
    },
    {
        "content": "<p>Still going, or already done?  If still going, I'm in the waiting room.</p>",
        "id": 228676848,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1614809053
    },
    {
        "content": "<p>We ended at the 30min mark</p>",
        "id": 228676880,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614809068
    },
    {
        "content": "<p>Okido.  Then I'll leave the waiting room.  Thank you!</p>",
        "id": 228676904,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1614809086
    },
    {
        "content": "<p>call on now</p>",
        "id": 242935414,
        "sender_full_name": "David Hay",
        "timestamp": 1623873910
    },
    {
        "content": "<p>I'm going to have a day job conflict -- let me know if we're under quorum?</p>",
        "id": 242936241,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623874301
    },
    {
        "content": "<p>Wow we have a crowd</p>",
        "id": 242939170,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623875668
    },
    {
        "content": "<p>Call on now</p>",
        "id": 243704811,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624478527
    },
    {
        "content": "<p>Call on now</p>",
        "id": 244479486,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625083231
    },
    {
        "content": "<p>call on now</p>",
        "id": 245234737,
        "sender_full_name": "David Hay",
        "timestamp": 1625688142
    },
    {
        "content": "<p>It looks like I'll only be able to join the 2nd half of today's call.</p>",
        "id": 246009009,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626291411
    },
    {
        "content": "<p>Call on in a couple of minutes. (Just wanted to beat Lloyd...)</p>",
        "id": 246011739,
        "sender_full_name": "David Hay",
        "timestamp": 1626292705
    },
    {
        "content": "<p>As in 'now' :)</p>",
        "id": 247509538,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627502366
    },
    {
        "content": "<p>Need one more for quorum</p>",
        "id": 247510205,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627502673
    },
    {
        "content": "<p>If you let me know who's missing, I can change my name in Zoom  ;-P</p>",
        "id": 247511061,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1627503111
    },
    {
        "content": "<p>my regrets today, day-job conflict.</p>",
        "id": 248378864,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628096984
    },
    {
        "content": "<p>call on now</p>",
        "id": 248401354,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628107508
    },
    {
        "content": "<p>Call on now</p>",
        "id": 249162233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628712247
    },
    {
        "content": "<p>Call on now</p>",
        "id": 249904181,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629316891
    },
    {
        "content": "<p>call on now - again!</p>",
        "id": 250674316,
        "sender_full_name": "David Hay",
        "timestamp": 1629921653
    },
    {
        "content": "<p>Call on now</p>",
        "id": 250674368,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629921688
    },
    {
        "content": "<p>Call on now</p>",
        "id": 251619896,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630526380
    },
    {
        "content": "<p>my regrets today, day-job conflict.</p>",
        "id": 252496284,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631120468
    },
    {
        "content": "<p>Call on now</p>",
        "id": 252523449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631131269
    },
    {
        "content": "<p>for sure...</p>",
        "id": 270456787,
        "sender_full_name": "David Hay",
        "timestamp": 1643835709
    },
    {
        "content": "<p>Call on now</p>",
        "id": 272178067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645045369
    },
    {
        "content": "<p>call on now...</p>",
        "id": 273010968,
        "sender_full_name": "David Hay",
        "timestamp": 1645650111
    },
    {
        "content": "<p>Call on now</p>",
        "id": 273875876,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646254762
    },
    {
        "content": "<p>Call on now</p>",
        "id": 274751646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646859609
    },
    {
        "content": "<p>Call on now</p>",
        "id": 275569237,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647460810
    },
    {
        "content": "<p>Call on now</p>",
        "id": 276391669,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648065716
    },
    {
        "content": "<p>Call on now</p>",
        "id": 277198070,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648670548
    },
    {
        "content": "<p>call on now</p>",
        "id": 278078301,
        "sender_full_name": "David Hay",
        "timestamp": 1649275335
    },
    {
        "content": "<p>From discussion just now (<span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>) <a href=\"#narrow/stream/179238-Zulip/topic/Mark.20as.20resolved.20changes.20URL.20of.20topic/near/251489567\">https://chat.fhir.org/#narrow/stream/179238-Zulip/topic/Mark.20as.20resolved.20changes.20URL.20of.20topic/near/251489567</a> has context on this bug about topic links breaking when names change; <a href=\"https://github.com/zulip/zulip/issues/15290\">https://github.com/zulip/zulip/issues/15290</a> is the tracking issue</p>",
        "id": 278084659,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649278437
    },
    {
        "content": "<p>Or now: <a href=\"https://github.com/zulip/zulip/issues/21505\">https://github.com/zulip/zulip/issues/21505</a></p>",
        "id": 278084745,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649278457
    }
]