[
    {
        "content": "<p>What was the FMG decision on changing the deadlines for publishing?  If a decision has been made, is it going to be announced?</p>",
        "id": 153856983,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479222246
    },
    {
        "content": "<p>Ballot dates:<br>\nFeedback was varied. Still have to do a frozen version for Connectathon. Paul asks if we could move to 12/4. Grahame asks what content is going to ballot. IG on DAF; FHIR profiles on CCDA, Infobutton, pharmacy medication; FHIR repository process and requirements. Grahame doesn't think we can move from the 27th for the content that is in the ballot, but we could compromise on the content that is not in the ballot. Resources that are included in the ballot will freeze on 11/27; resources that are not in the ballot will freeze on 12/4.<br>\nMOTION to move the publication date for STU 3 from December 31st into roughly February: Paul/Brian Post<br>\nVOTE: all in favor</p>",
        "id": 153857120,
        "sender_full_name": "David Hay",
        "timestamp": 1479281012
    },
    {
        "content": "<p>Ok.  So are you and I supposed to announce that or is Grahame going to?  Also, what does it mean that we can't move from the 27th the content that is in the ballot?  Does that mean no changes to resources used in ballot IGs after Dec. 4th?  (That would probably be problematic.)</p>",
        "id": 153857128,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479282796
    },
    {
        "content": "<p>The resources which are used in IGs to be ballot this cycle will be frozen on the 27th to allow the IG authors to complete their materials for inclusion in the ballot. The full specification will be frozen on Dec 4 for the ballot and Connectathon but the continuous build will be open shortly thereafter to continue the development of STU materials in advance of the Feb cut off for publication.</p>",
        "id": 153857129,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479283088
    },
    {
        "content": "<p>ok.  That's what had previously been discussed.  Who should announce?</p>",
        "id": 153857130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479283147
    },
    {
        "content": "<p>FMG chairs I think.</p>\n<p>The question of changing resources which are used in IGs in ballot - during the ballot - is an interesting one. Typically you wouldn't do that as you have the problem of showing balloters one thing but having in the system another. However, this can be useful to illustrate solutions to found issues or new considerations. <br>\nWhat matters fundamentally is that there are tracker items or ballot comments which detail the  issue and committee decisions whose result(s) support the change(s) which ultimately appear(s) in the current build. Those committee decisions should probably not occur prior to the close of the ballot so to not prejudge the process.</p>",
        "id": 153857131,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479283228
    },
    {
        "content": "<p>The ballots are on the IGs, not the resources.  I don't think we can (or should) constrain the WGs from updating the resources while the IG ballot is open.</p>",
        "id": 153857136,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479284452
    },
    {
        "content": "<p>Given that the motion didn't identify specific dates, shall I announce the ones we'd discussed previously?  Resource substantive freeze Feb. 19, total freeze Feb 26, publish mid/late March after a QA period and updates?</p>",
        "id": 153857137,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479284527
    },
    {
        "content": "<p>I don't think we want to announce a schedule change without specifying dates.</p>",
        "id": 153857138,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479284543
    },
    {
        "content": "<p>yes</p>",
        "id": 153857148,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479286484
    },
    {
        "content": "<p>\"Yes\" = announce with the dates I listed above?</p>",
        "id": 153857213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479294571
    },
    {
        "content": "<p>\"The ballots are on the IGs, not the resources.\" Well the IGs certainly aren't independant of the resources they are implementing, so while the WG can make substantive changes to the resources while they are in ballot they make it more difficult to assert 'peer review' and to resolve ballot items, not impossible but potentially more difficult. For example, if a resource is changed during the ballot such that a ballot comment is no longer persuasive you couldn't judge it non-persuasive because it no longer applies.</p>",
        "id": 153857221,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479295886
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> But that problem doesn't change whether the resource is updated during or after the ballot.  (And it's actually easier on the IG reconcilers if the change is made prior to reconciliation rather than after.)</p>",
        "id": 153857225,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479296835
    },
    {
        "content": "<p>The concern is not the buden placed on reconcilers but the integrety of the process and the ballot comment of the ballotor in the context of the material they were reviewing.</p>",
        "id": 153857228,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479297052
    },
    {
        "content": "<p>I don't understand this discussion about changing resources during ballot. Are we talking about changing in trunk, or in the ballot fork?</p>",
        "id": 153857230,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479297144
    },
    {
        "content": "<p>Current build, not the ballot site.</p>",
        "id": 153857232,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479297231
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> still need confirmation on the meaning of your \"yes\"</p>",
        "id": 153857235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479297308
    },
    {
        "content": "<p>then I don't understand why we don't allow changes  to current build</p>",
        "id": 153857238,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479297762
    },
    {
        "content": "<p>yes to the dates we agreed previosuly</p>",
        "id": 153857239,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479297780
    },
    {
        "content": "<p>We do allow changes to the current build, no one has said we wouldn't.</p>",
        "id": 153857240,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479297865
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> You were implying that we would limite changes to the current build while the ballot was open for resources referenced by balloted IGs.  I'm arguing (and believe Grahame agrees) that there should be no such limitation - that as soon as the ballot is published, the freeze is removed and anyone can change anything they like that's supported by a tracker item with an objective of getting as many of the changes applied as possible before the WGM.  (And IG reconcilers can choose how much reconciliation they're going to bother to conduct while the resources are still undergoing change.)</p>",
        "id": 153857242,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479298047
    },
    {
        "content": "<p>Actually Lloyd, you were the one who previously stated when we discussed extending the STU publication date that WGs should not make substantive changes to the resources after the WGM in response to my comment that the extension would give time for further face to face review.</p>\n<p>My comments here are to advise caution in making changes to material when that material is in ballot as it makes the reconciliation difficult and the assertion that the peers have reviewed 'the material' potentially questionable.</p>",
        "id": 153857243,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479298325
    },
    {
        "content": "<p>My assertion about changes after the WGM was based on a belief that we should be trying to get as much changed as possible before then.</p>\n<p>So I will announce the following:<br>\nNov. 27- Ballot substantive resource freeze (prioritize resources that IGs will be based on)<br>\nBallot total freeze - Dec. 4<br>\nDec. 9 (or a day or two earlier) - Freeze released - all changes allowed<br>\nFeb. 19 -  Publication substantive resource freeze<br>\nFeb 26 - Publication total freeze</p>\n<p>Holler if anyone has any concerns</p>",
        "id": 153857248,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479301015
    },
    {
        "content": "<p>What I don't see is deadline for STU3 ballot reconciliation. It was Feb 20th before; where is it now? The schedule you you have, as I read it, is simply a freeze of activity for a period starting Nov 27.  Or is the STU3 reconciliation deadline the Feb 19th?</p>",
        "id": 153857251,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479301909
    },
    {
        "content": "<p>True.  We need time to ask for withdrawals.  Is Feb. 5 reasonable?  (Most, if not all, reconciliation should be complete prior to the end of the WGM)</p>",
        "id": 153857252,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479302123
    },
    {
        "content": "<p>It would also be good for us to explain which Resources are important to be stable in this frozen version; thus which are not critical (e.g. Consent.. just guessing).</p>",
        "id": 153857253,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479302130
    },
    {
        "content": "<p>I'll include Grahame's list for the priorities to work on first - we won't ask they be stable, but will ask WGs to tackle those ones first.</p>",
        "id": 153857254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479302189
    },
    {
        "content": "<p>I am comfortable with this. My questions are intended to help drive a clear communication message.</p>",
        "id": 153857255,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479302292
    },
    {
        "content": "<p>Here's my proposed email:</p>",
        "id": 153857259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479304493
    },
    {
        "content": "<p>Based on feedback from HL7 work groups and after generally positive feedback from the implementer community, the FMG has decided to change the timelines for publication of STU 3 to ensure opportunity to complete ballot reconciliation, workflow alignment and progress up the FMM maturity curve.</p>\n<p>That said, the original deadlines for ballot freeze remain to meet the needs of those implementation guides which are balloting in the Dec/Jan cycle.</p>\n<p>Over the next 2.5 weeks, work groups are asked to prioritize the application of substantive changes to the following resources which will be used by IGs balloting in the January ballot:</p>\n<p>AllergyIntolerance, CarePlan, CareTeam, Composition, Condition, Device, DiagnosticReport, Goal, GuidanceResponse, Immunization, Location, Medication, MedicationAdministration, MedicationDispense, MedicationOrder, MedicationStatement, Observation, Organization, Patient, Practitioner, Procedure, ServiceDefinition</p>\n<p>Timelines for the revised cycle are as follows:<br>\nSun. Nov. 27- Ballot substantive resource freeze (prioritize resources that IGs will be based on)<br>\nSun. Dec. 4 - Ballot total freeze - Dec. 4<br>\nSun. Dec. 9 (or a day or two earlier) - Freeze released - all changes allowed<br>\nSun Feb. 5 - Ballot reconciliation deadline - All ballot comments must be reconciled, tracker issue report must be clean<br>\nSun. Feb. 19 - Publication substantive resource freeze<br>\nSun. Feb 26 - Publication total freeze<br>\nMon. Feb 27 - QA period opens<br>\nTue. Feb 28 - FMM QA spreadsheet updated for all WG resources<br>\nSun. Mar. 13 - QA period closes<br>\nSun. Mar. 20 - All QA applied<br>\n\"following week\" STU 3 is published</p>\n<p>All dates represent end-of-day Eastern time, though a few hours of wiggle room may be granted by request on the committer's chat.</p>\n<p>If there are any questions about this revised timeline, please let us know or ask your FMG liaison.</p>\n<p>Lynn, can you please update the publishing calendar to reflect the above dates?</p>\n<p>Lloyd McKenzie &amp; David Hay<br>\nFMG co-chairs</p>",
        "id": 153857260,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479304495
    },
    {
        "content": "<p>Feedback welcome</p>",
        "id": 153857261,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479304509
    },
    {
        "content": "<p>The sentence starting \"That said...\" I think should be changed to \"However, in order to support Implementation Guides that are balloting in Dec/Jan cycle, we need to prioritize substantive changes to the Resources these implementation guides utilize. \"</p>",
        "id": 153857263,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479305033
    },
    {
        "content": "<p>Any reason that 'Dec.4' is repeated twice in this line: \"Sun. Dec. 4 - Ballot total freeze - Dec. 4\" ?<br>\notherwise fine...</p>",
        "id": 153857302,
        "sender_full_name": "David Hay",
        "timestamp": 1479312271
    },
    {
        "content": "<p>Both fixed.  Any other comments before I send it out?</p>",
        "id": 153857303,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479312534
    },
    {
        "content": "<p>works for me</p>",
        "id": 153857305,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479313770
    },
    {
        "content": "<p>Looks good.</p>",
        "id": 153857306,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1479313891
    },
    {
        "content": "<p>Dates look fine by me.</p>",
        "id": 153857500,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1479380775
    }
]