[
    {
        "content": "<p>Just a question, what's the difference between Fhir Chat vs. Fhir Community? Does one reflect messages on the other? Are they distinct? I want to understand the basic purpose behind each so I can advise internal (KP) resources where it is appropriate to post questions. Thanks.</p>",
        "id": 153886471,
        "sender_full_name": "Brian Pech",
        "timestamp": 1493501158
    },
    {
        "content": "<p>The FHIR chat is much more dynamic (and more likely to get answered quickly).  The FHIR community has more persistence and is theoretically more easily discoverable.  However, given that it's not cleaned/filtered, that's not necessarily a benefit.</p>",
        "id": 153886473,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493507226
    },
    {
        "content": "<p>To be honest, I'm not sure that the FHIR Community adds a whole lot.</p>",
        "id": 153886474,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493507242
    },
    {
        "content": "<p>At this point in time I think the chat is more useful than the community. But as we get more maturity to the specification, then the community will result in a more FAQ like library. Chat is hard to use as a FAQ like library (hard, not impossible).</p>",
        "id": 153886491,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493565608
    },
    {
        "content": "<p>I think it'll only work as a FAQ-like library if there's some degree of curation to remove chaff.  So far, we don't have the resources to manage that</p>",
        "id": 153886564,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493656993
    },
    {
        "content": "<p>Vote up/down by the community usually can automate that. Does this tool have that?</p>",
        "id": 153886572,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493659402
    },
    {
        "content": "<p>yes</p>",
        "id": 153886591,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1493672547
    },
    {
        "content": "<p>sometimes we get discussions on chat that are worthy of a pushbutton push over to the community... No need to reformat or anything, but I think they should be copied to assure readability and persistence.</p>",
        "id": 153886611,
        "sender_full_name": "John Moehrke",
        "timestamp": 1493674543
    }
]