[
    {
        "content": "<p>I think we need to have a discussion on why we can't have a normative IG (tied to a specific version of FHIR) with base resources that aren't normative.</p>",
        "id": 159018050,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1550699191
    },
    {
        "content": "<p>it will be a fun discussion. in principle, we don't allow artefacts to have a higher standards status than their dependencies.</p>",
        "id": 159018098,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550699253
    },
    {
        "content": "<p>But.... IGs are a little different because they can have an orthogonal version path.</p>",
        "id": 159018200,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550699310
    },
    {
        "content": "<p>but there's an element of prophecy at play there</p>",
        "id": 159018216,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550699333
    },
    {
        "content": "<p>Yes, that is my thought process, and it is locked to the specific version of FHIR.</p>",
        "id": 159018239,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1550699353
    },
    {
        "content": "<p>When we declare something is normative, we're promising certain behavior about backwards compatibility.  It's pretty much impossible to make that commitment if the underlying resources aren't normative.  Even if a particular version of the IG is locked to a single version of FHIR, the normative statement extends to future versions of the IG based on future versions of FHIR.</p>",
        "id": 159019553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550700288
    },
    {
        "content": "<p>if they will come to exist. That's where the prophecy aspect comes into play</p>",
        "id": 159020030,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550700697
    },
    {
        "content": "<p>If there's a risk of them existing and there's a risk of change, we can't promise to never have change</p>",
        "id": 159021403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550701897
    },
    {
        "content": "<p>not at HL7 level. At US level, I'm not so sure</p>",
        "id": 159021467,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550701933
    },
    {
        "content": "<p>An IG based on STU3, the base WILL never change.</p>",
        "id": 159034988,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1550717001
    },
    {
        "content": "<p>R4 would be another version of the Guide - with its own path.</p>",
        "id": 159035002,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1550717028
    },
    {
        "content": "<p>operationally, my experience (I have some now) is that people change their minds about the base version when they come to do the next version</p>",
        "id": 159035076,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550717090
    },
    {
        "content": "<p>but I don't believe we have an iron statement that normative IGs must be forward compatible, like we do with the base specification</p>",
        "id": 159035095,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550717115
    },
    {
        "content": "<p>Everything we publish will never change.  (because it's too hard to even fix typos :&gt;)  That doesn't make the content \"normative\".  I'm not in favor of declaring things normative just because people want to point to them with regulation.  It becomes normative when it meets the criteria - underlying content is normative, in production in a sufficient number of places and has been out in the wild for a sufficient length of time.  I think those criteria are defensible and useful and we diverge from them at significant peril.</p>",
        "id": 159042571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550727441
    },
    {
        "content": "<p>The general rule should be strongly against a normative specification built on non-normative content. This rule is common among all standards efforts. It is this way for all the reasons Lloyd points out. One does not build a tall building on sand. But you will also find that this rule has exception pathways where the group responsible for the content can declare that specific factors make it a valid decision to call their specification normative. This is a step of taking on the risk when that underlying standard changes. This is a step that is not taken lightly, meaning the governance should make it hard to do but it should be possible.  This is the current discussion within IHE. IHE has always had a requirement that an IHE Profile can't go to normative state until the underlying standards are normative. This strong governance gets the community that wants normative, to focus their efforts on getting that underlying standard to normative state. This helps everyone.</p>",
        "id": 159068020,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550756529
    },
    {
        "content": "<p>One of the very important factors is that once an Implementation Guide goes normative, it can't be broken. This means it must always be used with the non-normative underlying content. The only happy-path is if the underlying standard goes normative without any breaking changes. But if that underlying standard goes normative with breaking changes, then the implementation guide must stick with the old.   Thus a NEW Implementation Guide could be written on the normative underlying standard... They are thus two different normative IG.</p>",
        "id": 159068845,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550757269
    },
    {
        "content": "<p>i think that's a good summary</p>",
        "id": 159104210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550783053
    }
]