[
    {
        "content": "<p>The survey included these comments from implementers:</p>",
        "id": 153825703,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462727257
    },
    {
        "content": "<p>The list of resources is expanding with each new release without sufficient testing and implementations of those already well-defined. Protocol? Implementation Guide? Are you kidding? This thing is creeping into v3 land.<br>\nImplementing \"Privacy Consent\" as a \"Contract\", very painful and confusing.<br>\nI'd like to see the patient record become more mature. The rest of the workflow, scheduling, tasking, orders, blah blah blah can wait. I think the priority should be the production exchange of FHIR patient records (Patient, Condition, Observation, Immunization, Allergies, MedicationStatement, Procedures, Encounters) along with minimum associated technical requirements (Bundle, Conformance). Everything else is gold-plate.<br>\nConsent<br>\nA cross functional group of developers joined ranks to submit this survey, to represent as an organization those Resources which would be most useful to us<br>\n14 business and technical individual participated in completing this survey. We hope to have our organization, Cambia Health Solutions, take a more active role and join a number of working groups in the 2016</p>",
        "id": 153825704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462727260
    },
    {
        "content": "<p>Contract/Privacy Consent is generating lots of comments from implementers for me </p>",
        "id": 153825705,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462727292
    },
    {
        "content": "<p>The other two comments are about scope. Our scope is not limited to 'the patient record', nor do we need to hold off introducing things just because other things haven't achieved maturity. </p>",
        "id": 153825706,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462727370
    },
    {
        "content": "<p>what can we do to encourage the patient record to be more mature'? </p>",
        "id": 153825707,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462727417
    }
]