[
    {
        "content": "<p>We don't state anywhere (that I can find) that <a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a> is not to be used for blatant marketing.  I thought HL7 had a policy on the GOM that applied to the listserves but I can't find that either.  Should we add somthing to  <a href=\"http://wiki.hl7.org/index.php?title=Chat.fhir.org_community_expectations\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Chat.fhir.org_community_expectations\">http://wiki.hl7.org/index.php?title=Chat.fhir.org_community_expectations</a>?</p>",
        "id": 153997010,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536935411
    },
    {
        "content": "<p>We should. I don't think the standard is \"blatant\" though. And for example if someone wanted to advertise a FHIR conference, we'd probably think that was fine... even if there was a registration fee. Is there a clear line to draw?</p>",
        "id": 153997046,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536941418
    },
    {
        "content": "<p>We're fine with information sharing \"This event is happening\", \"A new version of this product is available\" but it should be a single post and should be factual in its framing.  Not sure about service offerings though.</p>",
        "id": 153997049,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536941720
    },
    {
        "content": "<p>Maybe a dedicated thread?</p>",
        "id": 153997050,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536941729
    },
    {
        "content": "<p>Some of this seems totally appropriate for existing announcements thread. I wouldn't want to say that conference announcements needed to happen somewhere else.</p>",
        "id": 153997077,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536947839
    },
    {
        "content": "<p>Agree that events and new product releases are fine on the submitters channel.  I was thinking more about requests for service/advertisement of availability for service.  Though perhaps that should be handled through FHIR Foundation?</p>",
        "id": 153997078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536948498
    }
]