[
    {
        "content": "<p>Is there a mechanism that FMG could create that would enable outside organizations to provide evidence of a Resource maturity (a) Implementation Guides they have written on specific resources, (b) Testing events, (c) Known implementations, etc?<br>\nExample would be IHE has almost 40 implementation guides and IHE-Connecathon event that tests to these, this knowledge is not easy to funnel to the right Resource owning workgroup. <br>\nI expect regions and other organizations have similar <br>\nIt is in the interest of these outside organizations to encourage the maturity elevation. Where there is already well understood methods to report bugs, reporting success is not.</p>",
        "id": 240459316,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622118732
    },
    {
        "content": "<p>similar tool could be used by Vendors and Organizations to express their use evidence toward maturity.</p>",
        "id": 240459371,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622118764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> gave me an interesting proposal for this to use the Jira ticket. So I did this for DocumentReference related to IHE efforts on MHD  <a href=\"https://jira.hl7.org/browse/FHIR-32789\">https://jira.hl7.org/browse/FHIR-32789</a></p>",
        "id": 240459450,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622118806
    },
    {
        "content": "<p>This method does not seem right, but did offer a method.</p>",
        "id": 240462167,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622120095
    },
    {
        "content": "<p>This came up in our session yesterday with pharmacy and BR&amp;R as a pain point for co-chairs, who often feel pressure from outside groups to move resources of the maturity scale but do not themselves have the information necessary to get there. Providing outside groups with a clear channel for this kind of reporting could esse this burden</p>",
        "id": 240468656,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622122826
    },
    {
        "content": "<p><a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=113673765#FHIRInfrastructureMinutesWGM202105-WedQ3-FMGupdate-BR&amp;R,Pharm\">https://confluence.hl7.org/pages/viewpage.action?pageId=113673765#FHIRInfrastructureMinutesWGM202105-WedQ3-FMGupdate-BR&amp;R,Pharm</a> includes notes on this discussion about these requirements and the challenges that co-chairs face in meeting them (\"requirements we're expected to fill in as part of the maturity process...\")</p>",
        "id": 240469170,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622123040
    },
    {
        "content": "<p>I think it would be a nice feature of the IG-Registry that it provide a simple report laid out similar to the FHIR Core, but indexing for each FHIR Resource the Implementation Guides that are profiling that Resource.   This would be helpful to workgroups for maturity knowledge. This would also be useful to those looking to create \"new\" implementation guides, to possibly learn their problem has already been solved. This could also be used by those looking for  an Implementation Guide.</p>",
        "id": 240470680,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622123664
    },
    {
        "content": "<p>I think that ConMan did this... would be nice if it was more up-front. (no disrespect to conman)</p>",
        "id": 240470760,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622123701
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> it is hard to find</p>",
        "id": 240471188,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622123882
    },
    {
        "content": "<p>but we need more feedback than that - actually implementer info</p>",
        "id": 240471265,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622123902
    },
    {
        "content": "<p>This might actually be a useful purpose for the 'comment' Jira issue type.  Could come about testing, could also come about implementations.  Alternative is an ongoing survey that captures details</p>",
        "id": 240472028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622124205
    },
    {
        "content": "<p>that is what I did.. comment type.</p>",
        "id": 240473227,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622124638
    },
    {
        "content": "<p>Well, there's a separate tab for IG's, and a tab on the testing that shows tests against an IG - but it depends on the users adding test results into conman - and we only had 83 test results in total...</p>",
        "id": 240551763,
        "sender_full_name": "David Hay",
        "timestamp": 1622165012
    },
    {
        "content": "<p>Was that what you were referring to <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?</p>\n<p>Happy to look at anything else I can do to surface this stuff...</p>",
        "id": 240551823,
        "sender_full_name": "David Hay",
        "timestamp": 1622165052
    },
    {
        "content": "<p>Or were you referring to the tab where you can list what resources a server exposes from their capabilityStatement??</p>",
        "id": 240551871,
        "sender_full_name": "David Hay",
        "timestamp": 1622165135
    },
    {
        "content": "<p>Ah - just re-read Johns original comment. Yes, on the servers tab there's a search tab that looks for resources. It's a simple list ATM, but a table view wouldn't be that hard to do...  If I did, it might be better to pull the list out of conman into a separate summary app...</p>",
        "id": 240553148,
        "sender_full_name": "David Hay",
        "timestamp": 1622166549
    }
]