[
    {
        "content": "<p>One of the committees has decided to change the name of an IG without discussing with either me or FMG. The name change has landed on <span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> with no warning, and the publishing framework has no support for this (you can't change the canonical URL, or at least doing so is endlessly painful) </p>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> can you please describe the history of this</p>",
        "id": 183969121,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576872919
    },
    {
        "content": "<p>This IG started out under CDS with the name \"Alerts\" - after review by several WG and FMG, it was felt that the IG is creating a pattern and thus should be sponsored by a methodology WG - so the sponsoring WG changed from CDS to INM, which resulted in a chnage in Steering Division. If I remember correctly it was during discussion at the SD that there was a strong feeling about changing alert to notification, as alert has a specific meaning to many people (from a device to medical personel), which is NOT what this IG is doing. So we agreed to change the name. I did not realize that that would result in a tooling issue - so my bad to not bing this up any sooner. I can offer to revert the name back to alerts for this ballot (though we don't have a WG call anymore to officially vote on this before the ballot opens) and then submit a ballot comment that it should be renamed to notifications - OR we can make a note to balloters, that we are aware of this issue, but due to tooling cannot change it at the moment?</p>",
        "id": 183974364,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1576876791
    },
    {
        "content": "<p>I can make this work (we've done it before moving from us to uv) but it means I publish and spend a couple of hours moving tings around by hand, and maintain this going forward.</p>\n<p>Also, the name as it was was approved by FMG and comes out of a unique space, so I think that FMG should approve name changes like this.</p>\n<p>Given this, I don't think that it's practical to deal with a name change right now</p>",
        "id": 183974835,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576877116
    },
    {
        "content": "<p>So should we add a note to balloters regarding that and revert the title back to alerts?</p>",
        "id": 183974994,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1576877274
    },
    {
        "content": "<p>I think so, but I'm looking for wider comment from FMG members</p>",
        "id": 183975912,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576877919
    },
    {
        "content": "<p>Agree it's something that should come to the FMG, but it's also something we haven't announced as policy previously.  Is this a publication request or a ballot request?  For the latter, old name is best.  For a publication request, it's more problematic.</p>",
        "id": 183983570,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576884479
    },
    {
        "content": "<p>It's for the DaVinci Alert ballot - so I will change the title back and add a note to balloters - ok?</p>",
        "id": 183983909,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1576884826
    },
    {
        "content": "<p>Can we just move the canonical base back to alerts,  Just like with Grahame it is a much bigger task for me to update every name and resource id from  Alerts to Notifications?  I could call the title:</p>\n<p>...<em>Notifications (aka Alerts)</em>... </p>\n<p>But we have been calling it Notifications since September, which will lead to mass confusion and make us look bush league.     </p>\n<p>TSC approved the name change BTW and this is something that came up before in other iGs like DEQM at the beginning... Changing names is something  we are prone to doing ... maybe we need a clear policy that the canonical and npm are <em>forever etched in stone once you name it</em>.</p>",
        "id": 183985977,
        "sender_full_name": "Eric Haas",
        "timestamp": 1576887061
    },
    {
        "content": "<p>You are the main author - so barring opposition from Grahame, I am fine with whatever you decide.</p>",
        "id": 183986154,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1576887298
    },
    {
        "content": "<p>Then there is the issue of an orphaned or Zombie Sept 2019 Ballot publication. It got pulled from ballot after we published it.  (  I don't have a first hand history of those events and obviously if i knew what was brewing we would not have published it.)</p>\n<p>I think the best options here is i can add the a description  with <strong>Deprecated</strong> in big bold letters in the ig-list.json for this version.</p>",
        "id": 183986438,
        "sender_full_name": "Eric Haas",
        "timestamp": 1576887606
    },
    {
        "content": "<p>I don't care what the human readable title is - call it whatever you want based on TSC agreement. What I care about is the canonical URL and package id</p>",
        "id": 183988922,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576891109
    },
    {
        "content": "<p>that can't change without specific manual work (each time is published ongoing) for me. And since the components of these are agreed by FMG out of a unique space, changes to these very much need FMG approval</p>",
        "id": 183988947,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576891184
    },
    {
        "content": "<p>definitely a note to balloters - minimize the changes at this point!</p>",
        "id": 183995560,
        "sender_full_name": "David Hay",
        "timestamp": 1576903834
    },
    {
        "content": "<p>OK  I'll let Lynn know when I've made the changes.. thanks.</p>",
        "id": 184014138,
        "sender_full_name": "Eric Haas",
        "timestamp": 1576941259
    },
    {
        "content": "<p>I recall that we (FMG) asked for this name change when we approved it... but that doesn't help the current problem.</p>",
        "id": 184108226,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577111665
    }
]