[
    {
        "content": "<p>We're having a problem with tasks that were re-opened for R4 after being deferred in the past. The problem is illustrated by the following advice on the wiki:</p>",
        "id": 153888653,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494333017
    },
    {
        "content": "<p>Note: If an item is associated with a ballot, it cannot be re-opened once the final disposition spreadsheet has been prepared for that ballot. (If a WG isn't sure, contact the FHIR Management Group) It's always possible to raise a new tracker item, but that item should reference the original and provide some new argument for re-visiting the decision.<br>\nItems that are marked as \"deferred\" will automatically be re-opened after a new release of the product has been published. (Deferred is never a 'final' resolution.)</p>",
        "id": 153888654,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494333023
    },
    {
        "content": "<p>these two sentences disagree with each other</p>",
        "id": 153888656,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494333044
    },
    {
        "content": "<p>the correct process is far from clear</p>",
        "id": 153888657,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494333072
    },
    {
        "content": "<p>can we please clarify this </p>",
        "id": 153888658,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494333076
    },
    {
        "content": "<p>Not being able to update \"deferred\" items would be very problematic.  We could get away with creating new trackers when re-opening other items, though enforcing this will be next to impossible.  We have a full history so we can always reconstitute.  So my preference is to have guidance that previous resolutions be moved into a comment so they're easily visible/discoverable, but to otherwise allow items to be re-opened/reactivated and changed.</p>",
        "id": 153888668,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494335232
    }
]