[
    {
        "content": "<p>As discussed at WGM. The use of the word \"Profile\" should be replaced with \"Implementation Guide\", or be coached carefully to express equivalence.  Right? This is what I understood as the conclusion. Thus here are a few places where \"Profile\" is used.</p>",
        "id": 153889963,
        "sender_full_name": "John Moehrke",
        "timestamp": 1494878113
    },
    {
        "content": "<p>-- wiki for Profile proposals</p>",
        "id": 153889964,
        "sender_full_name": "John Moehrke",
        "timestamp": 1494878133
    },
    {
        "content": "<p>-- FHIR specification, Red bar has \"Profile\" that goes to the <a href=\"http://build.fhir.org/profilelist.html\" target=\"_blank\" title=\"http://build.fhir.org/profilelist.html\">http://build.fhir.org/profilelist.html</a> </p>",
        "id": 153889965,
        "sender_full_name": "John Moehrke",
        "timestamp": 1494878175
    },
    {
        "content": "<p>did we discuss this?</p>",
        "id": 153890156,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495000319
    },
    {
        "content": "<p>Be quite a change...</p>",
        "id": 153890166,
        "sender_full_name": "David Hay",
        "timestamp": 1495005223
    },
    {
        "content": "<p>Not sure, It was not 'discussed' in any meeting I was in. But when I brought it up in Madrid, I was told that the use of \"Profile\" was discouraged, favoring \"Implementation Guide\". What I want to understand is what is the meaning of \"Profile\"? Is it exactly the same as \"Implementation Guide\"? If it is, then I don't think it is useful to have two phrases. If it is something else, then what? I ask because everywhere else in HL7 the term \"Implementation Guide\" is used, where in IHE the term \"Profile\" is used. The confusion comes when in FHIR people casually use the word Profile to mean any form of \"Constraints\". Mostly the confusion is when Profile is used at the ValueSet, or StructueDefinition, or OperationDefinition... alone. There is community confusion when it is a fragment of a \"Implementation Guide\" or \"Profile\".</p>",
        "id": 153890194,
        "sender_full_name": "John Moehrke",
        "timestamp": 1495025558
    },
    {
        "content": "<p>IHE's notion of \"profile\" definitely corresponds to FHIR's notion of \"Implementation Guide\".  However, the word \"profile\" does have meaning in FHIR.  We use it as a verb to describe the process of creating a conformance resource (typically a StructureDefinition, though others are possible) that constrains another conformance resource.  We also use it to refer to the StructureSefinitions that define such constraints.  </p>",
        "id": 153890208,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495032252
    },
    {
        "content": "<p>is it possible to not use \"Profile\" in those ways? I am doing my best to represent an interest IHE has in their long standing use of the word Profile... I am not arguing that it is invalid to use the english word profile as a verb (it is in general english terms not often used as a verb). I am simply pointing out a confusion that use causes in the readership of both FHIR and IHE; a confusion that could be avoided. The english word 'constrain' is a more commonly used 'verb',  you used it yourself.</p>",
        "id": 153890211,
        "sender_full_name": "John Moehrke",
        "timestamp": 1495033133
    },
    {
        "content": "<p>The word \"profile\" is highly embedded into FHIR.  It's hard for me to imagine it changing.  The spec has had a section on \"profiling\" since the very beginning.</p>",
        "id": 153890218,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495034122
    },
    {
        "content": "<p>FHIR is not that old... lots of things have changed, even painful things have changed...  Is this something worth causing confusion,  or worse?</p>",
        "id": 153890237,
        "sender_full_name": "John Moehrke",
        "timestamp": 1495040546
    },
    {
        "content": "<p>I bring this to FMG as liason to IHE...</p>",
        "id": 153890238,
        "sender_full_name": "John Moehrke",
        "timestamp": 1495040587
    },
    {
        "content": "<p>I'd also prefer to keep the term 'Profile'. I talk about it a lot in presentations and seminars, and it hasn't caused confusion (that I'm aware of) amongst the different audiences...    In fact, without meaning to be contentious couldn't it be argued that an IHE profile is analogous to a FHIR Implementation Guide? If we explain it in those terms (to those who care) I'm sure the different usages will be clear...</p>",
        "id": 153890239,
        "sender_full_name": "David Hay",
        "timestamp": 1495041769
    },
    {
        "content": "<p>David, the problem is not that people are confused on IHE Profile == FHIR Implementation Guide.. that is quite understandable. Especially since there is long standing use in IHE of Profile and in HL7 use of IG for these very similar activities. Indeed there is even plenty of cross referencing between IHE Profiles and HL7 IG (e.g. C-CDA Implementation Guide). The problem is when FHIR uses the word Profile for things smaller than an IG, or when FHIR uses the word Profile as a verb. So it really is this new use of the word by FHIR that is the problem.</p>",
        "id": 153890240,
        "sender_full_name": "John Moehrke",
        "timestamp": 1495042548
    },
    {
        "content": "<p>It's a commonly used word for what we're doing.  The notion of \"profiling\" existed long before FHIR did.  \"Constraining\" isn't an adequate substitute.  Lots of profiling doesn't formally constrain - it may just add documentation or other guidance.  And I'm not sure what other word we would use.</p>",
        "id": 153890244,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495043851
    },
    {
        "content": "<p>the spec talks about this:</p>",
        "id": 153890304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495050590
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/profiling.html#glossary\" target=\"_blank\" title=\"http://build.fhir.org/profiling.html#glossary\">http://build.fhir.org/profiling.html#glossary</a></p>",
        "id": 153890306,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495050635
    }
]