[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12144\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12144\">GF#12144</a> - This involves defining a profile on Provenance as part of the main build, which is technically a substantive change.  The only impact on existing content is updating the usage notes for those resources with a relevantHistory element to point to the new profile</p>",
        "id": 153876144,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489333182
    },
    {
        "content": "<p>+1</p>",
        "id": 153876145,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489333188
    },
    {
        "content": "<p>I'm concerned about this proposal. It seems to be central to the pharmacy handling of information yet it was handled by FHIR-I not pharmacy with no indication of support from Pharmacy or Security, and would represent an un-reviewed core profile being attached to an FMM 1 or higher resource.</p>",
        "id": 153876159,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489401036
    },
    {
        "content": "<p>I am not clear on how this is not a core use-case for Provenance. Is this not simply narrative documentation? I am not objecting to the overall concept, just the urgency to force this through in the 11th hour with minimal oversite.  I could support a narrative update now, with a more normative fix post STU3.</p>",
        "id": 153876173,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489409295
    },
    {
        "content": "<p>Is FHIR-I ready to take ownership of Provenance? It seems to be taking on more of a multi-purpose infrastructure flavor. I think Security WG has taken it as far as they can given their experience. They would continue to want to keep it aligned with security concepts, but there seems to be many proposed uses that are infrastructure, not security.</p>",
        "id": 153876174,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489409302
    },
    {
        "content": "<p>FHIR-I isn't taking ownership of Provenance.  We do have ownership of Workflow.  This is to create an FMM 0 profile that would be pointed to by several Request (and Event) resources that follow the Workflow pattern of pointing to Provenance for history to give guidance on how to use the resource for that purpose.  Pharmacy actually asked for the profile to be created.  Security will certainly be involved in reviewing the profile before it can progress to FMM 1.</p>",
        "id": 153876204,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489420022
    },
    {
        "content": "<p>so is the profile defined?</p>",
        "id": 153876258,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489436273
    },
    {
        "content": "<p>Yes, though not committed</p>",
        "id": 153876274,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489437730
    },
    {
        "content": "<p>what does it say? </p>",
        "id": 153876280,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489437970
    },
    {
        "content": "<p>Must support target, period, reason, activity, agent.  Activity must be present and is constrained to codes that actually deal with record changes (create, update, suspend, resume, etc.) Must specify agent.role as 1..1 and propose initial value set covering author, data enterer, witness and verifier (significantly cut down from base value set and focusing on participation types)</p>",
        "id": 153876282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489438207
    },
    {
        "content": "<p>considering this, and reading back through the issues, I am in favor of the change. This is just documentation, and it's just a FMM 0 profile. </p>",
        "id": 153876287,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489438460
    },
    {
        "content": "<p>and pharmacy is asking for the change</p>",
        "id": 153876288,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489438490
    },
    {
        "content": "<p>Can you record the +1?  (Makes it easier for me to count :))</p>",
        "id": 153876293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489439012
    },
    {
        "content": "<p>+1</p>",
        "id": 153876297,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489439168
    },
    {
        "content": "<p>Lloyd, I was not asking if you were embarking on a hostile takeover. I was suggesting that it is time for FHIR-I to own Provenance.</p>",
        "id": 153876330,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489443183
    },
    {
        "content": "<p>I read it the other way too. I think this is a good discussion to have in Madrid</p>",
        "id": 153876331,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489443234
    },
    {
        "content": "<p>Creating the Profile does not seem too worrisome, although there is already similar in the EHR Lifecycle; right?  The concern I had was to then propagate it as a mandatory profile for all uses of relevantHistory. It is this last change that seems rather fragile to make so late in the process.</p>",
        "id": 153876332,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489443343
    },
    {
        "content": "<p>It won't be propagated as mandatory.  Just adding a usage note that points to the profile as \"providing helpful guidance\".</p>",
        "id": 153876339,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489444421
    },
    {
        "content": "<p>I'm open to FHIR-I taking on Provenance if we think that's necessary, though I think we'd need a stronger argument than \"workflow has profiled it\"</p>",
        "id": 153876340,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489444464
    },
    {
        "content": "<p>like we have discussed on other Resources (Imaging), the owning workgroup should be aware of Profiling that is going on. Security was not aware of this. I don't think there is a problem. I am more worried about the efforts that I don't know about, and the unintended impact of a late-breaking change with very little oversight.</p>",
        "id": 153876344,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489444856
    },
    {
        "content": "<p>So, how is your profile on Provenance different from EHR? <a href=\"http://build.fhir.org/ehrsrle/ehrsrle-provenance.html\" target=\"_blank\" title=\"http://build.fhir.org/ehrsrle/ehrsrle-provenance.html\">http://build.fhir.org/ehrsrle/ehrsrle-provenance.html</a></p>",
        "id": 153876345,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489444932
    },
    {
        "content": "<p>+1</p>",
        "id": 153876389,
        "sender_full_name": "David Hay",
        "timestamp": 1489450931
    },
    {
        "content": "<p>Just confirming that this is the inclusion of a new profile on Provenance, and some explanative text on some pharmacy resources on their event history property that says see [link], and no other changes correct?</p>",
        "id": 153876430,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1489469164
    },
    {
        "content": "<p>Explanatory text will go on whatever resources have adopted the \"relevantHistory\" element from the pattern to point to Reference(Provenance).  But other than that, yes.  Text will be in usage notes and say something like \"For guidance on using Provenance to capture event history information, see [link]\" where the link would point to the draft profile.</p>",
        "id": 153876433,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489469606
    },
    {
        "content": "<p>+1</p>",
        "id": 153876437,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1489470369
    },
    {
        "content": "<p>In answer to <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, the EHRSRLE profile doesn't focus on making things easy for implementers to understand, doesn't tighten down the vocabulary to what's relevant.   This profile is much simpler and focuses on \"how do you use Provenance to capture the clinically relevant information for event history\".</p>",
        "id": 153876438,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489471365
    },
    {
        "content": "<p>+1</p>",
        "id": 153876560,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489488900
    },
    {
        "content": "<p>+1 </p>",
        "id": 153876613,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489503143
    },
    {
        "content": "<p>Approved</p>",
        "id": 153876654,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489509755
    }
]