[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13017\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13017\">GF#13017</a> - Constraint on onBehalfOf was added to Request pattern but accidentally got missed from Event pattern</p>",
        "id": 153876142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489333011
    },
    {
        "content": "<p>+1</p>",
        "id": 153876143,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489333018
    },
    {
        "content": "<p>The \"onBehalfOf\" element in Request is constrained to only being allowed when the requester is a Practitioner or Device because those are the only two resource types that make sense to tie to organizations. Could people or other organizations not be the subject of the \"onBehalfOf\"? Ever?</p>",
        "id": 153876160,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489401302
    },
    {
        "content": "<p>In this day of personal devices gathering medical data, onbehalfof the patient; where this data gathering was initiated by the patient well before any interaction with health professional. I think you have too limited view fogged by medical-organizations historic dominance.  Therefore it is not clear which model is wrong. </p>",
        "id": 153876175,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489409792
    },
    {
        "content": "<p>Patient can't act on behalf of an organization - ever.  Nor can RelatedPerson.</p>",
        "id": 153876208,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489420171
    },
    {
        "content": "<p>Patient always acts on behalf of themselves.  RelatedPerson always acts on behalf of Patient.  It's Practitioner and Device that can be tied to 0..* organizations and where there can be a need to call out which of those organizations they were acting on in a specific context.</p>",
        "id": 153876209,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489420219
    },
    {
        "content": "<p>The issue here is that both Practitioner and Device have links to 0..* organizations and there's a need, in context, to indicate which specific organization they were working on behalf of.  There's not 0..* link from Device to Patient, so there's no issue about what patient an action was for the benefit of.</p>",
        "id": 153876211,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489420319
    },
    {
        "content": "<p>This was endorsed on FHIR-I today, so just need a decision from FMG</p>",
        "id": 153876254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489435425
    },
    {
        "content": "<p>I'm struggling with this sentence: \"Patient can't act on behalf of an organization - ever\"</p>",
        "id": 153876263,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489436532
    },
    {
        "content": "<p>I think this may possibly be true of human patients in first world countries</p>",
        "id": 153876264,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489436556
    },
    {
        "content": "<p>with the possible exception of prisoners </p>",
        "id": 153876265,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489436568
    },
    {
        "content": "<p>My point is that, from the perspective of capturing responsibility for performing a procedure, capturing a condition, etc., if you're using a Patient resource, the statement isn't going to be \"Patient X did this on behalf of Organization Y\" in the same way we capture \"Dr. Smith did this for Clinic 1\" as opposed to \"Dr. Smith did this for Clinic 2\"</p>",
        "id": 153876272,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489437652
    },
    {
        "content": "<p>I think that's a reasonable statement of the general case. But making a constraint that this is always true means that we are all invited to think of the edge cases. Animals in a herd, prisoners acting under compulsion, other cultures with more community orientated clinical practices....</p>",
        "id": 153876276,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489437838
    },
    {
        "content": "<p>So, for this to be relevant, the Patient would have to be a member of multiple organizations and their involvement in the healthcare event would need to be tied to one of those organizations.  Also note that this constraint is already in place in the Request pattern, so if it's a problem for Event, we'd need to change Request too.</p>",
        "id": 153876281,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489438030
    },
    {
        "content": "<p>so it has been argued. However the pattern is not actually implemented directly, so there's no reason not to provide suggestive guidance that is more restrictive than the actual resources that implement it. </p>",
        "id": 153876289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489438549
    },
    {
        "content": "<p>+1 on the change then</p>",
        "id": 153876290,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489438552
    },
    {
        "content": "<p>If this is back to just providing narrative guidance, then it doesn't require our vote.  I read it as indeed imposing a POLICY that I don't agree is 100% factual. I don't think we should be imposing this kind of POLICY. We should be enabling reasonable policy, and giving guidance on appropriate policy. </p>",
        "id": 153876333,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489443523
    },
    {
        "content": "<p>if it was on resources, it would require our vote. I'm not actually sure it does, since it's on patterns</p>",
        "id": 153876335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489443642
    },
    {
        "content": "<p>can you name a case where you think this is wrong? </p>",
        "id": 153876337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489443699
    },
    {
        "content": "<p>I think there are cases where the patient will self-administer, because of remote treatment. Doctor instructs from afar? Or how about a patient that is highly engaged? Or a treating relative that is highly engaged? Or, as I indicated before a device that was originally chosen by the consumer before it was called upon to do some function by a treating physician. Why do we want to force a specific current-1st-world view?</p>",
        "id": 153876338,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489444404
    },
    {
        "content": "<p>Adding a constraint to the pattern is a substantive change.  And the voted motion was to apply it to resources that followed the pattern too.</p>",
        "id": 153876341,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489444510
    },
    {
        "content": "<p>hm definitely substantiative then</p>",
        "id": 153876342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489444573
    },
    {
        "content": "<p>now I'm nervous. Do we really know there isn't exceptions to the pattern? </p>",
        "id": 153876343,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489444592
    },
    {
        "content": "<p>Well, the pattern was introduce for a specific purpose.  The constraint defines the purpose.  If someone comes up with an exception, then they're soing something different than the pattern was introduced for.  For example, the pattern isn't intended to represent delegation.</p>",
        "id": 153876377,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489447160
    },
    {
        "content": "<p>is that the same as 'we're no longer supporting delegation\"?</p>",
        "id": 153876382,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489447958
    },
    {
        "content": "<p>Delegation was never part of core for resources - if handled, it'd be Provenance</p>",
        "id": 153876387,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489450816
    },
    {
        "content": "<p>The introduction of \"onBehalfOf\" was driven by the change of Practitioner to allow multiple organizations.  (It used to be one practitioner = 1 organizational role)</p>",
        "id": 153876388,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489450864
    },
    {
        "content": "<p>I think we need a reference to PractitionerRole somewhere in there, but that's for STU4 now</p>",
        "id": 153876391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489451026
    },
    {
        "content": "<p>It may be that PractitionerRole should be in the choice w/ Practitioner, Patient, RelatedPerson, etc.</p>",
        "id": 153876404,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489452961
    },
    {
        "content": "<p>obstain</p>",
        "id": 153876436,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1489470097
    },
    {
        "content": "<p>abstain</p>",
        "id": 153876561,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489489151
    }
]