[
    {
        "content": "<p>Hi Guys - been thinking about the upcoming ballot QA - in particular QA of the ValueSets. Rather than creating a document of the contents of selected ValueSets, I've written a small app to display VS contents and collect comments - <a href=\"http://conman.fhir.org/qa.html\" target=\"_blank\" title=\"http://conman.fhir.org/qa.html\">http://conman.fhir.org/qa.html</a></p>\n<p>You select a Resource, then get a list of all ValueSets in that resource. Select a ValueSet and then you can expand the contents.</p>\n<p>Finally you can enter a comment about that VS which is stored in a mongo db.</p>\n<p>I'm thinking that each resource gets assigned a reviewer/s, and part of that review is to look at the ValueSets (they also need to look at the resource contents and associated material as well of course).</p>\n<p>What do you think? If it is worth pursuing, then I'll add a page to allow a committee to view all the comments for 'their' resources and mark them as having been reviewed.</p>",
        "id": 153940337,
        "sender_full_name": "David Hay",
        "timestamp": 1519499150
    },
    {
        "content": "<p>One would almost think that you liked writing tools... :)</p>",
        "id": 153940339,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519499279
    },
    {
        "content": "<p>So next weekend we should expect tooling to support reviewing everything else?...</p>",
        "id": 153940340,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519499329
    },
    {
        "content": "<p>who me?  :)</p>",
        "id": 153940341,
        "sender_full_name": "David Hay",
        "timestamp": 1519499701
    },
    {
        "content": "<p>Slightly more seriously, I was thinking about how we could do that. For reviewing the contents of a resource, I could imagine something similar - tree to the left, details of selected node in the middle, comments to the right.  While it would be feasible to display the textual stuff as well, it's hard to beat change tracking in a document...</p>",
        "id": 153940343,
        "sender_full_name": "David Hay",
        "timestamp": 1519500015
    },
    {
        "content": "<p>The main reason for use of MS-Word was to take advantage of its spelling and grammar checking capabilities.  It's hard to replicate that.</p>",
        "id": 153940356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519506881
    },
    {
        "content": "<p>how useful was that? did we we get much grammar related changes? Spelling is lots easier</p>",
        "id": 153940364,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519509379
    },
    {
        "content": "<p>Yes</p>",
        "id": 153940366,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519509494
    },
    {
        "content": "<p>Quite a bit of grammar stuff (tense agreement, missing commas and other punctuation, etc.)</p>",
        "id": 153940367,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519509520
    },
    {
        "content": "<p>Here's the most recent set of instructions: <a href=\"https://docs.google.com/document/d/1-kMS-S0dgxa5pyK_87g_DiZonSS7FRuTvqwPUmDH6FQ/edit\" target=\"_blank\" title=\"https://docs.google.com/document/d/1-kMS-S0dgxa5pyK_87g_DiZonSS7FRuTvqwPUmDH6FQ/edit\">https://docs.google.com/document/d/1-kMS-S0dgxa5pyK_87g_DiZonSS7FRuTvqwPUmDH6FQ/edit</a></p>\n<p>I've moved away from trying to develop tooling - for what we're doing the Word Document is hard to beat. However, I've re-organized the files a bit so that it's simpler (I hope) both for reviewers and for those applying the changes.</p>",
        "id": 153941257,
        "sender_full_name": "David Hay",
        "timestamp": 1519845155
    },
    {
        "content": "<p>When we do QA for the this ballot cycle, instead of asking people to look at spelling/grammar, we should ask people to review:</p>\n<ul>\n<li>unresolved todo items</li>\n<li>link correctness</li>\n<li>look for inconsistencies in definitions</li>\n<li>look for extensions that have been replaced by core elements but are still defined</li>\n<li>notes to implementers - should link to a wiki landing page that should say something useful</li>\n<li>check that pages labelled informative do not include 'SHALL' or 'SHOULD'</li>\n</ul>",
        "id": 153976534,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532037789
    },
    {
        "content": "<ul>\n<li>check page status (FMG members)</li>\n</ul>",
        "id": 153976549,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532038493
    },
    {
        "content": "<p>Unresolved todos are ok for some FMM levels.  \"Inconsistencies in definitions\" is a hard thing - inconsistent with what?  how?</p>",
        "id": 153976554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532038679
    },
    {
        "content": "<p>Extensions that have been replaced is a task we can assign to a single person</p>",
        "id": 153976555,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532038698
    },
    {
        "content": "<p>Pages labeled informative - can't we do that using tooling?</p>",
        "id": 153976556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532038713
    },
    {
        "content": "<p>Not sure what's meant by a \"wiki landing page\"</p>",
        "id": 153976558,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532038727
    },
    {
        "content": "<p>I was particularly thinking about normative pages</p>",
        "id": 153976559,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532038743
    },
    {
        "content": "<p>inconsistencies is hard, but we can at least check</p>",
        "id": 153976560,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532038760
    },
    {
        "content": "<p>I'm not sure about the tooling - I just found something missed because it's included late</p>",
        "id": 153976563,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532038794
    },
    {
        "content": "<p>I think we might assign specific QA tasks to <em>us</em> that provide deeper checks on definitions and other things that might be unreasonable to expect of the regular QA folks.</p>",
        "id": 153976565,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532038883
    },
    {
        "content": "<p>well, with regard to the normative pages, I do not want QA people proposing grammar fixes. That's not on anymore. Because they're often times wrong, and the stakes around errors are higher now</p>",
        "id": 153976567,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532038975
    },
    {
        "content": "<p>we likely do need to classify the pool of volnteers. If someone wold be best to point at spelling, they should get that task.</p>",
        "id": 153976570,
        "sender_full_name": "John Moehrke",
        "timestamp": 1532039024
    },
    {
        "content": "<p>I <em>do</em> want grammar fixes.  We need to carefully vet what we apply - but we will have made lots of edits and there will be places where someone will have the commas wrong or \"it's\" where it should be \"its\" and it's still good to fix those.</p>",
        "id": 153976580,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532039277
    },
    {
        "content": "<p>you might want them but have you been making the change proposed? It's hard work because the changes fit into 4 categories:</p>\n<ul>\n<li>fixing something really broken</li>\n<li>trying to import some style consistency that differs from reviewer to reviewer</li>\n<li>totally misunderstanding what is being said, so grammar does need fixing</li>\n<li>totally misunderstanding what is said with no excuse at all</li>\n</ul>\n<p>about 25% each....</p>",
        "id": 153976598,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532039652
    },
    {
        "content": "<p>also</p>\n<ul>\n<li>checking that all substantiative changes between this ballot and the last for normative have been listed in the ballot intro</li>\n</ul>",
        "id": 153976599,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532039707
    },
    {
        "content": "<p>we should be able to look at SVN to see what narrative changed... right? Thus we would no need to QA for spelling those pages that didn't change (or put them lower priority)</p>",
        "id": 153976728,
        "sender_full_name": "John Moehrke",
        "timestamp": 1532048885
    },
    {
        "content": "<p>better to look at the diffs - svn is too sparse</p>",
        "id": 153976736,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532049166
    }
]