[
    {
        "content": "<p>This is my proposed list for discussion:</p>",
        "id": 153885220,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492636624
    },
    {
        "content": "<p>Product Directors R4 Agenda:</p>\n<ul>\n<li>Normative: push to normative for </li>\n<li>Foundation / API / XML / JSON / Bundle / OperationOutcome</li>\n<li>Terminology Service (ValueSet / CodeSystem / ExpansionProfile) </li>\n<li>StructureDefinition / CapabilityStatement </li>\n<li>Patient / RelatedPerson / Practitioner / Organization / ?Endpoint</li>\n<li>\n<p>position a core set of clinical resources ('health base'?) for normative in R5 (or Observation | AllergyIntolerance | MedicationStatement normative for R4?)</p>\n</li>\n<li>\n<p>JSON: use manifest for extensions, parameters resource (see forthcoming blog post)</p>\n</li>\n<li>RDF: more ontology bindings + resolve status of JSON-LD</li>\n<li>Data Analytics: support for a bulk data analysis bridge format (parquet?)</li>\n<li>API: better control over retrieving graphs, and value added query (tabular format?)</li>\n<li>Patterns: change W5 to a pattern (logical model) / tie patterns to ontology / use of patterns to drive more consistency and how to do this without decreasing quality</li>\n<li>Services: more services (conformance, registry, personal health summary? / etc?)</li>\n<li>Deployment: get a clear standards path for smart on fhir / cds-hooks (and alignment with heart)</li>\n<li>FM: better alignment between FM and the rest of FHIR</li>\n</ul>\n<p>Note: this list anticipates that normal standards development process occur, and the content as a whole is maintained. <br>\nThis is an indication of where particular focus will be applied</p>",
        "id": 153885221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492636624
    },
    {
        "content": "<p>From <span class=\"user-mention\" data-user-id=\"193300\">@Lenel James</span> : •   For STU4 objectives, add greater guidance and recommended formatting for FHIR Profiles “versions” and FHIR Bundle “identifiers”, as the basis for operations and production exchange between providers, payer and HIE during software upgrades and software revisions that will change profiles and bundle.</p>",
        "id": 153886011,
        "sender_full_name": "David Hay",
        "timestamp": 1493149313
    },
    {
        "content": "<p>not against adding more advice, but that doesn't sound like a product agenda</p>",
        "id": 153886016,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1493154081
    }
]