[
    {
        "content": "<p>Is there a freeze date established for R4B ballot-related fixes? (My understanding is that 3/6 is the <em>R5 May cycle</em> content freeze, unrelated to R4B, right?)</p>",
        "id": 270588513,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643910032
    },
    {
        "content": "<p>R5 freeze is driven by ballot timelines, which are fixed.  R4B is driven by \"when are the changes done\" which is variable.</p>",
        "id": 270590415,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643910793
    },
    {
        "content": "<p>So... we're not picking a deadline? This creates a deadlock, where authors hold off on changes indefinitely, as long as there's something more pressing to tackle.</p>",
        "id": 270590556,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643910843
    },
    {
        "content": "<p>We've declared a target of end of January to be ready to publish - which is now past.  BR&amp;R is 'close' to done and so is FHIR-I.  We could declare a deadline, but if the BR&amp;R changes or FHIR-I technical corrections aren't applied, there wouldn't be much point in shipping it on that deadline.</p>",
        "id": 270593922,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643912254
    },
    {
        "content": "<blockquote>\n<p>BR&amp;R is 'close' to done </p>\n</blockquote>\n<p>Do you know if that's  the same \"close\" as 1 or 2 months ago? Or is it \"closer\"?</p>",
        "id": 270608477,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643918282
    },
    {
        "content": "<p>kind of like \"Tomorrow, always a day away.\"</p>",
        "id": 270608755,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643918394
    },
    {
        "content": "<p>I <em>really</em> wasn't expecting an Annie quote from you here.</p>",
        "id": 270608960,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643918449
    },
    {
        "content": "<p>What is the process that Security WG can do to get the new security informative html pages migrated to R4B? There is nothing specific to R5, and there have been many improvements due to comments, and impact from Alissa.</p>",
        "id": 270609013,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643918476
    },
    {
        "content": "<p>In general, R4B is only for technical corrections.  The FMG might make an exception for urgent security guidance - you can raise it with the FMG.</p>\n<p>\"close\" is definitely \"closer\".  FHIR-I has applied a number of R4B issues (more than new ones it's identified ;) )  BR&amp;R has made considerable progress on applying changes and getting tickets resolved.</p>",
        "id": 270616165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643921734
    },
    {
        "content": "<p>I think I am arguing that the changes made to security pages are technical corrections.</p>",
        "id": 270616271,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643921784
    },
    {
        "content": "<p>I guess enumerate them and make your case :)</p>",
        "id": 270616850,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643922059
    },
    {
        "content": "<p>How do you want me to enumerate them? Do you want the Jira tickets that have been applied to R5 since R4?</p>",
        "id": 270617039,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643922130
    },
    {
        "content": "<p>easier to just do a diff on the .html that exists in R5 vs R4(B).</p>",
        "id": 270617098,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643922161
    },
    {
        "content": "<p>I sent an email to fmg mailing list with the list of CR.</p>",
        "id": 270627578,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643927013
    }
]