[
    {
        "content": "<p>Identified issue from today's lunch meeting, for further discussion: can new R4B datatypes appear in extensions? This may be one of many sources of incompatibility when parsing resources</p>",
        "id": 268442068,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642533585
    },
    {
        "content": "<p>Related question (don't want to derail current discussion): if R4B is the set of technical corrections for R4, does 4.0.1 go away?  When 4.0.1 was published, it replaced (in place) 4.0.0.  I believe this is the normal process for technical corrections.</p>",
        "id": 268442546,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642533805
    },
    {
        "content": "<p>This concept that R4B \"is\" the technical correction to 4.0.1.... was a new kind of description I heard from Lloyd today, but I'm not sure there's general agreement on this framing.</p>",
        "id": 268448977,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642536800
    },
    {
        "content": "<p>I believe the concept that technical corrections <del>from</del> on top of 4.0.1 are included in R4B is not new.  I have been under the impression that there was not a desire to publish a 4.0.2, which would require making all those changes against a 4.0.1 branch (since we are already making them against both R4B and R5).</p>\n<p>But, I believe there are a lot of 'implies' buried in all of that, and given how long it has been tossed around it is quite possible I have signals crossed somewhere else too.</p>",
        "id": 268451152,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642537751
    },
    {
        "content": "<p>For sure R4B includes corrections that exist in 4.0.1. the question here was about corrections <em>to</em> 4.0.1</p>",
        "id": 268451726,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642538057
    },
    {
        "content": "<p>Language: edited above to say that technical corrections applied <em>to</em> 4.0.1 (e.g., any made after 4.0.1).</p>",
        "id": 268452700,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642538622
    },
    {
        "content": "<p>I have never been all that clear how to get technical corrections done. The security pages have had many improvements in the past years, never been clear how I get them infront of R4 people. R4B has always been a one-off that has been discussed as fully ignorable by everyone except for those that need the new resources or modified medications definitions.</p>",
        "id": 268460228,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642542329
    },
    {
        "content": "<p>I would far prefer a regular release, like every other year. That was my understanding of the intent. Whereas R4 and especially R4B has completely gummed up the gears.</p>",
        "id": 268460468,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642542445
    },
    {
        "content": "<p>4.0.1 won't go away.   For many systems 4.3.0 will be treated the same as 4.0.1 was - and we want them to treat it that way.  However, for other systems, life won't be that simple, which means we can't stop hosting 4.0.1 the way we stopped hosting 4.0.0.</p>",
        "id": 268491462,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642566874
    },
    {
        "content": "<p>I don't expect we'll see any technical corrections made to the 4.0.1 fork though.</p>",
        "id": 268491848,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642567454
    },
    {
        "content": "<blockquote>\n<p>Identified issue from today's lunch meeting, for further discussion: can new R4B datatypes appear in extensions? This may be one of many sources of incompatibility when parsing resources</p>\n</blockquote>\n<p>A related question is: what about contained resources of novel R4B types?</p>",
        "id": 268600111,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1642624846
    },
    {
        "content": "<p>mhh. \"novel R4B types\"... rings a bell... \"Novel Crona Virus\". not sure which one I am more frightened by</p>",
        "id": 268601553,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642625546
    }
]