[
    {
        "content": "<p>Security WG confirmed that AuditEvent should be normative track in R5. The committee wanted to further discuss Provenance, with a likely approval but concern with current elements tagged as TI.</p>",
        "id": 272025270,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644953187
    },
    {
        "content": "<p>will R5 fix the fact that the normative Resources in R4 do not have normative search parameters?</p>",
        "id": 272419452,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645200062
    },
    {
        "content": "<p>Not discussed as yet.  And keeping the search parameters 'STU' was intentional in R4.</p>",
        "id": 272424121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645202287
    },
    {
        "content": "<p>I was not aware that was intentional. unfortunate as it is preventing Implementation Guides from going Normative.</p>",
        "id": 272431907,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645205810
    },
    {
        "content": "<p>Why?</p>",
        "id": 272434554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645207016
    },
    {
        "content": "<p>Not everything in the IG has to be normative for the IG to go normative</p>",
        "id": 272434592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645207029
    },
    {
        "content": "<p>It was a conscious choice because a whole lot of the search parameters haven't been well exercised and no review had happened as to which ones were solid and which weren't.</p>",
        "id": 272434672,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645207067
    },
    {
        "content": "<p>that might be HL7 rules, but it is not other organizations rules.</p>",
        "id": 272454987,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645217080
    },
    {
        "content": "<p>Other organization's may be in for a rough ride taking anything normative then.  The chances that <em>all</em> elements you care about will be completely normative aren't going to be terribly high for a while...</p>",
        "id": 272464490,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645222124
    },
    {
        "content": "<p>I don't understand why the search parameters can't be taken normative... or even why they were held back in R4. what is the rational?</p>",
        "id": 272468115,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645224013
    },
    {
        "content": "<p>It's not that they can't be, it's that we didn't want them to <em>all</em> be normative - because a bunch aren't well exercised - and perhaps shouldn't even exist.  And we didn't have the bandwidth to evaluate them at the time to decide what should be in and what shouldn't be.</p>",
        "id": 272469389,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645224823
    },
    {
        "content": "<p>We figured it was better to leave them all STU than have some become normative inappropriately.</p>",
        "id": 272469449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645224844
    },
    {
        "content": "<p>So, presumably we have a rational for promoting some to normative? I think some are quite exercised.</p>",
        "id": 272469515,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645224907
    },
    {
        "content": "<p>The criteria for SearchParameters are the same as everything else.  If someone has time to go through and evaluate the parameters against the criteria, we could include those as normative candidates.</p>",
        "id": 272469864,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645225122
    }
]