[
    {
        "content": "<p>From TSC today, open question about whether/how we'd expect the RIM to figure into our future goals for FHIR, and whether we'd need the RIM to <em>change</em> in any way.</p>",
        "id": 236195642,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619451058
    },
    {
        "content": "<p>Does anyone want to make a case for how this role would evolve or where changes would be important?</p>",
        "id": 236195689,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619451076
    },
    {
        "content": "<p>The RIM is only useful to those few that have figured it out. It is complete gibberish to me.</p>",
        "id": 236196972,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619451554
    },
    {
        "content": "<p>We've talked about turning the RIM into a proper ontology.  I don't know that it would undergo major changes, but it's possible it would undergo some.  What the driver would be for actually doing the work needed, I don't know.  Many of us have a gut instinct there would be value, but the value is hard to articulate and it certainly isn't high enough for us to drop what we're doing now and prioritize it.</p>",
        "id": 236214258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619458748
    },
    {
        "content": "<p>I'd have some changes I wanted to make to it, to cover the breadth of stuff we've done in FHIR - I think that would mainly be changes in the structural vocabulary, but I suspect that there's implied changes to attribute value domains. </p>\n<p>but mainly, i don't think that it brings enough value to make it worth doing. I know that some implementers think that FHIR is not informationally consistent enough internally, but by and large the issues are either (a) driven by implementer behavior or (b) the kind of inconsistencies something like the RIM doesn't address. The most obvious are that attracts attention is the participation resources in FHIR, but they are how they are for a reason.</p>",
        "id": 236271990,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619487974
    },
    {
        "content": "<p><em>Summarizing discussion from FMG today: we don't see any reason to persue ANSI re-affirmation of the RIM from a FHIR perspective.</em></p>",
        "id": 236579133,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619643984
    }
]