[
    {
        "content": "<p>Here's the email I sent to TSC for discussion re: google sheets</p>\n<div class=\"spoiler-block\"><div class=\"spoiler-header\">\n</div><div class=\"spoiler-content\" aria-hidden=\"true\">\n<p>Future agenda item: often groups within HL7 use spreadsheets (formally or informally) as:</p>\n<ul>\n<li>venue for collaborative work upstream of standardization (e.g., <a href=\"https://docs.google.com/spreadsheets/d/1PaFYPSSq4oplTvw_4OgOn6h2Bs_CMvCAU9CqC4tPBgk/edit#gid=0\">https://docs.google.com/spreadsheets/d/1PaFYPSSq4oplTvw_4OgOn6h2Bs_CMvCAU9CqC4tPBgk/edit#gid=0</a>),</li>\n<li>tool for analyzing standards (e.g., <a href=\"https://docs.google.com/spreadsheets/d/15hNGV7Hol76pA73C5XCx_rHOoSYfG8E56PboF3ij9-k/edit#gid=0\">https://docs.google.com/spreadsheets/d/15hNGV7Hol76pA73C5XCx_rHOoSYfG8E56PboF3ij9-k/edit#gid=0</a>), or</li>\n<li>system for tracking granular data about the use of standards (e.g., <a href=\"https://docs.google.com/spreadsheets/d/1COTmtlXgGWuFpoSr1ZQQK30S7ReCpVsk_NZI6xIeSHI/edit#gid=1272626212\">https://docs.google.com/spreadsheets/d/1COTmtlXgGWuFpoSr1ZQQK30S7ReCpVsk_NZI6xIeSHI/edit#gid=1272626212</a>)</li>\n</ul>\n<p>FMG would like to request that TSC establish guidance condoning the use of these kinds of spreadsheets, would like for HL7 HQ to establish a shared drive or other system where such resources can be stored and managed by HL7. As we see it, the requirements are for a collaborative editing environment that supports (realtime shared editing, comments, resolution) and spreadsheet capabilities (formulas, sort, filter). As long as these documents are managed in a location that HL7 approves, we think they're a useful adjunct to Confluence's native capabilities, and links to such documents could be included in Confluence spaces.</p>\n</div></div>",
        "id": 270648513,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643934033
    },
    {
        "content": "<p>The only other thing I'd add is that Confluence's \"spreadsheet\" capabilities are limited and there are times when a more sophisticated tool is needed.  Obviously, where Confluence meets the need, it should be used in preference.</p>",
        "id": 270660132,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643942009
    }
]