[
    {
        "content": "<p>ok, So just checking. The following things in STU3 are draft, not STU:<br>\n- GraphDefinition<br>\n- StructureMap + the mapping language content<br>\n- ChargeItem<br>\n- TestReport<br>\n- RequestGroup<br>\n- ResearchStudy<br>\n- ResearchSubject<br>\n- MessageDefinition<br>\n- AdverseEvent</p>",
        "id": 153877616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489724162
    },
    {
        "content": "<p>does anyone have any advance on that list <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>",
        "id": 153877617,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489724174
    },
    {
        "content": "<p>Also, how do we assign FMM levels to pages?</p>",
        "id": 153877619,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489724322
    },
    {
        "content": "<p>here's my proposal: I'm going to do it by horse sense, and all of you can all criticise them</p>",
        "id": 153877620,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489724342
    },
    {
        "content": "<p>note that there's plenty of pages without any fmm level - nothing to implement. And some are already fixed by committee. Namely, XML and JSON. I don't know of others that committees have ruled on</p>",
        "id": 153877622,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489724795
    },
    {
        "content": "<p>Not sure what you mean by \"advance on that list\"</p>",
        "id": 153877628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489726979
    },
    {
        "content": "<p>Workflow would be FMM2 I think - tested at connectathon, but probably not meeting our quality criteria in terms of fully complete</p>",
        "id": 153877629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489726984
    },
    {
        "content": "<p>well, is the list correct? have I missed anything? </p>",
        "id": 153877630,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489727060
    },
    {
        "content": "<p>according to FHIR.ini: Linkage, EnrollmentRequest, EnrollmentResponse, DeviceUseStatement too</p>",
        "id": 153877631,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489727214
    },
    {
        "content": "<p>so, here's the rules I worked to: <br>\n- pages must be have a FMM level, or be informative (or normative, but we have none of that yet)<br>\n- mappings, examples are informative<br>\n- advice pages are informative unles they include the words 'should' or 'shall' as applied to implementers. <br>\n- content cannot be less than 4 if content that depends on it is &gt;= 4<br>\n- basic infrastructure is now 5 (references, narrative, conformance rules etc)<br>\n- left committee explicit values in place except for FHIR-I values where I bumped a few of them up</p>",
        "id": 153877635,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489732171
    },
    {
        "content": "<p>so Task was FMM0 in the STU3 ballot.. so Task is still draft, right?</p>",
        "id": 153877747,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756056
    },
    {
        "content": "<p>If I am correct and the Sep 2016 is the STU3 ballot   <a href=\"http://hl7.org/fhir/2016Sep/resourcelist.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/resourcelist.html\">http://hl7.org/fhir/2016Sep/resourcelist.html</a></p>",
        "id": 153877750,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756116
    },
    {
        "content": "<p>not neccesarily. if it wasn't balloted, or it was marked as draft at ballot, then it must be draft when we publish. If it was balloted, then it is STU3, and can be whatever FMM is appropriate </p>",
        "id": 153877751,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756130
    },
    {
        "content": "<p>that is not what the FMG meeting discussion said. It was if the FMM was ZERO or it didn't exist; then it must not go higher than Draft in STU3 release</p>",
        "id": 153877753,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756183
    },
    {
        "content": "<p>if the FMM is 0 now. </p>",
        "id": 153877754,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756198
    },
    {
        "content": "<p>not if it was 0 then </p>",
        "id": 153877755,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756204
    },
    {
        "content": "<p>Lloyd argued strongly that FMM ZERO in STU3 ballot; that was an indication of draft</p>",
        "id": 153877757,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756222
    },
    {
        "content": "<p>that wasn't at all what I understood him to mean. I believed that he was talking about FMM0 now. And I would have strongly objected to the idea that FMM0 then meant draft now</p>",
        "id": 153877758,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756269
    },
    {
        "content": "<p>I tried to argue in favor of ANY existence in the STU3 ballot was sufficient; but I think I lost that argument</p>",
        "id": 153877759,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756280
    },
    {
        "content": "<p>it has to have progressed past FMM0 since then</p>",
        "id": 153877760,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756300
    },
    {
        "content": "<p>yes, I argued that point</p>",
        "id": 153877761,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756323
    },
    {
        "content": "<p>indeed. and I think it's perfectly reasonable that if a resource hasn't progressed to at least level 1 since ballot, we call it draft still. It's a pretty low bar to get over indeed</p>",
        "id": 153877762,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756367
    },
    {
        "content": "<p>It needed to exist in the STU3 ballot. </p>",
        "id": 153877763,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756404
    },
    {
        "content": "<p>right?</p>",
        "id": 153877764,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756415
    },
    {
        "content": "<p>yes</p>",
        "id": 153877765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756429
    },
    {
        "content": "<p>the list above is my list of things that didn't exist, plus those that were marked as draft </p>",
        "id": 153877766,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756449
    },
    {
        "content": "<p>then that is what I was arguing. Especially since our FMM evaluation criteria said nothing about this ballot-worthyness point</p>",
        "id": 153877767,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756459
    },
    {
        "content": "<p>good</p>",
        "id": 153877768,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756485
    },
    {
        "content": "<p>How was something 'marked draft'?   Do you mean 'currently marked draft'?</p>",
        "id": 153877769,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756488
    },
    {
        "content": "<p>because the argument said that the only way something \"was marked draft\" in the STU3 ballot, was with FMM 0 indicator</p>",
        "id": 153877770,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756513
    },
    {
        "content": "<p>there were a few resources where they were marked as 'draft not for ballot' in the introduction </p>",
        "id": 153877771,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756514
    },
    {
        "content": "<p>that got us into the conclusion that anything marked FMM 0 in the STU3 ballot; can't go higher than 0 in the STU3 final pub</p>",
        "id": 153877772,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756547
    },
    {
        "content": "<p>that was with text in the introduction, and they also had fmm = 0 but it was the text that was important</p>",
        "id": 153877773,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756564
    },
    {
        "content": "<p>so, text seems logical to hold it back... too. This point was not brought up in FMG discussion, but surely it would also be recognized.</p>",
        "id": 153877774,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489756609
    },
    {
        "content": "<p>I just committed a fairly big overhaul, marking most  pages with both a status and a maturity. </p>",
        "id": 153877775,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756651
    },
    {
        "content": "<p>I'm going to sleep now. </p>",
        "id": 153877776,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756655
    },
    {
        "content": "<p>the actual levels are not correct except for the manually edited pages - those are for commenting on. the other levels, Lloyd is updating them.</p>",
        "id": 153877777,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489756680
    },
    {
        "content": "<p>I'm going to assign Fmm=1 to all profiles and extensions</p>",
        "id": 153877864,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489782638
    },
    {
        "content": "<p>by default</p>",
        "id": 153877865,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489782751
    },
    {
        "content": "<p>If something was FMM 0 in the ballot, we agreed it can be up to FMM2 in the publication, but must have a ballot status of \"Draft\".  Anything that was draft in the ballot MUST be draft in the published specification.  (Because the status at the ballot is essentially \"draft candidate\" or \"stu candidate\" and some balloters choose what they're going to review on the basis of whether it's considered draft or not.</p>",
        "id": 153877889,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489786937
    },
    {
        "content": "<p>CG has their profiles listed on the QA spreadsheet with proper FMM levels.  Agree the remainder should be 1 for now.</p>",
        "id": 153877890,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489786980
    },
    {
        "content": "<p>I don't understand why something that was FMM0 but balloted has to be draft </p>",
        "id": 153877900,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489790147
    },
    {
        "content": "<p>in fact, looking at the list of things that were FMM0 in the ballot, I passionately disagree that things that were FMM0 in the ballot must be draft</p>",
        "id": 153877901,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489790227
    },
    {
        "content": "<p>I feel *extremely* strongly about this</p>",
        "id": 153877902,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489790262
    },
    {
        "content": "<p>If something is labeled as draft when it goes to ballot, then that means it's not candidate for STU.  I *know* there are things that shouldn't have been labeled as draft in the ballot.  But if the ballot doesn't say \"this is a candidate for STU\", then we can't arbitrarily elevate them to STU after the fact.  (Just like we couldn't elevate something from STU to Normative if it was labeled as STU candidate in the R4 ballot.)  It sucks.  But I from a governance perspective, I can't see how we can take something that was clearly marked as \"this is draft and not ready for STU consideration\" in the ballot and then say \"the balloters want this to be STU\"</p>",
        "id": 153877916,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489794082
    },
    {
        "content": "<p>The ballot has to declare whether the content is \"in scope\" for the ballot or not.  Marking something as FMM 0  is FHIR's way of saying \"this isn't ready yet\".  We tell work groups that they don't need to formally vote on changes to FMM 0 artifacts</p>",
        "id": 153877917,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489794170
    },
    {
        "content": "<p>we didn't clearly label them as draft. And no one treated them as draft. I agree that if we explicitly said that 'they're draft', then they're draft. But we didn't say that, they were just labelled as 'fmm 0'. I treated that as transient and I don't believe that we had any advice to balloters that 'fmm 0' = not for ballot, and we got plenty of ballot comment on things that were FMM 0</p>",
        "id": 153877952,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489820281
    },
    {
        "content": "<p>nor am I prepared to release STU 3 with Questionnaire and CodeSystem marked as 'draft', which would mean that they could not be normative next time. and if code system is not normative, then what can be? </p>",
        "id": 153877953,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489820325
    },
    {
        "content": "<p>if you can show that we told balloters that fmm0 = don't comment because it's draft, I might have to reconciser, but we certainly didn't tell editors that</p>",
        "id": 153877954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489820354
    },
    {
        "content": "<p>and I will hold up the ballot if I have to get this resolved. Because I am not releasing a publication with CodeSystem as a draft</p>",
        "id": 153877955,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489820395
    },
    {
        "content": "<p>CodeSystem has been in the spec in DSTU2 also, just as a sub section of ValueSet is how I would argue this.</p>",
        "id": 153877967,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1489825372
    },
    {
        "content": "<p>indeed, that is part of the rationale for it to be level 5. But procedurally, it was at FMM 0 for the ballot</p>",
        "id": 153877968,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489826360
    },
    {
        "content": "<p>Are we going to change our broad decision? I think the broad decision should stand. I also think that specific resources can be discussed, like CodeSystem.  So, what are the compelling reasons why CodeSystem should be considered having been significantly reviewed in ballot? Post ballot can't really be considered, for which I agree CodeSystem has seen significant post ballot focus.</p>",
        "id": 153877994,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489849649
    },
    {
        "content": "<p>Questionnaire was STU in DSTU2.  CareTeam, PractitionerRole and CodeSystem were part of existing resources that were STU in DSTU2.  So there's some foundation there for treating those resources differently.</p>",
        "id": 153877999,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489860579
    },
    {
        "content": "<p>In STU2 ballot, we clearly marked draft resources as \"marked as draft\".  We didn't do that in STU 3 ballot, even though some resources clearly were considered draft.  We did however change the FMM descriptions to clearly say that FMM 0 was equivalent to \"Draft\".  Those two things combined would have led at least some balloters to treat FMM 0 artifacts in the same way they would have treated \"marked as draft\" resources in the STU 2 ballot.  Thus the issue.</p>",
        "id": 153878000,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489860708
    },
    {
        "content": "<p>Turns out I was wrong.  (Because I'd looked in the one place I was right :().  We *did* explicitly mark \"Draft\" resources in the STU 3 ballot as draft.  E.g. <a href=\"http://hl7.org/fhir/2016Sep/enrollmentrequest.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/enrollmentrequest.html\">http://hl7.org/fhir/2016Sep/enrollmentrequest.html</a></p>",
        "id": 153878019,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489868508
    },
    {
        "content": "<p>We just happened to not do so for ClinicalImpression for some reason.  So most of those things that should have been identified as draft explicitly were.  As such, I think we're safe elevating FMM 0 resources that weren't marked as draft in the ballot and if they weren't marked as draft in the ballot, they don't have to be marked as draft in the published spec.</p>",
        "id": 153878020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489868580
    },
    {
        "content": "<p>Note: SDC and DAF-research will not be published today along side the formal publication of FHIR and the US-Core specification because TSC has not approved their publication</p>",
        "id": 153878633,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490036421
    },
    {
        "content": "<p>fyi: <a href=\"http://wiki.hl7.org/index.php?title=Posting_the_FHIR_specification_on_hl7.org\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Posting_the_FHIR_specification_on_hl7.org\">http://wiki.hl7.org/index.php?title=Posting_the_FHIR_specification_on_hl7.org</a></p>",
        "id": 153878688,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490070023
    },
    {
        "content": "<p>I think on August 13 2015 as part of the Countdown to DSTU Lloyd sent out an email stating that if the content was not to be balloted as DSTU it could be included as a draft for comment with FMM set to 0.</p>\n<p>And on August 12 \"Note that the spreadsheet doesn't account for warning messages, so right now there are a lot more FMM0 resources than is indicated here.  (For a summary of warning messages in the build, you can look here: <a href=\"http://hl7-fhir.github.io/qa.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/qa.html\">http://hl7-fhir.github.io/qa.html</a>)  Any resource with warnings is constrained to FMM0.  FMM0 resources are expected to be marked as Draft in the next DSTU release.\"</p>",
        "id": 153878728,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490097734
    },
    {
        "content": "<p>FMM didn't mark resources as draft if they were to be considered as draft, they were marked as FMM 0 - I marked EnrollmentRequest and EnrollmentResponse as stubs and said they were draft in the hope that people would not send in copious ballot comments on the obvious missing content as they had in the DSTU2 ballot.</p>",
        "id": 153878732,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490098643
    },
    {
        "content": "<p>If the managing committee hadn't agreed that the resource in the ballot was fit for trial use then I don't see how the ballotters would consider them as anything but draft.</p>",
        "id": 153878733,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490098795
    },
    {
        "content": "<p>In some cases the editors marked their draft resources as draft, and each in their own style, for example: EnrolmentRequest, Linkage, DeviceUseRequest, but in other cases such as Account and Consent they were not marked but were clearly not STU ready.</p>",
        "id": 153878735,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490100172
    },
    {
        "content": "<p>I'll raise at SGB tomorrow.</p>",
        "id": 153878736,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490100302
    },
    {
        "content": "<p>what will you raise?</p>",
        "id": 153878748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490102866
    },
    {
        "content": "<p>The issue above. The posted FMM Maturity Model states: \"FMM1 and higher will be published as STU level rather than draft\". </p>",
        "id": 153878764,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490109817
    },
    {
        "content": "<p>so there is no governance issue here. The governance situation is clear:<br>\n- it should be clear what is balloted for draft, and what is balloted for STU<br>\n- if something was balloted as draft, then it can't be published as STU</p>",
        "id": 153878765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490109939
    },
    {
        "content": "<p>there is a management issue here in that we were not clear what was draft or not. we had two different methods, neither clearly documented</p>",
        "id": 153878767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490110017
    },
    {
        "content": "<p>Was trying to find you some latitude.<br>\nAnd I expect the posted FMM rule trump (no pun intended) the ballot content.</p>",
        "id": 153878768,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490110023
    },
    {
        "content": "<p>well, if you want to report to SGB, make sure the report is clear: the governance principles are clear, and FMG is aware that the management of this was not exemplary, and it will be next time </p>",
        "id": 153878771,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490110119
    },
    {
        "content": "<p>the product manager is aware of that too.</p>",
        "id": 153878773,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490110134
    },
    {
        "content": "<p>We may need to have another ballot, perhaps just for select resources, before next May - FMM5 requires publication 2 formal ballots (DSTU1, DSTU2, DSTU3) at FMM1+, some of these one you want to go normative may not currently qualify next May.</p>",
        "id": 153878778,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490110314
    },
    {
        "content": "<p>we think they do because they were broken out of resources that were already published, and that should count</p>",
        "id": 153878784,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490110493
    },
    {
        "content": "<p>something for FMG to consider </p>",
        "id": 153878785,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490110503
    }
]