[
    {
        "content": "<p>Hi Guys - as discussed at the meeting yesterday, I've created a small tool to survey resource usage. Can you take a look at <a href=\"http://clinfhir.com/survey.html\">http://clinfhir.com/survey.html</a> and let me know what you think? We can reset the data when we're ready after making any changes...</p>\n<p>Results are listed in a tab on the page - but easy enough to create a csv download for importing into a spreadsheet... (or some other)...</p>",
        "id": 199810660,
        "sender_full_name": "David Hay",
        "timestamp": 1591306110
    },
    {
        "content": "<p>frustrating to have the resource I am interested at the bottom... see your checkbox which did work... making this better really requires two screens: one to select resources I am going to comment on, second screen the comments on those.</p>",
        "id": 199811155,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591306381
    },
    {
        "content": "<p>could have three screens. first is checkboxes to those resources I am directly involved with development / prototyping, from that (second screen) (possibly a starting with the whole list or previous page?) those that I am aware are in production. notes on either page</p>",
        "id": 199811378,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591306526
    },
    {
        "content": "<p>I would recommend \"Dev / Test\" be \"Prototyping\"?</p>",
        "id": 199811417,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591306557
    },
    {
        "content": "<p>did you try the filter? Was trying to avoid multiple screens, but could certainly arrange in different ways...</p>",
        "id": 199814125,
        "sender_full_name": "David Hay",
        "timestamp": 1591308121
    },
    {
        "content": "<p>Could have a categorization display like in the spec...</p>",
        "id": 199814200,
        "sender_full_name": "David Hay",
        "timestamp": 1591308156
    },
    {
        "content": "<p>I'd just put radio buttons for dev/test vs. production and get rid of the checkbox.  Would also be good to ask for organization name.  Contact should be changed to 'email'.  We don't really want phone numbers</p>",
        "id": 199835972,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591332566
    },
    {
        "content": "<p>OK - updates at <a href=\"http://clinfhir.com/survey.html\">http://clinfhir.com/survey.html</a>.       If anyone can tell me where to find 'categorization' info - like <a href=\"http://hl7.org/fhir/resourcelist.html\">here</a> then I can add that...</p>",
        "id": 200292894,
        "sender_full_name": "David Hay",
        "timestamp": 1591737937
    },
    {
        "content": "<p>did we agree to allow an upload of a CapabilityStatement ?   I know we  agreed that they typically are not available in the constrained detail we want (either don't exist for clients, or are generic for servers). But if someone does have a well crafted Capability Statement it would be fantastic to see that as evidence too, and we would give that individual the benefit of not needing to fill out a form that they already have in a FHIR resource.</p>",
        "id": 200680876,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591973969
    },
    {
        "content": "<p>We didn't.  We could just invite them to email their CapabilityStatements to <a href=\"mailto:FMGContact@hl7.org\">FMGContact@hl7.org</a></p>",
        "id": 200683559,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591975158
    },
    {
        "content": "<p>sometimes it is hard to email xml.. but yes that could be explained as bonus-points</p>",
        "id": 200688238,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591977475
    },
    {
        "content": "<p>I can add an upload...</p>",
        "id": 200721945,
        "sender_full_name": "David Hay",
        "timestamp": 1591994349
    },
    {
        "content": "<p>another easy response would be to have them list the IG they have implemented. again, if they have a CapabilityStatement it should (but likely donesn't) include these IG they support..   I really don't think we should take the current survey opportunity to get the IG, but eventually we should focus on IG rather than Resources.</p>",
        "id": 200764690,
        "sender_full_name": "John Moehrke",
        "timestamp": 1592052412
    },
    {
        "content": "<p>Latest version: <a href=\"https://survey.clinfhir.com/\">https://survey.clinfhir.com/</a>.  (Still needs the list of resource types reviewed)...</p>",
        "id": 202607831,
        "sender_full_name": "David Hay",
        "timestamp": 1593629019
    },
    {
        "content": "<p>Have made the changes discussed yesterday. Specifically:</p>\n<ul>\n<li>'product' is required. When a product is entered previous surveys for that product are shown in a separate tab. If the survey has been entered through the same browser, then there is a delete option. This seemed the simplest way to allow updates/corrections as well as a way of checking that no-one else has completed the survey for a given product.</li>\n<li>UI changes to the location of the filter options (by resource type or previously selected)</li>\n<li>any number of FHIR versions can be selected - and changed to \"Lloyd order\". The resources listed are derived from the selected versions.</li>\n<li>'results so far' tab lists contactable numbers (where an email has been entered) - though not the actual emails of course</li>\n<li>if the call is HTTP, it will redirect to HTTPS</li>\n</ul>\n<p>I didn't do the 'upload capability statement' option as mentioned in previous posts - but could look at that. Probably the easiest would be for the user to specify the root of the server, and have the app go fetch it. The server would need to support CORS of course, and the metadata endpoint unprotected...</p>\n<p>IG's implemented is another interesting one. I'd suggest it's a different component of the survey rather than a way of finding supported resources. As <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  says, it would be elegant to get that from the capability statement, though you'd want a manual option as well. We'd also want to have a picklist for IG's - though I guess we'd also want to allow manual entry. Supported IG's may be of wider interest than supported resources too...</p>\n<p>Comments welcome - and testing would be much appreciated!  (It works for me :) ).</p>",
        "id": 212731686,
        "sender_full_name": "David Hay",
        "timestamp": 1602181999
    }
]