[
    {
        "content": "<p>presently, we have a problem in gForge: we have lots of tasks marked as 'deferred' because they were put off from being in the current release</p>",
        "id": 153861340,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481068375
    },
    {
        "content": "<p>but that's an ambiguous idea. which ones didn't go in the release this week, and which ones don't go in the final STU3? We haven't been differentiating, and that's a problem. There's plenty of quality related tasks that are just being auto-deferred at the moment </p>",
        "id": 153861341,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481068423
    },
    {
        "content": "<p>Well, the idea is that WGs are free to ignore everything that came in after mid-October until such time as R3 is published.  They do however have the right to go and \"undefer\" things they want to tackle in R3</p>",
        "id": 153861414,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481081224
    },
    {
        "content": "<p>but do they have any status in gForge to help manage that?</p>",
        "id": 153861433,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481087616
    },
    {
        "content": "<p>If they want to take something on, they can move it from \"deferred\" to \"triaged\" to put it on their \"need to deal with this\" list.</p>",
        "id": 153861448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481096610
    },
    {
        "content": "<p>So why did the status just get changed to 'deferred' when we aren't publishing anything right now?</p>",
        "id": 153861661,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1481113155
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> We <em>are</em> publishing.  There were so many existing tracker items that WGs couldn't get finished by the initial deadline and we had to give an extra 2.5 months to allow them to clear the backlog.  Continuing to dump new ones on them didn't seem wise.  WGs that are on top of things are free to move content out of \"deferred\" if they wish.</p>",
        "id": 153861854,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481121017
    },
    {
        "content": "<p>Were workgroups expected to mark ALL unresolved STU3 items as deferred at this time? I was expecting with the deadline for STU3 ballot rec moved out that they didn't need to do such thing.</p>",
        "id": 153861871,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481123627
    },
    {
        "content": "<p>My groups are carrying on mostly ignorant of the January ballot. (Ignorant convenient because none of their resources are included in any IG being balloted)  I don't recall any instructions on use of deferred this time.</p>",
        "id": 153861873,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481123733
    },
    {
        "content": "<p>When newly submitted items are triaged, they're automaticallly being deferred.  Existing items aren't being changed.  We're still expected to reconcile all items that came in during ballot (and past ballots) or that were submitted prior to mid-October.  Though work groups are free to vote to punt something to the next release if they wish.</p>",
        "id": 153861879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481125855
    },
    {
        "content": "<p>Ah, yes. I knew that... although I had forgotten... now I need to think about looking at that backlog. </p>",
        "id": 153861889,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481127076
    },
    {
        "content": "<p>We had several of our uncompleted items changed from triaged to deferred which is why I made the comment above - we also aren't publishing anything now. The time when unresolved items would be set to deferred on masse I would have expected to be Feb 5.</p>",
        "id": 153861893,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1481127280
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Things shouldn't be changed from triaged to deferred on you.  Check the history to see who made the change.  We won't bulk-defer things.  Work groups need to vote on their resolutions to open items, even if those votes are to defer.  We will however start leaning on WGs to do that for anything that's left outstanding after the WGM.  I.e. \"Either defer them or get them resolved pronto\" :)</p>",
        "id": 153861898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481128708
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I think it was Melva doing QA. I agree that things shouldn't have changed. It isn't a problem as we have a spreadsheet where we are keeping track.</p>",
        "id": 153861899,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1481129192
    },
    {
        "content": "<p>Were the items \"triaged\" or \"submitted\"?  Anything that comes in as \"submitted\" will get changed to \"deferred\".  But if something was specifically changed from \"triaged\" to \"deferred\" without a vote by the WG, that's a problem.  If you give me a tracker id, I can dig to see what happened.</p>",
        "id": 153861920,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481135305
    },
    {
        "content": "<p>They were two items recently added by me marked as \"submitted\" - why would those be changed? I think it makes more sense to let the committees manage their items and force the remainers to deferred on Feb 5 or whatever the final date is for reconciliation.</p>",
        "id": 153861942,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1481138132
    },
    {
        "content": "<p>standard policy is that all gForge tasks created after mid-Oct are auto-deferred. Makes sure the commenter knows where they stand. I have undeferred a few, and explained to a few people why. ]</p>",
        "id": 153861946,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481138483
    },
    {
        "content": "<p>They can sit as deferred and when the committee votes this Friday I'll set them accordingly.</p>",
        "id": 153861950,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1481139149
    },
    {
        "content": "<p>I'm hoping folks will read these, though: like <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12382\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12382\">GF#12382</a> seems to have been deferred but it's actually an infrastructure problem</p>",
        "id": 153861951,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1481139332
    },
    {
        "content": "<p>(Because this kind of invalid extension should be detected in the build, and prohibited)</p>",
        "id": 153861952,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1481139391
    },
    {
        "content": "<p>it is assigned to the wrong committee, though how we'd sort that I don't know</p>",
        "id": 153861953,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481139608
    },
    {
        "content": "<p>should be FHIR-I. There's a real risk that stuff like that will be missed because I'm not checking deferred tasks for domain committees</p>",
        "id": 153861954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481139638
    },
    {
        "content": "<p>Should I just go and re-assign that?</p>",
        "id": 153861955,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1481139685
    },
    {
        "content": "<p>Just did, to FHIR-I, as \"Triaged\", and \"Fit for telecon\".</p>",
        "id": 153861956,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1481139778
    },
    {
        "content": "<p>thx. though I don't think we need to telecon that one. it's just an outright publishing error</p>",
        "id": 153861957,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481139891
    },
    {
        "content": "<p>Yes, OK. I can set to a different status if you prefer!</p>",
        "id": 153861958,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1481140019
    },
    {
        "content": "<p>Resolved change required is best</p>",
        "id": 153861959,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481140154
    },
    {
        "content": "<p>Everything that comes in as submitted goes through a triage process that ensures the item is complete, assigned to the (hopefully) the correct work group, is appropriately categorized by resource, page, etc.  That's the process where we auto-defer.  The point is that work groups shouldn't have to look at anything that came in after mid-october until after the release is published</p>",
        "id": 153861974,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481144976
    }
]