[
    {
        "content": "<p>Do we have anything urgent?  David's unavailable to chair and I'll have to head to the airport 15 minutes into the call.  I can continue to chair for 30 minutes after that while in transit, but it's simpler to cancel if we don't have anything urgent.</p>",
        "id": 153954198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524606841
    },
    {
        "content": "<p>I don't have anything except the process issue around normative contnetn</p>",
        "id": 153954199,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524606865
    },
    {
        "content": "<p>I won't be joining any more calls before the meeting</p>",
        "id": 153954200,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524606883
    },
    {
        "content": "<p>Process issue isn't really an issue - we just need to let WGs know they're allowed to consider non-ballot tracker items that might lead to substantive change - no?</p>",
        "id": 153954203,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524606922
    },
    {
        "content": "<p>well, yes, but any substantiative changes that arise this way must go through re-ballot</p>",
        "id": 153954205,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524606956
    },
    {
        "content": "<p>Any substantive changes that arrive in any way must go through re-ballot</p>",
        "id": 153954213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524607198
    },
    {
        "content": "<p>Essentially the only difference between balloted and non-balloted comments is that the WG is under obligation to reconcile the balloted ones.  However, from a good/reasonable practice perspective, they're effectively obligated to resolve all comments that could result in substantive change received before whatever cutoff we set for Aug. ballot prep.</p>",
        "id": 153954215,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524607273
    },
    {
        "content": "<p>so I think that we should point this on on co-chairs list since at least one committee has not twigged to their obligations here</p>",
        "id": 153954218,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524607384
    },
    {
        "content": "<p>Just a note that Austin is planning to attend the beginning of the call with some issues from SGB this morning.</p>",
        "id": 153954334,
        "sender_full_name": "Anne Wizauer",
        "timestamp": 1524673816
    }
]