[
    {
        "content": "<p>As discussed on the FMG call, the FMG is being asked to nominate one of it's membership to serve as TSC rep (1+ calls per week, plus 4-hour calls every 3 months or so while we're virtual.  The all-day Saturday meetings at WGMs once we get back to face-to-face will likely be revisited.  Brian Pech has put his name forward, but others who are interested in the role are also invited to announce their intentions.  We'll discuss more next week and aim to vote on our call the week after.</p>",
        "id": 217946479,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606343138
    },
    {
        "content": "<p>I'd also be happy to volunteer; let's discuss in our next meeting.</p>",
        "id": 218191909,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606616905
    },
    {
        "content": "<p>Hello Fellow FMG members,  Here's my brief statement - Participating in the Technical Steering Committee is a significant time commitment and I am willing to make that commitment.  I would be honored to represent the FHIR  family in the context of the larger HL7 community.  Thank you for your consideration. Happy to have Josh join the candidate pool. It is always welcome to have choices.</p>",
        "id": 218730959,
        "sender_full_name": "Brian Pech",
        "timestamp": 1607018277
    },
    {
        "content": "<p>And a quick statement from my side: I've long been interested in lending my perspective to the TSC, with a focus on the practical issues of FHIR adoption, and a good mix of academic + industry experience. Historically this was hard since, TSC meeting conflicted with the FHIR Connectathons. But now that the standing conflict is resolved, I'd be happy to volunteer.</p>",
        "id": 219399483,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607548779
    },
    {
        "content": "<p>(I'm especially interested in how HL7 can promote more re-use of existing efforts; there are so many independent projects spinning up at this point that even awareness --- let alone thoughtful reuse and generalization -- is a major challenge.)</p>",
        "id": 219399698,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607548860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> if you're going to vote for a TSC rep do you want to send a message to <span class=\"user-mention\" data-user-id=\"191690\">@Anne Wizauer</span> ?</p>",
        "id": 219405732,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607551541
    },
    {
        "content": "<p>Timeline for everyone to vote is: before 9a ET tomorrow.</p>",
        "id": 219405834,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607551570
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> : Do we vote individually?  I thought that was by workgroups/etc.</p>",
        "id": 219405930,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1607551621
    },
    {
        "content": "<p>The process FMG is following is having our members vote</p>",
        "id": 219405993,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607551656
    },
    {
        "content": "<p>we just agreed to private zulip or email to Ann</p>",
        "id": 219406011,
        "sender_full_name": "John Moehrke",
        "timestamp": 1607551664
    },
    {
        "content": "<p>Hans has responded - thank you!</p>",
        "id": 219408946,
        "sender_full_name": "Anne Wizauer",
        "timestamp": 1607553073
    }
]