[
    {
        "content": "<p>as a consquence of the XXE susceptibility report, I need to release a new validator for DSTU2</p>",
        "id": 153822528,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461110934
    },
    {
        "content": "<p>presently, the validator is available here:</p>",
        "id": 153822529,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461110942
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/validator.zip\" target=\"_blank\" title=\"http://hl7.org/fhir/validator.zip\">http://hl7.org/fhir/validator.zip</a><br>\n<a href=\"http://hl7.org/fhir/DSTU2/validator.zip\" target=\"_blank\" title=\"http://hl7.org/fhir/DSTU2/validator.zip\">http://hl7.org/fhir/DSTU2/validator.zip</a></p>",
        "id": 153822530,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461110976
    },
    {
        "content": "<p>I have built a new version that replaxces this - the only functional change is that it returns an error for the XXE attack rather than allowing inappropriate access. I believe that the right course of action is simply to update the binary on the HL7 website, and inform people through Zulip, the FHIR email list, and twitter on #FHIR. </p>",
        "id": 153822531,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461111050
    },
    {
        "content": "<p>I do not believe that this counts as 'a technical correction to the DSTU' or that it needs an update to the DSTU - nothing anyone does changes, it's only that they should update the validator with a new one if they use it </p>",
        "id": 153822532,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461111099
    },
    {
        "content": "<p>does anyone disagree with this? </p>",
        "id": 153822533,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461111107
    },
    {
        "content": "<p>My guess is that the TSC will consider this a DSTU update and will want to announce it as such - they'll want to use their \"official\" distribution channels.  If anything that you download from the ballot changes, I think that falls within their definition.  However, I'll leave it to the TSC members to share their thoughts as they probably have more insight than I do.</p>",
        "id": 153822535,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461113471
    },
    {
        "content": "<p>I argue that this is not the case because it is not balloted content. No balloted content is changing. So how can it be a DSTU update?</p>",
        "id": 153822536,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461114319
    },
    {
        "content": "<p>I agree - this is not a change to the specification, it is a change to implementations which are not part of the normative content, therefore I don't see the need for a republication or technical correction.</p>",
        "id": 153822564,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461129796
    },
    {
        "content": "<p>However, given that it is software and people are becoming increasing reliant on this even if only for exploration I think we should formally stand up fixes and demonstrate the testing of the fix before we release.</p>",
        "id": 153822565,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461129919
    },
    {
        "content": "<p>What mind of formality do you propose? It's kind of tricky for old software. The current tests are checked into svn...</p>",
        "id": 153822567,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461130207
    },
    {
        "content": "<p>Do you have a stock test suite to testing functionality after mods? Is there an added test(s) for the XXE vulverabilities?</p>\n<p>Is there a spell checker for Zulip?</p>",
        "id": 153822569,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461130360
    },
    {
        "content": "<p>Yes, for the current parsers and validators. </p>",
        "id": 153822570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461130417
    },
    {
        "content": "<p>From memory, /build/tests/validator-examples. Added 3 xxe tests this morning</p>",
        "id": 153822572,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461130475
    },
    {
        "content": "<p>Great thanks, then I'd make that available, perhaps as a link rather than in the RI packages, and FMG can vote to approve publication of new RI's, and procedurally I expect the CTO could approve if a fix was needed on an emergency basis.</p>",
        "id": 153822573,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1461130581
    },
    {
        "content": "<p>I tihnk it's reasonable that if you want to run the tests you should use version control. It's make work to package them up for anything else</p>",
        "id": 153822575,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461132696
    }
]