[
    {
        "content": "<p>Somehow, at the last minute, we're seeing warnings pop up on a few infrastructure resources all dealing with search criteria that aren't covered by examples.  This is due to either late-breaking changes to examples that removed elements from examples or possibly changes to the code that detects what examples are covered.  I'm not sure why and don't have the time to investigate.  You can see the issues in <a href=\"http://build.fhir.org/qa.html\" target=\"_blank\" title=\"http://build.fhir.org/qa.html\">http://build.fhir.org/qa.html</a> (look for numbers in the red column).  My recommendation is to add these warnings to the \"temporarily waived\" set of warnings so they do not impede the ability to publish these resources with their correct FMM level.  We will address them for the next release.</p>",
        "id": 153878237,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489938080
    },
    {
        "content": "<p>+1</p>",
        "id": 153878238,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489938082
    },
    {
        "content": "<p>Agree +1</p>",
        "id": 153878240,
        "sender_full_name": "Brian Pech",
        "timestamp": 1489938258
    },
    {
        "content": "<p>+1 (if its needed)</p>",
        "id": 153878243,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1489938763
    },
    {
        "content": "<p>+1 (Im willing, but worried about the 'somehow'  clause)</p>",
        "id": 153878244,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489939018
    },
    {
        "content": "<p>The totals by work group, if that is what they are, are not correct.</p>",
        "id": 153878245,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489940067
    },
    {
        "content": "<p>Several of these are are FMM 5 resources. I think it would be better to fix them pronto - don't we have another rule in place which is that we won't make changes to FMM 5 resources pre normative ballot?</p>",
        "id": 153878246,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1489940261
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> The rule is that we'll consult the implementer community before making substantive changes to FMM4+ resources.  Adding examples would not be substantive, so there's no issue there.  The only impact of this not being fixed is that it's slightly harder for those building the reference implementations to test all of their search criteria.</p>",
        "id": 153878247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489940503
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> If you've got time to dig through the logs or roll-back until you see when the problem was introduced, please do.  Agree it would be good to know.</p>",
        "id": 153878248,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489940554
    },
    {
        "content": "<p>+1</p>",
        "id": 153878249,
        "sender_full_name": "David Hay",
        "timestamp": 1489941716
    },
    {
        "content": "<p>Approved.  I will hold off making the change in case Grahame wants to investigate the underlying cause.  Thanks for your quick turn-around everyone.  (And if you can check your email frequently today on the off chance we run into other issues requiring decision, that'd be appreciated.)</p>",
        "id": 153878250,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489941973
    },
    {
        "content": "<p>the searchParameter warning is legitimate. there is a search parameter for which it doesn't have an example with that element filled. This seems to have happened as far back as December. I do not get the warnings on StructureDefinition, so...StructureDefinition is not anything I understand, so not much help from me.</p>",
        "id": 153878254,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489947025
    },
    {
        "content": "<p>+1</p>",
        "id": 153878255,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1489947160
    },
    {
        "content": "<p>I sure haven</p>",
        "id": 153878256,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489951199
    },
    {
        "content": "<p>I sure haven't made changes in this space. what's an example?</p>",
        "id": 153878257,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489951213
    },
    {
        "content": "<p>SearchParameter.component</p>",
        "id": 153878264,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489952318
    },
    {
        "content": "<p>(Which we certainly *ought* to have . . .)</p>",
        "id": 153878265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489952331
    },
    {
        "content": "<p>so the warnings are all valid, so far as I can see. I cannot think why they're only suddenly appeared</p>",
        "id": 153878266,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489952378
    },
    {
        "content": "<p>with regard to the conformance resources, the generated conformance resources are not tested in this regard, so the warnings on CodeSystem, OperationDefinition, SearchParameter, and StructureDefinition aren't actually true. But the others appear to be</p>",
        "id": 153878268,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489952441
    },
    {
        "content": "<p>so +1</p>",
        "id": 153878269,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489952471
    },
    {
        "content": "<p>I'm pretty sure these particular issues weren't being reported a week ago or I'd have flagged them as something we needed to fix.  (I did flag SearchParameter.component, but I thought you'd addressed.)  I'll mark them to ignore for now.</p>",
        "id": 153878272,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489953518
    }
]