[
    {
        "content": "<p>The FAST Identity team and HL7 Interoperable Digital Identity and Patient Matching workgroup would like to invite you to an interim connect-a-thon event focused on the Identity scenarios in <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=130482809\">this track</a> (#3, 5, and 6 with a focus on the $match operation in #6). The connectathon will occur on February 24-25. We are in need of additional client, server, and identity provider prototypes evaluating our solutions, to successfully proceed with the HL7 IG development process. Please let us know if you will plan to attend so we can include you on a kick-off call the week before.</p>\n<p>Please also share this message with any colleagues at your organization or other industry peers who you think may be interested in testing identity components or learning more about our work on this <a href=\"https://build.fhir.org/ig/HL7/fhir-identity-matching-ig/\">Implementation Guide</a>!</p>",
        "id": 270458949,
        "sender_full_name": "Julie Maas",
        "timestamp": 1643836611
    },
    {
        "content": "<p>We will be posting updates related to the connectathon, participant details, and other topics at <a href=\"https://confluence.hl7.org/display/FAST/2022-02+FAST+Identity+Testing+Event\">this page</a>.</p>",
        "id": 271591806,
        "sender_full_name": "Julie Maas",
        "timestamp": 1644593089
    },
    {
        "content": "<p>Curious to know what $match server implementers are using for registration for #6?  Are you doing UDAP DCR or something different?</p>",
        "id": 271871617,
        "sender_full_name": "Tom Loomis",
        "timestamp": 1644865080
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"379898\">@Tom Loomis</span> for the question...in case it's easier to answer in a table, we might use the new tab for Feb 2022 C-A-T on <a href=\"https://docs.google.com/spreadsheets/d/1awkXXQaeuRv5ysLo8R6f1fpfBlpTJGfSPK4xRjsai7M/edit#gid=1321486527\">this worksheet</a>?</p>",
        "id": 271899720,
        "sender_full_name": "Julie Maas",
        "timestamp": 1644878193
    },
    {
        "content": "<p>We're planning to follow nearly the same schedule as for the January connectathon, minus the Security IG deep dive.</p>",
        "id": 272001147,
        "sender_full_name": "Julie Maas",
        "timestamp": 1644943261
    },
    {
        "content": "<p>We are preparing for Scenario #6 B2B workflow.  A couple of thoughts/questions at this point:<br>\n•   It would be good to know the registration process folks are using, assuming UDAP, but interested to hear.  For now we are approaching with sandbox access.<br>\n•   It would be good to have some more definition around score is that provided anywhere?  It appears to be section 4.7 of this link:  <a href=\"http://url\">https://build.fhir.org/ig/HL7/fhir-identity-matching-ig/patient-matching.html</a></p>",
        "id": 272296909,
        "sender_full_name": "Tom Loomis",
        "timestamp": 1645120118
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"379898\">@Tom Loomis</span>, that is great to hear! At this time from an IG perspective we are not prescriptive about a minimum confidence score for responder to return results (or how one's own system computes that score), nor are there requirements on the weighted input score. We would like to discuss this during the event and get your feedback! <span class=\"user-mention\" data-user-id=\"427858\">@Jeff Brown</span> would be able to speak to authentication requirements for the MITRE $match server RI. I'm about to add notes to the <a href=\"https://docs.google.com/spreadsheets/d/1awkXXQaeuRv5ysLo8R6f1fpfBlpTJGfSPK4xRjsai7M/edit#gid=820206691\">implementers spreadsheet</a> about ours which is unsecured/no registration required.</p>",
        "id": 272486301,
        "sender_full_name": "Julie Maas",
        "timestamp": 1645238399
    },
    {
        "content": "<p>If you</p>",
        "id": 272529223,
        "sender_full_name": "Julie Maas",
        "timestamp": 1645289955
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194368\">@Julie Maas</span>  Where are you planning no sharing the meeting information?  Zoom, GoTo Meeting etc?  Thanks Tom</p>",
        "id": 272974954,
        "sender_full_name": "Tom Loomis",
        "timestamp": 1645634595
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"379898\">@Tom Loomis</span> you can find the event details <a href=\"https://confluence.hl7.org/display/FAST/2022-02+FAST+Identity+Testing+Event\">here</a>!</p>",
        "id": 272975195,
        "sender_full_name": "Julie Maas",
        "timestamp": 1645634715
    },
    {
        "content": "<p>@Julie Maas I see the agenda but not actual meeting information for regular connectathons that usually is in Whova, are you using that this time or just something more informal?</p>",
        "id": 272976537,
        "sender_full_name": "Tom Loomis",
        "timestamp": 1645635272
    },
    {
        "content": "<p>This is definitely more informal and it's free. My apologies - I thought the meeting info for tomorrow was on the track page. Let me confirm I have the right details for sharing &amp; I'll reply here shortly re: how to join (our POCP resource is away this week).</p>",
        "id": 272992541,
        "sender_full_name": "Julie Maas",
        "timestamp": 1645641226
    },
    {
        "content": "<p>The FAST Identity February Testing Event is getting started in just a few minutes! </p>\n<p>No registration is required; join the Zoom call today or tomorrow between 10 am - 3 pm Eastern to follow testing or give feedback to the IG...<a href=\"https://hl7-org.zoom.us/j/94168393541?pwd=QlduVEgxc1J3V3RKbUJpbzB1QzR4dz09\">Zoom details here</a> or see the <a href=\"https://confluence.hl7.org/display/FAST/2022-02+FAST+Identity+Testing+Event\">track page</a>.</p>",
        "id": 273098903,
        "sender_full_name": "Julie Maas",
        "timestamp": 1645714278
    },
    {
        "content": "<p>Thank you so much to all who joined today to provide input on this challenging topic! <br>\nI've made some updates to section 4.8 of the <a href=\"https://build.fhir.org/ig/HL7/fhir-identity-matching-ig/patient-matching.html\">IG</a> as was discussed at the connectathon today, plus added some combinations that we have previously identified and that seem should represent a higher-confidence match. Also added some language about how to use the table, as a strawman - please post comments &amp; feedback here!</p>",
        "id": 273153720,
        "sender_full_name": "Julie Maas",
        "timestamp": 1645739169
    }
]