[
    {
        "content": "<p>What issues should pharmacy and EHR vendors be aware of when managing patient PII and other patient demographic data and where do solutions exist?</p>",
        "id": 250359938,
        "sender_full_name": "Julie Maas",
        "timestamp": 1629729132
    },
    {
        "content": "<p>Start with the Five Rights -- <a href=\"http://library.ahima.org/doc?oid=300027#.YSO-wHySmUk\">http://library.ahima.org/doc?oid=300027#.YSO-wHySmUk</a></p>",
        "id": 250368061,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629732562
    },
    {
        "content": "<p>The data is not consistent between the EHR, Pharmacy and Payer. Some may use legal name, others use the patient's preferred name. The address data is often not kept up to date and the DOB at the payer is often entered incorrectly resulting in the Pharmacy having the 'insurance' DOB vs the actual patient DOB. It would be helpful to have additional information such as previous name or former name (married, divorce), Preferred name (Jack vs john, or even those patient that go by their middle name which many Pharmacies use vs legal name). The problem is the more elements you add the more complicated it gets to keep all the data in sync. And once a patient's profile is co-mingled it is hard to separate. Many systems keep only the basic information and some don't even have a field for Middle initial or suffix.</p>",
        "id": 250383616,
        "sender_full_name": "Donna Litwak",
        "timestamp": 1629739556
    },
    {
        "content": "<p>is there a way we can define a best-case?   I think one problem that we tend to have is that reality tends to result in a patient identity (identifiers and demographics) that are less than best-case. Some of these less-than-best-practice is driven by system capabilities, this can be ignored if we focused on FHIR as the FHIR best-practice can encode everything. This does not simply sweep this problem off the table, but it puts it in a clear context. Some of these less-than-best-practice is driven by the patient themselves, not having 'handy' the details (reality is that most patients approach healthcare when they are not in the best of health...).   The idea is that the best-case pattern would be still good to define as a goal, then the realities can be measured and evaluated against that best-case.</p>",
        "id": 250385965,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629740608
    },
    {
        "content": "<p>I would encourage the use of Legal Name (what you have on a legal document like birth certificate or marriage license if your name has changed).   At least with legal name it should be verifiable from another source. DOB at the prescription payer is an issue that impacts Pharmacy only due to billing but not the EHRs since they use medical billing and not prescription billing. I have seen same name patients with the same DOB, so another element is needed, too few and the chance is too great the wrong patient could be selected.</p>",
        "id": 250387942,
        "sender_full_name": "Donna Litwak",
        "timestamp": 1629741606
    },
    {
        "content": "<p>A 2012 CHIME Study (Summary_of_CHIME_Survey_on_Patient_Data.pdf (<a href=\"http://chimecentral.org\">chimecentral.org</a>)) found that nearly one-fifth of CIOs responding indicated that they could attribute at least one adverse event to a patient mismatch within in the previous year.</p>\n<p>In 2019, it was reported that approximately 18 percent of patient EHRs are duplicates. As a result, roughly one in five patients have incomplete health records. Providers may have an imperfect view of a patient’s medical history, patient records may be delayed, and unnecessary testing or improper treatment may be ordered.</p>\n<p>There has been much research and analysis, but one of the more focused efforts was done by ECRi in 2016 in their ECRI Institute PSO Deep Dive – Patient Identification.  In this paper, they provide some example wrong-patient events:<br>\n•   Medical-surgical unit: A patient in cardiac arrest was mistakenly not resuscitated because the care team pulled up the wrong patient’s record and adhered to a do-not-resuscitate order.<br>\n•   Surgery: A cardiac clearance meant for a different patient was given to a patient who previously had an abnormal electrocardiogram.  The patient underwent surgery and was found unresponsive in his hospital room the next day.<br>\n•   Dietary: The wrong meal tray was given to a patient with a nasogastric tube who was not to receive any food or flids orally. The patient attempted to eat the food and choked.<br>\n•   Diagnostic imaging: The wrong patient was taken to the radiology department for a magnetic resonance imaging exam with general anesthesia. The patient was intubated and sedated before the error was caught.<br>\n•   Pharmacy: A patient received a different patient’s hypertensive medication, at 10 times the intended dose. The patient was admitted to intensive care for hypotension.<br>\n•   Maternity ward: An infant received another infant’s breastmilk. The mother who produced the breastmilk was infected with the hepatitis B virus, so the infant had to be treated with hepatitis B immune globulin.<br>\n•   Doctor’s office The wrong patient was marked as deceased in the doctor’s offic’s electronic health record. All her outstanding appointments were automatically canceled. When the patient arrived for a previously scheduled appointment, she was not happy that all her appointments had been canceled.<br>\n•   Eye clinic: Two patients with the same fist name were scheduled for cataract surgery. The wrong patient was brought into the operating room and received the lens implant intended for the other patient.<br>\n•   Nursing home: A patient from a nursing home was scheduled for a computed tomography scan at an affiliated hospital. The wrong patient (who had a similar name) was picked up from the nursing home, taken to the hospital, and underwent the exam.</p>",
        "id": 250394035,
        "sender_full_name": "Richard Hornaday",
        "timestamp": 1629744228
    },
    {
        "content": "<p>Another useful resource:  <a href=\"https://www.ecri.org/Resources/HIT/Patient%20ID/Patient_Identification_Toolkit_final.pdf\">https://www.ecri.org/Resources/HIT/Patient%20ID/Patient_Identification_Toolkit_final.pdf</a></p>",
        "id": 250399101,
        "sender_full_name": "Richard Hornaday",
        "timestamp": 1629746511
    },
    {
        "content": "<p>Thanks! I have added this to the IG. Please let me know if you have more specific suggestions about how to incorporate it.</p>",
        "id": 273000393,
        "sender_full_name": "Julie Maas",
        "timestamp": 1645644960
    }
]