[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> would it be OK to move the topic of verifying email address (beyond verification code) into a separate topic?</p>",
        "id": 248518872,
        "sender_full_name": "Julie Maas",
        "timestamp": 1628189249
    },
    {
        "content": "<p>yup</p>",
        "id": 248519082,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628189349
    },
    {
        "content": "<p>not sure there is much more to be said.  Eeyore sulks away</p>",
        "id": 248519105,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628189366
    },
    {
        "content": "<p>I'm optimistic about this :) Interoperable Digital Identities, for one, should have email address in user profile and requirements  will firm up the associated identity so that existence of the address in the profile can be relied upon.</p>",
        "id": 248519302,
        "sender_full_name": "Julie Maas",
        "timestamp": 1628189475
    },
    {
        "content": "<p>change it to DID and you will have a whole herd of people piling on.</p>",
        "id": 248519486,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628189572
    },
    {
        "content": "<p>Done! Welcoming suggestions re: account types and/or workflows that help patient email address to be relied on as associated with a real world identity...</p>",
        "id": 248520250,
        "sender_full_name": "Julie Maas",
        "timestamp": 1628189770
    },
    {
        "content": "<p>Wait! Are we talking DIDs now?! I'm all over this.... <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 250673404,
        "sender_full_name": "Jim StClair",
        "timestamp": 1629921286
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194368\">@Julie Maas</span>  I'm a little fuzzy about the arbitrary relationship of an email address, but happy to talk through the approach</p>",
        "id": 250673817,
        "sender_full_name": "Jim StClair",
        "timestamp": 1629921471
    },
    {
        "content": "<p>Good point <span class=\"user-mention\" data-user-id=\"370513\">@Jim StClair</span>  - this came out of another conversation (see \"How to establish attribute...\") and we were expecting to see interest from DID &amp; OIDC enthusiasts re: using user profile data or other verifiable claims from trusted parties, to establish that one or more PII elements relate to a real world identity. I changed the topic title slightly to go beyond email address. As you might expect, if some elements of an identity like name, address, date of birth have been verified through a trusted issuer's claims linked to a DID or OIDC credential, such a credential might also be relied upon to indicate that a certain email address also relates to that individual. What requirements might have to be in place (attestation from individual, verification code, etc.) to consider the email address associated with the identity?</p>",
        "id": 250675912,
        "sender_full_name": "Julie Maas",
        "timestamp": 1629922360
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194368\">@Julie Maas</span> , great question. In the DID/VC model, we have not typically discussed assigning DIDs to specific identity attributes used for IdP, not to say it couldn't be done (and actually may have some other benefits as well). We're just now examining an IdP integration process as the \"front end\" to an issuer issuing a VC to a holder, at which point the presentation of the VC by the holder to the verifier is considered the trusted attestation of identity, and supports selective disclosure of attributes.</p>",
        "id": 250806255,
        "sender_full_name": "Jim StClair",
        "timestamp": 1629997575
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"370513\">@Jim StClair</span> I am not suggesting attribute-specific DIDs but rather disclosing of attributes, as you mention later in the note, with some responsibility on the issuer's side (or a trusted 3rd party) to first perform attribute verification prior to signing the VC.</p>",
        "id": 250808143,
        "sender_full_name": "Julie Maas",
        "timestamp": 1629998403
    },
    {
        "content": "<p>aha! yes, ma'am, I think we're in agreement. Happy to explore further!</p>",
        "id": 250813514,
        "sender_full_name": "Jim StClair",
        "timestamp": 1630000655
    },
    {
        "content": "<p>So the question in last sentence remains: if you can verify some PII, and related \"declaration of identity\" attestation from subject, is the subject's self-assertion of their email address sufficient to associate it with that digital identity or would we look to also require confirmation of control using a code of suitable entropy, or more than those two things?</p>",
        "id": 250827077,
        "sender_full_name": "Julie Maas",
        "timestamp": 1630006445
    },
    {
        "content": "<p>(if the email address is being asserted in a verifiable credential, we could also ask issuers to convey in the VC whether they have confirmed control already if they have, not could simplify the downstream workflow, by avoiding the need to reconfirm it every step.)</p>",
        "id": 250834024,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630009235
    }
]