[
    {
        "content": "<p>Can anyone here help me out with a question about Audit logging for a PAS implementation. Following the HRex guide mutually authenticated TLS is an option for PAS. Does this certify the client IP Address or just the client certificate. In the AuditEvent.agent.network I don't see a type for any data included in the certificate. I can populate the IP Address but this can easily be spoofed. Has anyone else ran into this or know how to provide accurate audit logging for MA TLS?</p>",
        "id": 211816985,
        "sender_full_name": "Benjamin Langley",
        "timestamp": 1601498334
    },
    {
        "content": "<p>the AuditEvent.agent.network.address would be best to hold the hostname, the IP numeric value is less useful (especially in a NAT environment). Tied to this one should use BCP195 guidance which would force server-name-indication validation. Thus there is a strong relationship between the hostname you tried to connect to with the hostname declared in the certificate that was presented and authenticated. Thus it is really a set of steps that gives you the assurance, not just one string.</p>",
        "id": 211827281,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601500021
    },
    {
        "content": "<p>see BCP195 - <a href=\"https://tools.ietf.org/html/bcp195\">https://tools.ietf.org/html/bcp195</a></p>",
        "id": 211827345,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601500068
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> - is the client hostname more reliable than the IP? If they access via a web client won't the hostname be null?</p>",
        "id": 212068691,
        "sender_full_name": "Benjamin Langley",
        "timestamp": 1601642652
    },
    {
        "content": "<p>Correct observation. The guidance given was more on \"Server Name Indication\", which is intended to make sure that the server you got connected to was the intended server. The client is much less reliant on hostnames, but still has the problem of NAT.  Are you using OAuth, or mutual-auth-TLS? In the case of OAuth, you would be better to record the client_id; as that is what is authenticated. The machine IP address is much less important.</p>",
        "id": 212075547,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601646115
    },
    {
        "content": "<p>hmm, well, the codes allowed don't really have a good code for client_id..  might need to think about a CR to either expand and/or relax that binding.</p>",
        "id": 212076081,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601646331
    },
    {
        "content": "<p>Note that the authentication step would be recorded as one auditEvent, where the transaction details would be recorded as a second event. Might be too focused on including in one AuditEvent the transaction details and the details of the authentication... Good discussion</p>",
        "id": 212076384,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601646458
    },
    {
        "content": "<p>Yes the network types are very restrictive. I'm using mutually authenticated TLS not OAuth. So I will have the client certificate but not a client_id from the authentication. One thought was to use the IP in the network and then put the id in the altId field and the certificate CN in the name</p>",
        "id": 212082786,
        "sender_full_name": "Benjamin Langley",
        "timestamp": 1601649460
    },
    {
        "content": "<p>so the successful TLS authentication should generate a standalone AuditEvent.  This is most true of TLS authentication failures. Sometimes the successful authentications are repressed as they would be very noisy.  The TLS driven AuditEvent can be more expressive. IHE has not defined an AuditEvent pattern for this TLS authentication as often this event is handled fully within general purpose IT layers and thus difficult to catch and duplicate in a healthcare specific audit log. Thus expected when this level of detail is needed, the system logs will be inspected. <br>\nThe AuditEvents from things that happen next (e.g. like a REST operation) would be a different AuditEvent. What is important is using the .network consistently between these two AuditEvents (or between how the AuditEvent looks and how the system logs for TLS look).</p>",
        "id": 212096783,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601655675
    }
]