[
    {
        "content": "<p>Hello!<br>\nI have a couple of questions regarding denied/reversed item or services on ClaimResponse resources<br>\nIs there a way to indicate (at a line item level) whether an item or service was denied and the reason behind that decision - different processing policies, etc.<br>\nThe claim itself can be an original but different line items can be denied.<br>\nI am thinking of two options:</p>\n<p>Creating ClaimResponse for each line item and using outcome and disposition elements to indicate the status of the item<br>\nCreating a ClaimResponse for all of the items and using the item.adjudication.reasonCode to indicate why that particular item/service was denied.<br>\nThank you!</p>",
        "id": 241144295,
        "sender_full_name": "Katerina Nikolova",
        "timestamp": 1622638656
    },
    {
        "content": "<p>Typically there'd be one ClaimResponse for each Claim (though you might receive updates if some items were deferred).  item.adjudication.amount  and value convey the 'decision' and adjudication.reasonCode conveys why.</p>",
        "id": 241148448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622640579
    },
    {
        "content": "<p>Thank you for the answer! What if there are multiple reasons? On item level for adjudication you could have only one adjudication.reasonCode.</p>",
        "id": 241151513,
        "sender_full_name": "Katerina Nikolova",
        "timestamp": 1622641898
    },
    {
        "content": "<p>At the moment, I guess you'd need to use an extension, but I'd encourage you to submit a change request asking for adjudication.reasonCode to be allowed to repeat in the future.</p>",
        "id": 241292166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622655286
    },
    {
        "content": "<p>we have an extension on item - item.reviewAction that allows us to send back the review action code as well as multiple review reason codes.  that is where we have mapped the X12 HCR data segment</p>",
        "id": 241293761,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1622656064
    },
    {
        "content": "<p>Would it be possible to use repeats of item.adjudication to capture the multiple .reasonCodes (maybe not what is desired though)?</p>\n<p>item[0].adjudication[0].reasonCode = &lt;reason1&gt;<br>\n  item[0].adjudication[1].reasonCode = &lt;reason2&gt;</p>",
        "id": 241298261,
        "sender_full_name": "John Silva",
        "timestamp": 1622657775
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> What is the meaning of multiple adjudication repetitions on a single item?  What would it mean if they had different amounts?</p>",
        "id": 241322450,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622669418
    },
    {
        "content": "<p>it's possible to have multiple adjudications as there are different categories.  The question would still apply in a different light - what is the meaning of multiple repetitions with the same category?</p>",
        "id": 241326741,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1622672019
    }
]