[
    {
        "content": "<p>Something Im not sure I have seen in the DTR guide is how the DTR app is supposed to tell the EMR, \"This is the bundle you need to create\".</p>\n<p>In the absence of CRD and/or DTR, sending a Bundle is just going to be a mass of resource data, OR the EMR has to know all the payer rules to construct a Bundle. That being said, it seems like the stance that PAS could be  implemented separately from CRD and DTR should not be persisted.</p>",
        "id": 237524967,
        "sender_full_name": "Sean O'Quinn",
        "timestamp": 1620231979
    },
    {
        "content": "<p>You don't have to know all the payer rules to construct an X12 message now - it's just that if you don't provide everything the payer wants, they'll kick it back and ask for more information.  The general set of \"what's necessary to appear in the Bundle to allow creation of a prior authorization 'in general' is clear - and in some cases, the EHR may have a clue that certain types of reports or observations are always needed for certain types of prior authorizations and included those by default.  The main thing DTR avoids is all of the back-and-forth of submit, kick back for more information, submit with more information, kick back for still more information cycle.</p>",
        "id": 237576966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620253384
    },
    {
        "content": "<p>It also makes it more likely that the information will be expressed in a sufficiently computable form so that the payer can evaluate it automatically rather than having a human review - with the resulting impact on response time.</p>",
        "id": 237577027,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620253433
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , So the idea of DTR isn't to trim the \"fat\" off the bundle, but really just to ensure nothing is missing?</p>",
        "id": 238527991,
        "sender_full_name": "Sean O'Quinn",
        "timestamp": 1620846461
    },
    {
        "content": "<p>Prior auth submission without DTR is a \"send what's always required\" + \"send what extra stuff you think is required\".  Some of that is unnecessary fat and is sometimes missing necessary lean - and the prior authorization process will generally ignore that fat and complain about the missing lean and through a sequence of back and forth eventually get the payer what they need to make a decision.  With DTR, most of the time, there should be no back and forth and minimal submitted fat.  So prior authorization with DTR is certainly more <em>efficient</em>.  But that doesn't make DTR a pre-requisite.</p>",
        "id": 238553448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620858271
    }
]