[
    {
        "content": "<p>Hello,</p>\n<p>I am working on the PAS IG. We know that a PA request may contain fundamentally one or more than one service request. And there can be a lot of to &amp; fro transactions between the Provider and the Payer before the request is fully processed by the payer. This means in terms of FHIR, we will have multiple Claim and ClaimResponse resources related to a single PA request and NONE of these resources would be updated as each transaction leads to a fresh Claim or ClaimResponse resource depending on the actor involved. I understand that we can use the Patient Event Trace number to reconcile all the Claim &amp; Claim Response resources related to a single PA request. But if a user/system wants to know the latest information related to a specific service within the request or the entire request as a whole, what would be the logic/mechanism to do so? In Principle if we lookup by the Patient Even trace number as identifier in the Claim or ClaimResponse it would end up returning all the resources. How to judge which resource is the latest? Is this something that has been standardized or in the process of being standardized or is it somethinf that each vendor has to implement in their own way. I was wondering would it be ok to use the identifier field to hash out the something based on the concatenation of the Patient Event trace numberand the timestamp when resource was generated. I would be grateful anyone could shed light on this. Thanks in advance. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"236429\">@Benjamin Langley</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 264531403,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1639184679
    },
    {
        "content": "<p>Right now, PAS doesn't support 'search' for Claim or ClaimResponse at all.  Everything is managed through the $submit operation or the $inquiry operation.  And the $inquiry always gives \"current state\".  If and how systems hold onto past submissions and responses is up to them and there's no expectation these will be exposed over the FHIR interface.   That said, both Claim and ClaimResponse have a 'created' element, which should be able to differentiate which is most recent for a given identifier.</p>",
        "id": 264542872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639200448
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thank you for the prompt response!</p>",
        "id": 264739004,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1639415828
    }
]