[
    {
        "content": "<p>Can anyone tell me why we need the admission and discharge date slices when there is a referene to an encounter? Seems like extra work when the receiver can get that information from the encounter</p>",
        "id": 242278213,
        "sender_full_name": "Sean O'Quinn",
        "timestamp": 1623363200
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 242297789,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623382649
    },
    {
        "content": "<p>I happened to be learning about CMS rules and this is part of it: </p>\n<p>\"Admission, Discharge, and Transfer Event Notifications: CMS is modifying Conditions of Participation (CoPs) to require hospitals, including psychiatric hospitals and CAHs, to send electronic patient event notifications of a patient’s admission, discharge, and/or transfer to another healthcare facility or to another community provider or practitioner. This will improve care coordination by allowing a receiving provider, facility, or practitioner to reach out to the patient and deliver appropriate follow-up care in a timely manner. This policy will be applicable 12 months after publication of this rule.\"</p>\n<p><a href=\"https://www.cms.gov/newsroom/fact-sheets/interoperability-and-patient-access-fact-sheet\">https://www.cms.gov/newsroom/fact-sheets/interoperability-and-patient-access-fact-sheet</a></p>",
        "id": 242388380,
        "sender_full_name": "John Silva",
        "timestamp": 1623437659
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span> , I am aware of this CMS regulation, but having a hard time understanding how that answers my question. Is there more to your comment?</p>",
        "id": 242390795,
        "sender_full_name": "Sean O'Quinn",
        "timestamp": 1623438844
    },
    {
        "content": "<p>Nothing more; just wanted to convey this if you weren't already aware of it.<br>\n(From a technical perspective if the encounter is a FHIR Encounter resource I suppose if there was a notification mechanism, e.g. FHIR Subscription on created or updated Encounter, that could be used, then maybe it would meet the requirement; but just a guess.)</p>",
        "id": 242396891,
        "sender_full_name": "John Silva",
        "timestamp": 1623442174
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"274876\">Sean O'Quinn</span> <a href=\"#narrow/stream/208874-Da-Vinci.20PAS/topic/Slices.20-.20supportingInfo.3AAdmissionDates.2FDischargeDates/near/242278213\">said</a>:</p>\n<blockquote>\n<p>Can anyone tell me why we need the admission and discharge date slices when there is a referene to an encounter? Seems like extra work when the receiver can get that information from the encounter</p>\n</blockquote>\n<p>Sean, we discussed your question today on an internal team call.  There are a couple of reasons why:<br>\na) the admission date can be a range of dates on the claim submission and both the admission date and discharge date can be a range on the claim inquiry.  Encounter just has a period, so we would have needed to add an extension to Encounter to support this.<br>\nb) the Claim inquiry has no other encounter information besides the admission and discharge dates so we wanted to maintain some consistency<br>\nc) we believe that authorizations might just have an admission or discharge date without other information from the CL1, so we wanted an easier way than the indirection of the Encounter resource with just a period.</p>\n<p>If this isn't justification enough for you, I encourage you to raise a Jira issue about it.</p>",
        "id": 242404228,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1623446063
    }
]