[
    {
        "content": "<p>For questions/info on SMART App initiation, API access, related CDS Hooks, and what to receive back when authorized.</p>",
        "id": 183190273,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1576091582
    },
    {
        "content": "<p>When the SMART App receives the authorization token/number from the payer, the suggestion is to use DocumentReference for now to document that in the EHR.  We're looking whether there is a better alternative for HIMSS.</p>",
        "id": 183190423,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1576091686
    },
    {
        "content": "<p>I missed some of that discussion so I'm not sure I understand. Are you saying the SMART App would perform a REST create interaction to write a new DocumentReference in the EHR? Is that functionality widely supported by other EHRs? Would we actually store the token as an element in the DocumentReference, or would it merely serve as a record that the token had been received?</p>",
        "id": 183192316,
        "sender_full_name": "Nick Radov",
        "timestamp": 1576092635
    },
    {
        "content": "<p>So far the suggestion is to provide the actual authorization token/number in DocumentReference.</p>",
        "id": 183192515,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1576092741
    },
    {
        "content": "<blockquote>\n<p>So far the suggestion is to provide the actual authorization token/number in DocumentReference.</p>\n</blockquote>\n<p>Would that token go in securityLabel, content, or some other element?</p>",
        "id": 183192965,
        "sender_full_name": "Nick Radov",
        "timestamp": 1576093007
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"220686\">@Nick Radov</span> : content.  Some are talking about a form that includes it.</p>",
        "id": 183195307,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1576094395
    },
    {
        "content": "<p>This sounds quite contrived...</p>",
        "id": 183195415,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1576094409
    },
    {
        "content": "<p>not just 'quite contrived', but certainly NOT secure</p>",
        "id": 183197376,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576095535
    },
    {
        "content": "<p>Alternative suggestion?  I can come up with some, but this is in context of HIMSS.</p>",
        "id": 183204786,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1576100438
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> : Can you clarify the security concern with DocRef using XHTML?<br>\n<span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> : ClaimResponse.preAuthRef with ClaimResponse.use=preauthorization and associated item(s) is appropriate, but not quite supported yet for HIMSS.</p>",
        "id": 183279618,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1576170316
    },
    {
        "content": "<p>I was referring to the point about putting a security token into a DocumentReference</p>",
        "id": 183279994,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576170590
    },
    {
        "content": "<p>Placing a security token into any FHIR resource is a bad idea</p>",
        "id": 183280079,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576170632
    },
    {
        "content": "<blockquote>\n<p>Placing a security token into any FHIR resource is a bad idea</p>\n</blockquote>\n<p>Could you expand on this? What type of potential vulnerabilities could it cause?</p>",
        "id": 183280219,
        "sender_full_name": "Nick Radov",
        "timestamp": 1576170732
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> : We were actually talking about the prior-authorization reference number/token, definitely NOT a security token....:)</p>",
        "id": 183281145,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1576171453
    },
    {
        "content": "<p>AH, well then please don't use \"authorization token\". I know that might be the way that it is refereed to, but that phrase is far more broadly (whole of IT Security across the globe and all verticals) as security token.</p>",
        "id": 183281277,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576171552
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I had used \"authorization token/number\".....:)</p>",
        "id": 183282920,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1576172760
    },
    {
        "content": "<p>PAS IG says \"This will require that the provider system authenticates to the payer system or an intermediary. The specifics of how this authentication are covered is handled within the Da Vinci HRex Implementation guide\". I am assuming this will not be launched in a patient context but will be a system-system kind of interaction. What type of grant type will be used for this exchange?</p>",
        "id": 245747695,
        "sender_full_name": "Gunjit Chhatwal",
        "timestamp": 1626123513
    },
    {
        "content": "<p>I'd expect a system/system interaction would use <a href=\"https://hl7.org/fhir/uv/bulkdata/authorization/index.html\">https://hl7.org/fhir/uv/bulkdata/authorization/index.html</a></p>",
        "id": 245754232,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626126158
    },
    {
        "content": "<p>right. would that be true for autheticating systems launching SMART on FHIR apps from CRD cards as those are not member/patient initiated?</p>",
        "id": 245771032,
        "sender_full_name": "Gunjit Chhatwal",
        "timestamp": 1626141046
    },
    {
        "content": "<p>If you are launching a user-facing app from a CDS Hooks card, that would typically use the SMART App Launch</p>",
        "id": 245771116,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626141158
    },
    {
        "content": "<p>since the user in this scenario is a provider, would the payer system then authenticate the system as a whole (SMART backend services) or just the user initiating the request. I believe latter would not be possible as the payers wont have provider's user credentials.</p>",
        "id": 245772056,
        "sender_full_name": "Gunjit Chhatwal",
        "timestamp": 1626142213
    },
    {
        "content": "<p>For the CDS Hooks API call, authentication would occur according to the CDS Hooks specification. This is essentially system level authentication where the client is the EHR and the server is the CDs provider. </p>\n<p>For the app that gets launched from a CDS Hooks card, this would follow the SMART App Launch, where the EHR is the SMART server and the payer app is the client</p>",
        "id": 245772478,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626142781
    },
    {
        "content": "<p>I understand that the CDS hook API call would use JWT as per the CDS hooks specification. However, i did not understand the second point where EHR is the smart server and payer app is the client. So, the provider user would be authenticated again the EHR server? How would the payer app know that the it is being launched securely?</p>",
        "id": 245774891,
        "sender_full_name": "Gunjit Chhatwal",
        "timestamp": 1626145889
    },
    {
        "content": "<p>In SMART App Launch, the (payer) app connects directly to an SMART (EHR) server; at the first step of the process it learns the FHIR endpoint passed to the app via <code>iss</code> (generally the app maintains a list of configured FHIR endpoints where it's registered, and can check to make sure that the incoming value is on the list)</p>",
        "id": 245775093,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626146087
    },
    {
        "content": "<p>Understood. so the onus of authenticating the provider using the payer app (shared via card) is on the EHR launching the app and not on the payer. payer just needs to ensure that the system launching the app is one that it recognizes. Thanks, again.</p>",
        "id": 245775510,
        "sender_full_name": "Gunjit Chhatwal",
        "timestamp": 1626146667
    },
    {
        "content": "<p>Sure. And if the app wanted to authenticate the end user, it can lean on the EHR for this (by requesting <code>openid fhirUser</code> scopes).</p>",
        "id": 245775718,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626146990
    },
    {
        "content": "<p>Although I dont see the need to genrate a token using SMART on FHIR launch flow since the EHR is already sharing the token that can be used by the payer app to retrieve required details (per CDS specifications).</p>",
        "id": 245776372,
        "sender_full_name": "Gunjit Chhatwal",
        "timestamp": 1626147945
    },
    {
        "content": "<p>If the CDS token you're getting lasts long enough and you don't require a user authentication and you don't need any additional scopes, then you don't need to do a smart app launch. You can just link to an outside web page via CDS card. But using the smart app launch provides a consistent approach, making it less likely that you will inadvertently introduce mistakes into the flow --and allows you to take advantage of additional apis like smart web messaging for deeper interaction with the ehr.</p>",
        "id": 245825768,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626183566
    }
]