[
    {
        "content": "<p>Right now, the expectation is that TestScripts are fully specified -- they contain all the information necessary for two independently written test execution engines to execute a set of test steps in the same way.  That has some nice properties, but it presents a really high bar for anyone that wants to write tests for FHIR APIs -- either go the 'standardized' route and learn how to write TestScripts, or go their own way so they can leverage their existing tools and experience for testing RESTful APIs.</p>",
        "id": 236868961,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1619802581
    },
    {
        "content": "<p>I think it would be very useful to be able to represent the concept of TestScript a bit more abstractly, so if someone wants they can write a test using the tools of their choice, but present a common API for describing the test (even if it is just a name and description), executing the test (via an operation on /TestScript, like /TestScript/$execute), and reporting the results of the test (TestResult).  That way you can either write tests as a 'fully specified' TestScript (which could be a profile on TestScript where 'test' has a min of &gt;= 1, and that has a different set of expectations on what you can use it for), <em>or</em> provide your own testing software that provides a standardized FHIR API that can be easily integrated into multi-purpose FHIR testing systems.</p>",
        "id": 236869005,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1619802599
    },
    {
        "content": "<p>We are looking at capturing what we (currently) call \"acceptance criteria\"</p>",
        "id": 236876212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619805487
    },
    {
        "content": "<p>This is not really a test description (or is it?)</p>",
        "id": 236876257,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619805507
    },
    {
        "content": "<p>It would take the form of somewhat structured narrative, like Gherkin</p>",
        "id": 236876285,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619805529
    }
]