[
    {
        "content": "<p>Moi,<br>\nTestaillessa tuli vastaan tilanteita, joissa mittaus on suoritettu toisella aikavyöhykkeellä. Sovelluksemme kirjoittaa nyt narratiiviin vain päivämäärän ja kellonajan implementointioppaan mukaisella tavalla. Omatietovaranto ilmeisesti ilmoittaa ajan aina Suomen aikavyöhykkeen mukaan? Kansalaiselle näkyy siis kaksi eri aikaa, eikä mitään erityisen selvää selitystä siitä, miksi ajat poikkeavat toisistaan.<br>\nToisaalta tuo on ihan looginenkin toteutus.<br>\nOnko ajatuksia tästä? Pitäisikö aikavyöhyke ottaa jotenkin erikseen huomioon?</p>",
        "id": 196905427,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1588949824
    },
    {
        "content": "<p>Hei,<br>\nOmakannassa on otettu kehityslistalle ajankohdan näyttäminen niin, että ajankohta näytetään sellaisena kuin se on resurssiin tallennettu, eikä muuteta näytettävää aikaa Suomen aikavyöhykkeen mukaiseksi.</p>",
        "id": 197909916,
        "sender_full_name": "Miia Riihinen",
        "timestamp": 1589794165
    },
    {
        "content": "<p>On varmaan OK noinkin.</p>\n<p>Haluan korostaa, että tuokaan ei ollut varsinainen kehitysehdotus ja ei ole sekään välttämättä ideaali ratkaisu. Varmaan selkeintä olisi, jos se tieto siitä aikavyöhykkeestä olisi mukana toisessa esityksistä tai molemmissa. Tai voisi olla erikseen ilmaistu silloin, kun aikavyöhyke on jokin muu kuin Suomen?</p>",
        "id": 197982925,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1589829298
    },
    {
        "content": "<p>Haluaisitteko avata keskustelua, jota tuon osalta kävitte ja kuinka päädyitte tuohon ratkaisuun?</p>",
        "id": 197982967,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1589829326
    },
    {
        "content": "<p>Pohdittiin asiaa asiakkaan ja selkeyden näkökulmasta. Narratiivin ja Omakannan ajankohdan tulee olla samat, koska eroavaisuudet voivat sekoittaa asiakasta. Koska narratiivissa ei välttämättä ole aikavyöhykettä, sitä ei nostettaisi sen vuoksi myöskään ajankohtaan. Lisäksi mietittiin sitä, että esim. aamumittaus on aamumittaus, vaikka se olisi tehty eri aikavyöhykkeellä ja olisi asiakkaalle sen puolesta selkeä ilman aikavyöhykkeen näyttämistä.</p>\n<p>Jos koetaan, että aikavyöhykkeen näyttäminen tuo lisäarvoa, voidaan selvittää sitä, että aikavyöhyke näytettäisin silloin, kun se on joku muu kuin Suomen aika. Tällöin aikavyöhyke pitäisi löytyä sitten myös narratiivista, jotta eroavaisuuksia ei tule.</p>",
        "id": 198040002,
        "sender_full_name": "Miia Riihinen",
        "timestamp": 1589879687
    },
    {
        "content": "<p>Aamumittaus on toki aamumittaus, mutta toisaalta lääke, joka täytyy ottaa 24 tunnin väliajoin saattaa olla otettu ensin aamulla ja sitten iltapäivällä - ja silti 24 tunnin väliajoin.</p>",
        "id": 198184489,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1589974047
    }
]