[
    {
        "content": "<p>Laitoin implementers kanavalle kysymystä tuosta kalibrointikoodista. Tässä siihen linkki, jos on kiinnostusta seurata tai liittyä keskusteluun: <a href=\"#narrow/stream/179166-implementers/topic/Additional.20string.20to.20device.20resource\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Additional.20string.20to.20device.20resource</a><br>\nYritin perehtyä tuohon DeviceMetric profiiliin, ja tuntuu, että se on enemmänkin tarkoitettu ns calibrointi \"actionille\". Kuitenkin kaikki muu tarvittava tieto saataisiin tallennettua device resourceen, niin kokonaisen uuden resurssin lisääminen pelkästään yhtä stringiä varten tuntuisi melko raskaalle ratkaisulle?</p>",
        "id": 211881189,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1601540805
    },
    {
        "content": "<p>Oli puhetta Tikessä myös Devicen testaamisesta toiselle serverille. Mitä serveriä olisi hyvä käyttää testaamiseen? Olemme olleet toistaiseksi aika pitkään määrittelyn ikiloopissa, ja ei olla oikein päästy testivaiheeseen asti omien resurssien kanssa. Kaikki neuvot tähän ovat tervetulleita. Ehkä näistä voisi olla jotain seuraavan kommentointikokouksen koulutusosiossa? Tosin taisimme sopia, että testattaisiin tämän kuun loppuun mennessä.</p>",
        "id": 211881817,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1601541217
    },
    {
        "content": "<p>Uuden resurssityypin lisääminen on ehdottomasti turhan raskas keino, jos kalibrointikoodi voidaan laittaa myös deviceen. Onko <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> kokemusta, missä tällaista kannattaa testata?</p>",
        "id": 212649966,
        "sender_full_name": "Aleksi Aho",
        "timestamp": 1602136951
    },
    {
        "content": "<p>Tuosta \"ehdottomasti turhan raskas keino\" voi olla eri mielipiteitä. <span class=\"user-mention\" data-user-id=\"196057\">@Lauri Karppinen</span> kuvasi casen, jossa kalibrointi on kertaluontoinen ja tehtaalla suoritettava. Toisaalta on olemassa myös suuri joukko laitteita, joita kalibroidaan pitkin laitteen elinkaarta. Onko sitten yhteensopivuuden kannalta järkevää, että yhdelle erityistapaukselle tehdään omanlaisensa kuvaus, ja kaikki muut tapaukset hoidetaan eri tavalla?</p>",
        "id": 213887509,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1603181960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196057\">@Lauri Karppinen</span> <span class=\"user-mention\" data-user-id=\"222926\">@Aleksi Aho</span> testiserveriksi suosittelisin <a href=\"https://hapi.fhir.org/\">https://hapi.fhir.org/</a>. On lähellä Omatietovarannon omaa toteutusta, mutta ei ole rajoituksia profiilien luonnin suhteen tms.</p>",
        "id": 213887634,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1603182030
    },
    {
        "content": "<p>En ole ilmeisesti onnistunut selittämään meidän use casea tuon koodin suhteen tarpeeksi hyvin. Tässä vielä tarkennus mitä tuolla kalibrointi koodilla meidän tapauksessamme tarkoitetaan:</p>\n<p>\"Kalibrointikoodi on tekstimuotoinen koodi, jolla mittalaite ohjelmallisesti säätää itsensä tarkaksi tietyn virtausanturierän kanssa käytettäväksi. Eri virtausantureiden tuotantoerissä on pientä variaatiota, joka korjataan käyttämällä kalibrointikoodia. Kalibrointikoodi sisältää eräkohtaiset korjauskertoimet sekä koodin tarkistussumman.</p>\n<p>Kalibrointikoodi on laitteen kannalta erittäin tärkeä, koska laitteen mittaussignaali ja siten saadut mittaustulokset säätyvät - kalibroituvat - sen mukaan.</p>\n<p>Koodin tallennus on laaduntarkkailun vuoksi tarpeellinen, sen pohjalta voi jälkikäteen tarkistaa onko mittaukset tehty oikealla kalibrointikoodilla ja myös milloin kalibrointikoodi on vaihdettu (mittausten päivämääristä ja kellonajoista). Jos mittaustulokset muuttuvat kalibrointikoodin vaihtumisen hetkellä, voi tämä muutos johtua paitsi oikeasta mitattavan keuhkojen toiminnan muutoksesta myös kalibrointikoodin vaihtamisesta. Tällöin pitää selvittää kuinka tutkittava/tutkija sen vaihtoi. Eli vaikkapa, että oliko ennen tätä hetkeä tehdyt mittaukset tehty varmasti oikealla kalibrointikoodilla (unohdus). Tai onko sillä hetkellä otettu varmasti oikean tuotantoerän kalibrointikoodi käyttöön (koodien sekaantuminen).</p>\n<p>Virtausanturin kalibrointikoodi on verrattavissa veren glukoosimittarin mittaliuskan koodiin.</p>\n<p>Kalibrointikoodi on yleensä erilainen eri tuotantoerille, mutta ei välttämättä. Eli tuo ei yksiselitteisesti kerro tuotantoerää, mutta koska se on jokaiselle tuotantoerälle ominainen, se näin ollen toimii tarvittaessa myös virtausanturin tuotantoerän tunnisteena. Joka tapauksessa sen perusteella voidaan virtausanturierät rajoittaa huonoimmillaankin muutamaan. Medikrossa on tieto jokaisen virtausanturierän kalibrointikoodeista.\"</p>\n<p>devicemetric.calibration tarjoaisi paikan kalibroinnille, mutta sielläkään ei tunnu olevan paikkaa stringille, joka on ainoa asia, mitä meidän pitäisi kalibrointiin liittyen tallentaa. Toisena vaihtoehtona tuossa linkkaamassani viestissä implementers kanavalle ehdotettiin: <a href=\"http://Device.property\">Device.property</a> elementtiä. John Moehrke viestin perusteella se  olisi rajoittamaton joukko arvo-avain pareja, mutta en nyt suoraan ymmärtänyt senkään käyttöä. Propertyn alta löytyvät ainoastaan: type, valueQuantity ja valueCode.</p>\n<p>Vaikeaa sanoa, mikä nyt olisi se kaikista \"oikein\"/paras tapa tallentaa tuo kalibrointikoodin stringi. Alunperin tuohon extensionin käyttöön on suunnitelmissamme päädytty varmaan juuri siksi, ettei sitä juuri oikeaa paikkaa tuntunut löytyvän. Resurssi tuolle extensionille on jo valmiiksi tehtynä, joten liputan edelleen sen puolesta. Ehdotuksia tietenkin otetaan edelleen vastaan, ja pitäähän tuo device resurssi tietenkin saada mahdollisimman yleiskäyttöiseksi, ja kaikille sopivaksi. </p>\n<p>Oliko asia niin että sinne device resurssiin jokatapauksessa täytyy lisätä paikka sille omatietovarannon creatingApplication extensionille. Onko siitä jotain haittaa, jos sinne lisätään myös meidän calibrationCode extension?</p>",
        "id": 214672310,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1603787986
    }
]