[
    {
        "content": "<p>Hi,<br>\nWe (or our partner) may want to store some fitness test results (from set of tests for elder people and such). There might be force tests such as (maximum) one leg isometric knee extension force. The problem is, there exists a ton of different movements, for example for knee extension there is: isometric knee extension (at angle X) and dynamic knee extension (+ with force curve) (also the weighting structure can vary significantly) both for legs separately and combined. One might also need to store rate of force development thought it's maybe more of sports stuff.<br>\nHowever, knee is a simple joint so there's only simple movements and a reasonable amount of joints. For other more complex movements there is more variation, e.g. for squats some types you can find be mentioned are: isometric (at angle X) squat, full squat, normal squat (parallel), 90 degree squat, half squat and 1/4 squat and bench squat and using free weights or smith and do one leg version or so called Bulgarian version. Fortunately for larger scale testing only some of those squat versions are used though. The amount of different multiple joint/half body/full body movements is huge.</p>\n<p>So before just randomly suggesting some profiles without a big picture I want to ask: How should fitness test/training result profiles be constructed i.e. all the different maneuvers be profiled? How about the amount of sets and repetitions (and rest intervals) if i.e. physiotherapist has ordered a training regime?</p>",
        "id": 156691397,
        "sender_full_name": "Esko Niinim채ki",
        "timestamp": 1548252568
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194089\">@Esko Niinim채ki</span> <br>\nFor us to get a better understanding of the information you'd like to store, could you explain more clearly the use case behind the fitness tests you mentioned (how the fitness tests are conducted, how the results would be stored, who stores the results, and maybe some examples of actual test results)?</p>\n<p>We already have some fitness-related profiles in Kanta PHR for measurements, for example <a href=\"https://simplifier.net/finnishphr/fiphr-distance-stu3\" target=\"_blank\" title=\"https://simplifier.net/finnishphr/fiphr-distance-stu3\">https://simplifier.net/finnishphr/fiphr-distance-stu3</a>, <a href=\"https://simplifier.net/finnishphr/fiphr-moderatetovigorouspatime-stu3\" target=\"_blank\" title=\"https://simplifier.net/finnishphr/fiphr-moderatetovigorouspatime-stu3\">https://simplifier.net/finnishphr/fiphr-moderatetovigorouspatime-stu3</a>, <a href=\"https://simplifier.net/finnishphr/fiphr-stepstaken-stu3\" target=\"_blank\" title=\"https://simplifier.net/finnishphr/fiphr-stepstaken-stu3\">https://simplifier.net/finnishphr/fiphr-stepstaken-stu3</a>. But it seems that what you'd want to store are somewhat more complex? Have you looked whether the Observation resource would be fit for your test results? You could also think about whether the fitness tests could be stored as Questionnaires, and the test results as QuestionnaireResponses, and maybe have some of the \"answers\" stored as separate Observations and reference to them from the QuestionnaireResponse.</p>\n<p>About the possible training regime, would it be a workout plan that would be stored? And then as you follow the plan, you would store along the way what you've actually done?</p>\n<p>You could actually bring this up for discussion also to the online meetings of Kanta PHR support project (PH SIG) <a href=\"http://www.hl7.fi/sig-toiminta/personal-health-sig/omatietovarannon-tukiprojekti/\" target=\"_blank\" title=\"http://www.hl7.fi/sig-toiminta/personal-health-sig/omatietovarannon-tukiprojekti/\">http://www.hl7.fi/sig-toiminta/personal-health-sig/omatietovarannon-tukiprojekti/</a>.</p>",
        "id": 156771149,
        "sender_full_name": "Anna Korpela",
        "timestamp": 1548335858
    },
    {
        "content": "<p>Hi, </p>\n<p>Sorry for the late reply. I've been a bit too busy lately but I'd like to discuss about this in the next meeting. I will make some preparations based on your answer <span class=\"user-mention\" data-user-id=\"194340\">@Anna Korpela</span> .</p>",
        "id": 157855561,
        "sender_full_name": "Esko Niinim채ki",
        "timestamp": 1549628785
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194089\">@Esko Niinim채ki</span>  Great, we'll get back to this next Wednedsay then!</p>",
        "id": 157857499,
        "sender_full_name": "Anna Korpela",
        "timestamp": 1549631003
    },
    {
        "content": "<p>Hello, I am working on representing workout information like workout type, repetitions, equipment etc. using FHIR. Are there any further approaches yet? Are there any recommendations about most suitable resources, profiles or references to other projects.</p>",
        "id": 202569943,
        "sender_full_name": "Armin Griebler",
        "timestamp": 1593610902
    },
    {
        "content": "<p>Hello. We have some fitness profiles in Finnish PHR, but unfortunately, we have no workout profiles/ approaches yet. You can find our current profiles from Finnish PHR STU3 project in simplifier(<a href=\"https://simplifier.net/FinnishPHR/~introduction\">https://simplifier.net/FinnishPHR/~introduction</a>).</p>",
        "id": 202958739,
        "sender_full_name": "Aleksi Aho",
        "timestamp": 1594019282
    }
]