[
    {
        "content": "<p>To continue discussion from topic <a href=\"#narrow/stream/50-finnish-PHR/subject/Available.20scopes/near/188781\" title=\"#narrow/stream/50-finnish-PHR/subject/Available.20scopes/near/188781\">https://chat.fhir.org/#narrow/stream/50-finnish-PHR/subject/Available.20scopes/near/188781</a>, how can the identity of the Patient be verified by the client app?</p>\n<p>The PHR authorization guide (<a href=\"https://www.kanta.fi/documents/20143/91486/PHR+authorization.pdf/9fdb48d0-a6c8-0bc6-10ab-35495ca030b4\" target=\"_blank\" title=\"https://www.kanta.fi/documents/20143/91486/PHR+authorization.pdf/9fdb48d0-a6c8-0bc6-10ab-35495ca030b4\">https://www.kanta.fi/documents/20143/91486/PHR+authorization.pdf/9fdb48d0-a6c8-0bc6-10ab-35495ca030b4</a>) states in chapter 5: <em>user Required for confidential clients that use strong authentication. Value of this parameter is application user’s social security number</em>.</p>\n<p>How is this supposed to work? Is it supposed that if the client has already performed strong authentication itself, there's no need to do it again during authorization process, rather the ID provided by the client app is trusted to be valid? Or is it a mechanism where the client has not strongly authenticated the user, but has asked the user to enter it, and expects it to be verified during strong authentication of the authorization process?</p>",
        "id": 153999401,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1537783032
    },
    {
        "content": "<p>There is a concern among application vendors over how they can identify the Kanta PHR user. If there's no way to check the identity of the person associated with a Kanta PHR account, apart from the uuid pseudonym, there is an immediate risk that one person's data is written to another person's Kanta PHR account. If the client apps could somehow identify the Kanta PHR account, they could mitigate this risk.</p>",
        "id": 153999406,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1537783278
    },
    {
        "content": "<p>Hi, for security-reason Kanta PHR can give only user pseudonym to client software. The client software must itself take care of user identification. If there is strong authentication (for example <a href=\"http://suomi.fi\" target=\"_blank\" title=\"http://suomi.fi\">suomi.fi</a>) in client software, it is possible to use SSO. We will specify authentication flow and user identification in the next version of authorization guide (will be published as soon as possible).</p>\n<p>We are concerning giving user's name to client software. This needs discussions with Population Register Centre (VRK). This would affect to Kanta PHR authentication flow and may need consent from user. </p>\n<p>We can discuss this topic at next Tuesdays meeting if there is time (<a href=\"http://www.hl7.fi/sig-toiminta/personal-health-sig/omatietovarannon-tukiprojekti/\" target=\"_blank\" title=\"http://www.hl7.fi/sig-toiminta/personal-health-sig/omatietovarannon-tukiprojekti/\">http://www.hl7.fi/sig-toiminta/personal-health-sig/omatietovarannon-tukiprojekti/</a>).</p>",
        "id": 154004334,
        "sender_full_name": "Pirjo Vuorikallas",
        "timestamp": 1538469515
    },
    {
        "content": "<p>Excellent, thanks!</p>",
        "id": 154005154,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1538537362
    },
    {
        "content": "<p>As mentioned in today's call, I don't see the need to match the social security number with the pseudonym in the case where a strong authentication has already been performed. In this case, it would be much more important to guarantee the single sign on (consider the case where the app is not offered by a public sector participant and is using Vetuma, for instance). Then the application can already have a guarantee on the connection between the SSN (that it obtains) and the pseudonym.</p>",
        "id": 160663787,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1552484711
    },
    {
        "content": "<p>The requirement to somehow identify the person the pseudonym is tied to, at least on some level, is still valid for apps not using strong authentication. The name would not be a perfect solution, but it would help.</p>",
        "id": 160663917,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1552484792
    },
    {
        "content": "<p>There is another use case for the name as well. In use cases where the registration process involves connection to Kanta PHR, or is initiated with that connection, getting the name from the platform would help streamline the signup - the app would not then need to ask for the name separately. Or if it still asks for the name, it could prepopulate the form fields.</p>",
        "id": 160664095,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1552484969
    },
    {
        "content": "<p>Finally, this would also apply in cases where the app itself does not store the name information, but still wants to greet the citizen.</p>",
        "id": 160664182,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1552485015
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span>  for your input, we'll get back to this after we've thought this over on our side!</p>",
        "id": 160771479,
        "sender_full_name": "Anna Korpela",
        "timestamp": 1552562994
    },
    {
        "content": "<p>If there's anyone else having needs or ideas related to this, please voice your thoughts here</p>",
        "id": 160771537,
        "sender_full_name": "Anna Korpela",
        "timestamp": 1552563007
    },
    {
        "content": "<p>In our application Kasvuseula (<a href=\"http://kasvuseula.fi\" target=\"_blank\" title=\"http://kasvuseula.fi\">kasvuseula.fi</a>) the parent manages measurements of one to many of his/her children. Considering that the under aged children's Omakanta is managed by the parent(s) it would be helpful to check that the given name of the child is the same in Kasvuseula and Omakanta, when connection to Omakanta is made. Though checking is only informal, not preventing the connection, but it is good customer service.</p>",
        "id": 161057837,
        "sender_full_name": "Juha Leppänen",
        "timestamp": 1552916450
    },
    {
        "content": "<p>Thanks for your input! We'll definitely take this into consideration when we start designing the solution for acting on someone's behalf in Kanta PHR.</p>",
        "id": 161444066,
        "sender_full_name": "Anna Korpela",
        "timestamp": 1553258560
    }
]