[
    {
        "content": "<p>Hei. Kaipaisin vahvistusta MustSupport elementin pois profiloinnista. Saimme ohjeet ja esimerkin <span class=\"user-mention\" data-user-id=\"220525\">@Miia Riihinen</span> ltä sähköpostiin. Muutokset spirometriaprofiileihin on nyt työ alla. Esimerkissä dataAbsentReason elementti, joka on pakollinen vital signs pohjaprofiilissa. Elementtiin on lisätty slice, jolle annettu kardinaliteetiksi 0...0. Kun muokatun profiilin lataa simplifieriin, niin all slices alla näkyy kuitenkin elementit kardinaliteetillä 0...1. Ajattelin laittaa kysymyksen suoraan tänne, jos jollain muulla on vastaavia tarpeita. Näyttäisikö muokkaus menevän oikein? <a href=\"/user_uploads/10155/hHAKvxxKx1uaLgw4wwXisBDn/mustSupport.png\">mustSupport.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/hHAKvxxKx1uaLgw4wwXisBDn/mustSupport.png\" title=\"mustSupport.png\"><img src=\"/user_uploads/10155/hHAKvxxKx1uaLgw4wwXisBDn/mustSupport.png\"></a></div>",
        "id": 202960089,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1594020664
    },
    {
        "content": "<p>Moi. Tutkittiin meidän VitalSigns-profiilia ja huomattiin siinä muutamia puutoksia sekä korjasimme sitä. Teillä näyttää olevan omassa projektissanne kopio tuosta meidän profiilista, joka saattaa sotkea simplifieria. Ehdotan että poistatte omasta projektistanne vitalSigns-profiilin ja viittaatte suoraan FinnishPHR R4-projektissa olevaan profiiliin. Eli kun poistatte profiilin omasta projektista niin simplifier osaa tuon jälkeen URL:in perusteella viitata oikeaan paikkaan. Jos tämä ei ratkaise ongelmaa jatketaan lomien jälkeen asian selvittämistä! Hyvää kesää!</p>",
        "id": 203368840,
        "sender_full_name": "Aleksi Aho",
        "timestamp": 1594288749
    },
    {
        "content": "<p>Kiitos. R4 VitalSigns-pohjaprofiilin päivitys ratkaisi ongelman.</p>",
        "id": 206110499,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1596697579
    }
]