[
    {
        "content": "<p>Hi! I noticed that i f I load Observation resources with the REST API, specifying _sort=date and _sort=-date produce the same results, even though one should return the results in chronological order and the other in inverse chronological order. Searching the date using the HAPI server, it looks like the _sort parameter is ignored for all fields - sorting by date and identifier produces the same results for the data I've uploaded. Is sorting disabled, or is something going on with the indexing?</p>",
        "id": 162421360,
        "sender_full_name": "Sulka Haro",
        "timestamp": 1554292064
    },
    {
        "content": "<p>Any news on this? Not being able to sort query results is blocking our development.</p>",
        "id": 162543444,
        "sender_full_name": "Sulka Haro",
        "timestamp": 1554395725
    },
    {
        "content": "<p>Here's a screenshot. AFAIK the results should be sorted by the updated field but are actually listed in seemingly random order. The same order is reproduced for all values of _sort. <a href=\"/user_uploads/10155/EnT6fXDSdO1n9CbQAuro9MNs/Screen-Shot-2019-04-09-at-16.42.04.png\" target=\"_blank\" title=\"Screen-Shot-2019-04-09-at-16.42.04.png\">Screen-Shot-2019-04-09-at-16.42.04.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/EnT6fXDSdO1n9CbQAuro9MNs/Screen-Shot-2019-04-09-at-16.42.04.png\" target=\"_blank\" title=\"Screen-Shot-2019-04-09-at-16.42.04.png\"><img src=\"/user_uploads/10155/EnT6fXDSdO1n9CbQAuro9MNs/Screen-Shot-2019-04-09-at-16.42.04.png\"></a></div>",
        "id": 162912020,
        "sender_full_name": "Sulka Haro",
        "timestamp": 1554818024
    },
    {
        "content": "<p>We discussed this briefly yesterday during the HL7 Finland PH SIG Kanta PHR support meeting, Kanta PHR doesn't currently have suppport for _sort-parameter. But we are designing support for it as we speak, I'll get back to you with the timetable hopefully soon.</p>",
        "id": 163089911,
        "sender_full_name": "Anna Korpela",
        "timestamp": 1554980704
    },
    {
        "content": "<p>Ok great! So just to confirm, am I right there is no way currently to query for the last n inserted / updated records? If not, is there a way to query for any metadata (like dates) that'd allow querying for the data for a user with more targeted queries than doing something like walking back dates from current date, until data is found? The number of records I'll be pushing in with the blood glucose data is sadly such that it's not practical to just load all the records and sort programmatically after loading.</p>",
        "id": 163355856,
        "sender_full_name": "Sulka Haro",
        "timestamp": 1555309774
    },
    {
        "content": "<p>Currently no, there is no way to ask \"give me 50 latest results\".  We have the conformance statement available in Simplifier (<a href=\"https://simplifier.net/FinnishPHR/capabilitystatement3/\" target=\"_blank\" title=\"https://simplifier.net/FinnishPHR/capabilitystatement3/\">https://simplifier.net/FinnishPHR/capabilitystatement3/</a>) and there is the search parameter that works for the field \"last updated\" from meta element in the resource. The \"date\" parameter works on the   Observation.effective[x] date if it is more approriate for the use case.   Downloading (or looking, but it doesn't always show everything, there is something in weird in Simplifier with the json-presentation) the statement's json representation will give the paths in resources where the search parameters point to.</p>\n<p>Limiting query by either parameter for example to last week or last month will give the results from that period.</p>",
        "id": 163632800,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1555577057
    },
    {
        "content": "<p>$lastN ?</p>",
        "id": 163636894,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555581461
    },
    {
        "content": "<p>Could be, but the Finnish PHR server doesn't support searches like that yet, we haven't implemented everything fhir describes. Sorting query results is in plans and then you could just fetch the first page of results.</p>",
        "id": 163639819,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1555584269
    },
    {
        "content": "<p>well, I appreciate the difficulty, but $lastN is a little more sophisticated than just sorting :-(</p>",
        "id": 163640982,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555585519
    }
]