[
    {
        "content": "<p>We specify FHIR resources for OMAKANTA so that end customers can see their well being data collected from various apps. How the User Interface of OMAKANTA is specified? Can there be various IUs for each app? Who implements these UI?</p>",
        "id": 153926812,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1513946874
    },
    {
        "content": "<p>I searched again little bit this area. It seems to be that OMAKANTA is just a storage for 'patient' data based on FHIR profiles. It's up to applications how they show the data to 'patient' or end user.</p>",
        "id": 153926820,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1513952675
    },
    {
        "content": "<p>This leads me to next scenario:  let assume that there is a profile A in OMAKANTA (or Kanta PHR), which is used by two applications B and C.  There is a citizen D, who uses application B to store/read his/her health data as specified by profile A.  Naturally the citizen D has to have given his/her consent for this.  Now, there is this application C, who also use profile A to store / read citizens' data. Can application C read the citizen D's  data? If not, how this is controlled?</p>",
        "id": 153927133,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1514463743
    },
    {
        "content": "<p>Application C can read the data if it has the access privileges to that data type. See the Authorization guide on this page for more details: <a href=\"http://www.kanta.fi/en/web/ammattilaisille/tarkeaa-tietoa-kehittajille\" target=\"_blank\" title=\"http://www.kanta.fi/en/web/ammattilaisille/tarkeaa-tietoa-kehittajille\">http://www.kanta.fi/en/web/ammattilaisille/tarkeaa-tietoa-kehittajille</a></p>",
        "id": 153927404,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1514879566
    },
    {
        "content": "<p>Thank you Eeva.  I think I got it .  Applications' access privileges to patient data (or resources) are stored in the authentication/access control server and sent to application's client, when application request access to PHR.  Access privileges are determined in the registration phase of an application.  Access right token includes the user id (or social security id, if strong identification is required), which identifies the patient in PHR and the resources which are available for the application.</p>",
        "id": 153927409,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1514886599
    },
    {
        "content": "<p>Yes, that's the general idea! Happy to help :)</p>",
        "id": 153927413,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1514887592
    },
    {
        "content": "<p>Just one issue still, Eeva.  Even I read these documents, I don't yet fully understand does the consent given by the patient concerns the application or the resource itself? In other words,  if patient given access rights to his/her data (stored as resources of specific profile(s)), it is possible that any application can read this data? Or is it so that patient also give consent to certain applications only?</p>",
        "id": 153928242,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1515586312
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194340\">@Anna Korpela</span> can fill in more about consent, but there are two differect concepts here.</p>\n<p>1) Authorization and permissions to a resource for an application: this works for all resource instances of the given object type (== for example Observation) and can be given to read and to write separately.  The application needs to have these registered and then need to request the permissions. Each application needs to be authorized separately and each will have the permissions the user authorizes it to have. It is possible to have Application A to read Observations and Questionnaires, write and read QuestionnaireResponses and Application B to read and write Observations. They'd have access to all resource instances of those types (Observation, Questionnaire, QuestionnaireResponse)</p>\n<p>2) Consent as a concept is permission by the user to let healthcare professionals access their data and it doesn't directly  link to the access of an application.</p>",
        "id": 153928245,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1515589665
    },
    {
        "content": "<p>Thank you, Eeva!</p>",
        "id": 153928285,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1515604000
    }
]