[
    {
        "content": "<p>Hei!</p>\n<p>Miksi PHR:n kansalaisille suunnattu koko nimi on Omakannan Omatietovaranto, eikä esim. Kannan Omatietovaranto samaan tapaan kuin kehittäjille käytössä oleva Kanta PHR? Tai pelkkä Omatietovaranto samaan tapaan kuin Potilastiedon arkisto? Nykyinen nimi nimittäin vaikuttaisi aiheuttavan sekaannusta ihmisissä.</p>\n<p>Eihän PHR:ää voi käyttää kunnolla Omakannan kautta, vaan sitä käytetään sovellusten kautta, mutta nimi vaikuttaa ohjaavan ihmiset ajattelemaan, että kaiken käytön voisi tehdä Omakannan kautta. Käsittääkseni Omakanta onkin pohjimmiltaan käyttöliittymä kansalaisille. <a href=\"http://www.kanta.fi/documents/12105/3450131/Kanta_ArkkitehtuuriJaAikajana_FI.pdf/1793c346-1243-4c57-a5d1-ad2298426936\" target=\"_blank\" title=\"http://www.kanta.fi/documents/12105/3450131/Kanta_ArkkitehtuuriJaAikajana_FI.pdf/1793c346-1243-4c57-a5d1-ad2298426936\">Kanta-arkkitehtuuria</a> katsottaessakaan PHR ei mitenkään eroa esim. arkistoista.  Lisäksi nimi Omakannan Omatietovaranto kuulostaa siltä, että Kantaan kuuluisi muitakin Omatietovarantoja. Toisaalta sanassa Omatietovaranto oleva \"oma\" jo viittaa itse kerättyyn dataan ja siten palvelun käyttötarkoitusta ei tuo Omakannan-määre nähdäkseni tarkenna yhtään. Pitkäkin tuo nimi tietysti on, ja siksi kai tuo ensimmäinen sana jää käytössä usein pois. Ehdottomasti tärkein ongelma nimessä on kuitenkin tuo sekaannus, jota nimi tuntuu aiheuttavan.</p>",
        "id": 153951603,
        "sender_full_name": "Esko Niinimäki",
        "timestamp": 1523351471
    },
    {
        "content": "<p>Hei,<br>\nkiitos palautteesta. Tuo valittu nimi on todellakin melko pitkä ja sen vuoksi sitä välillä (riippuen kohderyhmästä) lyhennämmekin jättämällä Omakanta-sana pois ja samoin Kanta PHR on myös tämän takia otettu käyttöön sovelluskehittäjille, jotka ovat tottuneet englanninkieliseen terminologiaan muutoinkin. Omakanta-sana on haluttu nimeen, jotta kansalaiset uuden palvelun löytäisivät ja osaisivat sen yhdistää Kanta-palveluihin. Omakanta-palvelu alkaa olemaan hyvin laajasti tunnettu, joten sen kautta saadaan Omatietovarantokin tutuksi. Ilman Omakanta-sanaa se voisi jäädä irralliseksi, eikä tulisi ymmärrystä, että se on osa kansallisia palveluita.</p>",
        "id": 153953527,
        "sender_full_name": "Pirjo Vuorikallas",
        "timestamp": 1524469107
    },
    {
        "content": "<p>Hei,<br>\nKiitos vastauksesta. En hoksannutkaan, että Omakanta on Kantaa tunnetumpi :o</p>",
        "id": 153964041,
        "sender_full_name": "Esko Niinimäki",
        "timestamp": 1526976981
    }
]