[
    {
        "content": "<p>Hi,</p>\n<p>Let's imagine the future a little bit and suppose we have multiple, even dozens of different applications who are focusing on their own areas (resources) e.g. diabetes, exercise, food, condition A, illness B etc. How is professionals, e.g. common doctor in a hospital, supposed to handle the resources? Currently it's as if the doctor is expected to use multiple different applications for different areas and purposes, but I very much doubt any doctor has interest to learn and use several applications. So is there going to be some kind of forced master application or standard UI for doctors and other professionals or are you maybe expecting one or multiple companies to voluntarily making one?</p>",
        "id": 154018383,
        "sender_full_name": "Esko Niinimäki",
        "timestamp": 1542196074
    },
    {
        "content": "<p>In my view, there would be many different apps to choose from. A doctor that mainly cares for people with diabetes that requires insulin treatment may <em>prefer</em> to work with an app that focuses on the data that's essential in that domain. There may be several such apps, and the doctor (or the clinic jointly) should be able to select the one they like best.<br>\nEven when treating people with type 1 diabetes the data needs are different based on whether the person has a continuous glucose monitor and whether that person uses an insulin pump or multiple daily injections. So the clinician might prefer to use many different apps as part of the workflow, depending on the people with diabetes currently treated.<br>\nOf course, all these apps used to help treat diabetes might well access data that's fed into the system by totally different food or exercise apps.</p>",
        "id": 154019149,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1542373295
    },
    {
        "content": "<p>Hi, an application aimed for the use of social welfare and healthcare professionals must meet the requirements of the Client Data Act (class A). For that reason, professional applications utilising PHR must pass the Kanta certification process: <a href=\"https://www.kanta.fi/en/web/guest/system-developers/certification\" target=\"_blank\" title=\"https://www.kanta.fi/en/web/guest/system-developers/certification\">https://www.kanta.fi/en/web/guest/system-developers/certification</a>. <br>\nNational Institute for Health and Welfare (THL) has started to define the certification criteria for professional applications utilising PHR data. The applications for professionals can different: invidual apps or EHR having feature, which allows professionals to see the citizen’s PHR data if citizen have given his/hers consent. Production phase of professional applications / healthcare professionals using PHR data requires the amendment of the new version of Client Data Act. The amendments are currently undergoing parliamentary review.</p>",
        "id": 154019156,
        "sender_full_name": "Pirjo Vuorikallas",
        "timestamp": 1542375843
    }
]