[
    {
        "content": "<p>Why a new profile of a resource is tagged always as \"resourceType\":\"StructureDefinition\" and only in \"type\" tag the right resource is spesified (f.ex.\" type\" = \"observation\")? Why not tag  \"resourceType\" = \"observation\", if the profile is about observation resource?</p>",
        "id": 153926790,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1513927051
    },
    {
        "content": "<p>Do you mean the stored resource in the resource server? That is because a profile is a resource of resource type StructureDefinition and only an Observation would be a Observation resource. All the resources are json-objects so they need a field to declare their FHIR object type, for example a Observation resource from the standard: <a href=\"https://www.hl7.org/fhir/observation-example.json.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/observation-example.json.html\">https://www.hl7.org/fhir/observation-example.json.html</a></p>",
        "id": 153926794,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1513934074
    },
    {
        "content": "<p>Well, I'm specifying new resources to finnishPHR for an app. I try to figure out how to specify new resource or perhaps a new version of resource like for example previously specified observation resource (or is this a profile?) <a href=\"https://simplifier.net/FinnishPHR/fiphr-vitalsigns-stu3/~json\" target=\"_blank\" title=\"https://simplifier.net/FinnishPHR/fiphr-vitalsigns-stu3/~json\">https://simplifier.net/FinnishPHR/fiphr-vitalsigns-stu3/~json</a>.</p>",
        "id": 153926809,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1513944062
    },
    {
        "content": "<p>By reading FHIR documentation, I got the point of profile. They are special use cases of 'standard' resources like observation, patient etc.. Profiles have always resourceType = StructureDefintion as specified by HL7 FHIR.  HL7 FHIR itself specifies as well some standardized profiles, but it seems that it is possible to specify anykind of profiles like we do for finnishPRH. Then question is: when do we even need to use 'real' resources in server if we can do everything with profiles?</p>",
        "id": 153926810,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1513944759
    },
    {
        "content": "<p>Profiles are resources to describe how for example an observation should look like. Actual data is stored as observation, patient, etc resources and each of these resources declare the profile they conform to. In normal case an application should store for example a blood pressure measurement as an observation resource and declare that it follows the blood pressure profile. There is only one instance of the profile stored on the server, but many observations. The link to the profile is in meta-element of the Observation resource.</p>",
        "id": 153927403,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1514879464
    },
    {
        "content": "<p>Thank you Eeva.</p>",
        "id": 153927410,
        "sender_full_name": "Juha Vuorinen",
        "timestamp": 1514886699
    }
]