[
    {
        "content": "<p>1) Questions about <a href=\"https://plan-net-client.herokuapp.com\">https://plan-net-client.herokuapp.com</a> reference client</p>\n<p>- PharmacyMix view:<br>\n         - is this view CMS mandated?   No.  This is Saul's guess regarding a useful report on pharmacy mix from a plan<br>\n        - What is the query underlying this view.   See app/controllers/pharmacymixes_controller.rb in the reference client implementation.   A description will be added to the client.   Focal resource is OrganizationAffiliation, qualified by networks of the plan, and locations of type pharmacy.   Each row of the report repeats the query constraining the OrganizationAffiliation by a different specialty.<br>\n   - Export View:<br>\n      - Is support for bulk FHIR covered in the IG or mandated by rule?  No.  But it is probably in the selfish interests of payers to support bulk FHIR to reduce query load on their servers.   The reference server and client demonstrate how to do this.<br>\n   - We played around with the client pointed to the MITRE reference server, and <a href=\"https://data.bluekc.com/api/provider-directory/v1/fhir/\">https://data.bluekc.com/api/provider-directory/v1/fhir/</a> <br>\n2) Bridging between Providers in EOB (CarinBB) data and Provider Directory Data (Plan-Net) and PDEX data</p>\n<p>- imagine you have a claim from PayerA and you want to find all of the info for a provider mentioned in an EOB in PayerA's provider directory, which is maintained as a separate endpoint.   The IG does not support this use case directly.   PayerA could embed identifiers in the claims data that would enable a direct mapping to the associated providers in the provider directory (and vice versa).<br>\n   - now imagine the claims data is from PayerA and the member wants to link to the same provider in PayerB's directory.     They could use the query interface to find a doctor with the same name and specialty and geography.  NPI is not as good a link as it seems.   Would a stable identifier that could be used for such mappings be useful to incorporate into the IGs?<br>\n   - linking by NPI and/or TaxID is imprecise.<br>\n3) Organization.partOf</p>\n<div class=\"codehilite\"><pre><span></span><code>- this field is 0..1 MS.   Does a payer need to include the &quot;true&quot; organizational hierarchy (including all legal entities) in the member-facing provider directory?   Or should the focus be on hierarchy that is useful to the member? \n- Saul&#39;s opinion is that the focus should be on hierarchy that is useful to the member.   Including all of the institutional hierarchy might actually make it harder to navigate the directory for members.\n</code></pre></div>\n\n<p>4) HealthcareService. Category and Type</p>\n<p>- We discussed the origin of the vocabulary bindings for these two fields.   One participant related that mapping to category was straightforward, but mapping to type was a bit of a struggle.<br>\n   - We will continue the discussion of. hard to map terms via zulip/email</p>",
        "id": 222921972,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1610743081
    }
]