[
    {
        "content": "<p>We have an open source FHIR Server and an interest in PDEX PlanNet but have not, as yet, been involved in the project.<br>\nI'd like to try my hand at packaging the implementation guide and making a server available for the connectathon.<br>\nI found the kickoff/orientation deck from <a href=\"https://confluence.hl7.org/display/FHIR/2020-05+DaVinci+PDex+Plan-Net\">https://confluence.hl7.org/display/FHIR/2020-05+DaVinci+PDex+Plan-Net#</a> ...was it also recorded?  Who else is participating in this track?</p>",
        "id": 197266929,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1589286215
    },
    {
        "content": "<p>For the connectathon we continue to work with the ballotted IG (not the CI Build).<br>\nYour list appears of extensions appears complete.  <br>\nI think there are also some VhDir valuesets/codesystems that get dragged in.</p>\n<p>Re recording of the kickoff/orientation deck, I don't know.   I'm happy to answer specific questions (and will try to do a better job of monitoring this channel!   You can always ping me directly (<a href=\"mailto:saul@mitre.org\">saul@mitre.org</a>).   We appreciate your input/participation.</p>",
        "id": 197304506,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1589302096
    },
    {
        "content": "<p>There is a server (HAPI-FHIR) with the IG resources and sample data loaded available for use.   <br>\nDid you see the documentation on that?</p>",
        "id": 197304711,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1589302199
    },
    {
        "content": "<p>Thanks Saul.  I definitely don't expect immediate support on this thread (and especially not before the event even begins).  I did see that there is a reference server for folks to use and I guess I'm mostly interested in testing our server's ability to add support for a new implementation guide and so hopefully there is room for another server to participate.<br>\nThanks for pointing out the valueset references...will address that in the other topic.</p>",
        "id": 197345663,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1589320872
    }
]