[
    {
        "content": "<p>What parts of the pdex-plan-net-sample-data tool are faking data v/s pulling from CSV?  I see the endpoints are generated as expected because plans aren't going to have that info at this juncture.    Is there a good way to produce real FHIR data from CSVs using this tool or another?</p>",
        "id": 216364368,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605110507
    },
    {
        "content": "<p>There are kernels of real data from NPPES and a listing of pharmacies that drive the sample data generation.  Anything identifying is then faked.<br>\nThe product is DEFINITELY not based on a real provider directory.   (Contrast with the sample data generation for the Drug Formulary IG that is based on actual QHP formulary data).     It does follow the patterns defined in the IG.</p>",
        "id": 216365326,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1605110992
    },
    {
        "content": "<p>okay so in short this tool cannot be used \"as-is\" to generate files from real data...this is true even if we replace the NPPES seed files and other files with real data from a payer.  Do I understand correectly?</p>",
        "id": 216367471,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605112076
    },
    {
        "content": "<p>And for endpoint at least, we would have to add something to pull in real endpoints from CSV.</p>",
        "id": 216367575,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605112122
    },
    {
        "content": "<p>What funding source paid for this work?  ONC?  It would be cool to convince the ONC/CMS to expand on this to handle real data.</p>",
        "id": 216367747,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605112210
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span>  ^^</p>",
        "id": 216367797,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605112248
    },
    {
        "content": "<p>You could replace the NPPES and Pharmacy data with similarly formatted data, but that wouldn't really make the data that was produced more realistic.   For example, the current software doesn't model Practitioner's relationship with their provider organization(s),  hospital admitting privileges, Practitioner/organization/location's association with Networks, etc, etc, etc.  </p>\n<p>Is there a \"standard\" or standard format for provider data?   If we had possessed real provider data we would have built on that, but we didn't, so we built on what we had.   The current code base was inspired by a similar, python-based, codebase developed for VhDir by Eric Haas et al.</p>\n<p>This software was developed by MITRE with CMS funding.</p>",
        "id": 216369242,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1605112967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span>   Thanks so much for the background and context.  We would essentially need to build out CSV formats specific to the other resource Types.  Just curious, are you working on this now?  Is there ongoing funding?</p>",
        "id": 216465867,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605187178
    },
    {
        "content": "<p>Also <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> You might have stumbled upon my provider data project which doesn't build all of these resources since it is relying on NPPES. <a href=\"https://github.com/TransparentHealth/provider-data-tools\">https://github.com/TransparentHealth/provider-data-tools</a></p>",
        "id": 216466533,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605187459
    },
    {
        "content": "<p>The other related tool is <a href=\"https://github.com/videntity/json-data-tools\">https://github.com/videntity/json-data-tools</a>  This handles NDJSON and importing FHIR/JSON/CSV via FHIR, MongoDB, and SFTP.  I just used it to load your tools output into my MongoDB-based FHIR server.</p>",
        "id": 216467035,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605187707
    },
    {
        "content": "<p>I'm open to any sort of collaboration.  The PDT was initially funded by CMS, but now maintained by me.  \"Duke Margolis Center for Healthcare Policy\" indirectly funded some work on it more recently.</p>",
        "id": 216467832,
        "sender_full_name": "Alan Viars",
        "timestamp": 1605188074
    }
]