[
    {
        "content": "<p>I’m working with a State Medicaid Agency on achieving compliance with the CMS Interop Rule. I was recently at Connectathon 25 a couple of weeks ago and got a lot of value out of it. Now I’m digging deeper into the IGs.</p>\n<p>I’m trying to build a list of \"unique data elements\" for the PLAN-NET IG as we are trying to build our shopping list of data elements we need to locate within our own systems so we can make them available through the Patient Access API. CPCDS is pretty organized already and I’ve gone through the Formulary IG to build a list of unique data elements.</p>\n<p>I'm trying to do something similar with PLAN-NET... but it's more complex, right? The IG calls out nine profiles and each profile has a lot of elements in them. Now, I'm confident that they're not all required. I've looked at the cardinality for each... if I'm looking for the bare minimum of REQUIRED elements to meet initial compliance with CMS, am I just looking for data elements with a cardinality of 1..1? If not that, what could I use to filter down the list to the Mandatory minimum? The length of the list is freaking some folks out so I need to filter it down to what is required. And the Rule really only called out Provider Name, Address, Phone and Specialty (or for Pharmacy, Number of Pharmacies in the network and Mix, like Retail). I suspect that the PLAN-NET IG is derivative from VhDIR and isn’t done being fully de-scoped for this mission yet, so maybe most of the data elements listed in the IG are “optional”, leaving only the elements called out in the Rule as Mandatory/Required?</p>\n<p>I'm attaching my spreadsheet. It’s a pretty crude work in process but it’s my start.</p>\n<p>The first worksheet is just listing the profiles from the IG.</p>\n<p>The second worksheet is really what I'm trying to build - the list of unique data elements. I organized the list by Profile. Probably a lot of \"Optional\" elements in here - need the rule to follow to get at the mandatory minimum. I’ve tried to filter out the elements and attributes that are just native to the FHIR Resource/Profile and wouldn’t map to data in our system.</p>\n<p>The third worksheet is just my way of moving elements that have sub-elements that are repeated in multiple Profiles so it doesn't clutter up my list of Unique Data Elements.</p>\n<p>If there's a better way to do this (or a list has already been created), I'd really like to see those! Otherwise, this is what I'm starting with.</p>\n<p>Does anyone have insights into how I can arrive at a list of unique data elements from the PLAN-NET IGs that we would look for in our systems? And of those, which ones are required for compliance with the Rule at this time?</p>\n<p>Any help would be much appreciated. Thanks.</p>\n<p>Greg <a href=\"/user_uploads/10155/EdL7UpWDIc14iyite7AgHKIa/PAAPI-Plan-Net-Data-Elements.xlsx\">PAAPI-Plan-Net-Data-Elements.xlsx</a></p>",
        "id": 211213364,
        "sender_full_name": "Greg Linden",
        "timestamp": 1601002652
    },
    {
        "content": "<p>What you need to handle are the elements marked as 'mustSupport'.  Some of those might not be mandatory - i.e. they're allowed to be absent some of the time.  However, if the element is mustSupport then you must be able to show that you're capable of having the data and exposing it when it exists.</p>",
        "id": 211213744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601003097
    },
    {
        "content": "<p>However, there's some complexity in that behavior when you drop down into data types where mustSupport hasn't been asserted, the rules aren't super clear.  For example, if Patient.address is mustSupport, but none of the elements within address are marked as mustSupport, then in theory you can get away with sending the address with a single extension that says \"not supported\" and meet the letter of the spec.  However, you're certainly not meeting the spirit of the spec and I wouldn't bet my business on CMS looking on a 'barest minimum' as meeting their criteria.  On the other hand, if you can capture address line, state, postal code but don't handle Address.period, you're probably fine.</p>",
        "id": 211213919,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601003325
    },
    {
        "content": "<p>(Note that I'm not a lawyer, nor even an American, so I wouldn't take my \"probably\" to court...)</p>",
        "id": 211213937,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601003356
    },
    {
        "content": "<p>Despite Lloyd's nationality, I second his response.<br>\nLook at elements with minimum cardinality 1 and those flagged with MS.   <br>\nRe VhDir:  we've pruned a lot of constraints from VhDir in getting to the current Plan-net.</p>",
        "id": 211794574,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1601487188
    }
]