[
    {
        "content": "<p><strong>CDA Allergy Concern &amp; Observation both (may) have authors; FHIR only has one recorder. Which one should be used? </strong></p>\n<p>Proposed Resolution:<br>\nCF: The author on the Concern act is the Allergy-Intolerance recorder.  The informant on the Concern act is the asserter. The performer on the Allergy-Intolerance Observation is the person who made the diagnosis (an earlier Encounter Diagnosis). That observation's author is the person who documented the diagnosis, and the informant is the person who provided the information used in making the diagnosis.</p>",
        "id": 259816792,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635726716
    },
    {
        "content": "<p>It has been proposed to Use Provenance Author for Recorder; and to put all other authors in FHIR Provenance.</p>\n<p>Amendments</p>\n<ol>\n<li>\n<p>Cardinality of Provenance author is still multiple. This solution doesn't solve anything unless it is restricted to a maximum of one.</p>\n</li>\n<li>\n<p>The name \"Provenance author\" for the one author not to be represented by a Provenance resource is confusing. Change name to Primary Author, or always refer to it as \"CCDA Provenance Author Template, not FHIR Provenance.\"</p>\n</li>\n<li>\n<p>Assuming we adopt &amp; enforce this pattern going forward, we still need assumptions to use for legacy data.</p>\n</li>\n<li>\n<p>Future: need to retain provenance chain. Current tactical solution is to retain Last Hop only, but this could be the record importer who has had no clinical contact with patient. Next step would be, in addition to Last Hop, Original Author. Followed by Full Chain, each with some characterization of authority (based on clinical contact vs. not). User Interface: show Last (with date &amp; activity); add indication that history exists; enable click-through.</p>\n</li>\n</ol>",
        "id": 263012591,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1638194934
    },
    {
        "content": "<p>re #4, you should not be limited to one level of depth on Provenance. your example is a good reason. The Basic Provenance tried to set the bar really low, presuming that if someone needed to investigate they would be able to go ask that last exporter for more provenance details.</p>",
        "id": 263013557,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638195443
    },
    {
        "content": "<p>Summary of outgoing documents from VA:<br>\n<a href=\"/user_uploads/10155/AtcsvgEynneNZdAs6B4kDIAj/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/AtcsvgEynneNZdAs6B4kDIAj/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/AtcsvgEynneNZdAs6B4kDIAj/image.png\"></a></div>",
        "id": 266873656,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1641335581
    },
    {
        "content": "<p>Updated with incoming documents:<br>\n<a href=\"/user_uploads/10155/2U3tAGkMnRy0UR8WY1Kn2pXG/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/2U3tAGkMnRy0UR8WY1Kn2pXG/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/2U3tAGkMnRy0UR8WY1Kn2pXG/image.png\"></a></div>",
        "id": 266878655,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1641338891
    }
]