[
    {
        "content": "<p><strong>In CDA the cardinality for authors allows multiple authors to be included. How do we handle the mapping when FHIR resources only permit 0..1 reporter?</strong></p>\n<p>Proposed Resolution:<br>\nFHIR can put extra authors in Provenance, as long as there is a time associated with the provenance.</p>\n<p>CF: Only populate authors in a Provenance Resource when the author carries the assertion of conformance with the Provenance Author Participation template. When determining the \"primary\" (earliest) author, if a there is a temporal tie, use alphabetical order on practitioner's name to select the earliest.</p>",
        "id": 259816906,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635726855
    },
    {
        "content": "<p>When you record information into your system, you are the recorder.  All prior author information if it is going to be kept would need to be recorded in a Provenance resource that references the issue being documented in your system. Or it could be that the author of a component part of the semantically means something different.  For example, when an \"allergy concern\" is documented in a medical record the author of that concern is the recorder of the Allergy-Intolerance.  The author of the nested observation of the patient having a specific allergy is actually a diagnosis/finding from some earlier (or from this current) encounter.  So that nested author on the observation component of the allergy - intolerance concern is actually the recorder of an Encounter Diagnosis identifying the observed issue.</p>\n<p>Also note that the FHIR Composition resource permits 1..* author elements, so there is not a problem recording multiple authors at the document level. Further, the section element supports 0..* authors, so that is not a problem either.  </p>\n<p>We just need to be clear that the recorder of a resource that is an entry in a FHIR document needs to represent the author who recorded the information in the custodian system where the information was \"sourced\" when the document was created.  Even if that system included multiple authors for the entry, only one person or system actually entered that entry information into their system.  That person would be shown as the FHIR entry recorder resource.  semantically, all other others mean something different than \"this person or system recorded this information within the medical record of focus.\"</p>",
        "id": 260657757,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1636378983
    }
]