[
    {
        "content": "<p><strong>What does it mean when an entry is composed of multiple acts?</strong></p>\n<p>We need to come to consensus on the meaning and semantic purpose of the clinical statement pattern of a Concern act.  This longstanding misunderstanding continues to plague our every step.  Without agreement and resolution here, we will not have the fundamental agreement we need to move forward.  If this discussion about the concern needs to be promoted to the C-CDA IAT, we should do that.  </p>\n<p>The concern act in an Allergy Concern Entry tells us the concern is an \"allergy or intolerance\".  Earlier consensus was attained with agreement that categorizing allergies from intolerances was not practical or possible, so the C-CDA Community opted not to distinguish two different categories. </p>\n<p>To align C-CDA with FHIR, recommend a SHOULD binding to  AllergyIntoleranceCategory for Allergy Concern Entry/code/@translation. Recommend that US Core add a third Category of \"Propensity to adverse reaction\" for systems that don't distinguish allergies from intolerances.  Recommend that US Core use the more general notions of Allergy, Intolerance, or Propensity to adverse reaction in the category rather than the type element, then use the more specific types from Allergy - Intolerance Observation.value in the Allergy-Intolerance.type element. </p>\n<p>See PC WG support for this change since they have provided the dominant design guidance here.</p>",
        "id": 259816054,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635725537
    },
    {
        "content": "<p>Two issues here: A. cardinality (one Concern act with multiple problem/allergy observations) &amp; B. how to classify the intolerance.</p>\n<p>B: I think proposed maps address this. </p>\n<p>A: Discussion suggests this is not typically (or ever?) done: Concern acts contain individual problems or allergies. If so, the solution is to institutionalize this guidance. Open question: how to confirm?</p>",
        "id": 263009118,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1638193116
    }
]