[
    {
        "content": "<p><strong>How do we handle mapping FHIR AllergyIntolerance.code values that represent 'negations' (e.g. SNOMED-CT 1003774007 | No known Hevea brasiliensis latex allergy (situation) ) and converting those to a combination of the underlying substance (e.g. Hevea brasiliensis latex) in the C-CDA value set and a C-CDA observation/@ negationInd = 'true'?</strong></p>\n<p><a href=\"https://docs.google.com/spreadsheets/d/1EhRiTh3-wOd6t0eQa2iKD4RQ-A32aqNju1R0rG-afgE/edit#gid=486894550\">FC allergy, line 27</a></p>",
        "id": 259882181,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635782523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> and <span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> ,<br>\nI believe we have a similar concern when going the other direction (from C-CDA observation/@negationInd='true' to FHIR AllergyIntolerance.code values)?   I do see the following in the '<strong>Transform</strong>' column (column O), on row 41 the CFAllergy tab of the AllergyMaps.xlsx spreadsheet...</p>\n<p>'If negationInd = True, record absence of sensitivity to reported substance. Text may be necessary.'</p>\n<p>Do we need to be more explicit about what CDA element the 'negationInd = True' must be tied to?  e.g., The Allergy - Intolerance Observation (observation/@negationInd) vs.  its parent entryRelationship/@negationInd or some other element?</p>\n<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> <br>\nIs 'Text may be necessary' in column (column O), on row 41 the CFAllergy tab of the AllergyMaps.xlsx spreadsheet a transformation instruction to consumers of our mappings, or is that just a note indicating more discussion is needed on this topic?</p>",
        "id": 259925346,
        "sender_full_name": "David Riddle",
        "timestamp": 1635802895
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> , the code you mention is SNOMED's replacement for 716184000 |No known latex allergy (situation)|, deprecated because \"ambiguous.\" The FHIR value set should be updated. [I'd quibble that it's not really ambiguous, but juice, squeeze.)</p>\n<p>Going from FHIR to CDA, you have to use the value set, right? So you'd need a way to identify the latex allergy and negate it. We may want to include a map of FHIR negated codes to CDA classes. Draft below.</p>\n<p>NO KNOWN ALLERGIES  No known allergy (situation)    716186003<br>\n    Leave code blank<br>\nNO KNOWN DRUG ALLERGIES No known drug allergy (situation)   409137002<br>\n    code = 373873005 |Pharmaceutical / biologic product (product)|<br>\nNO KNOWN FOOD ALLERGIES No known food allergy (situation)   429625007<br>\n    code = 255620007 |Food (substance)|<br>\nNO KNOWN EVIRONMENTAL ALLERGENS No known environmental allergy (situation)  428607008<br>\n    code = 261217004 |Substance (attribute)| (?)<br>\n    or 426232007 |Environmental allergy (finding)| ?<br>\nNO LATEX ALLERGY    No known latex allergy (situation)  716184000<br>\n    (now 1003774007 |No known Hevea brasiliensis latex allergy (situation)|)<br>\n    code = 1003752001 |Hevea brasiliensis latex protein (substance)|</p>\n<p>But wow, the CDA list in VSAC is not helping.</p>",
        "id": 260042479,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1635879793
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> , I meant that as guidance. If there's a negation indicator, there's no guarantee that there is a precoordinated code to use in FHIR, and even if there is, there may be no programmatic way to find it. (You could search SNOMED for an allergy situation with the named substance and an absence indicator, but it's unlikely.) Not only is text often the only way to express the situation of absence unambiguously, but you also don't want to record a code that might be taken to be present.</p>\n<p>The coding gap does not seem to be an obvious safety concern, to me, as drug check algorithms look for presence, not absence.</p>\n<p>The common absences are in the FHIR value set: none at all, no meds, no latex.<br>\n<a href=\"https://vsac.nlm.nih.gov/valueset/2.16.840.1.113762.1.4.1186.5/expansion/Latest\">https://vsac.nlm.nih.gov/valueset/2.16.840.1.113762.1.4.1186.5/expansion/Latest</a></p>\n<p>For other substances, we could request a SNOMED code for \"specified intolerance absent\"</p>",
        "id": 260042543,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1635879825
    },
    {
        "content": "<p>Allergy Observation vs Concern. My understanding is the if we put it on Concern, it means it's still there but no one cares, so it goes on the Observation. Right?</p>",
        "id": 260042567,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1635879837
    }
]