[
    {
        "content": "<p>Hi,</p>\n<p>We have implemented a Java library, namely cda2fhir, to transform HL7 CDA R2 instances to HL7 FHIR resources. More specifically, cda2fhir enables automatic transformation of Consolidated CDA (C-CDA) Release 2.1 compliant document instances to the corresponding FHIR DSTU2 resources, wherever possible implementing the U.S. Data Access Framework (DAF) FHIR Implementation Guide. For this purpose, cda2fhir provides extensible document transformers, resource transformers, data type transformers and value set transformers. The current implementation provides a document transformer for Continuity of Care Document (CCD), but further document transformers, e.g. for Discharge Summary or Referral Note, can be easily introduced by reusing the already existing section and entry transformers. Although the cda2fhir library expects C-CDA R2.1 compliant documents/entries, it has been tested as well with several older document instances compliant with earlier releases of C-CDA. The official HL7 FHIR Validator is also integrated for automated validation of the generated FHIR resources.</p>\n<p>All the mappings implemented between CDA artifacts and FHIR resources, data types and value sets are documented in this sheet: <a href=\"https://docs.google.com/spreadsheets/d/15Kv6PFyPh91sH1JMYwLH7D2yjh4HOTy5pjETjQNRyaU/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/15Kv6PFyPh91sH1JMYwLH7D2yjh4HOTy5pjETjQNRyaU/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/15Kv6PFyPh91sH1JMYwLH7D2yjh4HOTy5pjETjQNRyaU/edit?usp=sharing</a></p>\n<p>Model Driven Health Tools (MDHT) is used for CDA manipulation and HAPI is used for FHIR manipulation. The current implementation produces DSTU2 resources. We are planning to cover STU3 resources as well, after the specification becomes official. </p>\n<p>The library is available in github under Apache License 2.0: <a href=\"https://github.com/srdc/cda2fhir\" target=\"_blank\" title=\"https://github.com/srdc/cda2fhir\">https://github.com/srdc/cda2fhir</a>. Usage is explained in detail on the main page. We would love to hear any feedback. </p>",
        "id": 153849871,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1474379961
    },
    {
        "content": "<p>As an example, transformation outcome for the C-CDA 2.1 CCD instance available in the spec itself (<a href=\"https://github.com/srdc/cda2fhir/blob/master/src/test/resources/C-CDA_R2-1_CCD.xml\" target=\"_blank\" title=\"https://github.com/srdc/cda2fhir/blob/master/src/test/resources/C-CDA_R2-1_CCD.xml\">https://github.com/srdc/cda2fhir/blob/master/src/test/resources/C-CDA_R2-1_CCD.xml</a>) can be found here: <a href=\"https://github.com/srdc/cda2fhir/blob/master/src/test/resources/C-CDA_R2-1_CCD-w-daf.json\" target=\"_blank\" title=\"https://github.com/srdc/cda2fhir/blob/master/src/test/resources/C-CDA_R2-1_CCD-w-daf.json\">https://github.com/srdc/cda2fhir/blob/master/src/test/resources/C-CDA_R2-1_CCD-w-daf.json</a></p>",
        "id": 153849873,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1474380115
    }
]