[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> and <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> did some organizing on the Confluence site.  There is now only one resource you need to review to see the proposed Business Concepts for the \"allergy domain\", and one spreadsheet to review proposed mappings from C-CDA to US Core and US Core to C-CDA.  Check out the latest WIP work.  <a href=\"https://confluence.hl7.org/pages/resumedraft.action?draftId=79507739&amp;draftShareId=a418d292-bec2-4343-a668-31c9a0cf5f72&amp;\">https://confluence.hl7.org/pages/resumedraft.action?draftId=79507739&amp;draftShareId=a418d292-bec2-4343-a668-31c9a0cf5f72&amp;</a></p>\n<p>Also note the Issues and Decisions area of the site now where you can log open issues regarding what you agree or disagree with in the WIP mapping artifacts. </p>\n<p>PLEASE - also feel free to bring up discussion points here in the Allergy Mapping topic of the CDA to FHIR stream.</p>",
        "id": 258134727,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1634613011
    },
    {
        "content": "<p>You may not want to land in edit mode. Maps are here: <a href=\"https://confluence.hl7.org/display/CGP/Mapping+Documents+for+Discussion\">https://confluence.hl7.org/display/CGP/Mapping+Documents+for+Discussion</a><br>\nIssues here: <a href=\"https://confluence.hl7.org/display/CGP/Issues+And+Decisions\">https://confluence.hl7.org/display/CGP/Issues+And+Decisions</a></p>",
        "id": 258197516,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1634651422
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> and <span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span>,   <br>\nPosting some discussion points here related to the Issues and Decisions table (<a href=\"https://confluence.hl7.org/display/CGP/Issues+And+Decisions\">https://confluence.hl7.org/display/CGP/Issues+And+Decisions</a>) in the C-CDA to and from US Core Mapping Confluence content.  I will add one post per Issue # from the table that I have comments/questions on.  Please let me know if there is a better way/place to convey feedback on these Issues and Decisions.</p>",
        "id": 258530572,
        "sender_full_name": "David Riddle",
        "timestamp": 1634817021
    },
    {
        "content": "<p>Issue #8 from <a href=\"https://confluence.hl7.org/display/CGP/Issues+And+Decisions\">https://confluence.hl7.org/display/CGP/Issues+And+Decisions</a><br>\nThe current Proposed Resolution indicates ‘FHIR can put extra authors in Provenance, as long as there is a time. Criterion for the \"primary\": earliest. If a tie, alphabetical’.   </p>\n<p>First, with regard to conveying C-CDA author participation instances as instances of the FHIR Provenance Resource, back in 2020 <span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span> proposed that only instances of the new Provenance Author Participation (2.16.840.1.113883.10.20.22.5.6) template should be mapped to FHIR Provenance.agent.who with a Provenance.agent.type of ‘author’.    i.e., This is healthcare and only ‘explicit provenance’ as indicated by use of the Provenance Author Participation template should be considered to indicate that author Provenance is being conveyed.  This proposal was also discussed at the July, 2020 C-CDA IAT.  </p>\n<p>Second, in September of 2020, there were extensive discussions with the FHIR Patient Care workgroup about various proposals for mapping of C-CDA Problem Observation participant (e.g., author, informant, performer) data to the FHIR US Core Condition and Provenance Resources.  Coming out of those discussions, the Patient Care workgroup’s recommendations with regard to Condition.recorder and Condition.recordedDate were as follows:<br>\n      • The US Core Condition.recorder SHALL be left null for any Condition resources derived from C-CDA Problems Section problems.  More specifically, C-CDA Problem Observation participations (e.g., authors, informants or performers) will not be mapped to the US Core Condition.recorder attribute on US Core Condition resource instances derived from C-CDA Problem Observations. <br>\n      • The Condition.recordedDate SHALL be harvested from the C-CDA Problem Observation author participation with the earliest author/time/@value.  Please note that the CDA author context conduction rules apply when determining the author(s) of the C-CDA Problem Observation.  </p>\n<p>I realize that here we are talking about mapping C-CDA Allergy – Intolerance Observation participants to the FHIR US Core AllergyIntolerance, but I wonder if we should consider taking a similar approach?  </p>\n<p>cc <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 258534266,
        "sender_full_name": "David Riddle",
        "timestamp": 1634818693
    },
    {
        "content": "<p>Let's try this approach- chat here and use the log for signficant developments &amp; decisions.</p>\n<p>I agree Condition &amp; Allergy should be as similar as possible.</p>\n<p>Regarding PC guidance, I recall the discussion, and some of the conclusions, but I must have had to drop before the <a href=\"https://confluence.hl7.org/display/PC/2020-09-03+Patient+Care+FHIR+Conference+Call\">decision on 9/3</a></p>\n<p>The cardinality issue, I believe, resulted in the prohibition on using Condition.recorder, because no one could identify a criterion for which one to put in the place of honor.</p>\n<p>When I left the option being discussed was</p>\n<ol>\n<li>If there is one author, use it for recorder.</li>\n<li>If there are several authors, and there is one with an earliest date, use that one for recorder; put the rest in provenance.</li>\n<li>If there are several authors, and there is not one with an earliest date: TBD</li>\n</ol>\n<p>We can adopt the documented approach, but<br>\na) it's pretty lossy<br>\nb) it goes beyond our remit of FHIR Core &amp; 2.1<br>\nc) the overreach doesn't even make it less lossy</p>",
        "id": 258538257,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1634820351
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191985\">Jay Lyle</span> <a href=\"#narrow/stream/179191-cda-to.20fhir/topic/Allergy.20Mapping/near/258538257\">said</a>:</p>\n<blockquote>\n<p>We can adopt the documented approach, but<br>\na) it's pretty lossy<br>\nb) it goes beyond our remit of FHIR Core &amp; 2.1<br>\nc) the overreach doesn't even make it less lossy</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span>, <br>\nI don't know what you are describing when you say 'the overreach doesn't even make it less lossy'.   What do you mean by 'the overreach'?</p>\n<p>I also don't know what you are describing when you say 'it goes beyond our remit of FHIR Core &amp; 2.1'.  What is 'our remit of FHIR Core &amp; 2.1'?</p>",
        "id": 258549248,
        "sender_full_name": "David Riddle",
        "timestamp": 1634824517
    },
    {
        "content": "<p>\"Our remit\": project scope of CCDA 2.1 &amp; FHIR US Core 4. <br>\n\"Overreach\": using extensions and other assets not included in either of those.</p>",
        "id": 258555640,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1634826641
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> ,<br>\n'\"Overreach\": using extensions and other assets not included in either of those.' - So by  'Overreach' are you referring to  the notion that CDA author context conduction rules apply when determining the author(s) of the C-CDA Problem Observation., or to something else?</p>",
        "id": 258578262,
        "sender_full_name": "David Riddle",
        "timestamp": 1634834411
    },
    {
        "content": "<p>I mean the Provenance Author Participation (2.16.840.1.113883.10.20.22.5.6), which is not part of the two specs we're focusing on.</p>",
        "id": 258609588,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1634847120
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191985\">Jay Lyle</span> <a href=\"#narrow/stream/179191-cda-to.20fhir/topic/Allergy.20Mapping/near/258609588\">said</a>:</p>\n<blockquote>\n<p>I mean the Provenance Author Participation (2.16.840.1.113883.10.20.22.5.6), which is not part of the two specs we're focusing on.</p>\n</blockquote>\n<p>Even if we don't want to recognize/account for instances of the Provenance Author Participation (2.16.840.1.113883.10.20.22.5.6) template in our proposed mappings, I don't think that would change the stance <span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span> was proposing that only instances of the new Provenance Author Participation (2.16.840.1.113883.10.20.22.5.6) template should be mapped to FHIR Provenance.agent.who with a Provenance.agent.type of ‘author’.  i.e., This is healthcare and only ‘explicit provenance’ as indicated by use of the Provenance Author Participation template should be considered to indicate that author Provenance is being conveyed.  </p>\n<p>So even if we don't want to include mapping of Provenance Author Participation instances (because that template is not part of the two specs we're focusing on), that doesn't mean that we should treat standard Author Participation (2.16.840.1.113883.10.20.22.4.119) as author agent Provenance for the resources we derive from C-CDAs.</p>",
        "id": 258616312,
        "sender_full_name": "David Riddle",
        "timestamp": 1634849943
    },
    {
        "content": "<p>Happy to discuss. Drew's idea may be exactly right.</p>\n<p>But I'd have some questions.</p>\n<ol>\n<li>Do we want to drop author information when converting CDA to FHIR? Even if there's a place for it? Why?</li>\n<li>How is using the new template any more \"explicit\" than assigning an author using 2.16.840.1.113883.10.20.22.4.119?</li>\n</ol>\n<p>Monday?</p>",
        "id": 258642030,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1634864730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> ,<br>\nI had proposed (see below) to <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> that this might be a topic for the upcoming C-CDA IAT.   I think she may be going to bring it up in the end of day session on 10/27, but we should confirm that with her.</p>\n<p>'I wonder if the assertions that Drew Torres made previously about only treating explicit instances of the Provenance Author Participation template as Provenance (‘This is healthcare.  We shouldn’t be inferring Provenance.  It should be explicit.’ – Drew) would be worth review with implementers at the upcoming IAT?'</p>",
        "id": 258707532,
        "sender_full_name": "David Riddle",
        "timestamp": 1634907466
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> ,<br>\nAlso above you asked 'How is using the new template [Provenance Author Participation] any more \"explicit\" than assigning an author using 2.16.840.1.113883.10.20.22.4.119?'.   I have some thoughts on that, but rather than attempting to speak for <span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span> ,  maybe we can get him to weigh in on that here?</p>\n<p><span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span> ,<br>\nCould you help <span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> understand your reasoning on this point?</p>",
        "id": 258707927,
        "sender_full_name": "David Riddle",
        "timestamp": 1634907641
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> I'd like to understand the scenario where these rules would apply.  Is the use case an EHR at Provider B consumes a C-CDA document that came from Provider A?  Now the EHR of Provider B is being updated.  Why is FHIR needed at all?  Are you simply trying to create a FHIR document version of the very same information that is represented in the C-CDA document that tells the story from EHR A's point of view?  Please describe the scenario a bit more.</p>",
        "id": 259746383,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635620836
    },
    {
        "content": "<p>Condition.recorder and Allergy-Intolerance.recorder only have a cardinality of 0..1 because they reference the entity who is recording the information now into the patient's chart at this entities system.  If there are other prior information recorders known (these would be authors in CDA speak) they could be represented in the Provenance resource, but we are only recommending this to be done when the C-CDA Provenance Author Participation template is explicitly asserted.</p>",
        "id": 259746618,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635621204
    },
    {
        "content": "<p>@Jay, you need to take into consideration that all templates in C-CDA R2.1 are Open Templates, and as such, they include all the modeling that comes with base CDA.  Use of the rest of CDA is not Out of Scope. It is IN SCOPE because C-CDA R2.1 implies ALL OF CDA R2.0 as constrained by templates define in C-CDA R2.1.</p>",
        "id": 259746764,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635621419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> My two cents on this has to do with intention.  The original author participation template is circa 2015. It got started being used before anyone was thinking much about Provenance and the authenticity of asserting who author really was.  By the time the new Provenance Author Participation template was defined, the true \"Provenance purpose\" was more clear.  It should only be asserted to when in fact the organization who is sharing the patient's record stands behind the meaning of that template.  To use it in your xml output is to actively and knowingly assert that this in fact is the person who documented that information in the patient's record.  Systems who don't know that with certainty regarding the information they are outputting for exchange should not assert that level of authenticity associated with the author information. .</p>",
        "id": 259747024,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635621873
    },
    {
        "content": "<p>Actually, the Provenance - Author Participation template is present in the CCDA spec. So we'll need to address it. But the description does not make the suggested purpose clear. If we're going to assume that the appropriate author is in this template, and that others can be ignored, implementers will need much more specific guidance.</p>\n<p>Re Open templates in general: yes, you can represent pretty much anything in CDA. And the XML may be legible for much of it, as long as it's not too deep. But systems may be limited in their ability to deal with open additions. And we need to make sure our scope is realistic in each of these cases.</p>",
        "id": 259751858,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1635628475
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192205\">Lisa Nelson</span> <a href=\"#narrow/stream/179191-cda-to.20fhir/topic/Allergy.20Mapping/near/259746618\">said</a>:</p>\n<blockquote>\n<p>Condition.recorder and Allergy-Intolerance.recorder only have a cardinality of 0..1 because they reference the entity who is recording the information now into the patient's chart at this entities system. </p>\n</blockquote>\n<p>That's not clear from the definition, \"Individual who recorded the record and takes responsibility for its content.\"</p>",
        "id": 259751888,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1635628522
    },
    {
        "content": "<p>Jay Lyle said:<br>\nActually, the Provenance - Author Participation template is present in the CCDA spec. So we'll need to address it.</p>\n<p>That's not quite right. The Provenance Author Participation template is defined in the C-CDA Companion Guide.  I still agree we need to address it even though it isn't actually in C-CDA R2.1.  We may need to explicitly include the Companion Guide in our scope expectations....and add those templates to the list of relevant templates for mapping.</p>",
        "id": 259815870,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635725279
    }
]