[
    {
        "content": "<p>Hello, I would like to ask how should I parse AllergyIntolerance FHIR resource to AllergyIntolerance section in the Continuity of Care Document (C-CDA). Each  AllergyIntolerance can be represented as Allergy Concern Act (V3) with one Allergy - Intolerance Observation (V2). But the problem is that many AllergyIntolerances can concern one allergy over time. So it would be good to group them into one Allergy Concern Act (V3). It is possible to find out how the AllergyIntolerance resources should be grouped into acts? Or what is the best way to parse AllergyIntolerance FHIR resources into  AllergyIntolerance section? I would appreciate some help. Thank you in the advance!</p>",
        "id": 256580944,
        "sender_full_name": "Piotr Sokoliński",
        "timestamp": 1633614878
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/lWizxLVa-fPia1E3Dv0lhV2a/AllergyFHIRCDAReport.xlsx\">AllergyFHIRCDAReport.xlsx</a> Here is a draft of the mapping based on working with the CDA 2 FHIR work group generated from MDMI [AllergyFHIRCDAReport.xlsx]  MDMI supports a rest API for transformations - here is the general information <a href=\"https://github.com/MDMI/Getting-Started\">https://github.com/MDMI/Getting-Started</a>. Are you able to discuss in further you general use case ?  Only have allergies in a document does not seem like a complete solution - were there other</p>",
        "id": 256758777,
        "sender_full_name": "Sean Muir",
        "timestamp": 1633707591
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span></p>",
        "id": 257125748,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1633992734
    },
    {
        "content": "<p>Thank you for your help. I am working on all required sections of the CCD document, but I wanted to start with a question about AllergyIntolerance and see how it goes. If it is possible for you to provide me information (xlsx) about other sections (such as Problem, Result, Procedure, Vital Signs, Immunizations) I would really appreciate it. I have done some work already but I would gladly confront it with the data you have.</p>",
        "id": 257154022,
        "sender_full_name": "Piotr Sokoliński",
        "timestamp": 1634018795
    }
]