[
    {
        "content": "<p>Hi All,</p>\n<p>We are trying to read the Health Concern section of a CCDA and map that section to a FHIR Condition resource. In the CCDA Health Concern section there are entries for each concern/condition, but these refer to one or more related conditions, problems, or medications. What is the proper way to define a Condtion resource with all of it's related entries? </p>\n<p>Many Thanks,<br>\nMichael</p>",
        "id": 153991315,
        "sender_full_name": "Michael Allange",
        "timestamp": 1535473586
    },
    {
        "content": "<p>In FHIR, the notion of Concern is expressed by including an entry in the practitioner's (or patient's) problem List.  Multiple representations of the same problem are tied together using the Linkage resource.  Supporting information is linked using appropriate relationships.  As well, EpisodeOfCare can be used to tie together resources related to a particular condition (e.g. everything associated with a pregnancy, everything associated with a patient's hypertension, etc.)</p>",
        "id": 153991317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535474749
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>, anything futher to add?  We might want to add something to the spec that answers this question as it's a common one.</p>",
        "id": 153991318,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535474780
    },
    {
        "content": "<p>\"Concern\" can be an overloaded term in the US, especially.  On one hand, Lloyd is correct that we've said the Linkage resource should be used to represent the aggregated concern, which links all other events together.  On the other hand, the US Core IG's Condition profile, <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-condition.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-condition.html\">http://hl7.org/fhir/us/core/StructureDefinition-us-core-condition.html</a>, mentions using the Condition resource to represent concerns, but in this context it's more about representing \"what\" the concern event was (sometimes expressed by a patient - and may or may not appear on the provider's problem list).  In any case, I agree that we should add guidance to the specification, but it will require some thoughtful language to differentiate between Condition vs Linkage.</p>",
        "id": 153991319,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1535475958
    },
    {
        "content": "<p>Thanks very much. US core is what we are using and we have been confused. We see examples that use the Condition narrative text itself and not the linkage.</p>",
        "id": 153991321,
        "sender_full_name": "Michael Allange",
        "timestamp": 1535476597
    },
    {
        "content": "<p>I've added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17736\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17736\">GF#17736</a></p>",
        "id": 153991325,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535477305
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195654\">@Matt Lord</span> , <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <br>\nDoes the use of US CORE profile for Condition.category resolve any of the mapping gaps we had between C-CDA Problem Concern entry and FHIR?</p>\n<p>Or, do mappings between C-CDA problem concern entry template  and FHIR US Core Condition profile still exist?</p>",
        "id": 189970406,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1583586846
    }
]