[
    {
        "content": "<p>how is a fax nuber represented in CCDA?</p>",
        "id": 153821840,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1460687490
    },
    {
        "content": "<p>This is how you represent a fax number in CDA:<br>\n&lt;telecom use=\"WP\" value=\"fax:+1(555)555-2000\"&gt;&lt;/telecom&gt;</p>\n<p>The problem we face right now is the value set bound to the use attribute is insufficient for today's use cases, which include support for Direct Addresses (currently needed) and FHIR endpoints (emerging need). We currently represent a Direct address like this.</p>\n<div class=\"codehilite\"><pre><span></span>&lt;telecom use=&quot;DIR&quot; value=&quot;mailto:DrJohn@direct.WoodRiverHealth.com&quot;/&gt;\n&lt;telecom use =&quot;DIR&quot; value=&quot;mailto:WoodRiverHS-office@direct.WoodRiverHealth.com&quot;/&gt;\n</pre></div>\n\n\n<p>I think we would represent a FHIR endpoint for information communication uses like this:</p>\n<p>&lt;telecom value=\"https://www.maxmddirect.com/fhir/identifier/sdc/task-medication-refill-request\"/&gt;  </p>\n<p>We don't have @use values that are a good fit for information processing expected to happen via FHIR API calls or for when we want to be more specific about the use.</p>\n<p>For example, when a practice uses direct, they may or may not expose addresses for individual physicians or admin support personnel.  They also may establish handy Direct addresses for which multiple individuals manage the secure flow the digital information.  For example, addresses for digitally communicating with other providers, payers,  and patients about these sorts of things (think of the typical telephony system that helps to route phone calls to the right department):<br>\n                - Medication Refills or Questions<br>\n                - Care Coordination<br>\n                - Dental<br>\n                - Behavioral Health<br>\n                - Referrals<br>\n                - Billing-Claims</p>\n<p>Once UTG is really rolling, I would like to use this simple need, \"How do I use the UTG process to add more use concepts to the telecomunicationAddressUse value set ?\" to see how this need would be addressed (<span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>  , <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span>        could I do this as part of your pilot? )</p>\n<p><strong>** Detail  </strong>**<br>\nValue Set for use in the telecom tag (SEEMS TOO LIMITED FOR TODAY'S USE CASES):<br>\n                1   A: AddressUse   V190            <br>\n2     S: HomeAddressUse (H) V10628  H   home address    <br>\nA communication address at a home, attempted contacts for business purposes might intrude privacy and chances are one will contact family or other household members instead of the person one wishes to call. Typically used with urgent cases, or if no other contacts are available.</p>\n<p>3       L:  (HP)    10629   HP  primary home    <br>\nThe primary home, to reach a person after business hours.</p>\n<p>3       L:  (HV)    10630   HV  vacation home   <br>\nA vacation home, to reach a person while on vacation.</p>\n<p>2     S: WorkPlaceAddressUse (WP)   V19613  WP  work place  <br>\nAn office address. First choice for business related contacts during business hours.</p>\n<p>3       L:  (DIR)   20891   DIR Direct  <br>\nIndicates a work place address or telecommunication address that reaches the individual or organization directly without intermediaries. For phones, often referred to as a 'private line'.</p>\n<p>3       L:  (PUB)   20892   PUB Public  <br>\nIndicates a work place address or telecommunication address that is a 'standard' address which may reach a reception service, mail-room, or other intermediary prior to the target entity.</p>\n<p>2     L:  (BAD) 10641   BAD bad address <br>\nA flag indicating that the address is bad, in fact, useless.</p>\n<p>2     L:  (TMP) 10640   TMP temporary address   <br>\nA temporary address, may be good for visit or mailing. Note that an address history can provide more detailed information.</p>\n<p>1   L:  (AS)    10633   AS  answering service   <br>\nAn automated answering machine used for less urgent cases and if the main purpose of contact is to leave a message or access an automated announcement.</p>\n<p>1   L:  (EC)    10634   EC  emergency contact   <br>\nA contact specifically designated to be used for emergencies. This is the first choice in emergencies, independent of any other use codes.</p>\n<p>1   L:  (MC)    10636   MC  mobile contact  <br>\nA telecommunication device that moves and stays with its owner. May have characteristics of all other use codes, suitable for urgent matters, not the first choice for routine business.</p>\n<p>1   L:  (PG)    10635   PG  pager   <br>\nA paging device suitable to solicit a callback or to leave a very short message.</p>\n<p><strong>** End Detail </strong>***</p>\n<p>Secondarily, I would love to see our alignment efforts address the question, \"How do we align CDA and FHIR on the possible uses for various communication endpoints, such as FHIR endpoints established for specific information communication uses, Direct endpoints established for specific information communication uses, fax numbers established for specific information communication uses, and phone numbers established for specific information communication uses?\"</p>",
        "id": 189969603,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1583585322
    },
    {
        "content": "<p>UTG won't allow changes to FHIR telecommunication address use.  It's a fixed binding to a 'code' datatype and is hard-coded in schema and code all over the place.  The only way it can change is through a change request resulting in a new release of FHIR.  There's a US-core extension for 'direct' addresses - <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-direct.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-direct.html\">https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-direct.html</a>.  ('Direct' is generally U.S. specific and isn't widely used outside the U.S. so it doesn't belong in core.)  </p>\n<p>Note that pager is a system, not a use.  The v3 value set was thoroughly reviewed at the time the FHIR set was created and all of those excluded were excluded by conscious choice.  Anyone is free to make a change request arguing for the inclusion of a new concept, but \"we had it in v3\" or \"we had it in v2\" won't be sufficient by itself.</p>",
        "id": 189976005,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583597629
    }
]