[
    {
        "content": "<p>Hi, I want to convert a CDA file which has some XML information about patient, medication,.....<br>\nI want to convert it to FHIR resources using mapping. What is the best way? Is there any tutorial about it?</p>",
        "id": 153931018,
        "sender_full_name": "Nassirian",
        "timestamp": 1517058333
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> ?</p>",
        "id": 153931066,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517065676
    },
    {
        "content": "<p>I am trying to map xml cda document to Fhir resources using structureMap resource.I defined my xml CDA document as source .But I can not find any way to link my defined structureMap resource to corresponding FHIR resources. Actually i don't know how to use this structureMap and get a fhir resource as Target.  is there any example ? any tutorial?</p>",
        "id": 153932747,
        "sender_full_name": "Nassirian",
        "timestamp": 1517220426
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 153932762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517229254
    },
    {
        "content": "<p>Thanks for your response .Yes.I am trying to use  the method of  Grahame Grieve ,but couldn't find tutorial for  java implementation. Actually looking for how to use StructureMapUtilities in FHIR.I will be grateful.</p>",
        "id": 153932774,
        "sender_full_name": "Nassirian",
        "timestamp": 1517230411
    },
    {
        "content": "<p>Actually, this happens to be on my list of things to do this week. but there's an example of executing the engine in ValidationEngine. I need to do some CDA samples as well</p>",
        "id": 153932791,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517234188
    },
    {
        "content": "<p>Thanks a lot.Where can I find it  next week when you will be finished?in which link?</p>",
        "id": 153932865,
        "sender_full_name": "Nassirian",
        "timestamp": 1517239351
    },
    {
        "content": "<p>It will be here</p>",
        "id": 153932872,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517239578
    },
    {
        "content": "<p>Many thanks.I will intensively waiting.</p>",
        "id": 153932878,
        "sender_full_name": "Nassirian",
        "timestamp": 1517239785
    },
    {
        "content": "<p>Hi - has any one developed a tool that ingest a CCDA and outputs the data as FHIR Resources?  I have a CCDA that I need to turn into FHIR resources for a demo at HIMSS and would really appreciate the assist.</p>",
        "id": 153941272,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519851148
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> had an XSLT transform that could do part of this...</p>",
        "id": 153941398,
        "sender_full_name": "David Hay",
        "timestamp": 1519874137
    },
    {
        "content": "<p>it's something we'll be investing in over the next few months. There's bits of work, but nothing generally accepted</p>",
        "id": 153941441,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519892124
    },
    {
        "content": "<p>The XSLT transforms David referred to are here. They were updated for HIMSS, and now cover a fair amount of C-CDA, but the primary focus/coverage are templates needed for Pharmacy Care Plan documents. <br>\n<a href=\"https://github.com/lantanagroup/PhCP-Public-Transforms\" target=\"_blank\" title=\"https://github.com/lantanagroup/PhCP-Public-Transforms\">https://github.com/lantanagroup/PhCP-Public-Transforms</a></p>",
        "id": 153951242,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1523040779
    },
    {
        "content": "<p>Qvera has just added a CDA to FHIR Demo channel that is included with the Qvera FHIR Starter Kit. Using the Qvera Interface Engine, any CDA document can be converted into a FHIR Bundle of resources and then validated against any of the public FHIR servers. The Qvera FHIR Starter Kit can be downloaded and used for free from <a href=\"https://www.qvera.com/fhir-starter-kit\" target=\"_blank\" title=\"https://www.qvera.com/fhir-starter-kit\">https://www.qvera.com/fhir-starter-kit</a></p>",
        "id": 153951901,
        "sender_full_name": "Ron Shapiro",
        "timestamp": 1523463313
    },
    {
        "content": "<p>Hi,<br>\nCan anyone share the link to the mapping document for CCD to FHIR conversion?</p>",
        "id": 153952455,
        "sender_full_name": "Bhushan Baviskar",
        "timestamp": 1523871702
    },
    {
        "content": "<p>I would have thought the mappings would have been included in the CCDA on FHIR IG, but looking at the profiles, I don't see them.  <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> , <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 153952747,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523991624
    },
    {
        "content": "<p>they don't exist... we're working on them (lots of things exist informally, and google may turn them up....)</p>",
        "id": 153952777,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524004943
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> As Grahame said. Mappings were not in scope for the initial C-CDA on FHIR ballot, but are part of the new PSS we ran by FHIR-I and FMG recently, which will update C-CDA on FHIR with mappings. The open source XSLT transforms I linked to previously were developed separately under an ONC grant.</p>",
        "id": 153952876,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1524027141
    },
    {
        "content": "<p>So nobody is doing the mapping from CCD to FHIR resources as of now? I am specifically looking for CCD to FHIR conversion and not other CCDA documents.</p>",
        "id": 153960575,
        "sender_full_name": "Bhushan Baviskar",
        "timestamp": 1526318838
    },
    {
        "content": "<p>there is an ongoing HL7 project to map from CCDA to FHIR which includes CCD to FHIR.</p>",
        "id": 153960577,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1526318958
    },
    {
        "content": "<p>Is there a link or repo where work will be posted?</p>",
        "id": 153960737,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526333911
    },
    {
        "content": "<p>What's the best way to get involved with this project?</p>",
        "id": 153970646,
        "sender_full_name": "David Hay",
        "timestamp": 1529447284
    },
    {
        "content": "<p>Any update on this? We have some questions about mapping that we'd love to discuss in this forum...</p>",
        "id": 153971380,
        "sender_full_name": "David Hay",
        "timestamp": 1529880798
    },
    {
        "content": "<p>sure - ask specific questions - more likely to get an answer. The problem with a question like, 'what's the best way to get involved ?'is that no one really knows...</p>",
        "id": 153971468,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529922064
    },
    {
        "content": "<p>We are trying to understand more about CDA vs FHIR documents and how each are expected to be implemented in a given health system. We have several samples of both CDA documents and FHIR resources pulled from the same system (same patient, same medical record). However, we are finding that the data provided in the CDA document is more complete than the data being provided in FHIR though we are not aware that we are restricting anything in the request. Our general question now is: Are FHIR and CDA implementations within the same system required to be identical? That is, if implemented, is it required that the same data be available via both methods or is it possible some health systems have an incomplete FHIR implementation such that a CDA might have more data available than FHIR?</p>",
        "id": 163676507,
        "sender_full_name": "Aaron Pearson",
        "timestamp": 1555611575
    },
    {
        "content": "<p>There's no requirement that different APIs must expose the same information.  It's completely possible for CDA to expose more information (or less information or just different information) than FHIR.  The same goes for v2 vs. FHIR or v2 vs. CDA.  The reasons for variation could be driven by different API purposes, different demands by the standards governing each API, different internal business drivers or just different maturities of the respective interfaces.  You might also find different behavior in different systems.</p>",
        "id": 163679192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555613154
    }
]