[
    {
        "content": "<p>Is C-CDA on FHIR going to allow for the \"non-XML Body\" (Level 1) style of CDA? If so how?</p>",
        "id": 153842899,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1470602873
    },
    {
        "content": "<p>I don't think it should; in CDA land, that made sense, but in FHIR, that would be a DocumentReference</p>",
        "id": 153842904,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470604529
    },
    {
        "content": "<p>Yes - I see some logic in that. But if a DocumentReference is used on its own, then all the other information from the \"CDA Header\" is lost. </p>",
        "id": 153842908,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1470607236
    },
    {
        "content": "<p>what information are you concerned about? infomration that you usually have for a nonXmlBody? I've not seen it have more information than a DocumentReference anyway (in fact, a lot less)</p>",
        "id": 153842914,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470611413
    },
    {
        "content": "<p>It is very close but has differences around \"event\", \"confidentiality\",  \"attester\" etc<br>\nFurthermore it makes the recipient have to deal with two different content patterns.<br>\nThat said - I'm still interested to see how (if) C-CDA are going to cater for this.</p>",
        "id": 153842956,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1470639829
    },
    {
        "content": "<p>So this question has raised its head again in one of our projects. In the scenario where we have a non-FHIR document (e.g. PDF,  PNG etc) we are using the DocumentReference resource. The questions which still remains unclear as to where we actually put the document being referenced.</p>\n<p>Our use case does not involve any RESTful interfaces and the \"document\" will manifest itself as a \"Bundle\" containing all the necessary resources required to describe the document</p>\n<p>There seem to be two options:<br>\n1) Place it directly within the DocumentReference at DocumentReference.content.attachment.data<br>\n2) Place it externally to DocumentReference using  DocumentReference.content.attachment.url to point to the actual document</p>\n<p>Option (1) seems to be easier to implement in that there are less resources required as the actual document can be Base64 encoded directly in the DocumentReference resource<br>\nOption (2) allows the reference and the \"document\" to be separated from each other which is potentially closer to XDS patterns. In our solution we'd place the document in a Binary resource and reference it within the bundle.</p>\n<p>I haven't been able to find any other IGs that are looking in this area to see what others are doing. I'm also not sure whether IHE are doing anything in this areas (<span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?). Anyone have any thoughts?</p>",
        "id": 153878713,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1490091216
    },
    {
        "content": "<p>Both are enabled by FHIR. IHE in the MHD profile chose to use attachment.url. As you point out this is more consistent with XDS. But it also has other advantages. Accessibility, no need to un base64 encode; just access it. More reasonable size of either, allowing a consuming system to choose based on the DocumentReference metadata, if it wants to retrieve the document. etc.</p>",
        "id": 153878719,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490096298
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> we are progressing with option 2 from above in our solution. We're currently constrained to a FHIR Messaging mode of operation but this approach gives up flexibility to adapt at a later stage if required.</p>",
        "id": 153878726,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1490097619
    },
    {
        "content": "<p>In a messaging model you still gain space and more easy access with ( 2 ). You also had a ( 3 ) option to use Contained... but with a messaging model you have that advantage without the drawbacks of contained. </p>",
        "id": 153878729,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490097828
    },
    {
        "content": "<p>Option 2 enables you to retrieve and pass around the metadata (including things like the hash) without passing around the Binary itself.  Having the separated also allows control over the data independent of control of the indexing information and potentially lets you have a systems that's \"tuned\" to dealing with large data handle the binary calls separate from the FHIR calls.  Also, when looking at instances as a developer/debugger, it's a bit easier to \"collapse\" the Binary data if it's sitting in its own resource, though that's a minor thing.</p>",
        "id": 153878759,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490109501
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I concur with your comments. In our scenario there are no \"calls\" as the whole payload travels as one bundle in a single message, but it provides options for the future.</p>",
        "id": 153878786,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1490110535
    },
    {
        "content": "<p>Right.  When it's all in the message, it really doesn't matter so much.  The design considerations are more about how you might want to access or manipulate the data in the future.</p>",
        "id": 153878787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490110669
    },
    {
        "content": "<p>And with the size in the header, a mobile app (or bandwidth constrained env) can choose when to grab the content, and how long it might expect it to take.</p>",
        "id": 153878924,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1490130632
    }
]