[
    {
        "content": "<p>Does inclusion in the CDA Problem Section imply membership in a Problem List, or is it a collection of all known problem observations?<br>\nCompanion Guide 5.2.6: \"Currently the Problem Section uses the Problem Concern template to record concerns commonly identified as being “on the patient’s problem list”.\"<br>\nSection code: 11450-4 (Problem List - Reported)<br>\nKnowing there are cases where this guidance is not followed, should we assume it is, try to change those cases, or decline to follow it?</p>",
        "id": 272050585,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1644966031
    },
    {
        "content": "<p>cross-ref issues at <a href=\"https://confluence.hl7.org/display/CGP/Issues+And+Decisions\">https://confluence.hl7.org/display/CGP/Issues+And+Decisions</a></p>",
        "id": 272050659,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1644966085
    },
    {
        "content": "<p>Background: VA VHIE puts \"Problem\" file problems in problem list &amp; \"Visit\" diagnoses in encounters, but aggregator also searches encounters and adds found diagnoses to Problems section.</p>",
        "id": 272052842,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1644967654
    },
    {
        "content": "<p>This highly depends on the clinical workflow and implementation, and I don't believe it to be a simple problem to solve as a one size fits all solution. We did some work in IHE PCC several years ago around this creating a base concern entry, and derived entries for problem concern and allergy concern that may provide some addition understanding. These entries were then used in Profiles to provide further usage/use case constraints as appropriate. Check out section 6.3.4.11 in the PCC TF Vol 2: <a href=\"https://www.ihe.net/uploadedFiles/Documents/PCC/IHE_PCC_TF_Vol2.pdf\">https://www.ihe.net/uploadedFiles/Documents/PCC/IHE_PCC_TF_Vol2.pdf</a></p>",
        "id": 272129541,
        "sender_full_name": "Tone Southerland",
        "timestamp": 1645024857
    }
]