[
    {
        "content": "<p>Hi all - I'm looking at converting CCDs to FHIR resources, to allow them to contribute to a complete medical record for a patient. The people at <a href=\"http://openhealthhub.org\">openhealthhub.org</a> were really helpful, and I've been making some good progress. However, we were talking to <span class=\"user-mention\" data-user-id=\"191802\">@Tim Blake</span> , and he suggested I post here and see whether anyone had any good ideas that would help us push forward with that.</p>\n<p>The plan is to create an app that is able to parse the most important parts of a CCD, convert them to FHIR resource models, and present them to the user (either the patient, or someone helping them) for verification, before allowing the user to submit them to a FHIR server. Of course, I realise that retrieving 100% of the CCD content and converting that to FHIR with perfect accuracy is not realistic. Just getting to a reasonably complete state would be an excellent result, and for now, just a proof of concept would do nicely.</p>\n<p>Following the advice received at <a href=\"http://openhealthhub.org\">openhealthhub.org</a>, I've started out writing code to translate CCD to FHIR resources, taking into account some of the CCD variations I've encountered. That's going well. However, if anyone knows of any existing code, systems etc. that would help me with that, I'd be keen to hear. (Languages are C# and JS. Some of the info found here, such as mappings and .xslts, have already helped.)</p>",
        "id": 197256706,
        "sender_full_name": "Michael van Bokhoven",
        "timestamp": 1589279192
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 197342546,
        "sender_full_name": "Tim Blake",
        "timestamp": 1589319113
    },
    {
        "content": "<p>To be fair, the idea to convert CCD/CCDA to FHIR is Fairley convenient, it is not as cumbersome as converting HL7v2 to FHIR. As most of the EM/EHR system's adhere to a standard template of CCDA. </p>\n<p>The point to be noted here is that I don't see any open-source site's discussing the functional mapping of CDA to FHIR resources. I'm already in the process of creating one. Specifically for mapping CCDA to FHIR resources as of R4. I looked into <a href=\"http://openhealthhub.org\">openhealthhub.org</a> it is very interesting. Also will share my mapping there as much as i can</p>",
        "id": 220807598,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1608743554
    }
]