[
    {
        "content": "<p>This is specifically about display(Name). There is a significant difference between V3 and FHIR:</p>\n<p><strong>V3 displayName</strong><br>\nA name or title for the code, under which the sending system shows the code value to its users.</p>\n<p><strong>FHIR coding.display</strong><br>\nThe display is a human display for the text <strong>defined by the system</strong> - it is not intended for computation.</p>\n<p>So in converting V3 to FHIR: do I have to check every displayName in V3 before I submit that as Coding.display? Or is it not so bad to just convert V3 displayName to Coding.display?</p>",
        "id": 255020390,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1632735941
    },
    {
        "content": "<p>what is the \"significant difference\" you perceive? I am not saying that I think they are identical, just wanting to think through your specific point.</p>",
        "id": 255040456,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632746417
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>:  The V3 display is not a textual representation as defined by the codesystem, although it will have the same semantic meaning.</p>\n<p>However, mapping such a display to FHIR coding.display will result in FHIR validators complaining the display does not adhere to the display as defined by the codesystem, which is in fact a correct complaint given the FHIR requirements.</p>",
        "id": 255061651,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1632754412
    },
    {
        "content": "<p>FHIR allows coding.display to be any designation defined by the code system or the value set</p>",
        "id": 255062738,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632754746
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179191-cda-to.20fhir/topic/Translating.20V3.20CD.20to.20FHIR.20CodeableConcept/near/255062738\">said</a>:</p>\n<blockquote>\n<p>FHIR allows coding.display to be any designation defined by the code system or the value set</p>\n</blockquote>\n<p>Still, whatever a V3 system sends ('A name or title for the code, under which the sending system shows the code value to its users.') may still differ from codesystem designations. For example because context is implicit in the system, but explicit in the code. Or because a particular user group names stuff slightly different from other user groups, even though the semantic meaning is the same.</p>",
        "id": 255063248,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1632754891
    },
    {
        "content": "<p>Right, but you can treat those as having come from a system-specific value set, which is still kosher from FHIR's perspective - and you can't validate against a value set when you don't know what it is.  Which is why the terminology server only issues warnings when the Coding.display doesn't match the designations it has from that code system.</p>",
        "id": 255068915,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632756844
    },
    {
        "content": "<p>In short - I don't see any conversion issue from v3 to FHIR here.</p>",
        "id": 255068955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632756857
    },
    {
        "content": "<p>Wait ... if there's a _required_ ValueSet binding, shouldn't the <code>display</code> align with one of the designation in this ValueSet (or underlying CodeSystem)?</p>",
        "id": 255175395,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1632815050
    },
    {
        "content": "<p>Value set binding doesn't mean that the bound value set is the one used for data capture.  You'll get a warning, but it's not an error.</p>",
        "id": 255226098,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632839412
    },
    {
        "content": "<p>If V3.displayName and Coding.display may essentially be regarded as equivalent, then apparently just about any string could be supplied in those places. Which makes me wonder: why is reporting differences with what the validator thinks it knows about the legal display values even a warning? Would \"info\" not suffice (if at all)?</p>",
        "id": 255233908,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1632842149
    },
    {
        "content": "<p>The thing is: too many warnings of the type \"well you really don't have to look at these\" makes you ignore potentially useful warnings over time. A warning should really be worth looking at.</p>",
        "id": 255234522,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1632842363
    },
    {
        "content": "<p>It's a warning because it <em>might</em> be an error - requires human review to determine.</p>",
        "id": 255238475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632843754
    },
    {
        "content": "<p>An 'info' message is known to not be an error.</p>",
        "id": 255238558,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632843788
    },
    {
        "content": "<p>My point is: you cannot know if it is an error, because basically any string coming from the sender is acceptable as long as that is what the user saw/picked or what the system derived from what was recorded. The number of warnings against mismatches in our context is relatively high thus leading to reduced sight on what is really important. \"Info\" would be a way of saying \"I found a mismatch\" without implying it is wrong. Yes it might be, but after initial development phase where you connect the dots: unlikely.</p>\n<p>In the validator/IG Publisher I can suppress certain warnings. I guess what you are saying is, is that the way to go is to filter warnings?</p>",
        "id": 255344938,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1632893965
    },
    {
        "content": "<p>catching up on this....</p>",
        "id": 255455954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632942321
    },
    {
        "content": "<p>I don't agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> on this one. The definitions are different in an important regard. FHIR corresponds more closely to v2:</p>\n<blockquote>\n<p>This is the corresponding text assigned by the coding system to the identifier.</p>\n</blockquote>",
        "id": 255456339,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632942475
    },
    {
        "content": "<p>My answers to the original question:</p>\n<blockquote>\n<p>do I have to check every displayName in V3 before I submit that as Coding.display? </p>\n</blockquote>\n<p>You don't have to do anything. But you'll get warnings if you don't, and the CDA document isn't using the print names etc that are correct in FHIR. Or you can get a list of what the CDA document source is using, and publish that as a profile + value set, and bingo, it's fine. </p>\n<blockquote>\n<p>Or is it not so bad to just convert V3 displayName to Coding.display?</p>\n</blockquote>\n<p>That depends</p>",
        "id": 255456723,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632942629
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - I'm pretty sure the validator allows designations defined by the value set to appear in Coding.display.  Do we need to clarify the definition?</p>\n<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> - A human might know what value set(s) were in play and thus be able to tell.  Even if they don't, they can at least detect gross copy &amp; paste errors (which is a common thing we pick up when validating examples in IGs).</p>",
        "id": 255466781,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632946519
    },
    {
        "content": "<p>the definition should be improved to talk about value set defined displays, yes</p>",
        "id": 255467563,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632946886
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-34037\">FHIR#34037</a></p>",
        "id": 255499217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632962543
    },
    {
        "content": "<p>Interesting twist :-) So where FHIR says \"system\" it should actually read \"the system or whatever we pre-agreed on in a value set\". This means that were V3 systems today send whatever their software system was configured with (could be the original system, could be a GPs preferred term, we don't know) should be regarded as CodeableConcept.text, unless we include knowledge of acceptable terms in ValueSets as part of the IG. Finally we could just copy <em>displayName</em> into <em>display</em> and ignore the warnings after inspection of a couple of them just to be sure. </p>\n<p>The thing here is that on scale it is not very feasible to start collecting what people have in their systems. It is also not very feasible to start saying that what they have in their systems should be replaced with 'official terms' upon sending it out in FHIR, if only because they originally send V3 where this is all fine.</p>",
        "id": 255694893,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1633068479
    },
    {
        "content": "<p>The key thing is that 'display' is expected to be system managed, never user-entered.</p>",
        "id": 255776103,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633107864
    },
    {
        "content": "<p>CodeableConcept.text would be the text the user actually saw. Another advantage of CodeableConcept vs Coding.</p>",
        "id": 255780311,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633109628
    },
    {
        "content": "<p>That system is usually configurable by doctors who enter their preferred terms for existing codes thus overriding 'official' system terms. I cannot know on the outside in a mapping about every code coming by what the status of the V3 display is.</p>",
        "id": 256030759,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1633340237
    }
]