[
    {
        "content": "<p>Would there be any interest in an ongoing group discussing how the factors, CDEs and decisions made in the Cancer-Interoperability group should be represented in FHIR specifically? As well, discussing and aligning specific FHIR resources or profiles? I have an IG that's fairly comprehensive of a breast cancer guideline and I would love to share  it dive into questions like what should that Condition resource look like. Sometimes they might be obvious, other times less so. So I'd love to share thoughts on cancer on FHIR.</p>",
        "id": 153911037,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1506527180
    },
    {
        "content": "<p>Hello I am new to FHIR.<br>\nAre the published rcpa cancer protocols also available within the FHIR standard as described here (<a href=\"http://hl7.org/fhir/us/breastcancer/2018Sep/logical.html\">http://hl7.org/fhir/us/breastcancer/2018Sep/logical.html</a>) or is this just an example? <br>\nIf yes where do I get access to them?</p>",
        "id": 242356797,
        "sender_full_name": "Samuel M.",
        "timestamp": 1623423406
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"419908\">@Samuel M.</span> ,<br>\nIf you are referring to the RCPA Structured cancer protocols found <a href=\"https://www.rcpa.edu.au/Library/Practising-Pathology/Structured-Pathology-Reporting-of-Cancer/Cancer-Protocols\">here</a>, then these protocols are not included in the US content at <a href=\"http://hl7.org/fhir/us/breastcancer/2018Sep/logical.html\">http://hl7.org/fhir/us/breastcancer/2018Sep/logical.html</a>.  <br>\nI believe <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> did some work on the FHIR representation of some of these RCPA structured cancer protocols a few years back and he may be able to comment further.</p>",
        "id": 243615295,
        "sender_full_name": "David McKillop",
        "timestamp": 1624433185
    },
    {
        "content": "<p>there's additional work going on in this is USA. I'm not sure if this has come to anything yet</p>",
        "id": 243615416,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624433309
    }
]