[
    {
        "content": "<p>I'm trying to sort out Grade and Stage in relation to Condition.severity and the concept of Criticality that appears in AllergyIntolerance. Working definitions:</p>\n<ul>\n<li>Severity is the degree of harshness or extent of a symptom, disorder, or problem.</li>\n<li>Criticality is potential clinical harm associated with a condition. (Some conditions may be relatively severe, but not critical, such as severe hot flashes.)</li>\n<li>Stage is the relative advancement in the course of an disease.</li>\n<li>Grade represents the clinical significance (e.g., 1 = mild not requiring intervention; 2 = moderate, typically requiring non-invasive intervention, 3 = severe but not life-threatening, indicating hospitalization and impacting activities of daily living, 4 is life-threatening requiring immediate intervention, 5 is death)</li>\n</ul>\n<p>My question is, is Grade synonymous with Severity or Criticality? For hot flashes, CTCAE lists Grade 1, 2, and 3, but not 4 or 5, since people don't die from hot flashes. Grade 3 cites \"severe [hot flash] symptoms\". Therefore, I conclude Grade aligns more with Criticality, not Severity. Is that correct?</p>",
        "id": 153894844,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1498077638
    },
    {
        "content": "<p>I don't think that's an exact synonym.<br>\nSeverity is \"how bad it is\", criticality is \"how bad it might become\". CTCAE grades mix that up. E.g., a non-invasive intervention may be indicated because the condition itself requires it, or to avoid some other condition that will typically come up at some point in the future</p>",
        "id": 153894903,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498110683
    },
    {
        "content": "<p>It's similar with TNM/UICC/AJCC. They, too, describe the current state (severity) as well as a prognosis for outcome (criticality)</p>",
        "id": 153894904,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498111290
    },
    {
        "content": "<p>Still, that's called a stage ;)</p>",
        "id": 153894905,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498111464
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> if you are right that Grade is neither severity nor criticality, then that implies the need for making an extension on Condition, if you regard Grade as a property of the cancer condition.  OR - we might say that Grade is an independent observation (although it is an assessment really, not an observation). <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> how would you suggest modeling Grade?</p>",
        "id": 153895402,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1498651324
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span>  There also is Condition.stage, defined as \"Stage/grade, usually assessed formally\".<br>\nI think that would cover CTCAE grades.</p>",
        "id": 153895409,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498653441
    },
    {
        "content": "<p>I think I have unintentionally created confusion. There are two different grades in play here: One is the histological grade “… the description of a tumor based on how abnormal the tumor cells and the tumor tissue look under a microscope\", and the second is the AdverseEvent grade, CTCAE, which is more like a severity.</p>",
        "id": 153895417,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1498654690
    },
    {
        "content": "<p>These are definitely different ;-)<br>\nThe pathological \"G\" may well be represented as an Observation with code=\"pathological grading\"  and valueCodeableConcept holding \"G1\".<br>\nThe definition of grade you gave above points straight to side effects/adverse events.</p>",
        "id": 153895422,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498656117
    },
    {
        "content": "<p>I once sat through a lengthy conversation within the Vocab group and the differences between Severity and Criticality, and if I remember correctly the 'best' explanation pivoted around 'how bad is it if it happens vs. how likely is it to happen'.  If a person on vacation to Guatemala was bitten by a Guatemalan Spider and found they  were severely allergic to it but they vowed to never enter Guatemala ever again, then the issue could be considered of low Criticality.  </p>",
        "id": 153895435,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1498659667
    }
]