[
    {
        "content": "<p>My client wants to capture the toxicity of a chemo regimen. One option, which seems correct from a FHIR point of view, is to use AdverseEvent, and specify the reaction and the grade of the reaction (either through an extension or using the existing \"seriousness\" attribute).  The second option is to define a toxicity observation, whose value is the grade (i.e., doc is observing Grade 3 Toxicity),  and the sign(s) of the toxicity (e,g, nausea, weight loss) are captured as related observations, or using an extension. The latter is much closer to how the oncologists are thinking of toxicity, but the former might be more correct. Which is preferrable?</p>",
        "id": 153895403,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1498652441
    },
    {
        "content": "<p>I think it's important to sort out the differences in the concepts \"adverse event\", \"toxicity\" and \"condition that was caused by some therapy\"</p>",
        "id": 153895414,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498654104
    },
    {
        "content": "<p>There's also a thread about \"side effects\": <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Side.20effects.20on.20FHIR\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Side.20effects.20on.20FHIR\">https://chat.fhir.org/#narrow/stream/implementers/topic/Side.20effects.20on.20FHIR</a></p>",
        "id": 153895415,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498654164
    },
    {
        "content": "<p>To make a start:<br>\n- a toxicity is a condition caused by medical or radiation therapy<br>\n- an adverse event is a (edit: or results in a) condition, that may or may not have been caused by any therapy, possibly including surgery<br>\n- a side effect is an adverse event that has been proven to be caused by any therapy<br>\n(open for discussion, of course ;-)</p>",
        "id": 153895416,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498654456
    },
    {
        "content": "<p>In the current FHIR build, the AdverseEvent resource also has a resultingCondition.<br>\nAdverseEvent itself in it's current state is very limited and appears to be designed mainly for clinical trials.</p>",
        "id": 153895423,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498656525
    },
    {
        "content": "<p>Regarding the original question, I'd probably go with an Observation.<br>\nWhy would you even need a separate Observation for the signs?<br>\nThe grade is a property of the sign. Like:<br>\n- nausea, grade 3<br>\n- weight loss, grade 1</p>",
        "id": 153895428,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498657116
    },
    {
        "content": "<p>You would only need the seperate Observation, if you wanted to express:<br>\ntoxicity, grade 3, has signs: nausea and weight loss.<br>\nBut that's not how CTCAE expresses it.</p>",
        "id": 153895429,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498657190
    },
    {
        "content": "<p>I would add one caution about using AdverseEvent as your vehicle for modeling known or potential toxicity characteristics because AdverseEvent will likely become entangled with the mandatory reporting of medical errors.  IE, Oops I just gave the wrong patient some other patient's meds.  (etc)</p>",
        "id": 153895431,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1498658729
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191718\">@Richard Esmond</span> that's similar to what I meant regarding clinical trials.<br>\nLike:<br>\n- the patient had a car accident (AdverseEvent)<br>\n- because he got unconscious (Condition - or Observation?)<br>\n- which happened due to his medication (MedicationAdministration)</p>",
        "id": 153895432,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498659323
    }
]