[
    {
        "content": "<p>Some discussion exists <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Representing.20a.20Tumor\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Representing.20a.20Tumor\">here</a>.</p>\n<p>I have a modelling question for the group. Which way should the reference work here. Cancer to tumor (as is possible with body-structure extension), or tumor to cancer (no official extension for it).</p>\n<p>My initial thoughts were that condition -&gt; body structure makes more sense, body site being a field in Condition, and neatly packaging all the cancer details in the Condition resource.  My trouble is that bodySite is 0..* whereas extension:body-structure is 0..1. Maybe I am mistaken, but can you extend a resource multiple times with the same extension? And if so, what do you slice it with? In this case, how could one associate two tumors to a Cancer condition (ie multiple pulm nodules in NSCLC).</p>\n<p>Or should the tumor be referencing the Condition? Tumor is partOf cancer, kind of the relational database FK approach to a 1:M relationship. Any thoughts on this? Thanks.</p>",
        "id": 153895761,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1498774760
    },
    {
        "content": "<p>Edit: You can allow for multicardinality of body-structure. I was mistaken. Still, I'd love to hear opinions on the question of the direction of the tumor-cancer reference.</p>",
        "id": 153895971,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1499104355
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span> I think that it would be good to ask some clinicians how they reference tumors when they report, and then try to build it that way, but it sounds like the easiest way to express this relationship is Cancer to Tumor given the way the body-structure extension works currently </p>\n<p>I think it could also be a problem for use cases where the patient is being screened for cancer and the patient is determined not to have cancer, but has follow-ups scheduled to monitor whether a cancer develops or not</p>",
        "id": 153896020,
        "sender_full_name": "Alex Goel",
        "timestamp": 1499181450
    },
    {
        "content": "<p>I am going to attempt to 'channel' conversations that I am only loosely familiar with, but my understanding is that an abnormality that might eventually be determined to be a malignant tumor through biopsy and pathology will have likely be described as a mass, lesion, nodule (etc) throughout its pre-diagnoses life cycle.   Initially it might have even been described as a lump during a physical exam.</p>\n<p>The reason that I bring this up is that I'm hoping to build a model where post-diagnosis and pre-diagnosis records will have a computable relationship to each other.  </p>\n<p>If each of these characterizations are viewed as a attributes of an 'identifiable abnormality', which has several known possible trajectories, then it becomes easier for software and analytic processes to track the 'thing', which might ultimately be confirmed to be a malignant tumor.</p>\n<p>Consider the potential 'reporting' life-cycle of something that is eventually determined to be a 'malignant tumor':</p>\n<ul>\n<li>Lump - discovered during a physical exam</li>\n<li>Lesion - during a routine Mammo</li>\n<li>Mass - during a fallow-up MRI / Ultrasound</li>\n<li>Target-site - for the ultrasound guided needle-biopsy</li>\n<li>Specimen- for the pathology analysis</li>\n<li>Malignant tumor - when it's referred to an oncologist</li>\n</ul>\n<p>My hope is that each of these documentation events are based on the inherent understanding that there is a specific physical 'thing' that is being documented from different perspectives, and at different points-in-time, as having characteristics, which may change.</p>\n<p>From a human perspective it would seem relatively easy for software to understand that the 5mm Mass reported today is actually  the 3mm lesion reported a year ago - only bigger, but in reality that is only practical if the underlying architecture of the documentation strategy targets this capability.</p>",
        "id": 153896336,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1499432137
    },
    {
        "content": "<p>The wording may vary, like. \"Lesion\" is not bound to mammography.<br>\nThat's especially true when looking into the world of clinicians, which include not only oncologicst but also surgeons, radiotherapists, gynecologists, urologists etc pp.<br>\nBut as you say, at every stage of diagnostics there is a \"thing\" at a certain location and with certain properties.<br>\nThe properties vary, e.g. you have two dimensions with a simple mammography, three dimensions with more complex imaging methods and morphology (i.e. cell types) only where a pathologist is involved.<br>\nOn the other hand, the size of biopsy material (the pathologist's specimen) is of low interest, since this is pure diagnostics.</p>",
        "id": 153896364,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1499445596
    },
    {
        "content": "<p>Next thing is something more abstract: at some point in time somebody (typically the clinician responsible for the patient) concludes: \"We found 'things' in the patient's breast, in the axillary lymph nodes and in the liver, the biopsy of the breast showed malign cells of some type, so: yes, this is a breast cancer, already spreaded through the lymph nodes and with a liver metastasis.\"</p>",
        "id": 153896365,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1499445902
    },
    {
        "content": "<p>In FHIR terms (and from my point of view) this makes the difference between procedures and related observations (mammography, biopsy, pathological information) on the one side and a condition (\"Patient has breast cancer C50.3L, 8000/3, pT2 pN1(sn) cM1\") on the other side.</p>",
        "id": 153896366,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1499446156
    },
    {
        "content": "<p>Note: the combination of several tumors at different locations in the body results in a single (main) cancer diagnosis.</p>",
        "id": 153896367,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1499446387
    },
    {
        "content": "<p>Note also: there are systemic / non-solid \"locationless\" tumors (like leukemia) - but there is a location code for that in ICD-O.<br>\nAnd there may be tumors you know to exist, but you can't find them, like a prostate cancer with PSA-only recurrence.</p>",
        "id": 153896368,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1499446508
    }
]