[
    {
        "content": "<p>I wanted to start a message-thread for people to be able to suggest, comment on and indicate thoughts on priorities for future calls.</p>\n<p>My hope is that the group can work towards having as many 'prepared and guided' discussions because I have experienced that this substantially accelerates progress towards publishable materials.  Sense I don't have a clinical background, I'm just a modeling nerd, I don't really have the right expertise to prepare much of that source-material.  But I very much want to provide a time and place for those conversations to happen!</p>\n<p>But for those who weren't on the Cancer-DTR call today, it was agreed that 'Cancer Staging' will be the focus topic for our July 12th call, and May Terry was gracious enough to volunteer to prepare some materials and invite some of her clinical team to participate.  Many thanks to May for offering that and saving me having to beg.  (LOL)</p>",
        "id": 153895469,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1498665836
    },
    {
        "content": "<p>Here's a few I've been contending with that I think have broader applications:</p>\n<p>Tumor Structure. Good discussion on this in implementers in 'representing a tumor'. I'd love to see how other people are approaching capturing a tumor vs a cancer and what sort of observations reference the tumor structure (like ER Status - is it of the tumor or of the cancer). What goes in the Condition, the Tumor and what should be in Observations referencing either. </p>\n<p>Radiotherapy. FHIR is ill equipped for the specifics of this treatment. There has been discussion elsewhere on the topic, but my inclination is this is a ProcedureRequest, and PR should be extended to cover Grays and Fractions, timing, and probably even modality.</p>",
        "id": 153895476,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1498670444
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span> Radiotherapy is a very good point. I agree that it is currently hard to identifiy fitting structures within FHIR.<br>\nAnd having not only percutaneous radiotherapy, but also brachytherapy adds complexity.</p>",
        "id": 153895489,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498674977
    },
    {
        "content": "<p>Adding to Tumor Structure: how to represent a recurrence. If I understand your use of \"cancer\" vs. \"tumor\" correct, the cancer is the complete disease, while any place where the cancer cells manifestate are tumors?</p>",
        "id": 153895491,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498675666
    },
    {
        "content": "<p>(Just asking to make that clear, since that \"cancer\" would be called \"Tumor\" in German ...)</p>",
        "id": 153895492,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498675787
    },
    {
        "content": "<p>This is a topic that my organization (PenRad) can contribute quite a bit.  Easily more than 100 Breast Radiologists have provided feedback on the modeling we have done on Breast-Abnormality characteristics.  We have also done modeling against Lung and Colon, but less extensively.  And we have done some work abstracting the commonalities between the three.</p>\n<p>Including the different capabilities of the different Imaging Modality and Techniques.  There are many characteristics that are only discernible on specific modalities and using techniques like contrast.</p>\n<p>So, if the group would like to pursue this as a focus topic my organization can put the content together and call in a Radiologist to present it.  And if there were others that would like to contribute to that presentation with us - that would be even better.</p>",
        "id": 153895493,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1498676615
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> Such questions are why I think it would be good to dedicate a discussion to. And yes, I use cancer vs tumor to describe the Condition vs the Mass. Often secondary pathologies are given for secondary nodules or tumors. </p>",
        "id": 153895496,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1498676832
    },
    {
        "content": "<p>A glossary might be helpful :)</p>",
        "id": 153895497,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498677726
    },
    {
        "content": "<p>And here I thought German had a word for everything imaginable. Hopefully soon humans can just talk exclusively in CodeableConcepts, avoid all this ambiguity.</p>",
        "id": 153895570,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1498690592
    },
    {
        "content": "<p>Well, we have \"Krebs\" for \"cancer\", but it is rarely used in professional jargon or documentation.<br>\nAnd yes, semantic interoperability between humans is an issue ;))</p>",
        "id": 153895597,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498716632
    },
    {
        "content": "<p>As a follow up to Richard's question ( <a href=\"https://chat.fhir.org/#narrow/stream/Cancer.20-DTR.20group/topic/Modeling.20a.20tumor.2C.20BodyStructure\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/Cancer.20-DTR.20group/topic/Modeling.20a.20tumor.2C.20BodyStructure\">https://chat.fhir.org/#narrow/stream/Cancer.20-DTR.20group/topic/Modeling.20a.20tumor.2C.20BodyStructure</a> ) I would be glad to do a short presentation (during a Cancer-DTR telco somewhen after July 11)  on how we modeled cancer for the German cancer registry implementation guide some years ago.<br>\nWhile it is not too deep into details, it might be a good starter for further discussion.</p>",
        "id": 153896374,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1499447341
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> </p>\n<p>Next weeks Cancer-DTR weekly meeting will likely be canceled because so many of our members will be in DC for the Cancer-Interoperability and HSPC meetings.  But if you would like to prepare  a presentation for Aug 9th, then I would love hear about how you did your modeling.  I would also personally like to see whatever documents you might be able to share so I can compare the work we are doing with yours and see where they can be made to align.</p>\n<p>:)</p>",
        "id": 153898155,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1501014163
    },
    {
        "content": "<p>Sure :)<br>\nWhat I currently have is mostly in German, but I'll translate at least the basic class diagram for August 9th and present some stuff about the details.</p>",
        "id": 153898157,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1501014630
    }
]