[
    {
        "content": "<p>Is there an official  project for CCD (CDA or HL7 v3, RIM, etc.) mapping to FHIR, similar to the v2-to-FHIR in the <a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a> confluence (<a href=\"https://confluence.hl7.org/display/OO/2-To-FHIR+Project\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/2-To-FHIR+Project\">https://confluence.hl7.org/display/OO/2-To-FHIR+Project</a>)?   Or anything else comparable?  I am going to be responsible for creating the Source-to-Target mappings for an ingestion project and would love to start somewhere.</p>",
        "id": 170744007,
        "sender_full_name": "Matt Zajack",
        "timestamp": 1562955791
    },
    {
        "content": "<p>V3 RIM mappings exist, but their purpose is definitional.  Both CDA and the RIM allow the same information to be expressed in too many  (unpredictable) ways to perform generic transformations.  Any such mappings need to be done to specific v3 specifications (e.g. CCDA).  Even CCD is too generic/flexible to produce reliable mappings.</p>",
        "id": 170807511,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563056481
    },
    {
        "content": "<p>Thanks for the info <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.  I was afraid of that... It is going to be <em>a lot</em> of work to do the mapping then, right?  I'm not missing something, am I?  The RIM on <a href=\"http://hl7.org/fhir\" target=\"_blank\" title=\"http://hl7.org/fhir\">hl7.org/fhir</a> mapping, at least, will be a nice place to start.  <br>\nI need a better definitions of the type of \"CCD\" data we are receiving.  Even the differences between the specs and definitions CDA, CCDA, CCD, etc.are a bit fuzzy, but it sounds like that is a \"deep\" topic, for lack of a better word.</p>",
        "id": 170995634,
        "sender_full_name": "Matt Zajack",
        "timestamp": 1563289887
    },
    {
        "content": "<p>The hierarchy is RIM -&gt; CDA -&gt; CCD -&gt; CCDA with the RIM being most abstract.  C-CDA is mostly tight enough to perform transformable mappings.  For higher level specifications, you'll need a tighter implementation guide if you want to perform transformation.  Every implementation guide will need its own set of mappings/transforms.</p>",
        "id": 170999655,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563292312
    },
    {
        "content": "<p>That is a helpful representation of the hierarchy.  I am getting a better understanding of IGs and how they fit into the world of mapping, and I can appreciate the need for tight ones.</p>\n<p>Back to the OP- how does the CDA on FHIR project fit into mapping?  <a href=\"http://hl7.org/fhir/us/ccda/\" target=\"_blank\" title=\"http://hl7.org/fhir/us/ccda/\">http://hl7.org/fhir/us/ccda/</a>  It appears to have not been updated in some time, but I just received an email from HL7 that they offer training on the materials Aug 6-8, 2019 - <a href=\"http://www.hl7.org/events/webinar/cda/package/2019/08/\" target=\"_blank\" title=\"http://www.hl7.org/events/webinar/cda/package/2019/08/\">http://www.hl7.org/events/webinar/cda/package/2019/08/</a>.   It looks like they have some work with mapping Problem and Allergies, but it is not as clear as I would like:  <a href=\"http://wiki.hl7.org/index.php?title=C-CDA_on_FHIR#C-CDA.2FFHIR_Mapping\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=C-CDA_on_FHIR#C-CDA.2FFHIR_Mapping\">http://wiki.hl7.org/index.php?title=C-CDA_on_FHIR#C-CDA.2FFHIR_Mapping</a></p>",
        "id": 171704138,
        "sender_full_name": "Matt Zajack",
        "timestamp": 1564070854
    }
]