[
    {
        "content": "<p>I just discovered this stream so bear with me please.  I have a hospital surveillance project and therefore CCDAs streaming in that I need to convert to FHIR resources.  I am trying to determine if the DSL (domain specific language) that I read about on the FHIR website will serve.  I have been able to generate some code using the provided grammar and ANTLR.  So far so good.  I gather I must write my. own conversion engine and a mapping script(s).  I would like a one-size-fits-all mapping to fit into my workflow.   I am planning to use the MDHT cad library to read the CCDAs (It has served well in the past.) and a similarly generated library for FHIR (FHIR resources generated with EMF).  Obviously, the mapping script goes in between.  <br>\nQ: Am I barking up the right tree?  Q: Is this mapping project ready for prime time?  Q: Am I making myself clear?<br>\nThanks for reading</p>",
        "id": 207251072,
        "sender_full_name": "Geoffry Roberts",
        "timestamp": 1597752528
    },
    {
        "content": "<p>there is a mapping engine in the HAPI code. And you could use the HAPI-fhir-core  library for the FHIR side irrespective of whether you use the mapping engine .</p>",
        "id": 207348723,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597788969
    },
    {
        "content": "<p>it's harder to say whether the mapping project is ready for prime time. It's kind of 'as opposed to what?'.</p>",
        "id": 207348758,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597789008
    },
    {
        "content": "<p>@Graham Grieve. Thanks for responding and it's good to be talking to you again after so very long.  I shall look into the HAPI engine.  Thanks for the direction.  I asked about prime time because I saw that the version is shown as draft and that some of the documentation seemed to hang in places hence the question.  Nonetheless,  HAPI it is.  Gotta get something going.  We'll see.</p>",
        "id": 207403245,
        "sender_full_name": "Geoffry Roberts",
        "timestamp": 1597841697
    },
    {
        "content": "<p>it has been a long time, yes</p>",
        "id": 207403304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597841728
    }
]