[
    {
        "content": "<p>I am stuggling with what scope of C-CDA author elements should be included as FHIR Provenance for a FHIR resource (Condition, AllergyIntolerance, MedicationRequest, Immunization…) derived from a C-CDA.  For example, for an AllergyIntolerance resource derived from a C-CDA Allergy – Intolerance Observation (/observation[templateId/@root = '2.16.840.1.113883.10.20.22.4.7']) that has its own author element, should the Provenance for that AllergyIntolerance be limited to strictly data from that immediate author element, or should additional Provenance instances derived from the Allergy – Intolerance Observation ancestor authors (e.g., the C-CDA Header author element) be associated with the derived AllergyIntolerance resource?  </p>\n<p>Based on the 'The CDA Header sets context for the entire document. A propagating value specified in the document header holds true throughout the document, <strong>unless explicitly overridden</strong>' description of CDA Context found <a href=\"https://pubwiki.hl7.org/CDA_Design#Overview_of_CDA_Context\" target=\"_blank\" title=\"https://pubwiki.hl7.org/CDA_Design#Overview_of_CDA_Context\">here</a>, I believe that an Allergy – Intolerance Observation level author (/observation[templateId/@root = '2.16.840.1.113883.10.20.22.4.7']/author) overrides authors defined at higher levels of that observation’s hierarchy.  So setting the Provenance.agent.type.coding.code = ‘author’ (‘A party that originates the resource and therefore has responsibility for the information given in the resource’ - <a href=\"http://build.fhir.org/codesystem-provenance-agent-type.html#provenance-agent-type-author\" target=\"_blank\" title=\"http://build.fhir.org/codesystem-provenance-agent-type.html#provenance-agent-type-author\">Provenance Agent Types</a>) on the Provenance.agent derived from that observation level author feels appropriate.  What is less clear to me, is whether or not it is appropriate to include data from any higher level authors as additional Provenance instances associated with the derived AllergyIntolerance resource, each with their own Provenance.agent and a Provenance.agent.type <strong>other than</strong> 'author'?   </p>\n<p>The arguments I have encountered for including higher level C-CDA authors (when a lower level author element exist) as additional Provenance instances are rooted in concerns that end users will expect some form of <strong>organization</strong> context Provenance to be associated with any clinical concept resource derived from a C-CDA document.  The assertion is that when lower level C-CDA author elements do not include a representedOrganization (see the example below), the end users need visibility to any organization context (representedOrganization) defined/available in the ancestor author elements (e.g., parent C-CDA Section and Header author elements).  Since a <a href=\"https://pubwiki.hl7.org/CDA_Design#Overview_of_CDA_Context\" target=\"_blank\" title=\"https://pubwiki.hl7.org/CDA_Design#Overview_of_CDA_Context\">lower level C-CDA author element overrides higher level author elements</a>, it seems clear that under these circumstances, any higher level author/assignedAuthor/representedOrganization is not know to be the “author’s organization” as defined by pg. 6 Office of the National Coordinator (ONC) proposed rule to support the 21st century cures act4 described in the <a href=\"http://www.hl7.org/documentcenter/public/ballots/2019SEP/downloads/HL7_PROVENANCE_CCDA_FHIR_R1_I1_2019SEP.pdf\" target=\"_blank\" title=\"http://www.hl7.org/documentcenter/public/ballots/2019SEP/downloads/HL7_PROVENANCE_CCDA_FHIR_R1_I1_2019SEP.pdf\">HL7 Guidance: Basic Provenance for C-CDA and FHIR</a>.  So when a lower level author element exist, if any Provenance.agents are derived from higher level author elements, they should not have a Provenance.agent.type.coding.code = ‘<strong>author</strong>’.   That said, should the data from any higher level authors be used to associate additional Provenance instances of some non-author Provenance.agent.type (e.g. <strong>document author</strong>) with a derived clinical concept resource?  Is that an appropriate interpretation of C-CDA data and use of the FHIR Provenance resource?</p>\n<p>Using the HL7 Allergies Section found <a href=\"http://hl7-c-cda-examples.herokuapp.com/examples/view/Allergies/Allergy%20to%20specific%20drug%20Codeine\" target=\"_blank\" title=\"http://hl7-c-cda-examples.herokuapp.com/examples/view/Allergies/Allergy%20to%20specific%20drug%20Codeine\">here</a> to further flesh out the AllergyIntolerance Provenance example…  It seems clear that at a minimum, a single Provenance instance representing the Allergy – Intolerance Observation level author Henry Seven (/observation[templateId/@root = '2.16.840.1.113883.10.20.22.4.7']/author) should be associated with an AllergyIntolerance resource derived from this C-CDA observation.   </p>\n<p><strong>C-CDA Allergy – Intolerance Observation</strong>:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;entryRelationship typeCode=&quot;SUBJ&quot;&gt;\n    &lt;observation classCode=&quot;OBS&quot; moodCode=&quot;EVN&quot;&gt;\n        &lt;!-- allergy observation template --&gt;\n        &lt;templateId root=&quot;2.16.840.1.113883.10.20.22.4.7&quot; extension=&quot;2014-06-09&quot;/&gt;\n        &lt;id root=&quot;4a2ac5fc-0c85-4223-baee-c2e254803974&quot;/&gt;\n        &lt;code code=&quot;ASSERTION&quot; codeSystem=&quot;2.16.840.1.113883.5.4&quot;/&gt;\n        &lt;text&gt;\n            &lt;reference value=&quot;#AllergyIntoleranceObservation_1.1&quot;/&gt;\n        &lt;/text&gt;\n        &lt;statusCode code=&quot;completed&quot;/&gt;\n        &lt;effectiveTime&gt;\n            &lt;low value=&quot;20100315&quot;/&gt;\n        &lt;/effectiveTime&gt;\n        &lt;value xsi:type=&quot;CD&quot; code=&quot;59037007&quot; displayName=&quot;Drug intolerance (disorder)&quot; codeSystem=&quot;2.16.840.1.113883.6.96&quot; codeSystemName=&quot;SNOMED CT&quot;/&gt;\n        &lt;author&gt;\n            &lt;templateId root=&quot;2.16.840.1.113883.10.20.22.4.119&quot;/&gt;\n            &lt;time value=&quot;20140103102500-0500&quot;/&gt;\n            &lt;assignedAuthor&gt;\n                &lt;id extension=&quot;99999999&quot; root=&quot;2.16.840.1.113883.4.6&quot;/&gt;\n                &lt;code code=&quot;207Q00000X&quot; codeSystem=&quot;2.16.840.1.113883.6.101&quot; codeSystemName=&quot;Health Care Provider Taxonomy&quot; displayName=&quot;Family Medicine&quot;/&gt;\n                &lt;telecom use=&quot;WP&quot; value=&quot;tel:555-555-1002&quot;/&gt;\n                &lt;assignedPerson&gt;\n                    &lt;name&gt;\n                        &lt;given&gt;Henry&lt;/given&gt;\n                        &lt;family&gt;Seven&lt;/family&gt;\n                    &lt;/name&gt;\n                &lt;/assignedPerson&gt;\n            &lt;/assignedAuthor&gt;\n        &lt;/author&gt;\n    &lt;/observation&gt;\n&lt;/entryRelationship&gt;\n</pre></div>\n\n\n<p><strong>Provenance resource derived from this Allergy – Intolerance Observation's author element</strong>:</p>\n<div class=\"codehilite\"><pre><span></span>Provenance.recorded = 2014-01-03…\nProvenance.agent.coding.code = author\nProvenance.agent.who = Henery Seven…\n</pre></div>\n\n\n<p>As indicated above, it is not clear whether or not it is appropriate or recommended to also associate additional, discrete Provenance instances that represent the higher level C-CDA author elements (e.g., the header author, not shown in the <a href=\"http://hl7-c-cda-examples.herokuapp.com/examples/view/Allergies/Allergy%20to%20specific%20drug%20Codeine\" target=\"_blank\" title=\"http://hl7-c-cda-examples.herokuapp.com/examples/view/Allergies/Allergy%20to%20specific%20drug%20Codeine\">HL7 example</a> ) with an AllergyIntolerance resource derived from this C-CDA observation?  For sake of argument, assume the <strong>header</strong> of the document that contained this Allergy – Intolerance Observation included the following author element:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;author&gt;\n    &lt;time value=&quot;20140210111500-0500&quot;/&gt;\n    &lt;assignedAuthor&gt;\n        &lt;id root=&quot;1.2.777.999900.1.1&quot; extension=&quot;1.9.9&quot;/&gt;\n        &lt;addr nullFlavor=&quot;NA&quot;/&gt;\n        &lt;telecom nullFlavor=&quot;NA&quot;/&gt;\n        &lt;assignedAuthoringDevice&gt;\n            &lt;manufacturerModelName&gt;Manufacture XYZ&lt;/manufacturerModelName&gt;\n            &lt;softwareName&gt;ABC - Version 3.5&lt;/softwareName&gt;\n        &lt;/assignedAuthoringDevice&gt;\n        &lt;representedOrganization&gt;\n            &lt;id root=&quot;1.2.999.999999.1.99.660.2.9.5.699911&quot; extension=&quot;99900&quot;/&gt;\n            &lt;name&gt;Health System XYZ&lt;/name&gt;\n            &lt;telecom nullFlavor=&quot;NA&quot;/&gt;\n            &lt;addr use=&quot;WP&quot;&gt;\n                &lt;streetAddressLine&gt;9999 Main St.&lt;/streetAddressLine&gt;\n                &lt;county&gt;WILSON&lt;/county&gt;\n                &lt;city&gt;Gotham&lt;/city&gt;\n                &lt;state&gt;AR&lt;/state&gt;\n                &lt;postalCode&gt;99999&lt;/postalCode&gt;\n                &lt;country&gt;USA&lt;/country&gt;\n            &lt;/addr&gt;\n        &lt;/representedOrganization&gt;\n    &lt;/assignedAuthor&gt;\n&lt;/author&gt;\n</pre></div>\n\n\n<p>Should an additional Provenance resource with the following attributes be associated with the AllergyIntolerance resource derived from this C-CDA?</p>\n<div class=\"codehilite\"><pre><span></span>Provenance.recorded = 2014-02-10…\nProvenance.agent.coding.code = document author\nProvenance.agent.who[Device].manufacturer = Manufacture XYZ\nProvenance.agent.who[Device].deviceName.name = ABC - Version 3.5\nProvenance.agent.who[Device].owner.name = Health System XYZ\n</pre></div>",
        "id": 186195033,
        "sender_full_name": "David Riddle",
        "timestamp": 1579621356
    },
    {
        "content": "<p>I think there is a hierarchy that C-CDA conveys that should/may be recreated in FHIR. The way I look at it. The “provenance” of the document represents the the responsible party for the document. The section level represent the party responsible for the section. Finally the entry author articulates the party who is responsible for that piece of data.</p>\n<p>I think the question to ask… How do you recreate the “section” in FHIR?</p>\n<p>In the absence of that…. You have 1 provenance “author\" for that allergy…. That allergy has another provenance with an entity that is the document. That DocumentReference resource then will have its own provenance record that can be used.</p>",
        "id": 186228722,
        "sender_full_name": "Drew Torres",
        "timestamp": 1579641516
    },
    {
        "content": "<p>Sections would be defined in the Composition</p>",
        "id": 186238719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579648626
    },
    {
        "content": "<p>I think that is only possible when the Allergy lives inside of the section of the composition. If you wanted to represent the allergy as a stand alone resource, what can be done to represent the section for that allergy?</p>",
        "id": 186244442,
        "sender_full_name": "Drew Torres",
        "timestamp": 1579653859
    },
    {
        "content": "<p>how can it be in a section if it's standalone?</p>",
        "id": 186244663,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1579654049
    },
    {
        "content": "<p>The use-case: An allergy parsed from a C-CDA document.</p>",
        "id": 186245081,
        "sender_full_name": "Drew Torres",
        "timestamp": 1579654450
    },
    {
        "content": "<p>It is then stored in the \"Allergies table\" of some system.</p>",
        "id": 186245091,
        "sender_full_name": "Drew Torres",
        "timestamp": 1579654462
    },
    {
        "content": "<p>How do you convey the same levels of provenance that the C-CDA did?</p>",
        "id": 186245111,
        "sender_full_name": "Drew Torres",
        "timestamp": 1579654487
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span> is correct.  The use-case is not to recreate the entire document using FHIR resources, but rather to 'extract' clinical concepts from the document and represent them as FHIR resource instances.</p>\n<blockquote>\n<p>How do you recreate the \"section\" in FHIR?</p>\n</blockquote>\n<p>FWIW - On that section question, those arguing for associating the additional higher level C-CDA authors <strong>directly</strong> with the extracted AllergyIntolerace have proposed the following:<br>\n-Create a discrete Provenance instance to represent each author element.  <br>\n-The Provenance instance that represents the <strong>section</strong> level author element would have a Provenance.agent.type.coding.code value that conveys the '<strong>section author</strong>' concept (the <a href=\"http://build.fhir.org/valueset-provenance-agent-type.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-provenance-agent-type.html\">provenance-agent-type</a> value set does not currently include a code that is a semantic match for this 'section author' concept, but the value set binding is extensible).<br>\n-Associate each of these Provenance instances directly with the AllergyIntolerace so that downstream consumers do not have to pursue an indirect connection like the DocumentRefernence's Provenance to obtain the higher level author information.   </p>\n<p>Based on the description  of CDA Context found <a href=\"https://pubwiki.hl7.org/CDA_Design#Overview_of_CDA_Context\" target=\"_blank\" title=\"https://pubwiki.hl7.org/CDA_Design#Overview_of_CDA_Context\">here</a>, my counter argument has been that when author elements are included at multiple levels of the hierarchy, only the author element(s) found at the lowest level of the hierarchy should be expressed as Provenance resources with a <strong>direct</strong> connection to the extracted resource (a direct connection to the AllergyIntolerace in our example).  Furthermore, only those lowest level author(s) represent an author of the resource as defined <a href=\"http://build.fhir.org/valueset-provenance-agent-type.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-provenance-agent-type.html\">here</a>:   <strong>author </strong>- 'party that originates the resource and therefore has responsibility for the information given in the resource' </p>\n<p>NOTE:  It is understood that the FHIR Provenance resource supports 1..* Provenance.agent entries; however, since each C-CDA author element has its own time/@value, discrete Provenance instances for each discrete author element seems necessary to support independent Provenance.recorded values.</p>",
        "id": 186274852,
        "sender_full_name": "David Riddle",
        "timestamp": 1579690344
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> This is a great set of questions -- I agree with your last statement '...only the lowest level of the hierarchy should be expressed as Provenance resources..'.. A use case may come forward requiring systems that parse FHIR resources to state  that this particular clinical concept was included in a specific document, but on initial glance it's not clear to me how that would help the end user (in auditing, this absolutely must be tracked). Rather, i think it's time we start making it clear the provider organization is required -- this requirement is in the latest <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-provenance.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-provenance.html\">US Core Provenance</a> and he new C-CDA Author Provenance Template.</p>",
        "id": 186284637,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579698601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  Thank you for your feedback on this.</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , <span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>,<br>\nGiven my 'extract' clinical concepts from the document and represent them as FHIR resource instances use case, do you agree with this statement?</p>\n<blockquote>\n<p>only the author element(s) found at the lowest level of the hierarchy should be expressed as Provenance resources with a <strong>direct </strong> connection/association to the extracted resource</p>\n</blockquote>",
        "id": 186287022,
        "sender_full_name": "David Riddle",
        "timestamp": 1579700539
    },
    {
        "content": "<p>Typically you'd have Provenances on the document and then a single Provenance that represented the extraction process from document to allergy.  Someone would trace that back to find the document and the full set of Provenances that show the document creation, editing, approval, etc.</p>",
        "id": 186288674,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579701733
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<blockquote>\n<p>Typically you'd have Provenances on the document and then a single Provenance that represented the extraction process from document to allergy</p>\n</blockquote>\n<p>For further clarification, do you agree that the 'single Provenance that represented the extraction process from document to allergy' would not contain data from higher level C-CDA author elements as additional Provenance.agent entries?   i.e., That only the data from the author element found at the lowest level of the hierarchy (the author element found closest to the Allergy - Intolerance Observation) would be included as a Provenance.agent entry on the ''single Provenance that represented the extraction process'.</p>",
        "id": 186290188,
        "sender_full_name": "David Riddle",
        "timestamp": 1579702863
    },
    {
        "content": "<p>I wouldn't really expect <em>any</em> of the Provenance data from the original document provenances to be in the 'extraction' provenance.  The extraction provenance would talk about the who/what/when/where/why of the extraction process.  It wouldn't talk about the origination of the document at all - to see that, you'd need to go look at the provenances tied to the document.  If you wanted to convey the AllergyIntolerance with its full story, you'd need the AllergyIntolerance, the Provenance showing its extraction from the document, the document, all of its provenances (some of which might show that the allergy section was itself extracted from elsewhere, etc.</p>",
        "id": 186292312,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579704296
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span>, <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ,</p>\n<p>It sounds like <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> would not create a <strong>direct </strong>association between a Provenance instance that represents data from the C-CDA author elements and the extracted clinical entity (AllergyIntolerance in our example).  He indicated...</p>\n<blockquote>\n<p>It wouldn't talk about the origination of the document at all - to see that, you'd need to go <strong>look at the provenances tied to the document</strong></p>\n</blockquote>\n<p>Do you agree?</p>",
        "id": 186295256,
        "sender_full_name": "David Riddle",
        "timestamp": 1579706072
    },
    {
        "content": "<p>That's my understanding.  <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, you're the Provenance expert - do you have comments? :)</p>",
        "id": 186300908,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579709252
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> Will you carry forward the CDA Allergy author into AllergyIntolerance.asserter? I think it's important to carry forward the CDA entry author</p>",
        "id": 186306972,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579712415
    },
    {
        "content": "<p>I have had the first post in this thread in my backlog to read, still haven't read it... but based on the discussion I will offer the following. Provenance COULD be attached to every resource, covering the full history of that resource back to the origination This is possible... but I don't think that is useful. This is why I am working with Brett on the Basic Provenance to define what is a minimal-viable Provenance use that is more realistic.  <br>\nI will also point out that we have a concept in FHIR that much of the function of Provenance is often built into the Resource definition when that function of Provenance is fundamental to that Resource. So for example Composition has elements holding who, what, where, when, and why. Thus a standalone Provenance resource instance is not minimally necessary. (see this crosswalk of Provenance functionality to core elements of all the resources -- <a href=\"http://build.fhir.org/fivews\" target=\"_blank\" title=\"http://build.fhir.org/fivews\">http://build.fhir.org/fivews</a> )<br>\nThus minimally a Composition likely doesn't need a Provenance at all... But minimally is not always best either. SO I do expect that there will be Implementation Guides that will ask to layer in increasingly more use of Provenance. Stage 1 is likely one Provenance within the Composition Bundle indicating WHEN and by WHOM created that Bundle (which might be the author, or might be an automated process).  Stage 2 might be use-case specific where the use-case knows that various sections of the Composition are uniquely assignable Provenance...</p>",
        "id": 186308588,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579713423
    },
    {
        "content": "<p>to be clear, comprehensive Provenance is useful and important at the Medical Record retention; but when data are communicated between parties (e.g. serialized into Composition Bundle) the set of useful Provenance needs to be more realistic.</p>",
        "id": 186309762,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579714218
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> The basic question is whether Provenance is expected to be data about a single data-manipulation event or whether it can/should also be used to summarize a whole set of data manipulation events (creation, updates, conversions, redactions, etc.)  I certainly wasn't aware that it could be used to summarize multiple events - nor how that could be expressed and distinguished from the first use-case.</p>",
        "id": 186314415,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579717303
    },
    {
        "content": "<p>thanks for the clarity. Each of those lifecycle events would be represented as an independent Provenance, when comprehensive Provenance is recorded. It is possible to have many lifecycle events transition in exactly one FHIR version increment, and when that one update with multiple lifecycle transitions is the responsibility of one agent using one unified set of inputs, then one could record one Provenance for that multiple transition update. But where there are different responsibilities for different parts of the lifecycle transition exist, then multiple Provenance records would be recorded against the same update version.</p>",
        "id": 186315500,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579717828
    },
    {
        "content": "<p>This would be a situation where the updates happen widely dispersed in time with different participants (and potentially happening on different systems).  Is it possible to have a 'comprehensive' Provenance that would squish all of those events into a single record?</p>",
        "id": 186316058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579718140
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"195703\">David Riddle</span> Will you carry forward the CDA Allergy author into AllergyIntolerance.asserter? I think it's important to carry forward the CDA entry author</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> ,</p>\n<p>Actually I had planned to also map the CDA Allergy author to the FHIR AllergyIntolerance.<strong>recorder</strong> and the CDA Allergy informant (if included) to the FHIR AllergyIntolerance.<strong>asserter</strong>.  It sounds like you believe that the C-CDA author element(s) found closest to the CDA Allergy - Intolerace Observation align better with the AllergyIntolerance.<strong>asserter</strong> than the AllergyIntolerance.recorder.  Any particular reasoning for that?</p>\n<p>Also, due to the cardinality differences between C-CDA Allergy - Intolerace Observation/author 0..* vs. the FHIR AllergyIntolerance.asserter 0..1 and AllergyIntolerance.recorder 0..1, I am going to be forced to pick only data from one of the C-CDA author elements if more than one is associated with the C-CDA Allergy - Intolerance Observation.   </p>\n<p>All that said, I have a downstream use case that wants to obtain notions of authorship/'source' via. a clinical resource model agnostic mechanism.  So rather than have logic that knows for AllergyIntolerance instances it needs to look at AllergyIntolerance.<strong>recorder</strong> and for Immunization it needs to look at Immunization.<strong>informationSource</strong> to obtain notions of 'source', the proposal is that the logic could reason with Provenance instances that are <strong>directly</strong> associated with the clinical resource (AllergyIntolerance, Immunization...) and reason with those Provenance resource instances consistently.  </p>\n<p>Also, there is a MU regulatory certification test scenario that requires the 'last modified date' defined as either A) the author/time/@value of the document header level author element or B) the author/time/@value of the entity level author (e.g., Allergy - Intolerance Observation/author), to be displayed to the end-user.   The proposal was to use a Provenance.<strong>recorded</strong> value pulled from the C-CDA author/time/@value to meet that need.  FWIW - There has been a great deal of contention about that use/interpretation of the Provenance.recorded attribute.</p>",
        "id": 186316256,
        "sender_full_name": "David Riddle",
        "timestamp": 1579718226
    },
    {
        "content": "<p>Whoops -- FHIR AllergyIntolerance.<strong>recorder</strong> is what you want. I went back and re-read the definitions <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 186320200,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579720551
    },
    {
        "content": "<p>sounds like you have use-case driven requirements that make using \"some\" explicit Provenance records needed. That is the kind of thing that should drive an Implementation Guide to call for specific and explicit use of Provenance. Yes, the ability to have all of these provenance functions using the same Provenance resource does enable generic finding of the provenance; that is a use-case need. However i would caution that just because there are requirements to 'display' something, doesn't mean there is a compelling explicit need for a specific Provenance use. so,  I don;t have a decision for you, it must be made by the consensus of your audience.</p>",
        "id": 186378134,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579777729
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> indicated...</p>\n<blockquote>\n<p>However i would caution that just because there are requirements to 'display' something, doesn't mean there is a compelling explicit need for a specific Provenance use</p>\n</blockquote>\n<p>I agree, but using our extracted AllergyIntolerance resource example, I don’t believe there is an attribute on the <a href=\"http://build.fhir.org/allergyintolerance.html\" target=\"_blank\" title=\"http://build.fhir.org/allergyintolerance.html\">AllergyIntolerance</a> resource itself that is intended to convey the concept of ‘last modified date’ that we need to display.  Using a Provenance resource to track the information (e.g., when and who) about the authorship activity (conveyed in the C-CDA author element) which created or updated the C-CDA Allergy – Intolerance Observation that the extracted AllergyIntolerance instance is essentially a copy of, seems like it aligns with both A) the FHIR Provenance <a href=\"http://build.fhir.org/provenance.html#scope\" target=\"_blank\" title=\"http://build.fhir.org/provenance.html#scope\">Scope and Usage</a> and B) the ‘3 key Provenance data elements’ (author, author’s timestamp &amp; author’s organization) described on pg. 6 of the <a href=\"http://www.hl7.org/documentcenter/public/ballots/2019SEP/downloads/HL7_PROVENANCE_CCDA_FHIR_R1_I1_2019SEP.pdf\" target=\"_blank\" title=\"http://www.hl7.org/documentcenter/public/ballots/2019SEP/downloads/HL7_PROVENANCE_CCDA_FHIR_R1_I1_2019SEP.pdf\">HL7 Guidance:  Basic Provenance for C-CDA and FHIR</a>.  </p>\n<p>I feel like this ‘extract C-CDA clinical concepts and transform them into FHIR Resource instances’ use case loosely aligns with the 2.1.3 Use Case on pg. 8 of the <a href=\"http://www.hl7.org/documentcenter/public/ballots/2019SEP/downloads/HL7_PROVENANCE_CCDA_FHIR_R1_I1_2019SEP.pdf\" target=\"_blank\" title=\"http://www.hl7.org/documentcenter/public/ballots/2019SEP/downloads/HL7_PROVENANCE_CCDA_FHIR_R1_I1_2019SEP.pdf\">HL7 Guidance:  Basic Provenance for C-CDA and FHIR</a>.  Assuming that is correct, the HL7 guidance indicates that ‘Transformation of data from one format to another does not change the authorship of the information’.  Thus the desire to carry forward the CDA Allergy – Intolerance Observation authorship activity using a Provenance resource instance explicitly associated with the derived/extracted AllergyIntolerance resource.</p>\n<p>In my mind, the C-CDA Allergy – Intolerance Observation authorship activity that I am trying to propagate forward belongs in its own discrete Provenance resource instance that is separate from any Provenance resource instance intended to track information about the extraction of the AllergyIntolerance resource and from any Provenance resource intended to track information about the authorship of the document that the Allergy – Intolerance Observation/AllergyIntolerance was delivered in/via.  I think that aligns with <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> 's ‘Each of those lifecycle events would be represented as an independent Provenance, when comprehensive Provenance is recorded.’ statement above, but I am not sure.  I also am unclear on what constitutes an ‘update version’ or ‘version increment’?</p>\n<blockquote>\n<p>I don’t have a decision for you, it must be made by the consensus of your audience</p>\n</blockquote>\n<p>Understood.  I don’t know that I am looking for a decision, but rather some consensus from the FHIR community on whether or not this usage (conversion of C-CDA author element data into Provenance resource instances associated with clinical concept FHIR Resources derived from the C-CDA) aligns with the intended Scope and Usage of the FHIR Provenance resource and if so, whether or not the proposed conversion rules (e.g., the scope of C-CDA author elements to be converted into Provenance and which author elements should be converted to Provenance.agent.type.coding.code = ‘author’) make sense.</p>",
        "id": 186404695,
        "sender_full_name": "David Riddle",
        "timestamp": 1579796179
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ,</p>\n<p>I have what is hopefully a more focused question for you...</p>\n<p>Looking at the example Provenance resource for a Procedure extracted from a CDA <a href=\"http://build.fhir.org/provenance-example.json.html\" target=\"_blank\" title=\"http://build.fhir.org/provenance-example.json.html\">here</a>, would it be appropriate to include the CDA document header level author(s) as Provenance.entity.agent(s) with Provenance.entity.agent.type.coding.code = ‘author’?  i.e., Would it be appropriate to attribute the  extracted Procedure's Provenance DocumentReference entity to the CDA document header author(s)?</p>\n<p>The CDA header author(s) did not author/generate the DocumentReference resource, but they did author the document it describes.</p>\n<p>Pardon my shorthand below...</p>\n<div class=\"codehilite\"><pre><span></span>&quot;entity&quot;: [\n    {\n      &quot;role&quot;: &quot;source&quot;,\n      &quot;what&quot;: {\n        &quot;reference&quot;: &quot;DocumentReference/example&quot;,\n        &quot;display&quot;: &quot;CDA Document in XDS repository&quot;\n      }\n      &quot;agent&quot;: {\n        &quot;type&quot;: &quot;author&quot;\n       ....\n      }\n    }\n ]\n</pre></div>",
        "id": 186441709,
        "sender_full_name": "David Riddle",
        "timestamp": 1579817324
    },
    {
        "content": "<p>I think it is well-enough understood that a Provenance and a DocumentReference are metadata resource types holding metadata about the thing they point at. Thus I think it would be understood as you describe. I am however always surprised at how what is logical to me is not how others see it. But, if you documet in your IG that this is what you are doing, then it should be better understood.</p>",
        "id": 186491925,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579872955
    }
]