[
    {
        "content": "<p>Hello,<br>\nThis query is with respect to C-CDA on FHIR STU 1.1 , The link is: <br>\n<a href=\"http://hl7.org/fhir/us/ccda/StructureDefinition-Continuity-of-Care-Document.html\">http://hl7.org/fhir/us/ccda/StructureDefinition-Continuity-of-Care-Document.html</a><br>\nWithin which  the Medications section &gt;Medication entry has been mapped /referenced to MedicationStatement, Medication Profile &amp; USCORE Medication Request profile.  <br>\nI wanted to understand why MedicationAdministration resource has not been included. As per the definition in FHIR - \"A medication statement is not a part of the prescribe-&gt;dispense-&gt;administer sequence but is a report that such a sequence (or at least a part of it) did take place, resulting in a belief that the patient has received a particular medication\". The IG for C-CDA says \"A Medication Activity describes substance administrations that have actually occurred (e.g., pills ingested or injections given) or are intended to occur\" If the medication is actually administered then the moodCode is set to 'EVN'. So if the event has actually occurred then why wouldn't we map it to MedicationAdministration resource. Also, when we have inpatient admissions where complex administrations like IV insertions/blood transfusions etc are performed isn't the MedicationAdministration a better choice? Similarly, In the MedicationActivity template we also have the Dispense section which I was assuming should be mapped to MedicationDispense which has not been mentioned in the C-CDA on FHIR 1.1  I am not sure if this has already been discussed, but I couldn't find anything concrete in Zulip. Can somebody please shed light on this. Also, can you point me to the mapping documents/discussions if any on confluence highlighting this topic. <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thank you in advance.</p>",
        "id": 230117354,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1615592999
    },
    {
        "content": "<p>I suspect one of the reasons is that US Core doesn't expose individual administrations.  I suspect the belief was that the C-CDA spec was focused on higher level \"what meds are you on\" than tracking individual administration records too.</p>",
        "id": 230120217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615595222
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> Thank you !</p>",
        "id": 231847803,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1616695133
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 242226823,
        "sender_full_name": "Ilayaraja",
        "timestamp": 1623339646
    }
]