[
    {
        "content": "<p>Hi all, Similar to other language in market, Is there any tool which just compile the maps files(FHIR mapping language) for syntax and formatting error? Or it is only possible during the execution using either validator or web services</p>",
        "id": 218518558,
        "sender_full_name": "Kailash",
        "timestamp": 1606889140
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"263322\">@Kailash</span> It would be good to have such a tool. Or a test tool that can take a full CCD and spilt out FHIR would be helpful too.</p>",
        "id": 219026201,
        "sender_full_name": "AJ Chen",
        "timestamp": 1607292798
    },
    {
        "content": "<p>If anyone knows, Are vendors required to publish their templates, codes, and other information needed to understand their CCD documents? Based upon my experience this is done through trial and error. If the mappings to/deviations from standards were publically available, we could open-source converters, and we can plug in mappings as needed as a configuration.</p>\n<p>Conversely, if a QRDA1 contained a Schematron error, for example, I cannot see how we would be liable for converting this file into a FHIR format. There are many errors that are undetectable by validators too. </p>\n<p>Someone who is producing a QRDA1 will be able to convert from HDS (will have a much easier time producing FHIR resources). It seems strange that one data producer can require all consumers to purchase a converter to a standard format, that is required by a policy. Maintaining the accuracy of codes owned in another system is a chore too! </p>\n<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> have you worked on any open-source converters? Seems like this would be something that ONC would sponsor.</p>",
        "id": 223665537,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611333272
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, I am unsure who to ask, but I found a project you setup that seems useful for CDA-&gt;FHIR. This is the CDA-core-2.0 project (<a href=\"https://github.com/HL7/cda-core-2.0\">https://github.com/HL7/cda-core-2.0</a>). </p>\n<p>Is this project still recommended? Are there any suggested contacts? </p>\n<p>Thanks for working on this btw.</p>",
        "id": 223671897,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611336274
    },
    {
        "content": "<p>These StructureDefinitions are used as the input for these mapping files here: <a href=\"https://github.com/hl7ch/cda-fhir-maps\">https://github.com/hl7ch/cda-fhir-maps</a>. Additionally, all (C)CDA maps for the Firely implementation of the mapping language (<a href=\"https://docs.fire.ly/mappingengine/featureslist/supportedformats.html#c-cda\">https://docs.fire.ly/mappingengine/featureslist/supportedformats.html#c-cda</a>) also use this project as their source. Haven't had many issues with them.</p>",
        "id": 223681796,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1611340930
    },
    {
        "content": "<p>There exist some forks of the project as some implementations require special adjustments of a few StructureDefinitions (See for example: <a href=\"https://github.com/HL7/cda-core-2.0/pull/43\">https://github.com/HL7/cda-core-2.0/pull/43</a>)</p>",
        "id": 223681963,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1611341042
    },
    {
        "content": "<p>To help people testing CDA or CCD to FHIR conversion, we have released a simple conversion tool here <a href=\"https://web2express.org/hdoc\">https://web2express.org/hdoc</a>.  simply drop your CDA document and get a FHIR r4 document for review. IF there is anything missing, you may request us to help out if possible.</p>",
        "id": 223723511,
        "sender_full_name": "AJ Chen",
        "timestamp": 1611364833
    },
    {
        "content": "<p>It is quite easy to create an intermediate table view of the data in CDA or CCD after FHIR conversion. <span class=\"user-mention\" data-user-id=\"226484\">@Henry Perretta</span>  if you are still looking for tool to display CCD data along with FHIR resource, let me know. Would be good to discuss this use case.</p>",
        "id": 223724499,
        "sender_full_name": "AJ Chen",
        "timestamp": 1611365981
    },
    {
        "content": "<p>Thanks for sharing this <span class=\"user-mention\" data-user-id=\"307147\">@AJ Chen</span> ! Very <span aria-label=\"sunglasses\" class=\"emoji emoji-1f60e\" role=\"img\" title=\"sunglasses\">:sunglasses:</span>!</p>",
        "id": 223762524,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611425831
    },
    {
        "content": "<p>HI <span class=\"user-mention\" data-user-id=\"307147\">@AJ Chen</span> this link seems to be down now.</p>",
        "id": 223912248,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611588466
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span>  CCD-FHIR conversion testing tool moved under LHS url. Data exchange standard like FHIR and interoperability is a key part of LHS learning health systems  research</p>",
        "id": 223916408,
        "sender_full_name": "AJ Chen",
        "timestamp": 1611590117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span>  please use new cda-fhir conversion link <a href=\"https://web2express.org/lhs/hdoc/cda-fhir\">https://web2express.org/lhs/hdoc/cda-fhir</a></p>",
        "id": 223918927,
        "sender_full_name": "AJ Chen",
        "timestamp": 1611590866
    },
    {
        "content": "<p>Thanks for the fast reply! I am in now. Hopefully, this tool helps with the vaccine efforts.</p>",
        "id": 223919481,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611591092
    }
]