[
    {
        "content": "<p>hi All - on this weeks call, a few of us discussed what issues are at play for FGB. Most of the noise - that is unhappy - that I am hearing is around life cycles, versions, rate of change... </p>",
        "id": 153890824,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495486012
    },
    {
        "content": "<p>we agreed to work on this at a governance level over the next little while - to lay down our goals and precepts for this subject</p>",
        "id": 153890825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495486066
    },
    {
        "content": "<p>this is a prompt for anyone who wants to share some initial thoughts on this matter (and also a prompt for me not to forget about it)</p>",
        "id": 153890826,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495486093
    },
    {
        "content": "<p>so since we are meeting this week. here's a strawman for discussion:</p>",
        "id": 153894303,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497843056
    },
    {
        "content": "<p>Life Cycle Governance<br>\nThe life cycle strategy is a combination of <br>\n•   the rules that describe what changes may be made between versions of FHIR, for what level of maturity of artefact<br>\n•   the technical facilities provided for implementers to communicate about the version they are using<br>\n•   The facilities provided in the specification itself for converting content between versions<br>\nTogether these enable and/or constrain the ways implementers can deal with ongoing changes in the FHIR standard.<br>\nGoverning Principles:<br>\n•   There will be a clearly documented versioning strategy <br>\n•   Changes to it will be discussed transparently and with multiple opportunities for comment from FHIR implementers<br>\n•   Known risks around the versioning strategy will be documented<br>\n•   The versioning strategy will provide confidence to FHIR implementers about what steps to take to protect their investment going forward<br>\n•   The specification will clearly document for the community what processes are in place to test the versioning strategy, and to gather feedback about in in a transparent manner<br>\n•   The specification should recommend one or more best-practices for handling inter-version change<br>\n•   The FMG is responsible for ensuring that these principles are executed in the specification</p>",
        "id": 153894304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497843057
    }
]