[
    {
        "content": "<p>The Netherlands is one of multiple countries tasked with translating terms in the ehDSI MVC, master value sets catalog. A lot of the terms in there originate in HL7 CodeSystems. ehDSI is one the many use cases for translations of these terms and it would be a crying shame not to bring those to HL7 for 'the world to enjoy'.</p>\n<p>To that end I've reached out to HTA and Vocabulary to see if we could think of a process to do so. Technically speaking it could entail something like \"deliver <a href=\"https://www.hl7.org/fhir/codesystem.html\">CodeSystem supplements</a> to UTG and publish them in UTG for view and download\".</p>\n<p>What I don't know in all this is how other countries in Europe think about this. It seems so far that no other country thought of bringing results back to HL7.</p>\n<p>Can we somehow join forces in getting a reasonable process in place? Can we think of one pipeline with predictable outcomes?</p>",
        "id": 200525073,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591869917
    },
    {
        "content": "<p>For the record, this is the MVC list of HL7 systems:</p>\n<ul>\n<li>2.16.840.1.113883.5.1 Administrative gender</li>\n<li>2.16.840.1.113883.5.25 Confidentiality</li>\n<li>2.16.840.1.113883.5.1008 NullFlavor</li>\n<li>2.16.840.1.113883.5.111 Personal relationship</li>\n<li>2.16.840.1.113883.5.110 Role class</li>\n<li>2.16.840.1.113883.5.1070 substanceAdminSubstitution</li>\n<li>2.16.840.1.113883.5.1119 AddressUse</li>\n<li>2.16.840.1.113883.5.139 TimingEvent</li>\n</ul>",
        "id": 200525108,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591869952
    },
    {
        "content": "<p>does that include eventually </p>\n<ol>\n<li>adding other codesystems? e.g. MaritalStatus, or MedicinalProductGranularityLevel</li>\n<li>mapping the codes to national codes/extensions?</li>\n</ol>",
        "id": 200525413,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591870175
    },
    {
        "content": "<p>ehDSI is in control on what they add to their set. We only translate. The answer could be yes to more systems (HL7 or not)</p>\n<p>Mappings is an awkward topic. The NCP is required to do so inbound/outbound, but while outbound is in the requirement specs, I'm told inbound is not. So we would receive SNOMED CT drug codes that we have no way of handling for because the mapping to G-Standard is not catered. This was the situation about a year ago. Not sure were that is now</p>",
        "id": 200525655,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591870354
    },
    {
        "content": "<p>Agree, mapping is dificult. I was thinking of mapping for the simple (?) ones like gender and marital status and address use</p>",
        "id": 200525812,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591870500
    },
    {
        "content": "<p>mapping for drug codes is something I would avoid (just listing what kind of codes exist is already a big task)</p>",
        "id": 200525837,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591870514
    },
    {
        "content": "<p>As for translation there are also roughly two routes:</p>\n<ul>\n<li>translate only what's in the value sets</li>\n<li>translate the underlying code system</li>\n</ul>\n<p>Since the underlying code systems are really small (&lt; 50 terms each) I see no reason to just translate what's in the value sets. E.g. about 80% of NullFlavor is in the ehDSI value set... a waste not to translate the remaining 4-5 codes</p>",
        "id": 200525856,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591870534
    },
    {
        "content": "<p>and your question is whether we should have a process, right?</p>",
        "id": 200525965,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591870607
    },
    {
        "content": "<blockquote>\n<p>mapping for drug codes is something I would avoid (just listing what kind of codes exist is already a big task)</p>\n</blockquote>\n<p>We have a company that does IDMP mapping to our set for us. As for SNOMED CT: it appears that SNOMED CT is the lingua franca in European exchange, but internally we will <em>never</em> switch to SNOMED CT for medication.</p>",
        "id": 200525988,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591870628
    },
    {
        "content": "<p>same with IDMP, I think. It has a purpose for regulators, can help in prescriptions but we cannot map the codes to the ones we use. <br>\nBut the Unicom project will handle that</p>",
        "id": 200526089,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591870684
    },
    {
        "content": "<p>But outside of meds, if it's about (reference) data governance processes, I think it's good to do so, and I'd like to join</p>",
        "id": 200526104,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591870698
    },
    {
        "content": "<blockquote>\n<p>and your question is whether we should have a process, right?</p>\n</blockquote>\n<p>Yes. It seems reasonable to think that all countries translate HL7 systems and all could benefit from having the translations distributed by UTG. HTA/Vocab already said they are willing to work with us (NL) on this, but I think the case would be better if this route goes for all of us. Same process, same handling, same results. I fear that we over-ask vocab otherwise</p>",
        "id": 200526303,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591870842
    },
    {
        "content": "<p>And I also got the feeling most countries were not even considering bringing their results to a wider audience than the ehDSI use case which is a waste in my mind: so having a process is also about making it easy for countries who may feel that is 'too much work'</p>",
        "id": 200526418,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591870926
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> \"The eHDSI\" is not controlling the translations. This is entirely the responsibility of the member states. And for HL7 it is under the control of the national HL7 Affiliate as per the Affiliate agreement. The Affiliate has the exclusive right for translation, they can delegate it to third partys with an appropriate contract. We had the topic on the IC agenda several times.</p>",
        "id": 200540221,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1591880385
    },
    {
        "content": "<p>Also, the Affiliates will share their translations with HL7 International, as agreed. Under joint copyright.</p>",
        "id": 200540350,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1591880436
    },
    {
        "content": "<p>Whoever creates those translations: they are not flowing to HL7 Org at all. For The Netherlands the creation process lies with Nictiz in the national terminology centre, but we fully cooperate with HL7 NL (Roel Barelds to be precise)</p>",
        "id": 200540511,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591880507
    },
    {
        "content": "<p>If you say translations are shared: what process does this follow?</p>",
        "id": 200540623,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591880540
    },
    {
        "content": "<p>\"7.3.7  Upon their completion, translated versions of the HL7 Protocol Specifications and all other translated HL7 materials shall be promptly forwarded to HL7 International for publication to its members as Affiliate Material, subject to the provisions of section 8.3\" in the Agreement</p>",
        "id": 200540758,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1591880613
    },
    {
        "content": "<p>Has this ever been done? I don't know it has been</p>",
        "id": 200540870,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591880659
    },
    {
        "content": "<p>That's a good question, but it sounds like a good plan ;-)</p>",
        "id": 200540996,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1591880742
    },
    {
        "content": "<p>It does sound like a plan, until you send spreadsheets, CodeSystems, txt files, and what not to Ted and he displays \"does not compute\"</p>",
        "id": 200546447,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591883408
    },
    {
        "content": "<p>Maybe affiliate stuff should be published in a terminology IG per affiliate like all the other IGs, hence management is fully in the hands of the affiliate and HL7 sort of has their hands free. How such an IG ties into UTG would be a relevant question</p>",
        "id": 200546601,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591883501
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191375\">Alexander Henket</span> <a href=\"#narrow/stream/242580-europe/topic/epSOS.2FehDSI.20MVC.20Translations/near/200540870\">said</a>:</p>\n<blockquote>\n<p>Has this ever been done? I don't know it has been</p>\n</blockquote>\n<p>never done as HL7 Italy... <span aria-label=\"blushing\" class=\"emoji emoji-1f633\" role=\"img\" title=\"blushing\">:blushing:</span></p>",
        "id": 200565296,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1591891338
    },
    {
        "content": "<p>but using the code system supplements it could be easier.. are they (i.e. language translations) already supported by UTG ?</p>",
        "id": 200565861,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1591891602
    },
    {
        "content": "<p>suggestion on how to proceed ?</p>",
        "id": 200566226,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1591891796
    },
    {
        "content": "<p>We are planning in DK to make use of supplements for code systems as part of the comming national ig</p>",
        "id": 200570950,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1591893935
    },
    {
        "content": "<p>I think we should at least agree that CodeSystem Supplements (CSS) are the way to go. I don't remember is UTG was quite ready for them but Ted said it could work, and suspect that Grahame is called in if and when we actually start delivering</p>\n<p>The next thing is probably figuring out what that means for further machinery:</p>\n<ol>\n<li>\n<p>How does UTG know it is talking to the right delivery group(s). Does that involve paperwork of some sort if the delivery group is not the affiliate? Can only the affiliate interface with UTG for updates?</p>\n</li>\n<li>\n<p>What happens to the CSS. Are they incorporated as-is? Are they QA-ed by UTG? What tools do we have to QA locally? (saves everybody time if CSS if first time right)</p>\n</li>\n<li>\n<p>What to expect from publication? Do they just go into <a href=\"https://terminology.hl7.org/\">https://terminology.hl7.org/</a>... or also in <a href=\"http://tx.fhir.org\">tx.fhir.org</a>, other places? At what pace? I would expect a different pace from CSSs than from FHIR versions.</p>\n</li>\n</ol>\n<p>Does HL7 Europe have a role? Or should we just make it an IC action item?</p>",
        "id": 200830642,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1592164070
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191375\">Alexander Henket</span> <a href=\"#narrow/stream/242580-europe/topic/epSOS.2FehDSI.20MVC.20Translations/near/200830642\">said</a>:</p>\n<blockquote>\n<p>Does HL7 Europe have a role? Or should we just make it an IC action item?</p>\n</blockquote>\n<p>I think it could be definitively an action promoted by HL7 EU ..</p>",
        "id": 200888306,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1592227551
    },
    {
        "content": "<p>If you want I can volunteer to contact Ted and Grahame, adding some of you in the email to contribute to the conversation.. .</p>",
        "id": 200889081,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1592227934
    },
    {
        "content": "<p>meanwhile, if we agree to proceed with Code system supplements, we can start working on the identified CSs and in the \"worst\" case publish them in a HL7 EU IG</p>",
        "id": 200889351,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1592228103
    },
    {
        "content": "<p>IMHO the role of HL7 Europe in this context is: To make the options visible to the terminology people in the EU-Commission and in the Member States/Affiliates. I already pointed some persons to this thread here, hoping that we can arrive at decisions (e. g.: is CSS a potential way forward? any knowledge or technology required? etc.)</p>",
        "id": 200893755,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1592230186
    }
]