[
    {
        "content": "<p>Good afternoon  guys, <br>\nDoes anyone know if the FHIR Device Definition enables to feed the EUDAMED db? <br>\n I am looking for a canonical format for Medical device master data and the FHIR format is interesting. Problem is that we have this big deadline coming next year with EUDAMED.<br>\nBefore I do the exercise to analyze both formats to see how it matches, I wouldn't mind anyone to tell me what the official line.</p>\n<p>BR</p>\n<p>Julien</p>",
        "id": 212558500,
        "sender_full_name": "Julien Germa",
        "timestamp": 1602077596
    },
    {
        "content": "<p>Who can help Julien :-) ? <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span>  <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span>  <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  any suggestion ?</p>",
        "id": 212672207,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1602153940
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"351515\">@Julien Germa</span>. DeviceDefinition should be expected to hold that information, because that is its purpose.</p>",
        "id": 212673380,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602154763
    },
    {
        "content": "<p>if you have the data needs from EUDAMED at hand, i'd be glad to help with matching and finding gaps</p>",
        "id": 212673415,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602154796
    },
    {
        "content": "<p>note that Device may not be the only resource you need. For EUDAMED you may need to exchange other master data such as Organization, etc. and you may need something else if you want to have a bundled \"catalog\" of devices</p>",
        "id": 212673528,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602154891
    },
    {
        "content": "<p>Also, you might want to represent indications and contraindications for some DMs (e.g. implants). My understanding is that DeviceDefinition will evolve to be able to reference these as instances of ClinicalUseIssue (in R5 or R4B?). Just as it was done for medications leveraging MedicationKnowledge resource.</p>",
        "id": 212676474,
        "sender_full_name": "François Macary",
        "timestamp": 1602157242
    },
    {
        "content": "<p>ClinicalUseIssue can already point at DeviceDefinition, which is the intended direction for that relationship.</p>",
        "id": 212679576,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602159232
    },
    {
        "content": "<p>To me, it looks like the other way round is needed.  If you want to express this model of device is manufactured for this purpose, these indications, and is contraindicated in these situations. How would you do that?</p>",
        "id": 212799120,
        "sender_full_name": "François Macary",
        "timestamp": 1602233780
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192504\">François Macary</span> <a href=\"#narrow/stream/242580-europe/topic/EUDAMED/near/212799120\">said</a>:</p>\n<blockquote>\n<p>To me, it looks like the other way round is needed.  If you want to express this model of device is manufactured for this purpose, these indications, and is contraindicated in these situations. How would you do that?</p>\n</blockquote>\n<p>with a lot of resources, it seems... <br>\nI think I agree: If the ClinicaUseIssue is supposed to represent the \"abstract\" condition, the relation would be the other way around.</p>",
        "id": 212799953,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602234328
    },
    {
        "content": "<p>hi François, the direction of the model is not the direction of the meaning. So it does do what you are asking already. <br>\nIt is physically modelled that way around because the indications can be added to the device, as time goes by. You don't want to update the fundamental device definition when an indication is added. It is like the way patients and their conditions work. Conditions come and go, and you don't want to have them all referenced in the patient.</p>",
        "id": 212799959,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602234332
    },
    {
        "content": "<p>because the ClinicalUseIssue seems to require that you create a ClinicalUseIssue for each combination of device/condition.</p>",
        "id": 212799993,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602234362
    },
    {
        "content": "<p>(hence a lot of resources)</p>",
        "id": 212800040,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602234368
    },
    {
        "content": "<p>I understand Rik's reasoning though. I miss our CatalogEntry <span aria-label=\"sob\" class=\"emoji emoji-1f62d\" role=\"img\" title=\"sob\">:sob:</span> but perhaps clinicaluseissue has the same purpose</p>",
        "id": 212800217,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602234484
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> . I understand that one can search on ClinicalUseIssue on subject criterion with a particular DeviceDefinition.<br>\nHowever I don't see yet how  we could include indications and contraindications into a catalog of devices. My expectation so far, is that all the resources providing further details on the device model should be referenced by the DeviceDefinition representing this model. We'll have to give it more thoughts in the catalog project group.</p>",
        "id": 212802301,
        "sender_full_name": "François Macary",
        "timestamp": 1602236005
    },
    {
        "content": "<p>Logically the device \"has\" indications, but in physical FHIR terms there is no special need for the reference to work in either direction. We just do it in a way that is most practical for granularity, ease of update, ownership etc (e.g. the person asserting the contra/indication - their local indication perhaps - may not have control of the device resource). <br>\nThe device has indications, whether or not it points to them or is pointed at by them (or \"knows\" about them).<br>\nIn a catalogue you just have a bunch of resources e.g.</p>\n<div class=\"codehilite\"><pre><span></span><code>         &lt;DeviceDefinition&gt;\n            &lt;id value=&quot;12435&quot;/&gt;\n            &lt;deviceName&gt;\n               &lt;name value=&quot;WonderComb&quot;/&gt;\n               &lt;type value=&quot;manufacturer-name&quot;/&gt;\n            &lt;/deviceName&gt;\n            &lt;type&gt;\n               &lt;text value=&quot;This is a hair device&quot;/&gt;\n            &lt;/type&gt;\n         &lt;/DeviceDefinition&gt;\n</code></pre></div>\n\n\n<p>and also</p>\n<div class=\"codehilite\"><pre><span></span><code>         &lt;ClinicalUseIssue&gt;\n            &lt;type value=&quot;indication&quot;/&gt;\n            &lt;subject&gt;\n               &lt;reference value=&quot;DeviceDefinition/12345&quot;/&gt;\n            &lt;/subject&gt;\n            &lt;indication&gt;\n               &lt;diseaseSymptomProcedure&gt;\n                  &lt;text value=&quot;In the UK we use recommend this for relief from painful hair&quot;/&gt;\n               &lt;/diseaseSymptomProcedure&gt;\n            &lt;/indication&gt;\n         &lt;/ClinicalUseIssue&gt;\n</code></pre></div>\n\n\n<p>(I realise this may be what you already understand, but just don't agree with :-)</p>",
        "id": 212810042,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602241292
    },
    {
        "content": "<p>Yes, that seems the same issue. The device does not have indications. The device, in a given context, has indications. We had a resource for that but was too fuzzy and was abandoned</p>",
        "id": 212820458,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602247760
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/242580-europe/topic/EUDAMED/near/212673380\">said</a>:</p>\n<blockquote>\n<p>Hi <span class=\"user-mention silent\" data-user-id=\"351515\">Julien Germa</span>. DeviceDefinition should be expected to hold that information, because that is its purpose.</p>\n</blockquote>\n<p>Thanks for the hints. I've briefly looked at the EUDAMED requirements and the device definition seems to cover only the UDI-Device identifier (catalog view of the product, the model) required by Eudamed. The Device is completing what is missing that is the Basic UDI-DI (labelling ecompassing UDI, Carrier, batch...)and the UDI-Product (production  data) Identifier . I need to build a mapping to see how it matches and I will surely be back to have a better understanding of the meaning of the FHIR data sets. First I need to work on my data providers, I am new in my company and it looks a bit messy. I'll feed with upd when I progress</p>",
        "id": 213002392,
        "sender_full_name": "Julien Germa",
        "timestamp": 1602484732
    },
    {
        "content": "<p>devicedefinition does include UDI (Device data)</p>",
        "id": 213014093,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602493797
    },
    {
        "content": "<p>DeviceDefinition cannot include Production identifiers because those are on instance - therefore on Device resource</p>",
        "id": 213014176,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602493835
    },
    {
        "content": "<p>Production identifiers : batch, serial...</p>",
        "id": 213014198,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602493857
    },
    {
        "content": "<p>Coming a bit later on this subject of DeviceDefinition referencing or being referenced by ClinicalUseIssue. <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> and <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <br>\nWe all agree that in a catalog, devices, like drugs should be able to declare what their indications and contraindications are. In a drug formulary for instance, each drug described as an instance of MedicationKnowledge references its indications and contraindications through the administrationGuideline element. I think it should work the same way with DeviceDefinition. So I'm expecting a usageGuideline backbone element in DeviceDefinition conveying patient characteristics and indications and contraindications as CodeableReference(ClinicalUseIssue).</p>",
        "id": 213574032,
        "sender_full_name": "François Macary",
        "timestamp": 1602861408
    },
    {
        "content": "<p>Hi François. You can point from DeviceDefinition to ClinicalUseIssue if you want. That method will not allow anyone to assert an indication etc about a device that already exists, or that they don't own the record of. So it's a less flexible solution, but if you want that you can ask O&amp;O to add that, or you can add an extension.</p>",
        "id": 213575550,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602862157
    },
    {
        "content": "<p>Thanks. I will request that change, and see how it goes.</p>",
        "id": 213575799,
        "sender_full_name": "François Macary",
        "timestamp": 1602862261
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/242580-europe/topic/EUDAMED/near/213575550\">said</a>:</p>\n<blockquote>\n<p>That method will not allow anyone to assert an indication etc about a device that already exists, or that they don't own the record of. </p>\n</blockquote>\n<p>This issue does not apply, because those are different resource instances</p>",
        "id": 213583334,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602865934
    },
    {
        "content": "<p>A device D1 that indication I1 , suddenly gets an indication I2 as well.<br>\nEither a new version of the Device D1 is created, or a Device D1v2 is created.</p>",
        "id": 213583409,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602865985
    },
    {
        "content": "<p>This is the way it has to work since we removed the CatalogInstance resource.</p>",
        "id": 213583454,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602866020
    },
    {
        "content": "<p>The other way it can work:<br>\nDeviceDefinition D1 has indication ClinicalUseIssue I1, which points at D1. <br>\nLater another indication comes along and you create ClinicalUseIssue I2 and point that at D1. <br>\nNo need to update D1 or create D1v2.</p>",
        "id": 213586387,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602867588
    },
    {
        "content": "<p>Agree there are different ways it can work. But what we settled on (regardless of my preference) was that the current way is the intended way of working - the intent is to update the device</p>",
        "id": 213597893,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602873236
    },
    {
        "content": "<p>This is not a robust thing imo but we need others' feedback</p>",
        "id": 213597976,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602873271
    },
    {
        "content": "<p>That sounds like something an implementation guide would do, rather than core.<br>\nWhy would one resource rule out a legitimate use of a different resource?<br>\nDeviceDefinition would be saying \"don't use ClinicalUseIssue to point to this resource\", even though that is one of the uses of ClinicalUseIssue.</p>",
        "id": 213614981,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602882817
    },
    {
        "content": "<p>I'm pointing to the core behaviour as was decided before. <br>\nClinicalUseIssue can surely point at the device, but what we had discussed is that for catalogs, the focal resouce would be the one that contains the relationships. I didn't agree then, but that is how we rolled.</p>",
        "id": 213621726,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602888025
    },
    {
        "content": "<p>Besides, ClinicalUseIssue is fresh painted and was developed with a specific scope in mind. <br>\nWe've been through that - I don't reject its use, but we should proceed with caution and openness</p>",
        "id": 213621786,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602888111
    },
    {
        "content": "<p>~\"fresh painted\"? <br>\nDo you mean to say that ClinicalUseIssue is new and so can be ignored? (it actually existed before DeviceDefinition :-)<br>\n~was developed with a specific scope in mind<br>\nYes, indications for various things including devices. Why is scope an issue here? Is it not appropriate?<br>\n~I'm pointing to the core behaviour as was decided before. <br>\nWhat was decided and in what context?</p>",
        "id": 213766719,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603103510
    },
    {
        "content": "<p>What was decided was, to my understanding, that the catalog would contain the definitional resources - for devices, a collection of DeviceDefinition, each of these pointing to some indications/contraindications. If you change a contraindication, you change the device.</p>",
        "id": 213768725,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603104839
    },
    {
        "content": "<p>Another misunderstanding: no, I did not say it could be ignored. I am just not so sure that the way you propose the relations is the only way that it can ever work.</p>",
        "id": 213768837,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603104918
    },
    {
        "content": "<p>the decision I mentioned above was in the scope of catalogs.</p>",
        "id": 213768875,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603104952
    },
    {
        "content": "<p>But that is about catalogues. <br>\nA collection of resources is not a \"catalogue\", in a FHIR sense, with some meaning that changes the behaviour of the rest of FHIR (e.g. mandating a certain update pattern).<br>\nMy intention was to not to propose only one way ever - although in fact there is only one documented way at the moment, as far as I know -  but to push back on the idea that the current situation <em>could not</em> be used here, based on a ruling that I cannot see at the moment.</p>",
        "id": 213776743,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603110170
    },
    {
        "content": "<p>For drugs, I believe the current direction is as François says: we can add the indication to the MedicationKnowledge.administrationGuideline. <br>\nFor Device it would be the same. Or we can change for both, but if we do, the ClinicalUseIssue becomes an authoritative resource and must be a part of the catalog (and not a contained resource, I think?)<br>\nWe can discuss this in a Catalog call.</p>",
        "id": 213778271,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603111044
    }
]