[
    {
        "content": "<p>#europe Register here: <a href=\"https://attendee.gotowebinar.com/register/8766406620520498189\">https://attendee.gotowebinar.com/register/8766406620520498189</a><br>\n#HL7europe anniversary celebration webinar:  Check program at <a href=\"http://HL7.eu\">HL7.eu</a><br>\n#Announcements HL7 Europe 10 Year Anniversary Celebration:  HL7 Standards in Europe: past, present, and future.<br>\n18 Jan 2020, 4pm to 6:00 pm CET, 10 am EST USA<br>\nProgram<br>\nHL7 Europe Achievements 2010-2020, Catherine Chronaki, Secretary General, HL7 Europe <br>\n•   What has HL7 Europe contribute in Europe so far for the European Region?  <br>\nHL7 Europe – What’s next?  <br>\nModerator: Line Andreassen Sæle, HL7 Norway, HL7 Europe Board of Directors (panel discussion)<br>\n•   Jasper van Lieshout, Enterprise Architect· ‎Ministry of Health, Welfare and Sport, NL <br>\n•   Miroslav Koncar, HL7 Croatia<br>\n•   Kai Heitmann, Director Interoperability, Health Innovation Hub, Germany <br>\nHL7 as an organization has been a catalyst for health information technology standards since the times of HL7v2 and remains a catalyst with HL7 CDA and HL7 FHIR large scale projects as myHealth@EU and eHDSI introducing new ways of developing standards and accelerating their adoption. <br>\nFollowing the speaker talks, the following questions will be addressed in a panel:<br>\n•   How do you see the role HL7 Europe and European affiliates moving into the future? <br>\n•   How can they work together to support an increasingly diverse set of stakeholders and use cases in and out of healthcare organizations? <br>\n•   What actions can help defragment the market, secure pragmatic regulations (e.g. self-regulation vs government-mandate)?<br>\n•   What synergies work well? Where more work is needed? <br>\n•   How do you see the changing role of HL7 Affiliates in Europe, vis-à-vis development of specifications for digital health services; What is the role of certification in relationship with other organizations?<br>\n•   How do you see the HL7 user communities evolving into the future?<br>\nLooking forward:  Strengthening the HL7 Expert Community in Europe, Giorgio Cangioli, Technical Lead, HL7 Europe.<br>\nCelebration of HL7 Europe 10 years <br>\n•   Walter Suarez, chair HL7 International <br>\n•   Recognize Ed Hammond for setting HL7 Europe in 2010.<br>\nClosing Remarks: Roel Barelds, Christof Gessner, Catherine Chronak</p>",
        "id": 222737312,
        "sender_full_name": "Catherine Chronaki",
        "timestamp": 1610639861
    }
]