[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> </p>\n<p>(Really, I have not been storing these up just sp I can dump them all at once and ruin your day, really...)</p>\n<p>I have a case where I have a Use with two namespaces in it, both of which define a Code element, and I getting the following error.</p>\n<p>ERROR 11047:  'Resolution error: Found conflicting definitions for Code in multiple namespaces: fhir.observation,fhir.quantity '****</p>\n<p>One Use is to define the parent class, and the other to define a member type. I can not use the full namespace and remove either of the two use's because the full namespace appears to be only partially implemented.<br>\ni.e. I cant say <br>\nValueX[fhir.quantity.Quantity].System</p>\n<p>and <br>\nParent: fhir.observation.Observation<br>\nalso returns compiel errors.</p>\n<p>I really don't use either of these definitions, except in a context where it is obvious which one I mean. Is there a possible to ignore this error unless that code needs to reference a 'Code' where it is not in contect determinable which one we mean?</p>\n<p>I.E. Code below is used only when referring to a Quantity, so the s/w could be able to determine the correct Code...</p>\n<p>Kurt A.</p>\n<p>Grammar: DataElement 6.0<br>\nNamespace: brr<br>\nUses: fhir.observation, fhir.quantity</p>\n<p>Entry: BreastRadiologyAbnormalityMaxLength<br>\nParent: Observation<br>\n    ValueX 1..1<br>\n    ValueX only Quantity<br>\n    ValueX[Quantity].System = \"<a href=\"http://unitsofmeasure.org\" target=\"_blank\" title=\"http://unitsofmeasure.org\">http://unitsofmeasure.org</a>\"<br>\n    ValueX[Quantity].Code from UnitsOfLengthVS</p>",
        "id": 176612935,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569452313
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192611\">@Kurt Allen</span> -- I think you identified the two potential approaches to fixing this...  one would be adding support for the fully qualified names in those areas you found they are not supported.  Another would be trying to determine which element it is through the context of where it is used (i.e., your <code>ValueX[Quantity].Code</code> example).  Both of these require code changes in the CLI.  The most immediate fix, of course, would be for you to change the name of one of them to something unique (if you need a fix now).</p>",
        "id": 176619230,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1569459023
    },
    {
        "content": "<p>We now use Jira to track issues.  I wonder if perhaps you could log this as a Jira issue?  That would make it easier for us to track it and would allow you to track it as well.  You can find our Jira here: <a href=\"https://standardhealthrecord.atlassian.net/projects/CIMPL/issues\" target=\"_blank\" title=\"https://standardhealthrecord.atlassian.net/projects/CIMPL/issues\">https://standardhealthrecord.atlassian.net/projects/CIMPL/issues</a></p>\n<p>You may have to sign up for a free account to log a bug.</p>",
        "id": 176619312,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1569459138
    },
    {
        "content": "<p>Also, <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> spent a lot of time on defining OBF and the mappings to FHIR so that most everything would work as needed.  I'm curious why you have chosen to move away from OBF and write your own FHIR base elements and mappings?  Is there a deficiency in OBF that we could fix there that would keep you from having to do all that work?</p>",
        "id": 176619404,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1569459291
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> We had some concerns raised vis-a-vis breast radiology profile that it was derived from US-Core and we wanted to see what these looked like working directly from the fhir resources.<br>\nFor the short term I will just overload the name. Esp. with fields named 'code that makes more sense.</p>",
        "id": 176657290,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569504264
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192611\">@Kurt Allen</span> -- as you know, similar concerns were raised about mCODE at the Connectathon. We should circle with <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> to see if he has plans to do a non-US-Core OBF.</p>\n<p>In the mean time (or if he doesn't) -- it seems like you <em>should</em> be able to take the OBF source and:<br>\n1) Change any mappings from elements to US Core profiles just to map to the base resource instead<br>\n2) Remove/replace references to US Core extensions in the mapping files<br>\n3) Remove/replace US Core value sets in the CIMPL definition files</p>\n<p>This would essentially maintain the structure and general mapping approach of OBF while removing the US-Core-centric aspects of it.  It might be easier than trying to create new classes and mappings from the ground up.</p>",
        "id": 176657778,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1569504658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> Is this something you are thinking of doing?</p>",
        "id": 176715235,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569554095
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> I am getting some parse errors, and I cant find any indication of the file or line # where the error is. Any ideas on how I can track down the offending line? Unfortunately I made a log of changes all at once, and it would not be easy to back them all out and do them one by one to see where I made the booboo...<br>\nKurt</p>\n<p>INFO 05001:  'Starting CLI Import/Export'<br>\n    During:         shr-cli</p>\n<p>INFO 01012:  'Using config file C:\\Development\\MITRE\\cimpl\\Fhir-BreastRadiologyReport\\CIMPL\\ig-breastRad-config.v4.json'<br>\n    During:         shr-text-input</p>\n<p>ERROR 11015:  'token recognition error at: '/''<br>\n    During:         shr-text-input<br>\n    Suggested Fix:  This is usually a typo issue. Investigate keywords and missing colons around the specificed text input.</p>\n<p>ERROR 11023:  'extraneous input '*' expecting {&lt;EOF&gt;, 'Abstract:', 'Element:', 'Entry:', 'Value', 'Property:', 'or', 'Group:', '_Entry', 'boolean', 'integer', 'string', 'decimal', 'uri', 'base64Binary', 'instant', 'date', 'dateTime', 'time', 'concept', 'oid', 'id', 'markdown', 'unsignedInt', 'positiveInt', 'xhtml', null, null, null, null}'<br>\n    During:         shr-text-input<br>\n    Suggested Fix:  This is usually a typo issue. Investigate spelling and keywords used around the specificied text input.</p>",
        "id": 176753788,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569596377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> I found the problem, a file had a trailing '{asterix}/' in it (without a starting '/{asterix}').<br>\n(zulip wont let me use a asterix directly, so use your imagination)</p>\n<p>But I had to <br>\na) set log level to debug<br>\nb) find the last file that compiled properly in the output<br>\nc) open the next file in the directory and search for a compile error.</p>\n<p>It would be really helpful if  a log message was added detailing the file in which the error ocurred?<br>\nThanks,<br>\nK</p>",
        "id": 176755553,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569597506
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span></p>\n<p>Re clean differential.</p>\n<p>I am using the obf base classes (minus is core stuff), and I create an entry derived from Observation, and don't constrain Observation.basedOn. In the output json, I see the definition below.<br>\nThe reason that the differential has a value for basedOn in it is because I guess shr-cli is constraining the target profile from (for instance) MedicationRequest to  obf-MedicationRequest.</p>\n<p>How can I stop that from happening, so we get a clean differential?</p>\n<p>Kurt</p>\n<div class=\"codehilite\"><pre><span></span>  {\n    &quot;id&quot;: &quot;Observation.basedOn&quot;,\n    &quot;path&quot;: &quot;Observation.basedOn&quot;,\n    &quot;short&quot;: &quot;Fulfills plan, proposal or order&quot;,\n    &quot;type&quot;: [\n      {\n        &quot;code&quot;: &quot;Reference&quot;,\n        &quot;targetProfile&quot;: [\n          &quot;http://hl7.org/fhir/us/breast-radiology/StructureDefinition/obf-MedicationRequest&quot;,\n          &quot;http://hl7.org/fhir/us/breast-radiology/StructureDefinition/obf-ServiceRequest&quot;,\n          &quot;http://hl7.org/fhir/us/breast-radiology/StructureDefinition/obf-ProcedureRequest&quot;,\n          &quot;http://hl7.org/fhir/us/breast-radiology/StructureDefinition/obf-ReferralRequest&quot;\n        ]\n      }\n    ],\n</pre></div>",
        "id": 176781869,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569614851
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192611\">@Kurt Allen</span></p>\n<p>Re: log output for syntax errors, we can take a look as see if we can output more information (file and line #).  I thought we did this before, but I may be mistaken, or it may have been mistakenly removed when we changed the log format.</p>\n<p>Re: not wanting those profiles on the basedOn targets, you're using a CP file, right?  If so, I think you want to have these in it:</p>\n<div class=\"codehilite\"><pre><span></span>Namespace: obf NP\nNamespace: obf.datatype NP\n</pre></div>\n\n\n<p>That says not to create profiles from any of the definitions in the obf or obf.datatype namespaces.</p>",
        "id": 176783555,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1569616133
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> <br>\nI added the two namesapce lines as per you note (I removed those when I was playing around - sorry should have remembered).<br>\nI have modified the obf files to remove all references to US-Core (i.e. I may have introduced an error)<br>\nWhen I added them back in, I get the error below. I have no idea what this error is trying to tell me :-)<br>\nK</p>\n<p>INFO 03007:  'Exporting FHIR using target: FHIR_R4'<br>\n    During:         FHIR Export<br>\n    Target Class:   FHIR_R4</p>\n<p>ERROR 13064:  'Could not find FHIR element for content profile rule with path '<br>\n    During:         FHIR Export<br>\n    Class:          MedicationDispense<br>\n    Target Class:   DomainResource</p>",
        "id": 176791335,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569623447
    },
    {
        "content": "<p>P.S. This will keep until Monday.... :-)</p>",
        "id": 176791356,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569623483
    },
    {
        "content": "<p>Update: Tried reverting to the shr-spec files that are checked in (tried both master - sep 5 and most recent version). Got same error. Don't think problem is caused by any changed I made to obf files.</p>",
        "id": 176825823,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569676419
    },
    {
        "content": "<p>Hmmm... <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> -- have you run into this?</p>",
        "id": 176932808,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1569850975
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192611\">@Kurt Allen</span>  can you check your content profile file for any mention of MedicationDispense? Perhaps the namespace might be incorrect? Or MedicationDispense is not defined in the CIMPL files?</p>",
        "id": 176945687,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1569858828
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> The only references are from shr-spec.<br>\nA) obf_finding.txt line 332 (ObservationPartOf) and<br>\nB) obf-medication.txt LINE 133 &amp; 197.</p>",
        "id": 176971021,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1569875301
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192611\">@Kurt Allen</span> Hello, I'm a developer working on CIMPL with Chris. That \"Error 13064\" that you are seeing was actually a bug, and we are fixing it now. The bug causing the error message did not cause any unexpected functionality, so you can just ignore that error message until our fix is published. </p>\n<p>As for directly using <code>MedicationRequest</code> instead of <code>obf-MedicationRequest</code>, you do want to use the <code>NP</code> flag that Chris mentioned, but you likely want to be more careful about how you apply it. In the example Chris showed, the <code>NP</code> flag will prevent profiles from being made for definitions in the obf or obf.datatype namespaces, but it will also prevent profiles from being made for definitions that inherit from definitions in obf or obf.datatype. So you probably do not want to <code>NP</code> all of obf, since you have definitions that inherit from definitions in obf. You can apply the <code>NP</code> flag at a definition specific level instead of applying it to the entire namespace in the following way:</p>\n<div class=\"codehilite\"><pre><span></span>Namespace: obf // Don&#39;t apply NP at this level\n  MedicationRequest: NP // apply NP at this level\n  ServiceRequest: NP\n  ProcedureRequest: NP\n  ReferralRequest: NP\n  // and so on for definitions that you wish to not have a profile for\n</pre></div>\n\n\n<p>This gives you the ability to pick and choose which definitions that you want to apply the <code>NP</code> flag to.</p>",
        "id": 177632183,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1570551427
    }
]