[
    {
        "content": "<p>Happy new year! </p>\n<p>I have not invited to a meeting this wednesday 8th. If someone comes up with a topic, I'll invite for a call on wednesday 15th. </p>\n<p>What we could discuss further is the Action Points (AP) from the Nordic meeting on standardization (Nordic Council of Ministers):</p>\n<p>AP2: To influence the HL7 with a common Nordic voice. Call for meeting on profiles on a Nordic level </p>\n<ul>\n<li>What have been done so far on FHIR (middle name...)</li>\n<li>What other areas could be focus for Nordic cooperation (FHIR and non-FHIR), like imaging, medications, etc. </li>\n</ul>\n<p>AP3: Collect and share information from each Nordic country and how profiling is performed</p>",
        "id": 184887344,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1578298664
    },
    {
        "content": "<p>I'll send out invitations for a call 2020-03-04 so we don't loose connection :-)</p>",
        "id": 188906459,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1582531219
    },
    {
        "content": "<p>One topic to discuss would be Nordic cooperation on International Patient Access. <a href=\"https://build.fhir.org/ig/grahamegrieve/ipa-candidate/\" target=\"_blank\" title=\"https://build.fhir.org/ig/grahamegrieve/ipa-candidate/\">https://build.fhir.org/ig/grahamegrieve/ipa-candidate/</a>. The aim would be to get a profile similar to the US Core defined for Nordic countries, perhaps including the Netherlands too. That is for the content. In addition, we would need to agree on methods for authorization, etc. Anyone interested in this?</p>",
        "id": 189191749,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1582787408
    },
    {
        "content": "<p>We could also discuss whether we want to meet face-to-face in an event next to either Vitalis or HIMSS Europe, or both.</p>",
        "id": 189191801,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1582787526
    },
    {
        "content": "<p>We (Trifork) are heading into an european project where we need to have a look at the IPS. If the project gets started, we will have some time to have a look at how IPA/IPS fits better into european usage</p>",
        "id": 189477651,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1583144303
    },
    {
        "content": "<p>I'll keep you posted whether we get somewhere or not ;)</p>",
        "id": 189477665,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1583144325
    },
    {
        "content": "<p>We are also looking into this. IPS as a document is one thing, but using IPS as inspiration for a \"Nordic+\" US Core/Argonaut Query is interesting. IPA is good, but we need something between light weight IPA and the heavier IPS, including coding systems/value sets. We could absolutely talk about this on wednesday, as the Nordic Council of Ministers are searching for a common Nordic project. I have lots of ideas, just not much on paper...</p>",
        "id": 189504140,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1583164475
    }
]