[
    {
        "content": "<p>Hi everyone! Since we just had a call, I propose to push the next call to October 14th. That is the World Standard Day!<br>\n<a href=\"https://en.wikipedia.org/wiki/World_Standards_Day\">https://en.wikipedia.org/wiki/World_Standards_Day</a></p>\n<p>Please comment below for topics to discuss. </p>\n<p>Time: 2020-10-14 09.00-10.00 CET<br>\nSkype meeting: <a href=\"https://meet.ehelse.no/espen.stranger.seland/5QFTRLCR\">https://meet.ehelse.no/espen.stranger.seland/5QFTRLCR</a></p>",
        "id": 211594681,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1601369070
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span> i forgot that I'm on vacation this week ;)</p>",
        "id": 213213977,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1602621771
    },
    {
        "content": "<p>Sorry about the date for every one of you having an autumn vacation - we’ll catch up. We do not have a set agenda, so I guess it’s going to be brief.</p>",
        "id": 213217012,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1602623290
    },
    {
        "content": "<p>Thank you for the call. I'll not going to start to write meeting minutes, but here are some topics discussed today to follow up:</p>\n<ul>\n<li>What will the std. group of Nordic Council of Ministers follow up? Keep promoting terminology services (architecture). Sweden and Norway is starting up slow. </li>\n<li>Nordic Interoperability Project <a href=\"https://nordicinteroperability.com/\">https://nordicinteroperability.com/</a> More showcase than implementation, FHIR profiling probably up the road</li>\n</ul>",
        "id": 213255682,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1602661529
    },
    {
        "content": "<p>From Nordic eHealth Standardization group meeting summary 2020-09-17:</p>\n<ul>\n<li>The Nordic countries recommend that the IPS standard (EN 17269) shall be used as a general information model for structuring or mapping patient summaries for national purposes, and for exchanging patient information across the Nordic countries.</li>\n<li>The Nordic countries have agreed to work on standardization at national and European level so that the gap between national and cross-border exchange of EHRxF information is as small as possible.</li>\n</ul>",
        "id": 213256632,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1602662306
    }
]