[
    {
        "content": "<p>I presented the situation in Finland (see <a href=\"#narrow/stream/194447-nordics/topic/Use.20case.20for.20IPA.20in.20Finland/near/239859922\">https://chat.fhir.org/#narrow/stream/194447-nordics/topic/Use.20case.20for.20IPA.20in.20Finland/near/239859922</a> for details).</p>",
        "id": 239861107,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621677287
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> mentioned the thought of merging IPA with IPS. See <a href=\"#narrow/stream/261969-IPA/topic/IPA.20Status/near/238063710\">https://chat.fhir.org/#narrow/stream/261969-IPA/topic/IPA.20Status/near/238063710</a> and <a href=\"#narrow/stream/207835-IPS/topic/IPS.20and.20IPA.20session/near/239266739\">https://chat.fhir.org/#narrow/stream/207835-IPS/topic/IPS.20and.20IPA.20session/near/239266739</a>. Some thoughts:</p>\n<ul>\n<li>This might help adoption of IPA in some cases, as there would likely be less concerns over IPA and IPS being overlapping, competing, or conflicting approaches.</li>\n<li>This might potentially also hinder the adoption of IPA in cases where someone has already taken a stance agains IPS?</li>\n<li>IPS will become more international in the future anyway, with the US and Asian countries joining in.</li>\n</ul>",
        "id": 239861116,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621677308
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span> asked for a good story for IPA, to be taken forward for people with political power.<br>\nMy very first draft for this would be</p>\n<ul>\n<li>IPA is a key enabler for IPS. They can be seen as a tightly coupled pair, with IPS specifying what to share and IPA a mechanism for actually sharing or transferring the content.</li>\n<li>Patients as the couriers for their own health data is a compelling use case, even if it’s not the only one. Especially with a widely adopted IPA specification it scales well, and goes really well together with the current thinking on privacy and giving people agency over how their data is used.</li>\n<li>Apps getting access to health data is a key enabler for digitalization of healthcare. However, this should be done in a controlled way. And this is where we need the cooperation between the Nordic countries (and perhaps the Netherlands?), both on technical and political levels.</li>\n</ul>",
        "id": 239861130,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621677329
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194313\">@Petter Wolff</span> pointed out that Apple Health should really be the litmus test for any criteria imposed for apps. You should be able to get your data at least to Apple Health (at least if Apple continues to be interested in this, if we get the mentioned countries to cooperate).</p>",
        "id": 239861214,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621677453
    },
    {
        "content": "<p>Our next call is scheduled for Wednesday, June 2, at 9 AM CET.</p>",
        "id": 239861278,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621677508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> <span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span>  - with regards to next meeting it would be good to discuss how the IPA/ IPS plays with our national profiling framework with regards to basisprofiler og områdeprofiler <a href=\"https://hl7norway.github.io/best-practice/\">https://hl7norway.github.io/best-practice/</a>.</p>",
        "id": 240075662,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1621873923
    }
]