[
    {
        "content": "<p>Hi all - I'm looking for input on the modelling of the patient resource in regards to the statement:</p>\n<blockquote>\n<p>The data in the Resource covers the \"who\" information about the patient: its attributes are focused on the demographic information necessary to support the administrative, financial and logistic procedures. A Patient record is generally created and maintained by each organization providing care for a patient. A patient or animal receiving care at multiple organizations may therefore have its information present in multiple Patient Resources.</p>\n</blockquote>\n<p>If I'm not mistaken, we generally have the same concept around healthcare in the nordics, where the state is overall responsible for providing care and treatments and the municipalities and regions are given the responsibility to actually carry out such services. With that in mind, does it then makes sense to model multiple patients for each of eg. the regions and/or municipalities? Since the Patient is primarily demographics information and we already have (I assume) welldesigned and -governed national MPI's keeping such information, does it then makes sense to have multiple patient resources for a single individual within cross-regional/national FHIR systems?</p>",
        "id": 166973397,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1559285855
    },
    {
        "content": "<p>I think the answer is yes and no. With a (super)national/mandatory minimum set, every patient would be identified etc. in the same way. Though, there will allways be local variations (e.g. in the actual APIs), extending or restricting (if allowed). </p>\n<p>So, if the national profile will do, do not make a local one unless you really have to. And if you do, make it a profile of the national profile. We think of a hierarchy of profiles in two or three levels, but the challenge is governance.</p>",
        "id": 167457709,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1559805086
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span> - Regarding the profiling I think we're alligned in that a hiearchy of 2 or 3 levels are probably likely - or using composition. My question however does not concerns the profile particularly - which make the title misleading. It concerns the <em>instances</em> of a (set of) patient resource(s). I guess the question I'm looking for an answer for is more: </p>\n<p><strong>\"In a given cross sectoral single national public system here in the nordics, does it really make sense to have multiple instances of the same <em>Person</em> - as in multiple <em>Patient</em>s or does it simply clutter the picture? Having multiple Patients would mean that they would cover thee same demographics and the same Identifiers.\"</strong> In FHIR this is not a problem, so technically speaking there is no problem, but it would make it possible to then have diverging/stale demographics data which AFAIK is  centrally governed here in the nordics.</p>",
        "id": 167528871,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1559860080
    },
    {
        "content": "<p>So an architectual question. In Norway we will publish our full people register (folkeregisteret) as a  FHIR API-service (as Person++). You should have a talk with <span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span>  about it.  The plan includes  master data services for healthcare personnell and organizations.</p>",
        "id": 167555595,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1559893877
    }
]