[
    {
        "content": "<p>I noticed <span class=\"user-mention\" data-user-id=\"197234\">@Martin Grundberg</span> started a discussion on Patient (especially address) on <a href=\"#narrow/stream/179181-netherlands/topic/nl-core-address-official/near/162604772\" title=\"#narrow/stream/179181-netherlands/topic/nl-core-address-official/near/162604772\">https://chat.fhir.org/#narrow/stream/179181-netherlands/topic/nl-core-address-official/near/162604772</a>. This should have wider interest in the Nordic community.</p>",
        "id": 162808040,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1554722618
    },
    {
        "content": "<p>Yes I did! Reason is that we are doing some core profiling for a Swedish patient. And we have something in Sweden called a \"Folkbokföringsadress\". The meaning of it is explained in that thread you linked to. Outcome is that Swe and Dutch requirements are similar, and the Dutch extension could be made into a standard one which of course is good!</p>\n<p>Many countries will have very similar requirements, and many are possible to solve in different ways,  so ideally even a Nordic work group for profiling would be good. Potentially one per resource. </p>\n<p>Until that happens, we at least always try to think internationally with our extensions. That means no Swedish, or no references to Swedish specific use cases in extensions that we see are common to other countries. That type of information should instead go into profiles. </p>\n<p>Im open to having a call to discuss profiling requirements for patient (thats how far we have gotten) if there is interest!</p>",
        "id": 162810057,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1554724710
    },
    {
        "content": "<p>We have the same need in Norway and solved it by introducing an extension like nl-core:<br>\n<a href=\"https://simplifier.net/HL7Norwayno-basis/no-basis-address-official\" target=\"_blank\" title=\"https://simplifier.net/HL7Norwayno-basis/no-basis-address-official\">https://simplifier.net/HL7Norwayno-basis/no-basis-address-official</a></p>\n<p>I think a code in the address.use would be an even better solution.</p>",
        "id": 162992485,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1554892762
    },
    {
        "content": "<p>same goes for denmark</p>",
        "id": 163054850,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1554937858
    },
    {
        "content": "<p>while we're at Patient in the nordics - in DK we have a concept of 'navn og adresse beskyttelse' (name and address protection) for individuals that would like not to have their information available to others than the institutions governed by the public sector. Basically its a flag in the national registries with a period containing the start and end date. Is that something that you guys also have in your countries</p>",
        "id": 163079535,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1554970419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192477\">@Thor Schliemann</span> <span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span>  are you aware of any other similarities</p>",
        "id": 163079620,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1554970487
    },
    {
        "content": "<p>We also has a need for address protection in Norway <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> </p>\n<p>The Norwegian Master Person Index has four grades of address protection. Unprotected, clientaddress, confidential and strongly confidential. I have never seen an explanation for the clientaddress value however. There is no such confidentiality setting for a person name, and the Master Person Index don't expose any metadata concerning the confidentiality setting.</p>",
        "id": 163092258,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1554983551
    },
    {
        "content": "<p>We have a very similar requirement in Sweden. There are national flags for protecting patient and address details. There are mainly two flags:<br>\n1) Sekretessmarkering (eng: protectetPersonIndicator)<br>\nThis is a lower grade of secrecy which flags that caution should be taken when handling this persons address and contact details</p>\n<p>2) Skyddad folkbokföring (eng: protectedPopulationRecord)<br>\nThis is a higher grade of secrecy which means the patient's official address is not registered in the national MPI</p>\n<p>The effect in an EHR would be similar, case 2 would probably not return an address from the national MPI, while 1 would. Both would probably be indicted with some sort of \"protected patient flag\" for the user, but maybe even the same flag for both.</p>",
        "id": 163171844,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1555059658
    },
    {
        "content": "<p>While we're at it, why limit a Patient discussion to the Nordics. At least many European countries must have similar requirements, and are trying to solve the same questions. </p>\n<p>Should we instead start a common Patient stream? </p>\n<p>At the moment questions that are relevant to this case are spread among Nordics, Ducth and Implementers stream (and probably others)</p>",
        "id": 163172150,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1555059942
    },
    {
        "content": "<p>There are indeed Dutch systems that capture similar information.</p>",
        "id": 163173183,
        "sender_full_name": "René Spronk",
        "timestamp": 1555060919
    },
    {
        "content": "<p>Resource.meta.security</p>",
        "id": 163175954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555063547
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> , have you solved this requirement yet for a Dutch context? If so, how?</p>",
        "id": 163180919,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1555068743
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> is security extendable? Danish needs involves a period in such a label</p>",
        "id": 163215962,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1555094614
    },
    {
        "content": "<p>you can extend it. How does having a period on that work? How can something be confidential for a time?</p>",
        "id": 163225926,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555102409
    },
    {
        "content": "<p>Ask a politician</p>",
        "id": 163249461,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1555132976
    },
    {
        "content": "<p>It is something that individuals can apply for</p>",
        "id": 163254771,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1555142901
    },
    {
        "content": "<p>Default duration is a year</p>",
        "id": 163254784,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1555142946
    },
    {
        "content": "<p>well I guess it would be an extension on the security label</p>",
        "id": 163283114,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555189064
    },
    {
        "content": "<p>Yep</p>",
        "id": 163284102,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1555190617
    },
    {
        "content": "<p>I would expect that to be part of a policy, not a tag. Tags are very powerful, but they are best when just asserting a fact. When one tries to encode policy into a tag, it will fail.  It is possible we have some fragment of the Consent resource, that is just the rule portion. You could then have a tag that is just indicating an instance of a rule, where the rule has the expiration dates in it... (Similar to business (medical safety) rules where data should not be disclosed to the patient until the GP has had a chance to speak directly to the patient about the conclusion of the lab result).</p>",
        "id": 163383329,
        "sender_full_name": "John Moehrke",
        "timestamp": 1555337935
    },
    {
        "content": "<p>these business rules are not enforced by tags, but rather by business rules that operate on values like the resource created date.</p>",
        "id": 163383371,
        "sender_full_name": "John Moehrke",
        "timestamp": 1555337986
    },
    {
        "content": "<p>I don't understand how you could put the agreed date for a patient in policy</p>",
        "id": 163415007,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555361392
    }
]