[
    {
        "content": "<p>Finland is currently passing legislation that includes the mandate for citizens to get access to their health data from the national Kanta registry, thgough apps. We've had a patient portal for viewing the data for many years, this change is about API access to that data.</p>",
        "id": 239859922,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621675908
    },
    {
        "content": "<p>Details are at <a href=\"https://www.eduskunta.fi/FI/vaski/HallituksenEsitys/Sivut/HE_212+2020.aspx\">https://www.eduskunta.fi/FI/vaski/HallituksenEsitys/Sivut/HE_212+2020.aspx</a> and <a href=\"https://www.eduskunta.fi/FI/vaski/HallituksenEsitys/Documents/HE_212+2020.pdf\">https://www.eduskunta.fi/FI/vaski/HallituksenEsitys/Documents/HE_212+2020.pdf</a>. Both in Finnish, but Google Translate might be your friend.</p>",
        "id": 239859963,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621675928
    },
    {
        "content": "<p>Especially:</p>\n<ul>\n<li>20 § Potilastietojen luovuttaminen valtakunnallisten tietojärjestelmäpalvelujen avulla Potilastiedot voidaan luovuttaa asiakkaalle hyvinvointisovelluksen tai kansalaisen käyttöliittymän kautta. Saadakseen tiedot hyvinvointisovellukseen potilaan tulee ottaa hyvinvointisovellus käyttöön ja hyväksyä tietojen luovutus. (page 167 in the PDF file, recitals pages 103-105) </li>\n<li>52 § Siirtymäsäännökset  Lain 20 §:n 4 momenttia sovelletaan hyvinvointisovellusten osalta viimeistään 1 päivänä joulukuuta 2022. (page 180 in the PDF file) </li>\n</ul>\n<p>In essence: <strong>citizens can download their patient data with an app. This shall be possible on December 1, 2022 at the latest</strong>.</p>",
        "id": 239859984,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621675951
    },
    {
        "content": "<p>We’ve made some noise about the existence of the IPA initiative, and have gotten good feedback, and IPA is present on architectural scetches on how this could be implemented (by Kela, the national institution responsible for implementation).</p>",
        "id": 239859992,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621675976
    },
    {
        "content": "<p>Surely, though, the legislation does not mention IPA, HL7, or even interoperability.</p>",
        "id": 239860053,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621676011
    },
    {
        "content": "<p>Now, in my view one risk is that if IPA is not considered to be “ready”, we’ll use something else instead – with no real interoperability with other systems.</p>",
        "id": 239860061,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621676038
    },
    {
        "content": "<p>Another risk is that we’ll take the IPA draft and fill in the missing gaps and adopt it to our needs freely and think it is IPA – with no real interoperability with other systems.</p>",
        "id": 239860100,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621676047
    },
    {
        "content": "<p><strong>Right now would be the time to state that there is this group of countries, ministeries, HL7 affiliates, companies, or individuals, either interested in or committed to working towards an interoperable IPA specification.</strong></p>",
        "id": 239860136,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621676061
    },
    {
        "content": "<p>We could then tie that activity to Kela’s implementation, and use that as the first reference implementation.</p>",
        "id": 239860145,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621676077
    },
    {
        "content": "<p>Why does this matter to me?</p>\n<ul>\n<li>As an app developer, I want to see a harmonized way of accessing health data, globally.</li>\n<li>The US already has a pretty good baseline with US Argonaut. Extended to Canada and UK? At least Apple Health is. We should aim to make this a global approach.</li>\n<li>Giving patients access to their data breaks down many of the barriers preventing data sharing today.</li>\n</ul>",
        "id": 239860227,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621676169
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span> <span class=\"user-mention\" data-user-id=\"192477\">@Thor Schliemann</span></p>",
        "id": 239860938,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1621677079
    },
    {
        "content": "<p>I support your thoughts Mikael. <br>\nThe Danish patient portal has also been in use for several years. Our challenge is several technologies for the integrations to the different databases (lab.reports, medication, documents, etc), why we also only have one patient App (made by the patient portal). A standardised IPA would ease a free market of patient Apps.<br>\nI see potential for areas like Copenhagen/Malmø, where cross-border access would be a logical next step.</p>",
        "id": 239873916,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1621691172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span> - it should be a fairly easy technical task to provide a IPA FHIR API around <a href=\"http://sundhed.dk\">sundhed.dk</a> (the patient portal) - it is not the tech choice that is the issue here, AFAIK.</p>",
        "id": 239873989,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1621691259
    },
    {
        "content": "<p>In case this was missed - based on the IPA/IPS discussion during the Connectathon, there is an <a href=\"https://jira.hl7.org/browse/PSS-1803\">official PSS for IPA</a>, this is an excellent time to provide feedback on it (instructions for reviewing a PSS are at <a href=\"https://confluence.hl7.org/display/HL7/How+to+Create+and+Review+a+Project+Proposal\">https://confluence.hl7.org/display/HL7/How+to+Create+and+Review+a+Project+Proposal</a>)</p>",
        "id": 239890774,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1621707780
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>!</p>\n<p>This is great timing. I'll try to get people in Finland activated to participate in the work in Patient Care, as it starts.</p>",
        "id": 239956614,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1621781722
    },
    {
        "content": "<p>This is the Project Proposal (the first phase).  Once that has been reveiwed and approved then the actual PSS will be submitted for approval (initially by the sponsoring WG and any co-sponsors) - Patient Care is proposed as the sponsoring WG (and I'm pretty certain that will be agreed to), as we want to have both IPS and IPS being developed and managed and working together as closely as possible.</p>",
        "id": 239987140,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621814002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> can you share the details of the IPA / IPS related call you mentioned?</p>",
        "id": 242079145,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1623250717
    },
    {
        "content": "<p>We're on the call right now at <a href=\"https://us02web.zoom.us/j/5328571160\">https://us02web.zoom.us/j/5328571160</a>.</p>",
        "id": 242079426,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623250809
    }
]