[
    {
        "content": "<p>To whom it may concern, a quote from my inbox:</p>\n<blockquote>\n<p>Call for Papers for pHealth 2017</p>\n<p>The next event in a series of very successful international conference on personalized health - pHealth 2017 - will happen from 12-14 May 2017 in Eindhoven, The Netherlands. </p>\n<p>Starting in 2003 as International Conference on Wearable Micro and Nano Technologies for Personalized Health, pHealth has evolved to a truly interdisciplinary meeting of international experts by combining medicine, technologies, biomedical engineering, legal, ethical, social and organizational aspects and impacts with basic research for enabling future care paradigms. Thereby, pHealth increasingly integrates medical services, public health and epidemiological monitoring, prevention, social and elderly care, nutrition, wellness and fitness for establishing participatory, predictive, personalized, preventive and effective care settings. Smart mobile systems, health apps, sensors native or attached to mobile phones available to eHealth and telemedicine are emerging as enablers for ubiquitous, pervasive health and the main components for the next wave of health services delivering integrated care.</p>\n<p>We cordially invite you to submit a paper by 17 January 2017. Accepted contributions will be published in the Conference Proceedings within the IOS Press Series “Studies in Health Technology and Informatics”, referenced, at Medline and PubMed, recognizing the contributions as international journal papers, as well as SciVerse, Scopus, EMCare, Book Citation Index - Science, and Thomson Reuters' Conference Proceedings Citation Index.</p>\n<p>More information can be found in the attached document as well as on the Conference Website <a href=\"http://www.phealth2017.eu/\" target=\"_blank\" title=\"http://www.phealth2017.eu/\">http://www.phealth2017.eu/</a></p>\n<p>On behalf of the Scientific Program Committee:<br>\nProf. Dr. habil. Bernd Blobel, FACMI, FACHI, FHL7, FEFMI<br>\nUniversity of Regensburg, Medical Faculty<br>\nFormer Head, eHealth Competence Center (eHCC)<br>\nEmail: <a href=\"mailto:bernd.blobel@klinik.uni-regensburg.de\" title=\"mailto:bernd.blobel@klinik.uni-regensburg.de\">bernd.blobel@klinik.uni-regensburg.de</a><br>\neHCC Archive: <a href=\"http://www.ehealth-cc.de\" target=\"_blank\" title=\"http://www.ehealth-cc.de\">http://www.ehealth-cc.de</a></p>\n</blockquote>",
        "id": 153865694,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1483619866
    }
]