[
    {
        "content": "<p>HL7 has changed the process for connectathon registration.  Previously, when you registered for the connectathon, your registration terminated at 12:30 on Sunday - so you weren't covered for lunch or the AID presentations/discussions on Sunday afternoon.  Starting at the Sept. 2017 WGM, if you register for the connectathon, your registration will be good until the end of day Sunday - so your lunch is paid for, as are the afternoon sessions.  So make your travel plans accordingly...</p>",
        "id": 153895243,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498502227
    },
    {
        "content": "<p>If you're (planning to) register for the FHIR connectathon in San Diego: the \"hands on\" connectathon part will be up to Lunch on Sunday (effectively 1.5 days); followed by the AID session Sunday PM.</p>\n<p>AID is effectively the 'HL7 software implementers user group', which regularly host a series of \"best practices/implementation experiences\" presentations on Sunday PM. Mostly we'll have around 8 to 10 speakers, and 50 attendees for this session. Quite often these presentations will be video recorded, e.g. see <a href=\"https://vimeo.com/channels/hl7aid/page:5\" target=\"_blank\" title=\"https://vimeo.com/channels/hl7aid/page:5\">https://vimeo.com/channels/hl7aid/page:5</a></p>\n<p>This session is both for, as well as by, software implementers - as such: if you have anything of interest to share with your fellow implementers, just let me (or Andy Stechishin, or James Agnew - the AID co-chairs) know and we'll make sure you'll have a spot on our agenda. The agenda is fairly empty right now, <a href=\"http://wiki.hl7.org/index.php?title=AID_201709_Meeting_in_San_Diego\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=AID_201709_Meeting_in_San_Diego\">http://wiki.hl7.org/index.php?title=AID_201709_Meeting_in_San_Diego</a> , but in our experience it'll fill up quickly the closer we get (in time) to the actual FHIR connectathon.</p>",
        "id": 153895286,
        "sender_full_name": "René Spronk",
        "timestamp": 1498549175
    }
]