[
    {
        "content": "<p>All: Participation in this chat is subject to the code of conduct of <a href=\"https://wiki.hl7.org/FHIR_Code_of_Conduct\" title=\"https://wiki.hl7.org/FHIR_Code_of_Conduct\">https://wiki.hl7.org/FHIR_Code_of_Conduct</a>. Please read it if you are not familiar with it. Note that HL7 has a slightly different Code of conduct found at <a href=\"http://www.hl7.org/legal/index.cfm?ref=nav\" title=\"http://www.hl7.org/legal/index.cfm?ref=nav\">http://www.hl7.org/legal/index.cfm?ref=nav</a> (see bottom of the page). That applies to phone calls etc, which deeply overlap what we do here. </p>\n<p>Obviously we should reconcile these - there's no real reason to have different codes, it's an accident of history. That'll force us to review both of them - let me know if you have any suggestions for change. </p>\n<p>In these particularly trying times, we've heard of some incidents where our phone calls are trending to be more difficult, and show less respect for each other. Please remember that respect for each other is a key enabler of everything that we do, and you should be able to say \"everyone I deal with can see that I respect my peers\".</p>",
        "id": 195779846,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588200692
    },
    {
        "content": "<p>I've seen a couple of private emails that suggest that some members of the community are forgetting the code of conduct, so this is a gentle reminder: </p>\n<p>HL7 is a community where we can always ask searching questions about technical matters, and the way decisions we might make impact on our various communities. In addition, HL7 and its participants are committed to a harassment-free environment for everyone, regardless of level of experience, professional background, gender, gender identity and expression, sexual orientation, disability, personal appearance, body size, race, ethnicity, age, religion, or nationality. Generally this should mean, there is no reason for those subjects to come up with regard to any specific person.</p>\n<p>Leaders in the HL7 community - including co-chairs - should lead by example here, and that includes calling out behavior that doesn't meet our code of conduct on Zulip or in teleconferences etc. </p>\n<p><a href=\"https://www.hl7.org/legal/code-of-conduct.cfm\">https://www.hl7.org/legal/code-of-conduct.cfm</a></p>",
        "id": 258300237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634694424
    }
]