[
    {
        "content": "<p>The FHIR management group is pleased to announce that registration for FHIR Connectathon 12 is now opened. This event will be held on the Saturday and Sunday (May 7-8) prior to the May WGM in Montreal, Quebec. </p>\n<p>Information about the upcoming Connectathon can be found at : <br>\n<a href=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_12\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_12\">http://wiki.hl7.org/index.php?title=FHIR_Connectathon_12</a><br>\nAt this site, there is general logistic information as well as descriptions of the proposed tracks that will be taking place at the Connectathon. This site also provides links to pages that provide details about each track and information about track leads. </p>\n<p>Registration for the Connectathon and the HL7 Working Group Meeting is available at: <a href=\"http://www.hl7.org/events/wgm052016/\" target=\"_blank\" title=\"http://www.hl7.org/events/wgm052016/\">http://www.hl7.org/events/wgm052016/</a>.</p>\n<p>FMG would also request that Connectathon participants submit information on a tracking spreadsheet  which will allow us to assure sufficient allocation of space and resources for the various tracks.<br>\n<a href=\"https://docs.google.com/spreadsheets/d/1gAnNmyurFDopLYJakQOtXWYGxvuoiDn49n8qRI5mlb4/\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/1gAnNmyurFDopLYJakQOtXWYGxvuoiDn49n8qRI5mlb4/\">https://docs.google.com/spreadsheets/d/1gAnNmyurFDopLYJakQOtXWYGxvuoiDn49n8qRI5mlb4/</a></p>",
        "id": 153819482,
        "sender_full_name": "Brian Pech",
        "timestamp": 1459458133
    },
    {
        "content": "<p>Subsequent to the actual connectathon (i.e. Sunday PM) the \"Application Implementation and Design (AID)\" HL7 User Group will meet to discuss FHIR implementation approaches and design patterns. You're invited to share your 'lessons learned' with others in the FHIR implementation community, or to listen to other FHIR implementers.</p>\n<p>See <a href=\"http://wiki.hl7.org/index.php?title=AID_201605_Meeting_in_Montreal\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=AID_201605_Meeting_in_Montreal\">http://wiki.hl7.org/index.php?title=AID_201605_Meeting_in_Montreal</a>  for details.</p>\n<p>I'd like to expecially invite the track leaders at the connectathon to join AID to inform the user community about the lessons learned (with respect to your track) during the connectathon.</p>\n<p>Please contact me to get hold of a slot on the AID agenda - we do appreciate you sharing your ideas and experiences.</p>\n<p>Your presentation will be video recorded, to inform the wider community of your experiences. See <a href=\"https://vimeo.com/channels/hl7aid\" target=\"_blank\" title=\"https://vimeo.com/channels/hl7aid\">https://vimeo.com/channels/hl7aid</a> for videos of earlier presentations.</p>",
        "id": 153820994,
        "sender_full_name": "René Spronk",
        "timestamp": 1460440619
    }
]