[
    {
        "content": "<p>Digital Square at PATH is pleased to announce the launch of its sixth Request for Applications – Notice F. Digital Square provides resources, advances technology, and fosters alignment to improve how countries and the global health community design, use, and pay for digital health tools and approaches.</p>\n<p>Through this funding, Digital Square collaborates with innovators to advance adaptable, replicable tools designed to work together seamlessly to improve health outcomes and close the health equity gap.</p>\n<p>The initiative is now accepting proposals on our open application platform in three areas:</p>\n<p>F0: Reference implementation of the World Health Organization (WHO) Antenatal Care Digital Adaptation Kit (Download)<br>\nF1: Adopting and adapting to WHO’s technical guidance on the Digital documentation of COVID-19 certificates for vaccine status (Download)<br>\nF2: Shelf readiness to build local capacity and new teams (Download)</p>\n<p>Digital Square will accept applications ranging from US $80,000-$150,000 for each of the three areas. All three requests for applications (RFAs) will utilize Digital Square’s open application platform. The applicant should post a preliminary concept note by December 1, 2021, at 5:00 pm EST to encourage commenting, collaboration, and engagement during the concept note phase. This timeframe will allow for co-creation during the following four weeks. We ask that you review the criteria and requirements carefully before submitting concept notes and applications.</p>\n<p>If this is your first time using the platform, please register for an account. The process is easy and only takes a minute. If you have any questions about using the platform, please reach out to Maria Soc (<a href=\"mailto:msoc@path.org\">msoc@path.org</a>). Applications must use the Digital Square-provided templates for the concept note, technical application, budget, and budget narrative.</p>\n<p>Fact-finding questions regarding any of the three RFAs will only be accepted via email to Maria Soc (<a href=\"mailto:msoc@path.org\">msoc@path.org</a>) through November 10, 2021, by 5:00 pm EST. Inquiries sent after this date cannot be accommodated. We will post responses to these questions on Digital Square's website by November 17, 2021. Please note that responses will not be confidential, except in cases where proprietary information is involved.</p>\n<p>We look forward to receiving your applications, which will be reviewed by the Peer Review Committee and the Investment Review Committee, and then ratified by Digital Square’s Board by March 2022.</p>\n<p>Thank you for your interest,<br>\nThe Digital Square Team</p>",
        "id": 260591802,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636313995
    }
]