[
    {
        "content": "<p>The schedule for the first edition of HL7 FHIR DevDays USA is online. Check out the website (<a href=\"https://www.fhirdevdays.com/boston/\" target=\"_blank\" title=\"https://www.fhirdevdays.com/boston/\">https://www.fhirdevdays.com/boston/</a>) and note that we added exciting US specific topics to the program: HSPC, Blue Button on FHIR, Public Health and Argonaut. FHIR DevDays is the prime educational event in the world, offering tutorials, hands-on sessions, as well as keynotes by John Halamka (Beth Israel), Eyal Oren (Google), Deven McGraw (Ciitizen) and Grahame Grieve (you know...). Ewout Kramer, Firely's CTO, is your host.</p>\n<p>Please keep in mind that the early bird deadline expires on May 18th and that we have a limited number of hotel rooms available at a discounted price. Register here: <a href=\"https://www.fhirdevdays.com/boston/registration/\" target=\"_blank\" title=\"https://www.fhirdevdays.com/boston/registration/\">https://www.fhirdevdays.com/boston/registration/</a>.</p>\n<p>FHIR DevDays USA 2018 is run by HL7 International and Firely (formerly Furore), and supported by the FHIR Foundation.</p>",
        "id": 153954492,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1524739709
    },
    {
        "content": "<p>I'd like to wish everyone safe travels as they head to Boston.  I'm staying back and look forward to hearing about the event through some Zulip channels.  Please keep the updates coming!</p>",
        "id": 153970266,
        "sender_full_name": "David Johnson",
        "timestamp": 1529329155
    },
    {
        "content": "<p>FHIR DevDays Amsterdam: Call for Presentations</p>\n<p>We are now preparing for HL7 FHIR DevDays Amsterdam 2018 (the fifth edition), running from 14 to 16 November. When we started DevDays we knew where and how FHIR was being applied. That is no longer the case. We're amazed by the projects that are going on. That is why we decided to reserve a limited number of 40 minute slots in the schedule for tutorials initiated by you, the FHIR community. </p>\n<p>If you have a topic that has learning value for the attendees, send me a direct message. Only tutorial-like presentations will qualify. If you have hands-on material to bring along, like a sandbox, exercises, documentation, that's certainly a plus. Please send me the title, summary and target audience of your tutorial. </p>\n<p>As a speaker you get free access to the event. </p>\n<p>Registration for DevDays Amsterdam is now open, by the way (<a href=\"https://bit.ly/2JfZSXU\" target=\"_blank\" title=\"https://bit.ly/2JfZSXU\">https://bit.ly/2JfZSXU</a>). FHIR DevDays Boston sold out, just so you know.</p>",
        "id": 153974878,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1531394197
    },
    {
        "content": "<p>DevDays is coming up soon. Have you registered yet? I just wrote about: <a href=\"http://www.healthintersections.com.au/?p=3037\">http://www.healthintersections.com.au/?p=3037</a></p>",
        "id": 199743648,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591276182
    },
    {
        "content": "<p>Good news! We published the DevDays Amsterdam 2019 recordings. Now more videos than ever. You can watch them all on the <a href=\"https://www.youtube.com/channel/UCH1DB1ZJbUdC5DOn110lZ_Q\">DevDays YouTube channel</a>.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"channel\" href=\"https://www.youtube.com/channel/UCH1DB1ZJbUdC5DOn110lZ_Q\"><img src=\"https://i.ytimg.com/vi/channel/default.jpg\"></a></div>",
        "id": 202666944,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1593682336
    }
]