[
    {
        "content": "<p>The ITS committee proposes to remove support for comments in the FHIR JSON format. For background, see <a href=\"http://www.healthintersections.com.au/?p=2569\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2569\">http://www.healthintersections.com.au/?p=2569</a></p>\n<p>This is the first breaking change to a FMM 5 level artefact, and so requires consultation with the implementers. In the absence of a formal system for this, and knowing that most implementers have implemented the JSON format, we are consulting with the community via this not (and a email to the FHIR email list) with a call for comments on this proposal.</p>\n<p>If you wish to comment on this change, please send an email to the FHIR email list before Octover 11th 2016. If you comment against this change, make sure you identify the production implementation that would be affected by the change, and how it would be affected.</p>",
        "id": 153850328,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474542126
    },
    {
        "content": "<p>Hi Grahame, we always use a FHIR C# connector as abstraction for (XML and JSON) messages, and we do not see value in transient comments; therefore, I applaud this proposal as a good step.</p>",
        "id": 153850330,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1474545359
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> may be do not remove comments, but make <code>metadata</code> like comments first class citizen in FHIR (i.e. do not  use xml comments, but special tag &lt;comment&gt; ? Like a <code>doc string</code> in python :) </p>",
        "id": 153850561,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1474640800
    },
    {
        "content": "<p>Discussion about the proposed changes should happen on the Implementer stream</p>",
        "id": 153850562,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474640986
    }
]