[
    {
        "content": "<p>NHS Digital have developed a Generic FHIR Receive capability. This is to share data on three workstreams: i) Transfer of Care, discharge summaries from Acute, A&amp;Eand Mental Health Trusts for discharge summaries &amp; outpatient clinic letters to GPs ii) GP Connect, to share encounter at Federated GP practice to patients registered GP practice iii) Digital Medicines, to share flu vaccine data with patients registered GP practice, soon to be followed by Emergency Medication issueGeneric FHIR Receive</p>",
        "id": 185692147,
        "sender_full_name": "James Walker",
        "timestamp": 1579090966
    },
    {
        "content": "<p>Digital Medicines have national Full Rollout Approval for Flu vaccination with one of 4 Community Pharmacy suppliers with TPP GP supplier</p>",
        "id": 185692247,
        "sender_full_name": "James Walker",
        "timestamp": 1579091044
    },
    {
        "content": "<p>Transfer of Care have signed off conditional DevMAC with TPP and EMIS. Vision to follow in March and Microtest in May/June. Entering into E2E 'live' testing with Acute Hospital sender Trusts in Feb/MArch</p>",
        "id": 185692348,
        "sender_full_name": "James Walker",
        "timestamp": 1579091154
    },
    {
        "content": "<p>Probably want a chat about this. Hopefully I'm starting a new project in a week and it looks like our information(/FHIR documents) send should use this but we will (/should) also have a requirement for notifications/actions messages.</p>",
        "id": 185985152,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1579334204
    },
    {
        "content": "<p>Let's meet to discuss how to take this forward. Anyone else interested in joining a call/online conference?</p>",
        "id": 186172598,
        "sender_full_name": "James Walker",
        "timestamp": 1579604714
    },
    {
        "content": "<p>Discussion elsewhere (probably <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a>) please</p>",
        "id": 186190992,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579618915
    },
    {
        "content": "<p>We're done for Generic FHIR @ Emis..... for the moment till there's more.... &amp; till we do the move t'cloud</p>",
        "id": 186660587,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1580112379
    },
    {
        "content": "<p>Might be better to move this to UK stream? </p>\n<p>I don't think we have one concept of what generic receive is (in the UK). From one perspective it sounds very similar to the US Da Vinci project, a way of sending alerts or notifications (not documents) to any provider. Another is a way of sending documents to GP providers via MESH (Generic receive and Transfer of Care), in some LHCRE's they are not using MESH using IHE-MHD FHIR Transactions via HTTP instead (of MESH).</p>",
        "id": 186666840,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1580118910
    },
    {
        "content": "<p>Please, no discussion on the announcements stream..</p>",
        "id": 186671690,
        "sender_full_name": "René Spronk",
        "timestamp": 1580122974
    }
]