[
    {
        "content": "<p>Hey all -- for those who haven't seen, HSPC is hosting a HIT Developers Conference 3/30-31. Details at <a href=\"https://www.developers.hspconsortium.org/events\" target=\"_blank\" title=\"https://www.developers.hspconsortium.org/events\">https://www.developers.hspconsortium.org/events</a></p>",
        "id": 153874458,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1488479258
    },
    {
        "content": "<p>Hi everyone! To elaborate on Josh's announcement about the HIT Developers Conference. The emphasis of this will be on SMART on FHIR. Representatives from Allscripts, Cerner, and Epic will all be presenting on their developer programs as well as their current and future SMART on FHIR capabilities, not to mention many other useful sessions on the topic. Would love to see you all there in New Orleans.  <a href=\"https://www.developers.hspconsortium.org/events\" target=\"_blank\" title=\"https://www.developers.hspconsortium.org/events\">https://www.developers.hspconsortium.org/events</a></p>",
        "id": 153874505,
        "sender_full_name": "Rick Freeman",
        "timestamp": 1488488457
    },
    {
        "content": "<p>Rick, I'll be there, looking forward to it!</p>",
        "id": 153874520,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1488492179
    },
    {
        "content": "<p>Hey all -- we will also be covering FHIR based Testing.  Join @Interopguy as we discuss the benefits of Test-Driven-Developoment (TDD), and the level of FHIR testing going on within the industry (DSTU 2.0 vs STU 3 implementation progress) - Patient Safety begins with Quality software.  </p>",
        "id": 153874988,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1488809630
    },
    {
        "content": "<p>Only 2 weeks to go until HSPC's first annual <strong>HIT Developers Conference</strong> happening <strong>March 30-31, 2017 in New Orleans, Louisiana</strong>! This year's conference will focus on the emerging <strong>SMART on FHIR ecosystem</strong> and will feature presentations from <strong>Allscripts, Cerner, Epic, SMART, HSPC</strong>, prominent providers, and HIT developers. ​</p>\n<p>As the name implies, this conference will be geared towards developers. We'll run sessions and panels with EHR vendors, developers, and FHIR community leaders, in order to help you:</p>\n<ul>\n<li>Learn about Allscripts, Cerner, and Epic's current SMART on FHIR and near-term capabilities, development resources, and details about their developer programs.</li>\n<li>Evaluate the existing SMART on FHIR community based developer tools (SDKs, tutorials and documentation, sandboxes, data creation and manipulation tools, testing frameworks, and app galleries).</li>\n<li>Hear from successful App Developers with panels such as: Lessons learned from getting a SMART on FHIR App into production.</li>\n<li>Discover the business side of getting apps into production (validation, contracts, etc.).</li>\n<li>Network with other Health IT application and platform developers.</li>\n</ul>\n<p>Registration is <strong>$199/attendee</strong> for the full conference. See the full agenda and additional information here: <a href=\"http://developers.hspconsortium.org/events\" target=\"_blank\" title=\"http://developers.hspconsortium.org/events\">http://developers.hspconsortium.org/events</a>. <strong>Register now, space is limited!</strong></p>",
        "id": 153877514,
        "sender_full_name": "Rick Freeman",
        "timestamp": 1489684405
    }
]