[
    {
        "content": "<p>#IHE New Publications</p>\n<p>Patient Identifier Cross-reference for Mobile (PIXm) - Rev. 3.0.0. This revision was created using the Implementation Guide publisher. This is an update of PIXm that was previously published in PDF form. This new publication is published in HTML form with a full set of conformance resources and examples. New functionality has been added to support a patient identity feed to inform the Patient Identity Manager of changes to patient identities.<br>\n<a href=\"https://profiles.ihe.net/ITI/PIXm/index.html\">https://profiles.ihe.net/ITI/PIXm/index.html</a></p>\n<p>Patient Demographics Query for Mobile (PDQm) - Rev. 2.3.0. This revision was created using the Implementation Guide publisher. This is an update of PDQm that was previously published in PDF form. This new publication is published in HTML form with a full set of conformance resources and examples. No new features were added.<br>\n<a href=\"https://profiles.ihe.net/ITI/PDQm/index.html\">https://profiles.ihe.net/ITI/PDQm/index.html</a></p>\n<p>Mobile Access to Health Documents (MHD) - Rev. 4.0.2. This revision updated the publication to use the new Implementation Guide template. No new functionality was added.<br>\n<a href=\"https://profiles.ihe.net/ITI/MHD/index.html\">https://profiles.ihe.net/ITI/MHD/index.html</a></p>\n<p>Mobile Care Services Discovery (mCSD) Use Cases White Paper - Rev. 1.1 . This white paper presents multiple use cases that mCDS supports.<br>\n<a href=\"https://profiles.ihe.net/ITI/papers/mCSD/index.html\">https://profiles.ihe.net/ITI/papers/mCSD/index.html</a></p>\n<h1>IHE Publications</h1>\n<p>These new publications are a part of the IHE family of Implementation Guide Profiles, and can be found at <a href=\"https://profiles.ihe.net\">https://profiles.ihe.net</a></p>\n<p>IHE is dedicated to the task of use-case driven Implementation Guide authoring, publication, maintenance, and testing. There is a long list of IHE Profiles (a form of Implementation Guide) supporting Healthcare IT workflows within and across the Healthcare space.</p>\n<h1>IHE Connectathon</h1>\n<p>These updated Implementation Guides will be available for formal product Interoperability testing at the upcoming IHE Connectathons <a href=\"https://www.ihe.net/participate/connectathon\">https://www.ihe.net/participate/connectathon</a>.</p>",
        "id": 261043548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636573318
    },
    {
        "content": "<p>from the #ihe stream:</p>\n<p>IHE IT-Infrastructure committee has been very busy this winter quarter. Today we release updates to 9 different publications:</p>\n<p>New Publication</p>\n<p>mCSD 3.5.0 - conversion from PDF to IG Publisher<br>\nMHDS 2.3.0 - conversion from PDF to IG Publisher<br>\nMetadata Handbook 2.1 - conversion from PDF to markdown/html<br>\nMinor/Patch update publications</p>\n<p>MHD 4.1.0 - minor updates<br>\nPDQm 2.4.0 - minor updates to fix bugs, id, and canonical uri<br>\nPIXm 3.0.2 - patch update to fix id<br>\nFormatCode 1.1.0 - minor updates to Rad, and canonical URI<br>\nPublic Comment</p>\n<p>Basic Audit 1.0.1<br>\nmCSD 3.6.1 - updates to support MHD-to-a-Federation work item<br>\nAlso</p>\n<p>ITI Technical Framework - patch to typos<br>\naddition of above Basic Audit IG<br>\nPCC index fixes<br>\nexperimental RSS feed for new FHIR releases<br>\nFind all of this at <a href=\"https://profiles.ihe.net\">https://profiles.ihe.net</a></p>",
        "id": 273871659,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1646252877
    }
]