[
    {
        "content": "<p>Hi Guys,</p>\n<p>Just a reminder that the next Working Group Meeting is approaching us, and with it a FHIR Connectathon! The event will be held in San Antonio over the weekend of Jan 13/14 (immediately preceding the WGM – here’s a link to details: <a href=\"http://www.hl7.org/events/wgm012017/\" target=\"_blank\" title=\"http://www.hl7.org/events/wgm012017/\">http://www.hl7.org/events/wgm012017/</a>.</p>\n<p>Many of you have already attended one of these events, but for those who haven’t, they are an integral part of the overall FHIR development process being a practical event where we get together and test out proposed changes to the standard to ensure they are fit for purpose. They are also a great networking event – last time we had almost 200 people attending.</p>\n<p>The event itself is divided into a number of tracks and you’re free to choose whatever track interests you – more than one if you have the capacity (though most will focus on a single one). Here are the tracks this time around: <a href=\"http://wiki.hl7.org/index.php?title=Category:201701_FHIR_Connectathon_Track_Proposals\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Category:201701_FHIR_Connectathon_Track_Proposals\">http://wiki.hl7.org/index.php?title=Category:201701_FHIR_Connectathon_Track_Proposals</a></p>\n<p>Note that the Patient track, which provides a 'friendly introduction' for those new to FHIR, will also have a semi-formal testing and test result reporting component to it.  We encourage all of you to participate in the semi-formal testing, as it should only take a few minutes to complete and will help us bring additional value to future connectathon events.</p>\n<p>One of the challenges we face as the event continues to grow is providing the opportunity for people to show off all the great things they have achieved during the event. It’s only a day and a half, so there’s not a lot of time free.</p>\n<p>However, on the Sunday afternoon there are a couple of sessions that are provided specifically for people to present FHIR work they have done, so we would encourage you to take advantage of this to share your work with the community. Indeed, if you’re new to FHIR you might to think about attending the tutorials on FHIR at the actual WGM – there are 5 of them (<a href=\"http://www.hl7.org/events/wgm012017/tutorials.cfm\" target=\"_blank\" title=\"http://www.hl7.org/events/wgm012017/tutorials.cfm\">http://www.hl7.org/events/wgm012017/tutorials.cfm</a> )</p>\n<p>If you are interested in presenting on the Sunday afternoon, then contact Rene Spronk at (<a href=\"mailto:rene.spronk@ringholm.com\" title=\"mailto:rene.spronk@ringholm.com\">rene.spronk@ringholm.com</a>) to reserve your slot.</p>\n<p>We look forward to meeting you in San Antonio</p>\n<p>David Hay &amp; Lloyd McKenzie</p>",
        "id": 153863649,
        "sender_full_name": "David Hay",
        "timestamp": 1481837339
    }
]