[
    {
        "content": "<p>Dear colleague</p>\n<p>It's again my pleasure to remind you of the 15th FHIR Connectathon that is coming up on the Saturday/Sunday 6/7 May just before the next HL7 Working Group Meeting in Madrid, Spain. Here's the link to the WGM: <a href=\"http://www.hl7.org/events/working_group_meeting/2017/05/\" target=\"_blank\" title=\"http://www.hl7.org/events/working_group_meeting/2017/05/\">http://www.hl7.org/events/working_group_meeting/2017/05/</a></p>\n<p>Here's the wiki page that describes the connectathon in more detail:  <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_15\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_15\">http://wiki.hl7.org/index.php?title=FHIR_Connectathon_15</a></p>\n<p>We have 9 tracks this time around, and the event is based on FHIR release 3:</p>\n<ul>\n<li>Patient Track (particularly suitable for FHIR newcomers)</li>\n<li>Workflow Track</li>\n<li>CDS Hooks</li>\n<li>FHIR Genomics</li>\n<li>Devices on FHIR</li>\n<li>Clinical Reasoning</li>\n<li>Terminology</li>\n<li>Financial Track</li>\n<li>Structured Data Capture</li>\n<li>Clinical Research</li>\n<li>Data Analytics</li>\n</ul>\n<p>so there's plenty to choose from. </p>\n<p>Each of the tracks has a detailed description of what it is trying to achieve - the roles and the scenarios being tested. In addition, there is a track lead that you can talk to for more information about the track- generally there a place for people new to the track, and those who have done one before. The connectathon wiki page above has links to these descriptions - definitely worth a look. The last item - Data Analytics is a bit different, less focussed on developers and more in informatics.</p>\n<p>For those who haven't been to a connectathon before, they serve a number of purposes. First and foremost they are way to ensure that FHIR meets the needs of implementers by testing it using real-world scenarios. But they are a great way of meeting the folk most active in the community and having the opportunity to talk with them in person. The Patient track in particular is a good choice for someone new to the event as it is quite straight forward, but also good for people interested in testing, as we're using that that track to exercise the automated testing. </p>\n<p>Feel free to email me if you have any questions, otherwise I look forward to meeting you in Madrid!</p>\n<p>cheers...</p>",
        "id": 153880343,
        "sender_full_name": "David Hay",
        "timestamp": 1490833565
    },
    {
        "content": "<p>BTW - check out the Connectathon Stream in this chat for more detail, and the ability to communicate with the track lead,  on each track...</p>",
        "id": 153880344,
        "sender_full_name": "David Hay",
        "timestamp": 1490833657
    },
    {
        "content": "<p>And after participating in a track during the connectathon in Madrid, please share your implementation experiences and best practices with your fellow implementers - on Sunday PM (just after the connectathon has finished) AID&amp;FHIR will host a series of 20-minute presentations, see agenda at <a href=\"http://wiki.hl7.org/index.php?title=AID_201705_Meeting_in_Madrid#Sunday_Q3.2FQ4_.28joint_with_FHIR.29\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=AID_201705_Meeting_in_Madrid#Sunday_Q3.2FQ4_.28joint_with_FHIR.29\">http://wiki.hl7.org/index.php?title=AID_201705_Meeting_in_Madrid#Sunday_Q3.2FQ4_.28joint_with_FHIR.29</a></p>\n<p>We already have a series of presentations on the agenda; the primary focus will be on 'the creation of a FHIR interface for a legacy database' - but should you have another FHIR-implementation topic please let me know - we have a few slots left in our agenda.</p>\n<p>Please consider sharing your experiences - because only by sharing you'll be able to learn something.</p>",
        "id": 153880950,
        "sender_full_name": "René Spronk",
        "timestamp": 1491374415
    },
    {
        "content": "<p>Dang! I keep forgetting to mention that! Sorry Rene...</p>",
        "id": 153880953,
        "sender_full_name": "David Hay",
        "timestamp": 1491379705
    },
    {
        "content": "<p>If you're making preparations for the FHIR connectathon in Madrid, please consider sharing your implementation experiences and best practices with your fellow implementers - on Sunday PM (just after the connectathon has finished). Or just attend the presentations, usually we have 50 attendees during these Sunday PM sessions.  The presentations will be in the Estrasburgo room, just accross the hall from the connectathon room (Londres).</p>\n<p>See draft agenda at <a href=\"http://wiki.hl7.org/index.php?title=AID_201705_Meeting_in_Madrid#Sunday_Q3.2FQ4_.28joint_with_FHIR.29\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=AID_201705_Meeting_in_Madrid#Sunday_Q3.2FQ4_.28joint_with_FHIR.29\">http://wiki.hl7.org/index.php?title=AID_201705_Meeting_in_Madrid#Sunday_Q3.2FQ4_.28joint_with_FHIR.29</a><br>\nWe already have a series of presentations on the agenda (but we expect to add a few more); the primary focus will be on 'the creation of a FHIR interface for a legacy database' . The presentations are technical/architectural in nature.</p>\n<p>The presentations will be video recorded as well, see <a href=\"https://vimeo.com/channels/hl7aid\" target=\"_blank\" title=\"https://vimeo.com/channels/hl7aid\">https://vimeo.com/channels/hl7aid</a> for recordings of previous presentations. </p>",
        "id": 153886976,
        "sender_full_name": "René Spronk",
        "timestamp": 1493893853
    },
    {
        "content": "<p>The C#/Java API user group discussions will take place at the Burdeos room, from 20:00 till \"late\"......</p>",
        "id": 153888100,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1494224696
    }
]