[
    {
        "content": "<p>Da Vinci is funding reviewers of our IGs. We need well qualified reviewers. There are muliple IGs to review, so please review the RFI below and complete the attached forms. </p>\n<p>HL7 Request for Information: New Program for Subsidized Review of Ballot Documents<br>\n1.0 PROJECT WORK OVERVIEW<br>\n1.1 PROJECT NAME<br>\nSubsidized Review of Da Vinci Implementation Guides<br>\n1.2 DATE OF ANNOUNCEMENT RELEASE<br>\nThis RFI is released for public review on February 11, 2019. Applicants are encouraged to reply as early as possible as some assignments will be awarded as soon as qualified applicants are identified. All proposals for consideration for the current ballot cycle must be received no later than 5:00 pm Eastern Time in the USA on March 1, 2019. Da-Vinci-Project-Reviewer-Application-Form.docx Da-Vinci-Project-Reviewer-Application-Form.pdf HL7_RFI_DaVinci_IG_Reviewers.pdf <br>\n1.3 CONTRACT PERIOD<br>\nApplicants will be submitting qualifications for consideration in the May ballot cycle. Applicant credentials will be retained on file for one year for possible consideration in future ballot cycles should additional funding be available for future subsidized reviews, a contract will be awarded for up to one year to qualified applicants upon issuance of an initial review assignment, and additional reviews may be assigned under this contract for the contract period. A contract may be renewed for a subsequent year upon submission of updated credentials. <br>\n2.0 SCOPE OF WORK<br>\nIn an effort to reduce the impact on the HL7 membership of conducting a comprehensive ballot review for an especially large number of Implementation Guides (IGs) planned by the Da Vinci project, HL7 and Da Vinci are introducing a new program to subsidize the effort of reviewing certain upcoming ballot documents (the ‘program’).</p>\n<p>Under this program, a number of qualified reviewers will be assigned to perform a detailed technical and editorial review of Da Vinci FHIR IGs, and report suggested changes to the Work Group and the Da Vinci project leadership.</p>\n<p>The program allows HL7 members to apply to join a roster of eligible reviewers, be assigned to review specific IGs when available, and receive a stipend upon successful completion of each review.</p>\n<p>The program will, in most cases, incorporate two rounds of review. <br>\n• The first round occurs between initial and final content submission for the ballot and submission must be completed within 5 business days and work submitted by no later than Noon EST on March 1, 2019 so the product can be finalized for ballot. <br>\n• The second round will occur during the balloting process and require completing the review and submitting comments within the first two weeks of the ballot cycle (i.e., by April 12, 2019) to allow the project teams to review the comments and focus on any identified issues.</p>\n<p>Reviewers may only participate in one round for each document, so that a maximum of 4 different subsidized reviewers will examine each IG.</p>\n<p>It is anticipated that reviewers will spend 1-2 days per document, and they may apply to review more than one document during each review period if time permits.</p>\n<p>Specific review requirements:<br>\n1. Attend a joint overview meeting with IG developers for orientation and discussing any specific review focus areas<br>\n2. Read through the guide for clarity of the narrative sections and comment on what areas need more narrative explanation or additional links to supportive content<br>\n3. Identify missing information or information that needs to be added or clarified to complete the IG<br>\n4. Check hyperlinks (links to free automated tools for this will be provided)<br>\n5. Identify sections (resource/operations) where the usage or explanations is inconsistent with the base FHIR specifications or other similar/related IGs<br>\n6. Review any new profiles created as part of the IG<br>\n7. Review examples for accuracy and completeness<br>\n8. Provide a written report which should be sufficiently detailed to allow correction of any significant issues. <br>\nIn addition, the reviewer should be prepared to spend 1 hour with the sponsoring Work Group reviewing the recommendations and answering questions and may be asked to enter unresolved issues into Tracker or JIRA.<br>\n2.1 QUALIFICATIONS<br>\nReviewers must be members of HL7 in good standing, provide a current resume, and submit the attached form documenting qualifications and experience in a significant number of the following areas:<br>\n1. Creation of FHIR IGs<br>\n2. CDS Hooks<br>\n3. FHIR operations affecting application behavior<br>\n4. Clinical and payer-provider workflow<br>\n5. SMART on FHIR solutions<br>\n6. CQL<br>\n7. Argonaut / US Core / QI Core profiles<br>\n8. Profiling FHIR resources<br>\n9. Creating FHIR extensions<br>\n10. Creating FHIR IGs to support multiple versions of FHIR (DSTU2/STU3/R4)<br>\n11. Typical US Terminologies and Values Sets <br>\n12. Implementing FHIR solutions and in particular implementation guides<br>\n13. Participation in at least one FHIR Connectathon<br>\n14. Vocabularies<br>\nIn addition to defining their qualifications, applicants will also be asked to list any Da Vinci related IGs and projects they’ve participated in which would preclude them from reviewing associated IGs. Individuals who have been directly involved in the creation of a Da Vinci IG are not eligible to perform the review of the same IG.</p>\n<p>Qualified individuals must be approved by the Sponsoring Work Group and HL7 leadership. Once qualified, an individual may apply for as many reviews as they can accommodate.</p>\n<p>Generally, eligible reviewers will be assigned on a first come basis for each IG, and will be invited as soon as the IG becomes available (for the initial reviews) or at the beginning of the ballot period (for secondary reviews). <br>\n2.2 COMPENSATION<br>\nCompensation is fixed as a stipend – typically either $1,000 or $1,500 for a complete review (based upon expected complexity) which will be paid upon completion of each satisfactory review. In some cases, experts may be asked to conduct a limited review of a particular area for a lesser fee.<br>\n3.0 SELECTION PROCESS / DATE OF SELECTION<br>\nThe Selection Panel will consist of subject matter experts HL7 balloting, implementation guides and Da Vinci team members.</p>\n<p>As they are received, a Selection Panel will review each application to assess qualifications and rank applicants.</p>\n<p>Selected applicants will be notified as soon as possible given the May 2019 ballot cycle opens soon<br>\n4.0 HOW TO OBTAIN FURTHER INFORMATION<br>\nDirect any questions to: <br>\nDavid Hamill, HL7’s Director of Project Management Office at <a href=\"mailto:PMO@HL7.org\" title=\"mailto:PMO@HL7.org\">PMO@HL7.org</a>. <br>\nThe <a href=\"mailto:contractwork@lists.hl7.org\" title=\"mailto:contractwork@lists.hl7.org\">contractwork@lists.hl7.org</a> list service informs potential contactors of work to be contracted out by HL7 International. If you have received this announcement by a means other than this list, you should sign up for the free HL7 List Service at: <br>\n<a href=\"http://www.hl7.org/special/committees/list_sub.cfm?list=contractwork\" target=\"_blank\" title=\"http://www.hl7.org/special/committees/list_sub.cfm?list=contractwork\">http://www.hl7.org/special/committees/list_sub.cfm?list=contractwork</a></p>\n<p>Any updates to this contract work announcement, additional announcements or information will be posted to that list and will reference the contract name.<br>\n5.0 HOW TO SUBMIT YOUR PROPOSAL<br>\nIf you are interested in joining this program, please complete the attached form with a resume and submit via email to <a href=\"mailto:PMO@HL7.org\" title=\"mailto:PMO@HL7.org\">PMO@HL7.org</a> (do NOT provide submissions to the contract work listserv). </p>\n<p><a href=\"/user_uploads/10155/oJ5EX6dEQwn4xiR_uEr0wetk/Da-Vinci-Project-Reviewer-Application-Form.docx\" target=\"_blank\" title=\"Da-Vinci-Project-Reviewer-Application-Form.docx\">Da-Vinci-Project-Reviewer-Application-Form.docx</a> <a href=\"/user_uploads/10155/mASXchMvUBpXgKhItWz1Lq2K/Da-Vinci-Project-Reviewer-Application-Form.pdf\" target=\"_blank\" title=\"Da-Vinci-Project-Reviewer-Application-Form.pdf\">Da-Vinci-Project-Reviewer-Application-Form.pdf</a> <a href=\"/user_uploads/10155/8bD_mynPcU829Jtf0s4WB0O-/HL7_RFI_DaVinci_IG_Reviewers.pdf\" target=\"_blank\" title=\"HL7_RFI_DaVinci_IG_Reviewers.pdf\">HL7_RFI_DaVinci_IG_Reviewers.pdf</a></p>\n<p>David Hamill <br>\nDirector, Project Management Office<br>\nHealth Level Seven International <br>\n3300 Washtenaw Ave, Suite 227<br>\nAnn Arbor, MI 48104 <br>\nPh: +1 (734) 677-7777 x142 <br>\nFax: +1 (734) 677-6622 <br>\n<a href=\"http://www.HL7.org\" target=\"_blank\" title=\"http://www.HL7.org\">www.HL7.org</a></p>",
        "id": 159105928,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1550784474
    },
    {
        "content": "<p>Just reminding everyone of the Friday (3/1) deadline to participate in this program. This is a great opportunity to contribute to the development of high quality implementation guides.  <br>\nViet Nguyen, MD. Da Vinci Technical Director</p>",
        "id": 159563343,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1551310002
    }
]