[
    {
        "content": "<p>VSAC Intensional Definition Functionality<br>\nPlease see any discussion on the Terminology Stream <a href=\"#narrow/stream/48-terminology/subject/VSAC.20introduces.20Intensional.20definitions\" title=\"#narrow/stream/48-terminology/subject/VSAC.20introduces.20Intensional.20definitions\">here</a></p>\n<p>The National Library of Medicine (NLM) Value Set Authority Center (VSAC), with support from the Centers for Medicare and Medicaid Services (CMS), is pleased to announce the launch of Intensional Value Set Definition Functionality in the VSAC Authoring Tool.</p>\n<p>Through the VSAC Authoring user interface, value set authors can algorithmically define value sets with logical rule-based Boolean clauses and hierarchy operators, leveraging the structure and hierarchies of terminologies. Logically-defined value sets, combined with the value set author’s guidance, can incorporate future changes as terminologies evolve to add or remove concepts, increasing efficiency and accuracy of value set creation and maintenance.</p>\n<p>An example of a rule-based value set could be: include all codes that are descendantsOf the SNOMED CT® code for ‘Clinical finding’, exclude all codes that are descendantOrSelfOf of ‘Wound finding’.</p>\n<p>This first deployment of VSAC Intensional Functionality provides support for hierarchy functions for several terminologies. Later in 2019 we will add intensional functionality for more terminologies, including RxNorm and LOINC®.</p>\n<p>You can learn more in our VSAC Support Center: <a href=\"https://www.nlm.nih.gov/vsac/support/authorguidelines/createvs.html\" target=\"_blank\" title=\"https://www.nlm.nih.gov/vsac/support/authorguidelines/createvs.html\">Create an Intensional Value Set</a></p>\n<p>You can contribute to the improvement of this application by sending feedback and ideas to the <a href=\"https://support.nlm.nih.gov/\" target=\"_blank\" title=\"https://support.nlm.nih.gov/\">NLM Support Center</a>. We especially would love to hear from you about specific intensional value sets you want to be able to create in VSAC in the future using RxNorm or LOINC.</p>",
        "id": 154026918,
        "sender_full_name": "Robert McClure",
        "timestamp": 1545401758
    }
]