[
    {
        "content": "<p>The FHIR Management Group (FMG) has been discussing progress towards completing the committee and editorial work that is required to be prepared for the forthcoming STU3 milestone. It's clear that though all the committees and editors are working really hard, there is just much more work to be done than we anticipated in Baltimore, and trying to keep to our original schedule - see <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep\">http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep</a> - would involve unacceptable sacrifice of completeness in ballot reconciliation and the detailed quality work that is necessary. </p>\n<p>As a consequence, FMG is considering a new schedule with a release date in late February 2017. Before we commit to this - is there any projects that will be hurt by this change in deadline? What other prices to do people think there might be? </p>\n<p>Note that there will still be a candidate frozen version at the start of december to support balloting on some implementation guides; this will contain as much of the breaking changes for STU3 as we can get into it - but we won't be able to make any guarantees, of course. </p>\n<p>However, If this change of plans creates a problem for a project, we may consider prioritising some particular work - or we could reconsider changing the delivery dates, if the community is overwhelming in support for not changing the date - but note that this won't magically mean the committees can get their work done in time.</p>\n<p>Here's your opportunity to comment - you can comment in the implementers stream, or communicate with me directly. </p>",
        "id": 153855238,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478166415
    },
    {
        "content": "<p>Not on the Devices (DoF) front ... in fact - it would really help and like you said, reflect reality!</p>",
        "id": 153855850,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1478572808
    }
]