[
    {
        "content": "<p>Michigan had several large storms last night, and we at HQ have lost power.  Current estimate to have power on, will be late this evening.</p>",
        "id": 216883317,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1605539302
    },
    {
        "content": "<p>We are still in process of bringing back online. Local power was restored but local ISP's are still experiencing outage. Will update as it continues. Thanks for your patience!</p>",
        "id": 216942709,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1605566264
    },
    {
        "content": "<p>Connectivity restored at HL7 HQ. If you have any problems logging into <a href=\"http://hl7.org\">hl7.org</a> please contact <a href=\"mailto:webmaster@hl7.org\">webmaster@hl7.org</a>.</p>",
        "id": 216946318,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1605568478
    },
    {
        "content": "<p>Due to weather-related power (and HQ -based systems) outages on Thursday August 12 in the Ann Arbor HL7 HQ office, with initial restoration estimates through Friday the 13th, some users had difficulty signing up for consensus groups. Since many users frequently enroll on the last day, two more days have been added to the sign-up period and the ballot voting period postponed by the same period to accommodate all users wishing to enroll.</p>\n<p>Consensus Group Sign-Up Open Date: Tuesday, July 12, 2021</p>\n<p>Consensus Group Sign-Up Close Date: <em>new</em> Saturday, August 14, 2021</p>\n<p>Important Note: Consensus group signup closes when ballot voting begins. </p>\n<p>Consensus group enrollment will be available from a date at least four weeks preceding the ballot vote opening date and will continue until the opening of voting.  While the exact dates are dependent upon individual ballot open and close dates, in general the consensus group signup period dates are as follows:</p>\n<p>Ballot Open Date: Sunday, August 15, 2021</p>\n<p>Ballot Close Date: Wednesday, September 15, 2021</p>",
        "id": 249288247,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1628799863
    }
]