[
    {
        "content": "<p>We are looking for a way forward around future release planning. Our considerations:</p>\n<ul>\n<li>we need to find a way to allow immature content to cycle through the maturity process faster than the mature / normative content</li>\n<li>we don't want to throw lots of new releases of mature content at the market </li>\n<li>we don't want to create a process that we can't manage internally (either workload or quality issues)</li>\n<li>we want a process that will make it possible for e.g. the reference implementations to keep up and make it reasonable for the relevant parties to do the work that delivers on the maturity process</li>\n</ul>\n<p>If you are interested in this, we are discussing this here: <a class=\"stream\" data-stream-id=\"250700\" href=\"/#narrow/stream/250700-R4A.2FB.2FR5-Discussion\">#R4A/B/R5 Discussion</a></p>",
        "id": 206868984,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597351535
    },
    {
        "content": "<p>Following up on this, the outcome of the R4B/R5 discussion has been as follows:</p>\n<ul>\n<li>We <em>will</em> proceed with an R4B (name and formal version number still to be determined).  That release will be based on the current technical correction release of R4 and will contain a very limited set of new and updated resources.  The target timeframe for initial ballot is the January 2021 cycle, with publication in Q2 2021.  (The timeframe may be impacted by tooling changes intended to make it easier to port resource definitions across branches.)  The scope will definitely include the MedicationDefinition and evidence-based-medicine resources.  Work groups are asked to identify any additional changes that have regulatory or other urgent drivers that simply cannot wait for the R5 release.  Be aware that the FMG will be trying to keep a very tight reign on the content of this release</li>\n<li>The R5 process is expected to start in the May 2021 ballot cycle with a \"for comment\" ballot to confirm the normative scope for R5.  The formal normative and STU ballots will occur in the Sept. 2021 cycle, with a likely out-of-cycle second normative ballot in the Nov/Dec. 2021 timeframe with final publication in Q2 of 2022.<br>\nAs always, timeframes are subject to change, most typically base on balloter feedback.  Discussion and questions can happen <a href=\"#narrow/stream/250700-R4A.2FB.2FR5-Discussion\">here</a></li>\n</ul>",
        "id": 211010521,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600871038
    }
]