[
    {
        "content": "<p><a href=\"https://onfhir.hl7.org/2019/01/20/fhir-r5-roadmap/\" target=\"_blank\" title=\"https://onfhir.hl7.org/2019/01/20/fhir-r5-roadmap/\">https://onfhir.hl7.org/2019/01/20/fhir-r5-roadmap/</a></p>",
        "id": 156495309,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548014151
    },
    {
        "content": "<p>Based on overall feedback from the community, R5 will be proceeding to ballot strictly as an ‘STU’ release with no new normative content.  This means the following:</p>\n<ul>\n<li>\n<p>All portions of the specification are open for change<br>\n-- Changes to any page or artifact that is currently ‘normative’ is restricted to our rules for normative change</p>\n</li>\n<li>\n<p>Normative content remains normative</p>\n</li>\n<li>All changes to portions of the specification that are normative will be considered to be STU<br>\n-- Those changes could be reversed or changed in non-backward compatible ways in a future ballot<br>\n-- We will be following the rules for STU balloting, meaning that substantive change does not force going back to ballot</li>\n</ul>\n<p>R5 will not be proceeding to ballot at the same time as other FHIR IGs.  Instead we will be going to ballot either early in the cycle (content freeze June 20 - shortly after DevDays) or late in the cycle (content freeze Aug. 15, ballot opening Sept. 12.)  The FMG will confirm the timeline in early April based on current progress.</p>\n<p>In either case we’d be looking to publish sometime in Q1, 2023.</p>\n<p>As we look forward to R6, R6 definitely <em>will</em> endeavor to take additional content to normative (including any changes made to normative artifacts as part of R5.)  Barring another worldwide pandemic or other disaster, R6 would aim to begin its ballot process after 2 years of STU experience with R5, which would mean an initial May 2025 cycle, with an intention to publish R6 in Q1, 2026.</p>",
        "id": 276403778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648071247
    },
    {
        "content": "<p>Discussion on <a class=\"stream\" data-stream-id=\"179160\" href=\"/#narrow/stream/179160-social\">#social</a></p>",
        "id": 276403810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648071263
    }
]