[
    {
        "content": "<p>If you're (planning to) register for the FHIR connectathon in San Diego: the \"hands on\" connectathon part will be up to Lunch on Sunday (effectively 1.5 days); followed by  a series of \"best practices/implementation experiences\" presentations on Sunday PM (formally hosted by AID&amp;FHIR). This PM session doesn't require separate registration and has no additional fee associated with it.</p>\n<p>Mostly we'll have around 8 to 10 speakers, and 50 attendees for this session. Quite often these presentations will be video recorded, e.g. see <a href=\"https://vimeo.com/channels/hl7aid/page:5\" target=\"_blank\" title=\"https://vimeo.com/channels/hl7aid/page:5\">https://vimeo.com/channels/hl7aid/page:5</a></p>\n<p>This session is both for, as well as by, software implementers - as such: if you have anything of interest to share with your fellow implementers, just let me (or Andy Stechishin, or James Agnew - the AID co-chairs) know and we'll make sure you'll have a spot on our agenda. We currently have 3 speakers lined up (one of them is Grahame, see <a href=\"http://wiki.hl7.org/index.php?title=AID_201709_Meeting_in_San_Diego\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=AID_201709_Meeting_in_San_Diego\">http://wiki.hl7.org/index.php?title=AID_201709_Meeting_in_San_Diego</a>  ), but in our experience it'll fill up quickly the closer we get (in time) to the actual FHIR connectathon.</p>\n<p>Don't think you've got nothing worth sharing - if you participate in a track, the focus of your talk could be on the outcomes of your testing. If you're new to FHIR, what did you learn from your implementation and the connectathon?  If you're well experienced with FHIR - what didn't work (most people tend not to talk about that aspect, whereas it tends to be very helpful) and what worked ? Remember: \"the value of information increases when it is shared\"..</p>",
        "id": 153903184,
        "sender_full_name": "René Spronk",
        "timestamp": 1503396046
    }
]