[
    {
        "content": "<p>There's a new security report about FHIR API &amp; App security problems in USA based data aggregator systems. Media write up: <a href=\"https://www.scmagazine.com/analysis/application-security/critical-flaws-found-in-interoperability-backbone-fhir-apis-vulnerable-to-abuse\">https://www.scmagazine.com/analysis/application-security/critical-flaws-found-in-interoperability-backbone-fhir-apis-vulnerable-to-abuse</a> (not entirely accurate). Actual report: <a href=\"https://approov.io/for/playing-with-fhir/\">https://approov.io/for/playing-with-fhir/</a></p>\n<p>Nothing found is inherent to FHIR, and it's all basic housekeeping stuff, found on the OWASP top ten list. It's not clear from the base report but at least some of the systems are subject to HIPAA, though perhaps some aren't.</p>\n<p>I'm sure that the devs for these aggregator systems are on this forum. If it's you: clean up your house ASAP. Alissa is a white hat hacker but the black hats are coming after you today. You might consider taking your service down while you get on top of this. </p>\n<p>Note: Congratulations to the base EHR systems, none of whom featured in this report (and not because they weren't of interest)</p>",
        "id": 257446208,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634162692
    },
    {
        "content": "<p>follow up here: <a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/WITM\">https://chat.fhir.org/#narrow/stream/179247-Security-and.20Privacy/topic/WITM</a></p>",
        "id": 257446515,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634162833
    },
    {
        "content": "<p>Note that the report won't be sent to a gmail email address - don't know why that would be. :(</p>\n<div class=\"codehilite\"><pre><span></span><code>Please enter your business email address. This form does not accept addresses from gmail.com.\n\nPlease change your email address to continue.\n</code></pre></div>",
        "id": 257566012,
        "sender_full_name": "David Hay",
        "timestamp": 1634229648
    }
]