[
    {
        "content": "<p>Just a reminder to everyone that there's about two weeks left to sign up as a balloter for the upcoming FHIR ballots.  If you're an HL7 voting member, you can sign up for free by going to the <a href=\"http://www.hl7.org/participate/onlineballoting.cfm?ref=common\" target=\"_blank\" title=\"http://www.hl7.org/participate/onlineballoting.cfm?ref=common\">Ballot Desktop</a>.  If you're <em>not</em> an HL7 voting member, you might <a href=\"http://www.hl7.org/participate/membership/index.cfm?ref=nav\" target=\"_blank\" title=\"http://www.hl7.org/participate/membership/index.cfm?ref=nav\">consider becoming one</a> (because it's an aweseome thing to be).  However, there is also an ability for <a href=\"http://www.hl7.org/documentcenter/public/ballots/2018MAY/Announcements/NonMember%20Participation%20in%20HL7%20Ballots%20Instructions.pdf\" target=\"_blank\" title=\"http://www.hl7.org/documentcenter/public/ballots/2018MAY/Announcements/NonMember%20Participation%20in%20HL7%20Ballots%20Instructions.pdf\">non-members to pay</a> to be part of the ballot pool.  While anyone can submit change proposals to the FHIR spec, it's the ballot process that drives the standardization process.  Those who are in the ballot pool will have the final say on whether any FHIR content goes normative and if so, what.  Comments submitted by balloters are therefore also treated with higher priority.  And once the ballot opens, requests for substantive change to candidate normative content will have a pretty rough ride if they haven't come through the balloting process.  So if you haven't signed up, definitely think about it - or nudge those in your organization with control of the purse strings to think about it.  Signup deadline closes at midnight Eastern on April 5th.  If you don't sign up by the deadline, you can't vote.</p>",
        "id": 153946956,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521666365
    },
    {
        "content": "<p>Note that if you don't sign up for normative ballot this time, you can't vote on the second normative ballot that may happen in September to confirm substantiative changes</p>",
        "id": 153947159,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521724402
    },
    {
        "content": "<p>There will be 4 normative ballots and one STU ballot.  If you're interested in participating in more than one, it's cheapest to just sign up as an individual member (though if you're a member of an organization, there are restrictions around getting individual membership - best to investigate sooner rather than later...)</p>",
        "id": 153947240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521732226
    }
]