[
    {
        "content": "<p>What are the differences between Catalogs and CodeSystems?</p>",
        "id": 233079623,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617540976
    },
    {
        "content": "<p>Specific/specialized vs. Generic/generalized?</p>",
        "id": 233079657,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617541049
    },
    {
        "content": "<p>I got pretty much help from the IG, such as its Section 1.5 Scopes of order catalogs and roles involved (<a href=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/index.html#scopes-of-order-catalogs-and-roles-involved\">https://build.fhir.org/ig/HL7/fhir-order-catalog/index.html#scopes-of-order-catalogs-and-roles-involved</a>).</p>",
        "id": 233080229,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617541687
    },
    {
        "content": "<p>CodeSystem resources hold and describe coded concepts covering a particular domain, whereas catalogs hold services, products or other artifacts useful for healthcare. The descriptions of those artifacts, use coded concepts coming from various Code Systems.</p>",
        "id": 233652292,
        "sender_full_name": "François Macary",
        "timestamp": 1617888709
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> Appreciate that.  Abstract concepts/entities vs relatively concrete entities (but not completely concrete instances), right?</p>",
        "id": 233654908,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617889764
    },
    {
        "content": "<p>Not sure what you mean by \"discrete\". Another way to see it is that CodeSystems provide concepts, which are useful to populate codeable elements of resources. Among those resources are the resources that represent healthcare services (PlanDefinition), knowledge artifacts (PlanDefinition again), devices (DeviceDefinition), products (MedicationKnowledge). All these resources include CodeableConcept elements, that are populated with concepts coming from various code systems. And catalogs are repositories of such resources.</p>",
        "id": 233657434,
        "sender_full_name": "François Macary",
        "timestamp": 1617890634
    },
    {
        "content": "<p>Very sorry, I mean concrete.</p>",
        "id": 233682353,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617898466
    },
    {
        "content": "<p>Well, now I am understanding the difference better.  If my understanding is right, Catalogs are repos of those resources just before they become  instances in real events/encounters etc.</p>",
        "id": 233683527,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617898978
    },
    {
        "content": "<p>Should RxNorm be loaded as a Catalog or a CodeSystem?</p>",
        "id": 250458818,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1629795817
    },
    {
        "content": "<p>A wierd question, right?</p>",
        "id": 250459118,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1629796019
    },
    {
        "content": "<p>RxNorm is a CodeSystem listed in the Terminologies tab of the FHIR standard and <a href=\"http://build.fhir.org/rxnorm.html\">this page</a> further describes how to use it as a CodeSystem in FHIR. It is a rich terminology, with lots of properties, but yet, still a CodeSystem.</p>",
        "id": 250466540,
        "sender_full_name": "François Macary",
        "timestamp": 1629801447
    },
    {
        "content": "<p>Yes, indeed.  Is it a mixture of CodeSystem and Catalog?  There are brand names if I'm right.</p>",
        "id": 250501749,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1629818782
    },
    {
        "content": "<p>It is a national code system for the US, describing drugs authorized on the US market.</p>",
        "id": 250516740,
        "sender_full_name": "François Macary",
        "timestamp": 1629825133
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span>  Appreciate it.  You're right.  In other words, my question is how to distinguish these two kinds of Resources.</p>",
        "id": 250699796,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1629935761
    },
    {
        "content": "<p>I'd say if you want to provide a list of codes eventually with some hierarchical relations - codesystem should be fine.<br>\nIf you want to describe the actual items - from composition, to prescribing rules, pricing info, origin, testing and recall status etc - then you need a set of resources<br>\nAnd if you want that list of characteristics to be authored/authoritative (e.g. \"ACME Hospital's 2021 allowed products and devices for por usage in the OR\", then you need something like a Catalog that puts those together</p>",
        "id": 250764163,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1629981266
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Thanks.  Actually, I didn't get it completely.  I think, CodeSystem could be used to represent a national formulary.  Apparently, I'm wrong by the spec. But why?</p>",
        "id": 251480792,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1630455317
    },
    {
        "content": "<p>Typically a formulary isn't defining its own codes.  You could make a value set that defines all of the codes in your formulary, but a formulary typically wants to introduce additional concepts, like when a drug can be used, what tier it's in, what portion will be paid for, etc.</p>",
        "id": 251480930,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630455428
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Yes, it's not defining codes.  Maybe, concept properties could be used to describe such additional things.</p>",
        "id": 251481332,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1630455717
    },
    {
        "content": "<p>Concept properties are limited.  They can't be references.  They're only one level deep.  Plus the properties can't be added by value sets, only code system supplements.  The properties would be different for the same drug for different formularies.  It might be good enough in some cases, but not great for general use.</p>",
        "id": 251483613,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630457358
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thank you so much.  My understanding is much better now.</p>",
        "id": 251646460,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1630540366
    }
]