[
    {
        "content": "<p>I am working on building an order-catalog, thanks for all the hard work on the IG!</p>\n<p>One thing that I am having trouble getting behind is the use of Composition for CatalogHeader. I really think this should be a Library, and here's why:</p>\n<hr>\n<p>From the spec:</p>\n<p>The Composition resource - defines a set of healthcare-related information that is assembled together into a single logical document that provides a single coherent statement of meaning, establishes its own context and that has clinical attestation with regard to who is making the statement.</p>\n<p>The Library resource is a general-purpose container for knowledge asset definitions. It can be used to describe and expose existing knowledge assets such as logic libraries and information model descriptions, as well as to describe a collection of knowledge assets.</p>\n<hr>\n<p>From this and other documentation in the spec, Composition seems more focused on EHR runtime with a patient context and not for organizing definitional artifacts?</p>\n<p>Library is already used in several well-used IGs (CPG, CQF measures, for instance) to represent a collection of knowledge artifacts such as:  ActivityDefinition, PlanDefinition, Questionnaire, and Measure (<a href=\"https://www.hl7.org/fhir/clinicalreasoning-knowledge-artifact-distribution.html\">https://www.hl7.org/fhir/clinicalreasoning-knowledge-artifact-distribution.html</a>). Which seem to fit perfectly.</p>\n<p>And if <code>asset-collection</code> doesn't work,  Library.type is extensible (unlike Composition where the binding strength is higher, which is why the examples in the IG probably doesn't have a corresponding code for \"catalog\").</p>\n<p>Anyway, this is my feedback from the field. I would be happy to create a JIRA ticket if this seems like a topic to continue discussing! Thanks again :)</p>",
        "id": 211684377,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601413672
    },
    {
        "content": "<p>And if it were Library, we could use Canonical references (e.g. PlanDefinition.orderCatalog) instead of a Reference.</p>",
        "id": 211689812,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601416529
    },
    {
        "content": "<p>Composition supports organizing content into sections, sub-sections, etc. which is aligned with the 'human presentation' aspect of catalogs.  Library can't do that.  Also, the content of a Library must be an attachment, while the content of a catalog is often references to resources that are maintained independently.  (In some cases, the same resource instance might be referenced by multiple catalogs.)</p>",
        "id": 211695353,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601420262
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<p>What do you think about Composition (a) not being able to have a canonical URL and (b) the binding preference of LOINC which seems to have the consequence that the present IG relies on a code.text (and not a code token)?</p>\n<blockquote>\n<p>Composition supports organizing content into sections, sub-sections, etc. which is aligned with the 'human presentation' aspect of catalogs. Library can't do that.</p>\n</blockquote>\n<p>I guess I don't see how this organization would work practically, as CatalogHeader (the topic of this thread) as seen in method #2 (which more likely unless a trivial catalog) where the item refers to the CatalogHeader (child to parent reference -- last paragraph of <a href=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/#technical-overview\">https://build.fhir.org/ig/HL7/fhir-order-catalog/#technical-overview</a>)?</p>\n<blockquote>\n<p>Also, the content of a Library must be an attachment, while the content of a catalog is often references to resources that are maintained independently. (In some cases, the same resource instance might be referenced by multiple catalogs.)</p>\n</blockquote>\n<p><code>attachment.url</code> should be able to handle that (if method #1)</p>",
        "id": 211782834,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601481806
    },
    {
        "content": "<p>I wouldn't expect Composition to have a canonical URL - it's not a 'definitional' artifact.  It's a single instance.  If you want a definitional resource, it would be something the Composition references, not the Composition itself.</p>\n<p>I don't think the preference for LOINC drove the choice of text.  The choice of text was driven by the fact the designers didn't think the sections would typically be coded or that there'd be much value in coding them.  You can certainly challenge that.</p>",
        "id": 211797813,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601488720
    },
    {
        "content": "<p>With respect to canonical, I don't think there's a use-case for a catalog being copied and maintained in multiple locations.</p>",
        "id": 211797903,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601488768
    },
    {
        "content": "<p>So the catalog isn't definitional? I always thought it was, and would be versioned and have canonical URL like any other authored item...</p>",
        "id": 211799347,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601489480
    },
    {
        "content": "<p>Any resource can be versioned (as long as that is supported by the server), and a canonical url and datatype isn't required for that.  I'm also not seeing a clear reason that would be of additional value in this case.  Along the lines of what Lloyd said, if this was something like a catalog \"definition\" or \"template\" that described how the catalog was structured and organized, rather than an instance that contains the actual catalog content, then that would be appropriate and expected.</p>",
        "id": 211806023,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601492882
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> -- A canonical reference is a way to formalize fetching a resource by a <code>url</code> and optional <code>version</code>. This is a bit different than the history feature of FHIR resource (see <a href=\"https://www.hl7.org/fhir/references.html#canonical\">https://www.hl7.org/fhir/references.html#canonical</a>).</p>",
        "id": 211813421,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601496559
    },
    {
        "content": "<p>I guess in the end, I see an order catalog as in the category of \"knowledge\" (verses instances of clinical fact about a patient).</p>",
        "id": 211814774,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601497202
    },
    {
        "content": "<p>Well, yes, it is.  And I'm definitely aware of that.  The main question I think is whether that additional capability is needed/required in this case.  If it was <strong>always</strong> needed for any resource, then all references would be \"canonical\", and we wouldn't have a separate 'canonical' datatype that is used specifically for references to conformance and knowledge resources.</p>",
        "id": 211815207,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601497416
    },
    {
        "content": "<p>Yes, I think whether catalogs are actually \"knowledge resources\" (as they have been defined in FHIR) is the key question for deciding which is the most appropriate in this case.</p>",
        "id": 211815410,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601497518
    },
    {
        "content": "<p>I think \"canonical behavior\" in FHIR seems to be common of authored knowledge artifacts (and not clinical facts with a patient). I feel a catalog is a knowledge artifact. So that's my thinking at least :)</p>",
        "id": 211815512,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601497568
    },
    {
        "content": "<p>I certainly do agree that a catalog is not an \"instance of clinical fact about a patient\".</p>",
        "id": 211815546,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601497590
    },
    {
        "content": "<p>It's worth some further discussion in the project group, for sure.</p>",
        "id": 211815617,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601497627
    },
    {
        "content": "<p>Note that the relationship between the knowledge artifacts of PlanDef to ActivityDef use canonical for a good reason. I think this pattern should exist for catalogheader and the items in a catalog.</p>",
        "id": 211816057,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601497832
    },
    {
        "content": "<p>And Library would give us this \"for free\"... :)</p>",
        "id": 211816293,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601497960
    },
    {
        "content": "<p>I will also mention for clarity that my intent was not to state an equivalence between the history mechanism and explicit versioning of a conformance or knowledge resource, because I agree they are not the same.  The question still is if the \"good reason\" that you are describing is what is needed here - and it could be.  Would you be able to join one of the Catalog calls at noon Eastern on Friday to discuss it?</p>",
        "id": 211817515,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601498566
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  I can be, please send me a DM here or elsewhere with coordinates for the call. And thanks :)</p>",
        "id": 211837953,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601502398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191782\">@Brian Kaney</span> Here are the call <a href=\"http://www.hl7.org/concalls/CallDetails.aspx?concall=51238\">details</a>.</p>",
        "id": 211838368,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601502651
    },
    {
        "content": "<p>Great call today thanks. At one point, I heard someone mention List, which seems like a good idea as well. But whatever a Catalog /CatalogHeader becomes, and regardless if it has one-way or two-way references to items -- a consideration is to have it implement the Definition Pattern, as seen in R5: <a href=\"http://build.fhir.org/definition.html\">http://build.fhir.org/definition.html</a> (url, version, author, jurisdiction, useContext, etc)...</p>",
        "id": 212101481,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1601658096
    },
    {
        "content": "<p>Thanks Brian for the new ideas. <br>\nDiscussion on this topic much appreciated last Friday. Captured in the <a href=\"https://confluence.hl7.org/display/OO/2020-10-02+Catalog\">catalog call minutes</a><br>\nI'd like <span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span>  and <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span>  to check the minutes, please, and give your thoughts on the potential use of Library for representing a catalog header.</p>",
        "id": 212262408,
        "sender_full_name": "François Macary",
        "timestamp": 1601878840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> When and how do you prefer to discuss this further, since we are planning to do ballot reconciliation on the call this week?  Continue all of the further discussion (at least for now) here on Zulip?</p>",
        "id": 212304328,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601907163
    },
    {
        "content": "<p>Yes, we have to take care of balloters' comments during our next couple calls. In the meantime, let's continue the discussion on Library as candidate for catalog header on this stream.</p>",
        "id": 212328769,
        "sender_full_name": "François Macary",
        "timestamp": 1601917686
    },
    {
        "content": "<p>What's the difference between such a catalog and a CodeSystem?</p>",
        "id": 212914350,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602333951
    },
    {
        "content": "<p>A codesystem can be used to capture a list of items and a description. For example, product code + description.<br>\nA catalog is usually a formally issued document that contains the entire (relevant) set of characteristics of the products - attributes, relations with other products, whether they can be ordered (and how), prices, etc</p>",
        "id": 212920339,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602342988
    },
    {
        "content": "<p>Sound like a more special/specialized concept system, consisting of more concrete/tangible codes/concepts (but not ontological individuals) and their descriptions and relationships.  Right?</p>",
        "id": 212923283,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602347403
    },
    {
        "content": "<p>I don't understand the question. Perhaps a simpler analogy is the traditional calalogs: a paper-based book(let) with the relevant (and structured) characteristics of all the products. <br>\nIf we do the same in FHIR, that is also a catalog. If we just keep the codes and definitions, that could be a code system.</p>",
        "id": 212933821,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602362717
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  Well, it seems I got it a little bit more because of your further clarification.  Maybe  those volatile characteristics such as prices and specific performing departments are the essential differences.  Thanks.</p>",
        "id": 212942759,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602378928
    },
    {
        "content": "<p>For example, abstract/generic order codes in LOINC v.s. concrete/specific order codes only suitable for a specific entity in a specific period.  Am I right?</p>",
        "id": 212942937,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602379298
    },
    {
        "content": "<p>I would second the notion of using Library as a resource to represent a CatalogHeader, there are already other similar use cases in the Quality Measure IG (where it's used as a <a href=\"http://build.fhir.org/ig/HL7/cqf-measures/StructureDefinition-quality-program-cqfm.html\">Quality Program</a>), and the Clinical Guidelines IG (where it's used as an <a href=\"http://build.fhir.org/ig/HL7/cqf-recommendations/StructureDefinition-cpg-assetcollection.html\">Asset Collection</a>).</p>",
        "id": 212980167,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602447740
    },
    {
        "content": "<p>Thanks for the links <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> . At this stage, this seems to confort <span class=\"user-mention\" data-user-id=\"191782\">@Brian Kaney</span> 's initial suggestion, and to confirm that there are two possible approaches to represent catalogs of healthcare items. </p>\n<ul>\n<li>The \"document\" approach representing the catalog in a document-like manner, representing the whole catalog with the Composition resource (in the Catalog profile) and reaching the items from the Composition.section.entry links. This approach elicits a discrete version management , with the Composition potentially changing version each time a new item is inserted or an old one is retired. </li>\n<li>The \"library\" approach, more dynamic, considering the catalog as a library of items directly accessible, and using the Library resource to represent the header of the catalog and the organization maintaining the catalog. This approach calls more for continuous version management: The items have their own life cycle, which do not affect the version of the Library referenced by them.<br>\nWould that be an issue to reconcile the two approaches in the same <a href=\"http://hl7.org/fhir/uv/order-catalog/2020Sep/index.html\">order catalog IG</a>, offering both approaches to the catalog custodian, who would then choose and expose one single approach for one catalog? <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>.</li>\n</ul>",
        "id": 213181405,
        "sender_full_name": "François Macary",
        "timestamp": 1602606237
    },
    {
        "content": "<p>After much internal deliberation, \"mode 1\" seems better for managing change of catalog items and versions of the catalog on a whole in our use-case. And I attempted to model \"mode #1\" with Library and am using <code>relatedArtifact</code> to draw the relationship from the Library catalog to the child catalog entries. I did this instead of attachment, because  I need a canonical reference to point at the children (for versioning), which I couldn't do with <code>attachment</code>.</p>\n<p>Alternatively I guess it is possible to profile <code>Library.item.attachment</code> to have a <code>canonicalUrl</code> extension, but I wanted to have the FHIR search <code>iterate</code> work out of the box. But I think this could be done by adding a search-parameter on this new extension. However this approach might be contrary to the intention of the design of Library.attachment?</p>\n<p>Incidentally, I also tried with <code>List </code>and manually applied all the attributes from the definitional pattern, but that seemed to be the wrong path, as I also needed to add a canonical reference to the children for the reason above.</p>",
        "id": 213183740,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602607371
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> This may make sense.  My slight uneasiness, though, is in having the \"header\" representation be different in the two cases.  If the \"canonical\" reference capability is needed in the one approach (which points toward the use of Library), why isn't that needed in both approaches?  The overall idea of a catalog is the same, regardless of which approach is chosen for organizing and managing its content.    And for \"method 2\" (with either Library or CatalogHeader), I think we need to do some further thinking and modeling regarding what the idea of versioning of the catalog content is and how and where it will be represented.</p>",
        "id": 213185584,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1602608275
    },
    {
        "content": "<p>The approach we took in modeling Quality Programs was to use <code>composed-of</code> relatedArtifacts, so we could have canonical references:<br>\n<a href=\"https://github.com/HL7/cqf-measures/blob/master/resources/library/library-ep-ec-quality-program.json#L72\">https://github.com/HL7/cqf-measures/blob/master/resources/library/library-ep-ec-quality-program.json#L72</a></p>",
        "id": 213187314,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602609075
    },
    {
        "content": "<p>Those can be versioned or versionless, depends on your need, but I think that using Library allows both approaches, because you can specify not just the catalog header, but the actual composition of the catalog with the composed-of listings.</p>",
        "id": 213187433,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602609125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> this technique could in spirit be used in both. Since the child catalog item is a PlanDefinition, it could optionally point back at the parent(s) with the same <code>releatedArtifact</code> property, however we can't use a new code for type, <code>#part-of</code> (or similar), and the child-to-parent in a catalog context doesn't seem to fit into any of these nicely -- <a href=\"https://www.hl7.org/fhir/valueset-related-artifact-type.html\">https://www.hl7.org/fhir/valueset-related-artifact-type.html</a></p>",
        "id": 213197054,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602613648
    },
    {
        "content": "<p>As I dig into other items kinds of things that might be in a catalog (medication, devices, as seen in the IG), I see MedicationKnowledge and DeviceDefinition. I feel like anything in a catalog ought to have (some or all?) of the basic attributes found in the definition pattern (<a href=\"https://hl7.org/fhir/2020Feb/definition.html\">https://hl7.org/fhir/2020Feb/definition.html</a>), most especially being able to be referenced using Canonical.</p>\n<p>I understand it was not endorsed, but perhaps the CatalogItem interface could support this?</p>",
        "id": 213458700,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602782537
    },
    {
        "content": "<p>Seems like MedicationKnowledge should be a definitional resource, but I know that's been discussed by Pharmacy: <a href=\"https://jira.hl7.org/browse/FHIR-21301\">https://jira.hl7.org/browse/FHIR-21301</a> and rejected, perhaps submitting a tracker with this use case (being able to reference it from a catalog)?</p>",
        "id": 213492873,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602798805
    },
    {
        "content": "<p>Same with DeviceDefinition, seems like it should be definitional, and this use case is a good example of why.</p>",
        "id": 213493172,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602798974
    },
    {
        "content": "<p>DeviceDefinition is meant to be definitional. Is it not?</p>",
        "id": 213496899,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602801676
    },
    {
        "content": "<p>I agree with MedicationKnowledge should be definitional.</p>",
        "id": 213496949,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602801720
    },
    {
        "content": "<p>CatalogItem has been deprecated <br>\n( <span aria-label=\"sob\" class=\"emoji emoji-1f62d\" role=\"img\" title=\"sob\">:sob:</span> )</p>",
        "id": 213497017,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602801751
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191782\">@Brian Kaney</span> Catalogs and Product definitions in general are not yet very mature/ consensual yet, I believe. I think feedback is welcome. For DeviceDefinition, what would you suggest?</p>",
        "id": 213497352,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602802031
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> thanks! My opinion is any resource type that is definitional, ought to follow the definitional pattern. Resource types that literally have the word \"definition\" in them are, most hopefully, definitional <span aria-label=\"nerd\" class=\"emoji emoji-1f913\" role=\"img\" title=\"nerd\">:nerd:</span>  And I think order catalogs should always contain definitional items that can be referenced canonically.</p>",
        "id": 213502842,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602806513
    },
    {
        "content": "<p>I wouldn't expect any of these to adhere to the 'Definition' pattern - which is about activities, not entities</p>",
        "id": 213503013,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602806653
    },
    {
        "content": "<p>They define the activity?</p>",
        "id": 213503090,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602806724
    },
    {
        "content": "<p>Definition pattern is used by PlanDefinition, ActivityDefinition, Questionnaire and one or two others - resources that define activities that can occur</p>",
        "id": 213503143,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602806763
    },
    {
        "content": "<p>Right. DeviceDefinition defines a device and one could make the argument that it ought to incorporate definitional behavior.</p>",
        "id": 213503290,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602806878
    },
    {
        "content": "<p>It might - but it <em>can't</em> declare mappings to the Definition pattern</p>",
        "id": 213503378,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602806930
    },
    {
        "content": "<p>We could potentially define a 'Kind' pattern that could be used for resources that define kinds of entities.</p>",
        "id": 213503395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602806953
    },
    {
        "content": "<p>Which might share similar data to the Definition pattern</p>",
        "id": 213503404,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602806965
    },
    {
        "content": "<p>I see, perhaps. My big wish would be for all things that ever go into an order catalog to have canonical referencing behavior.</p>",
        "id": 213503525,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602807034
    },
    {
        "content": "<p>That only makes sense if that's the way systems typically handle them - and drugs and devices would generally be catalogued by code, not a canonical URL.</p>",
        "id": 213503668,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602807142
    },
    {
        "content": "<p>I hadn't thought of trivial cases of just codes, where I would imagine using a valueset. I guess I always assumed catalog items would be FHIR resources and have a bit more to them (and might have multiple versions).</p>\n<p>Oh I see you said \"cataloged by codes\", not a catalog of codes. Right... :)</p>",
        "id": 213504178,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602807568
    },
    {
        "content": "<p>I was thinking wouldn't it be possible to express a code token in the canonical url?</p>",
        "id": 213556423,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602853288
    },
    {
        "content": "<p>Where are you thinking you you would need to have a canonical url?  I.e. what resource?</p>",
        "id": 213561266,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602855735
    },
    {
        "content": "<p>DeviceDefinition and MedicationKnowledge are two resource types I see in the current order-catalog IG.</p>",
        "id": 213562029,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602856076
    },
    {
        "content": "<p>Lab services use Plan Def. And I imagine Order Set might end up with Plan Def as well, and support canonical.</p>",
        "id": 213562233,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602856159
    },
    {
        "content": "<p>How is the order catalog pointing to items?  I'd expect it to be able to reference by codes, not only canonicals?</p>",
        "id": 213562541,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602856309
    },
    {
        "content": "<p>Ah, a problem with DeviceDefinition, I see there already exists a <code>url</code>, but it's for a different purpose.</p>",
        "id": 213562997,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1602856555
    },
    {
        "content": "<p>There's a tracker to remove that url element, if I'm reading JIRA correctly there</p>",
        "id": 213588474,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602868583
    },
    {
        "content": "<p>And yes, it has been removed from the latest build</p>",
        "id": 213588527,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602868611
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179221-catalogs/topic/On.20CatalogHeader/near/213497017\">said</a>:</p>\n<blockquote>\n<p>CatalogItem has been deprecated <br>\n( <span aria-label=\"sob\" class=\"emoji emoji-1f62d\" role=\"img\" title=\"sob\">:sob:</span> )</p>\n</blockquote>\n<p>I'm also sad that it's being deprecated, it suits my need pretty much exactly. For the generic product catalog items available at a Pharmacy. We're able to update just the items, and don't need a single resource view, and this works for cases where items are either FHIR resources (medications/devices) and when they are not (generic stuff).</p>",
        "id": 226724219,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1613595456
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> <br>\nWhy has CatalogItem been deprecated?</p>",
        "id": 233079344,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1617540611
    }
]