[
    {
        "content": "<p>Stream created by <span class=\"user-mention silent\" data-user-id=\"240281\">Nandini Ganguly</span>.</p>",
        "id": 195722678,
        "sender_full_name": "Notification Bot",
        "timestamp": 1588172379
    },
    {
        "content": "<p>Welcome all participants.   I am here for anyone who has questions.    My expertise is in DME management.   I am the owner of Colonial Medical Supplies for over 20 years, and with that I have a good understanding of DME order workflows, requirements, documentation, etc.    Although I am not a programmer I do have some history with software, programming and fhir.   If I am not able to answer your question, I will help to find the expert that can.</p>",
        "id": 197471988,
        "sender_full_name": "David Bruinsma",
        "timestamp": 1589401268
    },
    {
        "content": "<p>Good day all.  We look forward to connecting and sending PAO bundles between participants.<br>\nPlease list 'public' endpoints available for consuming PAO bundles here in this chat session.</p>",
        "id": 197554688,
        "sender_full_name": "Zane Schott",
        "timestamp": 1589463443
    },
    {
        "content": "<p>Validate PAO Bundles / Resources ...<br>\n<a href=\"https://trifolia-fhir.lantanagroup.com/lantana_hapi_r4/post-acute-orders4/import\">https://trifolia-fhir.lantanagroup.com/lantana_hapi_r4/post-acute-orders4/import</a></p>",
        "id": 197556961,
        "sender_full_name": "Zane Schott",
        "timestamp": 1589464349
    },
    {
        "content": "<p>I have tested my bundle it seems working fine...:-)</p>",
        "id": 197564605,
        "sender_full_name": "Chung Ko",
        "timestamp": 1589467202
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298050\">@Chung Ko</span>  Johnny - Care to share your bundle via Zoom?</p>",
        "id": 197565370,
        "sender_full_name": "Zane Schott",
        "timestamp": 1589467527
    },
    {
        "content": "<p>My current questions<br>\n    1. PAOTask - What is the difference of \"basedOn\" and \"focus\" elements? It is not clear to me. I am referencing both to DeviceRequest.<br>\n    2. PAODeviceRequest: How the Sender knows which types of devices are available in the receiver? Should it query from a Catalog from the Receiver?<br>\n    3. PAODeviceRequest: How the Sender knows the Patient ID that the Receiver will understand? What happens if the patient does exist in the Receiver?<br>\n    4. PAOSubscription: can you give me an example of a criteria? I don't know how to reference to the task sent in the Bundle.</p>",
        "id": 197569153,
        "sender_full_name": "Ricardo Quintano",
        "timestamp": 1589468953
    },
    {
        "content": "<p>Writing up some of what we chatted about on the track earlier today - thanks for the good discussion.<br>\n<strong>What is the expected capabilities of the service supplier?</strong><br>\nAnswer: the supplier could have a range of capabilities:</p>\n<ul>\n<li>A sophisticated supplier would likely be able to receive different inbound notifications or messages and query back systematically for supporting information (ex: patient height/weight or latest vital sign readings)</li>\n<li>A small/medium sized vendor may only be able to receive the order message and respond with accept or deny. And ask via annotation for more information. As opposed to being able to query back for data. They often times will rely on an intermediary</li>\n</ul>\n<p><strong>Feedback for the spec:</strong></p>\n<ul>\n<li>Call out the different expected capabilities and assumptions in the IG. </li>\n<li>Design the workflow such that it can be expanded to support the sophisticated approach.</li>\n<li>Start with the MVP (minimal viable product)</li>\n<li><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> listed some suggested assumptions and workflow updates in <a href=\"https://jira.hl7.org/browse/FHIR-27101\">FHIR-27101</a></li>\n</ul>\n<p><strong>Additional discussion:</strong></p>\n<ul>\n<li>Coverage and guarantor information is one of the main missing API pieces. Needed to determine appropriate rule based criteria (often zip code and medicare based). Large suppliers and intermediaries often use other integration options to get this information, including non-standards based APIs.</li>\n</ul>",
        "id": 197588151,
        "sender_full_name": "Danielle Friend",
        "timestamp": 1589476585
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300010\">@Zane Schott</span>  and others please add more details if I missed anything from our discussion earlier</p>",
        "id": 197588615,
        "sender_full_name": "Danielle Friend",
        "timestamp": 1589476794
    },
    {
        "content": "<p>Good day all!  I am working to add a refresh to the Rotech token for each call and complete the Patient resource injection within the JSON bundle; then do the same with Epic.</p>",
        "id": 197687223,
        "sender_full_name": "Zane Schott",
        "timestamp": 1589547977
    },
    {
        "content": "<p>Morning Zane! Do you have chance to demonstrate using the query order API with http POST method? The API have the Task.status and Task.StatusREason updated. See if your side can received these from our end point. Thanks.<br>\nJohnny</p>",
        "id": 197687879,
        "sender_full_name": "Chung Ko",
        "timestamp": 1589548287
    },
    {
        "content": "<p>Zane, regarding to the test APIs, it will not be available after the Connectathon as the firewall will be reconfigured to block any traffics from outsider. Please note.</p>",
        "id": 197722688,
        "sender_full_name": "Chung Ko",
        "timestamp": 1589562576
    }
]