[
    {
        "content": "<p><strong>Topics covered during meeting</strong><br>\n1.  Are these libraries a prototype or are they production ready in terms of scalability, security, and ability to handle a typical production transaction load?<br>\nYes, the VRDR-dotnet libraries can be used in production however the current versions are being updated to align with the latest version of the VRDR IG.  The full complement of updated tools  including the libraries will be available mid- April 2022.  They are maintained to align with the VRDR IG and typically have a few releases each year with updates and improvements.<br>\n    a. New releases are announced in Zulip.<br>\n    b. Any further questions about how to use the library- refer to training videos on the NVSS Modernization Tool Kit and the NVSS COP SharePoint site. In addition,  MITRE can answer any related questions posted  Zulip or during the Tuesday Office Hours. <br>\n2.  <strong>Announcement</strong>- NVSS COP team is working with the SAMS team to create activities for each of the remaining 51 States/Jurisdiction to have access (NVSS API) in development. If a jurisdiction is interested in accessing the NVSS API in development (to test the sending and receipt of FHIR) please send the names and emails  of up to two individuals per jurisdictions that should be given access. These are typically technical staff who are doing the hands on work with FHIR but it could also be one person from the program side. <br>\n3.  <strong>Montana</strong> Comment- Some of the guidance that was provided under the ELC CoAg for alignment between budgets and workplans should came very late (once submissions had already occurred). This makes it difficult for jurisdictions to ensure that the alignment is in compliance with the guidance and is requiring considerable rework. <br>\n4.  <strong>NJ</strong> Question- Is anyone using  Amazon web services for FHIR?</p>\n<p>Even if it is being used, it can only be  used to leverage the reporting/analysis features but not to store data as a typical database would be used. <br>\n5.  Links that was shared during the meeting <br>\n        a. <a href=\"https://hl7-org.zoom.us/webinar/register/4716456260080/WN_lkh0wDkxQmGf_A3R7P2S5w\">https://hl7-org.zoom.us/webinar/register/4716456260080/WN_lkh0wDkxQmGf_A3R7P2S5w</a>  -Registering from HL7 Offered training events<br>\n       b. <a href=\"https://www.cdc.gov/nchs/nvss/modernization/tool-kit.htm\">https://www.cdc.gov/nchs/nvss/modernization/tool-kit.htm</a> - NVSS Modernization Tool Kit<br>\n      c. <a href=\"https://github.com/nightingaleproject/vrdr-dotnet\">https://github.com/nightingaleproject/vrdr-dotnet</a> - Reference EDRS<br>\n      d . <a href=\"https://github.com/gt-health/VRDR_javalib\">https://github.com/gt-health/VRDR_javalib</a> - Java Library</p>",
        "id": 277201766,
        "sender_full_name": "Bontu Fitta",
        "timestamp": 1648673047
    }
]