[
    {
        "content": "<p><strong>Topics covered during meeting-</strong></p>\n<p><strong>NCHS Updates</strong></p>\n<p>Monitoring Calls starting in Q4 (May to July , 2022)<br>\nStarting in May, NCHS will be participating in Q4 calls hosted by the ELC Program get updates on where vital records offices are with their modernization efforts.  Jurisdiction will be hearing about participating in these calls most likely from their state ELC Program Coordinators. Ideally someone from the program and technical side of the VRO will participate in these calls which will focus on understanding progress made in meeting TIER III objectives,  technical and programmatic challenges and areas where NCHS/COP can assist. </p>\n<p><strong>Upcoming opportunities for working towards FHIR certification-</strong><br>\nThe NVSS COP  is inviting jurisdictions to partner with NCHS  and work towards FHIR certification by December 2022/January 2023.  Once a jurisdiction is FHIR certified, they will be able to send and receive FHIR data to NCHS  in production. Ideally  jurisdiction that have already successfully participated in one or more Connectathons and/or NCHS organized testing events and are familiar with the VRDR IG and supporting tools (e.g. libraries , canary ) may be well positioned to participate.  If interested please send in your name to the NVSS modernization mailbox. </p>\n<p>Even if you are not interested in working towards FHIR certification for your systems but are interested in working with NCHS with pilot testing efforts, please send a note the NVSS modernization mailbox:. </p>\n<p><strong>Cynthia</strong> <strong>Bush</strong> - updates on the birth and fetal death FHIR IG<br>\n•   Within the next year, NCHS will be looking for jurisdictions to participate in building how the EHR to the electronic birth registration system workflow using FHIR . You can review the BFDR IG here :<br>\nHL7 BFDR FHIR IG: <a href=\"http://hl7.org/fhir/us/bfdr/\">http://hl7.org/fhir/us/bfdr/</a></p>",
        "id": 278075973,
        "sender_full_name": "Bontu Fitta",
        "timestamp": 1649274257
    }
]