[
    {
        "content": "<p><strong>Topics covered during meeting</strong><br>\n1.  Announcement about the availability of updated version of the VRDR IG and associated tools <br>\na.  NCHS in collaboration with its technical partners has been working diligently to update the VRDR STU2 (<a href=\"http://build.fhir.org/ig/HL7/vrdr/artifacts.html\">http://build.fhir.org/ig/HL7/vrdr/artifacts.html</a> ) and FHIR Messaging (<a href=\"http://build.fhir.org/ig/nightingaleproject/vital_records_fhir_messaging_ig/branches/main/\">http://build.fhir.org/ig/nightingaleproject/vital_records_fhir_messaging_ig/branches/main/</a> ) Implementation guides, along with all associated software (canary, VRDR dotnet, etc) in time for the next testing event in late June 2022. Both IGs are in final review. The VRDR STU2 has completed ballot reconciliation. We are dotting the i's and crossing the t's on the VRDR IG, so its current state should be very close to the version that will be published as STU2. There has been significant addition of documentation within each profile related to the IJE elements. For example see Decedent profile (<a href=\"http://build.fhir.org/ig/HL7/vrdr/branches/master/StructureDefinition-vrdr-decedent.html#usage\">http://build.fhir.org/ig/HL7/vrdr/branches/master/StructureDefinition-vrdr-decedent.html#usage</a> ).<br>\n2.  Review of  the list of acronyms and where they can be accessed under &gt;Training materials section <a href=\"https://cdcpartners.sharepoint.com/sites/NCHS/nvssmodcop/SitePages/Home.aspx\">https://cdcpartners.sharepoint.com/sites/NCHS/nvssmodcop/SitePages/Home.aspx</a><br>\n3.  Review on how to access Zulip Chat- Death on FHIR stream<br>\na.  Used as the primary help desk for all questions related to NVSS modernization <br>\nb.  Monitored by GTRI and MITRE with responses 24-48 hours turnaround time<br>\nc.  Partners encouraged to review the questions posted to date<br>\nd.  Zulip account set up guide is available on the NVSS COP SharePoint site- under Training materials  <a href=\"https://cdcpartners.sharepoint.com/sites/NCHS/nvssmodcop/SitePages/Home.aspx\">https://cdcpartners.sharepoint.com/sites/NCHS/nvssmodcop/SitePages/Home.aspx</a> <br>\n4.  States invited to work with NCHS towards certifying their systems for FHIR based interoperability by December 2022/January 2023 and in supporting pilot testing efforts. Send interest to <a href=\"mailto:NVSSmodernization@cdc.gov\">NVSSmodernization@cdc.gov</a> <br>\n5.  Should the office hours be offered only twice a month vs. weekly?<br>\n          No decision made but will be a topic for open discussion <br>\n6.  Review of the newly released Recorded Trainings and Presentations section of the NVSS Modernization Tool Kit- <a href=\"https://www.cdc.gov/nchs/nvss/modernization/tool-kit.htm\">https://www.cdc.gov/nchs/nvss/modernization/tool-kit.htm</a></p>",
        "id": 275528243,
        "sender_full_name": "Bontu Fitta",
        "timestamp": 1647444704
    }
]