[
    {
        "content": "<p>(11/30/2021) <br>\nAs the API is near final development it would be helpful in the documentation to everyone to summarize all available fields either sent or received by the user to help with properly loading ICD-10 cause of death and race codes back into the original EDRS record.  These fields could be defined as user defined or bookkeeping fields that are sent in the original FHIR file sent to NCHS and the returned NCHS file will return these user defined fields unchanged.</p>\n<p>Example:<br>\nI asked about sending a single primary key value in the death record to NCHS and the returned NCHS FHIR file will include this primary key from the original sent record:  We will use this primary key and not reformulate the separate State, Year and ID fields from the returned death record to create that primary key.    Greatly reduces potential for error when we send our primary key to NCHS and that original primary key is returned back in the NCHS file. Pete K. informed me that there already is such a field and referred me to the following:</p>\n<p>FHIR Messaging for vital records is documented here: <a href=\"http://build.fhir.org/ig/nightingaleproject/vital_records_fhir_messaging_ig/branches/main/index.html\">http://build.fhir.org/ig/nightingaleproject/vital_records_fhir_messaging_ig/branches/main/index.html</a></p>\n<p>The specification for the coding response message in particular is here: <a href=\"http://build.fhir.org/ig/nightingaleproject/vital_records_fhir_messaging_ig/branches/main/StructureDefinition-VRDR-CodingMessage.html#tab-diff\">http://build.fhir.org/ig/nightingaleproject/vital_records_fhir_messaging_ig/branches/main/StructureDefinition-VRDR-CodingMessage.html#tab-diff</a></p>\n<hr>\n<p>Due to delays of either the funeral home or medical certifier completing their respective sections in EDRS, to address timeliness we often will send an incomplete EDRS death record to NCHS to meet the number of deaths reported within a certain time frame from when the death occurred and then resend the completed EDRS death record to NCHS when it later becomes available.  </p>\n<p>To address this, it would help to provide a summary of available flag or \"bookkeeping\" fields in FHIR, divide into 2 categories:<br>\n1) User defined flag fields sent in the original FHIR file to NCHS and returned unchanged in the return NCHS FHIR file<br>\n2) Flag fields set by NCHS and returned in the FHIR file that our API can read and provide either a report on the status of the record or take action based on the results of that status flag.</p>\n<p>Note:<br>\nWhen we purposely send an incomplete death record to NCHS to address timeliness requirements, there is a certificate ID with that record.  The downside of trying addressing timeliness are duplicate records are often created in EDRS and when that death record is completed and resent to NCHS, the certificate ID (Year and ID fields) might change.   However name, DOB, Date of Death, sex and SSN does not change.  We also need some book keeping flag to address if the death record sent to NCHS for a particular decedent was the original record or the update.</p>",
        "id": 263171305,
        "sender_full_name": "Brian P",
        "timestamp": 1638290313
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"413367\">@Brian P</span> ,<br>\nAs per the current messaging IG, a record is identified by four fields:<br>\n   1) jurisdiction_ID <br>\n   2) cert_no <br>\n   3) death_year<br>\n   4) state_auxiliary_id</p>\n<p>My reading of the IG is that these are submitted by EDRS-&gt;NCHS as parameters on the initial submission and subsequent update, void, and alias messages.   They are also included in all acknowledgements, and NCHS-&gt;EDRS coding messages and updates.   So you could include your local primary key for the decedent in the state_auxiliary_id field.</p>\n<p>If the cert_no and death_year change, it might be best to void the initial message and resubmit.   There is no provision for updating these fields in the interface.  Updates pertain to the content of the associated death certificate document (as defined by the VRDR IG).</p>\n<p>Currently there is nothing in the interface that indicates whether the most recent death record for a decedent is an original or updated submission other than the trail of messages (and their associated IDs), and paired acknowledgements (which reference the submitted message id).  So, you'd need to track that state on your end.</p>\n<p>Hope this helps,<br>\nSaul<br>\n<span class=\"user-mention\" data-user-id=\"196927\">@Pete Krautscheid</span></p>",
        "id": 263175835,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1638291985
    },
    {
        "content": "<p>I believe what's being talked about here as \"bookkeeping flags\" are the parameters used for VRDR-messaging. For example, here's the parameter set sent when submitted VRDR. <a href=\"http://build.fhir.org/ig/nightingaleproject/vital_records_fhir_messaging_ig/branches/main/StructureDefinition-VRDR-DeathMessageParameters.html\">http://build.fhir.org/ig/nightingaleproject/vital_records_fhir_messaging_ig/branches/main/StructureDefinition-VRDR-DeathMessageParameters.html</a></p>\n<p>The issue is that you have to submit partial records to be in keeping with your reporting requirements right? There's nothing in the Messaging specification about the quality of the DeathCertificate submitted, but you could keep track locally, and when you can create the full record, send the \"completed\" record. If we need to track partial records on the federal side as well, then that should be a request for the spec to change. I think you can handle the policy of resubmission locally in Hawaii though.</p>\n<p>And what Saul is saying is right as well, if you change identification in your state system, it's (probably) best to void the original messages. That means you also need to keep up with the ids generated from the messaging protocol, and correlate them to your local case system, which will help you send finalized records as updates as well.</p>",
        "id": 263184209,
        "sender_full_name": "Michael Riley",
        "timestamp": 1638295425
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194612\">@Michael Riley</span> One thing that <span class=\"user-mention\" data-user-id=\"413367\">@Brian P</span>  asked about during office hours that he didn't ask here is how to use the Java libraries to set the state auxiliary identifier in the VRDR record. I believe it's the identifier field in this resource: <a href=\"http://build.fhir.org/ig/HL7/vrdr/StructureDefinition-VRDR-Death-Certificate-Reference.html\">http://build.fhir.org/ig/HL7/vrdr/StructureDefinition-VRDR-Death-Certificate-Reference.html</a>. Thanks!</p>\n<p>I'll add that, as Saul noted, there is also a field for the jurisdiction identifier as a message parameter as well (i.e., on the envelope); I don't believe the Java library currently offers support directly for the FHIR messaging layer.</p>",
        "id": 263194874,
        "sender_full_name": "Pete Krautscheid",
        "timestamp": 1638300040
    },
    {
        "content": "<p>Correct, we need to craft the message headers semi-manually through hapi-fhir (If you've used DCD creation in VRDR_javalib it's a similar process). <span class=\"user-mention\" data-user-id=\"413367\">@Brian P</span></p>",
        "id": 263204319,
        "sender_full_name": "Michael Riley",
        "timestamp": 1638304398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196927\">@Pete Krautscheid</span> <span class=\"user-mention\" data-user-id=\"414424\">@Sarah MacAdam</span> Trying record submission API for NYC jurisdiction through Postman using provide authentication credentials token but getting 404 response instead of expected 204 response. Is there any additional authorization is required or missing api for NYC. Please see attached requests. <a href=\"/user_uploads/10155/LQJnTnmnvrUYStStWkHoZMmX/RecordSubmission-404-Error.png\">RecordSubmission-404-Error.png</a> <a href=\"/user_uploads/10155/sePxfTCnQFHH56yudlqefOD8/record-submission-using-jsonfile.txt\">record-submission-using-jsonfile.txt</a> <a href=\"/user_uploads/10155/OOXMxGuCFUm9ycoQf1KOY1Eo/record-submission-using-jsoninbody.txt\">record-submission-using-jsoninbody.txt</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/LQJnTnmnvrUYStStWkHoZMmX/RecordSubmission-404-Error.png\" title=\"RecordSubmission-404-Error.png\"><img src=\"/user_uploads/10155/LQJnTnmnvrUYStStWkHoZMmX/RecordSubmission-404-Error.png\"></a></div>",
        "id": 272559349,
        "sender_full_name": "Lalit Gawad",
        "timestamp": 1645324379
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"479855\">@Lalit Gawad</span>,  it looks like there is an error in the url you provided.  The url for a sending a FHIR message to the NVSS FHIR API server is <a href=\"https://apigw.cdc.gov/OSELS/NCHS/NVSSFHIRAPI/YC/Bundles\">https://apigw.cdc.gov/OSELS/NCHS/NVSSFHIRAPI/YC/Bundles</a> (no /record/submission at the end, you may have been thinking of the client API /record/submission endpoint) here is an example of POSTing a FHIR message to the NVSS FHIR API server in the API documentation for reference <a href=\"https://github.com/nightingaleproject/Reference-NCHS-API#sending-messages\">https://github.com/nightingaleproject/Reference-NCHS-API#sending-messages</a></p>",
        "id": 272695774,
        "sender_full_name": "Sarah MacAdam",
        "timestamp": 1645454003
    },
    {
        "content": "<p>Thanks Sarah for correcting.</p>",
        "id": 272751408,
        "sender_full_name": "Lalit Gawad",
        "timestamp": 1645493870
    }
]