[
    {
        "content": "<p>I'm finding the virtual connectathons are more showcase events and less hackathons.  So I thought we could embrace that and host a PYCON for FHIR and consisting of a series of talks basically showing off what we've done in FHIR using Python.  Starting with the two main ( or more)  reference python libraries for FHIR and proceed from there with presentations on Python based FHIR applications using Python?</p>",
        "id": 226225112,
        "sender_full_name": "Eric Haas",
        "timestamp": 1613189073
    },
    {
        "content": "<p>For example I created narrative generators using the pythonclient models,  Flask , and Jinja,  as well as simple Client demo apps using Flask ( and hope to create dashboard apps using DASH, and fastAPI.)   I am also interested looking at issues like process and maintenance of the library and how add new features.</p>",
        "id": 226225592,
        "sender_full_name": "Eric Haas",
        "timestamp": 1613189838
    },
    {
        "content": "<p>I would like to participate!</p>",
        "id": 226641297,
        "sender_full_name": "Ilya Beda",
        "timestamp": 1613559856
    },
    {
        "content": "<p>I'm game, too, in some form or another.  I hope to have my synthea data loader ready to show/share soon.</p>",
        "id": 226728451,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1613597276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197422\">@Md Nazrul Islam</span> ?</p>",
        "id": 227039194,
        "sender_full_name": "Eric Haas",
        "timestamp": 1613773434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span>  who can best rep the the pyclient?</p>",
        "id": 227039307,
        "sender_full_name": "Eric Haas",
        "timestamp": 1613773480
    },
    {
        "content": "<p>I wouldn't know, I'm disconnected entirely since the last time we talked with Harold and co about it.</p>",
        "id": 227050029,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1613780328
    },
    {
        "content": "<p>There has been a tepid response to this suggestion so I am going to pass on proposing a track this time around.</p>",
        "id": 230438025,
        "sender_full_name": "Eric Haas",
        "timestamp": 1615851323
    }
]