[
    {
        "content": "<p>Generally an identifier is a specific business identifier for a resource.  But for Group , the ATR spec say to use a tax id or a provider id (NPI).  Are you expecting each unique group to have its own tax or NPI?  SHouldn't we require a unique identifier?  If we use tax id or npi, and have more than one group for that provider, then the identifier would be the same for multiple groups.  This seems like a very basic flaw so hoping you can explain.  Thanks.</p>",
        "id": 268092152,
        "sender_full_name": "Ruth berge",
        "timestamp": 1642206540
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"195768\">Ruth berge</span> <a href=\"#narrow/stream/214784-Da-Vinci.20ATR/topic/identifier.20for.20Group/near/268092152\">said</a>:</p>\n<blockquote>\n<p>Generally an identifier is a specific business identifier for a resource.  But for Group , the ATR spec say to use a tax id or a provider id (NPI).  Are you expecting each unique group to have its own tax or NPI?  SHouldn't we require a unique identifier?  If we use tax id or npi, and have more than one group for that provider, then the identifier would be the same for multiple groups.  This seems like a very basic flaw so hoping you can explain.  Thanks.</p>\n</blockquote>\n<p><a href=\"http://build.fhir.org/ig/HL7/davinci-atr/spec.html#representing-contracts\">http://build.fhir.org/ig/HL7/davinci-atr/spec.html#representing-contracts</a><br>\nsays \"Producers SHALL create one Member Attribution List represented by an instance of Group Resource. There will be <strong>exactly one</strong> Group Resource instance per Contract between a Payer and a Provider.\"</p>\n<p>I can envision cases where you may want a subset of Group.members, for example, limited to practitioners from a single location (when a Provider has multiple locations).  CMS quality reporting programs like CPC+ and <a href=\"https://innovation.cms.gov/media/document/pcf-py22-payment-meth-vol1\">PCF</a>  specify reporting at the site level.  I guess you can create another Group resource for the subset, but not an ATRGroup as currently defined.</p>",
        "id": 268442481,
        "sender_full_name": "Paul Denning",
        "timestamp": 1642533772
    },
    {
        "content": "<p>Thanks for the reply, but I do not understand how it answers my question.  In your example you talk about a location being added to this.  My question is about the ATR specification  and having one group per contract makes sense (to me).  What I do not understand is how an NPI or tax id would be a unique identifier for a GROUP resource.  Looking at what you envision, that provider NPI would be reused as the GROUP identifier for each location.  That would mean it is not a unique GROUP identifier.  Can ATR be updated to remove NPI and Tax ID as unique group attributes and instead mention the contract id?  Also appreciate anyone mentioning a better way to get an answer, but a stream search came up with this one.  It just doesn't seem to be very active.</p>",
        "id": 269876641,
        "sender_full_name": "Ruth berge",
        "timestamp": 1643476739
    },
    {
        "content": "<p>An addition to my previous question.  In the current ATR spec, under Technical Background, there is a diagram under a header \"Attribution List Data Mapped to FHIR Constructs\".   We had a screen shot of a previous version of this diagram that is slightly different.  The new one shows , in the box for Contract, the text \"Only Contract Identifier used in Member Attribution List\".  In the mapping for Group, it shows optional (but must support) slices for NPI and Tax id.  What does the text instruction mean- that ONLY the CONTRACT id should be used?  Or this this is the only contract id that should be used.</p>",
        "id": 276805125,
        "sender_full_name": "Ruth berge",
        "timestamp": 1648411536
    },
    {
        "content": "<p>The npi and tax ids in the business identifiers- the Group identifiers - should be the npi and tax id of each practitioner and organization who is related to an attributed patient?  Is it correct to expect hundreds of npi and tax ids on these groups where there could be thousands of members each seeing a different organization/practitioner?  That same list is also represented on each member in Extension: AttributedProvider?</p>",
        "id": 276805135,
        "sender_full_name": "Ruth berge",
        "timestamp": 1648411560
    },
    {
        "content": "<p>Ruth<br>\nThat is a good question. There could be more than one group resource for a specific provider, so we assumed that once you download the groups using discovery, if you do get multiple back you can subset it. IF there is an issue with this assumption, we can address it as part of the STU2 that is currently in progress.</p>",
        "id": 278021841,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1649251146
    },
    {
        "content": "<p>Ruth<br>\nAS part of the specification, we also have requirements to add the CONTRACT ID as part of the Identifiers also which should help the consumers to identify the specific groups in case they use the TAX ID or NPI to discover the groups and retrieve multiple ones.</p>",
        "id": 278022040,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1649251248
    },
    {
        "content": "<p>Ruth <br>\nThe ATR model is not using the Contract Resource and hence we specifically mentioned we are using a Contract ID which would be placed in the Group.identifier. Hope this explains. If there are any issues please feel free to join our bi-weekly calls at 3pm ET (DaVinci Member Attribution). We can have a deeper discussion.</p>",
        "id": 278022274,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1649251369
    }
]