[
    {
        "content": "<p>Hola, soy un poco nueva en esto, así que espero no estar metiendo la pata preguntando donde no toca. ¿Alguno sabe de si existen ahora mismo implementaciones reales (o en proyecto) de FHIR en España? Me interesa mucho el tema pero no he sido capaz de encontrar información al respecto por la red.</p>",
        "id": 154019619,
        "sender_full_name": "Diana Bosch",
        "timestamp": 1542649128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191839\">@diego kaminker</span> ?</p>",
        "id": 154019935,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542770417
    },
    {
        "content": "<p>Hola Diana. Hace unos años les di unos workshops convocado por HL7 Spain. Actualmente estoy un poco desconectado  del ambiente español pero puedes consultarle a <span class=\"user-mention\" data-user-id=\"195195\">@Manel Domingo</span>  para ver si conoce implementaciones o proyectos FHIR en España.</p>",
        "id": 154020159,
        "sender_full_name": "diego kaminker",
        "timestamp": 1542805156
    },
    {
        "content": "<p>Gracias por la información. Espero la respuesta de <span class=\"user-mention\" data-user-id=\"195195\">@Manel Domingo</span> :)</p>",
        "id": 154020789,
        "sender_full_name": "Diana Bosch",
        "timestamp": 1543223021
    },
    {
        "content": "<p>Hola <span class=\"user-mention\" data-user-id=\"197461\">@Diana Bosch</span> , nosotros estamos trabajando en las transformaciones de FHIR a otros estándares y viceversa. También tenemos un servidor de terminologías que permite su consultas con el API de FHIR. Tenemos también un evaluador de expresiones de SNOMED (SNQuery) que permite la consulta de expresiones definidas en el formato de URIs usado por FHIR.</p>",
        "id": 154022767,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1543929661
    },
    {
        "content": "<p>Hola <span class=\"user-mention\" data-user-id=\"197461\">@Diana Bosch</span> , estoy trabajando con FHIR en EEUU y tambien tengo curiosidad por saber el grado de implementacion de FHIR en España. Conseguiste averiguar algo?</p>",
        "id": 163018981,
        "sender_full_name": "Beltran Figueroa",
        "timestamp": 1554912638
    }
]