[
    {
        "content": "<p>I've just been asked a question that I don't know the right answer to. Here in Australia, we send messages through a SMD wrapper - a web service wrapper. The messages might be v2, CDA, PDF....</p>",
        "id": 182312408,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575256588
    },
    {
        "content": "<p>we don't have any acknowledgements right now. THat is, you send a message, and you have no way of finding out whether it arrived or not, or whether it's been accepted, if it's a referral</p>",
        "id": 182312426,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575256630
    },
    {
        "content": "<p>someone just asked me... what's the right FHIR resource to return an acknowledgement like this?</p>",
        "id": 182312432,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575256651
    },
    {
        "content": "<p>and I don't know?</p>",
        "id": 182312433,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575256655
    },
    {
        "content": "<p>ProcessResponse..? but that's gone? <br>\nCommunication...? But that's general. How would you know if was an <em>acknowledgement</em> message</p>",
        "id": 182312477,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575256685
    },
    {
        "content": "<p>a bundle with a message header?</p>",
        "id": 182312580,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575256808
    },
    {
        "content": "<p>If you are sending a FHIR message, there are mechanisms to receive an acknowledgment message:  <a href=\"http://build.fhir.org/messaging.html#patterns\" target=\"_blank\" title=\"http://build.fhir.org/messaging.html#patterns\">http://build.fhir.org/messaging.html#patterns</a></p>\n<p>But you are talking about accepting a referral - the underlying communications should not be concerned with the status of the referral, that is at the workflow level. The status of the referral is (usually) managed by a Task (based on  the ServiceRequest that is the referral). If you want to bring FHIR messaging and referral management together, you can then have something like this:</p>\n<p>Referral Request --&gt; FHIR message with MessageHeader.focus pointing to Task, with Task.status set to requested, and containing the rest of the relevant resources<br>\nSynchronous Ack --&gt; FHIR message with MessageHeader.respopnse.code of OK<br>\nReferral Accept --&gt; FHIR message with MessageHeader.focus pointing to Task, with Task.Status set to accepted</p>\n<p>Of course, there are many variations possible to the above, for example the synchronous ack may have a focus of Task as well, with Task.status set to received.</p>",
        "id": 182313750,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1575258631
    },
    {
        "content": "<p>you might note that I said nothing about FHIR messaging</p>",
        "id": 182313773,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575258679
    },
    {
        "content": "<p>but it does look like Task is the thing in R4</p>",
        "id": 182313833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575258761
    },
    {
        "content": "<p>the receiving system is informing the source system about the progress of it's task to process the message it received</p>",
        "id": 182313905,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575258879
    },
    {
        "content": "<p>\"a bundle with a message header\" led me astray :-)</p>\n<p>If you have a messaging system that has no inherent acknowledgment mechanism (except something that is considered too low level), then you need the content to fulfill that purpose. I am all for combining various standards in a single implementation guide, but in my opinion, it is better to provide a layer in the content that deals with the states of the information exchange. Just throwing a FHIR Task in the mix of other standards without other FHIR pieces involved might not be what you are looking for.</p>",
        "id": 182314497,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1575259998
    },
    {
        "content": "<p>no but I think it was what the person was looking for. Obviously it's less easily applicable if you didn't start with FHIR, but it's still an applicable idea even if you didn't</p>",
        "id": 182318150,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575266481
    },
    {
        "content": "<p>Notifications don't result in Tasks.. whereas there are plenty of notification scenarios where you'd like to have an ack.</p>",
        "id": 182573907,
        "sender_full_name": "René Spronk",
        "timestamp": 1575477992
    },
    {
        "content": "<p>this is dependent on the kind of notification.. each kind of notification have different pro/con. where the notification mechanism is a FHIR Message, there is an ack...</p>",
        "id": 182574160,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575478177
    }
]