[
    {
        "content": "<p>I assume we will be discussing what is in <a href=\"https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html\">https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html</a></p>\n<p>Here are few notes:</p>\n<ul>\n<li>When will this move to core? It needs a central location, and shouldn't be part of a realm-specific IG.</li>\n<li>The table and each row in 3.0.1 needs to be directly reference-able. I think having each IG explicitly point to the rows that are part of it will go a long way towards better understanding of what is being covered in that guide<ul>\n<li>there are at least a few fixes that need to be made, e.g. Batch Bundle - why not call it \"batch create/update\", like the corresponding \"batch search\"?</li>\n</ul>\n</li>\n<li>The decision tree - are the choices presented in this order just to make the visualization possible? I don't think the first question an IG should ask is \"is there a direct connection\" and make the decision at that point to use messaging.<ul>\n<li>In the explanation for \"direct connection\", I think the following is not correct, routing can be accomplished in many different ways: <code>However, in other environments, information exchanges are 'routed'. The initiator of a communication specifies a logical identifier of the desired target system and passes the communication into a network of intermediaries which then route the communication so that it eventually reaches the appropriate network address. In this routed form of exchange, the only option for exchange is messaging.</code></li>\n</ul>\n</li>\n<li>Decision tree vs. decision matrix: It might make sense to create a decision matrix with weighted categories rather than a binary decision tree</li>\n</ul>",
        "id": 205825847,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596477444
    },
    {
        "content": "<p>Intention is to include as part of R5 (which I <em>think</em> will be kicking off soon?)<br>\nThere should be anchors that allow linking to each section<br>\nThe order of the questions is intended to be the order in which they're asked.  The very first question is indeed whether you can connect directly or through proxy - because if you can't, all other questions are moot.  Messaging is your only option.  (Happy to discuss what you think the alternatives are.)<br>\nThe tree is complex enough.  I have no idea how to convert this into a matrix, though you're welcome to give it a shot.  Trying to get consensus on weightings seems challenging...</p>",
        "id": 205838177,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596483574
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>Trying to get consensus on weightings seems challenging\n</code></pre></div>\n\n\n<p>I was thinking of having the matrix as a tool, and let the IG authors determine the weights, not having universally applicable weights... Which is related to the belief that the very first question is whether the connection is direct/proxy-able, or not - I think the understanding of where the data is, who will initiate the exchange, and any workflow expectations for subsequent exchanges will lead to the answer of whether there is a direct connection or not.</p>",
        "id": 205841981,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596485643
    },
    {
        "content": "<p>The presumption is you know who wants the data and who has the data.  Who initiates doesn't really matter if there's no direct knowledge of how to reach each other.</p>",
        "id": 205844713,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596487147
    },
    {
        "content": "<p>I think you need to know who produces the data, who consumes the data, and who owns the data. Without the third dimension, there is strong possibility to have incompatible implementations, that share the same data in incompatible ways.</p>",
        "id": 205931500,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596560084
    },
    {
        "content": "<p>Not sure how 'owner' matters that much - or even what it means.  If a system has data and wants to share it, it doesn't much matter whether they're the source of truth or not.  For the entire decision tree, who the data source is and who the data consumer is are known starting points.</p>",
        "id": 205937025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596563068
    }
]