[
    {
        "content": "<p>Patient Care was questioning why the workflow context pattern supports a reference to Encounter | EpisodeOfCare when the EpisodeOfCare resource boundaries says </p>\n<blockquote>\n<p>The primary difference between the EpisodeOfCare and the Encounter is that the Encounter records the details of an activity directly relating to the patient, while the EpisodeOfCare is the container that can link a series of Encounters together for problems/issues </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  Was there discussion/agreement from Patient Admin that EpisodeOfCare <em>can</em> be used to record details of an activity (implying the boundaries need to be updated)?    <br>\nPatient Care actually liked the EpisodeOfCare boundaries as currently written, so we felt like it was more a question for Workflow.</p>",
        "id": 153930892,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1516994886
    },
    {
        "content": "<p>I don't recall any discussions, but doesn't feel right to remove that simple distinction.</p>",
        "id": 153930982,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517009330
    },
    {
        "content": "<p>Not really following why this is a question for workflow?</p>",
        "id": 153930986,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517010211
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>, can you explain the workflow issue?  We want to support linking to both because you might want to tie something to a pregnancy or disease episode in addition to or instead of a specific encounter.</p>",
        "id": 153930987,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517010345
    },
    {
        "content": "<p>I don't have an issue relating tasks to an EoC. If was the outcome of a Task, then would expect something like review this content to see if they meet the basics and worth getting them in for an assessment, so start he EoC, the Encounter will happen later.<br>\nIs this the kind of thing we're talking about?</p>",
        "id": 153930991,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517011146
    },
    {
        "content": "<p>For more context, Patient Care was discussing adding a reference to Encounter from AllergyIntolerance (which we approved).  That led into a discussion of whether we should also support a reference to the EpisodeOfCare from AllergyIntolerance (which we didn't approve).  Eventually, we started to question why other resources, such as Observation, support a reference to EpisodeOfCare.  The way we interpreted the boundaries of EpisodeOfCare was that the Observation (or any other activity relating directly to the patient) should be referencing the Encounter - not the EpisodeOfCare - because the EpisodeOfCare (per the boundaries) is just a container that links a series of encounters together.  In sum, the boundaries just felt inconsistent with the workflow pattern (which supports activity data to reference either the Encounter or the EpisodeOfCare)</p>",
        "id": 153931002,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517024450
    },
    {
        "content": "<p>There won't always <em>be</em> an encounter to link to - e.g. patient-reported observations.  And some encounters are tied to multiple episodes.  It's relevant to identify which episode something is tied to as well as the encounter.</p>",
        "id": 153931003,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517026510
    },
    {
        "content": "<p>I agree that AllergyIntolerance shouldn't tie to episode</p>",
        "id": 153931004,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517026522
    }
]