[
    {
        "content": "<p>Hi - I’m working on how to create interoperability within an EHR between its functional components. So that these components can be swapped out, rewritten, and new ones added.</p>\n<p>In looking for work done on event based standards, I was directed towards this FHIR chat stream. </p>\n<p>OpenMRS is interested to try and develop an EHR that is composed of multiple functional EHR services that communicate with their own APIs. Some may call these microservices, (but at this stage I am more interested in the concept than specific technology used.)</p>\n<p>Specifically, I am looking to find existing work (and ideally standards) that identify the necessary functional components within an EHR. And how these components relate to each other with triggers and events.</p>\n<p>For instance, we’d like to let the OpenMRS community know, that in order to build their own ‘patient-lookup-service’, it must be able to (a) consume &amp; output particular FHIR resources, and (b) look for these specific standard event triggers, and output results using a set of standard event codes. Such as “no_patient_found”.</p>\n<p>From what I can tell, this level of API integration and standardization is slightly different than FHIR Workflows or the HL7-EHR-System Functional model. From the HL7-EHR-System Functional Model docs I saw, there was a list of clinical functionality, but not specific mapping of triggers / events / interactions between different backend services.</p>\n<p>I was told HL7 may have the interaction diagram I am looking for, but I haven’t found it yet. Is there anything similar yet in FHIR?</p>\n<p>If anyone can help direct me to further resources, or if you have any other advice, it is much appreciated.</p>\n<p>Thank you for your assistance,<br>\n-Greg</p>",
        "id": 157606605,
        "sender_full_name": "Gregory Schmidt",
        "timestamp": 1549373866
    },
    {
        "content": "<p>exampleScenario?</p>",
        "id": 157607384,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549374628
    },
    {
        "content": "<p>example diagram from an example exampleScenario:</p>",
        "id": 157607432,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549374683
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/mgbgGM4aEoRX5g7UbA5vt7mL/examplescenario-mma1-diagram.png\" target=\"_blank\" title=\"examplescenario-mma1-diagram.png\">examplescenario-mma1-diagram.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/mgbgGM4aEoRX5g7UbA5vt7mL/examplescenario-mma1-diagram.png\" target=\"_blank\" title=\"examplescenario-mma1-diagram.png\"><img src=\"/user_uploads/10155/mgbgGM4aEoRX5g7UbA5vt7mL/examplescenario-mma1-diagram.png\"></a></div>",
        "id": 157607586,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549374821
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"201366\">@Gregory Schmidt</span> I'm not aware of such a mapping (from EHR-S FM to an interoperability standard like FHIR or even HL7v2).  Maybe one of the EHR-S FM experts should chime in..</p>",
        "id": 157611043,
        "sender_full_name": "René Spronk",
        "timestamp": 1549377880
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192546\">@Gary Dickinson</span> ?</p>",
        "id": 157616784,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549382350
    },
    {
        "content": "<p>The FHIR core specification doesn't standardize workflow.  Systems can communicate in different ways and there's no expectation around ordering or who supports what.  Workflow standardization (when it happens at all) tends to occur within implementation guides scoped to specific sets of systems in specific contexts to achieve a particular objective.  The workflow used in inpatient in one country may be quite different than that used for outpatient or in a neighboring country.</p>",
        "id": 157616959,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549382478
    },
    {
        "content": "<p>OpenMRS (<a href=\"https://en.wikipedia.org/wiki/OpenMRS\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/OpenMRS\">https://en.wikipedia.org/wiki/OpenMRS</a>, \"a collaborative open-source project to develop software to support the delivery of health care in developing countries\") is a solution aimed at an international market, and as such verifying ones functionality against EHR-S FM makes sense, that was meant as an international set of requirements (in practice EHR-S FM is still somewhat US oriented, but not entirely so).</p>\n<p>The interoperability requirements as defined in the EHR-S FM may map to IHE workflow profiles, or to (undocumented) \"best practices\" as known in the HL7/IHE communities. But apart from the IHE work (which isn't all based on FHIR) there's no documentation (AFAIK) of a mapping between EHR-S FM and interoperability standards.</p>",
        "id": 157671388,
        "sender_full_name": "René Spronk",
        "timestamp": 1549438445
    },
    {
        "content": "<p>Thank you for the feedback. I'll look closer into what work IHE has done</p>\n<p>I've seen <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  <span class=\"user-mention\" data-user-id=\"194068\">@Alexander Ivanov</span> post workflow diagrams. Is there a central repository of these? They're different than the one's I've seen on other hl7 wikis</p>",
        "id": 157687625,
        "sender_full_name": "Gregory Schmidt",
        "timestamp": 1549458063
    },
    {
        "content": "<p>We are still ramping up the way to define and represent workflows. The diagrams are current working ideas</p>",
        "id": 157764130,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549533461
    },
    {
        "content": "<p>We=FHIR (and also IHE for FHIR profiles)</p>",
        "id": 157764178,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1549533486
    }
]