[
    {
        "content": "<p>It seems tricky to have a meta tag \"actionable\" - shouldn't we emerge this to the request pattern?</p>",
        "id": 183002324,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1575926990
    },
    {
        "content": "<p>reason for this is that this tag has an impact, and seems more instructing about the request than metadata about the request</p>",
        "id": 183002415,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1575927035
    },
    {
        "content": "<p>It needs to be a tag rather than an element because it needs to be changeable when moving from one system to another without breaking signatures.</p>",
        "id": 183002878,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575927320
    },
    {
        "content": "<p>you mean when forwarding a request as a  JFYI, the forwarder just sets a tag?</p>",
        "id": 183003345,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1575927696
    },
    {
        "content": "<p>y</p>",
        "id": 183003832,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575928056
    },
    {
        "content": "<p>Or clears a tag</p>",
        "id": 183003841,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575928063
    },
    {
        "content": "<p>Ok, but the JFYI request can also be a new derived request thing, right? Forcing systems to determine behaviour because of a tag seems like a big thing.  1 - can a system ignore a tag? 2 can we make that tag \"must support\"?</p>",
        "id": 183004405,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1575928471
    },
    {
        "content": "<p>and the very fact it is in .meta does not mean it is outside signatures.</p>",
        "id": 183004429,
        "sender_full_name": "John Moehrke",
        "timestamp": 1575928498
    },
    {
        "content": "<p>I think the tag makes sense as one option. There should be a value for request.intent \"JFYI\" for systems that want to have this as a new request instance. (I think forwarding a request JFYI in some cases is a clinical decision and therefore needs its own resource instance)</p>",
        "id": 183004433,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1575928502
    },
    {
        "content": "<p>Tags can be very critical things to look at.  IGs can certainly set conformance expectations around tags.  Absent IG rules, consuming systems are free to ignore anything they wish (though they must be cautious when ignoring modifier elements)</p>",
        "id": 183004634,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575928678
    }
]