[
    {
        "content": "<p>Task allows for multiple inputs and multiple outputs.  You can have multiple inputs of the same type or different types and multiple outputs of the same type or different types.  This is fine as long as you never update the task to change the inputs or the outputs.  </p>\n<p>Imagine I Create a Task with Inputs A, B, and C.  Then later I Update the Task and change the Inputs to C, D, and E.  <br>\nShould the receiver of the task interpret this to mean that A and B are no longer valid and should be deleted (full \"snapsshot\" replace)?  or should it assume A and B are still valid and update C and add D and E?   <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"281641\">@Natasha Kreisle</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span></p>",
        "id": 223793364,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1611459477
    },
    {
        "content": "<p>Changing inputs would be uncommon.  A Task.input is \"information needed to allow execution of the Task\".  Removing inputs would be saying \"this information wasn't actually needed/was erroneous\".  Adding new ones would be saying \"This additional information is also needed in order to execute the Task\".  It's certainly <em>possible</em> in some cases - e.g. someone submits a Task asking for fulfillment of a referral and provides some supporting information needed to evaluate the request and the respondent points out that one of the records attached belongs to the wrong patient and also indicates they need a few more pieces of information.  Once the inputs were corrected, the respondent could then adjust the status to reflect acceptance or in-progress.  It would be very unusual to change the Task.inputs once the Task was underway.</p>\n<p>Outputs could also be changed, either in event of error or to replace an early result with a final one.  But outputs <em>shouldn't</em> be changed after the Task is marked as 'complete'.</p>",
        "id": 223793907,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611460400
    },
    {
        "content": "<p>Also, please note that a Profile on Task can introduce requirements on whether and how inputs may be changed. It is also up to the server to decide whether a task created with inputs A,B,C, and then updated with inputs C,D,E will result in the task only having inputs C,D,E, or inputs A,B,C,D,E, or only A, and E - just because that is what the server can support (see <a href=\"http://build.fhir.org/updates.html\">http://build.fhir.org/updates.html</a>). Ant there is also PATCH</p>\n<p>I think that in an Implementation Guide, the Profile of Task should clarify issues like this.</p>",
        "id": 223794790,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1611461955
    },
    {
        "content": "<p>Imagine I am baking.  As the process progresses I add new ingredients.  Knowing which one I put in first and when might be useful  - each could be an input.  Order might matter.  In the patient request for corrections use case \"adding\" who to notify after the request has been accepted might be appropriate.</p>",
        "id": 223795466,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1611463029
    },
    {
        "content": "<p>There are lots of \"mights\".  I have trouble imagining more than one or two inputs to a correction Task, I can't think of why inputs would need to be added late in the game and I can't fathom why order would matter.  In short: lets not add theoretical complexity, let's focus on our explicit requirements.  (Email messages from patients or providers would not be 'inputs'...)</p>",
        "id": 223834326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611520702
    }
]