[
    {
        "content": "<p>Both PlanDefinition and ExampleScenario refer to a participant in an action. If we want to have a governed set of actors / participants, shouldn't we have a way to define them? <br>\nPractitioner is too limited.</p>",
        "id": 161218805,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553061965
    },
    {
        "content": "<p>I am thinking of IHE actors (e.g. a Prescription Placer). Not sure there are other examples where this would make sense.</p>",
        "id": 161218832,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553062064
    },
    {
        "content": "<p>Prescription Place would generally be a CapabilityStatement.  Not sure about having that pointed to by a PlanDefinition though...</p>",
        "id": 161249442,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553090373
    },
    {
        "content": "<p>A prescription placer has a definition, a set of transactions it can accept, a set of transactions it can initiate...</p>",
        "id": 161291228,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553116010
    },
    {
        "content": "<p>CapabilityStatement reads more \"what the system is supposed to do\", not \"what the system is about\".</p>",
        "id": 161291294,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553116041
    },
    {
        "content": "<p>I am trying to use PlanDefinition to express a workflow conformance.</p>",
        "id": 161291340,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553116079
    },
    {
        "content": "<p>for example, a workflow conformance that would say \"Order Placer(A1) sends a prescription(R1) to Treatment Planner(A2). Then treatment planner \"decodes\" that and issues instance orders(R2) and sends it to nursing app(A3)\"</p>",
        "id": 161291591,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553116249
    },
    {
        "content": "<p>A1 to A3 are actors</p>",
        "id": 161291596,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553116257
    },
    {
        "content": "<p>And there is a place to define them in the PlanDefinition and in ExampleScenario</p>",
        "id": 161291636,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553116295
    },
    {
        "content": "<p>when publishing a profile like in IHE, i would not want to define the actor in each scenario. I would like to point to a definition of an actor.</p>",
        "id": 161291719,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553116337
    },
    {
        "content": "<p>the need to put then in a planDefinition is because we want to constrain the content in a given context. In this case, R1 and R2 are both medicationRequests, but they have different fixed values for intent (R1.intent=\"order\", R2.intent=\"instance-order\"), and R2.basedOn must point to  R1.</p>",
        "id": 161292151,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553116682
    },
    {
        "content": "<p>I'm not totally clear on what the difference is between \"what the system is supposed to do\" and \"what the system is about\" from a specification perspective.  When I'm writing an IG, I only care about the actors from a perspective of \"what are they supposed to do\".  If they meet the capabilities requirements and they interact as required, I don't really care \"what they're about\".  So \"Order Placer\", \"Treatment Planner\", etc. all get represented as CapabilityStatements in an IG.  And those represent 'definitions'.  They are statements of what a system should do, they don't correspond to specific system instances.</p>",
        "id": 161304288,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553127653
    },
    {
        "content": "<p>i can experiment with that. This means that for workflow conformance, I should be able to point from an PlanDefinition to a CapabilityStatement, right?</p>",
        "id": 161314916,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553141364
    },
    {
        "content": "<p>Not right now you can't.</p>",
        "id": 161315553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553142259
    },
    {
        "content": "<p>You could experiment with a custom extension.</p>",
        "id": 161315554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553142267
    },
    {
        "content": "<p>i will see if capabilityStatement could support all we need to define an IHE actor, and then see if an extension or change request for plandefinition would be adequate.</p>",
        "id": 161315911,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553142867
    },
    {
        "content": "<p>planDefinition needs some changes anyway  if we want that resource to be the way to express workflow conformance</p>",
        "id": 161315990,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553142970
    },
    {
        "content": "<p>i am wondering whether the findings would be best discussed in the workflow calls or decision support calls.. Ideas?</p>",
        "id": 161316059,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553143084
    },
    {
        "content": "<p>(not sure if CapabilityStatement would be adequate for IHE actors, especially those that support non-FHIR transactions)</p>",
        "id": 161316290,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553143521
    },
    {
        "content": "<p>We can start with workflow and if we have consensus we can then approach CDS</p>",
        "id": 161316598,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553143975
    },
    {
        "content": "<p>ok i'll prepare an example and bring this to a call. Likely April 1 or after</p>",
        "id": 161318749,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553147098
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> an IHE actor within a specified Profile  is minimally defined by one CapabilityStatement, but sometimes is multiple. It could be multiple when that IHE actor has IHE defined Options. Not all options will need a new CapabilityStatement.   <br>\nThere is an unusual situation where one IHE actor must be represented as many CapabilityStatements, when that actor is engaging in multiple Transactions and multiple Messages within a Transaction.   The answer is very much dependent on how detailed you want your CapabilityStatement to be. <br>\nLastly recall that the above statements is about an \"IHE actor within a specified Profile\". the abstraction of an IHE actor can apper in many profiles, and each new profile that it appears in may add different behaviours that cause new CapabilityStatements to be needed.<br>\nI have outlined this all on the IHE wiki page for when IHE is profiling FHIR, a specification you are aware of. The above assessment holds true regardless of if IHE publishes profiles the old way, or using the HL7 IG publisher.</p>",
        "id": 161399810,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553206104
    },
    {
        "content": "<p>i am starting from the requirements, my requirement is \"a governed list of actors\"</p>",
        "id": 161428221,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553242179
    },
    {
        "content": "<p>If we need to define an actor, with a name, with 1..N (?) CapabilityStatements, i want to see which resource to use for that.<br>\nThe proposals in the wiki are about how to do things in one given set of constraints. I want to look at (governance) requirements beforehand.</p>",
        "id": 161428443,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553242426
    }
]