[
    {
        "content": "<p>I'm looking at ways of introducing FHIR Workflow. <br>\nFHIR Workflow seems to bring in a number of answers but it seems we need a 'point of sharing'. <br>\nThis is where the Tasks will reference and we would probably need combinations of HL7 v2 and FHIR Messaging.</p>\n<p><a href=\"/user_uploads/10155/csmRn-zMBeMPpFhWY-DAQ8FO/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/csmRn-zMBeMPpFhWY-DAQ8FO/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/csmRn-zMBeMPpFhWY-DAQ8FO/image.png\"></a></div>",
        "id": 251343392,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1630394976
    },
    {
        "content": "<p>Long term we could look to move the 'point of sharing' as early as possible in the workflow (and do away with the messaging).</p>\n<p>I'm thinking the messages and Tasks will have overlap.<br>\ne.g. a FHIR Message prescription-order will have eventCoding of prescription-order and the Task.code will also be prescription-order.</p>\n<p>Wondering if I should use FHIR Communication as a text notification version of a Task (or just use Task.description). I'm thinking this should be conversation at a high level. <br>\nWe may have text notifications which are just 'prescription has been dispatched via Acme Logistics' with pointers to the FHIR resources. This sounds more like FHIR Communication?</p>",
        "id": 251344745,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1630395656
    },
    {
        "content": "<p>So your requirement is that the placer can only communicate via messaging, but you're looking for an intermediary to translate that into a FHIR Restful approach where a Task is instantiated and the filler receives a subscription notification, grabs the Task and whatever else they need and interacts RESTfully and, once the Task is in an end state, the intermediary generates a response message?  That should be doable.  In fact, I wouldn't even mind updating the workflow page to show that as an approach, as it provides an onramp to doing things in a RESTful way.</p>\n<p>Not sure you need the Communication resource.  If someone's monitoring the Task, the Task business status would be updated (possibly with an output pointing to the MedicationDispense)</p>",
        "id": 251401422,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630422616
    },
    {
        "content": "<p>I think so. Having a 'point of sharing' is sounding like an approach to moving from traditional messaging to rest. <br>\nLong term we can move that point to the placer.</p>",
        "id": 251402685,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1630423129
    },
    {
        "content": "<p>Care to submit a change request for us to document this approach in R5?</p>",
        "id": 251402811,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630423186
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191687\">Kevin Mayfield</span> <a href=\"#narrow/stream/179196-workflow/topic/Practical.20Workflow.20-.20Messages.2C.20Tasks.20and.20Communication/near/251402685\">said</a>:</p>\n<blockquote>\n<p>I think so. Having a 'point of sharing' is sounding like an approach to moving from traditional messaging to rest. <br>\nLong term we can move that point to the placer.</p>\n</blockquote>\n<p>This does seem like the logical thing to do (and what our prototype workflow manager does). As far as I am aware, there is also currently no way of describing how resources will be shared between tasks (source/destination pairs as per traditional workflow engines) which would be nice as well.</p>",
        "id": 251488613,
        "sender_full_name": "Parnesh Raniga",
        "timestamp": 1630461639
    },
    {
        "content": "<p>Understand what you mean. For our prescription-orders we know what resources we expect and for FHIR Messaging we have created MessageDefinitions. <br>\nIntend to look at reusing those to define the Tasks.</p>",
        "id": 251505034,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1630474876
    },
    {
        "content": "<p>Logged <a href=\"https://jira.hl7.org/browse/FHIR-33318\">https://jira.hl7.org/browse/FHIR-33318</a></p>",
        "id": 251517826,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1630482881
    }
]