[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I believe all of the following are report errors (really, 2 groups of errors:  1-4, and 5-6)</p>\n<p>First group -- extensions exist<br>\n1-The resource CommunicationRequest does not have an element with a mapping to the Request pattern element Request.instantiates, nor is it listed as a context in the corresponding extesnsion.  <br>\n2-The resource CommunicationRequest does not have an element with a mapping to the Request pattern element Request.relevantHistory, nor is it listed as a context in the corresponding extesnsion.  <br>\n3-The resource ClinicalImpression does not have an element with a mapping to the Event pattern element Event.partOf, nor is it listed as a context in the corresponding extesnsion.  <br>\n4-The resource Condition does not have an element with a mapping to the Event pattern element Event.partOf, nor is it listed as a context in the corresponding extesnsion.  </p>\n<p>Second group - pattern doesn't actually require performer.actor since performer is 0..*<br>\n5-The element ClinicalImpression.assessor has decreased the minimum cardinality from 1 to 0.  <br>\n6-The element Condition.asserter has decreased the minimum cardinality from 1 to 0.</p>",
        "id": 153941681,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1519950276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  the latest workflow report seems to have resolved the earlier issues, but I'm seeing 2 more that are likely bugs in the report.<br>\n1) The element Procedure.performer includes the following type(s) that are not part of the pattern: BackboneElement.  If the types should be considered for addition to the pattern, contact the FHIR Workflow project.  Otherwise, add this warning to the 'suppressed-workflow-warnings' file.<br>\n2) The element CommunicationRequest.payload.content[x] has increased the minimum cardinality from 0 to 1.  Verify that it's reasonable to make this element mandatory for all possible use-cases.  If so, add this warning to the 'suppressed-workflow-warnings' file.</p>\n<p>Why?<br>\n1) Event.performer is a backbone element<br>\n2) content is only 1..1 in context of payload, which is 0..* -- thus, the content element is not actually mandatory</p>\n<p>Let me know if you will update the report or if I should treat them like exemptions</p>",
        "id": 153942367,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1520262474
    },
    {
        "content": "<p>Additionally, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, some of the Patient Care issues that were previously reported (and not resolved yet) are missing from the report now.  Examples include:  1, 4, 5, 6, and 12 from <a href=\"#narrow/stream/workflow/topic/Patient.20Care.20Exemption.20Requests\" title=\"#narrow/stream/workflow/topic/Patient.20Care.20Exemption.20Requests\">https://chat.fhir.org/#narrow/stream/workflow/topic/Patient.20Care.20Exemption.20Requests</a></p>",
        "id": 153942370,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1520262868
    },
    {
        "content": "<p>A few more that are missing in the latest report (that were outstanding issues I was previously tracking):</p>\n<ul>\n<li>The element CommunicationRequest.category has increased the maximum cardinality from 1 to *.  Is it in the 80% for this element to repeat?  Is there a need to change the workflow pattern?  Please discuss with the workflow project.</li>\n<li>The element CommunicationRequest.category has a w5 mapping of 'class' which disagrees with the Request pattern mapping of 'what'.  Either the element has the wrong workflow mapping, the element has the wrong w5 mapping or there's a problem with the pattern's w5 mapping.  If you're not sure what to fix, please discuss with the Workflow project.</li>\n<li>The resource CommunicationRequest does not have an element with a mapping to the Request pattern element Request.doNotPerform, nor is it listed as a context in the corresponding extesnsion.  Possibilities: mapping was missed; element is in the 80% and should be added and mapped; element is outside the 80% but should be supported by the standard pattern extension; element is not relevant and this warning should be added to the 'workflow-warning-ignore' file</li>\n<li>The resource CommunicationRequest has multiple elements that map to pattern element Request.performer: .  If this is because different elements are used for different types or because the resource embeds the concept of multiple Requests, then add to the ignore list.  Otherwise, determine which element should actually be mapped.</li>\n<li>The element CommunicationRequest.recipient has a w5 mapping of 'who.focus' which disagrees with the Request pattern mapping of 'who.actor'.  Either the element has the wrong workflow mapping, the element has the wrong w5 mapping or there's a problem with the pattern's w5 mapping.  If you're not sure what to fix, please discuss with the Workflow project.</li>\n<li>The resource CommunicationRequest does not have an element with a mapping to the Request pattern element Request.statusReason, nor is it listed as a context in the corresponding extesnsion.  Possibilities: mapping was missed; element is in the 80% and should be added and mapped; element is outside the 80% but should be supported by the standard pattern extension; element is not relevant and this warning should be added to the 'workflow-warning-ignore' file</li>\n<li>The resource CommunicationRequest has multiple elements that map to pattern element Request.supportingInfo: .  If this is because different elements are used for different types or because the resource embeds the concept of multiple Requests, then add to the ignore list.  Otherwise, determine which element should actually be mapped.</li>\n<li>The element ClinicalImpression.assessor has a name that differs from the workflow element it maps to: actor.  Confirm that this inconsistency is intentional and is believed to better help domain implementers understand the purpose of the element in context.  If so, add this warning to the 'workflow-warning-ignore' file.</li>\n<li>The element ClinicalImpression.assessor has a w5 mapping of 'who.author' which disagrees with the Event pattern mapping of 'who.actor'.  Either the element has the wrong workflow mapping, the element has the wrong w5 mapping or there's a problem with the pattern's w5 mapping.  If you're not sure what to fix, please discuss with the Workflow project.</li>\n<li>The element ClinicalImpression.status has a fixed binding to code system(s) <a href=\"http://hl7.org/fhir/event-status\" target=\"_blank\" title=\"http://hl7.org/fhir/event-status\">http://hl7.org/fhir/event-status</a> while the element uses the code system(s) <a href=\"http://hl7.org/fhir/clinical-impression-status\" target=\"_blank\" title=\"http://hl7.org/fhir/clinical-impression-status\">http://hl7.org/fhir/clinical-impression-status</a>.  Confirm this is necessary and, if so, discuss with the workflow project.  (We're trying to use a consistent code system across all of FHIR when we can.)</li>\n<li>The resource ClinicalImpression does not have an element with a mapping to the Event pattern element Event.statusReason, nor is it listed as a context in the corresponding extesnsion.  Possibilities: mapping was missed; element is in the 80% and should be added and mapped; element is outside the 80% but should be supported by the standard pattern extension; element is not relevant and this warning should be added to the 'workflow-warning-ignore' file</li>\n</ul>",
        "id": 153942381,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1520263493
    },
    {
        "content": "<p>#1 and #2 are expected.  There's a limit to how smart the comparison can be.  I will see what's happening with the missing issues</p>",
        "id": 153942442,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520271134
    }
]