[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Patient Care has a ballot comment <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=11173\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=11173\">GF#11173</a> asking for support of CarePlan reviews.  We've deferred it a couple times, but wanted to better understand if there is any coordinated effort going on more broadly across all resources.  For example:</p>\n<ul>\n<li>I think Lloyd once suggested this is something probably best handled by \"Task\" (owned by OO) but will require a fair bit of analysis and discussion with other work groups to agree on approach</li>\n<li>VerificationResult (owned by PA) seems to related to review of health care directory information<br>\nIn sum, trying to understand which work group is taking the lead on a coordinated effort around handling reviews, so PC can get plugged into those efforts....<br>\nCC:  <span class=\"user-mention\" data-user-id=\"192135\">@Stephen Chu</span> , <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></li>\n</ul>",
        "id": 153973936,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1530830562
    },
    {
        "content": "<p>VerificationResult is narrowly constrained right now, but the FMG has asked PA to explore broadening it to support all types of reviews.  Would certainly like to know if PC thinks the resource is adaptable to meet their needs.  Task would allow you to request a review and note that it was done, but wouldn't necessarily capture details about the results - not sure if that's needed or not.</p>",
        "id": 153973938,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530831218
    },
    {
        "content": "<p>I'd love to see  good write up of distributed care plan reviews. I'm going to work on this once the ballot is out</p>",
        "id": 153973942,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530835041
    },
    {
        "content": "<p>I am not aware of any work by OO on this</p>",
        "id": 153973965,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530858738
    }
]