[
    {
        "content": "<p>Hello.  I'm looking for a little advice.  The ServiceRequest documentation specifically  mentions using service request for a \"pharmacist medication review\".  We're looking to build an API that allows a client to request a medication review.  this would trigger our pharmacists to review the patient medication profile and make recommended adjustments.  We believe the end result should be represented as a pharmacist eCarePlan (adheres to the careplan fhir shape).</p>\n<p>However, we're running to a couple of areas of uncertainty, and I'm hoping we can get some advice.  If we're totally off base, let me know.</p>\n<ol>\n<li>would the initial request endpoint just be a post to /serviceRequest?  Or would a custom endpoint make more sense?</li>\n<li>given the response is a carePlan, how does the client know when the result is ready, or where to find it?  I can't find any field on serviceRequest that references the response to the request.</li>\n</ol>\n<p>Best we have come up with so far is a post to /serviceRequest, followed by subscribing to changes in the service request.  When the request is \"completed\" the client would then make a request to /carePlan with a filter for \"basedOn\" with the initial service request.  Only, it looks like basedOn for carePlan requires another carePlan...</p>\n<p>Any ideas?  Thank you!!</p>",
        "id": 218621313,
        "sender_full_name": "Tejay Cardon",
        "timestamp": 1606944013
    },
    {
        "content": "<p>ServiceRequest in general is for recording the authorization for an action. Your use case may benefit from using Task instead, where the CarePlan will become the output of the Task. The general workflow, as described, seems to be fine.</p>",
        "id": 218624117,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1606945410
    },
    {
        "content": "<p>Thank you Vassil. In our case we may be billing for the service too, so sounds like the authorization aspect of the servicerequest might make it a stronger fit.</p>",
        "id": 218726944,
        "sender_full_name": "Tejay Cardon",
        "timestamp": 1607016409
    },
    {
        "content": "<p>In that case you could consider both ServiceRequest and Task, where Task.basedOn will reference the ServiceRequest, and Task.output will reference the CarePlan. An important consideration would be where the ServiceRequest is instantiated, as usually the authorizing entity needs to be the  owner of the ServiceRequest.</p>",
        "id": 218740165,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1607022563
    },
    {
        "content": "<p>Ah, that makes much more sense.  Thank you.</p>",
        "id": 218899635,
        "sender_full_name": "Tejay Cardon",
        "timestamp": 1607121106
    }
]