[
    {
        "content": "<p>Regarding <a href=\"http://jira.hl7.org/browse/FHIR-29636\">FHIR#29636</a>, I wanted to try to expand on what I see as the issue, and see what other may think before the call on Monday</p>\n<p>The definitions  for <code>Task.basedOn</code> and <code>Task.focus</code> are as follows:</p>\n<p><code>basedOn</code> Short Description:</p>\n<blockquote>\n<p>Request fulfilled by this task</p>\n</blockquote>\n<p><code>basedOn</code> Long Description</p>\n<blockquote>\n<p>BasedOn refers to a higher-level authorization that triggered the creation of the task. It references a \"request\" resource such as a ServiceRequest, MedicationRequest, ServiceRequest, CarePlan, etc. which is distinct from the \"request\" resource the task is seeking to fulfill. This latter resource is referenced by FocusOn. For example, based on a ServiceRequest (= BasedOn), a task is created to fulfill a procedureRequest ( = FocusOn ) to collect a specimen from a patient. </p>\n</blockquote>\n<p><code>focus</code> Short Description:</p>\n<blockquote>\n<p>What task is acting on</p>\n</blockquote>\n<p><code>focus</code> Long Description:</p>\n<blockquote>\n<p>The request being actioned or the resource being manipulated by this task.</p>\n</blockquote>\n<p>These definitions are unclear and contradictory, and the workflow workgroup is trying to rectify that. One view on clarifying this is that the Request that the task is trying to fulfil is always referenced via <code>focus</code>.  I disagree with that view, and the examples that are being discussed are also confusing. </p>\n<p>In the <code>basedOn</code> long description example, there is supposed to be a Lab Order (ServiceRequest) referenced via <code>basedOn</code> and a Procedure (another ServiceRequest) representing Specimen collection referenced via <code>focus</code>, and the Task is supposed to fulfil the Procedure. While that may make some sense if we were talking about how to design an app to record the specimen collection, I don't think it makes sense from an interoperability workflow point of view.</p>\n<p>Another example is that there is an existing prescription (MedicationRequest), and the patient is going to undergo a Surgical Procedure (ServiceRequest). As part of preparing for surgery, the existing prescription needs to be stopped. This is represented as a Task where <code>basedOn</code> is the ServiceRequest of the surgical procedure, and the <code>focus</code> is the MedicationRequest which needs to be stopped. This actually makes much more sense , but it doesn't support the view that Request that the task is trying to fulfil is always referenced via <code>focus</code> - the fulfillment of the Medication Request would be a completely different Task.</p>\n<p>The argument, as far as I understand it, is that there are \"higher-level\" authorizations that are different from the requests that are being fulfilled, and the former should go in <code>basedOn</code>,  while the latter belong in <code>focus</code>. I don't understand that distinction. The way I see it, we have common events in the healthcare process: lab orders, prescriptions, imaging procedures, referrals. All of these are Authorizations represented as Requests. The request for fulfilment of these requests is what is represented via Task, and they are always referenced via Task.basedOn.</p>\n<p>In the above  examples: for the lab order/specimen collection example, I am not aware of use cases where the specimen collection is a separate procedure, unless we are talking about invasive procedures like some biopsies. Even then, there will a Task for performing the biopsy with <code>basedOn</code> referencing the ServiceRequest for the procedure, and the Task to fulfill the diagnostic order will have <code>basedOn</code> referencing the ServiceRequest for the order, and the <code>focus</code> will be the specimen obtained during the biopsy.</p>\n<p>For the second example, the Task to stop the medication will be as described, but the other Task to fulfil the MedicationRequest will point to that request via <code>basedOn</code>, not <code>focus</code>.</p>\n<p>To make things even more confusing, there is also Task.reason (a future CodeableReference).</p>",
        "id": 222957732,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1610769676
    }
]