[
    {
        "content": "<p>I'm working on options to improve a document based workflow. One of the core tasks in the workflow is arranging forms to be completed. Long term I want to have a route to Structured Data Capture but in the short term I want to suggest a mechanism for requesting a FHIR Questionnaire to be answered and the answer can be paper form or online form. </p>\n<p>I think this is sending/allocating a FHIR Task to a Practitioner,  the Task is linked to a FHIR ActivityDefinition. Does that sound correct? If so where should I link in the Questionnaire, I feel it needs to be in the narrative for the Activity but would it also be in <a href=\"http://Task.in\" target=\"_blank\" title=\"http://Task.in\">Task.in</a>?</p>",
        "id": 166919455,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1559231263
    },
    {
        "content": "<p>Maybe I should be using ServiceRequest as this task could be viewed as an clinical assessment.</p>",
        "id": 166920412,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1559231870
    },
    {
        "content": "<p>SDC will soon be including some specific guidance here.  I don't expect we'll use ActivityDefinition.  Instead we'll have a specific code for \"please complete questionnaire\" and the Questionnaire will be referenced as a Task.input.</p>",
        "id": 166924520,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559234725
    },
    {
        "content": "<p>(ActivityDefinition just seems like too much overhead)</p>",
        "id": 166924528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559234741
    },
    {
        "content": "<p>Thanks. That seems makes more sense.</p>",
        "id": 166938216,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1559244282
    },
    {
        "content": "<p>How soon is soon in this case <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 167180000,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559561789
    },
    {
        "content": "<p>As part of the next published release.  We agreed to the change as part of ballot reconciliation.  Target for publication is fall, though I hope to have the guidance in place in the CI build by early July</p>",
        "id": 167189829,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559568906
    },
    {
        "content": "<p>So its documented in trackers at this point? (or just that it will be covered?)</p>",
        "id": 167246894,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559610271
    },
    {
        "content": "<p>I believe it's in trackers - either approved or slated for block vote.</p>",
        "id": 167247087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559610548
    },
    {
        "content": "<p>Against Task, or others too?<br>\nTrying to work out filter to go find them...</p>",
        "id": 167247478,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559611065
    },
    {
        "content": "<p>SDC</p>",
        "id": 167248810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559612868
    },
    {
        "content": "<p>Along similar lines would SDC cover a Task of please complete/return this report (response is a FHIR Document).  Here I'm thinking the input would be a profile and GraphDefinitions.</p>",
        "id": 167265218,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1559633168
    },
    {
        "content": "<p>SDC wouldn't do that as it's questionnaire-focused.  Are you thinking of an asynchronous invocation of the $document operation?</p>",
        "id": 167303583,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559660930
    },
    {
        "content": "<p>One think I've been wondering is if we want a generic way to use Task to support the asynchronous invocation of an arbitrary operation.  Is there interest in doing this for other types of operations?</p>",
        "id": 167303653,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559660968
    },
    {
        "content": "<p>Yes, in the ideal world would retrieve the document or query the data directly from the NHS but I think we will come across data sharing/technical issues. So we would ask the Patient or Practitioner to upload the (FHIR) via a Task.</p>",
        "id": 167372049,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1559727165
    }
]