[
    {
        "content": "<p>Hello everyone,</p>\n<p>What kind of string values should go into <em>CarePlan.activity.detail.scheduledString</em>? The examples contain dateTime values, which totally makes sense, but shouldn't the attribute than be called <em>scheduledDateTime</em>?</p>\n<p>Thank you for your assistance.</p>",
        "id": 160884986,
        "sender_full_name": "Georg Zweyer",
        "timestamp": 1552663640
    },
    {
        "content": "<p>sheduledString could be all sorts of things.  \"After the sidewalks are free of ice\" or \"before my daughter's wedding\" or \"the Mondays when my husband is able to watch the kids\" - it's typically used for timings that either can't be formally expressed in a reasonable way or when the source system doesn't capture time information as discrete elements and all it can do is propagate the string it has.</p>",
        "id": 160885416,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552663926
    },
    {
        "content": "<p>Wouldn't it make sense than to add an additional <em>scheduledDateTime</em> attribute for when you want to capture a precise time? Otherwise, if your system can handle concrete times, it would have to check if the string is a <em>dateTime</em>. Or should it use <em>scheduledTiming.event</em> for this? In this case, however, <em>PlanDefinition.action.timingDateTime</em> would also not be needed.</p>",
        "id": 160887572,
        "sender_full_name": "Georg Zweyer",
        "timestamp": 1552665480
    },
    {
        "content": "<p>The work group's initial analysis led them to believe that care plans identifying a specific date for something wasn't that common - that that tended to be more of an appointment/scheduling thing than a planning thing.  However, if you believe this determination was incorrect, you can certainly submit a change request.  (Evidence of support by existing systems that do care planning would be good too.)</p>",
        "id": 160888019,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552665745
    },
    {
        "content": "<p>Sounds reasonable. Actualy i don't do any care planning at all. I want to use CarePlan as instantiation of a PlanDefinition in a ResearchStudy scenario, because i want to use as less different resource types as possible to keep it simple and CarePlan has this nice forward referencing on outcomes of actions.</p>",
        "id": 160889422,
        "sender_full_name": "Georg Zweyer",
        "timestamp": 1552666679
    },
    {
        "content": "<p>So the PlanDefinition determines that the event must happen on a specific day - as opposed to sometime within a specified time-range?</p>",
        "id": 160892389,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552668804
    },
    {
        "content": "<p>It is a possibility. The initial question was more of a <em>do i understand the specification correctly</em> type.</p>",
        "id": 161040329,
        "sender_full_name": "Georg Zweyer",
        "timestamp": 1552899143
    },
    {
        "content": "<p>You understand the specification correctly.  Right now, PlanDefinition doesn't support saying that something will happen on a specific day - at least not without pointing to one of the Request resources that would allow that (e.g. Appointment).  That doesn't necessarily mean it <em>shouldn't</em> allow that.  You could propose a change if you think that support for dateTime should be added to the core spec</p>",
        "id": 161087070,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552936278
    }
]