[
    {
        "content": "<p>Subscription is asking for something but is not listed in the request pattern.  Is there a reason why</p>",
        "id": 167006783,
        "sender_full_name": "Eric Haas",
        "timestamp": 1559316654
    },
    {
        "content": "<p>It's a technical structure, not a clinical / business authorization.</p>",
        "id": 167007614,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559317193
    },
    {
        "content": "<p>We redefined it as:  \"Describes a particular client's request to be notified about a Topic.\"  <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>   was the intent to imply its a request.  if so would be need to follow the resource pattern?</p>",
        "id": 167046672,
        "sender_full_name": "Eric Haas",
        "timestamp": 1559350424
    },
    {
        "content": "<p>It's not a clinical or business resource.  It's like MessageHeader.  None of the intents would make any sense.  It should NOT try to follow the Request pattern.</p>",
        "id": 167054707,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559364052
    },
    {
        "content": "<p>I really don't know what the question means -- but if Lloyd says 'no,' then no :)</p>",
        "id": 167093292,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559429404
    },
    {
        "content": "<p>Eric is suggesting that Subscription should need to align with this pattern: <a href=\"http://hl7.org/fhir/request.html\" target=\"_blank\" title=\"http://hl7.org/fhir/request.html\">http://hl7.org/fhir/request.html</a></p>",
        "id": 167095139,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559432878
    },
    {
        "content": "<p>I understood that much -- but I still have no idea what the question means :)</p>",
        "id": 167104286,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559449688
    },
    {
        "content": "<p>Is Subscription in the same category of resources as MedicationRequest, ServiceRequest, DeviceRequest, VisionPrescription, etc.?</p>",
        "id": 167104514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559450109
    },
    {
        "content": "<p><strong>Request</strong> is - at the moment - an authorisation stating that something may/should/could be done and responded to, or just delegated, or postponed, or postprocessed, and is kept in medical / financial records. We have a pattern to avoid weird ways of doing that kind of stuff. Say a committees wants to create a resource like \"TransplantNeeded\". or worse, a resource called \"Transplant\" with a mood/status flag \"needed / done\"  - this is what the pattern is avoiding.</p>\n<p><strong>Subscription</strong> seems a technical way for a system to enable another to send it updates of whatever is on the server that matches some criteria. It is not an actionable request as the former. So I understand it is not in the request.  I can understand that it implies some functionality, but it is not in the level of the requests. Perhaps <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> is looking at it from a purely functional perspective, where it would make sense to keep track of subscriptions, e.g. for auditing purposes. We could address that but at a first glance i don't equate Subscription and Request. but there is no harm in seeing what could be harmonized there, as a one-off.</p>",
        "id": 167108329,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1559457589
    },
    {
        "content": "<p>Also see <a href=\"http://build.fhir.org/messaging.html#3.4.1.1\" target=\"_blank\" title=\"http://build.fhir.org/messaging.html#3.4.1.1\">http://build.fhir.org/messaging.html#3.4.1.1</a> , currency (which includes subscriptions, subscriptions are a kind of query) vs consequence</p>",
        "id": 167129666,
        "sender_full_name": "René Spronk",
        "timestamp": 1559494819
    }
]