[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Is there a current version of the workflow report somewhere to view?  I am working on (hopefully) the last batch of workflow changes and would like to check that the report is \"clean\" after I commit.</p>",
        "id": 153970560,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1529424516
    },
    {
        "content": "<p>No.  I can run the current version for you if you like, but I know that the current version includes bugs that cause it to complain about things it shouldn't (and possibly not complain about things it should).  Unfortunately I've had zero bandwidth to work on this.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and I have tentatively agreed get the report moved into the build process, but he's even busier than I am.  Let me know if you want me to run it \"as is\".  I'd provide a \"Hopefully I'll have an updated version of it available by ...\", but my track record hasn't been great with those of late :(</p>",
        "id": 153970595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529434264
    },
    {
        "content": "<p>I'll ping you once I commit the last batch of changes -- and then I'll take you up on your offer to re-run it.  I'd really like to close <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14446\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14446\">GF#14446</a>, but my sense is that fixing some issues will introduce new ones (e.g. mismatched w5 and workflow mappings can be fixed by removing the workflow mapping, but then that will introduce missing workflow mappings to be suppressed).</p>",
        "id": 153970624,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1529438371
    },
    {
        "content": "<p>Mismatched w5 and workflow mappings mean that either your mappings are wrong or the workflow to w5 mappings are wrong</p>",
        "id": 153970630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529439091
    },
    {
        "content": "<p>Right, so when PC voted, we believed the workflow mapping was wrong.  I will remove the (incorrect) workflow mapping, but now I've introduced a new workflow issue (workflow element has no mapping anymore).  Fixing one issue just leads to a second (new) issue.  It's hard to exempt the new second issue without re-running the workflow report.  I'll commit the changes later tonight -- and then hopefully ping you late tonight or tomorrow morning to re-run the report.</p>",
        "id": 153970641,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1529442982
    },
    {
        "content": "<p>Example:  PC had CommunicationRequest.category mapped to Request.code, but we decided that was wrong (category is more like class, not what).  By removing the mapping, I will introduce a new workflow issue saying Request.code is not mapped to any element in CommunicationRequest.  In sum, it's hard to get a clean report when the suppressed warning file requires the exact text of an issue that didn't exist in the prior version of the report....</p>",
        "id": 153970642,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1529443173
    },
    {
        "content": "<p>To get a clean report, you'll need to decide that for Communication, tne notion of \"code\" doesn't make sense/isn't necessary.  Then add it to the \"suppressed\" file so you don't get bugged about it anymore.  (And if you think it's not obvious, you can include an XML comment explaining why the WG feels it's not relevant.)</p>",
        "id": 153970647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529447393
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> My workflow commits are done, so bring on the new workflow report.  :hand_with_index_and_middle_fingers_crossed:</p>",
        "id": 153970673,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1529459007
    },
    {
        "content": "<p>Shared via the list.  Have fun :)</p>",
        "id": 153970741,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529504603
    },
    {
        "content": "<p>Thanks!!  As expected, PC has a few lingering issues (most of which were introduced by fixing other issues).  I can see the light at the end of the tunnel.</p>",
        "id": 153970795,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1529508541
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Any chance I can talk you into re-running the workflow report?  I'm hoping I knocked out the last 10+ issues and expect that I am getting very close (like 0 or 1 issues remaining).</p>",
        "id": 153973140,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1530628461
    },
    {
        "content": "<p>Sent :)</p>",
        "id": 153973183,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530636183
    },
    {
        "content": "<p>Thanks!!  I am closing out <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14446\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14446\">GF#14446</a> (finally!)  I think the only lingering issues are report issues -- most of which are:</p>\n<blockquote>\n<p>The element &lt;Resource&gt;.instantiatesCanonical excludes the following type(s) that are part of the pattern: canonical(DataElement).</p>\n</blockquote>",
        "id": 153973189,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1530637247
    }
]