[
    {
        "content": "<p>Hello everyone. I have started the journey of implementing FHIR into an existing mental health care application. One of the things I'm struggling with is how to go about representing a treatment protocol (CarePlan) as well as the tooling that would need to be involved in orchestrating workflows. So far, I've been investigating BPMN+ integrating with FHIR in some way. Wondering what the guidance is out there for how everyone else is representing their workflows.</p>",
        "id": 236213994,
        "sender_full_name": "Mark Steele",
        "timestamp": 1619458658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191748\">@Emmanuel Helm</span></p>",
        "id": 236214959,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619459042
    },
    {
        "content": "<p>I won't be in today's workflow call, but we could organize a brief overview for next monday <span class=\"user-mention\" data-user-id=\"191890\">@Reinhard Egelkraut</span> <span class=\"user-mention\" data-user-id=\"191686\">@Oliver Krauss</span>.</p>",
        "id": 236216335,
        "sender_full_name": "Emmanuel Helm",
        "timestamp": 1619459559
    },
    {
        "content": "<p>Came across this: <a href=\"https://igia.github.io/\">https://igia.github.io/</a>, as well as been talking to some vendors that integrate BPMN with FHIR. Really trying to find guidance on where things are heading</p>",
        "id": 236216879,
        "sender_full_name": "Mark Steele",
        "timestamp": 1619459788
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"408244\">@Mark Steele</span>, apologies for the delayed response :(. Within FHIR, the PlanDefinition and ActivityDefinition resources support modeling workflows, with the very rough mapping of PlanDefinition -&gt; Workflow, ActivityDefinition -&gt; Task. The work in this area is ongoing, but it is fairly well developed for a subset of BPMN, specifically as documented here: <a href=\"http://hl7.org/fhir/uv/cpg/documentation-methodology.html\">http://hl7.org/fhir/uv/cpg/documentation-methodology.html</a>. Work on this mapping, as well as ongoing discussion and work on using FHIR for workflow occurs on the Workflow subworkgroup of FHIR-I, every other Monday at 2:00PM ET. Note that the Clinical Guidelines IG (<a href=\"http://hl7.org/fhir/uv/cpg\">http://hl7.org/fhir/uv/cpg</a>) is currently being used in a number of projects to model guideline recommendations and pathways. A methodology-focused introduction for how it is being used with FHIR is <a href=\"http://hl7.org/fhir/uv/cpg/methodology.html\">here</a>.</p>",
        "id": 238320922,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1620744716
    }
]