[
    {
        "content": "<p>I am currently working with <span class=\"user-mention\" data-user-id=\"191890\">@Reinhard Egelkraut</span>, <span class=\"user-mention\" data-user-id=\"191488\">@Karl Holzer</span> and <span class=\"user-mention\" data-user-id=\"191686\">@Oliver Krauss</span> on the diagrams for the Workflow Communication Patterns. We tried and took the textual descriptions literally and came to find some loose ends (this leads to confusing/very complex diagrams, see attached whiteboard photo).<br>\nIn Option C, Step 3, the filler can post the event resource to any “alternate intermediary” system. How can the placer know where to look for this resource? <br>\nAlternatively – from the filler’s point of view, is this alternate intermediary system for example the placer’s FHIR server?</p>\n<p><a href=\"/user_uploads/10155/SJxR63yDhtADNoJrvE4FruE7/optioncwhiteboard.jpg\" target=\"_blank\" title=\"optioncwhiteboard.jpg\">optioncwhiteboard.jpg</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/SJxR63yDhtADNoJrvE4FruE7/optioncwhiteboard.jpg\" target=\"_blank\" title=\"optioncwhiteboard.jpg\"><img src=\"/user_uploads/10155/SJxR63yDhtADNoJrvE4FruE7/optioncwhiteboard.jpg\"></a></div>",
        "id": 153841634,
        "sender_full_name": "Emmanuel Helm",
        "timestamp": 1469784807
    },
    {
        "content": "<p>The intermediary would be some agreed workflow coordination system - both placer and filler would need to know about it in advance</p>",
        "id": 153841648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469801103
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> the intermediary itself is clear, what we didn't fully understand was (in Option C, step3): <br>\n\"the filler POSTs an 'event' resource (e.g. MedicationDispense, DiagosticReport, Encounter, etc.) to the appropriate resource endpoint on either its own system, the same intermediary as the request was placed on or some alternate intermediary\"<br>\n-&gt; the last part of the sentence would mean that the placer POSTs the request to an intermediary A and the filler POSTs the event to an different/alternate intermediary B, without informing the placer (at least that's what the current description says). Hence the questions from <span class=\"user-mention\" data-user-id=\"191748\">@Emmanuel Helm</span>. Or did we get something wrong? </p>",
        "id": 153841987,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1470080149
    },
    {
        "content": "<p>It doesn't really matter where the Event lives because where the Task lives is known - and the Task will be updated to point to the event on whatever server it's stored on.</p>",
        "id": 153842021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470104348
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\">@Lloyd McKenzie</span>: Why do you say that the intermediary must be known to the receiver and sender in advance - many intermediaries are only known to one end and indistiguishable from that end by the other end. Often your visibility only extends to the party you directly connect to.</p>",
        "id": 153842036,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1470119646
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> If we're dealing with REST situations (non-routing), then the system where the Task is posted by the placer must be known to the filler in order for them to look for it.  The messaging scenario is addressed separately and it doesn't require mutual knowledge of respective endpoints.  In the RESTful space, you can also have a cascade of responsibility where the \"filler\" that looks to the first task spawns other tasks that are then visible to subsequent downstream systems.  That sort of chaining is treated as distinct fulfillment where the filler becomes the placer in a separate fulfillment action.</p>",
        "id": 153842064,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470146565
    },
    {
        "content": "<p>Oh, this isn't a communication intermediary, its a Task Server - an endpoint. Agreed, all parties must be aware of servers which provide them services. Nothing to do with REST really.</p>",
        "id": 153842077,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1470159865
    },
    {
        "content": "<p>Ok thanks for the clarification.<br>\nI checked once again the description of Option C and although the \"placer and filler would need to know all involved systems in advance\" information is not part of the steps itself, it is mentioned in the limitations section of Option C:<br>\n-&gt; \"Placer and fulfiller must know where to poll for content - this could be a large number of Systems\"<br>\nso this should work</p>",
        "id": 153842179,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1470235030
    }
]