[
    {
        "content": "<p>Bienvenidos a todos! Aqui podemos hablar sobre FHIR y interoperabilidad en Chile.</p>",
        "id": 153942846,
        "sender_full_name": "James Agnew",
        "timestamp": 1520446906
    },
    {
        "content": "<p>Hola!</p>",
        "id": 153943026,
        "sender_full_name": "Camilo Erazo Leiva",
        "timestamp": 1520526854
    },
    {
        "content": "<blockquote>\n<p>Bienvenidos a todos! Aqui podemos hablar sobre FHIR y interoperabilidad en Chile.</p>\n</blockquote>\n<p>Gracias! Soy estudiante de Informática Biomedica espero ver y tener buenos debates!</p>",
        "id": 153943126,
        "sender_full_name": "David Zuloaga Ghio",
        "timestamp": 1520542557
    },
    {
        "content": "<p>Hola a todos! <br>\nPlease take the time to look at all the other available streams out there:<br>\n<a href=\"/user_uploads/10155/gVWba1JTJWpQyclBeaxb7tL4/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> <br>\n...and  sign up to whatever topic you find interesting...<br>\nFell free to post in any of these streams if you have a related question or comment.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/gVWba1JTJWpQyclBeaxb7tL4/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/gVWba1JTJWpQyclBeaxb7tL4/pasted_image.png\"></a></div>",
        "id": 153943204,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1520591698
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>  and <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  for their recent visit to Chile under the context of CENS Tech Talk, and for their welcome to this stream.</p>\n<p>Aprovecho de presentarme al resto del stream Chile, soy Luis Briones, Ingeniero del CIMT (<a href=\"http://cimt.uchile.cl/\" target=\"_blank\" title=\"http://cimt.uchile.cl/\">http://cimt.uchile.cl/</a>) y muy cercano al equipo CENS (<a href=\"http://cens.cl/wp/\" target=\"_blank\" title=\"http://cens.cl/wp/\">http://cens.cl/wp/</a>).</p>\n<p>Dejo abierta esta instancia para que logremos discutir y avanzar como comunidad en el desarrollo de FHIR en Chile!</p>",
        "id": 153954415,
        "sender_full_name": "Luis Briones Montecinos",
        "timestamp": 1524707127
    },
    {
        "content": "<p>Bienvenido a la comunidad Luis!</p>\n<p>También me quiero presentar corto: Soy Stefan Sigle y en este momento haciendo mi doctorado en Informática Medica en conjunto de la Universidad de Chile y la Universidad de Münster (Alemania). La institución local con que trabajo en este momento es el Instituto de Salud Publica (ISP) de Chile.</p>\n<p>En este momento estoy desarrollando aplicaciones Web/aplicaciones Android utilizando FHIR cubriendo recursos Questionnaire, QuestionnaireResponse pero también Medication, Substance, ...así que cualquier duda bienvenido!</p>\n<p>Fue recién también al Workgroup Meeting de HL7 y tengo contacto cercano con el comité técnico de Alemania. Ademas estamos participando desde Chile en las videoconferencias del working group HL7 Pharmacy.</p>\n<p>También estoy juntando comentarios a recursos y la especificación en general por el nuevo votación de HL7 FHIR para la primera versión normativa bajo del tópico \"May 2018 Ballot - Comments\". No dudan en contribuir a la formación del nuevo estándar desde Chile!</p>\n<p>Me interesan todo los aspectos de FHIR asi que por favor no dudan en contactarme vía un mensaje privado en el chat!<br>\nSaludos</p>",
        "id": 153954512,
        "sender_full_name": "Stefan Sigle",
        "timestamp": 1524749490
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153954513,
        "sender_full_name": "Jorge Mansilla",
        "timestamp": 1524749565
    },
    {
        "content": "<p>Buenos Días, <br>\nEs mi turno de presentarme, soy Jorge Mansilla, de profesión Ingeniero en Bioinformática, luego de un tiempo de trabajo cerca del mundo de la salud y los computadores, quise integrar estas dos áreas, para lo cual ingresé al magister en informática médica, dictado por la Universidad de Chile (<a href=\"http://cimt.uchile.cl/mim/\" target=\"_blank\" title=\"http://cimt.uchile.cl/mim/\">http://cimt.uchile.cl/mim/</a>). Luego de finalizado el magister, me integré como Ingeniero al Centro Nacional en Sistemas de Información en Salud, CENS (<a href=\"http://cens.cl/wp/\" target=\"_blank\" title=\"http://cens.cl/wp/\">http://cens.cl/wp/</a>). Comenzando a trabajar en directamente en proyectos relacionados con datos e información en salud, como es el proyecto Cuenta Medica Electrónica (<a href=\"http://cens.cl/wp/cuenta-medica-interoperable/\" target=\"_blank\" title=\"http://cens.cl/wp/cuenta-medica-interoperable/\">http://cens.cl/wp/cuenta-medica-interoperable/</a>). Por otro lado, debido los constantes avances en materia de tecnología e informática, es que también comenzamos a trabajar con el estándar de intercambio de datos en salud, que supone el nuevo estándar a nivel mundial, HL7-FHIR. Con lo cual hemos realizado varios talleres, workshop, entre otros. <br>\nSi bien como país estamos recién comenzando en esta área, la idea de estas conversaciones es que comencemos a sentar bases a nivel nacional con respecto a FHIR, asi que los dejamos invitados a participar activamente en estas conversaciones, pensando que serán el futuro en el intercambio de datos en salud.<br>\nSaludos<br>\nJorge Mansilla</p>",
        "id": 153954515,
        "sender_full_name": "Jorge Mansilla",
        "timestamp": 1524750648
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153954540,
        "sender_full_name": "Marcelo Cabello",
        "timestamp": 1524753876
    },
    {
        "content": "<p>Soy Francisco Correa, de profesión Químico Farmacéutico, luego de un tiempo de trabajo especialmente en las farmacias, quise entender otros tipos de mercados, para tener visión holística de las cosas, por lo cual ingrese al Magíster en Dirección de Marketing. Luego, me integre a un área inexplorada en el campo de la salud \"TI\", con un desafío tremendo en el Centro Nacional en Sistemas de Información en Salud, <a href=\"http://cens.cl/wp/\" target=\"_blank\" title=\"http://cens.cl/wp/\">CENS</a>. Comenzando a trabajar directamente en el proyecto de la <strong>Terminología Farmacéutica Chilena</strong> <a href=\"http://cens.cl/wp/areas/vigilancia-tecnologica/tfc/\" target=\"_blank\" title=\"http://cens.cl/wp/areas/vigilancia-tecnologica/tfc/\">TFC</a>, empecé a darme cuenta lo importante que como profesionales de salud seamos participes en proyectos TI. Además, gracias a la visión de Marketing poco a poco he entendido las necesidades que tienen distintos actores de la salud para resolver sus problemas relacionados con medicamentos. Por último junto un gran equipo de Ingenieros, hemos realizado workshops con el estándar de comunicación FHIR, muy útil para la interoperabilidad y para resolver los futuros UseCase de la TFC.</p>",
        "id": 153954615,
        "sender_full_name": "Francisco Correa",
        "timestamp": 1524775181
    },
    {
        "content": "<p>Hola!, me presento. Soy Marcelo Cabello, de profesión Ingeniero Informática más una formación técnica en Alemania en Gestión de Proyectos TI (<a href=\"https://www.bcw-gruppe.de/\" target=\"_blank\" title=\"https://www.bcw-gruppe.de/\">https://www.bcw-gruppe.de/</a>). Tengo experiencia en área de desarrollo de Registros Clínicos Electrónicos de AP, hospital y específicos para Cuidados Intensivos, Sistemas LIS (Laboratory Information Systems) e integraciones de sistemas. Me uní recién el año pasado (<a href=\"http://www.cimt.cl\" target=\"_blank\" title=\"http://www.cimt.cl\">www.cimt.cl</a> / <a href=\"http://www.cens.cl\" target=\"_blank\" title=\"http://www.cens.cl\">www.cens.cl</a>) a este vasto mundo de estándares e interoperabilidad y en buenahora en el momento que FHIR irrumpe en la industria de estandares.</p>\n<p>Actualmente, estoy trabajando dentro un equipo multidisplinario en el perfilamiento de los recursos Substance y Medication para el proyecto de terminología de fármacos (<a href=\"http://cens.cl/wp/areas/vigilancia-tecnologica/tfc/\" target=\"_blank\" title=\"http://cens.cl/wp/areas/vigilancia-tecnologica/tfc/\">http://cens.cl/wp/areas/vigilancia-tecnologica/tfc/</a>) junto con otros recursos de terminología (CodeSet, ValueSet, ConceptMap) y uso de SnomedCT más otras codificaciones para fármacos. Tambíen colaboro en el proyecto Bien Público CORFO orientado a un modelo para un directorio de prestadores de salud.</p>",
        "id": 153954784,
        "sender_full_name": "Marcelo Cabello",
        "timestamp": 1524838564
    }
]