[
    {
        "content": "<p>Estimada comunidad de usuarios (futuros) FHIR en Chile,</p>\n<p>a través del CENS tomamos el rol de juntar los comentarios en respecto de la Versión Ballot de la especificación FHIR del mayo 2018 (<a href=\"http://hl7.org/fhir/2018May/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2018May/index.html\">http://hl7.org/fhir/2018May/index.html</a>) en este stream.<br>\nEn conjunto con el autor del comentario vamos a crear un GForge Tracker Item (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker\">http://gforge.hl7.org/gf/project/fhir/tracker</a>) con ayuda de Grahame Grieve para comunicar con los miembros de HL7.</p>\n<p>Por ahora necesito por los comentarios que contienen por lo menos:</p>\n<ul>\n<li>Recurso afectado (ejemplo: \"Medication\")</li>\n<li>Resumen del comentario (ejemplo: \"Pharmacy missing isModifierReason\")</li>\n<li>Descripción detallada (ejemplo: \"The Medication resource allows you to say that it is Paracetamol 500mg per tablet, but...\")</li>\n</ul>\n<p>Por favor envian mediante este chat o por un documento word a <a href=\"mailto:ssigle@cens.cl\" title=\"mailto:ssigle@cens.cl\">ssigle@cens.cl</a>.<br>\nTenemos plazo hasta el 03.05.2018 23:59 CLST para transmitir todos los comentarios hacia HL7 para la votación de mayo.</p>\n<p>¡Todos los comentarios de todos los usuarios de FHIR están bienvenidos, también en español! </p>\n<p>¡Quedamos atentos a sus comentarios para formar una comunidad activa en la creación del próximo estándar de comunicación FHIR!</p>",
        "id": 153954336,
        "sender_full_name": "Stefan Sigle",
        "timestamp": 1524675604
    },
    {
        "content": "<p>Estimado, en un trabajo que estamos haciendo aca en Valpo nos ha surgido la necesidad de transportar información relacionada con aspectos psico-Sociales del paciente, como lo es el tipo de vivienda, calidad de los servicios básicos, cantidad de personas x metro cuadrado en domicilio, etc. Extender esos datos en el recurso paciente se ve poco viable, un recurso para dichos fines sería interesante pero no existe nada similar</p>",
        "id": 153954554,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524760337
    },
    {
        "content": "<p>Hola <span class=\"user-mention\" data-user-id=\"193555\">@Cesar Galindo</span> , <br>\npuedes intentar de formular tu pregunta en el formato sugerido por favor? Tampoco encontré una manera de guardar ese tipo de datos, pero creo que queda afuera por la regla 80/20 de FHIR. De todos modos los datos pueden ser relevante para preguntas de investigaciones y no encontré una respuesta facil mediante la búsqueda de Zulip Chat.</p>\n<p>Aquí una propuesta:</p>\n<p><em>Recurso afectado</em>: Patient, ...<br>\n<em>Resumen del comentario</em>: no hay una manera sin extensiones de guardar datos sobre estilo de vida / psicosociales en el recurso paciente<br>\n<em>Descripción detallada</em>: Transportar información relacionada con aspectos psico-Sociales del paciente, como lo es el tipo de vivienda, calidad de los servicios básicos, cantidad de personas X metro cuadrado en domicilio no es posible. Extender esos datos en el recurso paciente se ve poco viable, un recurso para dichos fines sería interesante pero no existe. </p>\n<p>y la versión en ingles:</p>\n<p><em>Affected resource</em>: Patient, ...<br>\n<em>Summary</em>: There is no way to record psycho-social data about a patient via FHIR<br>\n<em>Detailed description</em>: Transporting information related to psycho-social aspects of the patient, such as the type of housing, quality of basic services, number of people per square meter at home is not possible. Extending this data in the patient resource is not viable, a resource for these purposes would be interesting but does not exist.</p>\n<p>What do you think <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 153954568,
        "sender_full_name": "Stefan Sigle",
        "timestamp": 1524765963
    },
    {
        "content": "<p>ok le doy una vuelta en cuanto tenga un minuto lo migro a formato</p>",
        "id": 153954570,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524766092
    },
    {
        "content": "<p>efectivamente debe estar dentro de los casos de uso del 20% no incluido en la especificación, pero vale la pena consultar formalmente y discutir posibles soluciones para la implementación que están trabajando!</p>",
        "id": 153954588,
        "sender_full_name": "Luis Briones Montecinos",
        "timestamp": 1524770155
    },
    {
        "content": "<p>gracias</p>",
        "id": 153954589,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524770173
    },
    {
        "content": "<p>Hola <span class=\"user-mention\" data-user-id=\"193555\">@Cesar Galindo</span>  !<br>\nHas explorado la posibilidad de colocar estos datos Psico-Sociales del paciente fuere del recurso Patient y añadirlo a través del recurso Condition, en su definición esta \"It can be used to record information about: (...) identification of health issues/situations that a practitioner considers harmful\"<br>\nDe esa forma podrías listar condiciones como: vivienda precaria, ausencia de servicios básicos, hacinamiento...<br>\nCreo que es mejor intentar cambiar de recurso antes de usar extensiones</p>",
        "id": 153954590,
        "sender_full_name": "Daniel del Aguila",
        "timestamp": 1524770925
    },
    {
        "content": "<p>gracias <span class=\"user-mention\" data-user-id=\"192904\">@Daniel del Aguila</span>  Sonia me sugurio Location vamos a explorar.. aunque estos datos van mas alla de la vivienda, tb esta grado de escolaridad, etc</p>",
        "id": 153954595,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524771377
    },
    {
        "content": "<p>te refieres a determinantes sociales en salud?</p>",
        "id": 153954596,
        "sender_full_name": "Luis Briones Montecinos",
        "timestamp": 1524771626
    },
    {
        "content": "<p>siiiii</p>",
        "id": 153954597,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524771633
    },
    {
        "content": "<p>ahi entran muchos tipos de información, le dare un vuelta...</p>",
        "id": 153954598,
        "sender_full_name": "Luis Briones Montecinos",
        "timestamp": 1524771678
    },
    {
        "content": "<p>si mira voy a mandar un listado de datos</p>",
        "id": 153954599,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524771700
    },
    {
        "content": "<p>Numero de hijos<br>\nCon quien vive<br>\nEn que tipo de casa vive y si esta posee segundo piso de tenerlo si duerme en el segundo piso por otro lado si vive en departamento en que departamento vive<br>\nSu escolaridad<br>\nMedia, basica, tecnica, profesional o o alguna incompleta<br>\nSi sabe leer o escribir</p>",
        "id": 153954600,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524771931
    },
    {
        "content": "<p>es para un Registro Geriátrico</p>",
        "id": 153954601,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524771945
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  me indicó que se pueden usar los recursos Questionnarie y QuestionnairieResponse.... los revise y me hacen sentido en principio</p>",
        "id": 153954608,
        "sender_full_name": "Cesar Galindo",
        "timestamp": 1524774342
    },
    {
        "content": "<p>There is no way to record psycho-social data about a patient via FHIR - yes, correct. But this is not a good ballot item; the only possible response: \"we'll work on that with the community in a future version - do you want to lead a connectathon stream?\". I know that someone at regenstrief is working on this - I'll ask on the implementers stream</p>",
        "id": 153954623,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524776172
    },
    {
        "content": "<p>Thanks for the feedback <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, anyway there is already a good discussion going on the general chat. We also have collected some thoughts in regards to the Medication- and medication related resources, which we will bring into the discussion in the pharmacy conference call on Monday and eventually bring them towards a more suitable ballot item.</p>",
        "id": 153954752,
        "sender_full_name": "Stefan Sigle",
        "timestamp": 1524828308
    }
]