[
    {
        "content": "<p>Hi all - Posting here for comment/feedback from the FHIR community. </p>\n<p>As you may know, our IG (currently in development) seeks to provide guidance on how to represent the <a href=\"https://build.fhir.org/ig/HL7/carin-digital-insurance-card/branches/20211011/Physical_Insurance_Card_Data_Elements.html\">data elements</a> found on a physical insurance card in the form of a FHIR-based exchange. Our IG was originally intending to point to the US Core Patient profile instead of creating a unique Patient profile. However, in our open industry call on Oct 21st, we received valuable input that aligning with the cardinality of US Core would require implementers of our IG to go beyond the scope of our IG. Specifically, multiple representatives from different health plans indicated concern that requiring a gender would push beyond the scope of our IG as that is not a data element found on a physical insurance card. It is also not a data element necessary for establishing proof of insurance coverage. </p>\n<p>What are your thoughts on this approach: creating a Patient profile for our IG that is based on US Core with the one exception of gender cardinality (0..1) and explaining the reasons for that choice in the profile description?</p>\n<p>Link to our branch: <a href=\"https://build.fhir.org/ig/HL7/carin-digital-insurance-card/branches/20211011/toc.html\">https://build.fhir.org/ig/HL7/carin-digital-insurance-card/branches/20211011/toc.html</a></p>",
        "id": 258714271,
        "sender_full_name": "Cille Kissel Watkins",
        "timestamp": 1634910639
    },
    {
        "content": "<p>You can't use US Core and relax the constraints of US Core. Profiles that derive from other profiles can only further restrict. You can go from 0..1 to 1..1 but you can't go from 1..1 to 0..1.<br>\nIf you want to use US Core, for some stuff, then you have to do everything US Core says.</p>",
        "id": 258716050,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634911449
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span>  thank you for the response! I can see how the way I worded it might have caused confusion (\"based on US Core\"). We understand that it would require us to create our own profile in order to adjust the cardinality. Stated another way, we are looking for feedback about whether deviating from US Core for this reason is acceptable to the community.</p>",
        "id": 258723707,
        "sender_full_name": "Cille Kissel Watkins",
        "timestamp": 1634914767
    },
    {
        "content": "<p>I suppose it depends on how much of the US Core additional attributes find meaning in C4DIC. 1? Disconnect US Core and duplicate the requirement.  All? Accept the gender requirement. </p>\n<p>As an aside its been stated that requiring a profile attribute is discouraged. Conformance to a profile should be validated against attributes and having a profile value doesn't actually prove that it's conformant.</p>",
        "id": 258725681,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634915537
    }
]