[
    {
        "content": "<p>Hello</p>\n<p>We are working on a self-treatment plan concept and we want to use the PlanDefinition and CarePlan resources. Currently our focus is on patients diagnosed with COPD. In the current paper based self-treatment plan there are three zones that the patient can be categorized into. The patient can be in the green zone. This is the «normal» zone when the patient feels ok and in this zone the patient has a set of activities to perform and medication to take. If the patient experiences more problems, heavy breathing or other problems he might be categorized to be in the yellow zone. This will change the activites and medication for the patient and the patient should for that particular day act upon the yellow zone activities and medication. The last zone is the red zone with its own set of activities and medication. The patient has one care plan. Depending on his daily condition he needs to switch between the three different «sub-plans» if you can call it that. Certain activities and medication can of course be valid between the different zones.</p>\n<p>The question now is how can we using the FIHR CarePlan resource make support for the three zones. What would be best practice approach to support such a scenario?</p>\n<p>Thank you.</p>",
        "id": 189596065,
        "sender_full_name": "Knut Aavatsmark",
        "timestamp": 1583245139
    },
    {
        "content": "<p>The CarePlan resource can reference other carePlan resources. You could have an overarching COPD  carePlan that can be referenced by the  three \"sub\"carePlans  (green zone, yellow zone, red zone) using carePlan.partOf.</p>",
        "id": 189747637,
        "sender_full_name": "Emma Jones",
        "timestamp": 1583365135
    },
    {
        "content": "<p>Dear Emma Jones. Thanks for your feedback on my question. This was a good idea. We have discussed several approaches, but this might be the best.</p>",
        "id": 190151267,
        "sender_full_name": "Knut Aavatsmark",
        "timestamp": 1583829659
    }
]