[
    {
        "content": "<p>Why does CarePlan.activity.detail.kind have a Required valueset, a valueset that contains the very generic 'Task' alongside the quite more specific 'VisionPrescription', for example? I can understand if you want to restrict ActivityDefinition.kind (which by the way has similarities, but seems to have been more curated by actual needs from the community) to be able to run $apply in a somewhat standardized way (but even then, it should probably be better to use Extensible instead?). But for a CarePlan, to even try to restrict the various 'kinds' of activities that can be tracked in a plan (or having the guts to deem oneself able to make a perfect choice)...? Not sure about the logic there, to say nothing about the random-looking selection of codes.</p>",
        "id": 218267646,
        "sender_full_name": "Petter Wolff",
        "timestamp": 1606730834
    },
    {
        "content": "<p>The list of codes are the list of possible FHIR resources</p>",
        "id": 218325479,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606760831
    },
    {
        "content": "<p>Thanks Lloyd - which kind of use case is envisioned where 'kind' is used to describe inline (i.e. CarePlan.detail) attributes of the activity, in the form of a resource?<br>\nI also think it seems limiting for the use of the quite generic term 'kind'. The term should specify better the intended use, no?</p>",
        "id": 218675951,
        "sender_full_name": "Petter Wolff",
        "timestamp": 1606991741
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 218711814,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607010337
    },
    {
        "content": "<p>If you need something more than can be specified with the inline information in the <code>detail</code> element, you would use the reference to the resource, rather than specifying it inline in the CarePlan at all.</p>",
        "id": 219214919,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1607439015
    }
]