[
    {
        "content": "<p>Hello,</p>\n<p>I'm working with a care plan for people with diabetes and I'm quite new to FHIR . I'm wondering how to use the $apply operation to apply  the plan definition to a specific patient and have a care plan as a result? Is there any material that I could watch or read to help me to understand how this works?</p>",
        "id": 200852312,
        "sender_full_name": "Katri Karhinoja",
        "timestamp": 1592201114
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"300778\">@Katri Karhinoja</span> , there is a walkthrough of the behavior in the PlanDefinition resource documentation <a href=\"http://hl7.org/fhir/plandefinition.html#12.18.3.3\">here</a></p>",
        "id": 200970811,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592279998
    },
    {
        "content": "<p>Thank you! Do you know if I could test the operation somewhere?</p>",
        "id": 200974818,
        "sender_full_name": "Katri Karhinoja",
        "timestamp": 1592285460
    },
    {
        "content": "<p>There is an Anemia testing recommendation here: <a href=\"http://build.fhir.org/ig/who-int/anc-cds/branches/RecB2_4/anc-recommendation-b1-1.html\">http://build.fhir.org/ig/who-int/anc-cds/branches/RecB2_4/anc-recommendation-b1-1.html</a></p>",
        "id": 201051907,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592330280
    },
    {
        "content": "<p>It's deployable to <a href=\"http://cds-sandbox.alphora.com/cqf-ruler-r4/fhir\">http://cds-sandbox.alphora.com/cqf-ruler-r4/fhir</a></p>",
        "id": 201051990,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592330305
    },
    {
        "content": "<p>It's not there now, but if you give us a bit we can get it loaded there</p>",
        "id": 201052024,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592330322
    },
    {
        "content": "<p>You should also be able to load it in the latest Logica sandboxes</p>",
        "id": 201052091,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592330352
    },
    {
        "content": "<p>There's a quick start <a href=\"http://build.fhir.org/ig/who-int/anc-cds/branches/RecB2_4/quick-start.html\">here</a> that shows how to load the content into a FHIR server</p>",
        "id": 201052478,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592330519
    },
    {
        "content": "<p>How do you deal with actions that are dependent on the outcome of another action?  For instance, let's say I have a PlanDefinition that is dealing with some condition and outlines a series of tests or procedures to be performed to make a determination of what line of therapy to prescribe the patient.  In this case I can a series of actions that outline the tests/procedures required to make the determination, but when it comes to dealing with outcome of those tests the current process defined in PlanDefinition for the $apply operation is lacking.  </p>\n<p>As the process is currently described for $apply all of the information for whether or not an action is applicable is seemingly supposed to be known at the time the operation is being preformed.   In the case outlined above, the applicability for the action would not be known until after the tests were performed so under the current definition of $apply those subsequent actions would not apply because the data required for them is currently unknown. </p>\n<p>I can see dealing with this by stating that if an action is dependent on other related actions it may apply to the process and be carried over into the resulting CarePlan/RequestGroup.   That way the applicability could be evaluated after the tests.   This still leaves a gap when dealing with actions that are depending on the outcome of other actions if the action.definition[x] is a PlanDefinition.  </p>\n<p>According to the $apply process if the action you are evaluating has a definition[x] that is a PlanDefinition you are supposed to run the $apply operation on that PlanDefinition and add the result to the RequestGroup.   If you simply run this operation on the embedded PlanDefinition this will more than likely result in an CarePlan/RequestGroup that contains no actions because the data required by the embedded PlanDefinition is not known at that time.  </p>\n<p>Going back to the example, I can see a PlanDefinition that contains a PlanDef for the series of tests and 1 or more PlanDefs that outline the line(s) of therapy for the patient based on the outcome of the tests.  But how do you evaluate the lines of therapy actions when you don't have the required information in advance to apply the subsequent PlanDefinitions.</p>",
        "id": 208077279,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1598439525
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214452\">@Rob Dingwell</span> , the actions have \"input\" and \"output\" elements that can be used to specify data flow between actions, but the behavior to create the actions conditionally in the CarePlan/RequestGroup is not specified. You could use the absence of data as the trigger to know to create the action conditionally, but that wouldn't be necessarily true in all cases. Seems like you would need a way to say that the applicability of the action could not be determined until the expected data is available, like an indicator on the input data element.</p>",
        "id": 208108665,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1598456247
    },
    {
        "content": "<p>What would actually be nice is a way in a CareP{lan/RequestGroup to say evaluate this other PlanDefinition once you reach a certain point.  So an action within the RequestGroup would be to evaluate a PlanDefinition.   </p>\n<p>Another thought would be to provide an alternative means to generate a RequestGroup from a PlanDefinition for such cases that did not take the applicability of actions into account.   This would for the most part copy all of the PlanDefinition actions into a RequestGroup.  RequestGroup already contains the ability to determine what actions to take based on the same sort of applicability condition so why not allow for that to be the means to filter out what actions to take?  </p>\n<p>Yet another thought would be to allow action.definition[x] to be a RequestGroup as well.  Archives the same notion as generating a RequestGroup from a PlanDefinition without the need to go through the $apply operation.</p>",
        "id": 208213277,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1598533445
    },
    {
        "content": "<p>Apologies for the delay here, went on vacation and just getting caught up. What about a parameter to the $apply for whether to assess applicability as part of realizing a PlanDefinition? And the idea of referencing a PlanDefinition from a RequestGroup would work well, but the other direction, we wouldn't be able to do, since a RequestGroup is a subject-specific resource, there'd be no subject to point to (that's really the only difference between the resources). If you want to submit trackers for these, happy to try them out</p>",
        "id": 209581648,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1599694516
    },
    {
        "content": "<p>No worries,  if I was smart I would go on vacation at some point.  </p>\n<p>As far as adding trackers, do you mean in Jira on the ig?  I can certainly do that.  Would you like a single tracker that explains the issue trying to be resolved or multiple trackers for each example.</p>",
        "id": 209708717,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1599771747
    },
    {
        "content": "<p>Maybe start with a single tracker to support the discussion</p>",
        "id": 209798560,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1599839497
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Looking at  <a href=\"https://jira.hl7.org/browse/FHIR-25056\">https://jira.hl7.org/browse/FHIR-25056</a> I see that the resolution for that was agreed that RequestGroup would be added as result for the $apply operation.   Is there a plan to add it into the spec at some point?  I don't see it in R4 or R5 at this time.</p>",
        "id": 210315023,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1600287517
    },
    {
        "content": "<p>Yes, that's on the backlog to apply, just haven't gotten there yet</p>",
        "id": 210332476,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1600299054
    }
]