[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Could you help me with this question I have about the CPG IG. I’m having difficulty understanding the difference between the Pathway, Strategy, and Recommendation definitions in the CPG IG. I’m trying to the map a single Breast Cancer NCCN guideline into CPG. The guideline is broken into BINV-# where each one shows a very small flow (typically a condition like tumor size then different treatment options which each then point to the next BINV-#). Would each of these small BINV’s be a StrategyDefinition or a RecommendationDefinition?</p>",
        "id": 207861167,
        "sender_full_name": "Benjamin Langley",
        "timestamp": 1598284733
    },
    {
        "content": "<p>The three levels are provided as a way to help organize the artifacts, so yes, what you're describing sounds like they would be strategies (though they might be single recommendations if the treatment options are just a single activity or group of activities). For example, in the Antenatal Care CPG, the pathway is the overall contact schedule (the mother should have 8 visits at specific points during the pregnancy), the strategy is the approach taken at each visit, and the recommendations are focused on particular activities (like recommend iron supplementation if the mother has anemia).</p>",
        "id": 208019866,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1598387827
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  looking at the example that you mention I see that the action definition[x] are all pointing at Questionnaires.  Looking at the profiles, Pathway and Strategy appear to be restrict definition[x] to only allow PlanDefinition and Recommendation only allows ActionDefinition.  Am I missing something or is this an oversight in the profiles ?</p>",
        "id": 208074112,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1598437249
    },
    {
        "content": "<p>Yes, that's an oversight in the Strategy profile, it should allow references to Questionnaire.</p>",
        "id": 208105557,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1598454918
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-28360\">https://jira.hl7.org/browse/FHIR-28360</a></p>",
        "id": 208106896,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1598455461
    }
]