[
    {
        "content": "<p>How does one execute on a RequestGroup ?  </p>\n<p>For instance, after executing the $apply operation on a PlanDefinition a  RequestGroup or CarePlan with a RequestGroup  is generated and would logically contain a number of actions/sub actions and the requests that that go with them.   These actions have a status of draft and an intent of option (it's an option of the RequestGroup) at this point.   Beyond determining what the first action to take is what is needed to execute the request for that action?  Is it enough to set the status of the request to active? </p>\n<p>Is there anything different that should be done for requests that are contained resources in either the CarePlan or RequestGroup?  Should these be issued as stand alone resources?  </p>\n<p>Is there any guidance on using the CarePlan/Request group once it has been created?</p>",
        "id": 213349288,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1602708844
    },
    {
        "content": "<p>I would also wonder if there have been any thought around this when you have a series of looping criteria.  Something along the lines of going through a series of actions and at the end possibly going back through that same series of activities until a desired outcome is reached.</p>",
        "id": 213350108,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1602709286
    },
    {
        "content": "<p>Asking for fulfillment of <em>any</em> Request would follow one of the <a href=\"https://build.fhir.org/workflow-communications.html\">workflow communication patterns</a> - typically using Task, but not always.</p>",
        "id": 213351266,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602710007
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .   Does anyone know if there are existing systems that support those workflows?  Or even more specifically that support executing on a RequestGroup with it's actions , related actions,  applicability conditions ...  ?</p>",
        "id": 213417943,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1602765641
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 213431016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602771033
    },
    {
        "content": "<p>There are some projects in-flight, yes, at varying levels of completion.</p>",
        "id": 213490957,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602797726
    },
    {
        "content": "<p>I don't think I would characterize any of them as \"existing systems\" though</p>",
        "id": 213490995,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1602797753
    }
]