[
    {
        "content": "<p>Care Plan includes references to a variety of request activities, but it also has a “detail” structure for codes, reasons, performers, etc. that can be used if you have the data fields but not the resource.<br>\nIs that actually helpful? If you don’t have the ServiceRequest resource in your repository, but you do have a procedure code, is it much easier to put that in the backbone element than to instantiate a contained ServiceRequest?<br>\nNeither backbone nor contained resource can be identified or given provenance. It was suggested that you can’t search on a contained resource, but the Detail elements aren’t in the Search Parameters. Should Detail be removed so we can reduce the number of structures a recipient needs to understand?</p>",
        "id": 224529313,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1611952509
    },
    {
        "content": "<p>It was more a question of providing a minimum set of data that 'simple' systems could support without taking on the complexity of all of the full-blown resources.  It's not really a question of external reference vs. internal - as you're correct that you can easily capture all of the request resources as contained if you need to.</p>",
        "id": 224536691,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611956016
    },
    {
        "content": "<p>That's my understanding, but the only property the \"full blown\" service request requires that is not required by Detail is intent. Which seems important.</p>",
        "id": 224667633,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1612130605
    },
    {
        "content": "<p>The detail within CarePlan would always have the same intent as the CarePlan itself.</p>",
        "id": 224668161,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612130847
    },
    {
        "content": "<p>For the projects I've been involved in, we never use detail, we always model activities with Request resources and the fulfilling Event resources.</p>",
        "id": 252524809,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631131791
    }
]