[
    {
        "content": "<p>Hello,</p>\n<p>I work with CPESN USA, a network of community pharmacies, that has been very involved with development of an IG for a pharmacist care plan (<a href=\"http://hl7.org/fhir/us/phcp/\">http://hl7.org/fhir/us/phcp/</a>). I was just recently introduced to your project with the MCC and it looks like there are a lot of similarities, although the pharmacist care plan was designed with some aspects to be specific to the pharmacy-world.</p>\n<p>I would be interested to learn more about the MCC and have been following along some with the connectathon some this week as time allows. One question that I wanted to ask about the MCC is whether any drafts of the IG are available yet - I saw on some slides that it looks like it won't be published until September, is this correct?</p>\n<p>Thank you!<br>\n-Hugh Heldenbrand</p>",
        "id": 197578459,
        "sender_full_name": "Hugh Heldenbrand",
        "timestamp": 1589472598
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"241119\">@Hugh Heldenbrand</span> yes we are building MCC eCare Plan FHIR IG from learnings from Pharmacist Care Plan work. Shellly Spiro sits on the MCC eCare Plan Technical Expert Panel. Please review MCC eCare Plan Confluence page and sign up to join the bi-weekly HL7 meetings:  <a href=\"https://confluence.hl7.org/display/PC/Multiple+Chronic+Conditions+%28MCC%29+eCare+Plan\">https://confluence.hl7.org/display/PC/Multiple+Chronic+Conditions+%28MCC%29+eCare+Plan</a></p>",
        "id": 197579399,
        "sender_full_name": "Evelyn Gallego",
        "timestamp": 1589472959
    },
    {
        "content": "<p>However, the pharmacist Care Plan is a FHIR (and CDA) document based (snapshot in time) the MCC eCare Plan is intended to define a dynamic plan. <span class=\"user-mention\" data-user-id=\"241119\">@Hugh Heldenbrand</span> A draft, non balloted IG will be completed by September. A balloted IG is not planned until Sept 2022.</p>",
        "id": 197580200,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1589473278
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span> Thanks, Gay. The snapshot aspect of the pharmacist care plan is certainly central to how we (CPESN USA) and the implementers have built the infrastructure to send the data, although we still treat the data in the plan as \"longitudinal\" so it can grow over time and is in that sense dynamic. How is a dynamic plan different?</p>",
        "id": 197585077,
        "sender_full_name": "Hugh Heldenbrand",
        "timestamp": 1589475353
    },
    {
        "content": "<p>The dynamic plan is \"live\". Its a Care Plan as it would be seen within an EHR that is ever changing. In the case of the MCC eCare plan, the intent is the the IG will support (in the project implementation of the IG) - a SMART on FHIR app - that will query for and pull in data from any system a patient interacts with. So a centralized \"live\" view.  As Evelyn said - would be great to have you join the calls.</p>",
        "id": 197588937,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1589476939
    },
    {
        "content": "<p>Thanks, I will think about joining the calls. So would this require a central server to track all of the updates? Or would it be decentralized where a system would just communicate updates to all the other systems that the care plan lives on?</p>",
        "id": 197603475,
        "sender_full_name": "Hugh Heldenbrand",
        "timestamp": 1589483308
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"241119\">@Hugh Heldenbrand</span> we have not discussed the architecture for implementation. But important to consider in the build and when we kick off pilots with OSHU in the fall</p>",
        "id": 197604917,
        "sender_full_name": "Evelyn Gallego",
        "timestamp": 1589483950
    }
]