[
    {
        "content": "<p>Hi All,<br>\nCan you please assist with implementation guide for post discharge care plan?<br>\nWhen a patient is discharged from the hospital he\\she receives a form, which includes different \"sections\" like orthopedic recommendations, physiotherapy recommendations, welfare assessment, information regarding sick leave, and formal sick note.<br>\nI found the CarePlan Resource as most appropriate to represent this case, for example, it is more extensive and flexible than the ServiceRequest Resource.<br>\nIs there any best practice for implementing this kind of data? <br>\nThanks in advance!</p>",
        "id": 266805281,
        "sender_full_name": "Liron Shahar-Atia",
        "timestamp": 1641301703
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 266832679,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641314721
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"461330\">@Liron Shahar-Atia</span> Yes, the CarePlan resource would be appropriate to use for post discharge plan. It is more extensive and by using the CarePlan resource, you will have an added advantage of  \"containing\" all activities associated with the same discharge.  Hope this helps.</p>",
        "id": 267002264,
        "sender_full_name": "Emma Jones",
        "timestamp": 1641422503
    },
    {
        "content": "<p>Thanks Emma, it does help to know I am on the right way :) <br>\nBut is there some kind of implementation guide to assist me on deciding which information belongs to which element of the CarePlan resource?<br>\nI hoped someone could share from his/her own experience what is the best practice, especially for all those different kinds of textual fields that I mentioned on my first post.</p>",
        "id": 267034052,
        "sender_full_name": "Liron Shahar-Atia",
        "timestamp": 1641455827
    },
    {
        "content": "<p>Have you reviewed the examples in the specification, such as <a href=\"http://build.fhir.org/careplan-example-integrated.json.html\">http://build.fhir.org/careplan-example-integrated.json.html</a>?</p>",
        "id": 267124411,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1641508401
    },
    {
        "content": "<p>Thanks for your reply.<br>\nOf course I reviewed this. I analyzed the structure of the CarePlan resource and found a few different textual field, but they are all general. I was hoping someone implemented specifically the discharge-form and can advise what is the best way to manage all of those assessments and recommendations.</p>",
        "id": 267341597,
        "sender_full_name": "Liron Shahar-Atia",
        "timestamp": 1641713301
    },
    {
        "content": "<p>Assessments will typically be captured using either Condition or Observation (or maybe ClinicalImpression, though that's not widely supported).  The recommendations could be represented as CarePlan activities or as various Request resource instances.</p>",
        "id": 267377317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641761798
    },
    {
        "content": "<p>Great, thank you Lloyd!<br>\nAfter creating a few drafts of the CarePlan, I will review the post discharge form again, this time according to your recommendation.</p>",
        "id": 267378372,
        "sender_full_name": "Liron Shahar-Atia",
        "timestamp": 1641763245
    }
]