[
    {
        "content": "<p>Where do you reference Advanced Directives (aka Consent <a href=\"https://www.hl7.org/fhir/consent.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/consent.html\">https://www.hl7.org/fhir/consent.html</a>) within the CarePlan?  CarePlan.supportingInfo ?? CarePlan.activity.outcomeReference? Either? Elsewhere?<br>\nOR<br>\n<span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> - I am having difficulty  seeing how consent will meet the needs of an Advance directive and I see from another comment (<a href=\"#narrow/stream/179166-implementers/topic/Question.20on.20.20advance.20directives.20as.20Consent\" title=\"#narrow/stream/179166-implementers/topic/Question.20on.20.20advance.20directives.20as.20Consent\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Question.20on.20.20advance.20directives.20as.20Consent</a>) you concur . At this point, using a refrenced observation ,might be better?</p>",
        "id": 190125621,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1583793524
    },
    {
        "content": "<p>Agreed - In our prior analysis of the applicability of various FHIR Resources to represent the kinds of information included in a person's Advance Directives, we found the consent resource was only appropriate for representing the Health Care Agent Assignment. The other goals and preferences were better represented using FHIR Goal and Observation Resources. <span class=\"user-mention\" data-user-id=\"270306\">@Maria D Moen</span></p>",
        "id": 190333669,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1583962089
    },
    {
        "content": "<p>I think I heard that advanced directives has been moved out-of-scope for Consent resource</p>",
        "id": 190399063,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584025057
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . If one wanted to retrieve  ANY information in any format about Advanced Directives using FHIR that exits in an ER - what would you suggest?We are interested in defining in a FHIR Care Plan IG  a <em>basic</em> way  (first) of bringing that into a Mutliple Chronic Condition Care Plan</p>",
        "id": 190422852,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1584035810
    },
    {
        "content": "<p>IMHO I expect advanced directives to primarily live in the paper world, thus would look for metadata entries in FHIR DocumentReference. Some of these will become codeable eventually, but still would have primary existence in the paper world.</p>",
        "id": 190427331,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584038028
    },
    {
        "content": "<p>Thank-you. I concur.</p>",
        "id": 190427434,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1584038081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194479\">@Gay Dolin</span> I agree with John. And, this is what implementers I work with are doing already. The person's advance directives are preserved as a document and indexed by DocumentReference.  The document is stored in the referenced Binary resource. I do think we can gain some insight from the work we did in the Supplemental templates for C-CDA R2.1 to clarify the role of the Advance Directives templates in C-CDA.  Those observations hold information about what sorts of goals and preferences the person has included in his or her Advance Directives.  For examples, the person has supplied his or her wishes or preferences regarding tube feeding under certain circumstances.  These are observations that make it easier for a clinician to find and access information that may be relevant to care planning.  You always need to be careful not to mix up what you are talking about when you use the term \"Advance Directives\" .  It gets used to mean different things.  There are other documents that are signed and show when decisions have been made because the choices were needed to be made (\"Directives\") in the context of an encounter or episode of care, and then there are these other documents that people write in advance of when choices need to be made which provide instructions about what to consider in the future should decisions need to be made (\"Advance Directives\").  The key distinction is being clear about when you are talking about the documents that communication information to be used in future decision making versus documentation of decisions that have been made  in the context of an encounter or episode of care.  I only use the term \"Advance Directives\" to mean the later, but many people lump these two distinct things together and use the same term of \"Advance Directives\" to mean both \"Advance Directives\" and \"Directives\".  The trickiness of these what each person thinks their words mean is part of the reason there is always confusion when discussing \"advance directives\".</p>",
        "id": 195332762,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1587904499
    }
]