[
    {
        "content": "<p>Looking to solve a bit of a mystery regarding the CarePlan resource. I'm implementing US Core compatibility, however I noticed that there is a 'text' element in US Core that is not defined anywhere in the actual R4 CarePlan resource. There are a few elements that could be a viable substitute, but I'm wondering why the CarePlan US Core profile uses a field that is not present in the resource? I have not found this issue in other resources I have worked with thus far. Thanks</p>",
        "id": 199387842,
        "sender_full_name": "Joe Jordan",
        "timestamp": 1591027654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306639\">@Joe Jordan</span> \"Resource.text\" element is inherited by (almost) all FHIR resources from the Domain Resource. See <a href=\"http://hl7.org/fhir/R4/domainresource.html\">http://hl7.org/fhir/R4/domainresource.html</a>. Even when \"Resource.text\" is not explicitly stated in a profile, it's normally a good practice to populate it with the text summary of the resource  for human interpretation.</p>",
        "id": 199437919,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1591056547
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span> I didn't catch the type on the actual resource itself.</p>",
        "id": 199489052,
        "sender_full_name": "Joe Jordan",
        "timestamp": 1591103778
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306639\">@Joe Jordan</span> and <span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span>  However, this is limiting factor in the use of US Core Care Plan - especially wrt to retrieving. Care Plan (where they DO exist properly in systems) are generally represented with discrete data elements and do not typically have a \"a narrative summary of the patient assessment and plan of treatment\". The other limiting factor is the requirement that it be an \"Assess-Plan\" type of plan - (a category code of “assess-plan”) which is not clear what that is and is likely to be problematic in querying. <span class=\"user-mention\" data-user-id=\"191395\">@Dave Carlson</span> has found this to be true in FHIR Connectathons. In our Multiple Chronic Condition Care Plan Project (<a href=\"https://confluence.hl7.org/display/PC/Multiple+Chronic+Conditions+%28MCC%29+eCare+Plan\">https://confluence.hl7.org/display/PC/Multiple+Chronic+Conditions+%28MCC%29+eCare+Plan</a>) we will be using the base resource.</p>",
        "id": 200702235,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1591984335
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span> , text can be (and often is) generated from the discrete elements. US Core defines that \"Each CarePlan must have: a narrative summary of the patient assessment and plan of treatment\". I assume there was a reason for defining this as mandatory (e.g. a need to communicate a Care Plan to/from an app that doesn't support / understand discrete elements).</p>",
        "id": 200720679,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1591993582
    },
    {
        "content": "<p>Correct: \" I assume there was a reason o defining this as mandatory (e.g. a need to communicate a Care Plan to/from an app that doesn't support / understand discrete elements).\" However, it will also encourage persistence of this continued practice. Generated text is OK - but often doesn't add much. Note that we will be re-using everything else US Core, The US Realm Steering Committee and FMG are aware of this concern and plan.</p>",
        "id": 200724641,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1591996048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span> are you aware of any plans to alter the CarePlan US Core profile, specifically in reference to the narrative text field? I'm implementing some functionality around the resource now and would like to stay ahead of the curve if possible. I'd rather not implement the narrative field if there are plans to remove it in the future.</p>",
        "id": 201075714,
        "sender_full_name": "Joe Jordan",
        "timestamp": 1592342470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306639\">@Joe Jordan</span> I am confident it will be discussed the next time US Core is updated. I am unsure of the schedule for updating US Core. <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ??</p>",
        "id": 201084756,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1592348660
    }
]