[
    {
        "content": "<p>one question for my learning purpose... If you can answer..</p>\n<p>I have a dicom file which is parsed in xml/json using a jar file </p>\n<p>Now the request is to create FHIR resources out of it..</p>\n<p>There is information about Measurement Group which talks about <br>\nActivity session<br>\nTracking Identifier<br>\nTracking unique Identifier<br>\nAlgorithm Name<br>\nAlgorithm Version<br>\nAlgorithm Parameters</p>\n<p>It also talks about area, length, angle of lungs structure</p>\n<p>Do you know which fhir resource can be used to represent this information. I dont see ImagingStudy having attributes to support this.</p>",
        "id": 255025600,
        "sender_full_name": "Sahil Khanna",
        "timestamp": 1632738755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> ?</p>",
        "id": 255041895,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632747058
    },
    {
        "content": "<p>No, you are correct, ImagingStudy does not have the attributes to support this. ImagingStudy approximates the information in a C-FIND/QIDO query.</p>\n<p>I assume you've converted the DICOM file to standard DICOM XML or JSON, or the new \"simplified\" DICOM JSON. My first question is why do you need to create FHIR resources out of it? Why are the DICOM xml/json formats not sufficient? Because the model is quite different, converting DICOM SR to FHIR is likely to lead to some loss of information, or will require so many custom extensions that processing the created resources may not be any easier than processing the DICOM.</p>\n<p>There is no standard mapping to FHIR, yet, although there is some experience being gained in this area. Your measurements are likely Observations, the algorithm information would be Device, etc.</p>\n<p>There is an ongoing effort to define better mappings between DICOM SR and FHIR. You can see more about the current state <a href=\"https://confluence.hl7.org/display/IMIN/Mapping+of+DICOM+SR+to+FHIR\">here</a>, and <span class=\"user-mention\" data-user-id=\"277357\">@Christopher Lindop</span> or <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span>  may be able to provide more insight.</p>",
        "id": 255070943,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632757607
    }
]