[
    {
        "content": "<p>thanks, that makes sense.</p>",
        "id": 153900169,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1501698528
    },
    {
        "content": "<p>hello,</p>\n<ul>\n<li>ADT A02: (Transfer a patient)<br>\ncontains 12 segments<br>\n MSH - Message Header<br>\nSFT - Software Segment<br>\nEVN - Event Type<br>\nPID - Patient Identification<br>\nPD1 - Patient Additional Demographic<br>\nROL - Role<br>\nPV1 - Patient Visit<br>\nPV2 - Patient Visit - Additional Information<br>\nROL - Role<br>\nDB1 - Disability<br>\nOBX - Observation/Result<br>\nPDA - Patient Death and Autopsy<br>\nlike that  in fhir what are the resources we need to transfer a patient?</li>\n</ul>",
        "id": 153904022,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1504089618
    },
    {
        "content": "<p>Hello all. I'm trying to map some V2 appointment data into FHIR model, and I'm confused by the difference between reason and type. I need to find a home for both SCH-7 and SCH-8 data. The FHIR Appointment resource description seems to me to suggest SCH-7 should go in appointmentType, but the mappings show it allocated to reason. In addition, there is no mapping at all for SCH-8, and whilst AIS-3 also maps to reason, ARQ-7 (which I thought was similar) maps to appointmentType. Is there any standard guidance for this? Any help much appreciated!</p>",
        "id": 153904285,
        "sender_full_name": "Tom Pick",
        "timestamp": 1504255430
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 153904335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504292088
    },
    {
        "content": "<p>After reviewing V210.2.3.3 and 10.2.3.4 in version 2.8.2  I can see cause for confusion, because in IMO the listed examples for reasons are in fact appointment types ...</p>\n<ul>\n<li>\n<p>SCH-7 Appointment Reason also uses 0276 which based on the description seems inappropriate as it is the 'Reason codes to describe the reason that the service is occurring or the resource is being used' and I think is more  aligned with concepts like 'suture out' or 'recheck ear'</p>\n</li>\n<li>\n<p>SCH -8 Appointment Type uses 0277 which seems to overlap with 0276 - it describes the kind of appointment for administrative reason. ( and I think of these as new patient, recheck, discharge, walk in, emergency)  andin V2 it suggested values in table 0277 which seems to overlap with 0276 this element is aligned with the AppointmentType element which uses table 0276.</p>\n</li>\n</ul>\n<p>in Summary:</p>\n<ul>\n<li>.appointmentType --&gt; SCH-8 and ARQ-8</li>\n<li>.reason --&gt; SCH-7 and ARQ-7</li>\n</ul>\n<p>So I think the existing FHIR --&gt; V2 mappings are incorrect and moreover the definitions in V2 do not align with the codes which can be misleading.  Having said that in the real world these fields may be conflated into one.  (new patient/check ear)</p>",
        "id": 153904341,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504319453
    },
    {
        "content": "<p>Thanks so much for your helpful reply <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> (and sorry for the lateness of mine). If I've understood you correctly, you're suggesting mapping v2 type to FHIR type, and v2 reason to FHIR reason, which is definitely appealing for its simplicity. As such, I think I'll go with that. I do think these fields are used flexibly in the real world, but I have to pick something I suppose! I'm new to how these things work - is there anything I can do to help get this corrected in the docs? Is there some process that requires that to go to wider discussion? Please let me know if you'd like me to raise this elsewhere.</p>",
        "id": 153904774,
        "sender_full_name": "Tom Pick",
        "timestamp": 1504768777
    },
    {
        "content": "<p>You can create a tracker for the responsible group to update the mappings. just click on the link 'Propose a Change' at the bottom of the page in the spec to raise an issue.</p>",
        "id": 153904855,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504808203
    },
    {
        "content": "<p>Ah top tip! Thanks.</p>",
        "id": 153904954,
        "sender_full_name": "Tom Pick",
        "timestamp": 1504855821
    },
    {
        "content": "<p>Hi,<br>\nI am new to FHIR. Can you tell me what are the resources in FHIR is needed for ADT A04 message?</p>",
        "id": 153993624,
        "sender_full_name": "Prince Melvin",
        "timestamp": 1536213477
    },
    {
        "content": "<p>What are you trying to accomplish? Create a ADT A04 message from FHIR data or vice versa? What is the ultimate goal? Is it enough to create the outpatient Encounter or are you aiming to transfer the complete (potential) content of an ADT_A04 message (including coverage, diagnosis and whatnot)?</p>",
        "id": 153993667,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1536224623
    },
    {
        "content": "<p>We have Montreal bagels at table 21 for those interested in trying the local cuisine. Denser and sweeter than New York bagels, some say you don't even need cream cheese (but we have that too)</p>",
        "id": 164921232,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1557065868
    },
    {
        "content": "<p>First come first serve</p>",
        "id": 164921235,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1557065876
    }
]