[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> : We need guidance on what is permissible when mapping a v2 value to a FHIR value set where the value set for the attribute being mapped to is required, not extensible. <br>\nIs it permissible that in addition to the FHIR value in .coding[1] the original v2 value is included as coding[2] (if not 3 and 4 as well if the CWE is fully loaded with three triplets)?  We think it is, but want to confirm.<br>\nIs it permissible that if there is no acceptable mapping, that only .text is valued, not .coding?</p>",
        "id": 209826211,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1599853342
    },
    {
        "content": "<p>If there's a required binding, then the element can only be present if it includes a coding from the value set - you can't send the element at all (whether with extensions, just .text, alternate codings, whatever) if it doesn't have a coding from the bound value set.  <em>If</em> you have a code from the required value set, you're free to send as many other codings and extensions as you like, as well as text.</p>",
        "id": 209831223,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599856167
    },
    {
        "content": "<p>If the element is mandatory, then you can't construct the containing element.  If the containing element is the resource, you can't instantiate the resource.</p>",
        "id": 209831281,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599856200
    },
    {
        "content": "<p>Obviously, if you run into a situation where that happens, a change request to the FHIR core spec seems appropriate...</p>",
        "id": 209831356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599856227
    },
    {
        "content": "<p>Can you use just the v2 coding if the FHIR IG has an extensible code set, example PV1-2(User Defined) to Encounter.class?  In reality, no one is willing to pay for the custom mapping of a v2 to FHIR based on their user defined tables.  So if we can't create the Encounter, we have data loss whereas if we could create with the coding we have and it might give some value.</p>",
        "id": 210416105,
        "sender_full_name": "Linda",
        "timestamp": 1600360803
    },
    {
        "content": "<p>You can't use a v2 code if the FHIR-bound value set 'covers' the v2 concept.  (At least not and be conformant.)</p>",
        "id": 210416481,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600361010
    }
]