[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> , <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : In v2-to-FHIR we have various fields where an HL7 v2 table value set needs to be mapped to a value set that is fixed and involves a mandatory field.  The project team is seeking clarity on the following options and perhaps alternatives to maintain the fidelity of the data sent and passed on.</p>\n<ul>\n<li>Are null flavors acceptable values to populate such FHIR attributes when \"unknown\" or similar catch-all are not included?</li>\n<li>If null flavors are not acceptable values and no reasonable catch-all is available, and the owner of the field cannot add a catch-all or actual value, how are we to populate such mandatory FHIR attribute.</li>\n<li>When using a null flavor (if acceptable) or other catch-all, is it acceptable to also have an extension on the FHIR attribute at hand to maintain the original value from the v2 message?</li>\n</ul>",
        "id": 208598263,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1598899076
    },
    {
        "content": "<p>Not sure what you mean by 'null flavors'.  In FHIR, if you have a required binding, you <em>must</em> send one of the specified codes if you include the element.  If an element is mandatory and you don't have a value that's part of the allowed list, you can't create a conformant instance.</p>",
        "id": 208602371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598901005
    },
    {
        "content": "<p>You're free to send extensions <em>too</em>, but if the binding strength is required, you can't send an extension <em>instead</em> of a value from the bound value set.</p>",
        "id": 208602429,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598901048
    },
    {
        "content": "<p>Obviously if you find a place where there's a required binding on a mandatory element in core that you're concerned you won't have a value for, you should raise that ASAP...</p>",
        "id": 208602494,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598901086
    },
    {
        "content": "<p>So we'll have to submit vocabulary update requests then where we run into this.  As we work through, we'll do so.</p>",
        "id": 208611363,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1598905826
    },
    {
        "content": "<p>Either that or requests to loosen the binding strength and/or cardinality expectations.</p>",
        "id": 208624227,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598913568
    }
]