[
    {
        "content": "<p>Hi, I am new to this stream, so sorry for asking a basic question.<br>\nI tried my hand at Fhir Mapping Language (FML) and my thought was that FML can be used to convert V2 to FHIR using structure maps, to my surprise I see that the V2toFHIR defines conceptmaps as in the link <a href=\"https://github.com/HL7/v2-to-fhir/blob/master/fsh/Message%20ADT_A08%20to%20Bundle.fsh\">https://github.com/HL7/v2-to-fhir/blob/master/fsh/Message%20ADT_A08%20to%20Bundle.fsh</a> , please help me understand the decision and implementation here as I was looking at FML as the solution</p>",
        "id": 243330364,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1624237276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> <br>\n(I'm curious too - this seems an odd use of ConceptMap...)</p>",
        "id": 243732735,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624498004
    },
    {
        "content": "<p>This was a fundamental decision in the project to do using ConceptMaps rather than FML or StructureMaps with Grahame in the room.  </p>\n<p>The problem with FML is that for review of mappings it is too \"obtuse\" to read and compare, rather a spreadsheet presentation provides the appropriate visual representation to establish, manage, and review actual mappings.  </p>\n<p>It was clearly recognized that that is not as computable and amenable to validation tools as other syntaxes, so there was also clear agreement that a structured format would be important.  The choice was on ConceptMap  as the ConceptMap structure was the easiest to map into (with some extensions) that other tools could then use to create either mapping tools directly, or StructureMaps and subsequently FML as they wish and see fit with the full knowledge of their local implementations that at the standard level would not be available, without encumbering that level of complexity and obtuse expressions that would make creation, managing, and review of maps inclusive of a wider audience that understand the data at hand.</p>\n<p>And it works.  Parties use the .csv or the ConceptMap as their starting points.  So you can decide to generate your FML as you see fit.</p>",
        "id": 243864704,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1624582015
    },
    {
        "content": "<p>Thanks for the explanation!</p>",
        "id": 246339767,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1626549880
    }
]