[
    {
        "content": "<p>What are good patterns for when there are multiple source systems feeding in to FHIR, and they are maintaining two slightly different versions of a patient? Say you are taking two lab feeds, and new records over time from both. There are PID segments in each, and they are judged to be the same patient (same identifier and other match fields) but with some slight differences. You can't keep updating the one FHIR patient as this might cause the demographics to continually flip-flop. For some fields you could do a merge e.g. keep both versions of their address in one FHIR resource. For other fields you cannot do this merge. Do you create two patient resources and make one the (arbitrary) active master and one the inactive one and link the two? This preserves the sources, when you cannot ascertain which one is actually correct (if either). This question lead on from Provenance one - you can at least say where each one came from and update the correct ones each time around.</p>",
        "id": 162288049,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1554160583
    },
    {
        "content": "<p>REST is client side orchestration, so by default the answer will be the flip flop as described above. <br>\nIn messaging the server gets to ignore the PID data from what it regards as 'less reliable PID sources' (apart from using the patient identifier for referencing purposes). This calls for server side logic, to allow a server to 'silently ignore' certain PID updates. <br>\nA RESTful server can't \"silently ignore\" an update. So either a RESTful server should reject Patient resources from less reliable sources (but: what would the error message for the rejection be?).  <br>\nIf you don't want to use a FHIR message, then this may require a custom server side operation, e.g. [base]$updatePatient. This would allow server side logic and the silently ignoring of certain updates.</p>",
        "id": 162301628,
        "sender_full_name": "René Spronk",
        "timestamp": 1554177883
    },
    {
        "content": "<p>I'm not sure there is anything FHIR specific about this problem. I've seen it plenty of places that use v2 as well. Typically, I've seen systems flip-fop. Sometimes they only \"trust\" certain sources or they try and use PID-33 (last update date/time) to weed out \"old\" demographics (I don't see an equivalent to a last date/time in the FHIR Patient resource, but it could be tracked with an extension I suppose). PID-33 was part of several Meaningful Use specs in the US. I've also seen systems keep to separate records that are linked and then offer an \"enterprise\" amalgamated record is created to show end users. However, things like allergies, problems, med, etc that can be on both records are tough to reconcile. None of these solutions are particularly satisfying though.</p>",
        "id": 162327681,
        "sender_full_name": "Craig Newman",
        "timestamp": 1554206790
    },
    {
        "content": "<p>Meta.lastUpdated</p>",
        "id": 162422117,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1554292783
    },
    {
        "content": "<p>I thought of lastUpdated too, but I think the data item might be \"date of the record that this was created from\". So if you know the data of some other input, you can determine if it is newer that your original source.</p>",
        "id": 162471119,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1554326634
    },
    {
        "content": "<blockquote>\n<p>REST is client side orchestration</p>\n</blockquote>\n<p>But this sounds like Rik is still using a messaging paradigm, so the server can do what it wants (eg it could only accept Patient updates from a PAS)...</p>",
        "id": 162647126,
        "sender_full_name": "David Hay",
        "timestamp": 1554488301
    }
]