[
    {
        "content": "<p>Experimental (i.e. a gist) but a graph for A28 equivalent <a href=\"https://data.developer-test.nhs.uk/ccri/term/graph/3\" target=\"_blank\" title=\"https://data.developer-test.nhs.uk/ccri/term/graph/3\">https://data.developer-test.nhs.uk/ccri/term/graph/3</a><br>\nand also <a href=\"https://data.developer-test.nhs.uk/ccri/term/messaging/1\" target=\"_blank\" title=\"https://data.developer-test.nhs.uk/ccri/term/messaging/1\">https://data.developer-test.nhs.uk/ccri/term/messaging/1</a> </p>\n<p>Also some work on MDM^T02 <a href=\"https://data.developer-test.nhs.uk/ccri/term/messaging/3\" target=\"_blank\" title=\"https://data.developer-test.nhs.uk/ccri/term/messaging/3\">https://data.developer-test.nhs.uk/ccri/term/messaging/3</a> and <a href=\"https://data.developer-test.nhs.uk/ccri/term/graph/2\" target=\"_blank\" title=\"https://data.developer-test.nhs.uk/ccri/term/graph/2\">https://data.developer-test.nhs.uk/ccri/term/graph/2</a></p>\n<p>I'm trying to follow the basic structure of HL7v2 equivalents.</p>",
        "id": 159840712,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1551606426
    },
    {
        "content": "<p>p.s. I might not have got the content correct, feedback welcome.</p>",
        "id": 159840726,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1551606465
    },
    {
        "content": "<p>Rather minimalistic A28 (none of the optional stuff as defined in the UK A.3 v2 spec). On the MDM T02, that would solely have DocumentReference as its focus (NOT messageHeader, nor Patient). Anything other than DocumentReference would be part of the overall message bundle, but it's not the focus of the trigger event. DocumentReference contains a reference to the subject (Patient), so no need to pull that within the message focus. Probably a best practice to keep the focus as limited as possible, and if the trigger event indicates a state change, only the resource(s) undergoing that state change should be in focus.</p>",
        "id": 159895301,
        "sender_full_name": "René Spronk",
        "timestamp": 1551688199
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  Thanks for these points.  I took a quick look at this and wondered why MessageHeader was there; I was hoping this mapping wasn't only for FHIR message-based workflow but also could work for RESTful, transaction based workflows.   I didn't look at the details yet but the MDM T02 is only one of the 'set  of V2 transactions' that have to do with document workflow; obviously there are the other variants like T01 (with reference to document, not including the document payload) and the T07/T08 oair for updates to the documents.</p>",
        "id": 159906873,
        "sender_full_name": "John Silva",
        "timestamp": 1551700600
    },
    {
        "content": "<p>Kevin's scenario is heavily constrained for use in his English ITK setting. However, the focus of MDM messages will always be a DocumentReference. MDM messages may include a Binary resource to capture the content, or the document may already exist elsewhere. The underlying use cases (and trigger events) don't change. <br>\nIn a more general sense, a REST Transaction payload may look like a FHIR messaging structure in terms of Resources, and yet, the effect is different because the paradigms are different.</p>",
        "id": 159908049,
        "sender_full_name": "René Spronk",
        "timestamp": 1551701824
    },
    {
        "content": "<p>So,<br>\nMessageHeader is not needed in the MessageDefinition (I presume I set the MessageHeader profile to use in GraphDefinition?)<br>\nI'm ignoring the optional stuff at present as I'm after a simple correct example.</p>",
        "id": 159909138,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1551702855
    },
    {
        "content": "<p>Have updated examples above</p>",
        "id": 159909143,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1551702864
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span>  When I was looking at mapping MDM to FHIR, I was looking at both DiagnosticReport (something you use case may not include) and Composition. I looked at DocumentReference but didn't get a clear sense of benefits of using Composition versus DocumentReference. What was your thought process for selecting DocumentReference?</p>",
        "id": 159911838,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551705265
    },
    {
        "content": "<p>I was after a standard method of sending pdf/img/jpg to a document store. Assumption is some would be HL7v2, others IHE MHD but most would be a mix bag of xml and other formats.</p>",
        "id": 159913891,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1551706814
    }
]