[
    {
        "content": "<p>I originally posted this in another channel, but was told to try here as well.<br>\nI know this is the opposite of what you are working on, but I am looking to translate from FHIR to V2 in order to communicate out to a legacy system.<br>\nAre there any tools / libraries available that could make this translation process easier, or is this just something custom I need to make for my use case?<br>\nThanks for any help in advance.</p>",
        "id": 204700472,
        "sender_full_name": "Eric Lemieux",
        "timestamp": 1595440802
    },
    {
        "content": "<p>I don't know of any projects working on moving from FHIR to v2. The mappings we have are probably mostly bidirectional but we haven't actively been considering that direction of transformation so there's no guarantee that they will work, but it might be an OK place to start. One thing it won't get you are any v2 fields/segments that are required in v2 but where the the equivalent isn't required in FHIR (or doesn't exist in FHIR). We meet weekly on Mondays and Tuesdays if you're interested in joining a call to talk about what you want to do.</p>",
        "id": 204788897,
        "sender_full_name": "Craig Newman",
        "timestamp": 1595506851
    },
    {
        "content": "<p>The definition/detection of the equivalent of v2 trigger events would be one of the more tricky challenges. REST has a quite different view of the world than messaging, so have some sort of powerful event detection mechanism will be your starting point.</p>",
        "id": 205574632,
        "sender_full_name": "René Spronk",
        "timestamp": 1596188929
    },
    {
        "content": "<p>I am involved in the V2 to FHIR project, and have tools that can transform in either direction - i.e transform FHIR to V2 if you want it - from the mapping tables being produced by the project.</p>",
        "id": 205581172,
        "sender_full_name": "robert worden",
        "timestamp": 1596195200
    },
    {
        "content": "<p>And how do you deal with the event detection bit if going from FHIR to v2?</p>",
        "id": 205684010,
        "sender_full_name": "René Spronk",
        "timestamp": 1596292466
    },
    {
        "content": "<p>Hi, I have got a FHIR server which requires to send HL V2 messages. Does anyone used anything similar to FHIR Mapper for the reverse pathway aka FHIR/Appointment to HL7/scheduling. <span class=\"user-mention\" data-user-id=\"193818\">@robert worden</span> can you please advise what tools you are using, Mentioned above</p>",
        "id": 212328555,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1601917600
    },
    {
        "content": "<p>@MediHarsini: I am (slowly) developing tooling which converts the mapping tables (being developed on the V2-FHIR project) to an internal declarative mapping format. One purpose of this is to validate anybody's V2-FHIR transform against the mapping tables;.But it is also capable of generating transforms in either direction from the mapping tables. So FHIR to V2 is possible in principle, but I have done no testing of it yet. The tools are available, but work would be needed.</p>",
        "id": 212441705,
        "sender_full_name": "robert worden",
        "timestamp": 1601996982
    }
]