[
    {
        "content": "<p>The next release of the IG publisher will support the spreadsheet format that the v2 mapping project is using. The way it works is :</p>\n<ul>\n<li>download the spreadsheet as a csv and save it in the resources folder of the iG</li>\n<li>add the csv file to the ig.json file in a “mappings” entry, just like is done for profiles as spreadsheets </li>\n<li>the file is loaded to a ConceptMap resource and is now a standard resource like any other</li>\n<li>one of the generated outputs is an HTML fragment that matches the spreadsheet format for inclusion directly in the IG</li>\n<li>it needs some additional metadata in the spreadsheet (name / value pairs)</li>\n</ul>",
        "id": 169095200,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561597606
    },
    {
        "content": "<p>All this assumes that there is an IG being published, which assumes that someone is going to edit it... do we have a volunteer?</p>",
        "id": 169095222,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561597660
    },
    {
        "content": "<p>I haven't looked at the v2 to FHIR mapping spreadsheet but is it specific to v2 or can it handle any mapping to FHIR?  So many of the IGuides that I create are based on mappings and I'd love to include the mappings in the guide.  I've been doing it so far by just linking to an include spreadsheet resource, but if it actually create HTML fragments in the IG, that would be really sweet.</p>",
        "id": 169105300,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1561613486
    },
    {
        "content": "<p>it's specific to v2 right now, but that's partly because I have hard coded some things that we'd need to talk about</p>",
        "id": 169125507,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561634835
    },
    {
        "content": "<p>but also because some of the ideas in that spreadsheet are very v2 specific</p>",
        "id": 169125519,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561634846
    },
    {
        "content": "<p>also, do you want to live within the limitations of that format?</p>",
        "id": 169125523,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561634857
    },
    {
        "content": "<p>Which spreadsheets does this support? Just the segment maps? Or does it support data type and vocabulary too? As well, we think we are honing in on a spreadsheet for message mapping (<a href=\"https://confluence.hl7.org/display/OO/Message+Mapping\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/Message+Mapping\">https://confluence.hl7.org/display/OO/Message+Mapping</a>), will that be added in the future too?</p>",
        "id": 169128813,
        "sender_full_name": "Craig Newman",
        "timestamp": 1561637884
    },
    {
        "content": "<p>Finally, we still need a way to document the relationship between resources in the Bundle that is being created. </p>\n<p>For example, the Patient resource created from PID goes in Encounter.subject from the PV1 transform and Immunization.patient from the RXA tranform. </p>\n<p>Or the Practitioner resource created from a PRT segment with participation of \"ordering provider\" goes in Immunization.performer.actor where Immunization.performer.function=\"OP\" for the Immunization resource created in the same order segment group as the PRT segment.</p>\n<p>Does anyone have suggestions on how to make such relationships machine understandable?</p>",
        "id": 169129175,
        "sender_full_name": "Craig Newman",
        "timestamp": 1561638255
    },
    {
        "content": "<p>I don't believe you are on a course to machine processibility</p>",
        "id": 169132252,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561640545
    },
    {
        "content": "<p>For now, I've just done segments</p>",
        "id": 169132270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561640566
    },
    {
        "content": "<p>Have a look.  It's about v2-to-FHIR mapping: <a href=\"https://confluence.hl7.org/display/OO/2-To-FHIR+Project\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/2-To-FHIR+Project\">https://confluence.hl7.org/display/OO/2-To-FHIR+Project</a>.</p>",
        "id": 169172895,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1561667647
    },
    {
        "content": "<p>Full machine processibility is not likely if the goal is to take in any v2 message and spit out FHIR on the other side.  The world of v2 is too varied, with too many z-stuff and variable interpretations on where to put what data in v2 to begin with (not unlike current state FHIR really).  Implementation guides could get much closer to that, particularly if they have strong conformance testing tools (e.g., the LOI/LRI guides), but still only within the non-optional space.  So we really need to think of this as strongly indicative of what in v2 is intended to be mapped where in FHIR and have tooling that can use this as the starting point to enable v2-to-FHIR mappings.</p>\n<p>Segment mapping alone is not sufficient as messages provide context, based on placement of the segments, where to map to in FHIR.  I do believe that can be reasonably defined using the constructs we are working through.  But will it be 100% for any v2 message sight unseen?  No.  Spreadsheets and mapping language won't make a difference  there.</p>",
        "id": 169173501,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1561668113
    },
    {
        "content": "<p>not to that problem no, but as a format they will prevent achieving that goal once all those other problems are solved</p>",
        "id": 169174950,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561669217
    },
    {
        "content": "<p>Isnt' that the purpose of converting .csv to a mapping language syntax that is consumable by a tool?  While perhaps the final inch may require a specific expression to be dropped in that uses the target mapping language syntax, I believe the simplicity of spreadsheet and ability to review will get us a long, long way.  But we'll see.  We'll augment when we run into that.</p>",
        "id": 169264229,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1561757766
    },
    {
        "content": "<blockquote>\n<p>a specific expression to be dropped in</p>\n</blockquote>\n<p>I wish you'd listen in detail. Being able to do that requires slavish adherence to the formalisms that enable such a thing to be done. Which you are already not doing; you're just making up syntax to suit your immediate problem without any consideration for the underlying formalisms</p>",
        "id": 169612839,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562201066
    },
    {
        "content": "<p>I'm trying to parse the spreadsheets now. I can parse them, sure. But extracting deeper meaning towards executing on the information in them is already involving guess work, and I'm only 10% into the task</p>",
        "id": 169612859,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562201140
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> : \"slavish adherence to a formalism\" is critical to any approach, whether spreadsheet, mapping language, or whatever else we may choose.  You have fair criticism that we are not yet consistent in adherence.  Two considerations there: we were not yet trying hard to do so as we are getting our feet wet; we started last week to discuss a stricter formalism that we would then adhere to and can validate against.</p>",
        "id": 170897389,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1563200390
    },
    {
        "content": "<p>As we discussed at the last WGM, I am developing tooling to convert the spreadsheet mappings  of the  V2 to FHIR mapping project to runnable transforms.  Now the core of it works - I can generate runnable transforms in HAPI Java or FHIR Mapping Language (old syntax - will be fixed). </p>\n<p>Of course I am running head-on into the inconsistencies and ambiguities of the spreadsheets as they are being developed  on the mapping project,and I have not done mapping conditions or resource references yet - still to do.  But the project gradually tidies up the ambiguities and inconsistencies as we find them, and the transforms test the mappings. I know of no reason why the spreadsheet notation, after this refinement, should not be as fully machine processable as any other notation. The spreadsheets are modular and reviewable.</p>\n<p>Naturally, local variations in V2 or FHIR or both are going to be an issue for anybody deploying a transform. There are several ways to tackle this - edit the generated FML, edit the generated Java, or edit the spreadsheets and re-generate.</p>",
        "id": 173959557,
        "sender_full_name": "robert worden",
        "timestamp": 1566557995
    },
    {
        "content": "<p>My expectation would be to cover the local variations by profiling in form of hierarchies. This ist what we teach in conformance.</p>\n<p>Therefore, the deltas should be transformed individually and then added were needed.</p>",
        "id": 174618383,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1567258859
    },
    {
        "content": "<p>Grahame wrote: 'the [csv] file is loaded to a ConceptMap resource and is now a standard resource like any other'. </p>\n<p>Can we see an example? <br>\nFor a typical message, you need about 30 spreadsheets (message, segment, data type)</p>\n<p>Jean asked: is [the spreadseet notation] specific to v2 or can it handle any mapping to FHIR?</p>\n<p>The spreadsheet notation has one or two columns that are V2-specific, but would easily generalise to other sources, such as CDA or OpenEHR. Similarly, the tooling  I am developing to convert spreadsheets to runnable transforms has some V2-specific aspects, but could be adapted to handle mapping spreadsheets of  non-V2 sources.</p>",
        "id": 174706474,
        "sender_full_name": "robert worden",
        "timestamp": 1567420061
    },
    {
        "content": "<p>the concept applies anywhere, but the specific format has some implied meanings that particularly fit v2</p>",
        "id": 174708264,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567422105
    },
    {
        "content": "<p>I'll have an example for atlanta</p>",
        "id": 174708322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567422137
    }
]