[
    {
        "content": "<p>hello is there a way to convert FHIR resource back to hl7V2?</p>",
        "id": 252170805,
        "sender_full_name": "shouvik das",
        "timestamp": 1630932625
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"438104\">@shouvik das</span> Please start a new 'thread' when you're starting a conversation.  For example, this thread name was \"Mapping CX to Identifier\".  I'm renaming your part of it with admin powers to avoid confusion for others, but it's best if you pick an appropriate name at the start.</p>",
        "id": 252194554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630943814
    },
    {
        "content": "<p>First, take a look at the <a href=\"http://build.fhir.org/ig/HL7/v2-to-fhir\">v2 to FHIR</a> IG.  Then do a search here.  Short answer is there'll be a starting point, but you'll have to write code that's specific to your particular v2 implementation because v2 implementations vary so much.</p>",
        "id": 252194765,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630943922
    },
    {
        "content": "<p>And the v2-to-FHIR project is focused on that direction (v2 to FHIR). Some of the mappings may be useful for going from a set of FHIR resources to a v2 message, but it hasn't been a goal of the project, so there may be some gaps.</p>",
        "id": 252297597,
        "sender_full_name": "Craig Newman",
        "timestamp": 1631018093
    },
    {
        "content": "<p>We've seen quite a few requests for new extensions coming in for v2 concepts that aren't in FHIR as yet and wondering if for some concepts that we don't think are in use, but need a bucket for these, should we just create a generic v2 \"forward port\" extension format?<br>\nE.g. fhir#31501 is talking about a living will indicator, instead of creating a new standard extension for this, use a specific format - and what information would you need to have in that? event+message+field (as some fields have slightly different meanings - complete set, or partial, or set applicable in specific context) as that could then change how it is then used in the FHIR space.<br>\n(This all being said, I do think we should be considering the properties as we have been, and creating new standard extensions where the meaning/intension/actual usage is clear)</p>",
        "id": 261848531,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1637182904
    },
    {
        "content": "<p>So when should we define a 'standard extension' vs. when should we leave this to a project to define their own extensions? Clearly if we (as the HL7 community) don't recognize this as a [frequently used]  scenario it probably shouldn't become a standard extension.</p>",
        "id": 261899266,
        "sender_full_name": "René Spronk",
        "timestamp": 1637224656
    },
    {
        "content": "<p>Another consideration is how well understood/consistent we expect the value to be.  If we can't count on the meaning, having an extension seems of limited use unless our objective is to have FHIR be an intermediary between two v2 interfaces (is anyone doing that??)</p>",
        "id": 261932618,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637245098
    },
    {
        "content": "<p>There are three approaches we are pursuing: <br>\n1) worthy of a core attribute as it was forgotten or just had not come up yet in FHIR based use cases - core addition - Example may be the observation-specimen relationship where cardinality has to be addressed in the core unless it gets too clunky. <br>\n2) it is a minority use case, but within that use case it needs to be done consistently - standard extension.  Example may be the living will indicator are student indicators that have limited use, but when used have to be consistent.  Another example is to maintain original meaning where FHIR opted to go to a required code, whereas v2 has more granular capabilities with CWEs.<br>\n3) it is very unique to v2 construct that you would never use in FHIR - IG extension  Example: OBX-4  needs to be preserved in FHIR as the mapper may not have enough knowledge about OBX-4 syntax to know how to structure the relationships (the true destination does).</p>\n<p>I'm not aware of anybody using FHIR as an immediate intermediary for v2 to v2 messages, but you never know what somebody does when they use v2 to FHIR, persist it is some form, and then include the data again in a v2 message.  All bets are off on that one.</p>\n<p>But with the above, it is clear that every gap between what is actually used in v2 (keep in mind, we are not mapping just the full standard, only those elements that are known to be used in production somewhere) needs to go through the above triage and then worked out with the resource owner whether it is worthy of 1), 2), or 3).</p>",
        "id": 263859443,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1638801901
    }
]