[
    {
        "content": "<p>Please take a moment to fill out the doodle poll to help identify better meeting times if possible.</p>\n<p><a href=\"https://doodle.com/poll/n46s6ps3wnfz3r2v\" target=\"_blank\" title=\"https://doodle.com/poll/n46s6ps3wnfz3r2v\">https://doodle.com/poll/n46s6ps3wnfz3r2v</a></p>\n<p>We are looking for two 1-hour time slots per week to allow the review progress we need to achieve our goals.  Therefore, we will aim for the two biggest vote getters that are on different days, while we try to balance as best a possible an earlier and later EDT timeslot.</p>\n<p>Our goal is to move as quickly as possible to both meetings mostly addressing content mapping, while scheduling tooling topics in primarily one meeting where most of those with an interest in the tooling could participate.  At the same time, we also look for any ideas to enable off-line review and issue resolution so meetings can focus on the biggest challenges while the rest can move in place without much meeting time.</p>\n<p>Any questions, suggestions, please respond to this thread.</p>\n<p>Thank you!</p>",
        "id": 165025883,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1557182914
    },
    {
        "content": "<p>Is the V2 tooling call happening today, or are we awaiting consensus on new timeslot(s)?</p>",
        "id": 165187073,
        "sender_full_name": "Roman Polyanovsky",
        "timestamp": 1557339391
    },
    {
        "content": "<p>Just a reminder to participate in the doodle poll if you would like to participate in the conference calls.</p>",
        "id": 165337796,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1557496482
    },
    {
        "content": "<p>Craig and I looked at the various options based on Doodle participation and found that Monday 13:00-14:00 EDT (18 people) has the most opportunity for participation, so we want to lock that in starting next week Monday.</p>\n<p>Then for the second meeting things got challenging fast and three times stood out:</p>\n<p>•   Monday 12:00-13:00 EDT, making it a 2-hour meeting (16 people)<br>\n•   Tuesday 11:00 – 12:00 (15 people)<br>\n•   Thursday 09:00-10:00 EDT (12 people)<br>\n•   Thursday 16:00-17:00 EDT (12 people)</p>\n<p>Given number of people, mix of participation, and not wanting to make this a two hour marathon every week, Tuesday seems the best balance UNLESS there is overwhelming interest to do a 2 hour marathon every week.  Please let us know by Friday if a marathon is what you prefer.  Note that if there are holidays (e.g., Memorial Day coming up in the US), one would miss an entire week’s worth of meetings…..</p>\n<p>Thank you!</p>",
        "id": 165554457,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1557771695
    },
    {
        "content": "<p>I would try to attend as many meetings as possible. Monday 13:00 - 14:00 EDT ( = 10:30 - 11:30 PM IST ) . <br>\nFor the second meeting Tuesday is fine too.   <br>\nI would not be able to attend meeting next monday ( 20th ) as I would be travelling.</p>",
        "id": 165562878,
        "sender_full_name": "Kumar Satyam",
        "timestamp": 1557777141
    },
    {
        "content": "<p>What's the final decision on future meeting dates?</p>",
        "id": 166299409,
        "sender_full_name": "Toby Hu",
        "timestamp": 1558552060
    },
    {
        "content": "<p>Every week, Monday 1 - 2 PM ET AND Tuesday 11 AM - 12 PM ET</p>",
        "id": 166305105,
        "sender_full_name": "Craig Newman",
        "timestamp": 1558556043
    }
]