[
    {
        "content": "<p>It looks like MessageHeader.timestamp was removed in the transition from STU3 to R4. I can't find a gForge ticket related to this change. Is anyone aware of the reason why this was removed? In R4, should we be using meta.lastUpdated or a Provenance resource rather than MessageHeader.timestamp? We're trying figure out where MSH-11 of a v2 message would go in MessageHeader. Or is MSH-11 more akin to Bundle.timestamp?</p>",
        "id": 159918296,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551710288
    },
    {
        "content": "<p>Bundle.timestamp was added in R4, and so MessageHeader.timestamp was removed</p>",
        "id": 159944540,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551729317
    },
    {
        "content": "<p>I can't find a task either. Odd</p>",
        "id": 159944698,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551729404
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13840\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13840\">GF#13840</a></p>",
        "id": 159944856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551729507
    },
    {
        "content": "<p>In the context of converting a v2 message to a FHIR bundle (in either a messaging for a RESTful paradigm)  in an application other than the one that created the v2 message and given the explanation for how to populate Bundle.timestamp for a message at <a href=\"http://hl7.org/implement/standards/fhir/bundle-definitions.html#Bundle.timestamp\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/bundle-definitions.html#Bundle.timestamp\">http://hl7.org/implement/standards/fhir/bundle-definitions.html#Bundle.timestamp</a>:</p>\n<p>message : the date that the content of the message was assembled. This date is not changed by middleware engines unless they add additional data that changes the meaning of the time of the message</p>\n<p>Can we assume that the \"content of the message\" was determined by the original application when it created the v2 message (and populated MSH-11) and that should go in Bundle.timestamp. Further, the time of \"conversion\" to FHIR should go in Bundle.meta.lastUpdated (which hopefully will be pretty close to the time in MSH-11 but could be delayed for any number of reasons in the real world).</p>",
        "id": 160006544,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551795864
    },
    {
        "content": "<p>All references to MSH-11 should read MSH-7. Sorry about that.</p>",
        "id": 160007536,
        "sender_full_name": "Craig Newman",
        "timestamp": 1551796490
    },
    {
        "content": "<p>It all depends what you're trying to do. From a messaging standpoint it isn't really the date/time of the assembling of the bundle content that are of importance, but the timing of the trigger event, which may lie at some distance in the past. <br>\nExample: nurse takes someone temperature at 09:00, and only gets to enter it into the system at 11:00. trigger event is 09:00 (this is the time of the latest state transition on the focal resource in the message), bundle/message was created at 11:00. </p>\n<p>If one asks (as you seem to be doing) \"how old is the data in this bundle\": messaging (v2 and FHIR) is 'snapshot' in nature, it's always about the \"here and now\". So MSH-7 contains the time at which the snapshot was generated.</p>",
        "id": 160008233,
        "sender_full_name": "René Spronk",
        "timestamp": 1551796997
    }
]