[
    {
        "content": "<p>Does anyone have any suggestions as to where to put the source HL7 V2 message's 'Message Control ID' (MSH-10) when transforming the V2 message to a Bundle using the messaging paradigm?</p>",
        "id": 169301618,
        "sender_full_name": "Angus Millar",
        "timestamp": 1561821838
    },
    {
        "content": "<p>Suggestion: I would think of <a href=\"http://MessageHeader.id\" target=\"_blank\" title=\"http://MessageHeader.id\">MessageHeader.id</a> (but i am not too that <a href=\"http://Bundle.id\" target=\"_blank\" title=\"http://Bundle.id\">Bundle.id</a> is not to be used too/instead)</p>",
        "id": 169329005,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561879506
    },
    {
        "content": "<p>The problem is that MSH-10 in v2 is NOT a unique identifier, mostly it's a rollover number from 1 to 9999. It's only supposed to be unique within the context of 1 peer-to-peer communication link, within the next 10 minutes or so (to link responses to messages, to detect duplicate messages). Outside of that context is has no guarantee whatsoever of uniqueness, so never use it as a FHIR id or identifier unless you happen to know (you could be lucky) that the sender of the v2 message happens to create unique control IDs.</p>",
        "id": 169339362,
        "sender_full_name": "René Spronk",
        "timestamp": 1561899939
    },
    {
        "content": "<p>I agree Rene. Your point also leads to the problem of how I would represent  MSH-10 as a fullUrl in the message Bundle. I was then thinking an extension on MessageHeader, yet was surprised this has not been addressed before. This then lead me to think I could and probably should create a Provenance resource  where the  activity is a create, the target is my FHIR resources, the agent is the integration engine, the entity is the HL7 V2 message where its whatReference is a reference with just an identifier property that is the MSH-10 Message Control ID.</p>",
        "id": 169360053,
        "sender_full_name": "Angus Millar",
        "timestamp": 1561940580
    },
    {
        "content": "<p>Given that MSH-10, after a v2 message has been transformed into FHIR resources, is just \"provenance\" this would seem to be a good fit. But even in provenance one has to be careful not to regard MSH-10 as a unique identifier, for the Datatypes used in provenance will likely require you to use unique identifiers. As such you may need an extension (of type string) on Provenance.</p>",
        "id": 169376778,
        "sender_full_name": "René Spronk",
        "timestamp": 1561969444
    },
    {
        "content": "<p>The v2-to-FHIR project has already started thinking about what Provenance records might be needed for such a transform. We haven't reached any conclusions, but the begins are documented at <a href=\"https://confluence.hl7.org/display/OO/v2-to-FHIR+Provenance\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/v2-to-FHIR+Provenance\">https://confluence.hl7.org/display/OO/v2-to-FHIR+Provenance</a>. Please have a look and add your own thoughts.</p>",
        "id": 169388030,
        "sender_full_name": "Craig Newman",
        "timestamp": 1561981620
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> that reference was very useful and validated most of my thinking.</p>",
        "id": 169444638,
        "sender_full_name": "Angus Millar",
        "timestamp": 1562028846
    },
    {
        "content": "<p>I think you prefix the message id with a GUID to make it unique globally. As for rolling reuse... that's the sort of thing you just to wear as a limitation if you can't alter the sourrce</p>",
        "id": 169612920,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562201216
    }
]