[
    {
        "content": "<p>Today we are starting the first Community Review of the MSH segment (<a href=\"https://docs.google.com/spreadsheets/d/13pgda5xl-PwCgB9j0axyymwwv7RJVcrIzY8Ah1y1Y1M/edit#gid=0\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/13pgda5xl-PwCgB9j0axyymwwv7RJVcrIzY8Ah1y1Y1M/edit#gid=0\">https://docs.google.com/spreadsheets/d/13pgda5xl-PwCgB9j0axyymwwv7RJVcrIzY8Ah1y1Y1M/edit#gid=0</a>).   This is NOT a ballot, rather the first opportunity to get wider input into the completeness and correctness of the proposed mapping.  The intent is to solicit any comments to:</p>\n<p>•   Validate any mappings starting at the segment level, as well as for the referenced data types, which in turn may reference further data types, i.e., column F and onwards.<br>\no   Note that if the Condition cell is empty, that mapping is always meant to occur.<br>\no   Note that if a v2 field is included multiple times with different conditions, any condition that is true results in the subsequent mapping.  We left the Derived Mapping column in for now, but that is expected to be removed once we are comfortable this approach works.<br>\n•   Identify segment fields that may not be mapped to a FHIR attribute, but you are using, so there should be a mapping.</p>\n<p>Additionally we have the following specific questions to provide feedback on:</p>\n<p>•   We have used three different ways to map attributes using the HD data type.  We seek feedback whether one or two of those should be consistently used moving forward.<br>\n•   MSH-21 allows for post-coordinated profiles to reflect by which rules the v2 message was constructed.  In FHIR there is only one instance available for MessageHeader.definition requiring pre-coordination of all possible permutations as subsequent projects map specific implementation guides that use MSH-21 extensively.  We seek feedback on what enhancements to request to FHIR to accommodate post-coordination, or accept the need for many pre-coordinated message definitions.  To get an idea of the potential, the US Realm Lab v2 implementation guides.<br>\n•   Any improvement opportunities to the format.</p>\n<p>Comments and suggested updates should be entered in the spreadsheet against the cell to which they apply (select the cell and click on the + icon in the short cut bar).  We appreciate to include in your comment the problem (if the cell is not blank) and a proposed solution/wording.</p>\n<p>The deadline for your comments is June 16 as on June 17 we start to review the comments during our project team meetings.</p>\n<p>Any questions, please contact Craig and/or myself.</p>\n<p>Thank you!</p>",
        "id": 167234661,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1559598114
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> where should people look for documentation - in particular, there's some implied grammar in the FHIR Atttribute column (some of which I made up!): is it documented anywhere?</p>",
        "id": 167687076,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560063196
    },
    {
        "content": "<p>Just a reminder we have one more week available for your feedback before we put this segment, plus associated data types, into the queue for the next (first) ballot.  Note that timing of the first ballot may be as soon as September as a For Comment Ballot.</p>",
        "id": 167781864,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1560190272
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> : I will be putting that on this page: <a href=\"https://confluence.hl7.org/display/OO/Segment+Mapping\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/Segment+Mapping\">https://confluence.hl7.org/display/OO/Segment+Mapping</a>.</p>",
        "id": 167781971,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1560190332
    },
    {
        "content": "<p>thanks - is it possible to reference that from the spreadsheet somewhere?</p>",
        "id": 167782149,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560190446
    },
    {
        "content": "<p>I put the first one in for Segments on that page.  Will be doing the same (although largely similar) for data types, and then for Message Structure once settled.  Let me see whether GSheet allows me to put in definition tab that the column headers can jump to, or just a comment (but that latter would get confused with real comments).</p>",
        "id": 167784023,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1560191650
    },
    {
        "content": "<p>Can you check the link I provided above and see whether anything is unclear?</p>",
        "id": 167784052,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1560191671
    }
]