[
    {
        "content": "<p>Hello, we initially thought that the relationship between OBX (HL7 v2) and Observations (Fhir) would be <code>OBX</code> === <code>Observation</code>. That is accurate?  We are wondering because we see that in some cases what we have in OBX are not entirely results or observations related to vital-signs and what we could expect in a regular observation. In some cases, we have a sort of Notification message along with some <code>NTEs</code></p>",
        "id": 161854103,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1553689839
    },
    {
        "content": "<p>In the immunization world (at least in the US), some standard v2 OBX segments (patient eligibility, vaccine funding source, educational material) map to discrete elements in the R4 Immunization resource. As well, in MDM messages, it seems like OBX might correspond better to Media or DocumentReference resources. There may be more examples like these in other areas.</p>",
        "id": 161857712,
        "sender_full_name": "Craig Newman",
        "timestamp": 1553692646
    },
    {
        "content": "<p>Our scope is Laboratory's Test results in US. We are getting <code>ORU_R01</code> documents back from laboratories</p>",
        "id": 161858609,
        "sender_full_name": "Yassiel Oliva",
        "timestamp": 1553693317
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196707\">@Yassiel Oliva</span> the \"boundaries and relationships\" section on Observation is probably the closest thing to the source of truth for this: <a href=\"http://build.fhir.org/observation.html#bnr\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#bnr\">http://build.fhir.org/observation.html#bnr</a> . As Craig points out, there are a handful of resources that an OBX can map to, within <code>ORU_R01</code>, you might see <code>Media</code>, for example.</p>",
        "id": 161872660,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1553701747
    },
    {
        "content": "<p>Considering Craig's response, we likely will find that depending on the V2 message and position it is used in, the mapping of OBX will vary into FHIR.  The v2-to-FHIR intends to review those all and establish an agreed to map.  For labs, OBX=Observation is most appropriate I'd say.  Note that once the v2-to-FHIR is completed (no specific timeline), that will be the source of truth for any HL7 recommended mappings.</p>",
        "id": 161881267,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1553707336
    }
]