[
    {
        "content": "<p>Got an interesting requirement (and one that could be quite common).  The customer has a PAS that can response to QRF^A19 queries, and they want to put a FHIR front end on it. It seems to me that the best design would be to use the FHIR $process-message operation (rather than REST) with a suitable MessageHeader.event and Parameters resource in the incoming message. </p>\n<p>Does that make sense? If so, what would a suitable event coding be?</p>",
        "id": 166787419,
        "sender_full_name": "David Hay",
        "timestamp": 1559110943
    },
    {
        "content": "<p>why not do rest?</p>",
        "id": 166787587,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559111215
    },
    {
        "content": "<p>Indeed, why not rest? But if you're going to use FHIR Messaging, the event code would be easy: just use the v2-table 0003 as a coding system. So the event code would be \"A19\".</p>",
        "id": 166791118,
        "sender_full_name": "René Spronk",
        "timestamp": 1559115542
    },
    {
        "content": "<p>What would the FHIR query look like? We can't use $everything as there isn't a Patient resource instance (best we can hope for is an identifier)...   (I should have said that they want all the clinical data and there's an integration engine in the middle, so it's FHIR query to the IE, QRF to the PAS). You could issue a series of queries like GET AllergyIntolerance?patient.identifier=x for all the clinical resources, but that seems a bit inelegant...</p>",
        "id": 166791888,
        "sender_full_name": "David Hay",
        "timestamp": 1559116369
    },
    {
        "content": "<p>my experience with A19 was simple queries that would now map directly to the REST api. It sounds like you have something much more complex going on. What's the query, it's parameters, and the nature of the response?</p>",
        "id": 166809024,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559132495
    },
    {
        "content": "<p>It's early days, so I'll find out more and get back to you. But with that advice I'll put more emphasis into the REST paradigm. Thanks for the comments...</p>",
        "id": 166842972,
        "sender_full_name": "David Hay",
        "timestamp": 1559154408
    },
    {
        "content": "<p>Yeah, I agree with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> . All A19s I've ever dealt with mapped fairly cleanly to RESTful FHIR.</p>",
        "id": 167085919,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1559416872
    },
    {
        "content": "<p>Much appreciated...</p>",
        "id": 167112648,
        "sender_full_name": "David Hay",
        "timestamp": 1559465095
    }
]