[
    {
        "content": "<p>Is there a R4 to hl7v2 converter?</p>",
        "id": 274020868,
        "sender_full_name": "Akshay",
        "timestamp": 1646333845
    },
    {
        "content": "<p>I've moved your post to a different topic.  (Always change your topic name to reflect your question - or search for an existing related thread.)</p>",
        "id": 274023078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646334668
    },
    {
        "content": "<p>Short answer - no.  </p>\n<ul>\n<li>There's no 'standard' HL7 FHIR Bundle.  A bundle might contain any kind of resource and there be no indication of what 'kind' of message should result from it. </li>\n<li>The same resources might map different ways depending on what message you're mapping to</li>\n<li>Expectations for the content of a message vary from v2 system to v2 system</li>\n<li>FHIR is extensible and those would need to be individually mapped</li>\n</ul>\n<p>There are a standard set of mappings available in the v2-to-FHIR implementation guide that you could use as a starting point.</p>",
        "id": 274025482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646335626
    },
    {
        "content": "<p>I very much expect that for specific data-flows that the commercial HL7 interface engines have solutions.  These would come with the constraints that Lloyd mentions.</p>",
        "id": 274025754,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646335736
    },
    {
        "content": "<p>However, one of the main problems is going from a non-event based environment (REST) to a fully business-event-based messaging environment. Sure, the mapping of data elements from FHIR resources to v2 segments has its challenges, but bridging the gap between messaging and REST turns out to be rather tricky as well. At the very least you'd have to have some fancy event-detection mechanism based on the (ultimate) source of the data. Most 'mapping solutions' (whether commercial or not) don't offer anything when it comes to mapping the fundamental differences in exchange paradigms.</p>",
        "id": 274146194,
        "sender_full_name": "René Spronk",
        "timestamp": 1646408202
    }
]