[
    {
        "content": "<p>Hi,<br>\nI am working on RDE^O25 to FHIR mapping. As per hl7, RDE^25 replicates the standard RDE message with a different trigger event code to indicate the specific use case of a refill authorization request. Considering this, mapping would remain exactly same as that of the RDE^O11 with different intent. But I am not able to see intent \"refill\" on FHIR side. Any guidance on how to proceed with the mappings is highly appreciated.</p>\n<p>Also RXE.16, RXE.17 and RXE.18 provides details of refill, but unsure about where this information can be mapped on FHIR side as MedicationRequest do not have any designated fields for refill request. Rather just have numberOfRepeatsAllowed which is mapped with RXE.12(Number Of Refills)</p>",
        "id": 266236319,
        "sender_full_name": "gauri raut",
        "timestamp": 1640674289
    },
    {
        "content": "<p>Is it possible that this should be mapped to MedicationDispense instead of MedicationRequest?  <a href=\"https://hl7.org/fhir/r4/medicationdispense.html\">https://hl7.org/fhir/r4/medicationdispense.html</a></p>",
        "id": 266280157,
        "sender_full_name": "John Silva",
        "timestamp": 1640715634
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span> , As per my understanding , MedicationDespense covers the supply of medications to a patient whereas RDE message communicates the pharmacy or treatment application's encoding of the pharmacy/treatment order. The medication dispense is the result of a pharmacy system responding to a medication order. I am not sure if it a right choice to map it with MedicationDespense.<br>\nAlso, how shall we notify that it is a Refill request in MedicationDespense?</p>",
        "id": 266319671,
        "sender_full_name": "gauri raut",
        "timestamp": 1640757406
    },
    {
        "content": "<p>The only viable resource for this is MedicationRequest (as it's the only request). I would expect we need a new value for intent=refill <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 266490414,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1640939841
    },
    {
        "content": "<p>Purely given the analogy between Intent (in fhir) and moodcode (in v3) it seems likely this is not intent. Perhaps category ?</p>",
        "id": 266495038,
        "sender_full_name": "René Spronk",
        "timestamp": 1640946244
    },
    {
        "content": "<p>As far as I understand, the strict meaning of refill it a that you have a single prescription, with which the patient can get multiple fills over a period of time. I think this can be properly represented by a single MedicationRequest, and a Task for each refill.</p>\n<p>If, instead, there is a new prescription for each fill, only then you need a new MedicationRequest.</p>",
        "id": 266512245,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1640968077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  If we represent Task for each refill, we would still need intent = refill in Task which is currently not available,<br>\n<a href=\"/user_uploads/10155/ameDbGkKPJWwJNOJCpvEsVVh/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ameDbGkKPJWwJNOJCpvEsVVh/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/ameDbGkKPJWwJNOJCpvEsVVh/image.png\"></a></div>",
        "id": 267837341,
        "sender_full_name": "gauri raut",
        "timestamp": 1642062728
    },
    {
        "content": "<p>Task.code is where the purpose of the Task would be, and you can define a code for refill there.</p>",
        "id": 267871050,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1642082014
    },
    {
        "content": "<p>intent would indicate whether you're planning a refill, proposing a refill or ordering a refill</p>",
        "id": 267914248,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642100331
    },
    {
        "content": "<p>Got it. Thank you <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 268249395,
        "sender_full_name": "gauri raut",
        "timestamp": 1642413369
    }
]