[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , <span class=\"user-mention\" data-user-id=\"191797\">@Irma Jongeneel</span> : Does PA have any guidance on how the SCH-7 (Appointment Reason) and SCH-8 (Appointment Type) best mapped to Appointment as both seem to best go to Appointment.type given vocabulary where FHIR is using the SCH-7 table, not the SCH-8 table.</p>",
        "id": 229880392,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1615480429
    },
    {
        "content": "<p>Adding email that <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span>  send to Alex:<br>\nAlex,</p>\n<p>As part of the v2-to-FHIR transformation project, we ran across an issue that we’d like some clarification on. We’re hoping you can help us.</p>\n<p>SCH-7 (Appointment Reason) is defined as “an identifier code for the reason that the appointment is to take place.  This field may contain a Universal Service ID describing the observation/test/battery/procedure or other activity that is to take place during the requested appointment.  It may also contain a site-specific code describing a pre-defined set of reasons that an appointment may be set to occur.” It uses a user-defined table with suggested values:<br>\n<a href=\"/user_uploads/10155/jL9KtkaBDNUP2E8kMsnBJaV0/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/jL9KtkaBDNUP2E8kMsnBJaV0/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/jL9KtkaBDNUP2E8kMsnBJaV0/image.png\"></a></div><p>These suggested codes don’t seem to match well with the Appointment Reason but rather seem more relevant to SCH-8 (Appointment Type) which is defined as “the identifier code for the type of appointment”. SCH-8 references a different user-defined tables with suggested values:<br>\n<a href=\"/user_uploads/10155/fUzbcSxEFVITsh3dHDf5eiug/image.png\">image.png</a> <br>\nThese values are suggestions only; they are not required for use in HL7 messages.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/fUzbcSxEFVITsh3dHDf5eiug/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/fUzbcSxEFVITsh3dHDf5eiug/image.png\"></a></div><p>These suggested codes don’t really seem like “types” by the usual definition.</p>\n<p>Do you know how systems are using these two fields today? Are these values commonly used? </p>\n<p>Our issue comes when we try to map these fields to the FHIR Appointment resource. There is an Appointment.appointmentType element  (defined as “The style of appointment or patient that has been booked in the slot (not service type)”) which uses the v2 value set for table 0276 used by SCH-7 (Appointment Reason) even though the definition of the FHIR element is more in line with SCH-8. As well, there is an Appointment.reasonCode element  (defined as “Coded reason this appointment is scheduled”) which is bound to a preferred value set containing  SNOMED codes for procedures, findings, events, etc.<br>\nAny suggestions on how the v2 and FHIR data elements and value sets align with each other? If it’s easier to talk through this, our team meets Mondays from 1-2 Eastern and Tuesdays from 11-12 Eastern and we can add this to the agenda for one of these calls if you can make one of these times.</p>\n<p>Thanks<br>\nCraig, Camila and Hans</p>",
        "id": 230052308,
        "sender_full_name": "Camila Altman",
        "timestamp": 1615564652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , <span class=\"user-mention\" data-user-id=\"191797\">@Irma Jongeneel</span>  - any thoughts on this topic? We're still not sure how the Appointment.type element is defined relative to the v2 fields. Thanks.</p>",
        "id": 231348476,
        "sender_full_name": "Craig Newman",
        "timestamp": 1616433011
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> sorry to add you to the stream, do you have any v2 scheduling experience to cover this one?</p>",
        "id": 231444363,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1616493101
    },
    {
        "content": "<p>We use SCH-7 as the primary field for identifying the type of the visit in v2.  We don't use SCH-8 at all.  For FHIR, we use Appointment.serviceType for the same content as SCH-7.     Examples of what we put in SCH-7/Appointment.serviceType include:  Consult to Allergy, Office Visit, Dental Treatment, Well Child, Flu Shot, Renal Biopsy, etc.  Appointment.reason seems to map to DG1 (kinda?).</p>",
        "id": 231469895,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1616506210
    }
]