[
    {
        "content": "<p>Mapping ORU_R01 and OUL_R22 messages to a Bundle with a MessageHeader, ServiceRequest and DiagnosticReport. Unfortunately the ServiceRequest attribute \"intent\" is mandatory, but there is no mapping listed at: <a href=\"https://www.hl7.org/fhir/servicerequest-mappings.html#v2\">https://www.hl7.org/fhir/servicerequest-mappings.html#v2</a><br>\nSo, what would be the most approriate value to set for intent, \"order\" or \"original-order\"? Or maybe even one of the other RequestIntent values?</p>",
        "id": 260021833,
        "sender_full_name": "Eli-Jean Leyssens",
        "timestamp": 1635870669
    },
    {
        "content": "<p>Hi Eli,</p>",
        "id": 260033371,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1635875576
    },
    {
        "content": "<p>I think this needs some thought - for the OML message It would probably be at least 'order', but if this is from the original provider I would use 'original-order' as you suggest - I guess that doesn't change in FHIR for the report back like the order control code does in v2, so then it would just represent that, UNLESS an additional ServiceRequest is included to represent a filler-order or reflex-order... (and we may need to look at add-on, etc - see here for discussion specifically around how these order types should be handled in FHIR: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=79504418\">https://confluence.hl7.org/pages/viewpage.action?pageId=79504418</a></p>",
        "id": 260034359,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1635875984
    },
    {
        "content": "<p>Even though the servicerequest-mappings.html didn't list anything for intent, I just saw that there is a mapping for OBR.0 at <a href=\"https://build.fhir.org/ig/HL7/v2-to-fhir/ConceptMap-segment-obr-to-servicerequest.html\">https://build.fhir.org/ig/HL7/v2-to-fhir/ConceptMap-segment-obr-to-servicerequest.html</a><br>\nSo, here it says to set the intent to \"order\".</p>",
        "id": 260279797,
        "sender_full_name": "Eli-Jean Leyssens",
        "timestamp": 1636037263
    }
]