[
    {
        "content": "<p>I think I've seen it mentioned before on this thread: when translating v2 to FHIR (REST, I'm not talking about FHIR messages here), then all v2 messages (except queries) when translated to REST should have a Task which represents the 'reciever responsabilities' (which may include the generation of a message response). This is effectively the equivalent of a ControlAct as present in HL7v3. The task would have a reference to the MessageHeader resource as its input (which in turn references the focal resource(s)).</p>\n<p>In messages of consequence (orders) there will be tasks for the ordered services as well, but that's not what I'm talking about here, those would be in addition to the main task that represents the message receiever responsabilities. <br>\nSo why would you do this in notification messages (e.g. ADT)? Well, even those have intended business/workflow consequences, i.e. if you sent a ADT A03 (discharge) to a housekeeping system, it effectively is an order to go clean the bed/room. </p>\n<p>This probably needs to be combined with the use of 'implicitRules' (an element in all resources), because there all all these site specific undocumented expectations. </p>\n<p>However, an A31 or A08 probably/maybe don't need a task (they're just plain updates), and a merge message maps to an operation. So there are optimisations that can be made, but to me the above (as a generic statement) holds.</p>",
        "id": 163888447,
        "sender_full_name": "René Spronk",
        "timestamp": 1555917333
    },
    {
        "content": "<p>I would add MFN messages to the list of things that do not need a task</p>",
        "id": 163897782,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555932032
    },
    {
        "content": "<p>As part of the v2-to-FHIR project, I've had some initial Task discussions with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> and have documented my interpretation of those discussions at <a href=\"https://confluence.hl7.org/display/OO/v2-to-FHIR+Tasks\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/v2-to-FHIR+Tasks\">https://confluence.hl7.org/display/OO/v2-to-FHIR+Tasks</a>. I'll link this thread to that page or you can just add thoughts to the Confluence page directly.</p>\n<p>I'm not convinced that a semi-\"universal\" Task would be needed, only Tasks when the sending system knows there is an action for the receiving system to take. I'd typically leave Task creation to the receiving system (but admittedly, I don't know much about how this works in the real world).</p>",
        "id": 163900212,
        "sender_full_name": "Craig Newman",
        "timestamp": 1555935694
    },
    {
        "content": "<p>Agree you wouldn't always need a Task.  If you're just doing an encounter location change or something, that should be handleable as a normal update.  Task would only be needed if you were seeking fulfillment or if the action couldn't be represented as a create/update/delete/transaction/etc.</p>",
        "id": 163906290,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555942288
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I don't think that it's explicitly known to a ADT A03 sending application what business/workflow impact that will have on a housekeeping system, or a dietary/kitchen system, or who knows what system will receive a broadcast ADT. We know that it does have an impact, but the sending system doesn't. IMHO the default should be a 'message processing task', unless there's good (and documented) reason not to.</p>",
        "id": 163909718,
        "sender_full_name": "René Spronk",
        "timestamp": 1555945270
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> My statement was purposefully NOT about any tasks that are the result of the BODY of order messages. In my mind those would be created in addition to a task for the msg-level-receiver-responsabilities, but they're not the core of my statement.</p>",
        "id": 163909885,
        "sender_full_name": "René Spronk",
        "timestamp": 1555945436
    },
    {
        "content": "<p>It will depend on the trigger.  If the trigger is specifically asking for something to happen and you can make that thing happen via REST, then you can map it to REST.  If someone is mis-using the message and sending it to someone as an FYI rather than a \"please do\" and thus misusing the message, then they'll have to come up with a different solution for their use-case.</p>",
        "id": 163914471,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555949215
    }
]