[
    {
        "content": "<p>Today we are opening the Peer Review for the v2-to-FHIR Guide that is available in the CI Build here: <a href=\"https://build.fhir.org/ig/HL7/v2-to-fhir/branches/master/index.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/v2-to-fhir/branches/master/index.html\">https://build.fhir.org/ig/HL7/v2-to-fhir/branches/master/index.html</a>.  The review closes March 29.</p>\n<p>The goal of the Peer Review is to get feedback on the structure and general content of the guide.  Are we missing sections?  Is the navigation working?  Does it flow?  Etc.  The purpose is NOT to do a detailed of the actual mapping spreadsheets referenced in the guide, although any comments are always welcome.  A comment section is provided on each page where you can enter your commentary, suggestions, questions.</p>\n<p>Note that we could not quite get the layout together for the Test Message Conversion examples.  Attached is a link to the confluence that shows an initial draft of that, albeit it is still missing some intended formatting (<a href=\"https://confluence.hl7.org/display/OO/v2-to-FHIR%3A+Test+Message+Conversions\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/v2-to-FHIR%3A+Test+Message+Conversions\">https://confluence.hl7.org/display/OO/v2-to-FHIR%3A+Test+Message+Conversions</a>). Please provide any feedback, suggestions on the page in the build.  Should we use .xml version for v2?  Is there another layout option?  Could somebody based on highlighting a field/component on the left get the corresponding FHIR attribute/component to highlight as well?  Etc.</p>\n<p>As soon as we are ready and able to participate in a ballot, the focus will shift to the mapping content.</p>\n<p>Thank you!</p>",
        "id": 190799546,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1584407908
    },
    {
        "content": "<p>Hello there, any update for HL7 V2 to FHIR ?</p>",
        "id": 193743692,
        "sender_full_name": "VinhDo",
        "timestamp": 1586750583
    }
]