[
    {
        "content": "<p>I'm a little out of touch with v2 methodology. what's the best way to describe a set of OBX segments in an ORU message, and what they look like. in other words, an equivalent to FHIR profiles. It's still chapter 2.something, right? the conformance thing that's proposed to move to it's own chapter? (<span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span>). What kind of tooling is there that supports this format?</p>",
        "id": 177890935,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570785743
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  - yes, Chapter 2, section \"Conformance using Message Profiles\"  <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=191\" target=\"_blank\" title=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=191\">http://www.hl7.org/implement/standards/product_brief.cfm?product_id=191</a>   (see <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=185\" target=\"_blank\" title=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=185\">http://www.hl7.org/implement/standards/product_brief.cfm?product_id=185</a> for all the V2 document artefacts -- including Implementation Guides for how to 'do V2 Message Profiling'.  ) At one point there was also a registry of (public) conformance profiles too, similar to FHIR.   See also: <a href=\"https://wiki.hl7.org/Conformance_Profile\" target=\"_blank\" title=\"https://wiki.hl7.org/Conformance_Profile\">https://wiki.hl7.org/Conformance_Profile</a></p>",
        "id": 177896265,
        "sender_full_name": "John Silva",
        "timestamp": 1570791053
    },
    {
        "content": "<p>So my memory is faulty here - it’s a while that I played with that, but can I specify a set of segments but not a whole message?</p>",
        "id": 177897527,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570792330
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  - I also don't remember the specifics but I believe the idea was to specify a whole message (actually a set of messages as part of a 'dynamic profile' or message exchange).   I believe segments or segment groups were not profiled individually though tooling (like MWB) would allow you to reuse these as part of multiple profiles.    There was also a V2 Conformance ProfileRegistry that HL7 maintained (not sure if it still lives) but that was (I believe) only for complete message profiles (static and dynamic together).</p>",
        "id": 177903992,
        "sender_full_name": "John Silva",
        "timestamp": 1570798449
    },
    {
        "content": "<p>v2 chapter 2B. The public registry is mostly empty, bar a few test profiles. The XML format specified in 2B is supported by multiple tools. MWB, probably the NIST v2 tools, and some commercial tools as well.</p>",
        "id": 177913515,
        "sender_full_name": "René Spronk",
        "timestamp": 1570805119
    },
    {
        "content": "<p>I recall that MWB allowed you to profile segments or segment groups. I recall too that the format was MWB Special. But I don't want to profile either of those, I want to profile set of segments that isn't a formal segment group</p>",
        "id": 177925154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570812054
    },
    {
        "content": "<p>Recent v2 IGs have all included message level profiles, not just segments or segment groups (although they include those as well). the NIST IGAMT tool (<a href=\"https://hl7v2.igamt.nist.gov/igamt/\" target=\"_blank\" title=\"https://hl7v2.igamt.nist.gov/igamt/\">https://hl7v2.igamt.nist.gov/igamt/</a>) is what I've seen used lately. I've never tried to use it to profile outside of a message so I don't know if you can do it. That tools does support \"co-constraints\" tables which allow you to specify constraints on the OBX segment based on the OBX-3 value (OBX-2/OBX-5 data type, value sets for coded concepts, etc) if that's what you need to do.</p>",
        "id": 177928215,
        "sender_full_name": "Craig Newman",
        "timestamp": 1570814248
    },
    {
        "content": "<p>MWB had its own 'internal format' but it supported exporting to the HL7 Conformance specified XML format; that was how folks originally created profiles to upload to the HL7 V2 Conformance Registry.   I believe NIST took over this function at some point but I have lost track of where it stands now.</p>",
        "id": 177931214,
        "sender_full_name": "John Silva",
        "timestamp": 1570816179
    },
    {
        "content": "<p>NIST ist providing IGAMT as an authoring tool. It also allows for defining profile components, and providing it as a library (@rsnelick).<br>\nIGAMT further developed the profile XML format originally untroduced with MWB.</p>",
        "id": 177979308,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1570871293
    },
    {
        "content": "<p>but it's not standard?</p>",
        "id": 178018270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570936644
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  It appears that the XML profile format is Normative, from what is written in HL7 V2.5 (what I had handy) in Chapter 2.19:</p>\n<p>\"The message profile DTD and schema are both included here. The message profile schema is normative in order to express the rules by which the registry will validate.\" </p>\n<p>The XML Schema and DTD are defined in 2.19.1 and 2.19.2 respectively.</p>",
        "id": 178035123,
        "sender_full_name": "John Silva",
        "timestamp": 1570967412
    },
    {
        "content": "<p>The format is part of the standard. We are currently working on separating it out so that it is applicable to all versions.</p>\n<p>Well, it already is, but there is some perception that it version specific. We want to get rid of that.</p>",
        "id": 178092239,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1571049935
    },
    {
        "content": "<p>so there's no way to have a profile that describes a set of OBX segments without describing a message?</p>",
        "id": 178171329,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571128031
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  The v2 conformance methodology is now a separate (independent) specification and applies to any v2 version. That is, you use this methodology for profiling regardless of the version of your message. This was submitted in the September 2019 ballot (a normative ballot is planned for January 2020). Many new profiling features have been added including co-constraints which allows you profile a group of OBX segments and dependencies among elements. NIST IGAMT supports this construct in the context of a message profile (although it should be straight-forward to peel off). A second generation of IGAMT (IGAMT-2) will support independent co-constraints (meaning that they can be profiled, exported, and validated “on their own”). The construct will also have a richer set of capabilities that include setting a trigger at a higher level (e.g. OBR-4), groups, usage and cardinality of the segment instance tied to content, etc.—things like “if I see this OBX segment with this LOINC code then I require these two OBX segments in this OBX group with these characteristics”.) This update is a few months away. The goal is to support at minimum the Message Mapping Guides (excel) developed by the CDC Case Notifications team. IGAMT is following the XML schema in the balloted specification (that maintains backwards compatibility).</p>",
        "id": 178204276,
        "sender_full_name": "Rob Snelick",
        "timestamp": 1571153298
    },
    {
        "content": "<p>If this related to a v2 to FHIR mapping, it is very likely that you will need the whole message to accurately map OBX fields to the corresponding resources.</p>",
        "id": 178226859,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1571167832
    },
    {
        "content": "<p>actually, it's not. It's related to the reverse</p>",
        "id": 178234477,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571173192
    },
    {
        "content": "<p>it sounds like I really need to IGAMT thing but maybe I can make do with out in the short term</p>",
        "id": 178240374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571178032
    },
    {
        "content": "<p>thanks</p>",
        "id": 178240377,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571178035
    },
    {
        "content": "<p>In Germany we habe insurance profile components described to be used with all ADT messages, independent of message structures and events. <br>\nYou identify its inclusion in MSH.21.</p>",
        "id": 178360979,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1571301257
    }
]