[
    {
        "content": "<p>I worked as a volunteer and head of a developing chapter in Brazil, and Hacking Health taught me a lot.<br>\nIt's interesting to see how open innovation can speed things up, but my feeling is that it was a long time before ideas were converted into something material.<br>\nI don't know how the movement is today, apparently they are moving towards a better structuring. The HL7 + HH combination can be a phenomenal tool of change.</p>",
        "id": 173299527,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1565883090
    },
    {
        "content": "<p>The interest in HH in Australia was significantly eroded because there were great ideas, but almost all of them required real integration, and that wasn't possible in the HH framework</p>",
        "id": 173314061,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565894965
    },
    {
        "content": "<p>I reached out the HH people in hte past to see if we can work together on DevDays, but they weren't very responsive.</p>",
        "id": 173351736,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1565937182
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span> and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>,  yes, all what you say is true.<br>\nI worked with the movement for about three years and I can say (from within) what moves them.<br>\nThe movement is purposely disorganized because it assumes that people can benefit from it.<br>\nEven more boldly, I always wanted to understand why there were no pre-leveling activities or whatever, but then I noticed that the issue is in the absolute openness of the volunteer mind.<br>\nThe consequences are as bizarre as possible. Illegal or unethical solutions between.<br>\nOnly it changes people, and I saw the modifying power that movement leaves behind.</p>",
        "id": 173452143,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1566065117
    },
    {
        "content": "<p>right. you've captured both the strength and the weakness</p>",
        "id": 173457870,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566074884
    }
]