[
    {
        "content": "<p>BPAC Clinical Solutions provide a number of decision support and referral solutions to the primary health sector in NZ. Integration with PMS's is by a unique API for each PMS. With the advent of new PMS vendors entering the NZ market (e.g. Valentia) we are wanting to standardise our PMS integration and are hoping to standardise on FHIR. The first part of this project is to investigate how we would express the data that we currently exchange with a PMS using FHIR vocabulary. Once we have settled on how to express things in FHIR it will make it much simpler to integrate with actual FHIR implementations. Some of the translations are obvious (e.g. a script becomes a medicationOrder) and some of them are problematic (e.g. a long term prescription) and I will be raising questions on this forum as those problematic ones come to light.</p>",
        "id": 153869304,
        "sender_full_name": "Chris Hilder",
        "timestamp": 1485472831
    },
    {
        "content": "<p>Chris, I suggest contacting <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> who has done something similar with the Australian PMS products. Within NZ,  there have been discussions on mapping the GP2GP Data Model to FHIR - the former is based on the CCD/CCR model and there is the possibility to map via CCDA on FHIR (a GP2GP to CCDA mapping exists). This is obviously too generic to meet all your requirements - in particular, it's extremely light on referrals - but would still be a good start. I also hope that we will have an NZ Patient Profile in the near future, with as many contributors as possible (including BPAC, of course!). Raising questions on this forum is an excellent means of engagement!</p>",
        "id": 153869315,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1485479848
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> recommend looking at your key admin content needed for NZ localisation; i.e patient, provider and ogranisation identifiers; indigenous status.  Especially needing to cover local concepts that wouldn't be considered in the international specification.  Is there a place where this discussion would happen for NZ ? I would be very keen to get involved myself esp with Medtech overlap with AU market.  </p>",
        "id": 153870059,
        "sender_full_name": "Brett Esler",
        "timestamp": 1486215044
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> Always happy to receive input from over The Ditch! HL7 NZ is about to embark on a process of engagement with all affected parties to produce an NZ Patient Profile for STU3. This will include NHI and HPI identifiers (candidate URLs are cited earlier in this Stream) and extensions and Code Systems for NZ-specific ethnicity concepts, such as Iwi and Hapu. We're also encouraging Kiwi implementers to use zulip. Hopefully, we can achieve a broad consensus that will be endorsed by the Health Information Standards Organisation (HISO). Vendors will be included and we're well aware that many also have a significant number of sites in Australia - albeit in many cases (e.g. Medtech) with different products. If CDA experiences are anything to go by, the NZ Patient Profile will be simpler than the  Australian one as we didn't create any header extensions (ethnicity was placed in an Additional Patient Demographics Section).</p>",
        "id": 153870087,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1486255765
    }
]