[
    {
        "content": "<p>There is a desire to have a register of  hospital clinical teams in  the HPI.  These are the teams typically led by a consultant with a variety of doctors and interns belonging to the team.    There are 2 possible ways to model these teams 1. using the Organisation resource for the Team id and name and the PractitionerRole resource to record  the participants belonging to the team or 2. using the CareTeam resource without a subject or encounter (care teams relating to a particular patient are out of scope for the HPI). Anyone have any guidance on pros and cons of each approach?</p>",
        "id": 168564343,
        "sender_full_name": "Anne Goodwin",
        "timestamp": 1561002131
    },
    {
        "content": "<p>CareTeam allows you to identify specific functions within the team.  Organization does not.  Organization is probably more widely supported by implementers and is available for use as an 'actor' in more places than CareTeam is in R4 (though CareTeam should appear everwhere relevant in R5)</p>",
        "id": 168564471,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561002378
    },
    {
        "content": "<p>Do you mean that the CareTeam Participant Role would describe the specific function someone has on the team. I thought we could achieve this using the  Organisation/PractitionerRole approach, by using the PractitionerRole.code to describe the function someone has in a team.</p>",
        "id": 168810158,
        "sender_full_name": "Anne Goodwin",
        "timestamp": 1561327921
    },
    {
        "content": "<p>PractitionerRole is describes professional capacity (e.g. \"Registered Nurse\").  CareTeam allows you to identify a specific function (e.g. \"weekday homecare nurse\").  The Role is independent of the team.  The function is team- specific.</p>",
        "id": 168812289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561332168
    },
    {
        "content": "<p>OK Thanks</p>",
        "id": 168813182,
        "sender_full_name": "Anne Goodwin",
        "timestamp": 1561333977
    },
    {
        "content": "<p>Also, a 'sub-organization' can only be 'partOf' a single 'parent' organization. Is this always going to be the case for a careteam?</p>",
        "id": 169424468,
        "sender_full_name": "David Hay",
        "timestamp": 1562009700
    },
    {
        "content": "<p>My view is that there are more fundamental building blocks for the NZ HPI Project to consider before moving onto Hospital Care Teams. In particular, the NZ Sector requires a directory that links providers to facilities and organisations - and a mechanism for keeping this up-to-date. IMHO, only when this is in place should we be looking at the more granular layer of care team registers within organisations and facilities; otherwise we are attempting to build the roof of a house before the walls have been completed.</p>",
        "id": 169436473,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1562019894
    }
]