[
    {
        "content": "<p>We have a requirement to model Practitioner registrations in the HPI where a 'registration' means that a practitioner is formally recognized by a registration authority (like a medical or nursing council). The registration includes things like one or more scopes of practice or restrictions on practice - each of which has a description and a period of applicability.</p>\n<p>The issue has arisen that as registration is not an existing node in Practitioner, we are faced with a 3 level extension (registration -&gt; scope of practice -&gt; description / date  which doesn't seem implementer friendly.</p>\n<p>An alternative might be to model the scope / restrictions as a referenced/contained resource (profiled Consent/Contract/Basic perhaps) though it could be argued that having to traverse a reference is as much work as a 3rd level of extension (though one they have to do already)...</p>\n<p>Thoughts, comments or suggestions? The model is here if you want to take a look: <a href=\"http://nz.clinfhir.com/logicalModeller.html#$$$HpiPractitioner#ep7m7\" target=\"_blank\" title=\"http://nz.clinfhir.com/logicalModeller.html#$$$HpiPractitioner#ep7m7\">http://nz.clinfhir.com/logicalModeller.html#$$$HpiPractitioner#ep7m7</a></p>",
        "id": 167601621,
        "sender_full_name": "David Hay",
        "timestamp": 1559932500
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 167603910,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559934030
    },
    {
        "content": "<p>In the Australian model the AHPRA registration sounds very similar.<br>\nThere we've added an extension for the specialty, and the rest was OK.</p>",
        "id": 167620438,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559948151
    },
    {
        "content": "<p>For AHPRA each specialty actually has a separate idententifier, to we repeat the registration (qualification)</p>",
        "id": 167620511,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559948191
    },
    {
        "content": "<p>So you treat the qualification and the registration as the same? ie under Practitioner.qualification?</p>",
        "id": 167622960,
        "sender_full_name": "David Hay",
        "timestamp": 1559950822
    },
    {
        "content": "<p>Qualifications, certifications, registration, training, all under that one backbone, they aren't really all that different.<br>\nIn the core we will be clarifying that text.<br>\nThe other thing we _could_ consider would be extracting that out as a resource on its own, but don't know if that's too granular too.</p>",
        "id": 167634787,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559970429
    },
    {
        "content": "<p>Thanks Brian - I'll refactor the model and see where that takes us. At least we won't be the first with a 3 level extension!</p>",
        "id": 167704932,
        "sender_full_name": "David Hay",
        "timestamp": 1560095073
    },
    {
        "content": "<p>And check the VhDir IG it has some extension specifically in that area too.</p>",
        "id": 167709235,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1560101719
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>  I'm independently thinking about this question and came across this thread. What's your current thinking? the referenced model is not coming up for me.</p>\n<p>I found a reference to 'scope of practice' in the VisionPrescription resource documentation (<a href=\"https://www.hl7.org/fhir/visionprescription.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/visionprescription.html\">https://www.hl7.org/fhir/visionprescription.html</a>), but no obvious info on how that scope of practice is communicated/verified.</p>",
        "id": 170862473,
        "sender_full_name": "John Carter",
        "timestamp": 1563163315
    },
    {
        "content": "<p>based on the feedback so far, we're taking a closer look at the PUT update rather than individual operations. wrt 'scope of practice, I assume that this means those individuals who can 'prescribe' glasses - eg an optometrist...</p>",
        "id": 170862996,
        "sender_full_name": "David Hay",
        "timestamp": 1563164393
    },
    {
        "content": "<p>btw - if you have an opinion in favour of operations - or PUT updates -  then speak out! Now's the time for collecting vendor preferences...</p>",
        "id": 170863060,
        "sender_full_name": "David Hay",
        "timestamp": 1563164471
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> regarding scope of practice, yes that's basically it. Even more specifically, it might be that one provider has a special endorsement to do sunglasses or contact lenses, and my use case is to discover that from a provider directory: \"show me the nearest sunglasses prescriber\"</p>",
        "id": 171401499,
        "sender_full_name": "John Carter",
        "timestamp": 1563768132
    }
]