[
    {
        "content": "<p>Hi all,<br>\nDoes anyone know of any healthIT/FHIR related job opportunities in Christchurch please? My latest position hasn't worked out and I am hunting with a sense of urgency now.<br>\nThanks in advance</p>",
        "id": 153943753,
        "sender_full_name": "Nate Walker",
        "timestamp": 1520840291
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192240\">@Nate Walker</span> - maybe try Pegasus - HL7NZ  Board Member  <span class=\"user-mention\" data-user-id=\"191683\">@David Moorhouse</span> who works there might be able to advise further.</p>",
        "id": 153943757,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1520844867
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> , last I knew they weren't looking for anyone. Hopefully David will see and give a bit more information</p>",
        "id": 153943758,
        "sender_full_name": "Nate Walker",
        "timestamp": 1520845365
    },
    {
        "content": "<p>This was posted on top level <a class=\"stream\" data-stream-id=\"193771\" href=\"/#narrow/stream/193771-work-opportunities\">#work opportunities</a>  but adding here as well. </p>\n<p>We're looking for an integration specialist with practical knowledge and skills to design and implement HL7 v2.x and FHIR based interfaces. Our existing integrations use Mirth Connect but we are working to add native FHIR based health information exchange capabilities to our software platform. Position is currently on a part-time / per assignment basis with possibility to go for a permanent position. Working conditions include flexible time and working in remote (although New Zealand, Australia, Singapore and Europe is preferable).</p>\n<p>If interested or if you know someone who may be interested, could you please pass the information / CV to <a href=\"mailto:koray@theclinician.com\" title=\"mailto:koray@theclinician.com\">koray@theclinician.com</a>?</p>",
        "id": 187798470,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1581325474
    }
]