[
    {
        "content": "<p>I'm currently exploring options for a future application where FHIR would be suitable (and desirable) in most ways, but one thing I'm stuck on is the need to track inventory (stock on hand) of a set of medications per organization. Whilst I could do this, am I pushing FHIR beyond its intended usage in this situation?</p>",
        "id": 175861580,
        "sender_full_name": "David White",
        "timestamp": 1568675474
    },
    {
        "content": "<p>the Medication resource is for inventory? And have you looked at the catalog work?</p>",
        "id": 175862473,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568676487
    },
    {
        "content": "<p>So an organization has a collection of medications, and I need to track the quantities currently on hand for each medication, and adjust this quantity as medications are administered or received from a order supply.</p>",
        "id": 175863049,
        "sender_full_name": "David White",
        "timestamp": 1568677144
    },
    {
        "content": "<p>That sounds like a new resource.  However, it also sounds like a resource that's not clearly within HL7's scope as inventory systems aren't a healthcare-specific notion - just as human resources, user management, procurement and other business processes aren't uniquely healthcare-specific.  Traditionally we've been reluctant to introduce content that far outside the healthcare space.</p>",
        "id": 175864634,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568678807
    },
    {
        "content": "<p>Thanks, I suspected that may be the case. The majority of the system requirements fit well within the scope e.g. organizations, practitioners, patients, medications, dispense, administrations, observations, but the requirement to track the non-healthcare aspect(s) muddy things.</p>",
        "id": 175865157,
        "sender_full_name": "David White",
        "timestamp": 1568679412
    },
    {
        "content": "<p>Basic is always available as a fallback - you can use that to do anything imaginable.  You're also free to propose adding a resource (probably to the attention of Orders &amp; Observations).  Making arguments about any aspects of inventory management that you feel are unique to healthcare may help the case.</p>",
        "id": 175870185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568686671
    },
    {
        "content": "<p>I'll have a read up of Basic. In this instance the inventory management requirements are healthcare specific, but I suspect the use cases would be very narrow (in our instance its specific to pharmacy and aged care facilities). Pharmacy management systems have a substantial amount of crossover between healthcare and business processes/information stored, so something I'll need to consider moving forwards.</p>",
        "id": 175871234,
        "sender_full_name": "David White",
        "timestamp": 1568688244
    }
]