[
    {
        "content": "<p>What system namespace should be used for coding Medications (using CodeableConcepts) where the underlying system is MIMS ?   There is an OID in the HL7 NZ list of OIDs but that seems very R3 like.</p>\n<p>I'd be expecting something either like:</p>\n<ul>\n<li><a href=\"https://standards.digital.health.nz/mims\">https://standards.digital.health.nz/mims</a></li>\n<li><a href=\"http://mims.co.nz\">http://mims.co.nz</a><br>\netc</li>\n</ul>\n<p>But don't want to go making stuff up either.</p>",
        "id": 237264501,
        "sender_full_name": "David Moorhouse",
        "timestamp": 1620100363
    },
    {
        "content": "<p>You can just use the oid. From the datatypes page:</p>\n<p>An OID represented as a URI (RFC 3001 ); e.g. urn:oid:1.2.3.4.5 xs:anyURI   JSON string - uri<br>\nRegex: urn:oid:<a href=\"http://\\.(0|[1-9][0-9]*)\">0-2</a>+</p>",
        "id": 237268297,
        "sender_full_name": "David Hay",
        "timestamp": 1620103997
    },
    {
        "content": "<p>There may be a plan to create new systems to replace the oids = <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> may know more...</p>",
        "id": 237268395,
        "sender_full_name": "David Hay",
        "timestamp": 1620104095
    },
    {
        "content": "<p>FWIW, AU Base does this <a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base/CodeSystem-mims.html\">http://build.fhir.org/ig/hl7au/au-fhir-base/CodeSystem-mims.html</a></p>",
        "id": 237268559,
        "sender_full_name": "Jim Steel",
        "timestamp": 1620104248
    },
    {
        "content": "<p>(I should say, I'm not recommending it, just observing)</p>",
        "id": 237268571,
        "sender_full_name": "Jim Steel",
        "timestamp": 1620104270
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span>  - I'd be inclined to follow the pattern in AU base and use <a href=\"http://www.mims.co.nz/codes\">http://www.mims.co.nz/codes</a> as the code system URL and <a href=\"http://hl7.org.nz/fhir/ValueSet/mims\">http://hl7.org.nz/fhir/ValueSet/mims</a> as the value set containing all codes in the code system.  <a href=\"http://mims.co.nz\">mims.co.nz</a> is certainly their NZ domain.</p>",
        "id": 237278682,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620112458
    },
    {
        "content": "<p>It would be worth following up with <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> to see why it is the way it is</p>",
        "id": 237304193,
        "sender_full_name": "Jim Steel",
        "timestamp": 1620126036
    },
    {
        "content": "<p>The fact you <em>can</em> use the OID, doesn't mean that's good practice.  You <em>should</em> as a country define a standard human-readable URI for all code systems and identifier systems - even if they have OIDs to minimize the number of times OIDs show up in your FHIR instances.  (You want to avoid OIDs in FHIR if you can because they're hard for implementers to work with.)</p>",
        "id": 237324557,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620135329
    },
    {
        "content": "<p>I'm with Lloyd on this.  OID are ugly, error prone and not human friendly, so seem like an anti pattern in a FHIR world.<br>\n<span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  <span class=\"user-mention\" data-user-id=\"195045\">@John Carter</span>  could this be an item for the NZ IG working group to consider ?</p>",
        "id": 237392554,
        "sender_full_name": "David Moorhouse",
        "timestamp": 1620160006
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191683\">@David Moorhouse</span>  I'm happy to add a discussion of this topic to the WG agenda. That AU example certainly looks useful / readable to me (although I would change the definition text to just cover \"what is this thing\") (andI would like it even better if the code system URL were resolvable).</p>",
        "id": 237396383,
        "sender_full_name": "John Carter",
        "timestamp": 1620161810
    },
    {
        "content": "<p>If there's a strong v3/CDA community in New Zealand, some will argue that sticking with OIDs avoids the need to translate, but the reality is that implementers will need a translation infrastructure no matter what, as many standard code systems (LOINC, SNOMED, ICD, etc.) and a few identifier systems already have mandated URIs, and the NamingSystem resource makes translating - and sharing the translations -  relatively straightforward.</p>",
        "id": 237396622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620161919
    },
    {
        "content": "<p>If we are going to use a MIMS Code System URL for NZ, we need to seek approval from the Code System owner, so I'll start that conversation with the local MIMS Solution Delivery Manager. If they provide one, we can use it, via Terminz, in our CDA-&gt;FHIR and PMS-&gt;FHIR conversations. </p>\n<p>However, this is really for legacy data as ALL community systems should be using NZULM (and need to do so for NZePS which is now almost universally adopted in those systems) and secondary care systems are moving to NZULM. We have one PMS vendor that is translating NZULM codes back to MIMS in GP2GP and that simply should NOT be happening.</p>",
        "id": 237405551,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620164731
    },
    {
        "content": "<p>Technically, you <em>don't</em> need approval of the code system owner (or the identifier issuer) to define a URL to be used for that system in FHIR instances.  There are times when it's useful to do that - especially if you won't need to spend too much time explaining the need, what FHIR is, etc. and the organization might be willing to establish a permalink.  However, for many organizations, the amount of effort involved in performing the consultation isn't worth it and isn't necessary.  The URL is just the technical identifier used to represent the namespace when using FHIR and there's no more need to talk to them about what the URL should be as there is to talk to them about what the v2 code or v3 OID should have been.</p>",
        "id": 237408107,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620165978
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - my preference is to seek the approval of the code system owner, if at all possible. If that doesn't bear fruit, then the HL7NZ FHIR IG WG can determine what it should be.</p>",
        "id": 237409205,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620166567
    },
    {
        "content": "<p>Sometimes it can bear the wrong sort of fruit - a strong statement of \"You must use URL x\" when that URL is not appropriate (not human readable, way too long, unlikely to be valid long-term as a permalink), or a protracted discussion that drags on for months when you need a decision in weeks.  For some organizations, reaching out is absolutely the right thing to do.  For others, it's definitely the wrong thing to do.  So if possible, don't box yourself into a one-size-fits-all policy.</p>",
        "id": 237412763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620168641
    },
    {
        "content": "<p>Hopefully, we can use <a href=\"http://www.mims.co.nz/codes\">http://www.mims.co.nz/codes</a> as the code system URL, which shouldn't be too onerous. Their NZ Web Site Address is <a href=\"http://www.mims.co.nz\">www.mims.co.nz</a>. Obviously, having developed and maintained a FHIR Terminology Server, containing many local terminologies, for 6 years, I have (at least) some understanding of the generic challenges involved here. :)</p>",
        "id": 237413872,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620169290
    },
    {
        "content": "<p>MIMS has officially asked NZ FHIR implementers to use <a href=\"http://www.mims.co.nz\">http://www.mims.co.nz</a>  as the Code System URI for MIMS in New Zealand...</p>\n<p>\"Please use <a href=\"http://www.mims.co.nz\">http://www.mims.co.nz</a> (for NZ). <br>\nIn addition, include <a href=\"mailto:info@mims.com.au\">info@mims.com.au</a> for any interested party to contact us for more information.\"</p>\n<p><span class=\"user-mention\" data-user-id=\"191683\">@David Moorhouse</span> <span class=\"user-mention\" data-user-id=\"195045\">@John Carter</span> <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span></p>",
        "id": 238563930,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620865558
    }
]