[
    {
        "content": "<p>I need to create some ValueSets / CodeSystems for the NHI Patient (eg iwi). What base url should I use? </p>\n<p>Currently I'm using <strong>http://hl7.org.nz/fhir/ValueSet/ </strong>and <strong>http://hl7.org.nz/fhir/CodeSystem/</strong> to be consistent with the StructureDefinitions, but wondering if I should use <strong>https://standards.digital.health.nz/valueset/ </strong>and <strong>https://standards.digital.health.nz/codesystem/</strong></p>\n<p>Also: what's the best way to name them?</p>\n<p>(you can see all the urls for coded elements in the Analysis &gt; Coded tab of the model) - extensions are at Analysis &gt; Extensions</p>",
        "id": 170592975,
        "sender_full_name": "David Hay",
        "timestamp": 1562806058
    },
    {
        "content": "<p>For Code Systems, I believe that should be determined by their owner/custodian. If it's the Ministry then we already have a base Naming System Identifier URL... <br>\n<a href=\"https://standards.digital.health.nz/codesystem\" target=\"_blank\" title=\"https://standards.digital.health.nz/codesystem\">https://standards.digital.health.nz/codesystem</a> <br>\nan example being... <br>\n<a href=\"https://standards.digital.health.nz/codesystem/ethnic-group-level-4\" target=\"_blank\" title=\"https://standards.digital.health.nz/codesystem/ethnic-group-level-4\">https://standards.digital.health.nz/codesystem/ethnic-group-level-4</a><br>\nFor Value Sets, it should be the canonical URL that represents the literal address of the authoritative definition of the Value Set. This does not prevent other FHIR servers from holding any given Value Set and, indeed, I'd be happy to place them on Terminz until such time as the MoH can host them (I already have the NZ Ethnicity ones).</p>",
        "id": 170598698,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1562815740
    },
    {
        "content": "<p>...BTW, if your Project is going to introduce Iwi Codes to the NHI, then I can grab them from the Ministry of Education Web Site and create the relevant CodeSystem &amp; ValueSet resources. The latest version is the 2018 one used in the last Census, but if you want historical ones as well.....</p>",
        "id": 170602431,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1562821901
    },
    {
        "content": "<p>yeah - I did wonder if I had it right, though does beg the question whether any terminology ones would be under the hl7 nz domain...</p>\n<p>Currently I'm placing them in ontoserver so the model can display them (I generate them using a script off a spreadsheet that the ministry have provided) but you can easily copy them from there if you wish - the urls are in the model (I'll update them tomorrow and ping you when that's done).</p>",
        "id": 170602686,
        "sender_full_name": "David Hay",
        "timestamp": 1562822295
    }
]