[
    {
        "content": "<p>For further discussion: here's the extension that has been introduced to qualify Patient matches:<br>\n<a href=\"http://hl7.org/fhir/extension-match-grade.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-match-grade.html\">http://hl7.org/fhir/extension-match-grade.html</a><br>\n...is that something we can reuse for our purposes?</p>",
        "id": 154018813,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542286453
    },
    {
        "content": "<p>The ValueSet consists of  <code>certain|probable|possible|certainly-not</code></p>",
        "id": 154018814,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542286521
    },
    {
        "content": "<p>To add on that, in MachineLearning based applications, you usually have a \"confidence\" with a value range of [0..1].</p>",
        "id": 154018843,
        "sender_full_name": "Philipp Daumke",
        "timestamp": 1542290123
    },
    {
        "content": "<p>Yes, I have been thinking that it doesn't make much sense to create a Condition with a confidence of \"certainly-not\" from a piece of text that indicates that a Patient <em>doesn't</em> have a particular diagnosis. You'd much rather create a \"refuted\" Condition with a confidentiality of \"0.8\"</p>",
        "id": 154018846,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542290371
    },
    {
        "content": "<p>A thought on using numerical scores for confidence: Just in classical statistics, we've got a number of different ways of indicating confidence: p-values (where <em>smaller</em> is more confident), odds-ratios (which can be smaller or larger than 1), confidence intervals etc. So I would guess that (1) it would be hard to force people to use one fixed numerical scale to indicate confidence, and conversely (2) it would be very hard for people to evaluate what a given standardized score actually means in a given case (e.g. how was this value produced or mapped from another kind of score?).  So if some sort of numerical indicator of confidence was added, my feeling is that it should always be combined with an indication (encoded or otherwise) of <em>what that number represents</em> (e.g.  a p-value from a specific kind of test) - sort of like value and unit go together in <code>valueQuantity</code>. If it is an output of a complicated AI-pipeline, that indication would presumably be a reference to the software that outputted it. Independently of that, a <code>ValueSet</code>for indicating an overall conclusion could of course still be useful.</p>",
        "id": 154019116,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1542365171
    },
    {
        "content": "<p>For the purpose of interoperability, I think it’s important to find a simple measure that all parties can agree on and map to. Also, it should be a human readable/understandable representation, so a suitable ValueSet with 3-5 codes would be ideal, IMO.</p>",
        "id": 154019816,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542727805
    },
    {
        "content": "<p>somewhat related. IHE has produced a set of profiles that work together. Starting with MHD that provides access to an HIE that is document centric, yet recognizing that most consumer apps don't want to consume documents. So the mXDE profile orchistrates MHD with QEDm. Where QEDm is a thin profile of the core FHIR resources in query mode (e.g. Query on Observation, Medication, etc...). The orchistration includes the specification of Provenance to link the various FHIR Resources to the documents from which that data came from. There is no confidence identified, except that one can determine for any one Observation, that it has been found in N documents. This addresses only how often that thing has been observed, not the confidence specifically.  There is however a well defined profile on Provenance for communicating this, and communicating the 'agent' that did the extraction. see <a href=\"https://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction\">https://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction</a></p>",
        "id": 154020243,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542820200
    }
]