[
    {
        "content": "<p>Hallo, <br>\nbei der Archivierungs- und Wechselschnittstelle gibt es für einige Beobachtungen entsprechende Ressourcen (z.B. Körpergröße, Körpergewicht, Puls....). Jetzt gibt es natürlich noch viele weitere Messungen, für welches es keine eigene Ressource gibt (z.B. Kopfumfang, Pulsoximetrie....). Wie soll mit den entsprechenden Ergebnissen umgegangen werden? <br>\nSchonmal vielen dank für die Hilfe.</p>",
        "id": 210365755,
        "sender_full_name": "Simon Schmitt",
        "timestamp": 1600334247
    },
    {
        "content": "<p>Das ist eine sehr gute Frage, die aber vermutlich zumindest parallel direkt bei der KBV eingebracht werden sollte.</p>",
        "id": 210480477,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1600407449
    },
    {
        "content": "<p>Das sind alles einzelne Observations. Vieles davon sind schon mit LOINC Codes versehen. Man kann bei IHE PCC nachsehen. Und bei Gecco haben wir weitere. </p>\n<p>Die Frage ist, ob man das generisch macht und einfach exportiert? Oder ob man für jeden Wert ein eigenes Profil mit allen Konsequenzen definieren will?</p>\n<p>Wir haben DCM und CIMI instanziiert, damit man übergreifende Inhalte definiert, also bspw. die verschiedenen Körpergewichte, um daraus dann verschiedene Technologien bedienen zu können. </p>\n<p>Die entscheidende Frage ist aber, können die Systeme denn sagen, welches Körpergewicht dokumentiert worden ist?</p>",
        "id": 210482798,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1600410432
    },
    {
        "content": "<p>Der Hintergrund der Frage dürfte sein, dass die KBV keine entsprechenden Observation-Profile spezifiziert hat und die Übermittlung von \"nicht-AWS\"-Observations im Rahmen von AWS genau genommen nicht zulässig ist.</p>",
        "id": 210515189,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1600434506
    },
    {
        "content": "<p>Bei einer AWS muss letztendlich doch alles ex- und wieder importiert werden,  sonst ist es ja keine.. <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span><br>\nDie Frage ist dann: will ich für alles ein eigenes Profil? Oder geht es generisch?<br>\nZu Zeiten von v2 haben wir vieles über den Code gemacht. Kriegen wir also einen vernünftigen Mittelweg?</p>",
        "id": 210676554,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1600623375
    },
    {
        "content": "<p>Vielen Dank für die Antwortungen. Ich werde mich an die KBV wenden...</p>",
        "id": 210732623,
        "sender_full_name": "Simon Schmitt",
        "timestamp": 1600690745
    },
    {
        "content": "<p>*Antworten natürlich</p>",
        "id": 210732649,
        "sender_full_name": "Simon Schmitt",
        "timestamp": 1600690764
    }
]