[
    {
        "content": "<p>Hallo,</p>\n<p>ich habe eine Frage zur Basisressource \"KBV_PR_Base_Patient\" (<a href=\"https://simplifier.net/base1x0/kbvprbasepatient\">https://simplifier.net/base1x0/kbvprbasepatient</a>). Gibt es die Möglichkeit das Patientenalter unterzubringen und wo wäre dies am besten möglich?</p>\n<p>Über Kommentare und Anmerkungen wäre ich sehr dankbar.</p>",
        "id": 244919239,
        "sender_full_name": "Nina Schewe",
        "timestamp": 1625481221
    },
    {
        "content": "<p>Hallo,</p>\n<p>normalerweise wird das Alter implizit über das Feld 'Patient.birthDate' festgehalten. Aus diesem berechnen Systeme dann automatisch das Alter. Hilft das?</p>",
        "id": 244919520,
        "sender_full_name": "Yannick Börner",
        "timestamp": 1625481391
    },
    {
        "content": "<p>Genau genommen ist das Alter keine \"unveränderliche\" Eigenschaft eines Patienten.<br>\nAltersangaben werden ja in der Regel im Kontext z.B. des Auftretens einer Erkrankung verwendet, was sogar eher eine Eigenschaft der Erkrankung wäre als des Patienten.<br>\nWenn man also unbedingt das Alter abbilden möchte, z.B. weil das Geburtsdatum wegen Pseudonymisierung nicht bekannt ist, sollte man das \"Alter bei Erkrankung\" am ehesten als eigene Observation abbilden oder ggf. als Extension an Condition.</p>\n<p>Aber in Fällen, wo das Geburtsdatum bekannt ist, ist die separate Angabe des Alters redundant, wie Yannick schon schreibt.</p>",
        "id": 244921083,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1625482448
    },
    {
        "content": "<p>Ganz lieben Dank! Das hilft mir schon sehr weiter.</p>",
        "id": 244923383,
        "sender_full_name": "Nina Schewe",
        "timestamp": 1625483945
    },
    {
        "content": "<p>Als search parameter mag es wohl öfters ganz sinnvoll sein: <a href=\"https://www.hl7.org/fhir/patient-extensions-Patient-age.html\">https://www.hl7.org/fhir/patient-extensions-Patient-age.html</a></p>",
        "id": 244950589,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1625499751
    }
]