[
    {
        "content": "<p>Hallo, <br>\nwie soll (zukünftig) mit KBV-Basis-Profilen umgegangen werden, die von veralteten Basisprofilen DE R4 abgeleitet wurden bzw. wie sehen die Aktualisierungspläne für die betroffenen KBV-Profile aus? <br>\nIn meinem Fall betrifft das die Profile: <br>\nKBV_PR_Base_Datatype_Name, <br>\nKBV_PR_Base_Datatype_Maiden_Name, <br>\nKBV_PR_Base_Datatype_Post_Box_Office, <br>\nKBV_PR_Base_Datatype_Street_Address<br>\nDie KBV-Basis-Profile verweisen auf die Basisprofile der Version 0.9.13. Über die FHIR Registry oder Simplifier sind aber nur die Packages 1.0.0 – 1.2.0 verfügbar und die Packageversion ist doch mit der Version der einzelnen Profile identisch, oder? <br>\nQuick and dirty wäre die Versionsangaben aus meiner lokalen Kopie zu entfernen oder über die  Versionshistorie im Simplifier-Projekt der KBV  die betroffenen Profile mit  Version 0.9.13 zu kopieren, damit der Java Validator keine Fehler mehr ausgibt. </p>\n<p>Hat sie hierzu schon jemand Gedanken gemacht oder gibt es irgendwelche Anweisungen hierzu?<br>\nSchonmal vielen Dank.</p>",
        "id": 269704032,
        "sender_full_name": "Antje Borgmann",
        "timestamp": 1643359820
    },
    {
        "content": "<p>Die Basisprofile in der damals aktuellen Version sind weiterhin über Simplifier als auch die Registry API verfügbar. Per Default sind diese Packages ausgeblendet. Hier wäre die Version 0.9.13: <a href=\"https://simplifier.net/packages/de.basisprofil.r4/0.9.13\">https://simplifier.net/packages/de.basisprofil.r4/0.9.13</a></p>",
        "id": 269710170,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1643363059
    },
    {
        "content": "<p>Vielen Dank für die schnelle Antwort. <br>\nDie MIOs werden bei neuen Vorgaben des G-BA (turnusmäßig) einem Update unterzogen, wie jetzt beim MIO Mutterpass. Wie sieht es denn bei den KBV-Basisprofilen aus? Gibt es Regelungen, ob sie regelmäßig an bspw. überarbeitete Basisprofile DE angepasst werden sollen? Gerade wenn auch Wechsel im Status von draft auf active vorgenommen wurden oder neue KBV-Basis-Profile vielleicht von neueren Versionen der Basisprofile DE ableiten ...</p>",
        "id": 269947830,
        "sender_full_name": "Antje Borgmann",
        "timestamp": 1643567194
    },
    {
        "content": "<p>Die KBV-Basis-Profile werden regelmäßig  geupdatet. Bei jeder Aktualisierung wird auch eine Anpassung der Referenzierung zu den Hl7-Basisprofilen geprüft. Allerdings sind derzeit schon eine nicht unerhebliche Anzahl von Schnittstellen von der KBV-Basis abhängig, so dass eine gewisse Stabilität der Abhängigkeiten auch ein relevanter Faktor geworden ist. Die nächste größere Anpassung soll ein Upgrade zur Hl7.Basis V1.X.X beinhalten.</p>",
        "id": 270523577,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1643882191
    }
]