[
    {
        "content": "<p>For our FHIR training course it may be fun to create a kind of \"guess who\" (game) type decision tree: if one player were to randomly choose a resource type, how could the other player, using the lowest number of questions possible, find out (using simple yes and no questions) what resource they had in mind? (to show you a more serious side of this game: in essence this is also the question: if you have some conceptual/legacy data model in mind, what would be the fastest decision tree to find out which resource type it maps to?) </p>\n<p>My off the bat starter questions: </p>\n<ol>\n<li>Does the resource type contain data for individual patients ? would be a good starter question, as it does split the number of resource types roughly in half. <br>\n1.1 If yes: Does the resource type contain clinical data for individual patients ? <br>\n1.2 If no: Is the resource type used to express conformance requirements ?</li>\n</ol>\n<p>What would your starter questions be ?</p>",
        "id": 263965888,
        "sender_full_name": "René Spronk",
        "timestamp": 1638861058
    },
    {
        "content": "<p>If it's random resource allocation, is the resource above maturity level 1. If its player's choice of resource, is it above level 2?</p>",
        "id": 263966019,
        "sender_full_name": "Jim Steel",
        "timestamp": 1638861242
    },
    {
        "content": "<p>Cheeky, but hardly useful in a educational context I'm afraid ;-)</p>",
        "id": 263966172,
        "sender_full_name": "René Spronk",
        "timestamp": 1638861377
    },
    {
        "content": "<p>what's clinical data?</p>",
        "id": 263966757,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638862074
    },
    {
        "content": "<p>does it have a canonical URL?</p>",
        "id": 263966763,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638862081
    },
    {
        "content": "<p>Interesting question - what are the general criteria as to when a resource would need to have a canonical URL? Canonical URL is a technical artefact, which expresses a certain requirement. What's the underlying requirement ? (this should allow us to rephrase your suggestion in more functional terms)</p>",
        "id": 263967450,
        "sender_full_name": "René Spronk",
        "timestamp": 1638862813
    },
    {
        "content": "<p>what is the resources \"Security Category\"</p>",
        "id": 263996954,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638882123
    },
    {
        "content": "<p>Has to be a yes or no question</p>",
        "id": 264008056,
        "sender_full_name": "David Pyke",
        "timestamp": 1638887036
    },
    {
        "content": "<p>Is it defining an 'activity' - something that can be done, is supposed to be done or something that has been done/is being done, or is it something else?</p>",
        "id": 264008359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638887155
    },
    {
        "content": "<p>And then \"is it defining something that has happened or is happening now?\"</p>",
        "id": 264008428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638887170
    },
    {
        "content": "<p>Is it an workflow event?  If no, then is it a request?</p>",
        "id": 264008930,
        "sender_full_name": "David Pyke",
        "timestamp": 1638887385
    },
    {
        "content": "<p>That's the gist, yes, but using terms that non-FHIR geeks are more likely to know.</p>",
        "id": 264009348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638887570
    },
    {
        "content": "<p>Is it an activity, an entity, a role or a participation ? <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 264016595,
        "sender_full_name": "René Spronk",
        "timestamp": 1638890947
    },
    {
        "content": "<p>Using those (HL7v3 RIM) terms, are resources that have a canonical URL always acts that exist in DEF mood only ?</p>",
        "id": 264016741,
        "sender_full_name": "René Spronk",
        "timestamp": 1638891004
    },
    {
        "content": "<p>What do all those \"resource Categories\" mean?  (the ones on the main Resources tab; i.e. Foundational, Base, Clinical, Financial, etc.?</p>",
        "id": 264054924,
        "sender_full_name": "John Silva",
        "timestamp": 1638903788
    },
    {
        "content": "<p>Not much.  A key consideration in coming up with categories is \"what will result in balance between the numbers in different categories\".  We refactor categories between releases based on that need.</p>",
        "id": 264066067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638908482
    },
    {
        "content": "<p>Does it have any required elements?</p>\n<p>Does it have any recursive elements?</p>",
        "id": 264090004,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638920060
    },
    {
        "content": "<p>User's perception of \"required\" will likely be different from FHIR's.  Technically everything in FHIR recurses (via extension)</p>",
        "id": 264091359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638920810
    },
    {
        "content": "<p>Those are still the questions I'd ask -- it's a learning game :-)</p>",
        "id": 264091741,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638921029
    },
    {
        "content": "<p>agree. the goal is not really for the interrogator to get the Resource name quickly, but rather to get the student to learn</p>",
        "id": 264093196,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638921779
    },
    {
        "content": "<p>Indeed - the above suggestions already illustrate there are multiple ways / 'dimensions' one could use to 'define sub categories' of resources. One aspect is however relevant: such questions would need to be largely release-agnostic, so 'maturity level' is not a very good bases for defining sub-categories, a resource having required elements is a shaky criterium (given that we have resources with low maturity levels). Questions will probably need to be more about functionality than about the technical artefacts that may be contained in a resources. But even then there are multiple ways to slice and dice resource categories.</p>",
        "id": 264119673,
        "sender_full_name": "René Spronk",
        "timestamp": 1638947982
    },
    {
        "content": "<p>some radical things change over releases. For example Consent was originally just about Patient Privacy Consent, then it became about any Patient Consent, then it dropped the Patient vector so to hold access rules to vHdir, then it will .....    These exceptions to the rule don't invalidate your gameshow rule about being agnostic to version.</p>",
        "id": 264143994,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638964086
    },
    {
        "content": "<p>does the resource represent a real world entity you can grab hold on to ?</p>",
        "id": 264145364,
        "sender_full_name": "René Spronk",
        "timestamp": 1638965100
    },
    {
        "content": "<p>does the resource represent some definitional artefact (defined once, non-patient specific, stored on some reference server) ?  [functional version of: 'does the resource have a canonical url?']</p>",
        "id": 264145533,
        "sender_full_name": "René Spronk",
        "timestamp": 1638965216
    },
    {
        "content": "<p>does the resource point at other resources, or is the resource the target of other resources.  (mostly)</p>",
        "id": 264146399,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638965873
    },
    {
        "content": "<p>I think <em>every</em> resource points at other resources, so that doesn't really discriminate...</p>",
        "id": 264160027,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638972695
    },
    {
        "content": "<p>But then again, Patient is mostly referred to, whereas Provenance is rarely referred to. But this calls for a level of FHIR knowledge that attendees on a beginners course are unlikely to have.</p>",
        "id": 264163605,
        "sender_full_name": "René Spronk",
        "timestamp": 1638974299
    }
]