[
    {
        "content": "<p>From <a href=\"https://view.connect.hhs.gov/?qs=a809f7f86fff06c729916a9bd62564ff9f9d278585b501b37e489f7d8b6d6302e229fa5890902e21e602ba063d07d14dd343a332ab6ca288814d9348642e8e91542a3d9f6628ff6a\">a follow-up email</a> from today's ONC webinar:</p>\n<blockquote>\n<p>Today, ONC announced a new initiative, Project US@, to launch at the start of 2021. ONC has agreed to develop a unified specification for address in health care.</p>\n</blockquote>\n<p>It links to <span class=\"user-mention\" data-user-id=\"197115\">@Steve Posnack</span>'s companion blog post <a href=\"https://www.healthit.gov/buzz-blog/health-it/say-hey-to-project-us-a-unified-specification-for-address-in-health-care\">Say “Hey!” to Project US@ – a Unified Specification for Address in Health Care</a></p>\n<p>Of particular interest to some will be Steve's discussion of why this is necessary:</p>\n<blockquote>\n<p>Among the many standards stewarded by HL7, NCPDP, and X12 there are fields for address, but the approach to represent it are typically left to the implementer to decide. Without specific constraints to rely on, implementers use a variety of free and commercial third party tools, resources, and methods to help normalize address representations. The United States Postal Service (USPS) Publication 28 is often a starting point for this kind of normalization, but <a href=\"https://www.federalregister.gov/d/2020-07419/p-474\">as we discussed in ONC’s Cures Act Final Rule</a> it has its limits.</p>\n</blockquote>\n<p>That discussion (in the big green box <em>near</em> that URL) is worth reading.</p>",
        "id": 218508912,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606876514
    },
    {
        "content": "<p>According to HQ, HL7 is providing the project management of the project.  Converting USPS Pub 28 to an actual standard using multiple SDOs will be an interesting experience.  Pub 28 is all soft language with few real constraints.  I know that there are upcoming systems that will require Pub 28 formatted addresses but getting the HIT industry to format all info for exchange will be difficult</p>",
        "id": 218542498,
        "sender_full_name": "David Pyke",
        "timestamp": 1606907612
    },
    {
        "content": "<p>This mapping of USPS Pub 28 to NIEM seems is done. It is not pretty, but they have defined things like codes for street type <a href=\"http://www.datypic.com/sc/niem20/t-addr_StreetNameType_type.html\">http://www.datypic.com/sc/niem20/t-addr_StreetNameType_type.html</a><br>\nWe should learn from that, and leverage anything we can... Standards should always look to other standards.   We should easily be able to leverage their vocabulary (<span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ) right?</p>",
        "id": 218553862,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606915035
    },
    {
        "content": "<p>That's a good start, but it's also structural standards for the address.  E.g.,  for 100 main street, suite 101 is it used that way, is suite on a separate line, is it 101-100 main street?</p>",
        "id": 218554053,
        "sender_full_name": "David Pyke",
        "timestamp": 1606915124
    },
    {
        "content": "<p>IF the last one, if the address is 100-102 main street (using two land plots), how do we handle suite 200?</p>",
        "id": 218554126,
        "sender_full_name": "David Pyke",
        "timestamp": 1606915171
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> did you navigate up from what I pointed at? The address specification in NIEM is huge, only a subset has been aligned with USPS. Had I pointed at the higher link, the USPS stuff might not have been obvious.      That said, I know nothing of this work.. only that I encourage standards to be aware of standards... and NIEM is an important standard in USA government circles.</p>",
        "id": 218555757,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606915980
    },
    {
        "content": "<p>Even for the address type part, there is a street around here that was originally (new development) both a \"Pass\" and a \"Road\". I think that broke something  (the NIEM standard allows for only one type), as the \"Road\" part was subsequently dropped...</p>",
        "id": 218557103,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1606916627
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Yes, I'm sure we can use their vocabulary - and hopefully that's \"easily\".  Since it's an external terminology, the first step should be having HTA try to engage with them - to determine the canonical url and metadata, and then where and how the content will be hosted. <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span></p>",
        "id": 218558899,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1606917514
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192587\">David Pyke</span> <a href=\"#narrow/stream/179160-social/topic/.22Project.20US.40.22.20to.20standardize.20.20physical.20addresses/near/218542498\">said</a>:</p>\n<blockquote>\n<p>According to HQ, HL7 is providing the project management of the project....</p>\n</blockquote>\n<p>Does anyone know who at HL7 is managing this project? HTA is happy to reach out to them to begin the process to register the external terminology.<br>\n<span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span></p>",
        "id": 218563350,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1606919433
    },
    {
        "content": "<p>Lindsey Hoggle (<a href=\"mailto:lindsey@hl7.org\">lindsey@hl7.org</a>)</p>",
        "id": 218563521,
        "sender_full_name": "David Pyke",
        "timestamp": 1606919496
    },
    {
        "content": "<p>However, no meetings or discussions have started so it's early to discuss vocab registrations</p>",
        "id": 218563629,
        "sender_full_name": "David Pyke",
        "timestamp": 1606919534
    },
    {
        "content": "<p>THe project was only announced yesterday</p>",
        "id": 218563649,
        "sender_full_name": "David Pyke",
        "timestamp": 1606919548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> It's never to early to think about vocabulary in projects....usually it's left till too late!</p>",
        "id": 218578567,
        "sender_full_name": "Julie James",
        "timestamp": 1606925418
    },
    {
        "content": "<p>Your absolutely right. But maybe we should have a project charter first?</p>",
        "id": 218578631,
        "sender_full_name": "David Pyke",
        "timestamp": 1606925444
    }
]