[
    {
        "content": "<p>Hi there,<br>\nWhat FHIR (and CDS hooks) seem to have mainly in mind are apps that present or interpret clinical data instantly. So you can get your FHIR input, execute rules and return recommendations, but at least regarding medications, FHIR is pretty read-only. <br>\nBut what if my app shows a UI that enables the clinician to make decisions about medications? For example, it can show several possible ways of modifying medications, replacing an existing one for a new one, etc, and let the doctor decide. The problem of course is that I don't what the clinician to retype or copy-paste those changes to medication order tab in the EMR - instead, I'd like a way to create orders  / discontinue medications in the EMR from my app. The clinician will still need to sign them of course, but at least he doesn't need to retype them.<br>\nIs there any standard way of doing that? Or less standard that will work in Cerner / Epic? Suggestions in CDS cards are a synchronous response to a trigger, not app-initiated...<br>\nThanks in advance!</p>",
        "id": 187911479,
        "sender_full_name": "Peter L.",
        "timestamp": 1581428274
    },
    {
        "content": "<p>This should probably be in <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a></p>",
        "id": 187921398,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1581434734
    },
    {
        "content": "<p>Although I do like the idea of medications as a social endeavour</p>",
        "id": 187921455,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1581434765
    },
    {
        "content": "<p>Your use case sounds like FHIR messaging to me</p>",
        "id": 187921496,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1581434812
    },
    {
        "content": "<p>FHIR itself is <em>not</em> read-only. It's just the Argonaut take on it that is focused on read-only</p>",
        "id": 187947143,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1581450552
    },
    {
        "content": "<p>I'd frame it as Argonaut prioritizes read-only in a phased approach that gradually introduces write (on the grounds that read-only is easier and writing some resources is easier than others)</p>",
        "id": 187947637,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581450809
    },
    {
        "content": "<p>You can write MedicationStatement back to Cerner: <a href=\"https://fhir.cerner.com/millennium/dstu2/medications/medication-statement/#create\" target=\"_blank\" title=\"https://fhir.cerner.com/millennium/dstu2/medications/medication-statement/#create\">https://fhir.cerner.com/millennium/dstu2/medications/medication-statement/#create</a></p>",
        "id": 187947909,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1581450933
    },
    {
        "content": "<p>TL;DR - there may be a CDS Hooks &amp; SMART Web Messaging solution worth discussing over in #smart or #cds-hooks</p>\n<p>I think the CDS hooks + SMART Web Messaging approach to this problem has potential.  One way it could play out is: the doctor opens a patient chart and a <code>patient-view</code> hook notifies a service which determines that the patient's med list could be optimized.  That service returns a 'card' to the EHR which is shown to the doctor.  The card could provide a smart app link that launches a SMART app capable of guiding the provider through changes to a medication list.  The app could take advantage of SMART Web Messaging to manipulate a draft order set in the EHR system - so when the app is closed, it's simply up to the doctor to review and sign the order.</p>",
        "id": 187960657,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1581458459
    }
]