[
    {
        "content": "<p>[thread]<br>\nThis week Adobe co-founder Chuck Geschke died of cancer at 81.  I have some thoughts to share, as one of the people in graphic arts who got run over by the Adobe steamroller when desktop publishing let consumers create their OWN job data. It brings to mind this quote from super-visionary Stewart Brand -<br>\n<a href=\"user_uploads/10155/aymHiXFzxFO6gOHboBMi39dn/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/10155/aymHiXFzxFO6gOHboBMi39dn/image.png\" title=\"image.png\"><img src=\"user_uploads/10155/aymHiXFzxFO6gOHboBMi39dn/image.png\"></a></div>",
        "id": 236977051,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1619882711
    },
    {
        "content": "<p>Corollary:  (or maybe just related, along a different axis?)</p>\n<p><a href=\"/user_uploads/10155/g3A7WM-TTZrk3auSEwev88xh/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/g3A7WM-TTZrk3auSEwev88xh/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/g3A7WM-TTZrk3auSEwev88xh/image.png\"></a></div>",
        "id": 236977190,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1619882837
    },
    {
        "content": "<p>Here's what I posted on Facebook about it - it's just a passing thought, but I very much believe this is what's beginning as FHIR rolls out:</p>\n<hr>\n<p>It's a stretch for this obit to call Geschke <em>the</em> father of DTP, but there's no doubt that Adobe's stuff helped change the world of graphic arts, then also radically change information sharing in general.<br>\n<a href=\"user_uploads/10155/04JN2WJoHhG5OF7T7b_5o9jP/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/10155/04JN2WJoHhG5OF7T7b_5o9jP/image.png\" title=\"image.png\"><img src=\"user_uploads/10155/04JN2WJoHhG5OF7T7b_5o9jP/image.png\"></a></div>",
        "id": 236977803,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1619883402
    },
    {
        "content": "<p>I want to talk about the parallels between the advent of desktop publishing (DTP) and the advent of FHIR for health data. </p>\n<p>DTP thoroughly disrupted the graphic arts business, causing some major players to <em>disappear</em> in less than a decade. The major shift in power was caused by putting job data in the hands of the consumer. This is exactly what we hope will happen when we put consumers' <em>health</em> data in their hands, using FHIR-powered apps.</p>\n<p>With DTP, when that data shift happened, old power structures became irrelevant, and the industry expanded and evolved around the consumer's needs. Many new companies sprang up, \"feeding from\" the new ecosystem, while others stuck in the old ecosystem died.</p>\n<p>That revolution required multiple transforming innovations:</p>\n<ul>\n<li>the Mac (a GUI at a mass market price, with fonts)</li>\n<li>PageMaker - the first desktop publishing app</li>\n<li>Laser printers (from Canon)</li>\n<li>the PostScript print language</li>\n<li>Digitized fonts<br>\n<a href=\"user_uploads/10155/CbEY2kMJjjT7Swgw4Yg9rVWu/image.png\">image.png</a><div class=\"message_inline_image\"><a href=\"user_uploads/10155/CbEY2kMJjjT7Swgw4Yg9rVWu/image.png\" title=\"image.png\"><img src=\"user_uploads/10155/CbEY2kMJjjT7Swgw4Yg9rVWu/image.png\"></a></div></li>\n</ul>\n<p>Today it's hard to imagine so many game-changing technologies arriving all at once - and it was hard to imagine back then. And just as Christensen classically predicts, we incumbents back then not only couldn't believe it possible, we couldn't believe it was <em>happening when we saw it</em>, much less respond successfully.</p>\n<p>I very much believe FHIR is the sort of \"new technology\" both quotes refer to.  We can't tell today how the world of health tools will look in ten years, but I'm rubbing my hands in happy anticipation.</p>",
        "id": 236978023,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1619883622
    },
    {
        "content": "<p>Bonus question: as the obituary says, the predominant, remaining, universal impact of Adobe's rise was the PDF (Portable Document Format).  Who in healthcare will evolve a comparable format for health data?</p>\n<p>I'm not talking about a PDF dump of your health data.  I'm talking about a data format that can be generated by anyone and consumed by any tool that wants to.</p>",
        "id": 236978387,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1619883976
    },
    {
        "content": "<p>I remember back in those days it was the 'battle' between HP's PCL and PDF, at least for a 'common printer language'.   Of course PDF had more of a footprint that 'just the printer' though I used tools in those days that also rendered PCL to a GUI!  Typically document authoring pipeline of text editting troff (or Framemaker or similar), sending through intermediate pre-preprocessors, then to a PDF (Printer Description Language) post-processor to send to a target printer.   Back in 'the day' though there were many more affordable HP printers than printers that supported PDF and even today, I believe PDF never really made it \"into the printers\", but of course, it has a much wider reach as an online presentation format.</p>\n<p>I guess this brings up a related point -- is it FHIR or OpenEHR that might 'win' the battle for the medical data representation and API processing format?    Both are 'open source' (unlike the company-owned PCL and PDF) so that's different.   Are there comparisons between these and PCL/PDF -- i.e. is one 'cheaper/easier to implement' vs 'being a better/purer model' or other factors that contribute to market acceptance (i.e. getting over the 'trough of disillusionment' chasm to 'mass acceptance')?</p>",
        "id": 237156361,
        "sender_full_name": "John Silva",
        "timestamp": 1620046668
    },
    {
        "content": "<p>I don't know that PDF was ever a printer language - it was designed to be a format for self-contained documents that would display identically (um, pretty much?) on all different platforms.  A generation later it certainly has become that, but in the beginning it was often thought of as a sort of \"PostScript in a file,\" which was catastrophically less efficient than PCL.  </p>\n<p>OTOH, PCL was purely a print language, not a file format.</p>\n<p>Could FHIR be considered a \"file format\" or document format, as PDF is??</p>",
        "id": 237247121,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1620085070
    },
    {
        "content": "<p>could be, yes, and things like International Patient Summary treat it as such</p>",
        "id": 237247270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620085169
    },
    {
        "content": "<p>PDF (Portable Document Format) was never a printer spec, it's really just a decent archival document format that uses Postscript (the printer language) for encoding.  And PS was excellent, if you had a $50,000 postscript rendering printer.  On home systems?  I was horribly slow. I had a PS laser printer in the good old days and it took a minute a page.  PCL took 10 seconds (but the PS rendered nicer with fewer artifacts). </p>\n<p>JSON and XML are the file formats, and those are just text formats like any other.</p>",
        "id": 237377023,
        "sender_full_name": "David Pyke",
        "timestamp": 1620153391
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"298707\">John Silva</span> <a href=\"#narrow/stream/179160-social/topic/Adobe's.20Geschke.20and.20the.20transfer.20of.20power/near/237156361\">said</a>:</p>\n<blockquote>\n<p>I guess this brings up a related point -- is it FHIR or OpenEHR that might 'win' the battle for the medical data representation and API processing format?    Both are 'open source' (unlike the company-owned PCL and PDF) so that's different.   Are there comparisons between these and PCL/PDF -- i.e. is one 'cheaper/easier to implement' vs 'being a better/purer model' or other factors that contribute to market acceptance (i.e. getting over the 'trough of disillusionment' chasm to 'mass acceptance')?</p>\n</blockquote>\n<p>Non-tech patient clueless question:</p>\n<p>Help me out here - FHIR and OpenEHR are different beasts, aren't they?  Not even different species.  OpenEHR is a way of storing data, and FHIR can contain and convey data, but is it in any way comparable to an EHR??</p>",
        "id": 241531755,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1622811897
    },
    {
        "content": "<p>Yes, they are different beasts exactly as you say. FHIR can be used to store data, but it is designed / intended as a way to transfer data between system that uses whatever different underlying architecture (including OpenEHR)</p>",
        "id": 241534381,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1622813242
    }
]