[
    {
        "content": "<p>I've just attended a virtual birthday party using <a href=\"https://www.airmeet.com/\">AirMeet</a>. It was an astounding experience, with \"tables\" (small \"breakout rooms\"), \"lounges,\" as well as presentations. Anyone else used it?? </p>\n<p>At first blush I'd say it's an order of magnitude more like the live DevDays experience than anything I've seen, including serendipitous \"bumping into\" people unexpectedly.</p>",
        "id": 227022398,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1613765963
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> i just looked into it a little, and not sure we could use it for a meeting (some initial things, only 16 speakers are allowed for an event, no integrations yet), but certainly something that could used at an event for social interactions.  I will have to get a demo from them to investigate more.</p>",
        "id": 227030208,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1613769588
    },
    {
        "content": "<p>I'm impressed (but not surprised) that you noticed so quickly!</p>",
        "id": 227030554,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1613769751
    },
    {
        "content": "<p>16 speakers will surely limit their market massively</p>",
        "id": 227030586,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1613769771
    },
    {
        "content": "<p>We've talked a bit about <a href=\"https://gather.town\">https://gather.town</a> for similar purposes; we used it in the SMART track at the last connectathon to pretty good effect. <span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span> and I have talked about how this sort of functionality could help folks self-organize and capture a bit more of the spirit from in-person events.</p>",
        "id": 227030706,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1613769843
    }
]