[
    {
        "content": "<p>SOMEbody here has to be from that era, or at least recognize the term from beer session storytelling. :-) </p>\n<p>I just remembered that <a href=\"http://patientdave.blogspot.com/2008/10/best-care-anywhere-part-4-hard-hats.html#comment-form\" title=\"http://patientdave.blogspot.com/2008/10/best-care-anywhere-part-4-hard-hats.html#comment-form\">I blogged about them</a> on my first blog, in 2008 (long before I got into advocacy), after reading &lt;i&gt;Best Care Anywhere&lt;/a&gt;.  Excerpt:</p>\n<blockquote>\n<p>But for years, way under the radar, operating in basements (literally) and often going directly against orders from upstairs, a loose federation of geeks and medicos were hand-coding computer systems, largely out of self-defense - they were desperate to find ways to handle their impossible workload. They wrote programs that automated admissions and discharge, handled prescriptions electronically, maintained patient records to sniff out potential problems.</p>\n<p>They wrote it all in open source: nobody owned the code, and anyone could check it for accuracy or contribute improvements. </p>\n<p>Unlike today's sickening morass of systems that won't talk to each other, these people wrote programs specifically with the intent that the data should be shareable. Most important, since the programs were written solely to help the users (e.g. pharmacists), the only features that got programmed were ones that the users wanted, and the features worked the way the users wanted.</p>\n</blockquote>",
        "id": 192689341,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585843712
    },
    {
        "content": "<p>Oh yes, I definitely remember the Hard Hats/Vista group.</p>",
        "id": 192695036,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585846246
    },
    {
        "content": "<p>Where are we now, when we need them?  Imagine overstressed ER docs etc using FHIR to cobble together task-focused modules that get things done efficiently - no more death of a thousand clicks</p>",
        "id": 192695882,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585846598
    },
    {
        "content": "<p>VistA is being changed over to Cerner as all the Hard Hats have retired or moved on.</p>",
        "id": 192698029,
        "sender_full_name": "David Pyke",
        "timestamp": 1585847654
    },
    {
        "content": "<p>Yep.  I was just thinking of those rebels who needed to get stuff done and created their own tools.</p>",
        "id": 192712014,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585854724
    },
    {
        "content": "<p>well, they are being forced out. Vista is (was) a vibrant open-source project. Used by more than just the VA... but, powers-that-be have forced things to happen</p>",
        "id": 192719927,
        "sender_full_name": "John Moehrke",
        "timestamp": 1585858471
    },
    {
        "content": "<p>Understood.  I'm not literally suggesting perpetuating MUMPS etc - I'm thinking of the spirit of things, with all the pressures on docs...</p>",
        "id": 192721422,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585859194
    }
]