[
    {
        "content": "<p>Hi,<br>\ndoes anyone know the details or where to find the details of how the authentication flow for Apple Health works?<br>\nI mean, I know it's technically SMART, OAUTH etc. but I wonder how this works from a Patient's POV.<br>\nDo they get credentials from the hospital, or do they sign in with their Apple account?<br>\nHow does the linkage of the account-ID and the Patient-ID in the hospital work?<br>\nHow does the App know the correct Patient-ID for the launch scope?</p>",
        "id": 153946177,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521461981
    },
    {
        "content": "<p>They typically sign in with the same credentials they would sign in to their portal with, though that could vary by site (none that I know of use the Apple id). That portal account has already been linked to their record in the provider(s) systems.</p>",
        "id": 153946199,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1521473429
    },
    {
        "content": "<p>They use the Sync for Science and SMART-on-FHIR  see my writeup (and improvement opportunity for them) <a href=\"https://healthcaresecprivacy.blogspot.com/2018/02/apple-should-have-heart.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2018/02/apple-should-have-heart.html\">https://healthcaresecprivacy.blogspot.com/2018/02/apple-should-have-heart.html</a></p>",
        "id": 153946207,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521476307
    },
    {
        "content": "<p>Note that the only thing used that is \"different\"/some aren't familiar with is the offline_access scope, most people are familiar with the S4S workflow that may have raised it, but I believe it's part of the normal SMART standard (online vs offline access) now.</p>",
        "id": 153946213,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1521476861
    },
    {
        "content": "<p>Jenny and John, thank you so much for this information! I'm currently reading up on HEART.<br>\nWhat makes me still wonder: Isn't the fact that someone might mistype the patient's eMail-adress into the system a big danger?<br>\nWhat if the eMail arrives in someone completely different's inbox (like <a href=\"mailto:some.body@somewhere.com\" title=\"mailto:some.body@somewhere.com\">some.body@somewhere.com</a> instead of <a href=\"mailto:some-body@somewhere.com\" title=\"mailto:some-body@somewhere.com\">some-body@somewhere.com</a>?)<br>\nCouldn't the person accidentially receiving the eMail with the one-time password create an account, consent to everything and read up on someone else's health data? I guess they could ask for additional information such as birthdate (not much else comes to mind) upon registration...<br>\n I absolutely agree that linkage is the most painful aspect of this...</p>",
        "id": 153946264,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521489948
    },
    {
        "content": "<p>where in the process are you seeing a reliance on an email address?</p>",
        "id": 153946268,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521490925
    },
    {
        "content": "<p>The identity proofing step is usually done today using a piece of paper postal mail. For which in the USA there are severe and clear penalties involved in stealing or even opening mail that is not addressed to you. This is essential legal fact that providers rely upon. Inside that piece of paper mail is a secret code.  When that patient goes to the provider's portal, they use that secret code. Their use of that secret code is what gives high assurance of identity proofing, thus binding that login account to that Patient identity. If the user is malicious, not really the patient, and is logged into their own account; THEN the Federal penalties around postal fraud apply...</p>",
        "id": 153946269,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521491312
    },
    {
        "content": "<p>Sorry, my bad. I missed the word \"postal\" in this sentence,:\"The Healthcare Providers usually mange the Identifiers by sending their known patients a postal mail letter with a username and a one-time-secret.\"</p>",
        "id": 153946270,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521491384
    },
    {
        "content": "<p>I'm going to take over Lloyds role and suggest that this should move to the implementers stream...</p>",
        "id": 153946292,
        "sender_full_name": "David Hay",
        "timestamp": 1521500417
    },
    {
        "content": "<p>I was actually thinking of posting in the SMART stream, but it's <em>very</em> quiet there...</p>",
        "id": 153946388,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521538766
    },
    {
        "content": "<p>wake it up</p>",
        "id": 153946391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521539146
    },
    {
        "content": "<p>or there's an argonaut stream</p>",
        "id": 153946392,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521539154
    },
    {
        "content": "<p>I'd say. Drop it into SMART, however I have to admit I have no idea how to do that...</p>",
        "id": 153946409,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1521541534
    },
    {
        "content": "<p>Start a new thread there and post a link to the thread here :)</p>",
        "id": 153946507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521557254
    },
    {
        "content": "<p>it is not a specifically argonaut thing... I would rather it be a thread in the normal implementers stream.</p>",
        "id": 153946545,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521558665
    },
    {
        "content": "<p>So it’s not HEART? Are Apple planning to go that way? <br>\nIs their anyway of booking marking a topic. I want to watch this thread.</p>",
        "id": 153946639,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1521571914
    },
    {
        "content": "<p>i haven't heard of any actual health vendor considering heart. Let me know if I'm wrong...</p>",
        "id": 153946650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521573041
    },
    {
        "content": "<p>the coming rewrite of heart might move the needle</p>",
        "id": 153946651,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521573052
    },
    {
        "content": "<p>there are many reasons holding back HEART... all of them non-technical... aka policy, trust, ease, etc...</p>",
        "id": 153946665,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521574986
    },
    {
        "content": "<p>The Apple Health app integration is not using HEART. The Apple Health app is acting as a SMART app and using the Argonaut FHIR profiles.</p>",
        "id": 153946742,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1521596197
    },
    {
        "content": "<p>Exactly.</p>",
        "id": 153946759,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1521603087
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194909\">@Kevin Mayfield</span> : \"Is their anyway of booking marking a topic\" - yes, you can star a message</p>",
        "id": 153946764,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521604984
    },
    {
        "content": "<p>So I jumped a stage or two, assuming Apple could act as the Patients authorisation service.  The scenario I was looking at is a national 'OAuth2 OpenID' accessing FHIR servers, this seems to be saying UMA rather than SMART (extranet rather than intranet?).</p>",
        "id": 153946782,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1521610411
    },
    {
        "content": "<p>Seems to be a direction of travel rather than a current requirement.</p>",
        "id": 153946783,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1521610480
    },
    {
        "content": "<p>over the horizon at best. if not further away</p>",
        "id": 153946787,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521611224
    },
    {
        "content": "<p>(on the next planet?)</p>",
        "id": 153946788,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521611232
    },
    {
        "content": "<p>Next galaxy would be consent discussions... aka committees, lasting for several months trying to work out how to get patient consent (without asking the patient - except on paper forms in an office far far away...)</p>",
        "id": 153946789,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1521611364
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> is that commentary on the maturity of UMA (and HEART). I do believe it would be better to start OAuth2 from the bottom up rather than top down.  More practical and gains collective experience.</p>",
        "id": 153946790,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1521612338
    },
    {
        "content": "<p>more a comment on the maturity of the overall industry here. Most people think there's a problem here, but no agreement on what it is, what the scope of a solution should be, what success looks like</p>",
        "id": 153946791,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521613030
    },
    {
        "content": "<p>There is also mismatched motivations... those with the power/money to architect systems have different motivations driving those designs. The patients have very little leverage to drive for a nationwide consent concept where they benefit from having just on place to manage their consent rules. Hence why I proposed that Apple is a likely contender to flip this as they represent the consumers more than they represent the legacy healthcare parties......    BUT, I have never intended for people to believe that Apple is or wants to take on this role. I have tried to be very clear that Apple is doing just like other apps and leveraging SMART and SyncForScience...</p>",
        "id": 153946879,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521648571
    },
    {
        "content": "<p>Sweden has some laws on nation-wide consent (privacy) laws and hospitals have to comply (not sure if all the hospitals are government owned or if there are private ones too?)   <a href=\"https://content.next.westlaw.com/Document/I43e1d2bc1c9a11e38578f7ccc38dcbee/View/FullText.html?contextData=(sc.Default)&amp;transitionType=Default&amp;firstPage=true&amp;bhcp=1\" target=\"_blank\" title=\"https://content.next.westlaw.com/Document/I43e1d2bc1c9a11e38578f7ccc38dcbee/View/FullText.html?contextData=(sc.Default)&amp;transitionType=Default&amp;firstPage=true&amp;bhcp=1\">https://content.next.westlaw.com/Document/I43e1d2bc1c9a11e38578f7ccc38dcbee/View/FullText.html?contextData=(sc.Default)&amp;transitionType=Default&amp;firstPage=true&amp;bhcp=1</a></p>",
        "id": 153948470,
        "sender_full_name": "John Silva",
        "timestamp": 1522173996
    }
]