[
    {
        "content": "<p>I created a channel for discussions about \"blockchain\" for those of you who are interested</p>",
        "id": 153877425,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489662790
    },
    {
        "content": "<p>Is anyone in this community planning to attend the Healthcare Summit in DC next week?</p>",
        "id": 153877451,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489667216
    },
    {
        "content": "<p><code>sorry, full name of DC Conference mentioned above is \"The Healthcare Blockchain Summit.\"  FWIW, I for one continue to be a bit puzzeled by how/why the hoards of folks talking about the convergence of blockchain methods seen generally unaware of indifferent to FHIR (and vice-versa).</code>anyone care to comment?</p>",
        "id": 153877456,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489668275
    },
    {
        "content": "<p><code>sorry, full name of DC Conference mentioned above is \"The Healthcare Blockchain Summit.\"  FWIW, I for one continue to be a bit puzzeled by how/why the hoards of folks talking about the convergence of blockchain methods seen generally unaware of indifferent to FHIR (and vice-versa).</code>anyone care to comment?</p>",
        "id": 153877461,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489668791
    },
    {
        "content": "<p>Sorry, full name of DC Conference mentioned above is \"The Healthcare Blockchain Summit.\"  FWIW, I for one continue to be a bit puzzled by how/why the hoards of folks talking about the convergence of blockchain methods with EHRs seem generally unaware of or indifferent to FHIR (and vice-versa).  `anyone care to comment?</p>",
        "id": 153877496,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489679889
    },
    {
        "content": "<p>Doug, the Kantara work that I mentioned does recognize FHIR. There is membership overlap beyond myself. The general response would be that the intersection between the actual health information vs the blockchain technology is a fuzzy boundary today. One view says that FHIR is like any other URI from a Blockchain perspective, it fits nicely into Merkel tree just fine. Another view is that the Blockchain people are only describing the data in abstract terms, as they expect healthcare people to pick a concrete encoding.</p>",
        "id": 153877501,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489681081
    },
    {
        "content": "<p>So for example: If healthcare comes up with useful use of Smart-Contracts; it would be up to healthcare to work out how they use the Smart-Contract language to convey some meaning (healthcare vocabulary) with some specific data (healthcare data-model -- e.g. FHIR)</p>",
        "id": 153877503,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489681539
    },
    {
        "content": "<p>Thanks John.  We are following Kantara's approach to UMA closely.  However, we're also exploring an even more patient-driven scenario of fine-grained and conditioned permissions deposited in a permissioned (confusingly different connotation) blockchain.  I'm now working on a Draft White Paper of this \"FHIRBlocks\" (respecting, of course, FHIR as an HL7-registered trademark) architecture.  `eager to get it front of this community for reactions...</p>",
        "id": 153877504,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489681649
    },
    {
        "content": "<p>I was referring to the Blockchain-SmartContracts workgroup within Kantara. <a href=\"http://kantarainitiative.org/confluence/display/BSC/Home\" target=\"_blank\" title=\"http://kantarainitiative.org/confluence/display/BSC/Home\">http://kantarainitiative.org/confluence/display/BSC/Home</a>  There is quite a bit of overlap in membership</p>",
        "id": 153877505,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489681797
    },
    {
        "content": "<p>Got it! I need to check this out with my CTO. Thanks again</p>",
        "id": 153877506,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489681874
    },
    {
        "content": "<p>all we need is one more standard...</p>",
        "id": 153877507,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489682072
    },
    {
        "content": "<p>There's a widely-circulated cartoon to this point floating around the net;-)</p>",
        "id": 153877508,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489682164
    },
    {
        "content": "<p>of course... I expected it to float into your mind by that simple text.</p>",
        "id": 153877510,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489682288
    },
    {
        "content": "<p>Mission accomplished;-)</p>",
        "id": 153877511,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489682852
    },
    {
        "content": "<p><a href=\"https://xkcd.com/927/\" target=\"_blank\" title=\"https://xkcd.com/927/\">https://xkcd.com/927/</a></p>",
        "id": 153877530,
        "sender_full_name": "David Hay",
        "timestamp": 1489694078
    },
    {
        "content": "<p>I'm rather new at this chat setup so I apologize if I'm \"doing it wrong\". Regarding Blockchains - I have long thought that the blockchain layout would be ideally suited for certain Healthcare transactions. Mostly for security, redundancy, and potentially less overhead to run. How do you switch to a Blockchain \"channel\"? Is that just done by filtering conversation? Thanks</p>",
        "id": 153877541,
        "sender_full_name": "Rob Clements",
        "timestamp": 1489698535
    },
    {
        "content": "<p>I'm not sure that I completely understand the question re: \"switching blockchain channels.\" (And, inasmuch as I'm even newer to this board than you, I'm not sure about the proper etiquette and protocol).  That said, perhaps this will help: blockchain sub-categories of possible relevance here are \"off-chain\" and \"side chain\" arrangements. Permissioned off-chain pointers (to Resources held in their native EHR's) can simply omit certain API calls--e.g. to de-identify a patient from relevant PHI.  Similarly, there will be multiple blockchains--focusing upon different families of app's perhaps (e.g., claims processing, Pharma, IoT, etc); and they can be interlocked via smart contracts (\"channel switching\" by a different name?).</p>",
        "id": 153877545,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489699575
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194675\">@Doug Bulleit</span> .. I believe that <span class=\"user-mention\" data-user-id=\"193578\">@Rob Clements</span> was referring to <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s comment: \"I created a channel for discussions about \"blockchain\" for those of you who are interested\".. but unfortunately, I'm reluctant to answer because I'm not really the best guy to be providing Zulip tech support either ;-)</p>",
        "id": 153877551,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1489702382
    },
    {
        "content": "<p>Ohhh, in that case, as Emily Litella might say, \"Never mind.\";-)</p>",
        "id": 153877553,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489702527
    },
    {
        "content": "<p>conversations should be redirected to here: <a href=\"https://chat.fhir.org/#narrow/stream/blockchain\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/blockchain\">https://chat.fhir.org/#narrow/stream/blockchain</a></p>",
        "id": 153877565,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489706856
    },
    {
        "content": "<p>sorry for the faus pas; I'm brand new to this community and haven't sorted its structure and etiquette. Please feel free to coach us newbies on how best to use this tool</p>",
        "id": 153877583,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489711045
    },
    {
        "content": "<p>no problems. everyone was a newbie once</p>",
        "id": 153877587,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489713585
    },
    {
        "content": "<p>And those who aren't newbies still post things in the wrong channel from time to time :)  </p>",
        "id": 153877596,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489715604
    }
]