[
    {
        "content": "<p>FYI I'm doing a series of three blog posts to the public about DevDays.  A 7-part precursor series ended last Friday with <a href=\"https://tincture.io/does-fhir-provide-what-google-health-tried-to-36caa5913d5b\" target=\"_blank\" title=\"https://tincture.io/does-fhir-provide-what-google-health-tried-to-36caa5913d5b\">Does FHIR provide what Google Health tried to?</a> This week's:</p>\n<ul>\n<li>Wednesday: <a href=\"https://tincture.io/yes-it-does-look-like-fhir-will-enable-gimme-my-data-3163afa94409\" target=\"_blank\" title=\"https://tincture.io/yes-it-does-look-like-fhir-will-enable-gimme-my-data-3163afa94409\">Yes, it DOES look like FHIR will enable Gimme My Data</a></li>\n<li>Today: <a href=\"https://tincture.io/the-openaps-gospel-dana-lewis-sets-devdays-on-fhir-262d509f0702\" target=\"_blank\" title=\"https://tincture.io/the-openaps-gospel-dana-lewis-sets-devdays-on-fhir-262d509f0702\">The #OpenAPS gospel: Dana Lewis sets DevDays on #FHIR</a></li>\n</ul>\n<p>The plan had been to publish one post daily but it was delayed because of questions that led Tuesday to the proposal Grahame mentioned in his closing keynote, to create a patient-centric workgroup within HL7.</p>",
        "id": 168168839,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560543882
    },
    {
        "content": "<p>If you see any other posts or news coverage, post 'em here!</p>",
        "id": 168169024,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560544019
    },
    {
        "content": "<hr>\n<p>The topic for the third was provided today in  a tweet from my Seattle friend Sherry Reynolds, former employee at many interesting places from Microsoft to Group Health Cooperative (the very first medical practice with a patient portal, I think) to ONC. She visited us both Tuesday evening and for Wednesday's \"patient pop-up.\" </p>\n<p>Today she tweeted:</p>\n<blockquote>\n<p>People still have a tech and doctor centered view of healthcare <br>\nif they think the goal of #interoperability is to connect an app to an EHR</p>\n</blockquote>\n<p>It certainly is important to move data from place to place and from EHR to app, but the ultimate benefit will accrue to the ultimate <strong>stakeholder</strong> - the one with the most \"at stake\" in healthcare. The Mike Morris, the Kristina &amp; Kate Sheridan, the Greg Simon, the Dana Lewis. The people for whom healthcare exists.</p>",
        "id": 168170683,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560545437
    }
]