[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"202825\">@Vibin_chander</span> asked \" Curious to know canadian healthcare also focuses on FHIR?\"</p>",
        "id": 210393719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600351254
    },
    {
        "content": "<p>My response is that there's growing interest - and activity - related to FHIR in the country.  However, we're several years behind the U.S. in terms of rate of implementation.  The environment is also different in terms of how much is driven by regulation vs. ministerial decision</p>",
        "id": 210393914,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600351331
    },
    {
        "content": "<p>I think this is true for most of the countries, and even in India specifications like FHIR &amp; SMART are way out in terms of implementation. Few big enterprises like SAP do provide health care solution but its too costly that can only be implemented by large hospitals and if we talk about small hospital and clinics they usually ask local Service providers to build Health Care solutions which really lacks in terms of these specifications due to less technical expertise.</p>",
        "id": 210395126,
        "sender_full_name": "Shreyansh Mehta",
        "timestamp": 1600351852
    },
    {
        "content": "<p>One of the challenges in Canada is that we spent a couple of billion dollars investing in v3 messaging solutions only a few years before FHIR came out - so there wasn't a whole lot of energy or enthusiasm about moving to something new.  However, as the limits of v3 messaging and the benefits of FHIR have become clear over time, interest has increased.</p>",
        "id": 210398474,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600353258
    },
    {
        "content": "<p>Yes even in India few startups are emerging who are actively working with these specifications. But the actual problem is hospital and clinic are the decision-makers here. Even if someone builds EHR for all the data still needs to come from them only.</p>",
        "id": 210400767,
        "sender_full_name": "Shreyansh Mehta",
        "timestamp": 1600354237
    }
]