[
    {
        "content": "<p>Whats the take on new projects/greenfield areas involving HL7 standards (I'm trying to start war here)? Does HL7 itself have any recommendations towards the use of either HL7 2.x, HL7 CDA or HL7 FHIR?</p>",
        "id": 183090295,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576004405
    },
    {
        "content": "<p>You should ask that in <a href=\"http://Chat.hl7.org\" target=\"_blank\" title=\"http://Chat.hl7.org\">Chat.hl7.org</a>.  It's likely to be less bias</p>",
        "id": 183090792,
        "sender_full_name": "David Pyke",
        "timestamp": 1576004725
    },
    {
        "content": "<p>does anyone actually use that?</p>",
        "id": 183090825,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576004753
    },
    {
        "content": "<p>Yes, people do.</p>",
        "id": 183090902,
        "sender_full_name": "David Pyke",
        "timestamp": 1576004791
    },
    {
        "content": "<p>well ... double post achievement to me then</p>",
        "id": 183091136,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576004923
    },
    {
        "content": "<p>However, the HL7 Org itself ought to have the same opinion regardless of the forum ;)</p>",
        "id": 183091229,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576004986
    },
    {
        "content": "<p>Not as active.  I think the answer is driven by who you hope to communicate with and what infrastructure is in place.  It'll also be influenced by how suitable the exchange is to documents.  If documents are a good fit and your recipients support CDA but not FHIR, sticking with CDA may make sense.</p>",
        "id": 183091357,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576005068
    },
    {
        "content": "<p>consider it greenfield</p>",
        "id": 183091413,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576005122
    },
    {
        "content": "<p>no interacting parties besides my clients that I control</p>",
        "id": 183091491,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576005164
    },
    {
        "content": "<p>initially</p>",
        "id": 183091499,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576005173
    },
    {
        "content": "<p>HL7 will never officially pick one of their children as \"favourite\".  They present the options and leave it up to the community to decide what thrives and what withers in a given space.</p>",
        "id": 183091504,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576005175
    },
    {
        "content": "<p>If totally green field, no good reason I can think of to pick CDA over FHIR.</p>",
        "id": 183091564,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576005232
    },
    {
        "content": "<p>lets say that there's a tiny system sitting over in the corner ... and that you at some point ... need to do an export to that system ... and that system is based on XDS and CDA ... would that change your mind ... ?</p>",
        "id": 183091838,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576005396
    },
    {
        "content": "<p>would that make you consider changing the entire architecture and base everything on CDA?</p>",
        "id": 183091890,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576005444
    },
    {
        "content": "<p>In my mind, that would depend of if that little system over there can manage any other formats.  A full system export should be something it doesn't have to convert.  So I'd make the big system able to write in whatever format the little system uses internally</p>",
        "id": 183095356,
        "sender_full_name": "David Pyke",
        "timestamp": 1576007461
    },
    {
        "content": "<blockquote>\n<p>HL7 will never officially pick one of their children as \"favourite\".  They present the options and leave it up to the community to decide what thrives and what withers in a given space.</p>\n</blockquote>\n<p>That's not quite correct. One of HL7 International's declared, core strategic goals is to \"Establish FHIR as the primary standard for global health data interoperability\".</p>",
        "id": 183099840,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1576010346
    },
    {
        "content": "<p>that's true but I still think Lloyd is right</p>",
        "id": 183101247,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576011252
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/Special/2018StrategicValues.pptx\" target=\"_blank\" title=\"https://www.hl7.org/Special/2018StrategicValues.pptx\">https://www.hl7.org/Special/2018StrategicValues.pptx</a> - yep ... </p>\n<blockquote>\n<p>Establish FHIR as a primary standard for global health data interoperability</p>\n</blockquote>\n<p>- it says so ... ;)</p>",
        "id": 183102881,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576012278
    },
    {
        "content": "<p>sounds like a favourite to me</p>",
        "id": 183102906,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576012303
    },
    {
        "content": "<p>That was a radically bold statement for the organization to make, actually.</p>",
        "id": 183116063,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576022996
    },
    {
        "content": "<p>If your little system in the corner is the only thing you're talking to, then CDA makes sense.  If it's one of many, then use FHIR and transform a FHIR document into CDA for the system in the corner.</p>",
        "id": 183116121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576023031
    },
    {
        "content": "<p>Jens, I'd take a step back from the tools and first look at the job to be done. What is your workflow/use case? What data flow between systems accommodates that workflow? And finally, in your region, what standards are in use to facilitate that data flow?</p>",
        "id": 183117316,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1576024487
    },
    {
        "content": "<p>Strategically CDA is a dead duck for new projects. Open source tools are slowly entering their zombie phase, I haven't presented a CDA training course [anywhere in Europe] in the past 6 years or so (interest in training courses is like the canary in the coal mine).<br>\nXDS is certainly not a reason to go CDA, as one could easily exchange either FHIR Documents or FHIR Bundles via XDS as well. Preferrably on-demand FHIR Bundles or FHIR Documents. <br>\nMost CDA IGs are mappable to FHIR, so that's the solution for your 'tiny' system in the corner.<br>\nThe only hesitation I have right now is the fact that most of the 'clinical' resources in FHIR have a low maturity level. If I have to pick one reason for using CDA in a new project over the use of FHIR, it'd be maturity of the clinical models. It'll take some time before FHIR achieves the same level of maturity as the CDA clinical statement model. So if your use case calls for highly complex clinical data, CDA may just still be your best bet. But architect for change, FHIR Documents will overtake CDA in terms of maturity within a couple of years.</p>",
        "id": 183134425,
        "sender_full_name": "René Spronk",
        "timestamp": 1576050778
    },
    {
        "content": "<blockquote>\n<p>(CDA) Open source tools are slowly entering their zombie phase</p>\n</blockquote>\n<p>That would be partly about ART-DECOR? I'd say \"zombie phase\" is a slight overstatement. Though I'd agree with the gist of what you say, CDA maintenance will be a huge job for years and years to come, and we still need (and have) the tools to do that. In the Netherlands we still roll out CDA next to FHIR for large new projects such as BGZ. And so does for instance the IPS.</p>",
        "id": 183141046,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1576057637
    },
    {
        "content": "<p>No. That wasn't about ART DECOR, which is very much alive, supported and also used for projects other than CDA. I'm referring to dozens of other CDA tools that we used to have (at the height of its popularity) and that are slowly dwindling away.</p>",
        "id": 183141416,
        "sender_full_name": "René Spronk",
        "timestamp": 1576057957
    },
    {
        "content": "<p>As long as it aint broken, don't fix it. So CDA will be around for a while. The question was however related to \"new projects\".</p>",
        "id": 183141530,
        "sender_full_name": "René Spronk",
        "timestamp": 1576058057
    },
    {
        "content": "<p>yep - new greenfield projects - ... where an export at some point in the work flow is needed .... to legacy systems</p>",
        "id": 183141566,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576058092
    },
    {
        "content": "<p>We had a community talk about that: \"FHIR to Fax gateway\" ;-) .. (actually the project was the other way around: from Fax to FHIR).</p>",
        "id": 183141758,
        "sender_full_name": "René Spronk",
        "timestamp": 1576058268
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>HL7 will never officially pick one of their children as \"favourite\".  They present the options and leave it up to the community to decide what thrives and what withers in a given space.</p>\n</blockquote>\n<p>That's not quite correct. One of HL7 International's declared, core strategic goals is to \"Establish FHIR as the primary standard for global health data interoperability\".</p>\n</blockquote>\n<p>this statement becomes more and more bold as I hear the community is not strictly aligned with it</p>",
        "id": 183143322,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576059692
    },
    {
        "content": "<p>volunteer communities are never that well aligned. The question is whether they are aligned enough</p>",
        "id": 183146416,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576062340
    },
    {
        "content": "<p>I think the community is relative aligned around the statement, but we're trying not to be overt FHIR cheer-leaders.  CDA will have a place for quite some time, but it's definitely in the 'decline' phase rather than 'growth' phase.</p>",
        "id": 183155303,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576070349
    },
    {
        "content": "<p>people will be happy to give opinion on what is the best protocol to choose, consultants even happer.  Picking a best-protocol is what Implementation Guides do for specific use-cases. Find your use-case in the list of Implementation Guides, and you will find some consensus body decision on what is the best solution (at the time that IG was written). But to expect a preference to come from HL7 at this time, when FHIR has such few parts as normative,  is not going to find a single recommendation.</p>",
        "id": 183156056,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576070866
    },
    {
        "content": "<p>well - apparently HL7 did that ...</p>",
        "id": 183157886,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576072121
    },
    {
        "content": "<p>I read the text you found as a 'mission', not as a recommendation. I expect any organization has a mission to promote their newest developments. Right?</p>",
        "id": 183159086,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576072916
    },
    {
        "content": "<p>Your are right. They are listed as </p>\n<blockquote>\n<p>Core Strategic Goals</p>\n</blockquote>",
        "id": 183159245,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576073005
    },
    {
        "content": "<p>Im sure that you would find similar statements from any organization about their newest product. If an organization doesn't have a mission to promote their newest product then one should question why that organization is working on that newest product... so, seems natural</p>",
        "id": 183159255,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576073013
    }
]