[
    {
        "content": "<p>Anyone heard of this?  I learned about it Monday from Mitch Silva in Brussels ... he's about to become one of our newest fans &amp; participants.  It's an ISO Working Draft, updated Sept 2018. 777k PDF, 30 pages (body=16 pages, plus cases &amp; 30 refs), attached.</p>\n<p>\"Patient involvement in person-centred care\"</p>\n<p>From PDF page 5:</p>\n<blockquote>\n<p><strong>Guiding principle</strong></p>\n<p>This document aims to optimize the chances for improvement of health care outcome resulting from the<br>\nmeeting between the patient and the health care personnel/professionals, because it provides all<br>\ninvolved stakeholders with a set of generic guidance points in order to provide minimum requirements<br>\nof patient involvement in health care.</p>\n<p>Strengthening the persons’ involvement and capacities to self-manage health and prevent illness is<br>\npivotal to policymakers’ attempts to achieve cost-containment with maintained or even improved<br>\nquality of health care (2). To reach this goal, a systematic and structured system need to be in place to<br>\nfacilitates involvement in all steps of the persons' health care journey.</p>\n</blockquote>\n<p>I haven't dug deeper yet but I wonder if we ought to connect with them for any reason.  That question is above my pay grade!  I would just want to ensure that no ISO standard that gets encased in concrete with an obsolete concept of patient as a passive recipient of services.  (But maybe that's not in there.)</p>\n<p><a href=\"/user_uploads/10155/zgW1gNrljLTNXbJ7-r3RpwpA/ISO-standard-CEN-TC450_N0085_4th_WD_tracked_vs_N0077.pdf\" target=\"_blank\" title=\"ISO-standard-CEN-TC450_N0085_4th_WD_tracked_vs_N0077.pdf\">ISO-standard-CEN-TC450_N0085_4th_WD_tracked_vs_N0077.pdf</a></p>",
        "id": 177658031,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1570567994
    },
    {
        "content": "<p>CORRECTION OCTOBER 11:   I was wrong to call it ISO; I'd been told that, but a wiser person pointed out it's from CEN, not ISO.  CEN is apparently a Europe-only standards body. </p>\n<p>My interest in the subject remains:  to align ALL thinking about patient centricity, to achieve a paradigm. (Which Kuhn defines as agreement among practitioners in a field, without which a field can't advance.)</p>",
        "id": 177928939,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1570814685
    }
]