[
    {
        "content": "<p><a href=\"https://dpc.cms.gov/\">Data at the Point of Care (DPC)</a> is a FHIR API being developed on behalf of CMS that helps provide a complete picture of a patient's medical history. As we work towards streamlining the DPC onboarding and implementation process, we're looking to speak with vendors and integrators about your experiences, challenges and practices surrounding client data integration projects. If you're interested in sharing feedback and learning more about DPC, please contact <a href=\"mailto:dave.sukharan@adhocteam.us\">dave.sukharan@adhocteam.us</a>.</p>",
        "id": 223705536,
        "sender_full_name": "Bill Harty",
        "timestamp": 1611352145
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192646\">Bill Harty</span> <a href=\"#narrow/stream/179160-social/topic/CMS.3A.20Call.20for.20Research.20Participants/near/223705536\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://dpc.cms.gov/\">Data at the Point of Care (DPC)</a> is a FHIR API being developed on behalf of CMS that helps provide a complete picture of a patient's medical history. </p>\n</blockquote>\n<p>First, disambiguation:  this DPC is not related to to <a href=\"https://www.dpcare.org/\">Direct Primary Care</a>, right? </p>\n<p>Now: how do you define \"complete picture\"?  I can imagine someone would say that a big fat pile = a picture, which I would not agree with <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> </p>\n<p>Does this mean \"just gather everything\" or something more?</p>",
        "id": 223717879,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611359909
    },
    {
        "content": "<p>Hi Dave, thanks for the feedback and apologies for my delayed response.  In an effort to keep my post brief, I was perhaps a bit unclear and/or ambiguous so I'll try to clarify here.</p>\n<p>First, Data at the Point of Care (DPC) is not related to the Direct Primary Care you mention.</p>\n<p>Second, I agree that the term \"complete picture\" is a broad term with numerous possible interpretations. On top of that, we recognize that DPC is typically just <strong>one piece </strong>of any integration strategy.  </p>\n<p>So another way to think of it might be this: DPC is a CMS sponsored FHIR API that offers access to Medicare claims data, providing patient history, procedures, medication adherence, etc. Vendors and integrators consume DPC, along with various other data sources, to create <strong>enough of a picture </strong> to drive their specific solutions (clinical workflow, analytics, pop health, SDOH, etc.).  Thoughts?  I'm always open to feedback.  Thanks again</p>",
        "id": 224372363,
        "sender_full_name": "Bill Harty",
        "timestamp": 1611859104
    },
    {
        "content": "<p>To clarify and add information regarding the above mentioned research project:</p>\n<p>As the DPC project kicks off the new year, CMS is embarking on a research effort focused on how vendors work with and are authorized by provider organizations for patient data sharing. This research will help DPC scale and grow for different types of provider organizations while incorporating more seamlessly into your current processes.</p>\n<p>We are looking to speak to people who work at health IT vendors that manage patient data for provider organizations. We are particularly interested in hearing from people who serve as the primary contact with a provider organization for the company, and who are familiar with your company’s Business Associate Agreements.</p>",
        "id": 224372644,
        "sender_full_name": "Bill Harty",
        "timestamp": 1611859222
    }
]