[
    {
        "content": "<p><a href=\"https://www.cnbc.com/2020/05/15/poorly-connected-digitized-health-system-endangers-americas-health.html\">Why, in the midst of a U.S. health crisis, there are major challenges for doctors to access patient records</a><br>\nBullets at top:</p>\n<blockquote>\n<ul>\n<li>Today, in the midst of a major health crisis, there are still major challenges for doctors to access patient records.</li>\n<li>Medical record interoperability is far from a solved problem in the U.S., doctors say. </li>\n<li>Epic CEO Judy Faulkner told CNBC that as one of the “originators” of interoperability, her company is at the forefront trying to solve the problem.</li>\n<li>It’s still a challenge for patients to freely move their records between systems, and data-blocking is still a routine occurrence.</li>\n</ul>\n</blockquote>",
        "id": 197868552,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589749078
    },
    {
        "content": "<p>To be fair, the Epic folks <em>have</em> been at the table from pretty much the beginning, and many of us are able to fetch from Epic systems without undue difficulty.  There are other actors in the process that are also slow to change, and it's not the EHR systems necessarily that are the problem or the bottleneck at this point.  The healthcare providers and insurers and others who rely on those EHRs have to turn the interoperability on, update policies and procedures, and retrain their workforces.</p>",
        "id": 197868735,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1589749318
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191678\">Abigail Watson</span> <a href=\"#narrow/stream/179160-social/topic/CNBC.3A.20Impact.20of.20interop.20fails.20on.20docs/near/197868735\">said</a>:</p>\n<blockquote>\n<p>To be fair, the Epic folks <em>have</em> been at the table from pretty much the beginning</p>\n</blockquote>\n<p>??  Methinks thou dost infer too much.  :-) All I did was paste in the top-of-link bullets.</p>",
        "id": 197872452,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589754863
    }
]