[
    {
        "content": "<p>A  rhetoric technique which can be applied to many FHIR presentations and training courses: identify/describe the major critical assumptions or misconceptions that the attendees have, and show how these  have been dealt with in FHIR.  Which begs the question: what, in your mind, are those critical assumptions or misconceptions which newbies tend to have?</p>",
        "id": 153992804,
        "sender_full_name": "René Spronk",
        "timestamp": 1535985062
    },
    {
        "content": "<p>FHIR is only about REST.  You can get all the benefits of FHIR just by converting your existing messaging interface.  FHIR is still about point-to-point interfaces.  I don't need to think about what the community is doing, only what's easiest for me.</p>",
        "id": 153992819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535990637
    },
    {
        "content": "<p>„My Resource validates, so it must be interoperable.“</p>",
        "id": 153992837,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1535994914
    },
    {
        "content": "<p>Wait no. That’s an uncritical assumption. I guess the critical counterpart is: „With too little constraints in the Core spec plus extensibility, anyone can do what they want with FHIR and will never be interoperable“. The lack of Governance behind Extensibility is a common criticism.</p>",
        "id": 153992839,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1535995101
    },
    {
        "content": "<p>both</p>",
        "id": 153992845,
        "sender_full_name": "John Moehrke",
        "timestamp": 1535995285
    },
    {
        "content": "<p>I can just adopt FHIR with its reference implementations and I'll instantly be interoperable with anyone I want to share data with.</p>",
        "id": 153992846,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1535995360
    },
    {
        "content": "<p>At a high level, people don't 'get' resource API pattern/RESTful and see FHIR as a replacement for HL7v2 messaging. So rip and replace rather than complimentary.</p>",
        "id": 153992934,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1536043569
    },
    {
        "content": "<p>FHIR = REST + JSON and I  do REST + JSON, so what I do IS FHIR ;-)</p>",
        "id": 153992949,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1536065087
    },
    {
        "content": "<p>It's \"just\" an XML/JSON version of HL7 V3 !   (or just an XML/JSON data model)</p>",
        "id": 153992977,
        "sender_full_name": "John Silva",
        "timestamp": 1536069719
    },
    {
        "content": "<p>\"FHIR has just the 80%, so it will never be capable of fulfilling 100% of the requirements for my use case.\"</p>",
        "id": 153993053,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1536082333
    },
    {
        "content": "<p>\"FHIR solves the most common 80%, so surely all my needs are already catered for. I can just start using what others have implemented.\"</p>",
        "id": 153993137,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1536088647
    }
]