[
    {
        "content": "<p>Re: <a href=\"#narrow/stream/179160-social/topic/Pt.20Empowermt.20WG.20initial.20priorities.20announced\" title=\"#narrow/stream/179160-social/topic/Pt.20Empowermt.20WG.20initial.20priorities.20announced\">https://chat.fhir.org/#narrow/stream/179160-social/topic/Pt.20Empowermt.20WG.20initial.20priorities.20announced</a><br>\nWork groups haven't historically announced their projects (or planned activities) to the community on <a href=\"http://chat.fhir.org\" title=\"http://chat.fhir.org\">chat.fhir.org</a>.  However, it strikes me that this would be a good thing.  I'm not sure that #social is necessarily the proper place, but what to others think about having a stream specifically devoted to announcements of planned new HL7 work so that those who are interested can keep abreast.  (I'm not sure we necessarily want to stick it on <a class=\"stream\" data-stream-id=\"179240\" href=\"/#narrow/stream/179240-Announcements\">#Announcements</a>, though that could be an outcome if that's what the community wants.)</p>",
        "id": 195226446,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587752578
    },
    {
        "content": "<p>I think it is a fantastic idea. Especially to put on a stream dedicated to that workgroup.... I could imagine a well-formed and succinct message could be put on <a class=\"stream\" data-stream-id=\"179240\" href=\"/#narrow/stream/179240-Announcements\">#Announcements</a> , or at least an announcement pointing at the other stream message with a well-formed and succinct message.</p>",
        "id": 195226816,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587752773
    },
    {
        "content": "<p>We put published IGs in Announcements, it seems to me the project announcement would fit there too</p>",
        "id": 195228117,
        "sender_full_name": "David Pyke",
        "timestamp": 1587753467
    },
    {
        "content": "<p>Whatever else we do, it'd make sense for each stream to have \"pinned\" / \"keeper\" posts if that's supported by Zulip. Is it?  </p>\n<p>Googling suggests it's possible to pin a stream in the sidebar, but not pin a message in the stream!  Seems to be <a href=\"https://github.com/zulip/zulip/issues/5200\" title=\"https://github.com/zulip/zulip/issues/5200\">a requested feature</a> since 2017.  Or am I misunderstanding?</p>\n<p>One challenge might be permissions: who gets to do the pinning. I don't think Zulip has a concept of \"stream admin.\"</p>",
        "id": 195228767,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1587753817
    },
    {
        "content": "<p>I would love to see workgroup announcements, especially as someone who wants to contribute more but doesn't know exactly where to start based on experience.  Maybe a [hash]workgroup ?  Is there an HL7 Confluence page with something like the \"latest status\" for each of the workgroups?  How many WGs are there, anyway?  20-30?</p>",
        "id": 195228910,
        "sender_full_name": "Matt Zajack",
        "timestamp": 1587753884
    },
    {
        "content": "<p>I think the intention would be to share awareness for those <em>not</em> following a particular work group's stream.   I'm ok with Announcements if we don't think it will be overwhelming.  (The rule that discussion/questions happens elsewhere would need to be adhered to.)</p>",
        "id": 195228916,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587753887
    },
    {
        "content": "<p>fine line... yup, not clear how to provide guidance that doesn't simply make noise,  informs at the right time to engage,  and doesn't simply duplicate other information streams (like each workgroup does have  a landing page on confluence that should already show their work)</p>",
        "id": 195229148,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587754036
    },
    {
        "content": "<p>42 ish.  I don't think most WGs post a 'current status' on their pages, but that's not a bad suggestion either.  </p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, the benefit of Zulip is that it's a push notification.  Unless you choose to follow a particular work group's pages (which is quite daunting), there's no way to get a notification when a work group is doing something new/significant.</p>\n<p>One possibility might be a notification to the Announcements stream each time there's a newly proposed PSS?</p>",
        "id": 195229482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587754210
    },
    {
        "content": "<p>For Patient Empowerment it would be easy to post \"PE WG has announced its priorities. To view and discuss, see <strong>this thread</strong> in our stream.\"</p>\n<p>In cases where a WG doesn't have a Zulip stream it could say \"... To view &amp; discuss, visit <strong>this other page</strong> off-chat.\"</p>\n<p>Too bad Zulip doesn't have a read-only setting for streams!</p>",
        "id": 195229608,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1587754281
    },
    {
        "content": "<p>I think having PSSes (once workgroup or SD approved) get announced on the Announcements.  That gives people notice of what's going on and, hopefully, won't be overwhelming</p>",
        "id": 195230508,
        "sender_full_name": "David Pyke",
        "timestamp": 1587754690
    },
    {
        "content": "<p>I don't see any on the announcements stream?  I think it would be better to post the new ones rather than the approved ones so that the community can have some influence on the approval process.</p>",
        "id": 195235111,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587757007
    },
    {
        "content": "<p>Safe to assume this should include all projects, such as v2 andCDA IGs, DAMs, etc given that this the whole HL7 Zulip site...</p>",
        "id": 195408233,
        "sender_full_name": "Craig Newman",
        "timestamp": 1587989903
    },
    {
        "content": "<p>It may be worthwhile creating a V2 Announcments and a CDA Announcements if we want to keep things separate</p>",
        "id": 195409041,
        "sender_full_name": "David Pyke",
        "timestamp": 1587990331
    },
    {
        "content": "<p>Everyone gets signed up for <a class=\"stream\" data-stream-id=\"179240\" href=\"/#narrow/stream/179240-Announcements\">#Announcements</a> - not sure we'd want to do that for CDA and V2</p>",
        "id": 195426992,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587998492
    }
]