[
    {
        "content": "<p>hey All </p>\n<p>We have a challenge around connectathon registration. Being an on-line event, people leave decision till the very last minute. We have 100s of people registering on the last day. This is an administrative challenge, but we can deal with that, so that's not the challenge.</p>\n<p>What we see is that a portion of the late signees (not all, by any means) are totally unprepared, and since they have no orientation, or experience, the connectathon is not a rewarding experience for them </p>\n<p>We've considered closing the connectathon registration a little early to force people to register early, but that feels to me like solving the wrong problem. </p>\n<p>We're interested in any thoughts people have on this subject</p>",
        "id": 216154997,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1604963626
    },
    {
        "content": "<p>How are they unprepared? Don't know FHIR, haven't chosen a track? don't know how to make their servers accessible over the internet? </p>\n<p>Do you need an unprepared track? Maybe with online VMs all ready to go for participant use?</p>",
        "id": 216156030,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1604964422
    },
    {
        "content": "<p>In order to complete the registration, can we ask people to complete a few simple tasks (related to their tracks)?</p>",
        "id": 216160314,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604968257
    },
    {
        "content": "<p>Have a preparatory session the day before? Something to help them budget time for preparation,</p>",
        "id": 216170819,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1604981162
    },
    {
        "content": "<p>I think that we need to mandate more detailed information about experience levels, track selection and participation objectives in the Registration Form.  It's still hard for Track Leads to respond to this from last-minute registrations, but I guess that has to be weighed against the short-term financial advantages of this. In the medium to long-term nobody benefits from poor experiences, but given that the January Connectathon is so close to the Xmas/New Year Holiday Season I don't think that this is the time to close registrations early.</p>",
        "id": 216175571,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1604988792
    },
    {
        "content": "<p>Looking at IHE events: one has to do prep work with simulators, and share the logs of such testing, before one is allowed to participate. I'm not suggesting we copy that process verbatim, but it odes help to ensure attendees have done their bit prior to attending. But unless you make this sort of a thing mandatory (and have a means of testing) there will always be participants who are ill prepared. You can remind, cajole, or threaten the attendees into looking at stuff, but some will still not be prepared. That's their own problem, as long  as that doesn't hinder the other participants too much. If as Grahame says this gas risen to a level where's it's becoming annoying for other participants, then we'll have to do something.</p>",
        "id": 216178958,
        "sender_full_name": "René Spronk",
        "timestamp": 1604993563
    },
    {
        "content": "<p>We improvised a little  when we did the FHIR India connectathon . We introduced  pre-connectathon sessions which started 15 days before the main event.  This allowed the participants to understand whats expected also helped in socializing and getting to know each other.  It also helped the track leads to get a fair understanding of the participants in their tracks ,they could tune their agenda to get optimum outcome and  maximum participation.<br>\nWe closed registrations couple of days before the main event, this allowed new participants to catch up through interactions with fellow participants who had attended pre-connectathon sessions .</p>",
        "id": 216183717,
        "sender_full_name": "Kumar Satyam",
        "timestamp": 1604997785
    },
    {
        "content": "<p>The IHE events are strictly for testing implementations - FHIR Connectathons have additional goals; namely education, developing conformance artefacts and testing the specification itself.  As I see it, the problematic user group to cater for in virtual connectathons is the 'newbie' one - given that many of the educators have limited time to run dedicated sessions for them on topics such as 'how to build a FHIR server'. It's easier, and cheaper, for this group to attend virtual events but maybe HL7 should offer a different type of 'event' for them? It's really hard to serve 600+ people at one time. For the remining groups, I think that the approach the HL7 India (and others) has taken, in terms of pre-event preparation and registration deadlines, is a good one.</p>",
        "id": 216283053,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1605046950
    },
    {
        "content": "<p>One thing we might include in the mix would be asking track leads to record an introductory presentation rather than just running the presentation once; that way we could expect participants to watch the video no matter when they signed up this is not a solution all on its own but it helps a little bit.</p>",
        "id": 216287896,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1605050018
    },
    {
        "content": "<p>I generally record an intro.  A link is included in the track description.  It's pretty rare to have someone show up who's seen it.</p>",
        "id": 216292974,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605053762
    },
    {
        "content": "<blockquote>\n<p>It's pretty rare to have someone show up who's seen it.</p>\n</blockquote>\n<p>So this is an opportunity to improve the registration flow. Like, inline steps ;)</p>",
        "id": 216297768,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1605058133
    },
    {
        "content": "<p>In-person, people were committed to spending a weekend with a group of people focused on a track's goals.  With the online format there is a lot less buy-in relative to any metric: time, money, commitment, peer-pressure (the good kind - not wanting to waste the time of people sitting around you), etc..  So, people a) don't feel the same incentive to prepare and b) have a lower bar for joining.  Note that I'm not attaching any valuations to this, particularly because there are some benefits (e.g., many more people are able to attend, etc.).</p>\n<p>Part of what made it challenging for me is that it only took one person looking for a basic overview at any time to stop other conversations; it's hard to tell someone you won't answer their question in an 'open discussion' format. <br>\n With people able to drop in and out, it felt like it chewed up a lot of time.  Here too I'll note that it wasn't always 'new' people doing this - sometimes it was people who are quite involved in FHIR, just not that particular area.  And again, in-person this works fine - in part because you can physically cue off of what discussions are happening (e.g., not interrupt the flow of work).</p>\n<p>This is getting long, so I'll toss out some ideas in short form:</p>\n<ul>\n<li>Have a 'general' track that people can go for basic info, pointers to track orientations, etc. (also with a note: first time participants should/must join this first)</li>\n<li>Assign labels to tracks (e.g., 'beginner', 'intermediate', 'advanced') to indicate relative difficulty/preparation/etc.</li>\n<li>Room titles/tags - e.g., be able to flag that session is focused on a particular topic, open for any questions, etc.</li>\n</ul>",
        "id": 216376244,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1605116518
    },
    {
        "content": "<p>I heard towards the end of the WGM that Whovia allows for on-demand peel-off sessions. Might be a good idea to figure out how to make that easily done when someone needs an overview, and there is a possible mentor to take them aside and bring them up to speed...</p>",
        "id": 216392168,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1605124957
    },
    {
        "content": "<p>I like the idea of the beginner, intermediate, advanced tags.</p>",
        "id": 216401273,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1605130211
    },
    {
        "content": "<p>Since we're in the social channel... I'd love to try <a href=\"https://gather.town\">https://gather.town</a> for a connectathon (or similar) sometime -- might make these kinds of breakouts and situational awareness a bit more natural.</p>",
        "id": 216404232,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1605132233
    },
    {
        "content": "<p>Oooh.  We should have lots of the little campfire layouts - but all of the fires should be the FHIR logo (with registered mark logo :&gt;)</p>",
        "id": 216405819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605133330
    },
    {
        "content": "<p>It's come to that. SecondLife is now real life.</p>",
        "id": 216741151,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1605376141
    },
    {
        "content": "<p>Is anything documented anywhere about what a connectathon is, what people DO during one, and therefore how one should prepare?</p>\n<p>For me, connectathons have been one of those things where EVERYone seems to assume that EVERYone knows what's going on and what's expected.  That's a familiar sign of an ingrown organization, which is fine, as long as it works, but which will surely prevent expansion to new people. </p>\n<p>Anyway my point was that if such a document exists it might be useful as well in the current challenge.  And if it doesn't, it should. :-)</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"194480\">@Mark Braunstein</span> <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> </p>\n<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179160-social/topic/Connectathon.20Registration/near/216154997\">said</a>:</p>\n<blockquote>\n<p>hey All </p>\n<p>We have a challenge around connectathon registration. Being an on-line event, people leave decision till the very last minute. We have 100s of people registering on the last day. This is an administrative challenge, but we can deal with that, so that's not the challenge.</p>\n<p>What we see is that a portion of the late signees (not all, by any means) are totally unprepared, and since they have no orientation, or experience, the connectathon is not a rewarding experience for them </p>\n<p>We've considered closing the connectathon registration a little early to force people to register early, but that feels to me like solving the wrong problem. </p>\n<p>We're interested in any thoughts people have on this subject</p>\n</blockquote>",
        "id": 216742637,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1605378378
    },
    {
        "content": "<p>Having participated in several (more or less confusing) online work sessions this year, I'll give <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> 's message here a gold star for useful insight.   I've boldfaced a couple of particularly good observations ... how do we transform these?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179160-social/topic/Connectathon.20Registration/near/216376244\">said</a>:</p>\n<blockquote>\n<p>In-person, people were committed to spending a weekend with a group of people focused on a track's goals.  With the online format there is a lot less buy-in relative to any metric: time, money, commitment, peer-pressure (the good kind - not wanting to waste the time of people sitting around you), etc..  So, people a) don't feel the same incentive to prepare and b) have a lower bar for joining.  Note that I'm not attaching any valuations to this, particularly because there are some benefits (e.g., many more people are able to attend, etc.).</p>\n<p>Part of what made it challenging for me is that <strong>it only took one person looking for a basic overview at any time to stop other conversations;</strong> it's hard to tell someone you won't answer their question in an 'open discussion' format. </p>\n<p>With people able to drop in and out, it felt like it chewed up a lot of time.  Here too I'll note that it wasn't always 'new' people doing this - sometimes it was people who are quite involved in FHIR, just not that particular area.  And again, <strong>in-person this works fine - in part because you can physically cue off of what discussions are happening</strong> (e.g., not interrupt the flow of work).</p>\n<p>This is getting long, so I'll toss out some ideas in short form:</p>\n<ul>\n<li>Have a 'general' track that people can go for basic info, pointers to track orientations, etc. (also with a note: first time participants should/must join this first)</li>\n<li>Assign labels to tracks (e.g., 'beginner', 'intermediate', 'advanced') to indicate relative difficulty/preparation/etc.</li>\n<li>Room titles/tags - e.g., be able to flag that session is focused on a particular topic, open for any questions, etc.</li>\n</ul>\n</blockquote>",
        "id": 216742874,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1605378729
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  I was commissioned to write a document about exactly that for HL7 HQ a few months back. Not sure if it has been made available yet. <span class=\"user-mention\" data-user-id=\"286087\">@Dave Hamill</span></p>",
        "id": 216747550,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1605384558
    },
    {
        "content": "<p>Please explore!</p>",
        "id": 216750023,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1605387690
    },
    {
        "content": "<p>i am interested in participating in connectathon... please suggest the next steps..</p>",
        "id": 217026284,
        "sender_full_name": "Bhagvan Kommadi",
        "timestamp": 1605630514
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"364507\">@Bhagvan Kommadi</span>  - I'm guessing you have never participated in a connectathon before.  You didn't say why you want to participate - it's quite a busy and complicated event - but you can start at the registration page: <a href=\"https://www.hl7.org/events/fhir/connectathon/2021/01/\">https://www.hl7.org/events/fhir/connectathon/2021/01/</a></p>",
        "id": 217202482,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1605736867
    }
]