[
    {
        "content": "<p>I'm asking here because searching Zulip for diabetes ... is there any organized activity in the FHIR universe about the specific needs of type 1 diabetes patients?  <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> or anyone?</p>",
        "id": 227031294,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1613770173
    },
    {
        "content": "<p>I don't think it's very organized, but</p>\n<ul>\n<li>We have done something in the context of <a class=\"stream\" data-stream-id=\"179222\" href=\"/#narrow/stream/179222-finnish-PHR\">#finnish PHR</a>. Profiles for glucose meter and CGM readings, insulin dosing, carb estimates, etc. <a href=\"https://simplifier.net/finnishphr\">https://simplifier.net/finnishphr</a>.</li>\n<li>I know at least Roche have done work in the area too, but are unfortunately not able to share it.</li>\n<li>We have ported a part of the Nightscout API to FHIR, for it to work on top of the <a class=\"stream\" data-stream-id=\"179222\" href=\"/#narrow/stream/179222-finnish-PHR\">#finnish PHR</a>. With <span class=\"user-mention\" data-user-id=\"199600\">@Sulka Haro</span>. See <a href=\"https://github.com/Sensotrend/nightscout-fi\">https://github.com/Sensotrend/nightscout-fi</a>.</li>\n<li>We have discussed extending the support for everything required for closed loop automated insulin delivery systems with <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>.</li>\n<li>I've chatted about that in DevDays with several people, including <span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>. </li>\n<li>There was a discussion in the Nightscout community on whether to adopt HL7 FHIR, when the API was renewed. The community found FHIR to be too complex for the needs, and ended up proceeding with a simpler solution.  </li>\n<li>Dana Lewis presented OpenAPS in DevDays, <a href=\"https://www.devdays.com/us/speakers/dana-lewis/\">https://www.devdays.com/us/speakers/dana-lewis/</a>.</li>\n</ul>\n<p>Just some pointers from the top of my head.</p>",
        "id": 227071298,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1613802728
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> I remember the discussions well ... and after that I was making a presentation at the FDA on this standards stuff and this topic came up ... in fact it came up in a recent call with a standards-focused group.  The use case is definitely on our map ... it is one of the core use cases that we included in the <a href=\"https://confluence.hl7.org/x/Xzf9Aw\">Gemini Medical Device Interoperability SDPi+FHIR</a> program - just haven't quite gotten there yet!  Sorry that FHIR was \"too complex\" - understood only too well, some have called it \"consumptive\"! - but the vision for what the SDPi+FHIR project is thinking is to achieve truly standards-based interoperable products that allow this Type 1 community (e.g., Nightscout) to have a pathway to an ecosystem of products that let them focus on the primary task at hand and not having to constantly futz with getting all the components to play nice.  Good vision ... but can we get there ... in our lifetimes?  I remain very hopeful:  Yes!</p>",
        "id": 227301656,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1614013793
    },
    {
        "content": "<p>Of course, part of the appeal of Nightscout and all things related is that you can create great value by futzing with getting different devices to play together. :) But agreed, the core service should be as solid as possible, to enable developers to focus on futzing with more added value.</p>",
        "id": 227339892,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1614029160
    },
    {
        "content": "<blockquote>\n<p>I know at least Roche have done work in the area too, but are unfortunately not able to share it.<br>\nOops. Just found <a href=\"https://simplifier.net/rdcemrintegrations\">https://simplifier.net/rdcemrintegrations</a>. So yes, also Roche are sharing at least part of what they have.</p>\n</blockquote>",
        "id": 227578802,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1614163248
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> did you have a specific idea in mind regarding this?</p>",
        "id": 227578856,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1614163282
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192917\">Mikael Rinnetmäki</span> <a href=\"#narrow/stream/179160-social/topic/Diabetes.20on.20FHIR.3F/near/227578856\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> did you have a specific idea in mind regarding this?</p>\n</blockquote>\n<p>Nothing specific, but IMO important at a general level:</p>\n<p>I anticipate that as the consumer/patient world starts to realize that FHIR exists, and its potential, that various patient communities will get interested in exploring what they might be able to do with FHIR.   And I expect that will be strongest in conditions where data's especially important.  So, I instantly thought about diabetes, the most data-focused condition in the world.</p>",
        "id": 227773453,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1614262796
    },
    {
        "content": "<p>To be clear, I'm thinking aggressively about a new level of evangelizing health data.  For ten years we (all patient data activists) evangelized mere ACCESS to our data.  In parallel with that, Nightscout happened, and various apps for health &amp; fitness started arising. </p>\n<p>Meanwhile, FHIR is the <a href=\"http://dave.pt/healthspigot\">health data spigot</a> our movement called for back in 2015.  But until now FHIR has been all about data <em>in health provider systems</em>, yes?  And I'm thinking, why shouldn't consumer/patients start declaring their own uses for FHIR - \"health data beyond the big iron\"?</p>\n<p>So I thought first of Nightscout as one well developed community that took matters into their own hands.  I don't imagine that community has need for FHIR, but what might other patient communities do, if they knew they could ask?</p>",
        "id": 227773938,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1614262954
    },
    {
        "content": "<p>Clearly <span class=\"user-mention\" data-user-id=\"195798\">@John Keyes</span> is a specimen, even if his Blood Numbers app is N of 1.  That's the beauty of new data ecosystems: entrepreneurs can go after broad audiences, even as tech minded individuals create something for themselves ... and the data <em>emitters</em> don't need to worry about what will be done with  what they emit.</p>",
        "id": 227774087,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1614263013
    },
    {
        "content": "<p>What I've been really keen on is getting data at the Nightscout level into FHIR so that people can start innovating with SMART Apps for visualisation &amp; analysis beyond what's currently there.  But also, in the context of smart watches, etc, there's potentially a raft of other patient activity data that might be accessible and of use.</p>",
        "id": 228678830,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1614809832
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191343\">Michael Lawley</span> <a href=\"#narrow/stream/179160-social/topic/Diabetes.20on.20FHIR.3F/near/228678830\">said</a>:</p>\n<blockquote>\n<p>What I've been really keen on is getting data at the Nightscout level into FHIR so that people can start innovating with SMART Apps for visualisation &amp; analysis beyond what's currently there. </p>\n</blockquote>\n<p>Right - but what does it mean to \"get data into FHIR\"?  Porting it into an EMR?  (Probably not.)  Defining resources (via some extension to FHIR) so the same data exists in a format that other tools can more easily read?</p>\n<blockquote>\n<p>But also, in the context of smart watches, etc, there's potentially a raft of other patient activity data that might be accessible and of use.</p>\n</blockquote>\n<p>Exactly my point in previous post (Feb 25).</p>",
        "id": 228761168,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1614859970
    },
    {
        "content": "<blockquote>\n<p>Right - but what does it mean to \"get data into FHIR\"? Porting it into an EMR? (Probably not.)</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> Sensotrend is also porting Nightscout data into EMR's. We have Nightscout Connect that implements the Nightscout API on top of the <a class=\"stream\" data-stream-id=\"179222\" href=\"/#narrow/stream/179222-finnish-PHR\">#finnish PHR</a>, part of the national healthcare IT. You can also use Nightscout as a data source for our Sensotrend Dashboard that visualizes diabetes data for healthcare professionals, embedded within the EMR.</p>",
        "id": 232152901,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1616921190
    }
]