[
    {
        "content": "<p>Wow. I'm posting this here after taking my nitroglycerine pill, so the next victim might find it in a search. </p>\n<p>After a richly productive Patient Empowermnt WG meeting today, with live minutes-taking throughout, Chrome crashed when I was almost ready to publish. To my surprise, the \"recently worked on\" link only gives me my raw/naked unedited document, which is not what's happened to me in the past, I think. I first drafted this to say: \"Am I screwed or is there any chance of getting it back?\"</p>\n<p>Then realized - this thing may be Cloud-y, but it does NOT think like a Google Doc.  I clicked the Edit link at top of screen, and voila, my unfinished / unpublished draft was there, ready for me to continue. </p>\n<p>I submit to the Confluence gods that it would be awfully awfully nice to have SOME indication somewhere of \"You have unpublished edits.\"  (Or, if that does exist, I'm blind.)</p>",
        "id": 193514272,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1586469334
    },
    {
        "content": "<p>Look for this at the top of the page:<br>\n<a href=\"/user_uploads/10155/UZUsQahT-7oKz5Go-5lexVkr/image.png\" title=\"image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/UZUsQahT-7oKz5Go-5lexVkr/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/UZUsQahT-7oKz5Go-5lexVkr/image.png\"></a></div>",
        "id": 193515853,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586470194
    },
    {
        "content": "<p>Yessir, I saw that:<br>\n<a href=\"/user_uploads/10155/WAZ6fk3mzhNpgzRlOpOdrgJB/image.png\" title=\"image.png\">image.png</a> <br>\nHOWEVER when I clicked one open, my unpublished changes were not evident - all I saw was the previous (published) edition!</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/WAZ6fk3mzhNpgzRlOpOdrgJB/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/WAZ6fk3mzhNpgzRlOpOdrgJB/image.png\"></a></div><p>Only when I clicked Edit were my unpublished changes visible so I could resume.  (To me it appeared that it had gotten saved with only  some token initial keystroke recorded)</p>\n<p>The Confluence paradigm that's slowly sinking in is that it's a repository of <em>published</em> documents, and I need to take action to resume editing - if I merely click where it says \"unpublished changes\" I don't get to see them. I don't think I've ever seen a system like it - but I'm learning.  (Ultimately I figured this one out all by myself!)</p>",
        "id": 193516877,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1586470864
    }
]