[
    {
        "content": "<p>Any thoughts or recommendations for starting discussion groups or mailing lists outside the official FHIR community Zulip space?  I'm thinking about creating one for colleges I work with where the discussions are really general, not based on a good understanding of FHIR (for folks that still haven't learned FHIR), project specific issues, etc.   I feel that either folks won't join here, will likely not feel comfortable speaking here, etc. and having a space on the side might be more helpful. Any thoughts? </p>\n<p>I did a search for \"fhir\" on Google Groups and I found several inactive groups. I'm assuming those started before Zulip but I dont' know the history. I'm thinking about starting a group named like \"fhir-interest\",  \"fhir-learners\",  or something general like that. I also will be getting back to working on my youtube channel and would like folks to go to a better chat space than youtube comments.</p>",
        "id": 253295433,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1631642627
    },
    {
        "content": "<p>you can create your own channel here - you're welcome to do that. But you can also go anywhere else, and there are all sorts of social media channels</p>",
        "id": 253295740,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631642724
    },
    {
        "content": "<p>Sounds good. I just wasn't sure if there is some community guidance, and I don't want to add more fragmentation. I'll direct folks here whenever possible and see how that goes.</p>",
        "id": 253296197,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1631642883
    },
    {
        "content": "<p>Technically, <a href=\"http://chat.fhir.org\">chat.fhir.org</a> is really \"<a href=\"http://chat.hl7.org\">chat.hl7.org</a>\", so anything standards related is fair game.  And in practice, we don't even try to enforce that.  So long as the discussion adheres to our <a href=\"https://confluence.hl7.org/display/FHIR/Chat.fhir.org+Community+Expectations\">Community Expectations</a> and in particular our <a href=\"https://wiki.hl7.org/FHIR_Code_of_Conduct\">Code of conduct</a>, you should be fine.</p>",
        "id": 253312599,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631648956
    }
]