[
    {
        "content": "<p>Hello all, my company produces DME and we are looking to join FHIR. I haven't found much on how we can actually start implementation. Does anyone have any experience as a DME manufacture joining FHIR?</p>",
        "id": 172583812,
        "sender_full_name": "Don thomas",
        "timestamp": 1565095004
    },
    {
        "content": "<p>DME?</p>",
        "id": 172589830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565099369
    },
    {
        "content": "<p>Durable Medical Equipment</p>",
        "id": 172590230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565099610
    },
    {
        "content": "<p>thx. what would a DME producer be looking for from FHIR? What exchanges?</p>",
        "id": 172590337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565099658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"234012\">@Don thomas</span> Are you looking to give your equipment a native FHIR interface?  Are you looking to be members of HL7 to help influence how FHIR evolves?</p>",
        "id": 172590351,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565099675
    },
    {
        "content": "<p>The idea is to cut down on the need to reach out to providers for information and have it readily available for our Reimbursement teams. With our current process, our teams find themselves frequently sending emails or calling over for the providers to fax in the patient information. We would essentially eliminate the fax request and potentially additional contacts that slow the approvals by insurance providers, by having all the information we need.  I am not sure if it is normal for DME manufacturers to participate in FHIR practices.</p>",
        "id": 172591333,
        "sender_full_name": "Don thomas",
        "timestamp": 1565100283
    },
    {
        "content": "<p>Ah, so you're interested in patient payment and insurance adjudication.  You may want to follow some of the Da Vinci project work.  They have three implementation guides focused on helping providers get the information needed and simplify the process for prior authorization/and-or ensure they have appropriate local records when submitting claims.  They are: <a href=\"https://build.fhir.org/ig/HL7/davinci-crd\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/davinci-crd\">Coverage Requirements Discovery</a>, <a href=\"https://build.fhir.org/ig/HL7/davinci-dtr\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/davinci-dtr\">Documentation Templates &amp; Rules</a> and <a href=\"https://build.fhir.org/ig/HL7/davinci-pas\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/davinci-pas\">Prior Authorization Support</a>.  The latter two are actually undergoing ballot review in just a couple of days.</p>\n<p>Most engagement we've had from the DME side of things has been device manufactures where the device produces data that they're looking to ensure their data can be consumed in a standardized way.  We haven't seen many (perhaps any?) that are focused on easing the payment process.  However, that's certainly an area that HL7 (and FHIR) work in and you'd be very welcome to participate.  Each of the Da Vinci projects have weekly calls .  The focus of Da Vinci is limited to the U.S. environment, though some of what it's producing could apply elsewhere.  You'd certainly be welcome to attend our calls.  We also have some virtual connectathons coming up and a physical connectathon in Atlanta where we expect many payers, providers and others to participate in testing out the specifications.  You'd be welcome to participate in (or just observe) those as well.</p>",
        "id": 172592208,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565100863
    },
    {
        "content": "<p>OO also has a DME ordering project if that overlaps any of this<br>\n<a href=\"https://confluence.hl7.org/display/OO/PSS+for+FHIR+DME+Orders\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/PSS+for+FHIR+DME+Orders\">https://confluence.hl7.org/display/OO/PSS+for+FHIR+DME+Orders</a></p>",
        "id": 172592289,
        "sender_full_name": "Craig Newman",
        "timestamp": 1565100928
    },
    {
        "content": "<p>I really appreciate all the information <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span></p>",
        "id": 172592537,
        "sender_full_name": "Don thomas",
        "timestamp": 1565101076
    },
    {
        "content": "<p>Thanks for showing interest in the standard.  Feel free to holler if you're still having trouble figuring out where to engage.</p>",
        "id": 172593342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565101569
    },
    {
        "content": "<p>Related to the issue of prior authorisations (in the US), I've just started <a href=\"#narrow/stream/179160-social/topic/Medicare.20Pmt.20Sys.20Modernization/near/172615888\" title=\"#narrow/stream/179160-social/topic/Medicare.20Pmt.20Sys.20Modernization/near/172615888\">a thread</a> about the important new MPSM project (Medicare Payment System Modernization), in which FHIR <em>should</em> play a big role, I hope!  </p>\n<p>It's all being rebuilt from the ground up, replacing 50 year old technology. Perfect opportunity to get in early.</p>",
        "id": 172616238,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1565116242
    },
    {
        "content": "<p><a href=\"https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/\" target=\"_blank\" title=\"https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/\">https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/</a></p>",
        "id": 172623685,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1565121756
    },
    {
        "content": "<p>LOL <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> ... having been involved in software creation, maintenance, destruction and recreation since the era of machine code (literally), I get it.  </p>\n<p>And at the same time, if it's all written in machine language (or BASIC or COBOL), sometimes ya GOTTA rewrite from scratch.  </p>\n<p>For years I was a fan of <a href=\"https://course.ccs.neu.edu/cs5500f14/Notes/Prototyping1/planToThrowOneAway.html\" target=\"_blank\" title=\"https://course.ccs.neu.edu/cs5500f14/Notes/Prototyping1/planToThrowOneAway.html\">build one to throw away</a>. Then I learned (far later than I should have) that he himself ditched it, in favor of the obviously more modern rapid iterations.</p>",
        "id": 172627265,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1565124687
    }
]