[
    {
        "content": "<p>Register now for the <a href=\"http://HealthCa.mp\" target=\"_blank\" title=\"http://HealthCa.mp\">HealthCa.mp</a> pre-Data Palooza un-conference!</p>\n<p>Over the past several years a number of Connectathon related activities have done preliminary work to explore different methods of reducing the burden to enabling Client Applications to Register for access to FHIR based APIs.  Current approaches to app registration will not scale and are burdensome to both Developers and Data Holders. Anticipating the explosion in the use cases that involve 3rd party applications a group of Connectathon Attendees prepared a reference paper (attached) that describes the business problem and some of the technical approaches that have been explored to date.</p>\n<p>On March 26th in Washington, DC we will be continuing the discussion at <a href=\"http://HealthCa.mp\" target=\"_blank\" title=\"http://HealthCa.mp\">HealthCa.mp</a>.  Intentionally reaching out to all stakeholders one of the goals of this event will be to expand on both the business case and technical considerations related to the topic of establishing trustworthy scalable trust that enables FHIR-based interoperability across the healthcare eco-system.  </p>\n<p>To learn more please go to <a href=\"https://www.academyhealth.org/page/2019-hdp-pre-conference-events\" target=\"_blank\" title=\"https://www.academyhealth.org/page/2019-hdp-pre-conference-events\">https://www.academyhealth.org/page/2019-hdp-pre-conference-events</a> and scroll to the bottom of the page.</p>\n<p><a href=\"/user_uploads/10155/gz_ANLofxLXwYg-z2pF8vkl-/DRAFT-v7-Scaling-Dynamic-Client-Registration-and-Endpoint-Discovery-for-Open-APIs.docx\" target=\"_blank\" title=\"DRAFT-v7-Scaling-Dynamic-Client-Registration-and-Endpoint-Discovery-for-Open-APIs.docx\">DRAFT-v7-Scaling-Dynamic-Client-Registration-and-Endpoint-Discovery-for-Open-APIs.docx</a> </p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"192628\">@Alan Viars</span></p>",
        "id": 160579316,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1552403943
    },
    {
        "content": "<p>(Thanks for the @-mention, and wish I could be there for this -- instead I'm presenting Sync for Science at AMIA in SF. Too many health events in one week! Anyway, I look forward to catching up post-meeting.)</p>",
        "id": 160616363,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1552429431
    },
    {
        "content": "<p>I would also love to be there but 7x in USA is enough for one year</p>",
        "id": 160640106,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552460078
    },
    {
        "content": "<p>We will do our best to document the outcomes.  If you guys have any way of letting others know about the event please do. ONC's Steve Posnak did a presentation today that points to a lack of standards in this Area. I think there is a growing recognition that we need an open, scalable, standards-based process that is able to be extended to support all kinds of use cases in a uniform way!</p>",
        "id": 160736295,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1552519122
    }
]