[
    {
        "content": "<p>Comments welcome here in what my response should be to this: <a href=\"https://medium.com/@Connected_Dots/grahame-5289fa4b4f3d#.2le62ec45\" target=\"_blank\" title=\"https://medium.com/@Connected_Dots/grahame-5289fa4b4f3d#.2le62ec45\">https://medium.com/@Connected_Dots/grahame-5289fa4b4f3d#.2le62ec45</a></p>",
        "id": 153871181,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486975906
    },
    {
        "content": "<p>Just a couple things that appear evident to me, if I start from FHIR being a global/comprehensive standard (Geographically and functionally):<br>\n1. I fully agree that FHIR should enable a patient to view their info, but that is not the sole goal of FHIR. That is one use case/corollary. I would say that when making standards, we should not constrain the scope of what we want to standardize.<br>\n2. Isn't NDC/Rx-Norm US-specific? What is the proposal - to make one implementation that works for those?  If the goal is to make sure we have \"one standard medication list\", it seems that this is a somewhat limited scope. Limiting the scope is not a good idea. There are sevelar analysis out there that show the variety of such lists, and as experts go into that, it seems clearer and clearer that there is no single, easy to define medication list. I dont think that this is such a simple thing to achieve in a standard way. FHIR does support a variety of lists, but should not take the burden of standardizing a list.</p>",
        "id": 153871187,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1486979520
    },
    {
        "content": "<p>thx. Perhaps there's a place for a 'patient access to data service' like there is for a terminology service. It would build on Argonaut and be prototyped by CARINHealth (I think I'm allowed to mention that in public now ;-)). I don't know whether it would be US specific or not.</p>",
        "id": 153871190,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486980080
    },
    {
        "content": "<p>you might want to comment about medications.... medications is a different kind of problem</p>",
        "id": 153871191,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486980092
    },
    {
        "content": "<p>It's a nice point but how many more people will come out of the woodwork all wanting to adjust the scope? Baby steps, I think.</p>",
        "id": 153871192,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1486980145
    },
    {
        "content": "<p>I'm a bit perplexed that the first point focuses on printing - I would have thought that if the information is readily available electronically there would be little need for printing. Hopefully, it's not to be able to then fax the information. </p>",
        "id": 153871201,
        "sender_full_name": "David McKillop",
        "timestamp": 1486983521
    },
    {
        "content": "<p>it's just frustration, I think: just get me *something*</p>",
        "id": 153871202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486983628
    },
    {
        "content": "<p>on medication: people ask \"a medication list\" which seems simple until the first questions: \"obtained from prescriptions? or from dispenses? or from patient statements?\". Even the (apparently) simplest cases of \"active medications\" or \"current medications\" have different answers. In projects, we  can make those decisions, but hardly in standards.<br>\nin other words, every project can say \"we will have this flavour of medication list\", but on a standard we cannot say \"other flavours cannot be obtained\". there is extensive analysis on that, and we cannot think that someone will finally impose one single flavour to start with.</p>",
        "id": 153871204,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1486984333
    },
    {
        "content": "<p>note: Medication Records and medication lists are not the same.</p>",
        "id": 153871205,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1486984471
    }
]