[
    {
        "content": "<p>Not sure where this should go so I'll put it here for the moment:  what do we make of this?</p>\n<p><a href=\"https://www.bioportfolio.com/news/article/4173473/NCPDP-Experian-Health-Announce-100-of-the-U-S-Population-Has-a.html\" target=\"_blank\" title=\"https://www.bioportfolio.com/news/article/4173473/NCPDP-Experian-Health-Announce-100-of-the-U-S-Population-Has-a.html\">NCPDP &amp; Experian Health Announce 100% of the U.S. Population Has a Universal Patient Identifier, Powered by Experian Health UIM and NCPDP Standards</a></p>\n<p>My friend @DrNic1 <a href=\"https://twitter.com/drnic1/status/1209485132308078596\" target=\"_blank\" title=\"https://twitter.com/drnic1/status/1209485132308078596\">tweeted on Dec 24</a> that the patient can't know or see the identifier. What the heck?</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/drnic1/status/1209485132308078596\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/623192492029022208/Yx-kbGbI_normal.jpg\"></a><p>So how exactly does this work…?\n<a href=\"https://twitter.com/Experian\" target=\"_blank\" title=\"https://twitter.com/Experian\">@Experian</a> has assigned everyone a \"Universal Patient Identifier\" but you can't see it or know it\n#Interoperability \n<a href=\"https://t.co/g4XMIJNHyH\" target=\"_blank\" title=\"https://t.co/g4XMIJNHyH\">http://bit.ly/2ZaMVYI</a></p><span>- Nick van Terheyden, MD - \"Dr Nick\" (@drnic1)</span></div></div>",
        "id": 185699504,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579096888
    },
    {
        "content": "<p>That would be a cross-reference index value. Not unusual, but also not a \"solution\".  Within the IHE XDS (Cross-Enterprise Document Sharing) there is an \"Affinity Domain Identifier\" that is a business identifier for each unique patient within the network, with a Patient Identity Cross-Reference (PIX) service that converts any local domain patient identity into that Affinity Domain Identifier. This value is just an identifier, not a set of attributes. <br>\nThis same concept is often in the background of many centeralized, decenteralized, and distributed systems.</p>",
        "id": 185700079,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579097227
    },
    {
        "content": "<blockquote>\n<p>This same concept is often in the background of many centeralized, decenteralized, and distributed systems.</p>\n</blockquote>\n<p>So there's actually nothing innovative about this, except in the private little world of those two players?</p>",
        "id": 185700288,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579097367
    },
    {
        "content": "<p>Yep, they've created their own private \"universal\" MRN</p>",
        "id": 185702295,
        "sender_full_name": "David Pyke",
        "timestamp": 1579098652
    },
    {
        "content": "<p>Is there a better place on Zulip to discuss this?  I searched \"patient identifier\" and got nothing but this.</p>",
        "id": 185703346,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579099278
    },
    {
        "content": "<p>Are Experian or NCPDP (specialty pharmaceuticals) involved with FHIR at all?  I've done speeches for each of them ... might be able to reach out to them to align everyone's public messaging. </p>\n<p>From the thread here, I have the impression (from <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>) that they've announced THEIR own unique identifiers, which are literally of no use to anyone else.  Is that correct?  If so, all they've announced is the equivalent of a patient number in their ecosystem, or a MRN (medical records number) in a hospital - not \"universal\" in any way. Correct?</p>\n<p>Does HL7 have a formal definition of what a unique pt identifier would be?  Seems to me this is a legit occasion to speak out, because healthcare Twitter's already confused by this.</p>",
        "id": 185704456,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579099898
    },
    {
        "content": "<p>hard to fight marketing like Experian... It is likely best to let them stumble on their own feet</p>",
        "id": 185705578,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579100542
    },
    {
        "content": "<p>'uniqueness' of an ID is always within a certain context: a medical device, a provider organisation, a country. The latter is the best one can hope for right now. A truly universal unique Id would be something like  a hash-code of your DNA. <br>\nMany countries that mandate the use of ID cards for absolutely everthing have country level unique citizen ids. The identifier itself is pretty useless without the ID card. In the US, where the system of common law doesn't mandate the use of official IDs (not to the same degree as in most napoleonic/roman law systems), it's difficult to create a nationwide patient identifier without backing it up with an official ID card. No ID cards means the number itself will have a value, much like a US SSN.  <br>\nDisclaimer: I'm from a country with napoleonic law - so I'm biased in favor of unique national identifiers and the near universal use of ID cards.</p>",
        "id": 185707090,
        "sender_full_name": "René Spronk",
        "timestamp": 1579101466
    },
    {
        "content": "<p>Even the DNA changes... :)</p>",
        "id": 185716716,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579106834
    },
    {
        "content": "<p>So, we've all agreed that a Universal ID is impossible, therefor we should stick with national IDs and create eMPIs for them with the WHO holding the eMPI servers.</p>",
        "id": 185718241,
        "sender_full_name": "David Pyke",
        "timestamp": 1579107539
    },
    {
        "content": "<p>blockchain</p>",
        "id": 185718574,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579107694
    },
    {
        "content": "<p>...or keep pushing forward with Distributed Identities and make something that patients can use to maintain their own identity.</p>",
        "id": 185720171,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1579108529
    },
    {
        "content": "<blockquote>\n<p>Even the DNA changes... <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n</blockquote>\n<p>Yeah, it kinda fried my brain when I learned that a few years ago.  What implications.  So much for certainty!  (yet again)</p>",
        "id": 185748167,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579125035
    },
    {
        "content": "<blockquote>\n<p>So, we've all agreed that a Universal ID is impossible, therefor we should stick with national IDs and create eMPIs for them with the WHO holding the eMPI servers.</p>\n</blockquote>\n<p>Does that \"so\" denote snark, or are you summarizing something that the FHIR community decided a few years ago, for real?</p>",
        "id": 185748294,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579125136
    },
    {
        "content": "<p>HL7 has no authority for a decision like that nor could we come to agreement about that. So I think it's just a general observation about how people are acting</p>",
        "id": 185753251,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1579128839
    },
    {
        "content": "<blockquote>\n<p>it's just a general observation about how people are acting</p>\n</blockquote>\n<p>Perfect - that's what I would have guessed.  So, <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>, iIs this an accurate paraphrase of your meaning?<br>\n\"The world seems to have agreed ...\n* ... that a universal / reliably unique patient ID is impossible, \n* ... so let's stick with unique IDs within countries ...\n* ... and create eMPIs <strong>between</strong> them (eMPI = mapping tables, right?)\n* ... with WHO holding the mapping table servers</p>\n<p>Or does \"the world seems to have agreed\" apply only to the first bullet, and the rest is YOUR view? :-)</p>",
        "id": 185829266,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579190909
    },
    {
        "content": "<p>It's just my (snarky) view.  The problem with going past national borders would be huge and isn't in any way within HL7's ability to weigh in on.  While some countries have national and/or regional IDs, there is no consensus (or discussion that I've seen) about going to an international level ID</p>",
        "id": 185829555,
        "sender_full_name": "David Pyke",
        "timestamp": 1579191066
    },
    {
        "content": "<p>So, anyway, to wrap up this thread - it appears that what Experian and NCPDP announced is nothing \"universal\" at all - it really is just their own private \"customer number,\" figuratively speaking, and is of no value to anyone else because only they can see it.  </p>\n<p>So it seems.  If anyone finds out anything to the contrary, please let us/me know!</p>",
        "id": 185830705,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579191623
    },
    {
        "content": "<p>If we look at the EU, then the patient identifier used for cross border communications is (essentially) the tuple (country code, national [single country] patient id). Healthcare systems have a tendency to assign their own identifiers anyway, next to [hopefully] storing the [other country's] identifier.<br>\nIn countries like Estonia and Norway a person is assigned a citizen identifier at birth - it's created by a national webservice, once a healthcare provider reports a new birth.</p>",
        "id": 185833957,
        "sender_full_name": "René Spronk",
        "timestamp": 1579193359
    },
    {
        "content": "<p>Same story for Denmark as for Norway</p>",
        "id": 185844189,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1579199374
    },
    {
        "content": "<p>in EU eID is comming up</p>",
        "id": 185844803,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1579199764
    },
    {
        "content": "<p><a href=\"https://ec.europa.eu/digital-single-market/en/e-identification\" target=\"_blank\" title=\"https://ec.europa.eu/digital-single-market/en/e-identification\">https://ec.europa.eu/digital-single-market/en/e-identification</a></p>",
        "id": 185844832,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1579199770
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> unless the Identifier from NCPDP &amp; Experian Health is used and carried through interoperating systems, the identifier in itself is close to worthless.</p>",
        "id": 185845596,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1579200156
    },
    {
        "content": "<p>I expect Experian would productize such an ID for health systems and vendors to use. We're constantly asked for such a service by patient facing applications.</p>",
        "id": 186120371,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1579541218
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> unless the Identifier from NCPDP &amp; Experian Health is used and carried through interoperating systems, the identifier in itself is close to worthless.</p>\n</blockquote>\n<p>That was my point, exactly, higher in the thread. It's a bit disingenuous to brag about it being \"universal\" if it's not universally available - a market reality that's reflected by how many people responded on Twitter &amp; LinkedIn saying \"Wow, this will really change things!\"</p>",
        "id": 186125913,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579546785
    }
]