[
    {
        "content": "<p><a href=\"https://wolandscat.net/2019/09/06/why-using-hit-standards-fails-to-achieve-interoperability/amp/?__twitter_impression=true\" target=\"_blank\" title=\"https://wolandscat.net/2019/09/06/why-using-hit-standards-fails-to-achieve-interoperability/amp/?__twitter_impression=true\">https://wolandscat.net/2019/09/06/why-using-hit-standards-fails-to-achieve-interoperability/amp/?__twitter_impression=true</a></p>\n<p>Curious about people's thoughts here. He likes to periodically shoot one over the bow.</p>",
        "id": 175071352,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1567781097
    },
    {
        "content": "<p>there are some valid points but my reading is that the tone seems like: \"if you start with standards, you are doomed\", and \"only when all systems have a common architecture we can achieve interoperability\".</p>",
        "id": 175072087,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1567781554
    },
    {
        "content": "<p>I do not think that is a good message. <br>\nIMO, Interoperability does not mean everyone has the same way of working. <br>\nI like more to think <br>\n\"while I have my ways of working and you have your ways of working, we must be consistent for the things where we collaborate, but the rest we can do whatever however we want\".</p>",
        "id": 175072443,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1567781815
    },
    {
        "content": "<p>We should have a consistent information model (which is not the same as one information model).</p>",
        "id": 175072636,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1567781914
    },
    {
        "content": "<p>I think the article has a tone that sounds slmost like \"until a universal model is ready, HIT standards are not really useful\". which i disagree. we don't have to all speak one same language to understand each other.</p>",
        "id": 175072915,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1567782091
    },
    {
        "content": "<p>others?</p>",
        "id": 175072931,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1567782101
    },
    {
        "content": "<p>Web services from many sites (google to outlook, apps using apple, android, etc) seem to interoperate just fine even though both underlying storage, models, and business approaches are completely different</p>",
        "id": 175075434,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1567783782
    },
    {
        "content": "<p>apps that combine data from social feeds...</p>",
        "id": 175075507,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1567783808
    },
    {
        "content": "<p>There are a lot of reasons there is added complexity (eg: regulatory) for healthcare, but finance has similar concerns and is light years ahead of us</p>",
        "id": 175075651,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1567783918
    },
    {
        "content": "<p>I think the interop area in healthcare is changing right now for many reasons, and seems to be getting much better. Using a standard specification/web spec under the covers is allowing  many more players into the market that were prevented entry before</p>",
        "id": 175075773,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1567784022
    },
    {
        "content": "<p>I don't think that the data models need to be the same, but they need to be mappable.  I.e. it must be possible to transform the internal models into a common model for sharing purposes.  In addition, the business processes need to be sufficiently aligned that the data can be consumed and understood sensibly (and ideally efficiently).</p>",
        "id": 175075914,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567784112
    },
    {
        "content": "<p>The degree of interoperability achievable is going to vary by the participants because the reality is that there are differences in the way care gets delivered - at least around the edges.  Certain elements needed in Saudi Arabia or Japan aren't going to be captured in the U.S. and vice versa.  Trying to communicate prior authorizations from the US to the UK probably isn't going to work well either.  But for many of the 'important' things - vitals, drugs, labs, etc. there's opportunity to get much more data flowing than we have because common intermediary models transformable to by both parties are possible.   Some transformations can be lossless.  Some can be lossy.  But if a transformation is achievable (and actually created), then data can flow.</p>",
        "id": 175076158,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567784319
    },
    {
        "content": "<p>of course as standards geeks, we are bias... I am happy with this bias, as it is proven through centuries of successful standards</p>",
        "id": 175080312,
        "sender_full_name": "John Moehrke",
        "timestamp": 1567787187
    },
    {
        "content": "<p>I would disagree with the title 'Failure of HIT Standards' and suggest that he doesn't seem to understand the basic premise of what he is writing about. Standards have been achieved in many domains, from inter networking to healthcare and others. Each standard builds upon other standards to improve the functionality that we can achieve. Take the IETF and those standards as an example. When I started working with them the standards were more along the lines of TCP, IP, etc. Then standards focused on HTTP, MIME, etc. With each layer of additional standards we increased the domain and the amount of interoperability that we could achieve.<br>\nI think of the <a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a> and various other healthcare standards in much the same way. With hl7 v2, DICOM, etc. we were able to achieve a massive increase in interoperability over what we had before. Was it the end-all be-all? Of course not, but it made a big dent in the problem and helped us define the next layer that needed to be worked on. We are working on that layer now with FHIR. Will it help us move to the next level? It seems like it is already doing so. Is it perfect? Absolutely not, has a long way to go, but it's a start. Will we need even more standards in addition? I would assume so as we will likely want to do more and achieve greater things than we will find possible with this level of integration.</p>",
        "id": 175090293,
        "sender_full_name": "Brian Zimbelman",
        "timestamp": 1567794254
    },
    {
        "content": "<p>For me, the blog demonstrates a failed understanding of the real world; the essential problem is a business failure, not an informatics failure, and pushing a single informatics solution will exacerbate the problem.</p>",
        "id": 175098636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567800077
    },
    {
        "content": "<p>It's not even necessarily a \"failure\" - different cultures, different environments are going to realistically have varying needs.  \"Full\" interoperability - where everything is done consistently regardless of context isn't viable because the reality of different environments means that things that work in one space simply won't work in others.  That said, there can be a business failure where incentives discourage people/organizations from doing things consistently/better because the business models incent the opposite</p>",
        "id": 175106492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567806284
    },
    {
        "content": "<p>The notion that 'de facto' standards will succeed where actual standards have (allegedly) failed seems illogical to me. I agree with Grahame that this is basically a business level problem; interoperability is an outcome that has to be driven by the key stakeholders - clinicians, consumers, regulators, funders, etc. Attempting to achieve this at the system architecture level is akin to digging a hole with the wrong end of a shovel.</p>",
        "id": 175106599,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1567806403
    },
    {
        "content": "<p>The blog brings up some interesting points but misses the mark.   First, the healthcare domain is much (MUCH) more complicated than most every other domain where standards have been 'more successful'.   The example of financial domain is not an apples-to-apples comparison --- the financial domain is based on human-designed rules and it is mathematically precise as well as the fact that the business rules are more universally agreed upon and understood.   Second, the healthcare domain has been using ontologies and coding sets for a long time, I just posted a link to a 1999 article from JAIMA that talks about these coding systems and the inherent problem with coding systems, especially in the healthcare domain where new knowledge is constantly being added (unlike other domains there the knowledge base and therefore coding needs are relatively static).  Also, his supposition that we (healthcare community) just write standards and try to 'find a place to put them' instead of architectural design is plain bunk (or meant to raise heat from his blog post).   Healthcare standards like HL7 (v2), DICOM, IEEE-11073, etc. have been developed to meet real needs and raise the bar of interoperability that did NOT exist before these standards were in place.   Who remembers the days of trying to get two HIS systems or Lab and HIS system to talk to each other before HL7 (v2) or trying to exchange diagnostic images before DICOM, etc.    I've got to wonder where this blogger got his perspective on this ...</p>",
        "id": 175137056,
        "sender_full_name": "John Silva",
        "timestamp": 1567855458
    },
    {
        "content": "<p>He sees all that as wasted work because it's not at the database level. He's dogmatically addicted to the idea, so anything less is not good enough.</p>\n<p>Is he conceptually right that his vision might be more effective? Perhaps. But it's entirely unrealistic.</p>",
        "id": 175147610,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1567875322
    },
    {
        "content": "<p>some people just know better. Tom's going to be in Atlanta</p>",
        "id": 175155168,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567889645
    },
    {
        "content": "<blockquote>\n<p>standards meetings at HL7, CEN and occasionally OMG</p>\n</blockquote>\n<p>Occasionally I'd like to attend some OMG meetings myself</p>",
        "id": 175162689,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1567904733
    },
    {
        "content": "<p>Here's a question: if the humans involved don't have <em>mental</em> interop (agreement on semantics), how could one possibly expect the IT to achieve it?</p>\n<p>As a naive patient observer who thought the healthcare system that had saved my life was magnificent, I was shocked and disillusioned to discover that (for instance) every EMR user is allowed to configure its system with wildly varying protocols and even definitions. It's ludicrous to expect fully automated transfer of the information in those differently configured systems and end up with the same \"meaning\" at the receiving end. </p>\n<p>But - At least as important is the question of who wants interop and why. Without knowing that, it's bogus to declare a \"failure.\" And in my view the purpose of interop is to serve the needs (as best we can) of the people who are hobbled by lack of access to information and knowledge that's stored in different places. That includes patients who are hobbled by lack of it as well as clinicians.</p>\n<p>I assert that if those people's needs are better served with a given exchange capability than without, things have improved, and it's silly to declare failure.</p>\n<p>This is one example of why I think we need to start collecting success stories, in which some concrete example of interop enabled a clinical result that would not have been possible before. </p>\n<p>And I totally, totally agree that it's beyond silly to compose healthcare systems with money systems. One is incredibly finite and the other is packed with unknowns AND constantly evolving knowledge.</p>",
        "id": 175189622,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1567958060
    },
    {
        "content": "<p>I mean, how can you declare failure if there's no absolute definition of success?</p>",
        "id": 175189644,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1567958123
    },
    {
        "content": "<p>The thing is, even if we as humans were to agree upon a single best-practice way of treating certain illnesses, and support it in health IT (in all health IT systems) by fixing the UIs, the protocols, workflows and the data standards, we'd also be stifling innovation. As such we can complain about the differences, but we'll have to accept this is a way to ensure that, in the looong run, clinical best-practices do improve.</p>",
        "id": 175219002,
        "sender_full_name": "René Spronk",
        "timestamp": 1568012054
    }
]