[
    {
        "content": "<p>A while ago I discussed (with <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, among others) the idea of creating a series of TED-like talks FHIR for Executives, Clinicians, Patients etc. <br>\nMy take on the \"FHIR for Executives\"  presentation, <a href=\"https://vimeo.com/112905640\" target=\"_blank\" title=\"https://vimeo.com/112905640\">https://vimeo.com/112905640</a> , a 21-minute video. Based on materials/stories by Grahame, Lloyd, David, and e-Patient Dave, mixed with my own stuff. This version, created during an HL7 Norway event in Oslo, replaces an earlier video I created in 2014 on the same subject. <br>\nFHIR for (health IT) executives is relatively easy, I challenge others to create a 20-minute FHIR for Clinicians (David?), FHIR for policy makers (Grahame?) or FHIR for Patients (Dave?) talk.</p>",
        "id": 162222219,
        "sender_full_name": "René Spronk",
        "timestamp": 1554110836
    },
    {
        "content": "<p>ok you're on. challenge accepted. but what makes it a ted talk?</p>",
        "id": 162222357,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554110952
    },
    {
        "content": "<p>I'm up for it of course but I face an overwhelming swarm of possible things to say - so I need help. I suspect Grahame is right when he says care coordination / care planning will be the compelling use case that gets attention. But I'm really unsophisticated so I welcome other thoughts!</p>",
        "id": 162222611,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554111162
    },
    {
        "content": "<p>I think a group of us should work on scripting this (Dave on FHIR for Patients) at DevDays in Redmond</p>",
        "id": 162223096,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554111627
    },
    {
        "content": "<p>around a few beers</p>",
        "id": 162223107,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554111636
    },
    {
        "content": "<p>Dave will be in Redmond blogging and interviewing people ;-)</p>",
        "id": 162223142,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554111659
    },
    {
        "content": "<p>I plan to do some video interviews at DevDays as well. <br>\nWhat makes a TED talk a TED talk ? There are probably some formal criteria somewhere (\"I know a TED talk if I see one\" - hard to define rules around them), I meant it in the sense of a 18 minute talk, high level, and a good mixture of ethos, pathos and logos. For pathos I pinched some of your stories, as well as Daves. Whatever works for you. Practice, practice, practice ;-)</p>",
        "id": 162239341,
        "sender_full_name": "René Spronk",
        "timestamp": 1554125855
    },
    {
        "content": "<p>We can even get it recognized as a TEDx -- <a href=\"https://www.ted.com/participate/organize-a-local-tedx-event/before-you-start/tedx-rules\" target=\"_blank\" title=\"https://www.ted.com/participate/organize-a-local-tedx-event/before-you-start/tedx-rules\">https://www.ted.com/participate/organize-a-local-tedx-event/before-you-start/tedx-rules</a></p>",
        "id": 162243229,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554128426
    },
    {
        "content": "<p>TED talks are usually 5-7 minutes, no slides, just talking.</p>",
        "id": 162243555,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554128686
    },
    {
        "content": "<p><a href=\"https://www.ted.com/participate/organize-a-local-tedx-event/tedx-organizer-guide/speakers-program/what-is-a-tedx-talk\" target=\"_blank\" title=\"https://www.ted.com/participate/organize-a-local-tedx-event/tedx-organizer-guide/speakers-program/what-is-a-tedx-talk\">https://www.ted.com/participate/organize-a-local-tedx-event/tedx-organizer-guide/speakers-program/what-is-a-tedx-talk</a></p>",
        "id": 162243689,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554128775
    },
    {
        "content": "<p>Y - either 18, or 8 minutes.. as low a number of slides as you dare to use :-)</p>",
        "id": 162251488,
        "sender_full_name": "René Spronk",
        "timestamp": 1554133880
    },
    {
        "content": "<p>How can I refuse? Perhaps something at devdays?</p>",
        "id": 162273027,
        "sender_full_name": "David Hay",
        "timestamp": 1554148486
    },
    {
        "content": "<p>I'm fairly sure we can find a slot in the agenda ;-) .. I'll bring the video cameras (in addition to anything the organisers may have already in place)</p>",
        "id": 162301252,
        "sender_full_name": "René Spronk",
        "timestamp": 1554177372
    },
    {
        "content": "<p>oops...</p>",
        "id": 162357495,
        "sender_full_name": "David Hay",
        "timestamp": 1554227293
    },
    {
        "content": "<p>just calling your bluff ;-) .. no, I'm sure you can do it. No pressure.</p>",
        "id": 162360243,
        "sender_full_name": "René Spronk",
        "timestamp": 1554229051
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> would be excellent.. Ill provide applause.... and laughing....</p>",
        "id": 162434366,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554301624
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> your parameters of a Ted talk don’t match mine :-)</p>",
        "id": 162451722,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554314006
    },
    {
        "content": "<p>Whether or not we call it TED-like, let's think what we want. The following is my own view, lacking the domain knowledge of most of you, though I do know something about getting an idea across in a few minutes. A partial list of criteria for our TEDs -</p>\n<ul>\n<li>\n<p>concise, because attention spans are limited. (Since my 16 minute talk (on this date in 2011!), TEDs have gotten shorter and shorter, because their secret analytics were showing that very few people watch ANYthing to the end.)</p>\n</li>\n<li>\n<p>thus, we should focus on engendering what I'd call informed curiosity: a viewer who SHOULD become interested will get it, and will have an itch to know more.</p>\n</li>\n<li>\n<p>this means the intial value proposition(s) we put forth must be conveyed clearly - and must be verifiable pretty soon once s/he takes action to learn more. (Important: this means an initial value prop shouldn't necessarily be what WE think is the <em>ultimate</em> potential: the long-term potential may be too abstract or distant to spark action, amid the executive's many other priorities. </p>\n</li>\n</ul>\n<p>Remember that we want ACTION, which is not true of most TED Talks. (True?) We must thus think behaviorally.  This opens the whole fields of persuasion and behavioral economics as assets in planning the message.</p>\n<p>Or are we not seeking to have them act?? In the case of executives, or do we only want them to get out of the way and authorize their worker bees to do more FHIR stuff?</p>\n<p>That's enough for now ...</p>",
        "id": 162460737,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554319608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  It's already been done: <a href=\"https://vimeo.com/112905640\" target=\"_blank\" title=\"https://vimeo.com/112905640\">https://vimeo.com/112905640</a></p>",
        "id": 162475225,
        "sender_full_name": "David Hay",
        "timestamp": 1554329927
    },
    {
        "content": "<p>I'm off the hook...</p>",
        "id": 162475262,
        "sender_full_name": "David Hay",
        "timestamp": 1554329969
    },
    {
        "content": "<p>Nope, your're not: my suggestion was for you to create a \"FHIR for Clinicians\" - which has overlap with a FHIR-for-Executives, but it's not the same. Mine is really a \"FHIR for Health IT executives\". I did suggest Grahame to create a \"FHIR for policy makers\" given his many discussions with policy wonks. We need better pitches aimed at specific audiences.<br>\nSo how would you tackle a \"FHIR for Clinicians\" talk, assuming a general, not particularly technical savvy, not particularly knowledgeable audience when it comes to interoperability ? That's a real challenge - one that can only be tackled by someone who knows that target audience relatively well. <br>\n\"FHIR for Patients\" - now that's a challenge. The USPs will be very different than the ones in the other talks.</p>",
        "id": 162499723,
        "sender_full_name": "René Spronk",
        "timestamp": 1554360919
    },
    {
        "content": "<blockquote>\n<p>\"FHIR for Patients\" - now that's a challenge. The USPs will be very different than the ones in the other talks.</p>\n</blockquote>\n<p>Yes, yesterday in another stream somewhere [how does one keep track of such things??] I was quickly convinced that it will be all about the use cases - which one(s) will be the \"killer app\" (horrible term in medicine!) that lead ordinary people out there to pop their eyes open?  </p>\n<p>Care coordination is one - pulling together info from multiple providers, sometimes to blend the info streams and sometimes to create a \"dashboard\" of one's own, as Kristina and Kate Sheridan did.</p>\n<p>Chart errors (finding &amp; fixing) is another, since chart errors are a plague that can clearly cause harm. </p>\n<p>In <a class=\"stream\" data-stream-id=\"179262\" href=\"/#narrow/stream/179262-patient-empowerment\">#patient empowerment</a> I just started a stream \"Patient/caregiver use cases\" and started with <a href=\"#narrow/stream/179262-patient-empowerment/topic/Patient.20.2F.20caregiver.20use.20cases/near/162518452\" title=\"#narrow/stream/179262-patient-empowerment/topic/Patient.20.2F.20caregiver.20use.20cases/near/162518452\">a first submission</a> on chart errors.</p>",
        "id": 162519739,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554381199
    },
    {
        "content": "<p>Seriously, whether or not we call it TED-like, let's think what we want. The following is my individual view, lacking the domain knowledge of most of you, though I do know something about getting an idea across in a few minutes. Our pseudo-TEDs should be:</p>\n<ul>\n<li>\n<p>concise, because attention spans are limited. (TEDs have gotten shorter because<br>\ntheir secret analytics were showing very few people watch ANYTHING to the end.)</p>\n</li>\n<li>\n<p>Thus, focus on engendering what I'd call informed curiosity: someone who SHOULD become interested will, and interested to the point where they have an itch to know more.</p>\n</li>\n<li>\n<p>This means the initial value proposition(s) we put forth must be conveyed clearly - and must be verifiable once the viewer decides to learn more. (Important: this means an initial value prop should not necessarily be what we think is the biggest long term potential; that may be too abstract to spark action now, amid an executives other priorities. The time-to-value should be credible and within sight, logistically if not chronologically.)</p>\n</li>\n</ul>\n<p>Note that in our case we, unlike most TED Talks, want to spark action, engagement. </p>\n<p>Or are we not seeking to have them act?? Do we only want them to get out of the way and authorize their worker bees to do more FHIR stuff?</p>\n<p>That's enough for now...</p>",
        "id": 171189247,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1563469294
    }
]