[
    {
        "content": "<p>Hi, I’m building a medical app (a small EMR), frontend is done in HTML/JS/Bootstrap and now I want to store my data in a FHIR server (MongoDB, PostgreSQL or MS SQL). I have read <a href=\"http://wiki.hl7.org/index.php?title=Open_Source_FHIR_implementations\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Open_Source_FHIR_implementations\">http://wiki.hl7.org/index.php?title=Open_Source_FHIR_implementations</a> but I don’t know if it’s production ready? Does FHIR is ready for production out of the box? Thanks!</p>",
        "id": 153866453,
        "sender_full_name": "Emmanuel Chevallier",
        "timestamp": 1484216103
    },
    {
        "content": "<p>At minimum you'll need to add in business rules (e.g. prohibitions against duplicates) and security access controls to any of the open source implementations.  The readiness of different open source implementations of FHIR may vary.  It's your reponsibility to define your desired production behavior (including performance and other non-functional requirements) and then evaluate and test whatever implementation solution you choose.  Many (all?) of the open source implementations are in production somewhere, but I don't think any of them are \"out of the box\" because every implementation environment requires some degree of configuration/customization.  They should, however, all support their particular version of FHIR \"out of the box\" from a persistence perspective.  Search capabilities and operation support capabilities will vary.</p>",
        "id": 153866461,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484232201
    },
    {
        "content": "<p>Thanks for your answer Lloyd ! Yes there are business rules like for any other app development. My question is effectively about the readiness of the different open source implementation of FHIR and the search capabilities and operation support capabilities for these different projects. Actually, I will evaluate more deeply SMART-on-FHIR.</p>",
        "id": 153866471,
        "sender_full_name": "Emmanuel Chevallier",
        "timestamp": 1484247710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193228\">@Emmanuel Chevallier</span> You might want to narrow your question to one or two specific open source inplementations you're giving specific consideration to and re-phrase your question to request what sort of implementation experience people have had with them - might get more responses that way :)</p>",
        "id": 153866507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484265998
    }
]