[
    {
        "content": "<p>Hello Dear FHIR professionals! I am Junaid Ahmad MBA-HR. As part of my research assignment, I created this form. It will take about 5 minutes to complete this survey. Feel free to answer the best of your knowledge.<br>\nNote: Your responses will be used only for research purposes. Here's the URL to submit a survey regarding FHIR.<br>\n<a href=\"https://forms.gle/taZTrAsgjrnFVz4s6\" title=\"https://forms.gle/taZTrAsgjrnFVz4s6\">https://forms.gle/taZTrAsgjrnFVz4s6</a></p>",
        "id": 195536772,
        "sender_full_name": "JUNAID AHMAD",
        "timestamp": 1588065145
    },
    {
        "content": "<p>Hi Junaid - thanks for moving this to Social.  </p>\n<p>I used to work in web marketing and an important lesson was that people are much more likely to click &amp; respond if they know what they're getting themselves into, especially  since nobody here knows you (and the internet is full of scammers).  It's also important to let people know how long it will take to respond.</p>\n<p>So, to answer those unspoken questions I'll paste in the questions people will find on your short Google Form:</p>\n<ul>\n<li>Name (optional)</li>\n<li>Your job title *</li>\n<li>Familiarity with FHIR (in years) *</li>\n<li>Which skills and expertise should a fresh graduate gain to get a job in the FHIR using organization? *</li>\n<li>Which skills and expertise should an experienced candidate gain to get a job in the FHIR using organization? *</li>\n<li>What are the areas or skills an employee should improve for career advancement in an organization working on FHIR*</li>\n<li>Which candidate a recruiter prefer for a company that works with FHIR? (Answer should be based on candidate's knowledge, skills, experience) *</li>\n<li>Hiring managers prefer which skills, knowledge, abilities, and expertise in a candidate during hiring for FHIR organization? *</li>\n</ul>\n<p>I will also add that you may get a lot more useful response if you don't make all questions mandatory.  Many times I have abandoned a survey because it kept insisting that I answer things where I really didn't have anything to say. So, they lost all the other data that I had already contributed.</p>\n<p>Good luck -</p>",
        "id": 195548311,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1588072367
    }
]