[
    {
        "content": "<p>Hi all, is there a way for a software (not a specific developer) to be validated as FHIR compatible ?<br>\n in other words is there a FHIR badge for a project?</p>",
        "id": 184655489,
        "sender_full_name": "eyal wolanowski",
        "timestamp": 1577976058
    },
    {
        "content": "<p>This would be something more likely to be a certification of software against one-or-more Implementation Guides. The core specification is intentionally very broad, where IG have use-case constraints that make software far more testable. This certification is an effort of organizations like IHE, starting from the formal testing of IG done at IHE Connectathons. <a href=\"https://www.iheusa.org/ihe-connectathon-overview\" target=\"_blank\" title=\"https://www.iheusa.org/ihe-connectathon-overview\">https://www.iheusa.org/ihe-connectathon-overview</a></p>",
        "id": 184657603,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577977894
    },
    {
        "content": "<p>It's a very narrow context, but I believe <a href=\"https://inferno.healthit.gov/inferno/\" target=\"_blank\" title=\"https://inferno.healthit.gov/inferno/\">Inferno</a> is intended to provide this type of certification as it pertains to the proposed ONC health API certification rule.  While it provides support for that very narrow context, a similar approach could be used for certification against other IGs or even some sort of broad FHIR-based certification.  Tagging <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> in case he has anything else to add.</p>",
        "id": 184669433,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1577987180
    },
    {
        "content": "<p>Technically a server is FHIR conformant if it exposes a CapabilityStatement that declares that it doesn't support FHIR REST, messaging or documents - i.e. that it does nothing at all.  As such, conformance assertions based on the core specification aren't terribly useful.  It almost always makes sense to evaluate systems against specific implementation guides instead.  HL7 doesn't currently conduct certification of FHIR systems against implementation guides, though it's talked about whether or not it should.  Most likely this wouldn't happen until we have HL7-published implementation guides that actually reach normative status - where future changes to the guide are required to be compatible.  Both certification and setting up the testing process require a great deal of effort, so it doesn't make much sense to do that when the specification can be replaced with something that looks fairly different every 1-2 years.</p>",
        "id": 184740142,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578063943
    },
    {
        "content": "<p>Inferno is building a Community Edition which will support much wider context.<br>\n<a href=\"https://github.com/onc-healthit/inferno\" target=\"_blank\" title=\"https://github.com/onc-healthit/inferno\">https://github.com/onc-healthit/inferno</a></p>",
        "id": 184760321,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1578079551
    }
]