[
    {
        "content": "<p>Not sure if this is the right stream.. we are looking to bring on our first ‘hire’: a health IT/FHIR project manager/developer to oversee all our initial projects and curious as to your opinions to what skillsets should I be seeking?   We are a startup, networked marketplace, connecting providers consumers and payers. Individual will receive equity. Thanks 🙏🏻🙏🏻</p>",
        "id": 226804930,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1613652682
    },
    {
        "content": "<p>Project manager and developer are often different skillsets.  Former requires people skills, estimating skills, prioritization, ability to think about the complete set of stages (requirements, development, testing, acceptance, marketing, etc.  Most/all of those are FHIR-independent skills.  Developer will need deep knowledge of the tech stack you're planning to use, understand the difference between what you do internally vs. what needs to appear on the FHIR interface.  Should certainly understand REST interfaces and knowledge of FHIR specifically would be helpful.  Also needs to be someone who's willing to reach out to the community (i.e. here) when they have questions.</p>",
        "id": 226830689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613663447
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  your response is incredibly insightful, thank you for taking the time to share the information with me. Reading your thoughts, it seems a developer would be the ideal candidate. In addition to messaging <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , is there a forum on this chat for FHIR developers and career opportunities? I appreciate this forum I want to make sure I stay within the limits of the intentions of this space.</p>",
        "id": 226834485,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1613664462
    },
    {
        "content": "<p>All advertisements for positions need to go through Grahame and are posted on a specific stream for those looking for opportunities.  In general we don't want this forum used for solicitations.</p>",
        "id": 226838328,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613665726
    },
    {
        "content": "<p>This is very good to know, thank you. Excited to learn more about FHIR  through this community.</p>",
        "id": 226843948,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1613667757
    }
]