[
    {
        "content": "<p>Quoting from an email on the HTTP standards mailing list, about a signfiicant change to HTTP bring debated:</p>\n<p>\"Some years ago I realized that there is a finite amount of code to<br>\nbe backwards-compatible with, and that this amount of code by its<br>\nnature will become smaller and smaller with passing time.</p>\n<p>Looking the other way, there is a potentially infinite amount of<br>\ncode which has not yet been written, and there will be more and<br>\nmore of it as time goes by.</p>\n<p>The obvious conclusion is that being compatible with the future is<br>\nfar more important than being compatible with the past.\"</p>",
        "id": 153837000,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468015685
    },
    {
        "content": "<p>that, btw, is *not* the position of the committee, just an individual member</p>",
        "id": 153837001,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468015707
    },
    {
        "content": "<p>I feel this argument somewhat resonates with some of the discussions within Clinical Genomics. Should people design for the legacy genomic information currently usable in the EHR or should people design for Next Generation Sequencing technologies that eventually might (probably will) make it to the EHR?</p>",
        "id": 153837006,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1468016622
    },
    {
        "content": "<p>very much depends on the probably bit. If you're some magician that can read the future 100%, then of course you should design for the future. But in the real world, the rest of us need to be humble and admit that we mostly have no capacity to predict the future. And the author of that statement above is... prone to over-confidence in his views, shall we say... </p>",
        "id": 153837007,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468016887
    },
    {
        "content": "<p>Clinical Genomics is at least, within FHIR, the strongest candidate for thinking this way, I agree. But hubris comes before a face-plant</p>",
        "id": 153837008,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468016925
    },
    {
        "content": "<p>there is always the \"if the old way is working so well for you feel free to keep using it\" line</p>",
        "id": 153837023,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1468053134
    },
    {
        "content": "<p>(not that I'm saying that excuses will breakage)</p>",
        "id": 153837024,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1468053235
    }
]