[
    {
        "content": "<p>A search of Zulip streams didn't readily find me an obvious place for this, so here, anyone can copy it PRN. :-)</p>\n<p>As we humble consumer-patients start seeing the madness that can be in y'all's databases :-), I have a personal example for you. This gripe is not about the EHR itself; it's about the apparent values in a pharmacy's record.</p>\n<p>Attached is a screen capture of the choices I see for pharmacy when I request a prescription refill on my hospital's home-grown portal (Beth Israel Deaconess).  <br>\n<a href=\"/user_uploads/10155/ynfJZyVyKAlXajt-tZGPx5fN/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ynfJZyVyKAlXajt-tZGPx5fN/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/ynfJZyVyKAlXajt-tZGPx5fN/pasted_image.png\"></a></div><p>I did not recognize RightSource, nor did I see what I actually know is my Medicare drug plan, Humana.  (Note that Humana encourages me to use its app, which I do, which does not mention \"RightSource.\")   Only a call to my hospital's portal people revealed that RightSource is what Humana calls its own pharmacy!  Then I remembered having seen that in the pile of paper they sent 4 years ago.</p>\n<p>Lesson: we must be prepared that merely SHOWING us all data fields in our records may not be sufficient for us to know what's going on. This is one tiny example of how perfectly moving the data around won't be sufficient for us to know what's going on. We must always, always check with TUS (The Ultimate Stakeholder, my TLA for the patient/carer), asking: \"Is this working for you?\"</p>",
        "id": 176211991,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568999644
    },
    {
        "content": "<p>HA HA HA HA HA HA<br>\nHA HA HA HA HA HA , oh, Friday ROFL!</p>\n<p>The refill clerk just called and asked: \"Is RightSource also called Humana??\" </p>\n<p>SHE doesn't know what RightSource is, either.</p>",
        "id": 176217145,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1569002982
    }
]