[
    {
        "content": "<p>Hi All, I'm very new here. </p>\n<p>A little about my startup:</p>\n<p>I work for a startup in the chiropractic industry, which is as I'm sure you all know not well regulated with specs etc. We have built a product that allows chiropractic providers to fill in some patient information (or pull from their EHR - not FIHR based), fill in the patient's insurance info (custom format), create some care plan templates (custom format), define some codes (cpt codes, again custom format), define the cost of the codes for various profiles / insurance providers (again custom format), and then compute the estimated cost of the care template for a given patient with a given start date. The careplan then either is accepted or not accepted. </p>\n<p>I recently stumbled across FHIR/hl7 and was shocked I hadn't heard of it before and was really upset that I hadn't because it \"seems\" like all the data models I had been defining already exist in a much better way for the entire health care industry! This is amazing. </p>\n<p>However, I'm having an issue. The documentation is sparse and what does exist is beyond dense. To make matters worse the courses available (i.e., <a href=\"http://fire.ly\">fire.ly</a>) are expensive. I need to evaluate and build a PoC/MVP to figure out if FHIR spec works for my company. I'm played around a little bit with FHIR API on Azure and other server implementations, but again the documentation on how to use the data models is lacking (from what I can tell). </p>\n<p>I'm mostly interested in some of the workflow module items. Such as:</p>\n<ul>\n<li>how do you utilize something like a PlanDefinition to be applied to a CarePlan for a given user/start date? </li>\n<li>storing insurance information: deductibles / deductible contributions, copays, how many covered visits are left, etc? </li>\n<li>storing codes / cost of codes ( I see mentions of CodeSystems )</li>\n</ul>\n<p>Any other recommendations on steps to take to accomplish something like my company abstract/summary states above? Videos? Articles? Any help would be greatly appreciated!</p>",
        "id": 215487858,
        "sender_full_name": "James Gilchrist",
        "timestamp": 1604425668
    },
    {
        "content": "<p>There are wonderful tutorials on FHIR via youtube (search for devdays).  Some of your other questions can be answered via the Financial modules overview and the resources themselves you can ask specific questions in <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> or for financial based issues in <a class=\"stream\" data-stream-id=\"208600\" href=\"/#narrow/stream/208600-financial\">#financial</a> and of course terminology questions in <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a></p>",
        "id": 215488276,
        "sender_full_name": "David Pyke",
        "timestamp": 1604425834
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> I appreciate the reply. Any recommndation on the workfow module? I've read through a lot of the documentation on hl7  website, but am still left a bit confused.</p>",
        "id": 215488497,
        "sender_full_name": "James Gilchrist",
        "timestamp": 1604425928
    },
    {
        "content": "<p>THe <a href=\"http://hl7.org/fhir/workflow-module.html\">http://hl7.org/fhir/workflow-module.html</a> is fairly good but requires a base understanding of FHIR first.</p>",
        "id": 215488722,
        "sender_full_name": "David Pyke",
        "timestamp": 1604426038
    },
    {
        "content": "<p>Welcome <span class=\"user-mention\" data-user-id=\"361596\">@James Gilchrist</span> :)  Glad you found us - and we'd welcome suggestions about how to create greater awareness of FHIR in the Chiropractic and other \"allied medicine\" disciplines.</p>\n<p>Deriving care plans from PlanDefinition is somewhat of an 'advanced' action.  I believe there are some implementation guides that tackle that in more detail (<span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?).  In terms of insurance information, a lot of what's been done to this point is about submitting claims/prior auths, not necessarily representing the full detail of deductibles, etc.  However, I believe the ExplanationOfBenefit resource should cover most of that for you.  The <a href=\"http://hl7.org/fhir/us/carin-bb\">Carin-blue button</a> would be a good starting point if you're U.S.-based.  As well, you may be interested in some of the Da Vinci implementation guides, in particular <a href=\"https://build.fhir.org/ig/HL7/davinci-crd\">CRD</a>, <a href=\"https://build.fhir.org/ig/HL7/davinci-dtr\">DTR</a> and <a href=\"https://build.fhir.org/ig/HL7/davinci-pas\">PAS</a>.  (One thing you'll quickly learn about the HL7 community is that we <em>love</em> acronyms :&gt;)</p>\n<p>In terms of storing codes and associated costs, there's a new resource called <a href=\"http://build.fhir.org/chargeitemdefinition.html\">ChargeItemDefinition</a> intended to handle that, but it's very new and not well exercised yet.  If you find issues, be sure to report them as it's quite possibly \"us, not you\".  Representing costs in CodeSystems is also possible, but probably not the preferred approach as it doesn't necessarily let you easily maintain at the granularity that would be most desirable.</p>\n<p>In terms of getting up to speed, David's recommendation of using the DevDays videos is a good idea.  And if you want really good bang for your buck, coming to the European DevDays isn't necessarily a bad deal given that it's 4 days of content that covers all of the latest and greatest that's happening in the FHIR space, plus opportunities to meet (virtually) with a lot of the key players and build some relationships.  Most of the sessions are running at times that aren't <em>too</em> horrible for North Americans, though it's somewhat unpleasant for those on the pacific coast.</p>\n<p>In most cases, there is documentation for the various server implementations.  If you're not finding it, reach out to the authors via private message or post your questions on <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a>.  There are also specific streams for most of the reference implementations - e.g. <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a>, <a class=\"stream\" data-stream-id=\"179171\" href=\"/#narrow/stream/179171-dotnet\">#dotnet</a>.  (To see available streams, click the little 'gear' icon.)</p>\n<p>After you've had a chance to immerse yourself a bit more, don't hesitate to submit change requests that suggest how we might provide a better on-ramp to newcomers, particularly those from your industry.  Or better yet, write up a page yourself we can add to the spec :)</p>",
        "id": 215499159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604431322
    },
    {
        "content": "<p>You can find all videos and slides of previous DevDays events linked here: <a href=\"https://www.devdays.com/events/\">https://www.devdays.com/events/</a></p>",
        "id": 215827105,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1604658212
    },
    {
        "content": "<p>For learning more on FHIR profiling (making your own FHIR data/API model):</p>\n<ul>\n<li><a href=\"https://simplifier.net/guide/profilingacademy\">https://simplifier.net/guide/profilingacademy</a></li>\n<li><a href=\"https://bit.ly/profiling-tutorial\">https://bit.ly/profiling-tutorial</a></li>\n</ul>",
        "id": 215827243,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1604658276
    }
]