[
    {
        "content": "<p>Anyone here affiliated with this new partnership, or know anything about it?  <a href=\"https://www.fiercehealthcare.com/tech/intermountain-presbyterian-and-ssm-health-announce-new-digital-transformation-company\">https://www.fiercehealthcare.com/tech/intermountain-presbyterian-and-ssm-health-announce-new-digital-transformation-company</a></p>\n<blockquote>\n<p>Intermountain Healthcare, Presbyterian Healthcare Services and SSM Health announced Tuesday the launch of Graphite Health, a nonprofit aimed at facilitating the development and distribution of helpful digital health tools.</p>\n<p>Graphite is already in talks with more than a dozen other providers interested in joining, it told Fierce Healthcare. Its plan is to build a data platform based on a common data language that works across its participating health systems, so new potential software is more easily and readily compatible. The data platform will also serve as more than just an electronic health record, helping providers incorporate patients’ health records, health plan information and their potential various social determinants of health when making decisions.</p>\n</blockquote>\n<p>\"data platform based on a common data language that works across its participating health systems\"  sounds delicious except there's no mention of #FHIR.  How should I construe this?</p>\n<p>In principle I can get my data out anyway, via a FHIR endpoint, right?  </p>\n<p>Is this an effort by these players to create an ecosystem that's not dependent on any EMR vendor?</p>",
        "id": 257138462,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634003518
    },
    {
        "content": "<p>a few FHIR people are working for Graphite. Do you have questions?</p>",
        "id": 257141185,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634005982
    },
    {
        "content": "<p>Great news!  </p>\n<p>I just wish they'd spotlighted it - the word doesn't even appear on their site, except in (Aneesh's blurb)[https://www.graphitehealth.io/perspectives].  Without FHIR (i.e. true patient-enabling interop) I'd be nothing but suspicious. Thanks!</p>\n<p><a href=\"/user_uploads/10155/3uUg9eA8DsNGJd14IbcBEnCf/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/3uUg9eA8DsNGJd14IbcBEnCf/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/3uUg9eA8DsNGJd14IbcBEnCf/image.png\"></a></div>",
        "id": 257187275,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634038361
    },
    {
        "content": "<p>Next up, let's hope they appoint a (real) Chief Patient Officer. (I'm not talking about me. I already am one and I'm <em>tired</em>. :-))</p>",
        "id": 257187319,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634038385
    },
    {
        "content": "<p>Some of the HL7 OGs are involved. They're very FHIR forward</p>",
        "id": 257366132,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1634132187
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197152\">@Preston Lee</span> FYI <span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span></p>",
        "id": 271111003,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1644318157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"194096\">@Brendan Keeler</span> Yup, a good number of folks from HL7-affiliated groups are with Graphite, including myself and a good number of those involved with Logica/HSPC and FHIR Sandbox system (moving into the new HL7 Implementation Division). We’re early on still but I can try to field (or any forward) any questions. My Graphite email is <a href=\"mailto:preston.lee@graphitehealth.io\">preston.lee@graphitehealth.io</a>.</p>",
        "id": 271135999,
        "sender_full_name": "Preston Lee",
        "timestamp": 1644330782
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> To answer both your questions: yes, both of those are aims of Graphite. FHIR is not only a key solution component of this, but a focal aspect of the ecosystem we’re building, in many ways. We will have some high-level materials and concepts on display at HIMSS in March.</p>",
        "id": 271137420,
        "sender_full_name": "Preston Lee",
        "timestamp": 1644331332
    }
]