[
    {
        "content": "<p>I request your license to introduce myself! Hello from Brazil!<br>\nMy name is Guilherme, physician, radiologist, a few years ago I modified my career as a traditional doctor to embrace the world of medical information.<br>\nIn recent years, leaving the futuristic side of the problem and proposing to embrace the construction of solutions, I ended up joining the HL7 Brazil group and the initiatives related to data processing and interoperability here.<br>\nPerhaps you do not know, but I can explain a little about, Brazil has a very interesting health system, hybrid, public-private, very heterogeneous in terms of quality, but has universal coverage. There are 210 million people in the public health system and around 50 million in the private sector.<br>\nIt turns out that initiatives to adopt the data standard to be interoperable are moving slowly, as you know, by fuzzy interests and also by the interest of some consultants who have stable contracts with the government. One of these contracts gives strength to openEHR, against FHIR (which I believe is much more appropriate for our national issues), although openEHR and FHIR are not exclusive.<br>\nI believe Brazil has a great advantage in relation to the fact that the R&amp;D part of D, which, of course, by its extension, population, proximity to culture (rather than previous policy), is very much in line with the US in terms of principles and goals. One of the examples that I think is great is how Uber was successful in applying its commercial strategy here in Brazil, being in recent years champion in finished trips (not in revenue).<br>\nIn recent years, we have built a huge network of relationships with key decision makers in Brazil through the efforts of our former Venture Builder, a joint venture of GE Healthcare and Hacking Health, a global open innovation movement based in Canada.<br>\nI have been working together with Paulo Rades, senior consultant in HL7 in the country, possibly people here should know him.<br>\nThe idea of ​​participating in the forum, even if I am not a developer, is to understand the strengths of the FHIR and establish a way to navigate this important country on interoperability issues.<br>\nThank you very much, Guilherme</p>",
        "id": 169438830,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1562022143
    },
    {
        "content": "<p>Welcome to the community :)</p>",
        "id": 169445942,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562030648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"228680\">@Guilherme Zwicker</span>  Welcome, indeed. I agree that openEHR and FHIR are not mutually exclusive, they're trying to do different things (in different ways). But that has been written and talked about so many times that there's nothing I'd like to add to that at this point in time. Good luck with your various efforts..</p>",
        "id": 169458154,
        "sender_full_name": "René Spronk",
        "timestamp": 1562051080
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"228680\">@Guilherme Zwicker</span> - I'm here as a patient voice, not as a developer or clinician.  Good to meet you. </p>\n<p>Last September I visited Sao Paolo for a few days, to speak at a media event for Dasa Group.  I assume you know them.  </p>\n<p>Can you link to some more info about OpenEHR?</p>",
        "id": 169485007,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562077376
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> !<br>\nYes, I know very well Dasa Group, currently the largest radiology service provider group in the world, and possibly one of the largest as a laboratory.<br>\nIn relation to openEHR, what is happening is that since 2011 there is the intention to create the national CKM, and this intention did not materialize any executive action that moves towards that solution. What happens now is that some states, like Sao Paulo, have decided to resolve part of their health transactions through FHIR. It is a complex situation and depends on many actors.</p>",
        "id": 169485899,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1562077944
    },
    {
        "content": "<p>we would like to help grow the FHIR community in Brazil. Let us know if there's anything we can do to help. I know that it's not the same language, but there are active communities in Argentina (<span class=\"user-mention\" data-user-id=\"191839\">@diego kaminker</span>) and Chile (<span class=\"user-mention\" data-user-id=\"195398\">@Camilo Erazo Leiva</span>)</p>",
        "id": 169567507,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562161658
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"228680\">@Guilherme Zwicker</span>  Welcome from HL7 Argentina. I helped Marivan to create HL7 Brazil and always looking on ways to help him to make it grow. Anything we can do to help you let us know!</p>",
        "id": 169567976,
        "sender_full_name": "diego kaminker",
        "timestamp": 1562161971
    },
    {
        "content": "<p>What a warm welcome  <span class=\"user-mention\" data-user-id=\"191839\">@diego kaminker</span>  and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ! I'm with dr. Marivan in the HL7 to try to accelerate the goals of FHIR in Brazil. Nothing is fast though (who said it was fast?). I am making every effort to absorb the pattern to start a pilot deployment as soon as possible. We already have some candidates for this. Count on me for the growth and adoption of the standard!</p>",
        "id": 169580935,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1562171246
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"228680\">@Guilherme Zwicker</span> , it is nice to hear from Brazil. Welcome to the community. I am also from Brazil, but I am living in Germany since 2010. I am working intensive with FHIR for almost two years. I tried to contact some people from HL7 Brazil to start or accelerate the use of FHIR there, but unfortunately I was not successful. I will contact  you on private (in Portuguese) to discuss some ideas. Maybe we can start an IG-Brazil. :-)</p>",
        "id": 169607479,
        "sender_full_name": "Elano Machado",
        "timestamp": 1562193618
    },
    {
        "content": "<p>also <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>. Brazil has been a conspicuous absence from the community</p>",
        "id": 169608671,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562195103
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ! This is about to change!</p>",
        "id": 169611737,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1562199280
    },
    {
        "content": "<p>Greetings, Brasil. There is so much talent there, I think it will be a great FHIR community. Let us know anything we can do to raise awareness or work on specific topics.</p>",
        "id": 170433503,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562660880
    },
    {
        "content": "<p>For those interested, there is a community in <a class=\"stream\" data-stream-id=\"179272\" href=\"/#narrow/stream/179272-Portugues\">#Portugues</a> where we can communicate in either English or Portuguese. Or use any of the other streams for implementers, etc.</p>",
        "id": 170433581,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562660944
    },
    {
        "content": "<p>Fun fact: some of the work we are doing is in Delphi/Pascal, so it would be a great collaboration to get some people to use their knowledge of Delphi (which in Brasil is high) to use and improve the tools for the community.</p>",
        "id": 170433822,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562661140
    },
    {
        "content": "<p>If anyone is interested (please!), let us know or join the <a class=\"stream\" data-stream-id=\"179281\" href=\"/#narrow/stream/179281-pascal\">#pascal</a> stream.</p>",
        "id": 170433825,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562661143
    }
]