[
    {
        "content": "<p>Hello, what stream will focus most on how healthcare professionals (doctors, nurses, surgeons, clinicians, etc) interact with healthcare data?</p>",
        "id": 224755588,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612198340
    },
    {
        "content": "<p>Not sure exactly what you mean?  There are all sorts of streams that talk about different aspects of interface standardization, which includes discussions about what providers need - questionnaires, care plans, genomics, patient administration, etc.</p>",
        "id": 224758380,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612199324
    },
    {
        "content": "<p>How about discussions around how to increase face time with a patient?</p>",
        "id": 224775347,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612206464
    },
    {
        "content": "<p>That's not really something we have a whole lot of influence on here at HL7.  Some of the standards we produce may allow more efficient use of provider time, but that doesn't necessarily result in increased time/patient.</p>",
        "id": 224820361,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612231540
    },
    {
        "content": "<p>Also, facetime isn't necessarily the metric providers would necessarily be interested in maximizing.  (For some patients, sure, but not all.)</p>",
        "id": 224820425,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612231603
    },
    {
        "content": "<p>Thanks. Was looking for specific data entry/workflow pain points. When I receive care and my doctor finds out I am in healthcare IT I usually get a story about staring at a computer instead of the patient.</p>",
        "id": 224822719,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612234498
    },
    {
        "content": "<p>The EHR work group has an initiative around \"Clinician Burden Reduction\" that you might find of interest.</p>",
        "id": 224823194,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612235091
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thanks!!</p>",
        "id": 224823410,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612235395
    }
]