[
    {
        "content": "<p>I am no expert on the science but I do what I can to learn, so as US winter approaches, I looked into HEPA home air purifiers, and blogged what I learned about particle size and filtration and what I decided to buy for our home use.</p>\n<p>And the process made me start thinking seriously about air travel and filtration in buildings like hotels and convention centers.  Has anyone heard of any case clusters from a plane flight??</p>\n<p><a href=\"https://www.epatientdave.com/2020/09/27/winters-coming-time-to-talk-about-ventilation-for-coronavirus-defense/\">Winter’s coming. Time to talk about ventilation for coronavirus defense</a></p>",
        "id": 211549495,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601326693
    },
    {
        "content": "<p><a href=\"https://wwwnc.cdc.gov/eid/article/26/11/20-3299_article\">https://wwwnc.cdc.gov/eid/article/26/11/20-3299_article</a></p>",
        "id": 211550017,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601326956
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179160-social/topic/HEPA.20filters.3A.20longing.20to.20resume.20travel/near/211550017\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://wwwnc.cdc.gov/eid/article/26/11/20-3299_article\">https://wwwnc.cdc.gov/eid/article/26/11/20-3299_article</a></p>\n</blockquote>\n<p>Yes, I saw that too - the flight was on March 2, when all this was new.  But I haven't heard of any in the past six months since things started to get smarter. Have you?  </p>\n<p>(I'm not trying to be stupid, believe me!  I'm in the high risk age group. I'm trying to be responsible for understanding as much as I can.)</p>",
        "id": 211550769,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601327349
    },
    {
        "content": "<p>I have friends that fly for Delta and they have not seen anything crazy and they have been flying the entire time.  They said that the planes are cleaned so much more than they ever have been.  Everyone wears masks for the entire flights, etc.  I have had friends that have traveled for work and some for leisure, and none of them have got the virus.  My friends that are Delta pilots have not flown outside of the US.  However I can ask them how the other pilots are doing, and if there are many flights going internationally right now.</p>",
        "id": 211551015,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1601327427
    },
    {
        "content": "<p>Please do!</p>\n<p>Delta's middle seat blocking <a href=\"https://www.delta.com/us/en/travel-update-center/coronavirus-travel-faqs\">ends Wednesday</a>.</p>\n<p><span class=\"user-mention\" data-user-id=\"223704\">@Mary Ann Boyle</span> if you have a few minutes please see what you think about my article. Cleaning surfaces is great (I don't knock it) but having watched very closely for months, <em>everything</em> seems to point to what we suspected in April: the risk is prolonged close contact in closed spaces, which seems to boil down to sitting in \"dirty\" air for a sustained time.  If (IF!) that air is getting cleaned constantly, it's credible to me that risk would be lower - not that I'd advise anyone else to take a risk based on MY thinking.</p>\n<p>Look at <a href=\"https://thepointsguy.com/news/airplane-air-hepa-filter/#:~:text=%5BAccording%20to%20the%20Centers%20for,%2D30%20times%20per%20hour.%5D\">this</a> from ThePointsGuy frequent traveler site:</p>\n<blockquote>\n<p><a href=\"https://wwwnc.cdc.gov/travel/yellowbook/2020/travel-by-air-land-sea/air-travel\">According to the CDC</a> ... cabin air generally passes through the filters 20-30 times per hour.</p>\n</blockquote>\n<p>That's every 2-3 minutes!</p>\n<p>I'm not selling anyone on this - just discussing.</p>",
        "id": 211551913,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601328002
    },
    {
        "content": "<p>NONETHELESS:   If I lived in Oz and wanted to travel 12 hours (or 8 or 6 or 4) it could be a catastrophe if for ANY reason something unexpected went wrong and I was sitting in \"COVID sewer air\" for 4 or 6 or 8 or 12 hours.</p>\n<p>I expect we won't have an answer to that until someone volunteers to sit in a room with equivalent filtration with a contagious person for 4 hours.</p>",
        "id": 211552603,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601328420
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223704\">@Mary Ann Boyle</span> I'd be curious if your DL friends have tales of mask-resisters with their noses uncovered. If repeated flights with many of those have not produced trouble, it supports the proposal that \"q 3 minutes\" filtering is potent.  </p>\n<p>Again, the last thing I want to do is be an ostrich.  I'm looking for info, not reasons to happily be stupid.</p>",
        "id": 211552957,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601328630
    },
    {
        "content": "<p>Wow - this is the best of social media:  a commenter on my post linked to a curated google doc with a compilation of info on aerosols and transmission. I jumped to <a href=\"https://docs.google.com/document/d/1fB5pysccOHvxphpTmCG_TGdytavMmc1cUumn8m0pwzo/preview?pru=AAABdPq9GwU*nHbI4a7so804o1JQWi-CSg#heading=h.k10zp34x5s0p\">the Recommendations section</a> but the document is 57 pages long, for those who want to dig. </p>\n<p>(Note again, I'm not in a position to assess its perfection.)</p>",
        "id": 211555781,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601330315
    },
    {
        "content": "<p>It's from aerosol researcher Jose Luis Jimenez, who penned <a href=\"https://time.com/5883081/covid-19-transmitted-aerosols/\">this August Time article</a>.</p>",
        "id": 211556036,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601330460
    },
    {
        "content": "<p><a href=\"https://apple.news/AehFSrUtaTOWGH59wkfTkoQ\">https://apple.news/AehFSrUtaTOWGH59wkfTkoQ</a></p>",
        "id": 211715923,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601442116
    },
    {
        "content": "<p>For those without Apple News access, <a href=\"https://www.smh.com.au/national/ruby-princess-passengers-on-qantas-flight-infected-at-least-eight-others-20200930-p560no.html\">here's the article</a>. Again, I note that it's about a March event. </p>\n<p><strong>I am in no way recommending being stupid or incautious.</strong>  To the contrary I'm recommending being rigorous, thoughtful, careful.</p>\n<p>And in the context of this thread, I continue to watch for news of airplane transmission since we realized how NOT to be stupid. </p>\n<p>FWIW ...</p>\n<blockquote>\n<p>Qantas medical director Ian Hosegood said the findings presented the only confirmed example of transmission on board a Qantas flight – and he expressed frustration that Qantas was unaware at the time that cruise passengers who posed a potential COVID-19 risk would be on the flight.</p>\n<p>\"We had no idea that at least 60 passengers had come off the Ruby Princess and other ships where COVID was already spreading. Had we known, they would have been stopped from travelling,\" Dr Hosegood said in a statement.</p>\n</blockquote>",
        "id": 211801721,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601490744
    },
    {
        "content": "<p>Re \"how not to be stupid\" (as we know it today) - </p>\n<blockquote>\n<p>Their findings, to be published in the Emerging Infectious Diseases journal next month, show at least eight cases – most likely up to 11 – were contracted on board the flight, which was carrying at least 60 cruise passengers, most from the Ruby Princess and Ovation of the Seas.</p>\n<p>Of 28 Ruby Princess passengers who boarded the flight just hours after disembarking the ship, the researchers found 13 were carrying the virus and 11 were infectious.</p>\n<p>Out of 30 Ovation of the Seas passengers, who had arrived in Sydney the previous day, four had the virus and one was infectious.</p>\n<p>Of the 11 people likely to have contracted the virus on the flight, four had commenced their journeys from different US cities and had taken an overnight flight from Los Angeles, which landed at Sydney Airport on the morning of March 19.</p>\n<p>All had viruses that matched the cruise ship strain, which was not circulating in the US at the time of the flight, the researchers wrote in their early-release report.</p>\n<p>While no reports of unwell passengers were logged with the airline, researchers said five out of the eight who contracted the virus on the flight said they had noticed people coughing. Anecdotal reports from interviews suggested mask use was \"rare among the passengers overall, including those who had respiratory symptoms\".</p>\n</blockquote>\n<p>So now I'm thinking, this must mean the coughed-out virus particles were immediately ingested by the victims (who must have been nearby),  before the air could reach the HEPA filter. </p>\n<p>Sure would like to see a seating chart for their locations!</p>",
        "id": 211802746,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601491230
    },
    {
        "content": "<p>Aha: <a href=\"https://www.bloomberg.com/news/articles/2020-09-30/covid-19-on-qantas-flight-spread-to-window-seats-in-economy\">this Bloomberg article</a> on the paper has additional info on seating locations:</p>\n<blockquote>\n<p>While the infectious passengers were almost evenly split between the middle and the rear of the cabin, all 11 secondary infections were found in the middle of the aircraft in economy class, the study showed. Seven were also in window seats, contradicting the widely held view that such seats have a lower risk of pathogen exposure, the study said.</p>\n</blockquote>\n<p>And <a href=\"https://wwwnc.cdc.gov/eid/article/26/12/20-3910_article\">the paper itself</a> does have <a href=\"https://wwwnc.cdc.gov/eid/article/26/12/20-3910-f4\">this seating chart</a>, though it doesn't map the airflow:<br>\n<a href=\"/user_uploads/10155/uI2WLcuADAgFuvdlrRL_TXpn/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/uI2WLcuADAgFuvdlrRL_TXpn/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/uI2WLcuADAgFuvdlrRL_TXpn/image.png\"></a></div>",
        "id": 211803533,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601491650
    },
    {
        "content": "<p>Another resource FWIW, from July - a doctor's two cents.<br>\n<a href=\"https://www.theatlantic.com/health/archive/2020/07/paging-dr-hamblin-flying-safe/614155/\">**Paging Dr. Hamblin: Should I Fly?** If everyone is vigilant and responsible, it can be done safely.</a></p>\n<blockquote>\n<p>The air on planes can be an issue when their ventilation system is shut off, even temporarily, such as when they’re stuck on a tarmac for one of those always-unclear reasons. This situation is credited with <a href=\"https://pubmed.ncbi.nlm.nih.gov/463858/\">one well-known 1979 influenza outbreak</a>, in which 38 of 54 people on a plane were infected after sitting on a tarmac for three hours without air circulation. </p>\n<p>No such instances of cabinwide spread have been reported with the coronavirus, though there have been isolated reports of transmission, mostly to a single nearby passenger. The worst reported incident was in early March, when Vietnam’s health ministry linked a dozen cases to a long flight from London to Hanoi.</p>\n</blockquote>",
        "id": 211857073,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601512514
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> for the nice summary. Agree that there is more information needed to determine additional potential improvements in aircraft airflow management, but I suspect two simple things would have a big impact: 1) force all passengers to wear a mask unless eating/drinking (I understand this creates a gap in infection management), and 2) Vigorous symptom assessment pre-boarding. Again I understand that this is not iron-clad and people don't follow rules and don't admit symptoms, noting that it seems loss of smell or taste are most predictive and not easily \"testable.\" Of all that you presented, the item that surprises (like you) the most is that many new infections were in window seats.</p>",
        "id": 212178035,
        "sender_full_name": "Robert McClure",
        "timestamp": 1601740701
    },
    {
        "content": "<p>The problem with \"except when eating/drinking\" is the frequency and unanimity of food/drink service.  In effect everyone has their mask off for the entire meal time and any snack service.  That could be for 30-45 minutes, several times for a long flight.</p>",
        "id": 212181604,
        "sender_full_name": "David Pyke",
        "timestamp": 1601746512
    },
    {
        "content": "<p>Another article regarding the conditions for Covid 19 spreading:<br>\n<a href=\"https://www.theatlantic.com/health/archive/2020/09/k-overlooked-variable-driving-pandemic/616548/?s=04\">https://www.theatlantic.com/health/archive/2020/09/k-overlooked-variable-driving-pandemic/616548/?s=04</a></p>",
        "id": 212182751,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1601748050
    },
    {
        "content": "<p>so some observations about that article:</p>\n<ul>\n<li>Here in Victoria, Australia, we targeted super-spreader events here above all in the second wave. Whatever the cost</li>\n<li>bringing the outbreak under control has increasingly focused on spreading events. Sick cleaners - an awesome way to spread the virus. Shared dinners in houses - them too. These are probably poor vectors but they are still good enough (unlike rose garden events, which we see videos of and are aghast) </li>\n<li>Our second wave was quite probably caused by 2-3 super-spreader events of those types that clustered together</li>\n<li>We now regard any infection in an aged care home as a super-spreader event</li>\n</ul>",
        "id": 212188761,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601757430
    },
    {
        "content": "<p>I so long for a logical approach... I hope some day to be in an environment that uses logic. Until then, all I can do is apply logic to my personal actions.</p>",
        "id": 212291030,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601900414
    }
]