[
    {
        "content": "<p><a href=\"https://www.iamthecavalry.org/domains/medical/oath/\" target=\"_blank\" title=\"https://www.iamthecavalry.org/domains/medical/oath/\">https://www.iamthecavalry.org/domains/medical/oath/</a></p>",
        "id": 153918124,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510107186
    },
    {
        "content": "<p>I will revere and protect human life, and act always for the benefit of my patients. I recognize that all systems fail; inherent defects and adverse conditions are inevitable. Capabilities meant to improve or save life, may also harm or end life. Where failure impacts patient safety, care delivery must be resilient against both indiscriminate accidents and intentional adversaries. Each of the roles in a diverse care delivery ecosystem shares a common responsibility: As one who seeks to preserve and improve life, I must first do no harm.</p>\n<p>To that end, I swear to fulfill, to the best of my ability, these principles.</p>\n<p>Cyber Safety by Design: I respect domain expertise from those that came before. I will inform design with security lifecycle, adversarial resilience, and secure supply chain practices.<br>\nThird-Party Collaboration: I acknowledge that vulnerabilities will persist, despite best efforts. I will invite disclosure of potential safety or security issues, reported in good faith.<br>\nEvidence Capture: I foresee unexpected outcomes. I will facilitate evidence capture, preservation, and analysis to learn from safety investigations.<br>\nResilience and Containment: I recognize failures in components and in the environment are inevitable. I will safeguard critical elements of care delivery in adverse conditions, and maintain a safe state with clear indicators when failure is unavoidable.<br>\nCyber Safety Updates: I understand that cyber safety will always change. I will support prompt, agile, and secure updates.</p>",
        "id": 153918125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510107221
    },
    {
        "content": "<p>perhaps we should have a modified version of this somewhere in the FHIR eco-system?</p>",
        "id": 153918126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510107262
    },
    {
        "content": "<p>+Privacy by Design</p>",
        "id": 153918187,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510151815
    },
    {
        "content": "<p>Isaac Asimov would submit:  <br>\n- A robot may not injure a human being or, through inaction, allow a human being to come to harm.<br>\n- A robot must obey orders given it by human beings except where such orders would conflict with the First Law.<br>\n- A robot must protect its own existence as long as such protection does not conflict with the First or Second Law.</p>",
        "id": 153918233,
        "sender_full_name": "Jim Kreth",
        "timestamp": 1510157285
    },
    {
        "content": "<p>there's also this: <a href=\"http://www.achi.org.au/docs/ACHI_Professional_Code_of_Conduct.pdf\" target=\"_blank\" title=\"http://www.achi.org.au/docs/ACHI_Professional_Code_of_Conduct.pdf\">http://www.achi.org.au/docs/ACHI_Professional_Code_of_Conduct.pdf</a></p>",
        "id": 153918597,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510257730
    },
    {
        "content": "<p>i think \"First, do no harm\" is actually quite needed.</p>",
        "id": 153918813,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510303199
    },
    {
        "content": "<p>Part of \"do no harm\" is having the skill and knowledge needed to have insight into whether harm is possible/likely.  The chances of implementers intentionally doing harm is low.  The chances of implementations going forth without having spent the time to learn and consider the possible harmful ramifications are much higher.</p>",
        "id": 153918846,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510316734
    },
    {
        "content": "<p>Somebody needs to send this over to Facebook.  They didn't get the memo, re: \"Move fast and break things.\"</p>",
        "id": 153922956,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1512480931
    },
    {
        "content": "<p>More seriously, such a thing would be a compelling differentiator, and communicate the values of the FHIR project.  It would be a great addition.</p>",
        "id": 153922959,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1512480968
    }
]