[
    {
        "content": "<p>CIBMTR (Center for International Blood and Marrow and Transplant Research) and the ASBMT (American Society for Blood and Marrow Transplantation) have a joint meeting called the Transplantation and Cellular Therapy Meetings, the next one happening Feb 20-24, 2019 in Houston, Texas (<a href=\"https://www.asbmt.org/meetings-events/tctmeetings\" target=\"_blank\" title=\"https://www.asbmt.org/meetings-events/tctmeetings\">https://www.asbmt.org/meetings-events/tctmeetings</a>). On one of the days we will have an IT forum focused on reporting transplant data to the CIBMTR for outcomes research. I've been advocating on developing FHIR resources/profiles/implementation guides for reporting these data, and we'll be giving a short update on what we in CIBMTR and NMDP ( National Marrow Donor Program)  been doing with FHIR. As part of our advocacy of FHIR and demonstrating its rapid adoption by the broader healthcare community, I thought it would be great to have someone from a local healthcare institution talk about how they are using/exploring FHIR for their interoperability needs.</p>\n<p>I'm looking for recommendation for a senior level person to talk at a high level about how they are using HL7 FHIR in their organization in the Houston, Texas, area.  It doesn't have to be about transplants, just how you're using FHIR in your organization to address interoperability, benefits,  and lessons learned.</p>",
        "id": 153990212,
        "sender_full_name": " Bob Milius",
        "timestamp": 1534957240
    },
    {
        "content": "<p>Hey everyone! I just joined here and am getting acclimated.</p>\n<p>I am looking for a freelancer/consultant who can build a middleware piece in the Apple Orchards API of EPIC. We need it to transfer data between two entities.   Is there anyone you have in mind? I can also be reached at <a href=\"mailto:mitchell@competsolutions.com\" title=\"mailto:mitchell@competsolutions.com\">mitchell@competsolutions.com</a></p>\n<p>Thanks for any help!</p>",
        "id": 153991245,
        "sender_full_name": "Mitchell Trulli",
        "timestamp": 1535465175
    }
]