[
    {
        "content": "<p>Hello!<br>\nI'm Abigail.  Grad student in the Masters of Science in Biomedical Informatics program at the University of Chicago.  I have about 15 years of experience in the industry, as an MRI Technologist, RIS/PACS Admin, Cerner Analyst, HL7 Analyst, etc. etc. but never managed to get an advanced degree.  So, eventually it was time to go back to school.  </p>\n<p>Anyhow, I've signed up for our Healthcare and Interoperability class next quarter, and will be using that course as an opportunity to develop out a full-stack javascript implementation of the FHIR standard I've been working on for the past year.  The project uses the Meteor javascript platform, and is called \"Meteor on FHIR\", naturally.  And for the next few months I'll be busy getting it connected to our Epic 2015 instance, validating that it conforms to Argonaut Sprint 3 and 4, implementing the rest of the base resource schemas, etc. etc.  The plan is to dig deep into the FHIR standard in the upcoming months, so I may be commenting a lot and posting lots of questions.  Hopefully I don't make a nuisance of myself, and can contribute to the overall discussion.  </p>\n<p>I found myself catching up on a bunch of posts today, and maybe contributing in a qualitatively different way than in the past; and it occurred to me that it might be a good idea to give an introduction.  Happy Holidays and looking forward to working with everybody in the upcoming year!<br>\nAbby</p>",
        "id": 153862572,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481243639
    },
    {
        "content": "<p>thanks Abby. Good to hear about more educational usage for FHIR - that's one area it hasn't really taken off in, except for a very few very specific and far advanced courses (e.g. Georgie Tech, Heilbrunn)</p>",
        "id": 153862574,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481243787
    },
    {
        "content": "<p>Hello, I'd like to introduce myself to this forum. I'm owner of a personal health environment (PGO) platform in the Netherlands, Zodos. We are partner in the MedMij kickstart Groningen. Together with Nictiz we're working on the Dutch FHIR profile on self measurements. I'm very enthusiatic about this FHIR initiative. A BIG improvement comparing to HL7 version whatever. I hope I can contribute to this community and to make FHIR the default communication standard in NL. </p>",
        "id": 153869331,
        "sender_full_name": "Wilfred de Jonge",
        "timestamp": 1485508151
    },
    {
        "content": "<p>Hi Wilfred, welcome. Good of you to join here too. Please note that for Dutch \"stuff\" there is a channel \"netherlands\" that should/can Subscribe to. You will find many other Dutch FHIR implementers there.</p>",
        "id": 153869332,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485508261
    },
    {
        "content": "<p>If you have more generic implementer questions you should consider the \"implementers\" stream.</p>",
        "id": 153869333,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485508320
    }
]