[
    {
        "content": "<p>Hi All, I am Raman from India. I am from clinical background and working for Infosys as BA-Healthcare domain. I have very initial knowledge of FHIR and looking for some help to understand how an EHR patient data can be share easily via any mobile App by using FHIR? <br>\nPlease, if any body can help me to understand this, Thank you!</p>",
        "id": 202291896,
        "sender_full_name": "JANKI RAMAN",
        "timestamp": 1593425740
    },
    {
        "content": "<p>Hi Janki, the best place to start is by reading through the specification and playing with some of the public test implementations to get a feel for how FHIR works.  There are a lot of good online presentations available (search for FHIR DevDays videos) that walk through different parts of the spec (from simple introductions to advanced topics).  Obviously you'll need to think about your use-cases as well in terms of what types of data you want to exchange, between what systems, etc.  Doing that will likely lead you to more specific questions that are easier to answer here.  Your initial question is really broad and doesn't provide a lot of context, making it hard to answer - and doesn't indicate what research you've already done and the specific parts of the spec you're having problems with.  That makes it hard to provide an answer that doesn't duplicate what's already written in the spec.</p>",
        "id": 202312068,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593439009
    },
    {
        "content": "<p>Thank you Lloyd for your response. I have started going through the specifications and videos.</p>",
        "id": 202534647,
        "sender_full_name": "JANKI RAMAN",
        "timestamp": 1593584466
    },
    {
        "content": "<p>Hi all. I have a similar, but more specific question. What part of the various specs should I look at to find the minimal set of FHIR services and features to implement to help a Payer comply to the CMS Interoperability rule? It seems there are a very rich set of query parameters and features in FHIR and SMART on FHIR, but it is not clear what subset achieves compliance and will get patient data (PDex) in particular to the third party apps.</p>",
        "id": 205240992,
        "sender_full_name": "Damon Feldman",
        "timestamp": 1595945866
    },
    {
        "content": "<p>The basics can be found in the DaVinci Project and the CARIN Patient Centric IG.  Those are key to getting the CMS interop rule in place</p>",
        "id": 205246100,
        "sender_full_name": "David Pyke",
        "timestamp": 1595948215
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> . I see that, but I'm also confused that the rule and regs do not mention CARIN. I consistently see USCDI, SMART, FHIR, but not CARIN (e.g. in <a href=\"https://www.govregs.com/regulations/expand/title45_chapterA_part170_subpartB_section170.213#title45_chapterA_part170_subpartB_section170.213\">https://www.govregs.com/regulations/expand/title45_chapterA_part170_subpartB_section170.213#title45_chapterA_part170_subpartB_section170.213</a>). Is that an emerging standard or something flexible?</p>",
        "id": 205346797,
        "sender_full_name": "Damon Feldman",
        "timestamp": 1596024027
    },
    {
        "content": "<p>The CARIN alliance has a patient access FHIR IG.  It's in progess: <a href=\"http://hl7.org/fhir/us/carin-bb/2020Feb/\">http://hl7.org/fhir/us/carin-bb/2020Feb/</a></p>",
        "id": 205350831,
        "sender_full_name": "David Pyke",
        "timestamp": 1596026721
    }
]