[
    {
        "content": "<p><a href=\"http://backreaction.blogspot.com/2020/08/your-sudden-enthusiasm-for-virtual.html?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+Backreaction+%28Backreaction%29\">http://backreaction.blogspot.com/2020/08/your-sudden-enthusiasm-for-virtual.html?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+Backreaction+%28Backreaction%29</a></p>\n<p>This is pretty much our take on it too - virtual meetings are more effective ways to conduct our routine business but don't begin to help us build the community</p>",
        "id": 207768920,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598182566
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span> <span class=\"user-mention\" data-user-id=\"241465\">@Marita Mantle-Kloosterboer</span> take note. How might we address this?</p>",
        "id": 207860293,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1598284224
    },
    {
        "content": "<p>F2F DevDays are constructed in such a way that there's ample opportunity to get to know / chew the fat with the other attendees. The virtual DevDays had a 'pub crawl' and in general tries to still facilitate ad-hoc discussions, but as the blogpost cited by you already states this is much harder to do in a Zoom-like virtual setting. We'll try, we keep an eye out as to what others are doing, and we're open for suggestions. (As a trainer I read a lot of blogs about online events, and there have been some suggestions that may work for DevDays as well).</p>\n<p>If we all put our VR goggles on, and we're free to roam some virtual hallways and chat to random other attendees, then yes, going virtual may approach the same sort of experience that a F2F meeting offers. For now (as humans, to establish or strengthen inter-human bonds) we do need the occasional F2F meeting. As long as that's not in the cards we'll have to make do, and accept its drawbacks.</p>",
        "id": 207929379,
        "sender_full_name": "René Spronk",
        "timestamp": 1598338082
    },
    {
        "content": "<p>We're working on this, be assured. My take on this:</p>\n<ul>\n<li>the conference apps will evolve and implement \"social\" features</li>\n<li>a mentality shift will happen as we move from in-person to virtual: attendees will grow used to the fact that the human factor will happen online too</li>\n<li>we as conference organizers should do a better job at building the community. We have done one edition of DevDays and we'll continue to experiment and learn </li>\n<li>at some point in the future we'll meet face to face again and boy, that will be special!</li>\n</ul>",
        "id": 208063116,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1598429138
    }
]