[
    {
        "content": "<p>Cross my fingers and hope May WGM is as scheduled.</p>",
        "id": 189932828,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1583527899
    },
    {
        "content": "<p>HL7 International has posted an update on the May WGM to all members and on its Web Site at <a href=\"https://www.hl7.org/events/working_group_meeting/2020/05/\" target=\"_blank\" title=\"https://www.hl7.org/events/working_group_meeting/2020/05/\">https://www.hl7.org/events/working_group_meeting/2020/05/</a></p>",
        "id": 189935798,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1583529739
    },
    {
        "content": "<p>Thanks.  To demystify, at this moment (10 pm ET Mar 6) it says this.  I'll highlight two key boldface things.</p>\n<blockquote>\n<p><strong>Important Update Regarding HL7 May WGM</strong></p>\n<p>HL7 International is actively monitoring the situation with COVID-19 in the US and we are aware this may impact our May Working Group Meeting (WGM), currently scheduled for May 16-22 in San Antonio.<strong> In the event it may be necessary to cancel </strong>the WGM to minimize the risk to our staff, members and attendees, <strong>we are exploring all options including the possibility of a virtual event.</strong></p>\n<p>We will continue to closely follow the situation and make decisions accordingly, keeping you informed as we learn more. In recognition of the importance of your travel plans, we expect to issue a definitive decision regarding the status of the meeting by April 15. In the meantime, registration for the WGM will remain open. <strong>Registered attendees who need to cancel their registration can do so prior to May 2 and request a refund </strong>in accordance with our policy.</p>\n<p>This is uncharted territory and there are likely to be many questions over the coming weeks. We ask for your patience while we determine the best way to keep our standards work moving forward as interoperability of healthcare data, now, more than ever, is crucial to protecting public health.</p>\n</blockquote>",
        "id": 189954403,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583551086
    },
    {
        "content": "<p>No surprise that the HL7 International Board has taken the decision to  cancel the May WGM. Further details here...<br>\n<a href=\"http://www.hl7.org/events/working_group_meeting/2020/05/#update\" target=\"_blank\" title=\"http://www.hl7.org/events/working_group_meeting/2020/05/#update\">http://www.hl7.org/events/working_group_meeting/2020/05/#update</a></p>",
        "id": 191564804,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1585022255
    },
    {
        "content": "<p>Note that there will still be a (virtual) connectathon</p>",
        "id": 191565015,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585022597
    },
    {
        "content": "<p>\"The board has asked the FHIR Management Group to prepare plans for a virtual connectathon. Details will be shared in a future announcement.\"<br>\nObviously, setting event timings that enable everyone to participate during waking hours is going to be a challenge.</p>",
        "id": 191565080,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1585022677
    },
    {
        "content": "<p>I'm looking for more information regarding the virtual connectathon in May.  Are there any documented details about how it will work?  I suspect there are; I just haven't found them yet.  But some relevant questions would be:</p>\n<p>(a) How are we accommodating disparate time zones? Will there be a common set of hours identified for \"official\" connectathon work or will it be a 24-hours-a-day rolling connectathon?</p>\n<p>(b) Are there any plans for simulating local networks via VPN or do participants need to have their services available on the general WWW?</p>\n<p>(c) Are there any plans for asynchronous communication channels that are more dynamic than Zulip (e.g., have voice and video, like Zoom, etc.)?</p>",
        "id": 194062154,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586970547
    },
    {
        "content": "<p>Those questions are probably best handled by Sandy Vance (<a href=\"mailto:sandy.vance@aegis.net\" title=\"mailto:sandy.vance@aegis.net\">sandy.vance@aegis.net</a>)</p>",
        "id": 194062825,
        "sender_full_name": "David Pyke",
        "timestamp": 1586970887
    },
    {
        "content": "<p>(a) probably a rolling connectathon with a surge for around USA work times <br>\n(b) we haven't talked about VPNs. is there a reason we should? <br>\n(c) yes Zoom</p>",
        "id": 194220026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586981048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span></p>",
        "id": 194221317,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586981655
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -- regarding VPNs, I don't know.  I'm just thinking that for those of us at home with dynamic IP addresses and consumer internet services (as well as for those behind corporate firewalls), it may be hard to expose local services (running on a laptop) in a way that others in the Connectathon can easily access them.  Skilled people might be able to dig into their router settings and leverage DynDNS and port-forwarding, but it's not necessarily for the faint of heart.  I <em>think</em> that a small VPN might be able to provide a pseudo-local-network where participants can more easily (and safely) expose ports, etc.  That said, this really isn't my forte, so this could be a really bad idea or something that wouldn't even work (or would just trade one set of problems for another).  I was just throwing it out there to see if anyone had thought about it.  Also, I haven't done a ton of Connectathons, so maybe broad accessibility over the public WWW is already a prerequisite everyone just dealt with anyway.  I suppose folks could just spin up a temporary AWS server and run their services from that.</p>",
        "id": 194227403,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586984699
    },
    {
        "content": "<p>usually we don't have a local network at connectathons anyway; we're all isolated from each other by the wireless network security set up, though sometimes we get asked to see if we change that</p>",
        "id": 194229313,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586985745
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222501\">@Bryn Evans</span> have you got any comments about setting up a VPN for peer to peer debugging? possible? Practical? manageable?</p>",
        "id": 194229373,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586985787
    },
    {
        "content": "<p>Yeah, Wireguard is a great solution for that. You can use it to connect with each other as if you were on a lan.</p>",
        "id": 194229576,
        "sender_full_name": "Bryn Evans",
        "timestamp": 1586985889
    },
    {
        "content": "<p>It can also coexist with your current WG tunnel.</p>",
        "id": 194229632,
        "sender_full_name": "Bryn Evans",
        "timestamp": 1586985919
    },
    {
        "content": "<p>Oh, wait. I just got your message and didn't see the whole thread. How many people are we talking about?</p>",
        "id": 194229788,
        "sender_full_name": "Bryn Evans",
        "timestamp": 1586985987
    },
    {
        "content": "<p>I'm not sure. We expect 100s in the connectathon but only a small % would be interested in this</p>",
        "id": 194229916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586986048
    },
    {
        "content": "<p>for instance, I've never bothered - we typically just share http request logs</p>",
        "id": 194230033,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586986090
    },
    {
        "content": "<p>And just to be clear, don't go doing anything difficult just for me.  I'm not even 100% sure I'm attending.  So... don't let me rock the boat too much!</p>",
        "id": 194230302,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586986221
    },
    {
        "content": "<p>hey - you don't have leave home to attend, so the great thing is that this time there's no excuse</p>",
        "id": 194230360,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586986255
    },
    {
        "content": "<p>Yeah, Grahame, I'll look into it tomorrow. We've got the infrastructure to support it, and it would be cool.</p>",
        "id": 194230474,
        "sender_full_name": "Bryn Evans",
        "timestamp": 1586986321
    },
    {
        "content": "<p>There are also (free) services like <a href=\"https://serveo.net/\" title=\"https://serveo.net/\">Serveo</a>, <a href=\"https://ngrok.com/\" title=\"https://ngrok.com/\">ngrok</a>, and <a href=\"https://localtunnel.github.io/www/\" title=\"https://localtunnel.github.io/www/\">LocalTunnel</a> which can be used to expose a port from your local box.<br>\nNote: This list is from July-19 for Subscriptions testing - can't specifically recommend any one of them.</p>",
        "id": 194230870,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1586986545
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> -- All details of the Connectathon can be found on Confluence as we spin things up. We will be using Go To Webinar for the main session and then zoom meetings for the individual tracks. The event will kick off at 4pm ET on Wednesday, May 13 and most of the tracks will work 9-7 ET Thursday and Friday. Once you select a track your track lead will let you know if there is variation to accomodate international participants. Confluence: <a href=\"https://confluence.hl7.org/display/FHIR/2020-05+Connectathon+24\" title=\"https://confluence.hl7.org/display/FHIR/2020-05+Connectathon+24\">https://confluence.hl7.org/display/FHIR/2020-05+Connectathon+24</a></p>",
        "id": 194249542,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1587001620
    },
    {
        "content": "<p>Is Zoom considered safe? I just saw <a href=\"https://www.vice.com/en_us/article/qjdqgv/hackers-selling-critical-zoom-zero-day-exploit-for-500000\" title=\"https://www.vice.com/en_us/article/qjdqgv/hackers-selling-critical-zoom-zero-day-exploit-for-500000\">this</a></p>\n<p>I was recently introduced to <a href=\"https://meet.jit.si/\" title=\"https://meet.jit.si/\">jit.si</a> - is that an option?</p>",
        "id": 194255603,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1587009327
    },
    {
        "content": "<p><a href=\"http://jit.si\" title=\"http://jit.si\">jit.si</a> is an excellent option for personal use. I really like it</p>",
        "id": 194258335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587013274
    },
    {
        "content": "<p>Thanks all -- great information and tips!</p>",
        "id": 194319480,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1587050015
    }
]