[
    {
        "content": "<p>I'm trying to get more involved in the community, and i was hoping to start attending the cds and fhir calls. however, i'm having trouble finding details on how to join or when they are held. can anyone help?</p>",
        "id": 154842926,
        "sender_full_name": "Tejay Cardon",
        "timestamp": 1547131180
    },
    {
        "content": "<p>Thanks for being willing to pitch in :)  Meeting information for the different work groups is found on the HL7 website (<a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">http://hl7.org</a>).  The simplest way to get to it from there is to click on \"Resources\", \"Work groups\".  That will give you the list of work groups.  The two you've indicated an interest in are Clinical Decision Support and FHIR Infrastructure.  If you click on their names, you'll see how to sign up to their list servers (so you'll receive ongoing notices of calls and cancellations) as well as information on upcoming conference calls.  You should also find how to see their minutes and other relevant documents.</p>\n<p>The other way to find out information about a work group is to go to <a href=\"http://wiki.hl7.org\" target=\"_blank\" title=\"http://wiki.hl7.org\">wiki.hl7.org</a> and find the work group of interest.</p>",
        "id": 154844594,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547132584
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .  Does FHIR meet on any specific cadence that I can block off in my calendar?  Or are meetings set as needed?</p>",
        "id": 154846803,
        "sender_full_name": "Tejay Cardon",
        "timestamp": 1547134447
    },
    {
        "content": "<p>also, how does FHIR Inf. related to FHIR management group?</p>",
        "id": 154846928,
        "sender_full_name": "Tejay Cardon",
        "timestamp": 1547134557
    },
    {
        "content": "<p>FHIR Infrastructure meets Mondays from 3-5 Eastern.  We won't be meeting this coming Monday or the following week due to the WGM.  We may shorten that to a 1-hour duration if we get to the point where we think we're actually on top of all of our incoming change requests... :)</p>",
        "id": 154846990,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547134598
    },
    {
        "content": "<p>FHIR-I is a content work group.  We're responsible for a specific set of resources and pages.  Just as Patient Administration oversees Patient, Encounter, Practitioner, etc.; FHIR-I oversees StructureDefinition, CapabilityStatement and others.  The FMG is a governance body.  It doesn't produce any content.  Instead it makes decisions on ballot timelines and coordinates work across the various work groups.  That includes enforcing quality criteria, trying to ensure that implementation guide scopes are clear and don't overlap, etc.  FHIR-I is an open group - anyone who shows up can vote.  The FMG is a TSC-appointed body.  Anyone can show up to listen in/contribute, but only the appointed members can vote.</p>",
        "id": 154847183,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547134761
    },
    {
        "content": "<p>Excellent.  That clears a lot up.  Thank you.</p>",
        "id": 154847289,
        "sender_full_name": "Tejay Cardon",
        "timestamp": 1547134835
    }
]