[
    {
        "content": "<p>During the QHIN Technical Framework webinar today the presenters stated that FHIR isn't really ready for use in that environment due to lack of support for multi-hop networks. There may be multiple intermediate nodes between an interaction initiator and the final recipient. What does everyone thing of that? Are there best practices defined for FHIR interactions that go beyond point to point? Or is this a real gap that we ought to address in a future release?<br>\n<a href=\"https://sequoiaproject.org/onc-and-the-sequoia-project-publish-draft-technical-framework-for-network-to-network-health-information-exchange/\">https://sequoiaproject.org/onc-and-the-sequoia-project-publish-draft-technical-framework-for-network-to-network-health-information-exchange/</a></p>",
        "id": 248384311,
        "sender_full_name": "Nick Radov",
        "timestamp": 1628099598
    },
    {
        "content": "<p>This probably should be in <a class=\"stream\" data-stream-id=\"179160\" href=\"/#narrow/stream/179160-social\">#social</a></p>",
        "id": 248385465,
        "sender_full_name": "David Pyke",
        "timestamp": 1628100139
    },
    {
        "content": "<p>It is unfortunate that this was presented as a reason to not use FHIR, vs an opportunity to work toward. FHIR is an Interoperability Standard, not a systems-design. The issues with Multi-Hop are systems-design problems. There are plenty of good systems-design, and some really bad ones. This is a fact not unique to FHIR, or unique to standards in general (e.g. USA electrical lightbulb socket).</p>",
        "id": 248387885,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628101311
    },
    {
        "content": "<p>It was presented as a challenge to be solved for the next version of the QTF</p>",
        "id": 248387998,
        "sender_full_name": "David Pyke",
        "timestamp": 1628101353
    },
    {
        "content": "<p>Good to hear <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> , I trusted you had said the right things.</p>",
        "id": 248388078,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628101395
    },
    {
        "content": "<p>Is there a way to change the stream to #social? I tried to edit but didn't see an option to do that.</p>",
        "id": 248388456,
        "sender_full_name": "Nick Radov",
        "timestamp": 1628101579
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers/topic/Multi-hop.20FHIR\">#implementers &gt; Multi-hop FHIR</a> by <span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span></p>",
        "id": 248413786,
        "sender_full_name": "Notification Bot",
        "timestamp": 1628114020
    },
    {
        "content": "<p>Admins have the power :)  I think the need for this is trying to be addressed by the FAST initiative - <span class=\"user-mention\" data-user-id=\"196338\">@Patrick Murta</span>?</p>",
        "id": 248413922,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628114087
    },
    {
        "content": "<p>The Internet is by definition a multi-hop network, and FHIR is built on top of the fundamental internet protocols and technologies.<br>\nIt is not so much \"support for multi-hop networks\" as a FHIR capability, it is rather support for FHIR by intermediaries that is lacking. </p>\n<p>Just like X12 intermediaries provide services for X12 communications, and interface engines provide services for HL7v2 communications, this is system functionality that doesn't need anything from the FHIR specification itself, just guidance on how to be this new thing, called \"FHIR intermediary\".</p>",
        "id": 248496615,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1628178634
    },
    {
        "content": "<p>That's a better way to put it.  FHIR with intermediaries is the challenge, especially intermediaries that may be aggregating results</p>",
        "id": 248497105,
        "sender_full_name": "David Pyke",
        "timestamp": 1628178885
    },
    {
        "content": "<p>right. so the solution is to \"Not use Intermediaries.\"</p>",
        "id": 248500158,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628180319
    },
    {
        "content": "<p>if one stops enabling these intermediaries to have some business reason to exist... then we use the Internet for what it is good at (networking), and use FHIR for what it is good at (healthcare information model and REST access method)</p>",
        "id": 248500237,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628180374
    },
    {
        "content": "<p>Right!  Why didn't I see that as the obvious fix.  Hold on while I call ONC and have them restart the entire thing</p>",
        "id": 248500272,
        "sender_full_name": "David Pyke",
        "timestamp": 1628180394
    },
    {
        "content": "<p>my point, and I think others, is to characterize the problem properly. It is not a \"Multi-hop FHIR\" problem. It is a \"intermediaries want to exist\" problem.</p>",
        "id": 248500458,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628180489
    },
    {
        "content": "<p>It's an \"ONC Designed a system with intermediaries, we don't get to say 'change it' just because it doesn't work for FHIR\" problem</p>",
        "id": 248500646,
        "sender_full_name": "David Pyke",
        "timestamp": 1628180578
    },
    {
        "content": "<p>once the problem is characterized properly... \"Intermediaries want to exist\"... then it becomes obvious that \"intermediaries should solve the problem that they are creating\". Rather than tell the rest of the world (USA) that FHIR is not possible to be used at scale or with multi-hop.</p>",
        "id": 248500690,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628180599
    },
    {
        "content": "<p>While we may want the intermediaries to go away because it makes our technology better, that's not the problem we can solve.  We can either adapt our technology to work in the system provided or not use that system.  ONC created this design.  Saying \"but Intermediaries are bad\" doesn't help</p>",
        "id": 248501110,
        "sender_full_name": "David Pyke",
        "timestamp": 1628180812
    },
    {
        "content": "<p>There are legitimate uses for intermediaries.  And we're working on technical guidance to allow them to work more seamlessly in the FHIR space when doing pure REST.  (FHIR works seamlessly for multihop already if you want to do messaging.)  That said,  adding multiple hops creates challenges for real-time processing as each layer injects delay, so you really want to ensure that intermediaries are really necessary.  And if the systems involved are only going to be able to handle asynchronous processing, then you're stuck with FHIR messaging until the architecture is refactored to allow synchronous exchange.</p>",
        "id": 248501409,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628180943
    },
    {
        "content": "<blockquote>\n<p>Saying \"but Intermediaries are bad\" doesn't help</p>\n</blockquote>\n<p>No one is saying \"intermediaries are bad\" - far from it. in many cases intermediaries are useful and necessary. The Internet is full of intermediaries. All I am saying is that intermediaries have to be (re?)designed to work with FHIR, and that is where the effort needs to be. You could call them \"FHIR Content Delivery Networks\", if that helps clarify how they are supposed to work.</p>",
        "id": 248503215,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1628181863
    },
    {
        "content": "<p>Great! Can you put in feedback to the QTF on how to reshape the intermediaries to allow for synchronous FHIR over multiple intermediaries?</p>",
        "id": 248503430,
        "sender_full_name": "David Pyke",
        "timestamp": 1628181964
    },
    {
        "content": "<p><a href=\"https://www.cloudflare.com/learning/cdn/what-is-a-cdn/\">https://www.cloudflare.com/learning/cdn/what-is-a-cdn/</a></p>",
        "id": 248503633,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1628182064
    },
    {
        "content": "<p>I know what a cdn is.  Now apply that to the TEFCA model.</p>",
        "id": 248504009,
        "sender_full_name": "David Pyke",
        "timestamp": 1628182260
    },
    {
        "content": "<p>I think there is some misalignment of purpose and intention in this conversation. To bring it back to basics, my first question is:</p>\n<p>Does TEFCA apply to FHIR or not?</p>",
        "id": 248504798,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1628182587
    },
    {
        "content": "<p>No, TEFCA does not yet have FHIR.  The discussion here was how to address the issues that FHIR has to allow it to work with TEFCA.  That is, how to have FHIR work with a system based on multiple intermediaries that may be aggregating data</p>",
        "id": 248505163,
        "sender_full_name": "David Pyke",
        "timestamp": 1628182745
    },
    {
        "content": "<p>If you are trying to \"address the issues that FHIR has\", you  are likely to break FHIR. </p>\n<p>Trying to address the issues that intermediaries which aggregate data have with FHIR is probably a better approach. </p>\n<p>One place to start could be, what does it mean for an intermediary to be aggregating data and using FHIR?</p>",
        "id": 248506445,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1628183238
    },
    {
        "content": "<p>Okay, we can't erase the work done to create the TEFCA framework and design.  We have to work with what we have and find a way to make FHIR work within the paradigm.  Aggregating data means taking responses from many sources and placing them in a single response for the requestor.  So, FHIR has to have a way to be aggregated into one response (perhaps a bundle of bundles) that can be processed by a receiver that will be behind  4+ intermediaries</p>",
        "id": 248507124,
        "sender_full_name": "David Pyke",
        "timestamp": 1628183557
    },
    {
        "content": "<p>We also have to have all queries routed through the intermediaries</p>",
        "id": 248507330,
        "sender_full_name": "David Pyke",
        "timestamp": 1628183650
    },
    {
        "content": "<p>there are documented standards for how to use FHIR with the existing networks. Multiple kinds of solutions. Easier API (MHD), Easier content (FHIR-Document), and easier discovery (FHIR directories and patient registries).</p>",
        "id": 248507372,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628183676
    },
    {
        "content": "<p><a href=\"https://profiles.ihe.net/ITI/HIE-Whitepaper/index.html\">https://profiles.ihe.net/ITI/HIE-Whitepaper/index.html</a></p>",
        "id": 248507428,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628183701
    },
    {
        "content": "<p>FHIR DOcuments are one way for content.  Now we need a security model</p>",
        "id": 248507507,
        "sender_full_name": "David Pyke",
        "timestamp": 1628183750
    },
    {
        "content": "<p>Where the query responder will not necessarily have any way to authenticate the query originator user</p>",
        "id": 248507628,
        "sender_full_name": "David Pyke",
        "timestamp": 1628183793
    },
    {
        "content": "<p>if the query responder can't authenticate the originator... DENY</p>",
        "id": 248507681,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628183820
    },
    {
        "content": "<p>use the federated authorization methods already in place as part of the USA nation wide networks.</p>",
        "id": 248507748,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628183865
    },
    {
        "content": "<p>Sorry, no.  The originating user will be multiple intermediaries away.  We can't just deny all.  That breaks the TEFCA model</p>",
        "id": 248507751,
        "sender_full_name": "David Pyke",
        "timestamp": 1628183869
    },
    {
        "content": "<p>There are no national networks with multiple intermediaries</p>",
        "id": 248507823,
        "sender_full_name": "David Pyke",
        "timestamp": 1628183888
    },
    {
        "content": "<p>then maybe the TEFCA model... as you interpret it... is wrong</p>",
        "id": 248507834,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628183897
    },
    {
        "content": "<p>Well, then put in feedback to fix it</p>",
        "id": 248507853,
        "sender_full_name": "David Pyke",
        "timestamp": 1628183913
    },
    {
        "content": "<p>security and privacy have a fundimental principle -- DENY unless proven reason to PERMIT</p>",
        "id": 248507871,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628183928
    },
    {
        "content": "<p>The proven reason is that it's a TEFCA query in a trust framework</p>",
        "id": 248507895,
        "sender_full_name": "David Pyke",
        "timestamp": 1628183949
    },
    {
        "content": "<p>break that principle and we might have zero security and zero privacy</p>",
        "id": 248507901,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628183951
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192587\">David Pyke</span> <a href=\"#narrow/stream/179160-social/topic/Multi-hop.20FHIR/near/248507895\">said</a>:</p>\n<blockquote>\n<p>The proven reason is that it's a TEFCA query in a trust framework</p>\n</blockquote>\n<p>there are already at least two models in nationwide use today. You are wanting to throw them out just to build a new one? That WILL BE EXPENSIVE and not any better.</p>",
        "id": 248508086,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628184030
    },
    {
        "content": "<p><em>I</em> don't want to do anything.  Talk to ONC</p>",
        "id": 248508156,
        "sender_full_name": "David Pyke",
        "timestamp": 1628184060
    },
    {
        "content": "<p>IF you can find a fix, please put in feedback to the RCE</p>",
        "id": 248508254,
        "sender_full_name": "David Pyke",
        "timestamp": 1628184098
    },
    {
        "content": "<p>I talk to ONC. I also talk to little birdies.</p>",
        "id": 248508276,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628184110
    },
    {
        "content": "<blockquote>\n<p>So, FHIR has to have a way to be aggregated into one response (perhaps a bundle of bundles) that can be processed by a receiver that will be behind 4+ intermediaries</p>\n</blockquote>\n<p>It is the job of the aggregating intermediary to make sure the receiver is completely unaware of how many or what intermediaries are involved. Just like CDNs do it.</p>\n<blockquote>\n<p>We also have to have all queries routed through the intermediaries</p>\n</blockquote>\n<p>Again, the FHIR client doesn't need to know anything about intermediaries.</p>\n<p>In case it is not clear, I am not trivializing the problem. It requires effort to be solved, an effort by the intermediaries to adapt, but it is not a technological or a FHIR specification problem.</p>",
        "id": 248508348,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1628184130
    },
    {
        "content": "<p><a href=\"https://rce.sequoiaproject.org/qhin-technical-framework-feedback/\">https://rce.sequoiaproject.org/qhin-technical-framework-feedback/</a></p>",
        "id": 248508366,
        "sender_full_name": "David Pyke",
        "timestamp": 1628184140
    },
    {
        "content": "<p>agreed. aggregating intermediaries need to do systems design.  It is not easy work, but it is not rocket-science. That systems design should result in no external difference, should be FHIR compliant. Them complaining that they have to do systems design, and expecting free consulting is aggravating.</p>",
        "id": 248508776,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628184311
    },
    {
        "content": "<p>Realize that ONC only can mandate what the QHINs do, not the systems between the QHINs and the querier and responders.  So, this needs to be more than just systems design.</p>",
        "id": 248509010,
        "sender_full_name": "David Pyke",
        "timestamp": 1628184449
    },
    {
        "content": "<p>And this is only that specification. Lots of money on the table to help the HIEs and others do their systems design to support the models that are adopted</p>",
        "id": 248509154,
        "sender_full_name": "David Pyke",
        "timestamp": 1628184516
    },
    {
        "content": "<p>they should not be involved in systems design.  They should only define the Interface behaviors -- aka, what we all refer to as Interoperability Standards.   Systems designs will change multiple times over the lifespan of any Interoperability Standard.</p>",
        "id": 248509341,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628184611
    },
    {
        "content": "<p>It is definitely in HL7's interest to help ensure that TEFCA will work for exchanges of data in forms other than documents - i.e. proper RESTful query that brings back desired resources.  It would be a shame if the only way systems could share FHIR data is wrapped in documents.</p>",
        "id": 248509893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628184860
    },
    {
        "content": "<p>if it is not clear. I agree. However I do also encourage expansion of existing solutions that are working, vs throwing them away.</p>",
        "id": 248514266,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628186979
    },
    {
        "content": "<p>I will also defend documents for cross-organizational communication, as the principles behind document design are important for cross-organizational communication.  FHIR-Documents (like IPS) are easy step, have the benefits of the FHIR model, and have the benefit of fitting perfectly within the existing nationwide networks.</p>",
        "id": 248514515,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628187104
    },
    {
        "content": "<p>Documents suck in terms of data integration.  When I want a list of a patient's allergies, I really don't want 50 C-CDA equivalents that each contain a list of allergies.</p>",
        "id": 248517390,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628188503
    },
    {
        "content": "<p>For data that's naturally a document (discharge summary, pathology report, etc.), then managing the data as documents makes sense.  But for other data, we should avoid solutions that require packaging content into documents because that's the way we're used to sharing across systems.  It's pretty painful to build a SMART app or CDS Hook service on top of a document repository.</p>",
        "id": 248517581,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628188595
    },
    {
        "content": "<p>I said FHIR-Document... and I think there needs to be documents defined for more useful purposes. Such as \"current allergies\"</p>",
        "id": 248518121,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628188860
    },
    {
        "content": "<p>I don't think that this is a mutually exclusive world. I believe that each solution has its place.</p>",
        "id": 248518236,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628188922
    },
    {
        "content": "<p>C-CDA has tarnished the concept of a document. However C-CDA has delivered many positive</p>",
        "id": 248518368,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628188985
    },
    {
        "content": "<p>I am not against a nationwide http RESTful FHIR at the resource level.  Geek excitement. Medical-Records concerned. Patient Safety worried.</p>",
        "id": 248518673,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628189157
    },
    {
        "content": "<p>especially if the only way it will work is with intermediaries.... intermediaries that are there explicitly for the purposes of intermediating security, privacy, and data integrity. What was in the medical record will not be what is received. This breaks integrity, provenance, authentication, authorization, wholeness, and context.</p>",
        "id": 248519025,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628189319
    },
    {
        "content": "<p>A 'current allergies' document is nonsensical.  Anything that is 'current x' as a document is unnecessary overhead, and it puts the work of trying to resolve duplication and redundancy on the client when it should, as much as possible, be done by the intermediary</p>",
        "id": 248525045,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628192025
    },
    {
        "content": "<p>The concept of 'wholeness' is essential when context flows from one data structure to another.  It becomes less critical when context flow is prohibited and all context is required to be explicit in each structure.</p>",
        "id": 248525239,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628192109
    },
    {
        "content": "<p>When an allergy record is updated - that's the only context.  There's no overarching admission, discharge or other event to provide context.  It's just one allergy sitting in a database - that's free to be passed around all on its lonesome.</p>",
        "id": 248525432,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628192183
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179160-social/topic/Multi-hop.20FHIR/near/248525045\">said</a>:</p>\n<blockquote>\n<p>... and it puts the work of trying to resolve duplication and redundancy on the client when it should, as much as possible, be done by the intermediary</p>\n</blockquote>\n<p>On the bright side, if clients are aggregating REST API data from multiple sources, they may already be really good at doing deduplication...</p>",
        "id": 248527002,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1628192965
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I don't think you were clear. Your example was against a centralized CDR (which you did not state), while you presumed mine was not. Both transports could support a CDR. I will add that IHE did define a fhir resource level api to a CDR with mechanism to interact with the existing nationwide health network. mXDE + QEDm . This could be centralized,  regionalized, or organization deployed. Privacy by Design is also a principled design.</p>",
        "id": 248534340,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628196543
    },
    {
        "content": "<p>I'm not arguing against Privacy by Design, or minimizing privacy concerns about TEFCA.  I'm saying that if all we get out of TEFCA is document exchange, we've lost a tremendous opportunity.</p>",
        "id": 248545582,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628202584
    },
    {
        "content": "<p>I agree, <br>\nbut trying to twist a Document Exchange into a Resource Exchange is not the right approach. (The highway and railroad are similar but very different.).    Architecting a http RESTful FHIR nationwide network should re-use some parts of the existing network, but should NOT be the same architecture. </p>\n<ul>\n<li>the QHIN and HISP models of the past should not be needed in a RESTful FHIR environment. </li>\n<li>I am not saying that some new system like a CDR is not needed, but a CDR is not at all the same thing as a QHIN or HISP.   And a CDR should not be a national level service for many political and privacy reasons. Thus it is a service offering (read business opportunity) not something baked into the architecture.</li>\n</ul>\n<p>What parts should we keep? I think there is very little that spans these two architectures. </p>\n<ul>\n<li>Likely Certificate Authority trust fabric, but even that needs adjustment for the different needs of the participants in that trust fabric. </li>\n<li>I think Patient Identity must be kept simply because we can't do patient identity properly and thus one hack is as good as another.</li>\n<li>possibly Services Directory. but this will only look similar at the organization level.</li>\n<li>I would like to say Audit Logging, but this doesn't exist at all today, and likely won't exist properly ever <br>\nall of these are unclear. Not because they are bad, but because the architecture difference brings different systems design needs. All of these could/should be used to begin with with the expectation that they WILL be re-architected once the http REST fabric is functional (I still have hope that patient identity will be taken seriously eventually).</li>\n</ul>",
        "id": 248615510,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628258936
    },
    {
        "content": "<p>My understanding (could be wrong) is that TEFCA wasn't intended to be limited to just document exchanges?</p>",
        "id": 248639969,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628269933
    },
    {
        "content": "<p>It has two aspects, Document query and retrieve plus messaging.  So, you can fetch documents or send a \"message\" to a remote provider.</p>",
        "id": 248641164,
        "sender_full_name": "David Pyke",
        "timestamp": 1628270497
    },
    {
        "content": "<p>Ok, so no support for RESTful query at all?  Then I guess you're stuck with FHIR documents or FHIR messages.  I hope that HL7 as an organization will be providing feedback that suggests that that's not the foundation we should be aiming for.  I know that at least some of the networks already support FHIR query, so it seems odd to not address that in this spec.</p>",
        "id": 248646275,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628272868
    },
    {
        "content": "<p>No RESTful query or operations at the QHIN level, people below the QHINs can send info differently but the QHINs are purely XCA/XCDR operations using CCDAs except for special requests or special purpose data (e.g., public health)</p>",
        "id": 248650437,
        "sender_full_name": "David Pyke",
        "timestamp": 1628274771
    },
    {
        "content": "<p>This said... this is not a restriction on a new proposal for a proper FHIR REST nationwide network.</p>",
        "id": 248671407,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628285750
    },
    {
        "content": "<p>I wrote up my stepping stone <a href=\"https://healthcaresecprivacy.blogspot.com/2021/08/fhir-data-in-existing-nationwide-health.html\">https://healthcaresecprivacy.blogspot.com/2021/08/fhir-data-in-existing-nationwide-health.html</a><br>\nI have no intention that this be a destination. I fully agree with more native http RESTful FHIR. Just alot of capabilities need to be created for that to work. Things that the nation already has with documents. So both pathways.</p>",
        "id": 248974696,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628600212
    }
]