[
    {
        "content": "<p>I want to understand from infrastructure perspective, what is needed to make a communication between two entities FHIR enabled. Those two entities (or providers) will be exchanging documents and messages using FHIR. So for someone who does not understand FHIR at all, how can you explain the steps to take to enable FHIR based transactions?<br>\n For example, Provider A needs to follow this implementation guide and build resources, or FHIR server, somebody needs to create or connect with SMART on FHIR etc. Appreciate your guidance.</p>",
        "id": 159456451,
        "sender_full_name": "pallavi talekar",
        "timestamp": 1551213700
    },
    {
        "content": "<p>I'd start from what the two entities need / want to communicate</p>",
        "id": 159457705,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1551214713
    },
    {
        "content": "<p>Also, consider whether you really want messages.  Most FHIR implementation is via REST and that will typically be easier.</p>",
        "id": 159466117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551221453
    },
    {
        "content": "<p>Hi All, I am new to FHIR, either a documentation will help me install and set up FHIR ?</p>",
        "id": 184036544,
        "sender_full_name": "Yohannes Tecle",
        "timestamp": 1576983832
    },
    {
        "content": "<p>FHIR is a specification, not a product.  It's also a specification that can be used to do a wide variety of different things.  Can you share more about what you're hoping to accomplish with FHIR?</p>",
        "id": 184038715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576988668
    },
    {
        "content": "<p>Thank you Lloyd for the reply, I am working to develop a bi-directional data exchange with eClinical Works (eCW)</p>",
        "id": 184113531,
        "sender_full_name": "Yohannes Tecle",
        "timestamp": 1577116668
    },
    {
        "content": "<p>Do you know what sort of FHIR interface eCW has?  (FHIR version, REST vs. Messaging, what resources, etc.). Youll have to write code to map between your internal interface and FHIR.  You might look at using one of the reference implementations handle parsing, serialization and some of the other non-app-specific bits</p>",
        "id": 184117931,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1577120887
    },
    {
        "content": "<p>Thank you so much Llory for the reply, I truly appreciate for your input, it is REST API for FHIR that I have to develop.</p>",
        "id": 184122197,
        "sender_full_name": "Yohannes Tecle",
        "timestamp": 1577124960
    }
]