[
    {
        "content": "<p>Should we create a new stream for FHIR outreach, publicity, public awareness activities?</p>\n<p>As a career marketing guy (before my cancer) and now evangelist for the patient cause (and its relatives), I'm keenly attuned to the tasks we'll face someday (perhaps soon) of raising awareness of FHIR beyond its current circles.  This will involve some sorts of networking, social media outreach, articles in health IT journals, outreach to various patient / caregiver populations, etc. </p>\n<p>A current example is the <a href=\"https://tincture.io/yes-it-does-look-like-fhir-will-enable-gimme-my-data-3163afa94409\" target=\"_blank\" title=\"https://tincture.io/yes-it-does-look-like-fhir-will-enable-gimme-my-data-3163afa94409\">blog series</a> on the Tincture healthcare blog, which I've been talking about in the #patient-empowerment stream. </p>\n<p>I'm aware that there's a trade-off between being orderly (keeping separate things in tidily labeled buckets) and being visible, because messages in the neatly labeled buckets may not be seen by people who should see them.</p>\n<p>If we don't create a new stream now (yet), where should such messages live for now?</p>",
        "id": 168234166,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560656639
    },
    {
        "content": "<p>Not sure. typically we handle that at exec level without the open-ness of this forum</p>",
        "id": 168234321,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560656949
    },
    {
        "content": "<p>It would be good to know what educational materials have already been developed (and can be used by all). I think the ONC has some things??? but i only see these types of materials when i accidentally find  them. Links to good articles and educational materials about things going on that impact patients would be good to have somewhere. Most patients and physicians really do not understand the law. Part of the success of FHIR will be based on patients requesting it. If they don't know they have that right...they will not feel empowered to push for the app of their choice. Maybe this topic should be under patient empowerment? Not sure.</p>",
        "id": 168348541,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560806373
    },
    {
        "content": "<p>I don't think we have any central registry of those things. the nearest we have is</p>",
        "id": 168349558,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560807216
    },
    {
        "content": "<p>which is not well maintained anyway</p>",
        "id": 168349586,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560807240
    },
    {
        "content": "<p><a href=\"http://wiki.hl7.org/index.php?title=FHIR_Teaching\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Teaching\">http://wiki.hl7.org/index.php?title=FHIR_Teaching</a></p>",
        "id": 168349587,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560807241
    },
    {
        "content": "<p>So, <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> , it sounds like one category of work for our team will be what marketers call <a href=\"https://en.wikipedia.org/wiki/Marketing_collateral\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Marketing_collateral\">collateral</a> - are you a marketer? I don't remember.  It exists in support of the general work of outreach, aka building awareness, welcoming people into our world, etc.  (I'm saying this as much for others as for you)</p>",
        "id": 168351048,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560808506
    }
]