[
    {
        "content": "<p>I have recently been added to the GitHub repo for the dotnet C# library called nhapi which is a port of the java library hapi since Dwayne ( author) doesnt have time to maintain it. However it uses the hl7 access database to generate the c# classes. Who could I speak to about obtaining a copy of the databases legitimately for free so that I am able to support the nhapi project.</p>",
        "id": 212930227,
        "sender_full_name": "Jake Aitchison",
        "timestamp": 1602356793
    },
    {
        "content": "<p>well, you could try <a href=\"mailto:markmcd@hl7.org\">markmcd@hl7.org</a> but it seems unlikely that this would be ok to me.</p>",
        "id": 212980241,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602447891
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I have emailed hq to ask if they are willing to support open source hl7 tooling in this way, otherwise it would be a bit of a barrier for anyone to maintain the NHapi library.</p>",
        "id": 213002080,
        "sender_full_name": "Jake Aitchison",
        "timestamp": 1602484339
    },
    {
        "content": "<p>I understand. The IP rules around v2 collateral predate the rise of open source. </p>\n<p>But you can also understand that it would be appropriate for people maintaining open source implementations to be members - I don't know whether you are, but that might come up when you talk to Mark / HQ</p>",
        "id": 213002133,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602484439
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"353190\">@Jake Aitchison</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>   I'm not sure if this is relevant :-) but as a one-year newbie around here I'll support the idea of membership, because of two things:  things change FAST around here, AND they have deep roots which cause many implications if things aren't done with awareness of nuance.  </p>\n<p>Happily, the people with all that institutional knowledge are very available and generous with their time, which seems to be why this movement has invented something new in a relatively-few years that's become REAL, and it really works.  But honestly it would be hard to get involved peripherally and have any confidence that you'd be able to keep up with both current function and future intent.  With both, great things can happen reliably; without both, obsolescence is likely.</p>\n<p>I think that's true of any important new emerging reality, which this is.</p>\n<p>They'll correct me if I'm wrong on any of this, or otherwise naive etc.</p>",
        "id": 213156519,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1602597013
    }
]