[
    {
        "content": "<p>Hi all, does anyone have any recommendations on projects/products that can be used to demonstrate FHIR server capabilities?  I'm looking for something like an EMR where I could fill out a handful of core resources (Patient, Condition, Appointment, etc.) and submit them to a FHIR server.</p>\n<p>OpenEMR has a subset of this functionality, but (as of now) the publishing as FHIR is limited to just Patient and Encounter resources.</p>\n<p>Thanks for any recommendations!</p>",
        "id": 204975515,
        "sender_full_name": "Josh Collins",
        "timestamp": 1595632294
    },
    {
        "content": "<p>sounds like any of the main FHIR servers would serve the task you have described?</p>",
        "id": 204975740,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595632559
    },
    {
        "content": "<p>Perhaps so, and my ignorance is limiting me.  Do you have some specific examples?  For instance, with HAPI's default UI one could perform CRUD operations of resources, but it is very technically focused as opposed to a more patient-centric set of views.</p>",
        "id": 204977868,
        "sender_full_name": "Josh Collins",
        "timestamp": 1595635185
    },
    {
        "content": "<p>ClinFHIR is the most 'friendly' - we use it for clinicians to play and experiment with FHIR.  However, it's still pretty \"FHIR-ish\" - you deal with Observations, not lab results or vital signs.</p>",
        "id": 204980993,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595639328
    },
    {
        "content": "<p>Is there a directory of servers somewhere, and/or maybe FAQ or \"start here\" for new developers?  Maybe a <a href=\"http://fhir.org/faq\">http://fhir.org/faq</a></p>",
        "id": 205002486,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1595680878
    },
    {
        "content": "<p>This question seems to be about client more than server, but there's a list of public test servers pointed to at the bottom of the FHIR home page.</p>",
        "id": 205004907,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595685452
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>!  You are correct - I'm looking for a client.  Good tip on ClinFHIR, it is a bit more FHIR-centric than I'd like, but may do the trick.  If anyone else has any suggestions on where to look I'd appreciate it.</p>",
        "id": 205005520,
        "sender_full_name": "Josh Collins",
        "timestamp": 1595686441
    },
    {
        "content": "<p>OpenMRS is an open source EHR that I understand has decent FHIR support, but I have no direct experience with it.</p>",
        "id": 205005581,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595686551
    },
    {
        "content": "<p>I was looking at it earlier this morning.  It looks like it has a nice means of exposing data as FHIR, but I'm going through documents to figure out if there is already a mechanism to push that FHIR elsewhere (or some means of pinging another server so that it can call back into those FHIR APIs).</p>",
        "id": 205006063,
        "sender_full_name": "Josh Collins",
        "timestamp": 1595687325
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"265797\">@Josh Collins</span> - sing out if you want any pointers on ClinFHIR.  There's a couple of modules that may be of interest depending on your specific needs...</p>",
        "id": 205016423,
        "sender_full_name": "David Hay",
        "timestamp": 1595702636
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"265797\">@Josh Collins</span> I've gotten a month or so behind on the state of OpenEMR FHIR development, but work is in progress to support a considerably broader range of resources (as would be expected to cover most standard EHR data).  If you work with the tip revision it may have most (or at least a lot) of what you want.</p>",
        "id": 205156905,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1595877312
    }
]