[
    {
        "content": "<p>Hi all, I am a student at UW looking into FHIR and integrations as related to the opioid crisis. I just found this chat and am hoping to ask someone knowledgeable regarding the current status of launch/implementation in various medical systems and states -- if this is not a good place to ask, please redirect me!</p>",
        "id": 158393192,
        "sender_full_name": "Dina B",
        "timestamp": 1550010033
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"203666\">@Dina B</span> , there is a lot of work in this area, but one project I'm currently involved with is using FHIR resources and CQL to express computable representations of the recommendations in the Opioid Prescribing Guideline. You can see the current build of the implementation guide <a href=\"http://build.fhir.org/ig/cqframework/opioid-cds/\" target=\"_blank\" title=\"http://build.fhir.org/ig/cqframework/opioid-cds/\">here</a>.</p>",
        "id": 158411376,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1550031164
    },
    {
        "content": "<p>Yes, I have seen that, and it is awesome!! I am super impressed. I'm curious if it's in use in any systems yet?</p>",
        "id": 158413095,
        "sender_full_name": "Dina B",
        "timestamp": 1550033868
    },
    {
        "content": "<p>In particular, I am wondering if there is a way for me to see which systems already implement/use <a href=\"http://build.fhir.org/ig/cqframework/opioid-cds/\" target=\"_blank\" title=\"http://build.fhir.org/ig/cqframework/opioid-cds/\">http://build.fhir.org/ig/cqframework/opioid-cds/</a> and if there is any research/evidence about the success of the system in yielding \"better\" prescriptions in places it has launched. I see that at least UW and Swedish hospitals have FHIR endpoints already -- curious if they are being used and if so for what purposes (e.g., <a href=\"https://fhir.epic.medical.washington.edu/FHIR-Proxy/api/FHIR/DSTU2/\" target=\"_blank\" title=\"https://fhir.epic.medical.washington.edu/FHIR-Proxy/api/FHIR/DSTU2/\">https://fhir.epic.medical.washington.edu/FHIR-Proxy/api/FHIR/DSTU2/</a>). Thank you in advance!</p>",
        "id": 158413140,
        "sender_full_name": "Dina B",
        "timestamp": 1550033906
    },
    {
        "content": "<p>From a lab testing perspective for opiates, there are several aspects that might apply.  O&amp;O WGs include LIVD (Lab In Vitro Diagnostics), O&amp;O, Service Catalog (for drug screen orders from lab catalogs),  FHIR Workflow (order, specimen collection, testing, reporting); Specimen DAM (specimen info for testing), etc.  However, not sure what FHIR implementations are in production as it hasn't permeated clinical labs quite yet as current regulatory and reporting requirements are HL7 v2 format.</p>\n<p>For the public health aspects, you may wish to see the last CLIAC meeting slides and presentations on testing and what CDC and health departments are reporting.</p>",
        "id": 160211501,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1551975151
    }
]