[
    {
        "content": "<p>Hi! HIMSS 2020 Europe is organized in Helsinki, Finland in late May. To give people even more incentives to come to Helsinki, we're considering organizing a number of side events both before and after the HIMSS conference.</p>\n<p>Regarding that, what should we take into account, if we'd like to organize a FHIR related connectathon event close to the HIMSS conference? Can we just prepare for and organize it? Do we need some kind of bureaucracy with HL7 to be able to do it? Or should we just abandon the thought altogether?</p>",
        "id": 184652109,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1577973031
    },
    {
        "content": "<p>Are there any limits on the scope of your intended audience, or other purpose?</p>\n<p>Is anything similar planned for US HIMSS?  (If not, why not?)</p>",
        "id": 184666539,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1577984906
    },
    {
        "content": "<p>Dave, all connectathons are pre-events for a 'show' like HIMSS, especially the Interop Showcase. There is also the IHE Connectathon coming up in January <a href=\"https://www.iheusa.org/ihe-connectathon-overview\" target=\"_blank\" title=\"https://www.iheusa.org/ihe-connectathon-overview\">https://www.iheusa.org/ihe-connectathon-overview</a></p>",
        "id": 184667285,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577985498
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> Just go ahead and organize. You don't need \"official\" permission to do so. If you'd like some of us to show up as speakers, tutors or programmer-assistants, just give this stream a shout.</p>",
        "id": 184725942,
        "sender_full_name": "René Spronk",
        "timestamp": 1578050034
    },
    {
        "content": "<p>If you want the connectathon to 'count' from a FHIR resource maturity level perspective, there are a few criteria you need to adhere to.  The criteria are here: <a href=\"https://wiki.hl7.org/FHIR_Connectathons\" target=\"_blank\" title=\"https://wiki.hl7.org/FHIR_Connectathons\">https://wiki.hl7.org/FHIR_Connectathons</a> (<span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span> I couldn't find this page migrated to Confluence yet?)  Essentially the event needs to be open, you need to make clear what the scenarios are in advance and the results need to be reported and shared with HL7's FHIR Management Group.</p>",
        "id": 184741332,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578064819
    },
    {
        "content": "<p>Thanks Lloyd, that's really useful and good to know.</p>",
        "id": 184793570,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1578124344
    },
    {
        "content": "<p>Hi, Mikael! Great initiative! Health Samurai would be glad to participate and help with the FHIR connectathon. Let's connect! <span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span></p>",
        "id": 184834215,
        "sender_full_name": "Pavel Smirnov",
        "timestamp": 1578201080
    },
    {
        "content": "<p>I was supposed to be there, but I can't commit to any travel in late May until maybe March</p>",
        "id": 184848370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1578229838
    }
]