[
    {
        "content": "<p>I've yet to find a solution where I can bring my multi-national healthcare record together, and trust the solution not to mess it up. Does anyone have recommendations?</p>",
        "id": 178666795,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1571672053
    },
    {
        "content": "<p>By \"solution\" do you mean an app?</p>\n<p>I have a naive question: what difference does the country make?</p>",
        "id": 178667113,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571672274
    },
    {
        "content": "<p>There is a HL7 project \"International Patient Summary (IPS)\"<a href=\"http://international-patient-summary.net/mediawiki/index.php?title=Main_Page\" target=\"_blank\" title=\"http://international-patient-summary.net/mediawiki/index.php?title=Main_Page\">http://international-patient-summary.net/mediawiki/index.php?title=Main_Page</a></p>",
        "id": 178667961,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1571672753
    },
    {
        "content": "<p>countries mandate different access approaches, and different coding systems, and have other differences in their information characteristics. The idea that people will \"bring my multi-national healthcare record together\" has only very recently got any traction</p>",
        "id": 178668104,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571672822
    },
    {
        "content": "<p>IPS is one approach - make every country translate to a single information set. There's  a different approach we are also working on - a single common access API, without fixing the information agreements</p>",
        "id": 178668234,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571672883
    },
    {
        "content": "<p>I am troubling how to bring my data from one state to another inside US. :(</p>",
        "id": 178668304,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1571672937
    },
    {
        "content": "<blockquote>\n<p>I've yet to find a solution where I can bring my multi-national healthcare record together, and trust the solution not to mess it up. Does anyone have recommendations?</p>\n</blockquote>\n<p>I also really need one of those. <br>\nI'm more interested in patient-centric records, and not patient summaries. Summaries are for a given purpose, they are not the patient record nor they are designed to contain the information I want</p>",
        "id": 178691281,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1571687547
    },
    {
        "content": "<blockquote>\n<p>I have a naive question: what difference does the country make?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> some examples: Besides language issues which affect any narrative<br>\nHalf my record is in country 1, other half in country 2, a bit in country 3<br>\nI took meds in country 1 that are not available for sale in country 2. <br>\nVaccination schemas are different in country 1 and 2.<br>\nPrivacy and disclosure rules may be different in countries 1 and 2. <br>\nNot sure how many of these are relevant, but things do get interesting.</p>",
        "id": 178692257,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1571688033
    },
    {
        "content": "<p>My daughter will have her vaccination scheme in FHIR (she's helping type it in XML). <br>\nI will not use a summary, but the actual detailed resources (events and requests) because it is not a summary, it is her lifelong record.</p>",
        "id": 178692501,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1571688151
    },
    {
        "content": "<p>I'm still to see the specs of this <br>\n<a href=\"https://www.andaman7.com\" target=\"_blank\" title=\"https://www.andaman7.com\">https://www.andaman7.com</a></p>",
        "id": 178692910,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1571688375
    },
    {
        "content": "<p>Multi-national health record is basically a prosumer use case.  It needs a tool that you can load up different types of health records from different regions and do translations and mappings.  Hopefully with some sort of workflow or wizard to help define where you're starting from and where you're trying to wind up at.  Which is ostensibly what Symptomatic has been trying to develop.    I would be surprised if any such software will ever be inexpensive.  It seems like it's in the realm of TurboTax, Adobe Acrobat, and similar software in the $100+ price point.  It's still a poorly defined market.</p>",
        "id": 178694382,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1571689287
    },
    {
        "content": "<p>Interesting distinction being made between patient-centric records and patient summaries. Essentially, most key consumer health data is generic across borders...active ingredients of medications,  conditions, allergies, key health indicators (vitals in clinician-speak), diseases immunized against, etc. and wellness data is now available in many wearable devices. The biggest challenges are with health system intervention data (schedules, requests, admissions, encounters, etc.), much of which is domain specific. Maybe the later is always going to reside in provider-centric apps informing (or informed by?) patient health and wellness apps?</p>",
        "id": 178711742,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1571703307
    },
    {
        "content": "<p>I'm EXTREMELY EXTREMELY longing for parallels from other industries!  Have there never been other cases where data from different cultures (or mental models) has come together, eventually?</p>\n<p>I can imagine that at first the data is combined into a heap that's not harmonized, and either the users need to adjust or maybe we just live with lower quality data. Then eventually after some years, systems start creating new data in a newly defined universal language.</p>\n<p>Has this not happened elsewhere?</p>",
        "id": 178715035,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571707522
    },
    {
        "content": "<p>Take languages: currently English is the de-facto language for 'international exchange', but there are lots of differences between the English spoken in country A versus country B. At one time (in the western world, that is) French played this role, or Latin, or Greek. One can debate as to why English \"won out\" to be the current language for international exchanges, and most of the reasons mat actually not be related to the fact of whether or not it's the most easy language to use (then we'd be using Esperanto), but lots of cultural and economical aspects come into play. Are we ever going to achieve universal harmonization when it comes to the use of English? That's extremely unlikely. Cultures differ, which is why they need different words. You can create <a href=\"https://simple.wikipedia.org/wiki/Simplified_English\" target=\"_blank\" title=\"https://simple.wikipedia.org/wiki/Simplified_English\">https://simple.wikipedia.org/wiki/Simplified_English</a> , but then you'll have to accept that you won't be able to express certain complex concepts.</p>",
        "id": 178727250,
        "sender_full_name": "René Spronk",
        "timestamp": 1571726330
    },
    {
        "content": "<p>FHIR, like all interoperability standards, is only really useful when one contextualises (a.k.a. constrains, profiles) it for use in a specific project (e.g. country, region, hospital or software vendor). During training courses I'm quite often asked that \"certainly, these then inhibit the international exchange of clinical data\". To which my response is: Yes, they do. But you worrying about international exchange kind of assumes that you already have interoperability at the national level up and running. <br>\nThe EU spent millions of Euros on interoperability projects at the national/international level, but in certain countries such attempts fall flat on their face because the hospitals barely have their own hospital-internal interoperability in working order.  Leap frogging should not be attempted, take one step at a time. Something like the IPS may be realistic for a country like Finland (with a well established national infrastructure), but for most countries it's simply a bridge too far. <br>\nIPS is like \"simplified FHIR\" (to use an analogy with Simplified English). It'll work, but it still assumes the reader to understand a particular set of clinical / administrative concepts which exists in any healthcare context.</p>",
        "id": 178727830,
        "sender_full_name": "René Spronk",
        "timestamp": 1571726943
    },
    {
        "content": "<p>Is there a hall of fame for essays about interop, for people who are new to the subject and have impossible expectations? Seriously, this ought to be in it.</p>",
        "id": 178739233,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571737839
    },
    {
        "content": "<p>Yes, FHIR is just half the language. Terminology is the other part . Should we all speak SNOMED, LOINC, ATC, RxNorm, ICD-10, IDMP and/or (fill in your favourite). SNOMED CT has the potential to be a reference terminology for automatic translations, but it's a long road for true international semantic interoperability.</p>",
        "id": 178752457,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1571749011
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> yes, an app :)</p>\n<p>My healthcare record is in Canada, Australia, NL... I'm looking to actually piece it together.</p>",
        "id": 178765287,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1571757174
    },
    {
        "content": "<p>One such solution <a href=\"http://andaman7.com\" target=\"_blank\" title=\"http://andaman7.com\">Andaman</a> and their \"liquid data model\" is <a href=\"https://www.andaman7.com/en/news/andaman7-technology-series-4-liquid-data-model\" target=\"_blank\" title=\"https://www.andaman7.com/en/news/andaman7-technology-series-4-liquid-data-model\">described here</a>. Looking to see if there's alternatives to this.</p>\n<p>edit: read through the thread and noticed <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> already mentioned it :)</p>",
        "id": 178765876,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1571757543
    },
    {
        "content": "<blockquote>\n<p>Yes, FHIR is just half the language. Terminology is the other part . Should we all speak SNOMED, LOINC, ATC, RxNorm, ICD-10, IDMP and/or (fill in your favourite). SNOMED CT has the potential to be a reference terminology for automatic translations, but it's a long road for true international semantic interoperability.</p>\n</blockquote>\n<p>For this reason and everything else, I would love to see us collect specimens of interop (local or regional or international) where interop SUCCEEDED in making important info available at a distant point of need. </p>\n<p>This would let us (including a broader community) start to characterize where interop is fairly mature, and also where it most often is not. This could be useful in responding to uninformed \"gut feel\" complaints about the status of things.</p>",
        "id": 178780714,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571767650
    },
    {
        "content": "<blockquote>\n<p>... worrying about international exchange kind of assumes that you already have interoperability at the national level up and running. </p>\n</blockquote>\n<p>I wonder if my hunger for a simple layman's analogy (for public discussions) can be served by introduction of the Euro.   Is it fair to say this:</p>\n<p>\"If an undeveloped country doesn't have a stable banking system, so they can't even exchange payments reliably within the country, there's no way the Euro is going to let them 'interop' with the rest of Europe.\"</p>\n<p>Is that a valid analogy on this point?</p>",
        "id": 178781024,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571767850
    },
    {
        "content": "<p>The closest thing I can think of outside health like this is probably <a href=\"http://tripit.com\" target=\"_blank\" title=\"http://tripit.com\">tripit.com</a> that you send all travel plans, and they normalize it for display. No idea what's going on in the back, but it's a very cool experience I've been using for years now. Same for chronic health would really change things.</p>",
        "id": 178800863,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571779593
    },
    {
        "content": "<p>Euro has governance that says whether you can play or not.  With healthcare data, nothing stops two arbitrary participants from trying.</p>",
        "id": 178801041,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571779766
    },
    {
        "content": "<blockquote>\n<p>The closest thing I can think of outside health like this is probably <a href=\"http://tripit.com\" target=\"_blank\" title=\"http://tripit.com\">tripit.com</a> that you send all travel plans, and they normalize it for display. </p>\n</blockquote>\n<p>Right, but there's like ZERO semantic interop difficulty in \"ARN-SYD\" with times &amp; time zones attached, eh? :-)</p>",
        "id": 178805904,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571784322
    },
    {
        "content": "<blockquote>\n<p>Euro has governance that says whether you can play or not.  With healthcare data, nothing stops two arbitrary participants from trying.</p>\n</blockquote>\n<p>BINGO: I bet a key factor is whether a given country has its $4!t together internally!</p>\n<p>Serious hypothetical question: what if we didn't let anyone TRY to interop until they can talk to THEMSELVES reliably?</p>\n<p>The answer to that is that incentives are misaligned: \n* Euros: the individual country may WANT to be in the Euro community; many HCPs aren't motivated\n* Tripit: the individual data provider has nothing to lose by the data being shared\n* Health IT: individual providers have little to gain INDIVIDUALLY from interop ... the \"only\" gain is better care.</p>\n<p>Agree? Argue?</p>",
        "id": 178806514,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571784948
    },
    {
        "content": "<p>This will be simpler than many seem to believe IF the requirements are viewed purely from a consumer perspective. Aggregating provider-centric records from traditional EHRs will always be difficult, even within the same country. However, none of these products have been designed with the consumer in mind and even the patient portal products that I've seen and used in NZ for many years still present a provider and system view of the data and are merely an improved means for interacting with that system (e.g. making appointments).  Only a small percentage of the data in the patient portal provided by the PMS vendor who supplies my GP practice is fit for the purpose of monitoring my health and wellness  - my Fitbit app is far more useful.</p>",
        "id": 178811668,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1571789957
    },
    {
        "content": "<p>Aggregating data like step counts is easy - you don't have to worry about duplication.  Aggregating drugs is harder because there's potential for duplication, particularly in the MedicationUsage space.  It gets messier still when you're trying to aggregate Conditions and Allergies where there may be 20+ records referring to the same medical 'fact' but each reflecting a slightly different (and occasionally inaccurate) view of it.</p>",
        "id": 178812189,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571790434
    },
    {
        "content": "<p>See <a href=\"https://www.sitra.fi/en/projects/ihan-pilot-projects/#what-is-it-about\" target=\"_blank\" title=\"https://www.sitra.fi/en/projects/ihan-pilot-projects/#what-is-it-about\">https://www.sitra.fi/en/projects/ihan-pilot-projects/#what-is-it-about</a> for a short description of a project (My Travel Health) that uses IPS between Finland and Japan.</p>",
        "id": 178823324,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1571807675
    },
    {
        "content": "<blockquote>\n<p>Aggregating drugs is harder because there's potential for duplication, particularly in the MedicationUsage space.  It gets messier still when you're trying to aggregate Conditions and Allergies where there may be 20+ records referring to the same medical 'fact' but each reflecting a slightly different (and occasionally inaccurate) view of it.</p>\n</blockquote>\n<p>Therein lies the case for patient-curated, personal health and wellness records, rather than aggregated health system interventions often expressed in varying degrees of uncertainty.</p>",
        "id": 178826379,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1571812571
    },
    {
        "content": "<p>That's the key part there, patient curated.</p>",
        "id": 178829317,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571816370
    },
    {
        "content": "<p>Or patient-centric, curated by the systems on the behalf of patients. Patients are too busy getting healthy. I hope that some day systems will have such data as an asset, and not as a by-product as (sometimes?) they do now.</p>",
        "id": 178835694,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1571822093
    },
    {
        "content": "<p>I agree more with Peter / Brian - getting the Patient (or their representative) to do it - and providing mechanisms to assist them - is the way to go. After all, who knows better what is actually being taken? (Even if they might not know what for...)</p>",
        "id": 178845830,
        "sender_full_name": "David Hay",
        "timestamp": 1571831764
    },
    {
        "content": "<p>Indeed. I did want not want to diverge, I think that the patient can be the master, but not the sole actor in patient-centric data. Hospital systems and others should eventually help there.</p>",
        "id": 178847994,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1571833537
    },
    {
        "content": "<p>The key is that curation of some sort seems necessary.  Whether that's by the patient, a care-giver, clinicians, AI or some combination of all of those, curation will be required.  And curation will only be effective if data is accompanied by sufficient metadata to allow reasonable inferences about which data is likely most accurate.  Merely dumping all of the data together won't be enough because at the time of care delivery, no one will have time to wade through the pile.</p>",
        "id": 178848961,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571834313
    },
    {
        "content": "<blockquote>\n<p>That's the key part there, patient curated.</p>\n</blockquote>\n<p>As we think about adoption and dissemination, we need to be conscious of the spread of abilities in the patient population.  It would be GREAT if we could create a \"newbie e-patient get-your-data\" tutorial....   I'll put a link to this in the Patient Empowerment stream.</p>",
        "id": 178857378,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571840037
    },
    {
        "content": "<p>One essential part of curation is going to be baselining and 'rollup' of records.  Weight is a good example of an easily collected datapoint that doesn't have a whole lot of clinical value and where many individual data points need to be rolled up into an average.   Once a patient gets onto more complicated treatment plans that might involve quarterly or monthly blood draws, then the blood panel data needs to be rolled up after the first year or two.  </p>\n<p>The best data model I've come up with for a baseline+rollup starts with an <code>Observation.referenceRange</code> and a Bundle/Array, and then includes an averaged value and the most recent value.  But averaged value might not be the same as the baseline value.  So, there's actually three values going on, similar to mean, median, and mode, plus the underlying data.</p>\n<p>I'd be real interested in discussing the possibility of extending the Observation resource to include <code>baseline</code> and <code>averaged</code> to the list of ObservationStatus codes.  Also, extensions to convert an Observation into a synthetic observation.  This could be a good use case for the newly created <code>Evidence</code> resource maybe.  But regardless, it would be really great if we could have an Observation with a status type of 'averaged' that includes a shadow array of other Observation resources.</p>",
        "id": 178864094,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1571843864
    },
    {
        "content": "<p>perspective is important... one persons \"curation\" is another persons \"messing up\"... I suspect that we as a population will need plenty of experimentation on this topic. Thus I am in favor of many models being tried. To expect that we know what the best model is, is naive.</p>",
        "id": 178879830,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571853836
    },
    {
        "content": "<p>And that's assuming that there is some sort of global 'best', and it's not fundamentally relative to the environment (healthcare is local, afterall).  The huge challenge with EHRs is 'workflow' with every user role wanting a different dashboard and set of information.  We have all sorts of reasons to believe that patients will be exactly the same, and want different dashboards and models based on their particular conditions.</p>",
        "id": 178881823,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1571855085
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 178891945,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571861677
    },
    {
        "content": "<blockquote>\n<p>I'm EXTREMELY EXTREMELY longing for parallels from other industries!  Have there never been other cases where data from different cultures (or mental models) has come together, eventually?</p>\n<p>I can imagine that at first the data is combined into a heap that's not harmonized, and either the users need to adjust or maybe we just live with lower quality data. Then eventually after some years, systems start creating new data in a newly defined universal language.</p>\n<p>Has this not happened elsewhere?</p>\n</blockquote>\n<p><a href=\"https://en.wikipedia.org/wiki/Open_banking\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Open_banking\">https://en.wikipedia.org/wiki/Open_banking</a></p>",
        "id": 179187246,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1572210676
    },
    {
        "content": "<blockquote>\n<p>I've yet to find a solution where I can bring my multi-national healthcare record together, and trust the solution not to mess it up. Does anyone have recommendations?</p>\n</blockquote>\n<p>what data format? I guess you could easily scan all your records and store the PDF's safely somewhere - like spideroak</p>",
        "id": 179187527,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1572211100
    },
    {
        "content": "<p>open banking is a mess around the world, so far as I can tell</p>",
        "id": 179188098,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572212161
    },
    {
        "content": "<p>PSD2 in Europe is very interesting. One bank (ie. app) can show information from your other banks, some services as well I believe.</p>",
        "id": 181191660,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1574242670
    }
]