[
    {
        "content": "<p>Hi All,  I am not sure if this is social in nature, but I am new to using Zulip and I am overwhelmed by it.  I'm wondering how to use this tool effectively.  Before I asked a question, I wanted to check if there was a thread about it already, but I could not figure out how to search effectively.  I starred the questions I asked, but I'm not sure how to keep track of \"my threads\".  What advice do you have for a new zulip user on to come up to speed on effective use of the tool? Do you just use it as a \"real-time dialog\" to just ask questions as you bump into them, or do you use it like a database of prior responses that you do research against?  How do you figure out what's been discussed already?</p>",
        "id": 153968063,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1528474840
    },
    {
        "content": "<p>Lisa, I understand it is a different format but I've grown to find it very useful.  I use it most for real time messaging.  Once you navigate streams and topics, it does get easier.  Are you using the browser version or the app?</p>",
        "id": 153968064,
        "sender_full_name": "David Johnson",
        "timestamp": 1528475090
    },
    {
        "content": "<blockquote>\n<p>Lisa, I understand it is a different format but I've grown to find it very useful.  I use it most for real time messaging.  Once you navigate streams and topics, it does get easier.  Are you using the browser version or the app?</p>\n</blockquote>\n<p>Browser version.  I even had trouble figuring out how to reply to you without re-quoting ...that seemed dumb.  I feel like I'm learning to drive a standard transmission and I'm uncomfortable that I can't figure out how to operate the clutch correctly.</p>",
        "id": 153968067,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1528475627
    },
    {
        "content": "<p>I totally get that. <span class=\"emoji emoji-1f601\" title=\"grin\">:grin:</span></p>",
        "id": 153968070,
        "sender_full_name": "David Johnson",
        "timestamp": 1528476729
    },
    {
        "content": "<p>Continued use may lead you to use the app.  I sit in here (<a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a>) and <a href=\"http://chat.hl7.org\" target=\"_blank\" title=\"http://chat.hl7.org\">chat.hl7.org</a> all day so I've grown to prefer the app.</p>",
        "id": 153968071,
        "sender_full_name": "David Johnson",
        "timestamp": 1528476764
    },
    {
        "content": "<p>Hi, Lisa.  There are a number of us who can offer suggestions and help.  Mostly I think it just takes some time and gaining familiarity.  We do use it a lot as a database of prior responses, one that we continue to build up on the fly.  And, as David said, it also works pretty well as a real-time chat (although I do still also use Skype sometimes for that).  I think you will probably be better satisfied with using the app in the long run, but both certainly work.  For figuring out what's been discussed already there are probably several strategies, but I tend to use a combination of browsing through the topics in a stream and then diving in to ones that look relevant/interesting, and/or searching with likely keywords/phrases in streams or topics that might likely have what I'm looking for.</p>",
        "id": 153968072,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1528476765
    },
    {
        "content": "<p>... and when you ask something that has already been answered but after (extensive ;) ) searching you could not find it, others will point to the adequate stream.</p>",
        "id": 153968074,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528477166
    },
    {
        "content": "<p>If you click on the magnifying glass icon beside the search space, it provides you with a cheat-sheet for searching.  Lots of people ask questions without searching, so even if you do a quick cursory search, you're better behaved than most.  I typically use search when I <em>know</em> something has been previously discussed.  I usually find what I'm looking for slightly over half the time - if you don't remember key words/phrases, it can be tough.</p>",
        "id": 153968080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528480754
    },
    {
        "content": "<p>follow up with Zulip team here: <a href=\"https://chat.zulip.org/#narrow/stream/101-design/subject/Answered.20Questions\" target=\"_blank\" title=\"https://chat.zulip.org/#narrow/stream/101-design/subject/Answered.20Questions\">https://chat.zulip.org/#narrow/stream/101-design/subject/Answered.20Questions</a></p>",
        "id": 153968124,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492751
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> I agree that we have great content in here but it's hard to find. Search is very effective by word, but only good if you know the right word (as longtimers like Lloyd probably do).</p>",
        "id": 153968125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492790
    },
    {
        "content": "<p>I'm asking the Zulip team if they have any ideas...</p>",
        "id": 153968126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492802
    }
]