[
    {
        "content": "<p>Ross Martin has suggested on twitter than HIMSS should be cancelled and we should have a Pandemic Control centered connectathon instead.</p>\n<p><a href=\"https://twitter.com/RossMartin/status/1235337067749658630?s=20&amp;fbclid=IwAR0YtGG3Mb6g_H7-i-JdXEXDyrLdUA3bbf8R9ObAskppy9fLTino8EaJWwI\" target=\"_blank\" title=\"https://twitter.com/RossMartin/status/1235337067749658630?s=20&amp;fbclid=IwAR0YtGG3Mb6g_H7-i-JdXEXDyrLdUA3bbf8R9ObAskppy9fLTino8EaJWwI\">https://twitter.com/RossMartin/status/1235337067749658630?s=20&amp;fbclid=IwAR0YtGG3Mb6g_H7-i-JdXEXDyrLdUA3bbf8R9ObAskppy9fLTino8EaJWwI</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/RossMartin/status/1235337067749658630?s=20&amp;fbclid=IwAR0YtGG3Mb6g_H7-i-JdXEXDyrLdUA3bbf8R9ObAskppy9fLTino8EaJWwI\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1152038268160151553/aARGh_Va_normal.png\"></a><p>As a 20+ year member of <a href=\"https://twitter.com/HIMSS\" target=\"_blank\" title=\"https://twitter.com/HIMSS\">@HIMSS</a> and current <a href=\"https://twitter.com/MDHIMSS\" target=\"_blank\" title=\"https://twitter.com/MDHIMSS\">@MDHIMSS</a> Board member (speaking personally), I implore HIMSS to make the bold and powerful decision to cancel next week’s #HIMSS20.\n\nHere are some thoughts and additional asks: /1</p><span>- Ross D. Martin (@RossMartin)</span></div></div>",
        "id": 189763219,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583388656
    },
    {
        "content": "<p>Cancelling HIMSS won't happen. But the other part, In principle, that sounds like a fine idea. And we could lead/participate in one if there was one... but it's not clear to me where the value proposition would be?</p>",
        "id": 189763234,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583388689
    },
    {
        "content": "<p>It seems that what he's calling for is more hackathon than connectathon - i.e. it's about defining new apps/software that could be used rather than strictly testing connectivity of existing solutions, though presumably testing connectivity would be part of the development process.  To be useful, we'd need to know what exists - and what's needed.  Also, it wasn't clear whether the target is just U.S. or if we should look more broadly - the tools that might be helpful in some of the less developed countries would probably be quite different than what would make sense in North America.  <span class=\"user-mention\" data-user-id=\"196971\">@Erin Holt Coyne</span> <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> any thoughts as to what would be helpful?</p>",
        "id": 189763719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583389478
    },
    {
        "content": "<p>As for the European IHE Connectathon, March 23-27, Brussels: All Side-events have been confirmed to take place (unless the Belgian government takes some drastic measures regarding travel or quarantine, which is unlikely). The connectathon event itself may be postponed or cancelled, this is still being discussed, some of the vendors are no longer allowed to travel because of company policies.</p>",
        "id": 189775934,
        "sender_full_name": "René Spronk",
        "timestamp": 1583402878
    },
    {
        "content": "<p>it might  be a very good thing - showing how connected systems can help in a pandemic situation.</p>",
        "id": 189785781,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583411685
    },
    {
        "content": "<p>and the event in Belgium could be a good place to do something like that (too soon?)</p>",
        "id": 189785848,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583411756
    },
    {
        "content": "<p>IHE is exploring making their EU Connectathon virtual.</p>",
        "id": 189787240,
        "sender_full_name": "David Pyke",
        "timestamp": 1583412782
    },
    {
        "content": "<p>I don't know off the top of my head (but pandemic response is a bit out of my normal area). I've passed the question along to the Public Health listserv to see if those folks have any ideas.</p>",
        "id": 189788534,
        "sender_full_name": "Craig Newman",
        "timestamp": 1583413619
    },
    {
        "content": "<p>It's IT ... its supposed to be able to connect beyond country borders ....</p>",
        "id": 189788750,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1583413762
    },
    {
        "content": "<p>It's beyond me to understand the specifics of what would be done, but <a href=\"https://twitter.com/RossMartin/status/1235337071612616704\" target=\"_blank\" title=\"https://twitter.com/RossMartin/status/1235337071612616704\">this</a> seems to be the tweet to unpack: </p>\n<blockquote>\n<p>to demonstrate and release open source components that can be adopted by healthcare organizations and vendors to accelerate data sharing, visualization, AI, research, resource deployment, situational awareness, etc.</p>\n</blockquote>\n<p><strong>Without regard for feasibility,</strong> as I say, my antennas sense that he's right, this could be a great opportunity to demonstrate the value of I.T. in crisis response - doing good for society in a highly noticeable way.</p>\n<p>I wonder what someone like <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> thinks about this.</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/RossMartin/status/1235337071612616704\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1152038268160151553/aARGh_Va_normal.png\"></a><p><a href=\"https://twitter.com/HIMSS\" target=\"_blank\" title=\"https://twitter.com/HIMSS\">@HIMSS</a> should use next week to host a real-time connectathon to demonstrate and release open source components that can be adopted by healthcare organizations and vendors to accelerate data sharing, visualization, AI, research, resource deployment, situational awareness, etc. /4</p><span>- Ross D. Martin (@RossMartin)</span></div></div>",
        "id": 189797221,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583418948
    },
    {
        "content": "<p>Can we imagine any way that relevant data from all kinds of systems could be aggregated in real time using FHIR?</p>\n<p>I keep reading that we don't really know how many cases there are, and therefore don't know the mortality rate, because many people may have it and not be recognized yet, which in turn means that we don't really have accurate maps of spread.  Is there any way to aggregate data on raw symptoms, from physician offices as well as hospitals?</p>",
        "id": 189797658,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583419200
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179160-social/topic/Pandemic.20Connectathon/near/189797658\" title=\"#narrow/stream/179160-social/topic/Pandemic.20Connectathon/near/189797658\">said</a>:</p>\n<blockquote>\n<p>I keep reading that we don't really know how many cases there are, and therefore don't know the mortality rate, because many people may have it and not be recognized yet, which in turn means that we don't really have accurate maps of spread.  Is there any way to aggregate data on raw symptoms, from physician offices as well as hospitals?</p>\n</blockquote>\n<p>I think the above refers to people who may have contracted the virus, but have no symptoms. This is supported by the lack of known cases with young children. Aggregating data on symptoms won't help in that case.</p>",
        "id": 189798075,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1583419440
    },
    {
        "content": "<p>This is done today. yes it could be moved to FHIR. The reason it is leaky and not using FHIR has very little to do with Interop Standards existing or readiness. It has far more to do with politics (federation vs states) and resistance to change and imbalance of costs vs benefit (effort and $$$ are born by those that get the least out of the whole system).<br>\nCourtney's third law: There are no technical solutions to management problems, but there are management solutions to technical problems.</p>",
        "id": 189802160,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583421828
    },
    {
        "content": "<p>Which \"this\"?  Aggregating disease incidence statistics?</p>\n<p>Would FHIR have any effect on how well this can be done or would doing it be just for show, for no benefit?</p>",
        "id": 189807226,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583424575
    },
    {
        "content": "<blockquote>\n<p>Courtney's third law</p>\n</blockquote>\n<p>Hadn't heard of Courtney, but now I'm an instant fan of the corollaries to his second law!</p>\n<blockquote>\n<p>-- First corollary: Perfect security has infinite cost.<br>\n   -- Second corollary: There is no such thing as zero risk.</p>\n</blockquote>\n<p>I don't know why that isn't widely discussed in all the HIPAA privacy conversations!</p>",
        "id": 189807348,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583424647
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179160-social/topic/Pandemic.20Connectathon/near/189807348\" title=\"#narrow/stream/179160-social/topic/Pandemic.20Connectathon/near/189807348\">said</a>:</p>\n<blockquote>\n<p>I don't know why that isn't widely discussed in all the HIPAA privacy conversations!</p>\n</blockquote>\n<p>Did you mean:<br>\n\"I don't know why that isn't widely discussed in all the privacy conversations!\" ?<br>\n:)</p>",
        "id": 189812230,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583427360
    },
    {
        "content": "<p>Yes, except right now in the patient data community there's a lot of talk about what HIPAA does and doesn't cover, which shows up differently in light of those corollaries - it starts to trend toward \"But how much does it matter, if you skip beyond the violation issue to the 'ability to protect against harm' issue.\"</p>",
        "id": 189819132,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583431170
    },
    {
        "content": "<p>I think Ross has a point (several in fact in that tweet storm).<br>\nI had an internal meeting this morning brainstorming on Pandemic related solutions and investigations.  You can be sure someone is going to be investing in this.  There's already been some discussion in a separate thread RE: Screening tools.</p>\n<p>There's long standing US Federal history in addressing the most recent issue in the news of the last year.  Ten years ago, HITSP was assigned use cases we internally called out as Anthrax (Biosurveillance), Katrina (Disaster Preparedness), Bird Flu (Case Reporting).</p>\n<p>The ONC Pulse project came out of the \"Katrina\" use case, and one of our teams is developing that software out for use nationally.</p>\n<p>Connectathon is NOT really the right name for this kind of activity.  It's a \"Hack-a-thon\".  What can we put together, demonstrate some initial viability, and consider for further investment.</p>",
        "id": 189819442,
        "sender_full_name": "Keith Boone",
        "timestamp": 1583431362
    },
    {
        "content": "<p>From my POV, what would really help would be using existing standards to support information gathering by public health. eCR is perfect IF it were widely adopted by industry, and IF it were easier to adopt because vendors have supported the standard by standardizing backend data elements and use of standard codesets over local codes and ad-hoc implementations. </p>\n<p>If it weren’t so painful and relatively unimportant for providers to implement, we’d have much better tools to respond to pandemics today. </p>\n<p>Immediate implementation of currently available standards for case reporting including the necessary adoption of standard codes and code sets would be more helpful than any new FHIR development/hackathon or otherwise. We need sustained effort, public health prioritization, and widespread industry adoption of modern existing standards. </p>\n<p>Could we use this disaster to drum up a _useful_ response using standards developed with community input over the long term, rather than ideas that misunderstand our working environment woefully? </p>\n<p>We don’t need new standards, we just need vendors and providers to implement existing standards, and whenever there’s more FHIR adoption, adopt that same reporting and triggering mechanism but using FHIR.</p>",
        "id": 189846095,
        "sender_full_name": "Crystal",
        "timestamp": 1583448780
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> 's point about the use of US disasters in advancing standards is spot on - let's use this one to advance adoption of existing standards!</p>",
        "id": 189846217,
        "sender_full_name": "Crystal",
        "timestamp": 1583448886
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"269166\">@Crystal</span> Agree that longer-term investment in serious public health integration is necessary and that a quick hack-a-thon is unlikely to get us everything that's needed.  I agree that it's likely that, once the smoke starts to clear, government will don their usual hindsight glasses and fund/regulate/etc. those things that would have been super-useful to have in place <em>before</em> the onset of this crisis.  I know one of the concerns about eCR is that it's message-focused and EHR vendors aren't super-enthusiastic about that.  It would be good (and wise) to have a discussion about what we can do to make eCR more appealing and also look at how technologies like CDS Hooks, Subscription and SMART might come into play - particularly if we can leverage some of the impact of this event to authorize public health services to pull data rather than having to rely on (often delayed or even non-occurring push).</p>\n<p>Is eCR something we should look at extending to to the international space?  Could we extend it to define/enable both push and pull such that implementers have the flexibility to use which architecture is easiest (subject to what regulations allow)?</p>",
        "id": 189850600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583452634
    },
    {
        "content": "<p>I have a kit of SMART on FHIR compliant epidemiology tools, including integration with Google Maps for visualizing geographic spread.  Did it for a grad school class, has been vetted by UChicago professors, and mostly ready to go.   If anybody is serious about standing up some FHIR pandemic services, let me know.  Mostly just need hosting costs and a pilot sponsor, and we can start registering a tool in the EHR app stores.</p>",
        "id": 189885565,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583496261
    },
    {
        "content": "<p>Are there any official recommendations on which ICD10 codes to use for COVID-19 yet?</p>",
        "id": 189885859,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583496550
    },
    {
        "content": "<p>Probably something you have already seen, but I believe this is a good source to follow.  It is the CDC's current answer to your question.  <a href=\"https://www.cdc.gov/nchs/data/icd/ICD-10-CM-Official-Coding-Gudance-Interim-Advice-coronavirus-feb-20-2020.pdf\" target=\"_blank\" title=\"https://www.cdc.gov/nchs/data/icd/ICD-10-CM-Official-Coding-Gudance-Interim-Advice-coronavirus-feb-20-2020.pdf\">https://www.cdc.gov/nchs/data/icd/ICD-10-CM-Official-Coding-Gudance-Interim-Advice-coronavirus-feb-20-2020.pdf</a></p>",
        "id": 189898028,
        "sender_full_name": "Jeff Jacobs",
        "timestamp": 1583505121
    },
    {
        "content": "<p>Thank you so much!  Exactly what I was looking for!</p>",
        "id": 189909152,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583511914
    },
    {
        "content": "<p>So... here's a $64K question regarding pandemic response, public health, epidemiology, and privacy...  assuming a hospital admin approves an app with Provider Launch Context or System level access, we can fetch the patients with conditions with ICD10 codes Z03.818, Z20.828, etc easily enough.  We will get a Patient reference, which can be used to fetch the Patient demographic object, which has the patient's home address, which can be used to visualize the spread of the disease.  The $64K question is... is it kosher to send that data to Google lookup servers to geocode those addresses into latitude/longitude numbers?  Technically, the data is anonymized; <em>however</em> there's a fairly strong correlation between location and identity that can lead to de-anonymization analysis.   But it seems it would be in the public interest to make such services available and to do the geocoding lookups.  At what point does public health concerns outweigh rights to privacy?</p>",
        "id": 189910423,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583512674
    },
    {
        "content": "<p>At a previous job, we struggled with this very concern (geocoding using a service like Google).  In the end we opted to roll our own using the (now defunct, but possibly still alive) Data Science Toolkit (<a href=\"http://www.datasciencetoolkit.org/\" target=\"_blank\" title=\"http://www.datasciencetoolkit.org/\">http://www.datasciencetoolkit.org/</a>).  It wasn't perfect, but we could run it on our own servers and keep patient addresses off Google servers.</p>",
        "id": 189910782,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1583512876
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> - <del>I haven't tried this personally, but</del> it looks like this docker image might already contain the DSTK server, pre-built:<br>\n<a href=\"https://hub.docker.com/r/andrewblaney/twofishes\" target=\"_blank\" title=\"https://hub.docker.com/r/andrewblaney/twofishes\">https://hub.docker.com/r/andrewblaney/twofishes</a></p>\n<p>Edit: I tested this container and it works.</p>\n<div class=\"codehilite\"><pre><span></span>docker pull andrewblaney/twofishes  <span class=\"c1\">## &lt;- This takes a while (3+ GB)...</span>\ndocker run -p <span class=\"m\">8081</span>:8081 andrewblaney/twofishes\n<span class=\"c1\"># From another terminal:</span>\ncurl http://localhost:8081/?query<span class=\"o\">=</span><span class=\"m\">1600</span>+amphitheater+pkwy+mountain+view\n</pre></div>\n\n\n<p>This gives me:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"p\">{</span>\n  <span class=\"nt\">&quot;interpretations&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n    <span class=\"p\">{</span>\n      <span class=\"nt\">&quot;what&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;1600 amphitheater pkwy&quot;</span><span class=\"p\">,</span>\n      <span class=\"nt\">&quot;where&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;mountain view&quot;</span><span class=\"p\">,</span>\n      <span class=\"nt\">&quot;feature&quot;</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n        <span class=\"nt\">&quot;cc&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;US&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;geometry&quot;</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n          <span class=\"nt\">&quot;center&quot;</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;lat&quot;</span><span class=\"p\">:</span> <span class=\"mf\">37.38605</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lng&quot;</span><span class=\"p\">:</span> <span class=\"mf\">-122.08385</span>\n          <span class=\"p\">},</span>\n          <span class=\"nt\">&quot;bounds&quot;</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;ne&quot;</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n              <span class=\"nt\">&quot;lat&quot;</span><span class=\"p\">:</span> <span class=\"mf\">37.4544715881</span><span class=\"p\">,</span>\n              <span class=\"nt\">&quot;lng&quot;</span><span class=\"p\">:</span> <span class=\"mf\">-122.029319763</span>\n            <span class=\"p\">},</span>\n            <span class=\"nt\">&quot;sw&quot;</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n              <span class=\"nt\">&quot;lat&quot;</span><span class=\"p\">:</span> <span class=\"mf\">37.3384399414</span><span class=\"p\">,</span>\n              <span class=\"nt\">&quot;lng&quot;</span><span class=\"p\">:</span> <span class=\"mf\">-122.133552551</span>\n            <span class=\"p\">}</span>\n          <span class=\"p\">}</span>\n        <span class=\"p\">},</span>\n        <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mountain View&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;displayName&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mountain View, CA, United States&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;woeType&quot;</span><span class=\"p\">:</span> <span class=\"mi\">7</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;ids&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;source&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;geonameid&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;id&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;5375480&quot;</span>\n          <span class=\"p\">}</span>\n        <span class=\"p\">],</span>\n        <span class=\"nt\">&quot;names&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mt View&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lang&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;en&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;flags&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n              <span class=\"mi\">16</span><span class=\"p\">,</span>\n              <span class=\"mi\">8</span><span class=\"p\">,</span>\n              <span class=\"mi\">1</span>\n            <span class=\"p\">]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mt View&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lang&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;en&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;flags&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n              <span class=\"mi\">16</span><span class=\"p\">,</span>\n              <span class=\"mi\">8</span>\n            <span class=\"p\">]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mtn View&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lang&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;en&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;flags&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n              <span class=\"mi\">16</span><span class=\"p\">,</span>\n              <span class=\"mi\">8</span><span class=\"p\">,</span>\n              <span class=\"mi\">1</span>\n            <span class=\"p\">]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mtn View&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lang&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;en&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;flags&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n              <span class=\"mi\">16</span><span class=\"p\">,</span>\n              <span class=\"mi\">8</span>\n            <span class=\"p\">]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mountain View&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lang&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;en&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;flags&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n              <span class=\"mi\">16</span>\n            <span class=\"p\">]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mountain View&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lang&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;en&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;flags&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n              <span class=\"mi\">16</span><span class=\"p\">,</span>\n              <span class=\"mi\">1</span>\n            <span class=\"p\">]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mount View&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lang&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;en&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;flags&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n              <span class=\"mi\">16</span><span class=\"p\">,</span>\n              <span class=\"mi\">8</span>\n            <span class=\"p\">]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mount View&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;lang&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;en&quot;</span><span class=\"p\">,</span>\n            <span class=\"nt\">&quot;flags&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n              <span class=\"mi\">16</span><span class=\"p\">,</span>\n              <span class=\"mi\">8</span><span class=\"p\">,</span>\n              <span class=\"mi\">1</span>\n            <span class=\"p\">]</span>\n          <span class=\"p\">}</span>\n        <span class=\"p\">],</span>\n        <span class=\"nt\">&quot;highlightedName&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;&lt;b&gt;Mountain View&lt;/b&gt;, CA, United States&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;matchedName&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;Mountain View, CA, United States&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;id&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;geonameid:5375480&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;attributes&quot;</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n          <span class=\"nt\">&quot;population&quot;</span><span class=\"p\">:</span> <span class=\"mi\">74066</span>\n        <span class=\"p\">},</span>\n        <span class=\"nt\">&quot;longId&quot;</span><span class=\"p\">:</span> <span class=\"s2\">&quot;72057594043303416&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;parentIds&quot;</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n          <span class=\"s2\">&quot;72057594044179937&quot;</span><span class=\"p\">,</span>\n          <span class=\"s2\">&quot;72057594043260857&quot;</span><span class=\"p\">,</span>\n          <span class=\"s2\">&quot;72057594043320957&quot;</span>\n        <span class=\"p\">]</span>\n      <span class=\"p\">}</span>\n    <span class=\"p\">}</span>\n  <span class=\"p\">]</span>\n<span class=\"p\">}</span>\n</pre></div>",
        "id": 189912275,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1583513837
    },
    {
        "content": "<p>Oh, that’s absolutely fantastic!  Thank you so much!  Okay...  will totally start sketching out an update to our geomapping module for COVID-19.</p>",
        "id": 189930438,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583526132
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Your question is a good one! I've asked other folks to chime in, but if any vendors would like to provide feedback, I'd love to hear it. </p>\n<p>From my perspective it's less about the message focus than about the lack of ONC/CMS measure to fund it, but I'd like to be wrong on that!</p>",
        "id": 189948323,
        "sender_full_name": "Crystal",
        "timestamp": 1583540684
    },
    {
        "content": "<p>Should this thread be renamed to its more proper moniker (as the thread says) hackathon? I gather <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> would have to do that.)</p>\n<p>I ask because it appears the thread is already becoming what it initially fantasized about.</p>",
        "id": 189954491,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583551273
    },
    {
        "content": "<p>well, I can only move one message at a time</p>",
        "id": 189954541,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583551360
    },
    {
        "content": "<p>If you start at the top, you can move them all</p>",
        "id": 189954993,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583552378
    },
    {
        "content": "<p>Brilliant - thanks, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> !</p>",
        "id": 189971526,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583589469
    },
    {
        "content": "<p>Update from the IHE Connectathon in Brussels: the entire event will go ahead as planned (with some extra measures in place). Source: IHE website.</p>",
        "id": 189972066,
        "sender_full_name": "René Spronk",
        "timestamp": 1583590519
    },
    {
        "content": "<p>I asked my students about how health informatics could help and they came up with the following ideas (freeform brainstorming) - </p>\n<ul>\n<li>making sure there is appropriate representation for data related to the disease in our models (based on CMS announcing a new code for it)</li>\n<li>tracking trends, analyzing data</li>\n<li>Syndromic surveillance, case reporting, reportable lab results</li>\n<li>infection trail</li>\n<li>education delivery - for clinicians, patients, quarantined, public</li>\n<li>information/education/results for patients</li>\n<li>support for quarantines (I saw a cool app in Korea for this)</li>\n<li>mental health</li>\n<li>communicating best practices/protocol</li>\n<li>triage</li>\n<li>disaster capacity/communication (like OASIS standards) - HAVBED, etc</li>\n<li>telehealth</li>\n<li>integration of social services</li>\n<li>clinical decision support</li>\n<li>using HIEs to see where patient has been</li>\n</ul>",
        "id": 189989190,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1583620543
    },
    {
        "content": "<p>Awesome! Thanks for sharing Virginia!</p>",
        "id": 189989684,
        "sender_full_name": "Evelyn Gallego",
        "timestamp": 1583621520
    },
    {
        "content": "<p>This is a good thread and the energy in the health IT community to do something to help relative to COVID-19 is palpable. It is a dynamic that we have also seen previously in other public health emergency responses like Anthrax, West Nile, SARs, Katrina, etc.. The difficult part for many is understanding that the most helpful course is to support the course and plan that public health has laid out.<br>\nThe HL7 Public Health Work Group (PHWG), the CDC, CSTE, APHL, ASTHO and NACCHO have invested a huge amount of hours and effort in a plan for outbreak management, electronic Case Reporting (eCR), early detection of events, and electronic laboratory results that addresses the public health requirements and can work with health care organizations and EHRs. I will share some details in subsequent comments, but the most helpful support that can be given support the plan and standards that have been developed.<br>\nSome previous comments have suggested that there has not been broad adoption of the eCR efforts. For the sake of clarity, the FHIR eCR Implementation Guide was literally published two week ago. It is not reasonable to abandon the PHWG efforts after two weeks. <br>\nIt is true that a CDA version has been available longer, but isn’t a major component of the whole FHIR effort the difficulty programs have had in advancing consistent, well-adopted CDA solutions? Unfortunately, eCR was not put into Meaningful Use until very late. It did not have the real benefit of the HITECH funds as a result. Despite the “added duty as assigned” nature of public health requirements for clinical care, we are seeing a huge number of providers asking their EHR vendors to implement eCR.<br>\nUnderstanding the full context and requirements that have led to eCR plan and helping advance and test its components is the most helpful things the community can do.</p>",
        "id": 190015438,
        "sender_full_name": "John Loonsk",
        "timestamp": 1583677185
    },
    {
        "content": "<p>HL7 has a Public Health work group that has spent a lot of time on FHIR standards for electronic case reporting (eCR) and other related public health functions. Public Health has a plan for how FHIR can be helpful in these situations and the work that has been done and that has produced a FHIR eCR standard, as Crystal says, should be supported rather than reconsidered.<br>\nThere are health IT needs in several stages of an outbreak like COVID-19. Just a fraction of the needs are listed in bullets under the stages below.<br>\n1.  Initial detection of an event before it spreads<br>\no   Would have been good to have occurred in China<br>\no   Needs on a jurisdiction by jurisdiction basis as well</p>\n<ol start=\"2\">\n<li>\n<p>Managing a small outbreak<br>\no   Contact tracing<br>\no   Lab result matching (in clinical care and public health)<br>\no   Managing quarantine</p>\n</li>\n<li>\n<p>Suppressing a disseminated outbreak<br>\no   Much more of #2, but at levels that may overwhelm PH human resources<br>\no   We are migrating out of this phase and into #4 now with COVID-19</p>\n</li>\n<li>\n<p>Tracking a widely disseminated event<br>\no   Suppression begins to be mostly about public service announcements<br>\nPlease look at the eCR FHIR IG: <a href=\"http://hl7.org/fhir/us/ecr/\" target=\"_blank\" title=\"http://hl7.org/fhir/us/ecr/\">http://hl7.org/fhir/us/ecr/</a> and the eCR CDA eCR IG (it has more narrative context) in the context of how it has a role in all of these areas. Syndromic surveillance and other efforts in HL7 also play roles.  There is more context than we can possibly put into this thread, but we will be happy to share and discuss all of it. Some of it relates to laws, some with support from healthcare organizations, and some with the capabilities of the public health workforce.</p>\n</li>\n</ol>",
        "id": 190015480,
        "sender_full_name": "John Loonsk",
        "timestamp": 1583677220
    },
    {
        "content": "<p>We would love to help with Hackathon and/or accelerate our ongoing Connectathon efforts with greater attention, and involvement, from the broader HIT / HL7 community. We have been working with a number of EHR vendors in the CDA environment and a number have indicated that they are now developing to the FHIR specification now that it has come available. APHL, with the CDC and CSTE is close to having all Public Health Agencies connected for initial eCR implementation and is working to integrate all surveillance system vendors.<br>\nWe also have developed a “backend app” to further automate the reporting of cases to public health in FHIR. We would love to have a hackathon to have EHR vendors help us integrate it into their FHIR enabled EHRs. We would love to talk about the tools for automating FHIR subscriptions in those EHRs for the trigger codes that CSTE and the CDC has developed. We would like to discuss the issues of coding in EHRs that make triggering difficult.<br>\nWe would love for you to you to help support the plan through and after the COVID-19 event. As Crystal also said earlier in this thread. The most helpful thing is to have help with the existing FHIR standards and the plan that has been laboriously and carefully developed.</p>",
        "id": 190015483,
        "sender_full_name": "John Loonsk",
        "timestamp": 1583677239
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> helped me find this post, which started in the social stream and I had classified it as patient empowerment. My point of view:<br>\nThe COVID19 pandemic brought me some interesting insights:</p>\n<ul>\n<li>Native applications in FHIR can accelerate coordinated actions to combat clinical tragedies.</li>\n<li>There is a tendency to transfer much of the knowledge previously available in customer empowerment / rational user-centered use, in efforts to integrate clinical data.</li>\n<li>There was an acceleration in the (rational) adoption of regulatory frameworks - Software as a Medical Device (SaMD).<br>\nI've been investigating the possibility of creating a native application in FHIR for the hybrid Brazilian healthcare system (public-private), but I come up against an absolute lack of functional or semantic interoperability.</li>\n</ul>\n<p>An interesting article published: <a href=\"https://www.forbes.com/sites/chasefeiger/2020/03/06/consumerization-of-healthcare-expands-beyond-lifestyle-products-to-tackle-covid-19/#6cf99211236a\" target=\"_blank\" title=\"https://www.forbes.com/sites/chasefeiger/2020/03/06/consumerization-of-healthcare-expands-beyond-lifestyle-products-to-tackle-covid-19/#6cf99211236a\">https://www.forbes.com/sites/chasefeiger/2020/03/06/consumerization-of-healthcare-expands-beyond-lifestyle-products-to-tackle-covid-19/#6cf99211236a</a></p>",
        "id": 190020909,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1583687939
    },
    {
        "content": "<p>The government of Brazil has written and published an informational application on COVID-19, but I believe more can be done.<br>\nThe application has no function but to inform the user the possibility that he is ill. End of flow.<br>\nThe application could capture point-of-care information and, with the necessary authentication levels, flow securely to something like the RiskAssessment resource and then to the Practitioner who will perform the classification.</p>\n<p>If someone is interested and wants to read in Portuguese, here's the link: <br>\n<a href=\"http://www.ans.gov.br/aans/noticias-ans/consumidor/5383-ministerio-da-saude-disponibiliza-aplicativos-sobre-o-coronavirus\" target=\"_blank\" title=\"http://www.ans.gov.br/aans/noticias-ans/consumidor/5383-ministerio-da-saude-disponibiliza-aplicativos-sobre-o-coronavirus\">http://www.ans.gov.br/aans/noticias-ans/consumidor/5383-ministerio-da-saude-disponibiliza-aplicativos-sobre-o-coronavirus</a></p>",
        "id": 190021042,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1583688204
    },
    {
        "content": "<p>Another independent hospital developer created a similar informational application, but it was refused to be published by Apple due to the possibility of disinformation (SaMD).</p>",
        "id": 190021111,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1583688326
    },
    {
        "content": "<p>Would the EHR vendors see a benefit in (and be willing to participate in) a near-term virtual connectathon around eCR?  <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"191929\">@Jeff Danford</span></p>",
        "id": 190029456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583704428
    },
    {
        "content": "<p>Both Epic and Allscripts have CDA eCR solutions.</p>\n<ul>\n<li>\n<p>Epic is operational in a number of sites as such nationally and has not previously expressed interest in an additional FHIR eCR solution. </p>\n</li>\n<li>\n<p>There are many Allscripts provider sites that have chosen eCR in Promoting Interoperability, but I am not aware of any implementations that have yet been done.</p>\n</li>\n<li>\n<p>Cerner was an original Digital Bridge participant, but to the best of my knowledge does not have a shared approach to eCR and leaves aspects to individual clinical sites. Cerner may be interested in the new FHIR eCR standard and using the backend app we are developing as it would handle almost all eCR needs for them. </p>\n</li>\n</ul>\n<p>We are interested in working with any and all EHR vendors.</p>",
        "id": 190059679,
        "sender_full_name": "John Loonsk",
        "timestamp": 1583753222
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"270060\">@Michael Diana</span> is from DATASUS, the Brazilian IT coordinator,  we have great interest.</p>",
        "id": 190112128,
        "sender_full_name": "Guilherme Zwicker",
        "timestamp": 1583784527
    },
    {
        "content": "<p>The COVID-19 Pandemic is unprecedented, and is rapidly changing. Like a vaccine, joined-up IT could help save large numbers of lives. HL7 stands for joined-up healthcare IT; so HL7 can play a critical role, if it can respond rapidly and appropriately.</p>\n<p>The challenge, as with all major IT endeavours, is to understand the requirement. Without that understanding, IT cannot be effective. Understanding a moving worldwide requirement is particularly hard. We don’t yet know what is needed.</p>\n<p>How can HL7 understand the new IT requirements of this pandemic – and make software available to meet them, across many countries? I suggest three stages:</p>\n<ol>\n<li><em><strong><em>Get proposals out there, and get feedback</em></strong></em>:  A small open task force should develop 3 – 5 proposals, for simple, rapidly developed FHIR applications to help manage the pandemic; then get feedback on those proposals from providers and agencies worldwide. They know what their problems are, better than we do.</li>\n<li><strong>Build demonstrators:</strong> to help providers and agencies understand what these applications can do, and how they could deploy them, built public demonstrators and get more feedback.</li>\n<li><strong>Deploy Iteratively</strong>: Build the applications open source, from existing components, in small iterative stages – initially meeting only the simplest requirements, with planned iterations to learn from early deployments.</li>\n</ol>\n<p>Times of crisis often bring about step changes in working practices, and this is such a time. The step change can be a decisive move towards greater interoperability using FHIR. HL7 has the opportunity to make a vital contribution, while moving the world decisively towards FHIR-based healthcare interoperability. These three stages are a start.</p>",
        "id": 190173627,
        "sender_full_name": "robert worden",
        "timestamp": 1583848357
    },
    {
        "content": "<p>that's certainly the process we'd follow. And we'd be very willing to follow it.</p>",
        "id": 190210280,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583866210
    },
    {
        "content": "<p>but when I talk about the world to the governments I know they (a) don't want to do infrastructure development in a time of crisis (which makes sense to me - go with what you've got) and (b) they aren't you thinking outside the lines they currently live in</p>",
        "id": 190210368,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583866265
    },
    {
        "content": "<p>personally, I think that there's very strong contributions to make by building good digital health systems to extend the reach of the healthcare system. And I'm pursuing fractional opportunities here</p>",
        "id": 190210542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583866342
    },
    {
        "content": "<p>Can you expand on what you mean by that <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 190211324,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583866676
    },
    {
        "content": "<p>Are we discussing infrastructure development?  Or application development?  I'm going to be biased towards the US for a moment, but within the states the HHS/ONC announced at last year's DevDays in Redmond that 87% of hospitals in the US had installed a FHIR compliant EHR.  Presumably that number is upwards of 95% now.  Some of us have been working on longitudinal apps.  I think the issue at hand is that (in the US) if you're going to get a proposal and demonstration out there, it needs to be able to support both DSTU2 and R4 at a minimum; and now is <em>not</em> the time to pitch or be bringing forward any proposals that require any hospitals to upgrade to R4.  We need solutions from teams that have been in the development process since the beginning and can support any/all deployed FHIR versions, not solutions that require infrastructure upgrades.</p>",
        "id": 190211818,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583866919
    },
    {
        "content": "<p>I think it would be good to </p>\n<ol>\n<li>maintain digital versions of standard questionnaires for consumers (e.g. pre-visit screening). </li>\n<li>distribute apps that do this based on smart on FHIR</li>\n<li>Allow automatic notifications to patients of (negative?) test results (or positive test results in their social circles?)</li>\n<li>allow for regular checking in with patients with disease who are self-isolating</li>\n</ol>",
        "id": 190212170,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583867100
    },
    {
        "content": "<p>some of those are being pursued in some countries, but almost all require some policy or infrastructure support that only partially exists</p>",
        "id": 190212237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583867134
    },
    {
        "content": "<p>I'm not savvy enough to say it with certainty, but: somebody probably wants to check into the #CoEpi project: Community Epidemiology In Action, started by @ScottLeibrand and @DanaMLewis,  co-creators of #OpenAPS.</p>\n<p><a href=\"https://www.coepi.org/\" target=\"_blank\" title=\"https://www.coepi.org/\">https://www.coepi.org/</a></p>\n<p>Not surprisingly, once again their motive is #WeAreNotWaiting (this time, waiting in the hope that \"the system\" will solve things fast enough); they're taking action too. Which is why I hope someone will explore connecting with whatever they're doing.</p>",
        "id": 190218528,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583870880
    },
    {
        "content": "<p>FWIW from the site's home page:</p>\n<blockquote>\n<p><strong>The CoEpi team</strong><br>\nThe CoEpi team currently consists of a small group of individuals with diverse and relevant skills who feel the need to put those skills to use in service of our own loved ones, our broader social networks, our communities, and humanity. We are committed to working openly and transparently, publishing all of our work completely open-source for anyone to use in any way they can, to make sure we are all doing everything we can to minimize the death and disruption caused by the COVID-19 pandemic.</p>\n<p><strong>We need your help</strong><br>\nWe are already starting on building the CoEpi app described below. We have a very solid initial design, and have recruited individuals who can begin producing a minimum viable product. But we can’t move fast enough on our own. If you’re someone with skills and time you could use to help, please get in touch with us immediately: </p>\n</blockquote>",
        "id": 190218606,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583870917
    },
    {
        "content": "<p>Eh, their feature spec is geared towards less virulent diseases, such as opioid dependency and HIV.  It's way over engineered (imho), and not leaning on geomapping nearly enough.  Interesting to review though.</p>",
        "id": 190223036,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583873483
    },
    {
        "content": "<p>I asked Scot about the app framework and what they were thinking about interop and he said:</p>\n<blockquote>\n<p>Most of that is being figured out in real time on Slack. At the moment the mobile app is ReactNative, and the back-end has some Ruby, Postgres, and some FHIR-like (but not FHIR-compliant) data structures and JSON APIs.</p>\n<p>The data sharing side at the moment is just anonymous symptom reporting and hashed BLE identifier uploads: no PII. All matching is done on the clients by downloading possibly-relevant hashed data from the server.</p>\n<p>If you or anyone you know would be able to contribute to the work, let us know and we can get you an invite.</p>\n</blockquote>",
        "id": 190223187,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583873566
    },
    {
        "content": "<p>Partially related: Italian gov't is open-sourcing all the raw data on GitHub: <a href=\"https://github.com/pcm-dpc/COVID-19\" target=\"_blank\" title=\"https://github.com/pcm-dpc/COVID-19\">https://github.com/pcm-dpc/COVID-19</a></p>",
        "id": 190223256,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583873602
    },
    {
        "content": "<p>(and today data is good - fingers crossed)</p>",
        "id": 190223302,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583873632
    },
    {
        "content": "<p>it's remarkable the difference between countries in terms of how they are thinking. Most countries are still in 'business as usual' mode around how the government is responding. you might call it the 'closed' model, characterised by secrecy walls behind which bureaucrats can flourish. But eventually those walls will be smashed down (where eventually is a timeline measured in weeks)</p>",
        "id": 190223494,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583873739
    },
    {
        "content": "<p>(ask if you want translations)</p>",
        "id": 190223647,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583873799
    },
    {
        "content": "<p>Also, given everything we know about the virulency and it being transmitted before symptoms show and people exhibiting repeat cases, it's likely to turn into a game of wack-a-mole with hotzones and quarantines lifting and being restated months later.  That breaks down the case management model.  Hotzone awareness, triaging, facility (re)routing, quarantine locations, etc are maybe better features to be thinking about.</p>",
        "id": 190224081,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583874019
    },
    {
        "content": "<p>contact tracing....</p>",
        "id": 190224124,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583874048
    },
    {
        "content": "<p>Viruses are fundamentally about population density, which itself is reducible to geolocation/geospatial analysis.  Trace your geolocation route, and you can also trace contacts.</p>",
        "id": 190224644,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583874306
    },
    {
        "content": "<p>Surprisingly, there's no influenza module in the Synthea project.    But there are bronchitis, COPD, and sore throat modules.  And we have the LOINC, SNOMED, and ICD10 codes available.  Anybody else interested in brainstorming a Synthea workflow?  I recently authored a custom module, and feel up to the task of building the workflow if we can get some epidemiologists and ICU specialists to chime in on what a workflow would look like.  Would help anybody else implementing influenza/coronavirus projects in general.</p>\n<p><a href=\"https://github.com/synthetichealth/synthea/tree/master/src/main/resources/modules\" target=\"_blank\" title=\"https://github.com/synthetichealth/synthea/tree/master/src/main/resources/modules\">https://github.com/synthetichealth/synthea/tree/master/src/main/resources/modules</a></p>",
        "id": 190243877,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1583891139
    },
    {
        "content": "<p>Does it make sense to look at impact / evolution monitoring, on a population basis, beyond patient tracking?</p>",
        "id": 190266680,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583921661
    },
    {
        "content": "<p>like this:<br>\n<a href=\"https://twitter.com/MarkJHandley/status/1237119688578138112\" target=\"_blank\" title=\"https://twitter.com/MarkJHandley/status/1237119688578138112\">https://twitter.com/MarkJHandley/status/1237119688578138112</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/MarkJHandley/status/1237119688578138112\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/3664306616/f1c6af9754205bfa63110e74124d4d42_normal.jpeg\"></a><p>Here's the coronavirus data, overlayed with the dates offset by the amounts shown.  One of these countries is not like the rest.  Everyone else will be Italy in 9-14 days time. <a href=\"https://t.co/VESY54X1gP\" target=\"_blank\" title=\"https://t.co/VESY54X1gP\">https://twitter.com/MarkJHandley/status/1237119688578138112/photo/1</a></p><span>- Mark Handley (@MarkJHandley)</span><div class=\"twitter-image\"><a href=\"https://t.co/VESY54X1gP\" target=\"_blank\" title=\"https://t.co/VESY54X1gP\"><img src=\"https://pbs.twimg.com/media/ESshSpfWAAECPLR.png:thumb\"></a></div></div></div>",
        "id": 190266717,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583921725
    },
    {
        "content": "<p>that is a remarkable graph</p>",
        "id": 190272001,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583926613
    },
    {
        "content": "<p>If we assume that, say, 10% of notified cases require hospitalisation, then the 'require hospitalisation' line follows the 'notified cases' line , but lower by a factor 10. That is, by a further delay of 8 days on the graph. It is like a tsunami approaching healthcare systems worldwide, about 20 days away.</p>",
        "id": 190276321,
        "sender_full_name": "robert worden",
        "timestamp": 1583930447
    },
    {
        "content": "<p>The truly scary thing is that the virus now has presence in 120 countries, and in some of those, the healthcare infrastructure is low.  (In practice it's probably present in even more and the healthcare infrastructure is low enough it hasn't even noticed yet.)  The \"severe and needs hospitalization\" percentage of 12-14% quickly becomes the fatality percentage if there is no hospitalization to provide - either because the infrastructure isn't there or the infrastructure is overwhelmed.</p>",
        "id": 190285116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583935939
    },
    {
        "content": "<p>This is an excellent article. Please read it. </p>\n<p><a href=\"https://medium.com/@tomaspueyo/coronavirus-act-today-or-people-will-die-f4d3d9cd99ca\" target=\"_blank\" title=\"https://medium.com/@tomaspueyo/coronavirus-act-today-or-people-will-die-f4d3d9cd99ca\">https://medium.com/@tomaspueyo/coronavirus-act-today-or-people-will-die-f4d3d9cd99ca</a></p>",
        "id": 190309491,
        "sender_full_name": "robert worden",
        "timestamp": 1583947997
    },
    {
        "content": "<p>should we make a questionnaire resource version of this? <a href=\"https://www.cdc.gov/coronavirus/2019-ncov/downloads/pui-form.pdf\" target=\"_blank\" title=\"https://www.cdc.gov/coronavirus/2019-ncov/downloads/pui-form.pdf\">https://www.cdc.gov/coronavirus/2019-ncov/downloads/pui-form.pdf</a></p>",
        "id": 190324391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583956597
    },
    {
        "content": "<p>We could, but my impression is that none of the EHRs could display it,  we'd be looking at a SMART app to fill it in.   A bit of pre-pop could presumably save some effort/improve quality on filling things in, though frankly ticking boxes on a paper form may still be less work.  If we think anyone would use it, we could write a transform to turn the results into whatever syntax the CDC wants to consume.  Is this something anyone thinks would be helpful?</p>",
        "id": 190334055,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583962366
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191678\">Abigail Watson</span> <a href=\"#narrow/stream/179160-social/topic/Pandemic.20Hackathon/near/190243877\" title=\"#narrow/stream/179160-social/topic/Pandemic.20Hackathon/near/190243877\">said</a>:</p>\n<blockquote>\n<p>Surprisingly, there's no influenza module in the Synthea project.    But there are bronchitis, COPD, and sore throat modules.  And we have the LOINC, SNOMED, and ICD10 codes available.  Anybody else interested in brainstorming a Synthea workflow?  I recently authored a custom module, and feel up to the task of building the workflow if we can get some epidemiologists and ICU specialists to chime in on what a workflow would look like.  Would help anybody else implementing influenza/coronavirus projects in general.</p>\n<p><a href=\"https://github.com/synthetichealth/synthea/tree/master/src/main/resources/modules\" target=\"_blank\" title=\"https://github.com/synthetichealth/synthea/tree/master/src/main/resources/modules\">https://github.com/synthetichealth/synthea/tree/master/src/main/resources/modules</a></p>\n</blockquote>\n<p>Someone else is talking about this at <a href=\"https://github.com/synthetichealth/synthea/issues/679\" target=\"_blank\" title=\"https://github.com/synthetichealth/synthea/issues/679\">https://github.com/synthetichealth/synthea/issues/679</a>. I'd be interested in brainstorming or reviewing, but I'm not a clinician, although I do know how Synthea works.</p>",
        "id": 190405832,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1584028204
    },
    {
        "content": "<p>So, yesterday I was prescribed a medication that (unbeknownst to me) was an immunodepressant.  My wife had the good sense to look up side effects before I started taking it, which prompted me to ask the pharmacist (who referred me back to the prescriber).  I have postponed starting the medication until necessary.</p>\n<p>This chain of events led me to ask myself - should prescribers be <em>warned</em> that a draft-ordered medication has a side-effect that might be <em>highly undesirable</em> in the midst of a global pandemic?  I feel like there's a quick and easy CDS hooks project here.</p>",
        "id": 190421715,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1584035382
    },
    {
        "content": "<p>Yeah, if we had widespread deployment of prescription-time hook support that'd be pretty awesome. <a href=\"https://jamanetwork.com/journals/jama/fullarticle/2762689\" target=\"_blank\" title=\"https://jamanetwork.com/journals/jama/fullarticle/2762689\">https://jamanetwork.com/journals/jama/fullarticle/2762689</a> gives a fabulous view of what's possible with 1) integrated CDS, and 2) reliable national databases of stuff like who recently traveled where</p>",
        "id": 190421962,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584035498
    },
    {
        "content": "<p>Hey, immunodepressants are slightly protective of cytokine storms.  Might increase your odds of dying from a lot of other things, but slightly improves your chances of not dying of COVID19 pneumonia complications.  ;)</p>",
        "id": 190421988,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584035507
    },
    {
        "content": "<p>(This is not medical advice ;-))</p>",
        "id": 190422100,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584035530
    },
    {
        "content": "<p>I'll keep those things in mind until I hear back directly from the prescriber.  Still, I think the point is made - CDS hooks have potential to help in this situation (even if not right now).</p>",
        "id": 190422320,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1584035622
    },
    {
        "content": "<p>Hello all. I work with OpenMRS, primarily on a project in western Kenya. We are taking initial steps in looking to build a case based surveillance tool for OpenMRS to assist with public health efforts. Our current data model in OpenMRS does not support this (contact tracing essentially) well. We would love to utilize fhir to guide this process for us. Please let us know if you have any suggestions.</p>",
        "id": 190434362,
        "sender_full_name": "Jonathan Dick",
        "timestamp": 1584041637
    },
    {
        "content": "<p>is this for something like asking and recording where a person has been and who they have met in the past X days?</p>",
        "id": 190445142,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584047100
    },
    {
        "content": "<p>While I am speaking in the context of the US, the blocking and tackling of public health outbreak management is well developed and HL7 standards (including FHIR) have already been developed for it. The issue here has been that EHR vendors are not/no longer incented to implement what is needed for public health (vs. clinical care) needs:<br>\n•   Case management is a basic function of all public health surveillance systems, but it depends on getting potential cases from clinical care<br>\n•   Matching lab results to possible cases needs to be supported in both clinical care and Public Health Agencies (PHAs), but needs possible cases to link to<br>\n•   Contact tracing for tracking the exposures of individuals to others is a function of all major public health surveillance systems but also needs specific case data from clinical care</p>\n<p>The problem in the US has been that not all EHRs are sending possible cases to PHAs. There are standards for doing this that exist (the FHIR eCR standard as of a couple of weeks ago) and case reporting is required by law in every State and Territory, but even with all of this and this public health emergency, there is not a commitment to this basic function that is central to response activities.</p>\n<p>I have not heard a response to Lloyds earlier question about EHR vendors implementing basic case reporting. EPIC is doing it in sites nationally. Are others willing? Can we hear some commitment?</p>",
        "id": 190458346,
        "sender_full_name": "John Loonsk",
        "timestamp": 1584057245
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179160-social/topic/Pandemic.20Hackathon/near/190445142\" title=\"#narrow/stream/179160-social/topic/Pandemic.20Hackathon/near/190445142\">said</a>:</p>\n<blockquote>\n<p>is this for something like asking and recording where a person has been and who they have met in the past X days?</p>\n</blockquote>\n<p>Yes, exactly. And we'd like to build some tools to support reporting, analytics, etc.</p>",
        "id": 190466727,
        "sender_full_name": "Jonathan Dick",
        "timestamp": 1584068405
    },
    {
        "content": "<p>how would you identify people? you wouldn't have identifiers for the other parties, right? just names and locations?</p>",
        "id": 190473045,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584077737
    },
    {
        "content": "<p>I would expect that fuzzy matching of people, based on what demographic and other data you have, and giving the application a confidence level of the matches that come up, is going to be a common underlying requirement.</p>",
        "id": 190488049,
        "sender_full_name": "robert worden",
        "timestamp": 1584094649
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179160-social/topic/Pandemic.20Hackathon/near/190473045\" title=\"#narrow/stream/179160-social/topic/Pandemic.20Hackathon/near/190473045\">said</a>:</p>\n<blockquote>\n<p>how would you identify people? you wouldn't have identifiers for the other parties, right? just names and locations?</p>\n</blockquote>\n<p>That's probably correct. Possibly phone numbers as well - which could either belong to contact or someone else that contact is connected to</p>",
        "id": 190490491,
        "sender_full_name": "Jonathan Dick",
        "timestamp": 1584097060
    },
    {
        "content": "<p>so... that would look like this then:</p>",
        "id": 190497304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584102908
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><span class=\"p\">{</span>\n  <span class=\"nt\">&quot;resourceType&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Encounter&quot;</span><span class=\"p\">,</span>\n  <span class=\"nt\">&quot;status&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;completed&quot;</span><span class=\"p\">,</span>\n  <span class=\"nt\">&quot;class&quot;</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">&quot;system&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;http://something/to/figure/out&quot;</span><span class=\"p\">,</span>\n    <span class=\"nt\">&quot;code&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;contact-report&quot;</span>\n  <span class=\"p\">},</span>\n  <span class=\"nt\">&quot;subject&quot;</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n     <span class=\"nt\">&quot;reference&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Patient/xxxxx&quot;</span>\n  <span class=\"p\">},</span>\n  <span class=\"nt\">&quot;participant&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n    <span class=\"nt\">&quot;individual&quot;</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n      <span class=\"nt\">&quot;reference&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;#p1&quot;</span>\n    <span class=\"p\">}</span>\n  <span class=\"p\">}],</span>\n  <span class=\"nt\">&quot;period&quot;</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">&quot;start&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;YYYY-MM-DDTHH:NN:SS&quot;</span><span class=\"p\">,</span>\n    <span class=\"nt\">&quot;end&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;YYYY-MM-DDTHH:NN:SS&quot;</span>\n  <span class=\"p\">},</span>\n  <span class=\"nt\">&quot;location&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n    <span class=\"nt\">&quot;location&quot;</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n      <span class=\"nt\">&quot;reference&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;#l1&quot;</span>\n    <span class=\"p\">},</span>\n  <span class=\"p\">}],</span>\n  <span class=\"nt\">&quot;contained&quot;</span> <span class=\"p\">[</span>\n    <span class=\"p\">{</span>\n      <span class=\"nt\">&quot;resourceType&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;RelatedPerson&quot;</span><span class=\"p\">,</span>\n      <span class=\"nt\">&quot;name&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n        <span class=\"nt\">&quot;text&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Domald Trump&quot;</span>\n      <span class=\"p\">}],</span>\n      <span class=\"nt\">&quot;telecom&quot;</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n        <span class=\"nt\">&quot;system&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;phone&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;value&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;+1 555 555 5555&quot;</span>\n      <span class=\"p\">}]</span>\n    <span class=\"p\">},</span>\n    <span class=\"p\">{</span>\n      <span class=\"nt\">&quot;resourceType&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;Location&quot;</span><span class=\"p\">,</span>\n      <span class=\"nt\">&quot;position&quot;</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n        <span class=\"nt\">&quot;longitude&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;38.8992836&quot;</span><span class=\"p\">,</span>\n        <span class=\"nt\">&quot;latitude&quot;</span> <span class=\"p\">:</span> <span class=\"s2\">&quot;-77.0387292&quot;</span>\n      <span class=\"p\">}</span>\n    <span class=\"p\">}</span>\n  <span class=\"p\">]</span>\n<span class=\"p\">}</span>\n</pre></div>",
        "id": 190497314,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584102911
    },
    {
        "content": "<p>Grahame, those are remarkably precise coordinates, although I doubt they are accurate.  According to my maps, that puts the \"related person\" inside the White House Athletic Center.</p>",
        "id": 190523052,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1584116362
    },
    {
        "content": "<p>In my clinical experience, patients tend to be really bad at remembering details. I think the likely-hood of expecting that anyone providing care has either the time or the inclination to do contact tracing interviews with a patient on top of a standard history and physical exam is extremely low.  Even less likely that a case worker or other ancillary support caregiver would be willing to do this in a resource constrained environment.</p>\n<p>IMHO, we should be more thinking about ways we can accelerate &amp; augment workflows helpfully with minimal additional resource burden. speaking from a clinicians point-of-view often times these software solutions are billed as \"helpful\" but they make my life when treating a patient hell.</p>",
        "id": 190527496,
        "sender_full_name": "Tom Matthews",
        "timestamp": 1584118541
    },
    {
        "content": "<p>So one concern we have is creating a contact as a person in OpenMRS. It would be best to create a separate place in the data model to support these contacts. I suppose thought that once we did that, we could make it mpossible for people listed in this table to be part of a relationship to another person. </p>\n<p>As for the concerns about doing contact tracing, we have not established workflows for doing so. It's not clear who would be responsible for collecting the data but it would be unlikely to be the clinician. This is also an extraordinary time, and the expectations for collecting such data likely would not be present in other less emergent circumstances.</p>",
        "id": 190529783,
        "sender_full_name": "Jonathan Dick",
        "timestamp": 1584119564
    },
    {
        "content": "<p>So do you want us to spend time treating the patient or doing contract tracing? And with what resources? I think that's the thing that's getting missed.  From a purely epidemiological perspective, what evidence exists to state that contact tracing is helpful? And to whom? </p>\n<p>If a patient is asymptomatic and clinically normative/stable - I DON'T WANT to see them in my ED. I need to reserve those resources for others. Just offering my opinion, so worth price charged, but I don't think that's really a very helpful workflow.</p>",
        "id": 190530414,
        "sender_full_name": "Tom Matthews",
        "timestamp": 1584119831
    },
    {
        "content": "<p>Agreed.  Contract tracing is definitely a best practice with less virulent diseases and when it's first starting out.  Once it becomes a pandemic... that's almost by definition when contact tracing and case reporting start to break down.  Stochastic methods are still available though, which is what travel bans and social isolation amount to.  Bed usage and hospital overflow and re-routing patients is going to become the new concern over the next few weeks, as all the ventilators and ICU beds get filled.</p>",
        "id": 190530474,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584119877
    },
    {
        "content": "<p>Contract tracing is beneficial so long as you have the resources to do something with the results.  If you're in an overwhelmed situation, then everyone should already be in lockdown and contact tracing doesn't help much.  If you're in early stages and people aren't in lockdown, then contact tracing is relevant because you can get people tested and into self-quarantine before they have as much opportunity to spread.  However, that only works if you've got both the testing capacity and the resources to reach out to the contacts.  The places it's useful vs. not is likely to evolve rapidly.  Keep in mind that we're likely to go through multiple phases with this.  We're going to have the early stages where tracing is useful/effective (at least in some regions that have the resources), we're going to have the tsunami where everyone's locked down and contact tracing is largely a waste of resources and then there's going to be the ongoing hotspots once the wave has diminished and you're wanting to monitor and quickly tamp-down the flare-ups that will be inevitable.</p>\n<p>In short, adding capabilities to support contact tracing is probably useful, with the understanding that the workflow should have minimal impact on clinical resources and shouldn't be used except when there are resources available to act on it.</p>",
        "id": 190536539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584122805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"270951\">@Jonathan Dick</span> it might make sense to create separate reusable RelatedPerson resources; it would help with analysis, but it would imply that the user picks previous contacts in the UI; I suppose it depends how much work goes into this</p>\n<p><span class=\"user-mention\" data-user-id=\"271229\">@Tom Matthews</span> it would be insane for this to be part of the clinical process, but that doesn't mean there's no value. It's part of how countries like Singapore and Taiwan are keeping a lid on this thing</p>",
        "id": 190538922,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584124122
    },
    {
        "content": "<p>it's typically done by public health teams following along behind the clinical process</p>",
        "id": 190538960,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584124164
    },
    {
        "content": "<p>What about cont[r]act tracing during a pandemic to identify people who <em>should</em> be sick but aren't?  I'm not an epidemiologist, but isn't there value in identifying people who are 1) naturally immune or 2) super-spreaders?</p>",
        "id": 190558891,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1584136214
    },
    {
        "content": "<p>Natural immunity is super difficult to distinguish from not having gotten the virus in the first place.  </p>\n<p>Typhoid Marys on the other hand, definitely of concern.  But keep in mind that the \"contact\" tracing around Typhoid Mary involved identifying people who had eaten at the same restaurant.  It wasn't a person-to-person contact trace.  They were tracing paths and locations, and discovered a commonality around the dinner where she was a short order cook.  Then they were able to trace to Mary.   Location tracing is a proxy for contact tracing.</p>",
        "id": 190580116,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584160589
    },
    {
        "content": "<p>To avoid wasting clinician time gathering contact tracing information, surely give patients an app (if they are well enough)  to identify contact information - who they might have infected (eg partners), where they have been, etc.</p>",
        "id": 190595383,
        "sender_full_name": "robert worden",
        "timestamp": 1584188567
    },
    {
        "content": "<p>The geotracking log is available on many modern smartphones.  Probably needs to be turned on manually.  There's a lot of people who would maybe willingly turn it on.  Sort of a privacy nightmare to send all the data to a server.  And the load would be insane.  But the other direction, where a server sends out known hotspots, and a user can locally trace their path to the hotspots.  That just might be doable.  Sort of a highly distributed computation algorithm, spread across everybody's cell phones.  </p>\n<p><a href=\"https://www.businessinsider.com/how-to-see-your-iphone-location-history-2015-11\" target=\"_blank\" title=\"https://www.businessinsider.com/how-to-see-your-iphone-location-history-2015-11\">https://www.businessinsider.com/how-to-see-your-iphone-location-history-2015-11</a></p>",
        "id": 190609256,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584212830
    },
    {
        "content": "<p>what about helping to manage the availability of equipment?<br>\nGot this from twitter - I was looking for something similar for AEDs but the question now is on respirators etc. - any scarce resource</p>",
        "id": 190647509,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584279531
    },
    {
        "content": "<p>In the US, the company that handles that is Agiliti, formerly United Hospital Services, formerly the ABC Oxygen Tent Rental Company.  They have warehouses of hospital equipment stored around the country.   I did my grad school capstone project with them, and tried to get them using FHIR.  They were uninterested in the FHIR architecture, except to the extent that the capstone project calculated cost savings for them.  I haven't reached out to them yet, but I could if there was an agreed upon request.</p>\n<p><a href=\"https://www.marketwatch.com/press-release/universal-hospital-services-to-become-agiliti-on-december-3-2018-11-27\" target=\"_blank\" title=\"https://www.marketwatch.com/press-release/universal-hospital-services-to-become-agiliti-on-december-3-2018-11-27\">https://www.marketwatch.com/press-release/universal-hospital-services-to-become-agiliti-on-december-3-2018-11-27</a></p>",
        "id": 190650328,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584283935
    },
    {
        "content": "<p>FYI <a href=\"https://www.projectopenair.org/\" target=\"_blank\" title=\"https://www.projectopenair.org/\">https://www.projectopenair.org/</a></p>",
        "id": 190685013,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584336407
    },
    {
        "content": "<p>(open source ventilator project after italian guy used 3d printer to replace a ventilator valve that had broken)</p>",
        "id": 190685015,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584336421
    },
    {
        "content": "<p>Vents are neat, but only a small part of the problem. Currently, when treating we're putting these patients in negative-vent-pressure full contact isolation beds. That's what we're more likely to run out of a lot faster than vents. Physicians and mid-levels will be in short supply faster. We might need a way to do a fair bit of tele-icu services but we need to figure out licensing reciprocity. Most of us are only licensed to practice in a few states (myself included) and the process to get licensed w/ additional states medical boards is time consuming and costly. We have NPIs, DEA numbers, it would be nice if we could get national provider reciprocity figured out and then use tech. to bring in a \"one provider record\" across the various EMRs.  Then we could all move towards the greatest needs and even do so as teledocs.</p>",
        "id": 190848397,
        "sender_full_name": "Tom Matthews",
        "timestamp": 1584452487
    },
    {
        "content": "<p>from an email I just sent someone::</p>\n<blockquote>\n<p>What I think is most appropriate now is for a geographical area to roll out a self-registering app to everyone in a region so the civil authority can start monitoring the population <br>\n- how many people have food and medicines<br>\n- how many people are sick<br>\n- how many people are likely to turn into an acute care problem in the next x days <br>\n- send out infection alerts <br>\n- send people information and advice <br>\n- ask for neighbours to help out</p>\n</blockquote>",
        "id": 191061825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584579561
    },
    {
        "content": "<p>Seems like a great idea.</p>",
        "id": 191062266,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1584580041
    },
    {
        "content": "<p>Without a link to a civil authority for now:</p>\n<p><a href=\"http://safepaths.mit.edu/\" target=\"_blank\" title=\"http://safepaths.mit.edu/\">http://safepaths.mit.edu/</a></p>",
        "id": 191067780,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1584587024
    },
    {
        "content": "<p>Re: Safe Paths -- Interesting, but limited (if I'm understanding correctly) to contract tracing / private geolocation sharing. Less about the bullet items Grahame just shared.</p>",
        "id": 191134727,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584633770
    },
    {
        "content": "<p>Re: Graham's bullet points....  perhaps invert the relationship to:</p>\n<ul>\n<li>who needs food and medicine</li>\n<li>who is sick</li>\n</ul>\n<p>I'm thinking of a geolocation beacon.  Sort of like \"Help, I can't get up\".  Instead.... \"help, I don't have food\" or \"help, I can't breath\".</p>",
        "id": 191201794,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584678083
    },
    {
        "content": "<p>this reminds me. I should've added this bullet point:</p>\n<ul>\n<li>Help, I'm out of toilet paper</li>\n</ul>",
        "id": 191204192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584682231
    },
    {
        "content": "<p>This weekend we have had the greatest hackathon ever:<br>\n#WIRvsVirusHackathon with more than 40.000 participants, 2.900 mentors and more than 1.500 projects.<span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span><br>\nOk, not FHIR, but for all of us .<span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 191440335,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1584949913
    },
    {
        "content": "<p>what is it actually doing?</p>",
        "id": 191454879,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584959534
    },
    {
        "content": "<p>i think he is referring to this<br>\n<a href=\"https://wirvsvirushackathon.org/?lang=en\" target=\"_blank\" title=\"https://wirvsvirushackathon.org/?lang=en\">https://wirvsvirushackathon.org/?lang=en</a></p>",
        "id": 191454982,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584959614
    },
    {
        "content": "<p>Correct, thx. The Swiss guys are currently working in the same direction. <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> <span class=\"user-mention\" data-user-id=\"195864\">@Roeland Luykx</span></p>",
        "id": 191574922,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1585036415
    },
    {
        "content": "<p>there is a  #CodeVsCOVID19 hackathon planned this weekend, see <a href=\"https://www.codevscovid19.org/\" target=\"_blank\" title=\"https://www.codevscovid19.org/\">https://www.codevscovid19.org/</a>,  since we have to prepare to move our appartement i can't participate fully <span aria-label=\"cry\" class=\"emoji emoji-1f622\" role=\"img\" title=\"cry\">:cry:</span></p>",
        "id": 191575481,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1585036900
    },
    {
        "content": "<p>and another one on 3.4 / 5.4 <a href=\"https://www.versusvirus.ch/\" target=\"_blank\" title=\"https://www.versusvirus.ch/\">https://www.versusvirus.ch/</a></p>",
        "id": 191607852,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1585056151
    },
    {
        "content": "<p>and another:  Join us at the Pandemic Response Hackathon on March 27-29th. Our goal is to bring #publichealth professionals alongside the #HealthIT community’s talent to contribute to the world’s response to #COVID19 and future pandemics. #hackCOVID19 @_TogetherHealth @ONC_HealthIT</p>",
        "id": 191655026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585075220
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/FtnKVZRAtiX8a8HWV53vRuJ9/Datavant-COVID-19-Hackathon-Projects.pdf\" target=\"_blank\" title=\"Datavant-COVID-19-Hackathon-Projects.pdf\">Datavant-COVID-19-Hackathon-Projects.pdf</a></p>",
        "id": 191655117,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585075273
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> should you cover #1 in your IG? (see PDF above): </p>\n<blockquote>\n<p>availability of services</p>\n</blockquote>",
        "id": 191655274,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585075353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Health System Map was exactly what got me started down the path on The SANER Project, the idea being to be able to report data to a system that could produce such a map wrt availability of services.</p>",
        "id": 191666164,
        "sender_full_name": "Keith Boone",
        "timestamp": 1585080993
    },
    {
        "content": "<p><a href=\"https://ifip94.wordpress.com/2020/03/25/re-tracing-the-footsteps-thoughts-on-implementing-guidelines-for-covid-19-surveillance-in-low-and-middle-income-countries/\" title=\"https://ifip94.wordpress.com/2020/03/25/re-tracing-the-footsteps-thoughts-on-implementing-guidelines-for-covid-19-surveillance-in-low-and-middle-income-countries/\">https://ifip94.wordpress.com/2020/03/25/re-tracing-the-footsteps-thoughts-on-implementing-guidelines-for-covid-19-surveillance-in-low-and-middle-income-countries/</a></p>",
        "id": 191964392,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585267698
    },
    {
        "content": "<p>This weekend I hacked together a COVID19 on FHIR geomapping tool.  I'm registering it with the EHR App stores.  </p>\n<p><a href=\"/user_uploads/10155/LbzE-QzhU3T7llgVT0RCgkQz/Covid19Geocoding.png\" title=\"Covid19Geocoding.png\">Covid19Geocoding.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/LbzE-QzhU3T7llgVT0RCgkQz/Covid19Geocoding.png\" title=\"Covid19Geocoding.png\"><img src=\"/user_uploads/10155/LbzE-QzhU3T7llgVT0RCgkQz/Covid19Geocoding.png\"></a></div><p><a href=\"/user_uploads/10155/5TdxKiQD_8VCxVEcjsKsEjad/Covid19Geomapping-SyntheaHeatmap.png\" title=\"Covid19Geomapping-SyntheaHeatmap.png\">Covid19Geomapping-SyntheaHeatmap.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/5TdxKiQD_8VCxVEcjsKsEjad/Covid19Geomapping-SyntheaHeatmap.png\" title=\"Covid19Geomapping-SyntheaHeatmap.png\"><img src=\"/user_uploads/10155/5TdxKiQD_8VCxVEcjsKsEjad/Covid19Geomapping-SyntheaHeatmap.png\"></a></div>",
        "id": 192274057,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1585582788
    },
    {
        "content": "<p>Where is the info on the SANER call?</p>",
        "id": 192282086,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1585586268
    },
    {
        "content": "<p>Interesting. I noticed that the spread is along the highways or commuter train lines.</p>",
        "id": 192286338,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1585587924
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> All info is in the <a href=\"#narrow/stream/226195-Covid-19-Response\" title=\"#narrow/stream/226195-Covid-19-Response\">https://chat.fhir.org/#narrow/stream/226195-Covid-19-Response</a></p>",
        "id": 192286510,
        "sender_full_name": "David Pyke",
        "timestamp": 1585587991
    },
    {
        "content": "<p>Meeting info is here: <a href=\"https://github.com/AudaciousInquiry/saner-ig/wiki/Meetings\" title=\"https://github.com/AudaciousInquiry/saner-ig/wiki/Meetings\">https://github.com/AudaciousInquiry/saner-ig/wiki/Meetings</a></p>",
        "id": 192286572,
        "sender_full_name": "David Pyke",
        "timestamp": 1585588020
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> - That's synthetic data.  Probably need to slap a warning label on it.  We're registering it in the EHR app stores, so people can generate actual data.</p>",
        "id": 192315496,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1585601382
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191678\">Abigail Watson</span> <a href=\"#narrow/stream/179160-social/topic/Pandemic.20Hackathon/near/192274057\" title=\"#narrow/stream/179160-social/topic/Pandemic.20Hackathon/near/192274057\">said</a>:</p>\n<blockquote>\n<p>This weekend I hacked together a COVID19 on FHIR geomapping tool.  I'm registering it with the EHR App stores.  </p>\n</blockquote>\n<p>Is this only for use within a single instance of (eg) Epic, or does it take data from anywhere, etc etc - a thousand questions for you!</p>",
        "id": 192401130,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585666842
    },
    {
        "content": "<p>Hi Dave,<br>\nThat's a little to be determined.  I'm currently (re)implementing the SMART on FHIR security infrastructure (this time with Josh Mandel's SMART on FHIR client).  </p>\n<p>In the past, I have been able to get multi-token OAuth working.  So, in effect, one app, multiple EHRs.  Haven't done it with Josh's library yet, so we will have to see.  In my prior project, I had an accounts infrastructure where the app managed its own usernames and passwords.  This Geomapping solution is much more lightweight, and doesn't currently have a database.  That helps makes it HIPAA compliant, but it means I don't have anywhere to store user account data and OAuth tokens.  </p>\n<p>So, we're probably going to start off with one instance of the Geomap with one hospital EHR instance.  There are some benefits to this approach, because we're going to need to load up maps specific to each city.  And the maps get heavy.  </p>\n<p>That being said, we're already containerized and running on AWS with a pretty great docker management utility developed by MIT alumns.  So I could stand up to 100+ containers (i.e. 100 cities or regions) without breaking a sweat.  Would have to figure out the pocket book and electrical expenses.  But the infrastructure is in place.  </p>\n<p>What I'm hoping to do is run one map per state or major metro region area, connecting to a dozen or hundred local hospitals.   </p>\n<p>Whether or not we're able to do a national map requires running a geospatial address index.  Doable, but we need to stand up a datalake.  That will require HHS or a Health Information Exchange getting behind the project, and us carving out new servers in the AWS HIPAA zone, which aren't necessarily built to scale out like our app container infrastructure is.  </p>\n<p>I know that's a lot of technical jargon.  Just absorb it, and understand I'm also documenting where we're at for other people reading this thread who might have the same question, and trying to answer the question completely.</p>",
        "id": 192531648,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1585749571
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> I was just stunned to learn the SANER project doesn't occur her on Zulip!  Who should know about it, what is it, where?</p>",
        "id": 192706398,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585851747
    },
    {
        "content": "<p>One reason to ask is that the Patient Empowerment WG is wondering if it should be participating.</p>",
        "id": 192706455,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585851778
    },
    {
        "content": "<p>Ah, googling helps - I thought it was an HL7 thing, but no, it's ONC. <a href=\"https://www.healthit.gov/techlab/ipg/node/4/submission/2661\" title=\"https://www.healthit.gov/techlab/ipg/node/4/submission/2661\">https://www.healthit.gov/techlab/ipg/node/4/submission/2661</a></p>",
        "id": 192706609,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585851847
    },
    {
        "content": "<p>GitHub repo:<br>\n<a href=\"https://github.com/AudaciousInquiry/saner-ig\" title=\"https://github.com/AudaciousInquiry/saner-ig\">https://github.com/AudaciousInquiry/saner-ig</a></p>",
        "id": 192706720,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1585851901
    },
    {
        "content": "<p>Zullip Channel<br>\n<a href=\"#narrow/stream/226195-Covid-19-Response/topic/The.20SANER.20Project\" title=\"#narrow/stream/226195-Covid-19-Response/topic/The.20SANER.20Project\">https://chat.fhir.org/#narrow/stream/226195-Covid-19-Response/topic/The.20SANER.20Project</a></p>",
        "id": 192706804,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1585851949
    },
    {
        "content": "<p>For convenience I'll paste this in, from that ONC page:</p>\n<blockquote>\n<p>The <strong>Situation Awareness for Novel Epidemic Response</strong> Project a.k.a, the SANER Project was launched by Audacious Inquiry in response to concerns from public health departments, health information exchanges supporting public health, and inquiries from public health officials at the regional, state and Federal level in the US.</p>\n<p>It is the technical part of a multi-pronged effort to develop a workable, quickly deployable, national approach for situational awareness. The initial short-term goals of this are three fold:</p>\n<ul>\n<li>Quickly develop a specification that will support communication of essential situation awareness data for consumption by public health.</li>\n<li>Test the ability of systems to use this specification.</li>\n<li>Pilot test systems implementing the specification in real world settings.</li>\n</ul>\n</blockquote>",
        "id": 192707288,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1585852199
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  We've basically taken over <a href=\"#narrow/stream/226195-Covid-19-Response\" title=\"#narrow/stream/226195-Covid-19-Response\">https://chat.fhir.org/#narrow/stream/226195-Covid-19-Response</a>, though there are some subtopics not SANER Related.</p>",
        "id": 192734808,
        "sender_full_name": "Keith Boone",
        "timestamp": 1585866107
    },
    {
        "content": "<p>See <a href=\"http://bit.ly/TheSANERProject\" title=\"http://bit.ly/TheSANERProject\">http://bit.ly/TheSANERProject</a> for the details on GitHub about who/what/where.</p>",
        "id": 192734920,
        "sender_full_name": "Keith Boone",
        "timestamp": 1585866148
    }
]