[
    {
        "content": "<p>Dave Bronkhart has suggested that we add a patient's overview for FHIR, along side out existing overviews - developer, architect, clinician. </p>\n<p>Opinions? Anyone interested to work on that?</p>",
        "id": 154017054,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541747364
    },
    {
        "content": "<p>I think the idea probably makes sense.  Of course we'd need to give it some thought as to how it should be presented.  I can't really volunteer to work on it, but I probably could review and offer some opinions.</p>",
        "id": 154017113,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1541766902
    },
    {
        "content": "<p>I would think there have been some articles written that put a Patient perspective on what FHIR is. I expect this would be good raw material to start with. Seems that the patient perspective should only attempt to go very shallow, and broad. Focusing on What gets enabled. Any smart Patient that wants to understand the deeper would switch persona into an implementer.  Does Dave have a recommendation of some articles? I am sure the author would be glad to provide them as raw material. I can look around, but don't know off hand of an article like this.</p>",
        "id": 154017149,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541774751
    },
    {
        "content": "<p>How about we start with the BlueButton 2.0 (I tried to get them to use BlueButton-on-FHIR).  <a href=\"https://www.medicare.gov/manage-your-health/medicares-blue-button-blue-button-20\" target=\"_blank\" title=\"https://www.medicare.gov/manage-your-health/medicares-blue-button-blue-button-20\">https://www.medicare.gov/manage-your-health/medicares-blue-button-blue-button-20</a></p>",
        "id": 154017150,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541774776
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span>  do you have bluebutton 2.0 'from the patient perspective' material?</p>",
        "id": 154017151,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541774908
    }
]