[
    {
        "content": "<p>I am new to this chat.  I'm an internal medicine physician who knows how to make some applications using technologies like the MEAN stack and Flutter.    I've gone through the HL7 FHIR intermediate course but I'm just getting started with FHIR and hoping to make some FHIR applications.  I was just wondering if anyone has any advice for me getting started creating a SMART on FHIR app.</p>",
        "id": 264923801,
        "sender_full_name": "Michael Albrecht",
        "timestamp": 1639515216
    },
    {
        "content": "<p>Best place to ask is probably on the <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a> stream.  And welcome :)</p>",
        "id": 264925377,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639515992
    },
    {
        "content": "<p>I don't think we have a stream for flutter, but there are some people interested in it</p>",
        "id": 264927753,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639517200
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"464543\">@Michael Albrecht</span>  You would be very welcome on the FHIR-FLI Slack group which is run by <span class=\"user-mention\" data-user-id=\"235060\">@Grey Faulkenberry</span>  and <span class=\"user-mention\" data-user-id=\"364926\">@John Manning</span> . All Flutter developers, including many clinicians, developing healthcare apps with FHIR. Grey has also built a Flutter library called \"fhir_auth\" which can turn your native app into a Smart on FHIR app. I have baked this into a questionnaire filler that can send its questionnaire responses from protected FHIR endpoints (see <a href=\"https://github.com/tiloc/faiadashu\">https://github.com/tiloc/faiadashu</a>). Check out <a href=\"https://github.com/MayJuun/fhir\">https://github.com/MayJuun/fhir</a> for details on Flutter FHIR libraries and info on how to contact Grey and the Slack group.</p>",
        "id": 264931986,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1639519013
    }
]