[
    {
        "content": "<p>In our recent discussion of the Google / Ascension project some pointed out that technically / legally Google (and Ascension) \"did nothing wrong.\" I'm not disputing that but as one ambassador from the patient universe, I feel a responsibility to share what this whole issue looks like to people out there.  So I'll drop occasional links here.  </p>\n<p>Technology Review: <a href=\"https://www.technologyreview.com/f/614708/health-websites-are-sharing-sensitive-medical-data-with-google-facebook-and-amazon/\" target=\"_blank\" title=\"https://www.technologyreview.com/f/614708/health-websites-are-sharing-sensitive-medical-data-with-google-facebook-and-amazon/\">Health websites are sharing sensitive medical data with Google, Facebook, and Amazon</a></p>\n<p>Cites this Financial Times piece <a href=\"https://www.ft.com/content/0fbf4d8e-022b-11ea-be59-e49b2a136b8d\" target=\"_blank\" title=\"https://www.ft.com/content/0fbf4d8e-022b-11ea-be59-e49b2a136b8d\">How top health websites are sharing sensitive data with advertisers</a> (paywalled)</p>\n<p>This brief Slashdot piece has this excerpt from the FT:</p>\n<blockquote>\n<p>The data, including medical diagnoses, symptoms, prescriptions, and menstrual and fertility information, are being sold to companies like Google, Amazon, Facebook, and Oracle and smaller data brokers and advertising technology firms, like Scorecard and OpenX. The FT analyzed 100 health websites, including WebMD, Healthline, health insurance group Bupa, and parenting site Babycentre, and found that 79% of them dropped cookies on visitors, allowing them to be tracked by third-party companies around the internet. This was done without consent, making the practice illegal under European Union regulations. ...</p>\n</blockquote>\n<p>(continued)</p>",
        "id": 180748433,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1573749673
    },
    {
        "content": "<p><strong>I'm posting this to document <em>how this looks</em> to people out there.</strong> We all (IMO) need to be cognizant of perceptions. </p>\n<p>IMO Facebook is the real creep in all this - innumerable covert practices, utter lack of irresponsibility for downstream consequences of leaked data (e.g. murders in Myanmar). They're ones with multiple stories of doing dodgy things, then instantly stopping as soon as they're outed.  BUT the general public only knows a vague generic \"Be careful about privacy!!  They're after your data!!\"  </p>\n<p>What we need to understand is that this is a perception issue, 100x more than an issue of reality. But perception issues can end up shutting down a good program. (A few years ago a clearly better recommendation about breast cancer screening got cancelled regardless of strong evidence, because it <em>looked</em> like someone was being careless.)</p>",
        "id": 180748800,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1573749898
    },
    {
        "content": "<p>From the respected ProPublica investigative site, July  2018: </p>\n<p><a href=\"https://www.statnews.com/2018/07/18/health-insurers-personal-details-raise-rates/\" target=\"_blank\" title=\"https://www.statnews.com/2018/07/18/health-insurers-personal-details-raise-rates/\">Health insurers are vacuuming up details about you. That could raise your rates</a></p>",
        "id": 180748921,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1573749963
    },
    {
        "content": "<p>yes the perception is really bad. With justification, outside of HIPAA. And there's real grounds for concern that HIPAA doesn't apply outside healthcare providers (or at all, outside USA)</p>",
        "id": 180768302,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573761501
    },
    {
        "content": "<p>Adrian Gropper actually covers this fairly well: <a href=\"https://thehealthcareblog.com/blog/2019/11/14/what-google-isnt-saying-about-your-health-records/\" target=\"_blank\" title=\"https://thehealthcareblog.com/blog/2019/11/14/what-google-isnt-saying-about-your-health-records/\">https://thehealthcareblog.com/blog/2019/11/14/what-google-isnt-saying-about-your-health-records/</a></p>\n<p>My only comment is ... Google is nothing special here. This is a long broken thing</p>",
        "id": 180769249,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573762077
    },
    {
        "content": "<p>more on <a href=\"https://histalk2.com/2019/11/14/news-11-15-19/\" target=\"_blank\" title=\"https://histalk2.com/2019/11/14/news-11-15-19/\">https://histalk2.com/2019/11/14/news-11-15-19/</a></p>",
        "id": 180780539,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573769189
    },
    {
        "content": "<p>And this: <a href=\"https://www.statnews.com/2018/07/18/health-insurers-personal-details-raise-rates/\" target=\"_blank\" title=\"https://www.statnews.com/2018/07/18/health-insurers-personal-details-raise-rates/\">Health insurers are vacuuming up details about you. That could raise your rates</a></p>\n<p>An oft-spoken concern is the fear that health insurers who would do THAT are likely also to be buying data from brokers, data that is scurrilous, of questionable provenance, and unverifiable.</p>",
        "id": 180802906,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1573794270
    },
    {
        "content": "<p>right. good concern. But they get outside HIPAA, or outside the law</p>",
        "id": 180805155,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573797533
    }
]