[
    {
        "content": "<p>On my blog, I have a section for asking me a question about HL7. Today's is pretty interesting:</p>",
        "id": 154011239,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540247696
    },
    {
        "content": "<blockquote>\n<p>With the release of MED-RT, Apelon asserts in their documentation that a Reference Terminology: is defined by Mayo as \"a terminology in which concepts have a formal, machine-usable definition supporting data aggregation and retrieval.\"</p>\n<p>My colleagues at Mayo are unable to claim attribution to this definition, albeit it does appear as a 'Reference Definition' on a CIMI wiki page hosted by Mayo.</p>\n<p>A Google search reveals the definition of a Reference Terminology is found in the Glossary of a book you co-author.  Unfortunately, I do not own the book and cannot tell if the term evolved elsewhere.</p>\n<p>Who authored the definition of Reference Terminology?</p>\n</blockquote>",
        "id": 154011240,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540247721
    },
    {
        "content": "<p>I admit to not remembering where I got the definition from. Does anyone have any comment? <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span></p>",
        "id": 154011241,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540247775
    },
    {
        "content": "<p>Does this help?</p>\n<p>'From SNOMED CT Glossary'<br>\n<a href=\"https://confluence.ihtsdotools.org/display/DOCGLOSS/reference+terminology\" target=\"_blank\" title=\"https://confluence.ihtsdotools.org/display/DOCGLOSS/reference+terminology\">https://confluence.ihtsdotools.org/display/DOCGLOSS/reference+terminology</a></p>\n<p><em>_reference terminology_</em><br>\n_A terminology in which each term has a formal computer processable definition that supports meaning based retrieval and aggregation. SNOMED CT is a reference terminology_</p>",
        "id": 154011309,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1540284029
    },
    {
        "content": "<p>SNOMED-RT was the first health care \"reference terminology.\" When they added in the Read Terms, they change the name to SNOMED CT. NDF-RT, and subsequently MED-RT, came after and used the same thinking SNOMED did, so I'd take the SNOMED CT Glossary as sufficient for sourcing the meaning.</p>",
        "id": 154011474,
        "sender_full_name": "Robert McClure",
        "timestamp": 1540315893
    },
    {
        "content": "<p>Wow, thank you all for your historical knowledge in finding the answer.  I needed to ask this in my spare time since MED-RT is not a NCI source, but just one of many EVS provides.  Mayo actually developed our current terminology server.  I will pass this information on to the MED-RT project manager.  Thanks again!</p>",
        "id": 154011608,
        "sender_full_name": "Robert Wynne",
        "timestamp": 1540329185
    }
]