[
    {
        "content": "<p>I'm blogging about <span class=\"user-mention\" data-user-id=\"308467\">@olivierkarasira</span> 's People's Choice award and it occurs to me, it would be useful to explain to the (my) public how FHIR and SNOMED CT are related.  Is it correct to say that SNOMED is one of many ways to put medical information into a computerized code set, so that it can be moved around using FHIR?</p>\n<p>Pardon me if that's grossly naive.  This is how I roll: I give it a shot, then get shot down, and recurse until the \"shot down\" part ends <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 202116378,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1593191088
    },
    {
        "content": "<p>I'd express it as follows: \"When data needs to be 'understood' by computers so that they can guide clinical decisions (e.g. don't order that drug because the patient is allergic to it), the information needs to be represented in a way computers can understand rather than just text.  SNOMED is a standard for encoding a wide variety of health-related concepts in ways computers can understand - drugs, diseases, parts of the body, etc.\"</p>",
        "id": 202117074,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593191513
    },
    {
        "content": "<p>Great, for this use I'll steal the second sentence.  (Well, \"steal\" with credit... not sure if that's stealing!)</p>",
        "id": 202117182,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1593191568
    },
    {
        "content": "<p>Am I right about FHIR being (in simple terms) a way of moving it around?</p>",
        "id": 202118929,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1593192509
    },
    {
        "content": "<p>yes</p>",
        "id": 202121023,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593193774
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  We use SNOMED  when we are transcribing  health data   to computerized code , so that sovereignty FHIR server can covert it to interoperable records we display on patients  phones.</p>",
        "id": 202121658,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1593194103
    },
    {
        "content": "<p>It's also worth reading the Introduction to the <a href=\"https://confluence.ihtsdotools.org/display/FHIR/Introduction+to+using+SNOMED+with+FHIR\">Implementation Guide</a> currently being developed by the 'SNOMED on FHIR' Project - a joint collaboration between HL7 International and SNOMED International.</p>",
        "id": 202155560,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1593214503
    }
]