[
    {
        "content": "<p>removed</p>",
        "id": 219530062,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607632359
    },
    {
        "content": "<blockquote>\n<p>if I wanted to get an accurate representation of my full medical history I would add every provider I visit as a data source within an aggregator app</p>\n</blockquote>\n<p>In theory, in practice you can get your data from just a fraction of the providers, so getting data from payer would be 'better than nothing'</p>",
        "id": 219531359,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1607632971
    },
    {
        "content": "<p>First, I'll repeat my loathing of the term \"payers.\" :-)   For one thing, it's a totally \"medicine as big business\" term, a label that is appropriate only from the perspective of the people watching the money flow.  And doing that (focusing on the money flow) is the root cause of so many dysfunctions that seem to mystify smart people.</p>\n<p>A second sign of the dysfunction is that from the POV of THE SICK PERSON - the person for whom the industry exists - too often they're the NOT-payers - the ones who refuse to \"pay\" for a claim or a treatment recommendation. Not surprisingly, these moments are literally non-events for people who are just watching the money flow.  So I hope people will just stop calling insurance companies payers.</p>\n<p>Ergo, I'll continue this under the title \"insurance as...\"</p>",
        "id": 219535692,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1607635402
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> , corrected this for you. Just me using shorthand. I am actually a big fan of yours and I volunteer to advance interoperability. I appreciate your feedback!</p>",
        "id": 219536353,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607635732
    },
    {
        "content": "<p>Oh rats you beat me to it - I just came back to say \"I don't mean this personally\" :-)   Thanks for understanding. </p>\n<p>Now shall I explain why I also don't consider them \"health plans\"? :-)   Seriously - they are in no way plans to achieve health; you can tell because for one thing, they don't talk to me about planning for my health.  It's just another euphemism. </p>\n<p>They really are healthcare insurance plans, or, as some activists call them, payment managers. </p>\n<p>Anyway hi again, and thanks for understanding. And as my branch reply said, I think we should ask first who is best suited to getting the job done accurately and for the benefit of the beneficiary, not just the \"convenience error\" of asking who's already got a ton of data flow going on.</p>",
        "id": 219537570,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1607636319
    },
    {
        "content": "<p>I'm guessing that part of it is who <em>wants</em> the data.</p>\n<p>A provider wants to keep their data about you and the care they provided, but isn't as inclined to take in data from other providers and become custodians of that data.  Part of this is that since they didn't provide those services, they didn't get paid for them either (storage and processing costs have to be eaten).  There are other (and more complex) reasons, such as barriers to connecting to 'n' arbitrary systems (if the patient can correctly remember them), accuracy of data, etc.  Overall, it's not an easy sell.</p>\n<p>An insurer, on the other hand, wants to have as much data about a person as possible.  More data = better actuary tables.  More data = preventative care that saves money and improves the health of the group.  More data is just more better  =).  This works out since the <em>current</em> set for USCDI isn't too costly to store, though I wonder what will happen as that changes (e.g., if USCDI starts to include imaging data, etc.).</p>\n<p>As an interested patient that travels quite a bit (during non-pandemic times), I would be happy to have an accessible long-term repository.  I would even pay a nominal annual cost for one... but I don't know if the 'average' American patient is motivated enough to do so.</p>",
        "id": 219538888,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1607637104
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179160-social/topic/removed/near/219538888\">said</a>:</p>\n<blockquote>\n<p>As an interested patient that travels quite a bit (during non-pandemic times), I would be happy to have an accessible long-term repository.  I would even pay a nominal annual cost for one... but I don't know if the 'average' American patient is motivated enough to do so.</p>\n</blockquote>\n<p>Great addition, <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>.   To be clear, I don't object to an insurer being <em>a</em> repository, if you or I invite them. In my ideal future world there will be a single source of truth, and I will give access to it, to whomever I want.  Sort of the <a href=\"http://sovereigntynetwork.com\">Sovereignty Network</a> model. </p>\n<p>I just don't want this community to be earnestly assuming that just because they're convenient, they'll be a suitable default.</p>",
        "id": 219543328,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1607639439
    },
    {
        "content": "<blockquote>\n<p>if you or I invite them</p>\n</blockquote>\n<p>Insurers already collect a massive quantity of clinical data about their members  - don't need invitation, just agreement with the providers (patient can opt out, but they rarely do)</p>",
        "id": 219545048,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1607640560
    },
    {
        "content": "<p>I all depends where you live I guess - speaking from the EU perspective: under the GDPR and its predecessors no insurance company would ever be able to be the custodian of a healthcare record, in principle they are provided with the absolute minimal data to substantiate a claim. They are not, and should not be, the custodian of any healthcare data. As such the idea of an insurance company playing a role in storing healthcare data, or making it available to providers or patients is simply absurd. Vive la difference !</p>",
        "id": 219573606,
        "sender_full_name": "René Spronk",
        "timestamp": 1607673228
    },
    {
        "content": "<p>I migrated the thread here: <a href=\"#narrow/stream/179166-implementers/topic/Payer-to-payer.20and.20Payer-to-provider.20connections\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Payer-to-payer.20and.20Payer-to-provider.20connections</a></p>",
        "id": 220020928,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1608056669
    }
]