[
    {
        "content": "<p>Hi all - <br>\nI work in population health informatics and research currently leading a data quality metrics project that will be based on data extracted from EHRs for secondary uses (e.g. surveillance, research) and also very new to FHIR.</p>\n<p>We've started exploring the use of FHIR for data fingerprinting and generating descriptive statistics about data sources. I was told that the FHIR MeasureResource, MeasureReport, and Evaluate-Measure operation are good places to start to structure and transfer these data quality data. (as an aside, I've started to map our DQ tests and results in Excel, but I think that's the wrong approach to take to get started).</p>\n<p>I'm reaching out to see if there is a research-oriented collaboration community. If so, we'd love to participate and figure out how we can use FHIR for secondary uses of e-health data like research and public health surveillance, specifically in a distributed health data network. <br>\nThanks in advance!</p>",
        "id": 153954564,
        "sender_full_name": "Jessica Malenfant",
        "timestamp": 1524765255
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191808\">@Wayne Kubick</span></p>",
        "id": 153954620,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524775844
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195498\">@Jessica Malenfant</span>  Hi, Jessica.  I have a small stream under <a class=\"stream\" data-stream-id=\"179200\" href=\"/#narrow/stream/179200-biopharma\">#biopharma</a>  but it's been mostly limited to clinical trials to date.  I have been in conversations with others about uses such as regulatory review, safety surveillance and other research-focussed secondary uses, so suggest you sign up for that stream.  Also worth connecting with <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> regarding Bulk Data and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> regarding All of Us.</p>",
        "id": 153954669,
        "sender_full_name": "Wayne Kubick",
        "timestamp": 1524778126
    },
    {
        "content": "<p>In addition to <a class=\"stream\" data-stream-id=\"42\" href=\"/#narrow/stream/42-biopharma\">#biopharma</a>, there are a couple of work groups you may want to monitor.  The <a href=\"http://Biomedical%20Research%20and%20Regulation\" target=\"_blank\" title=\"http://Biomedical%20Research%20and%20Regulation\">http://www.hl7.org/Special/committees/rcrim/index.cfm</a> deals with the research area in general.  The <a href=\"http://www.hl7.org/Special/committees/cqi/index.cfm\" target=\"_blank\" title=\"http://www.hl7.org/Special/committees/cqi/index.cfm\">Clinical Quality Information</a> work group deals with the resources and operation you've identified.  You might also be interested in the <a href=\"http://hl7.org/fhir/us/daf-research/\" target=\"_blank\" title=\"http://hl7.org/fhir/us/daf-research/\">DAF Research</a> project.  As well, if there's interest, we could certainly look at establishing a Research stream.</p>",
        "id": 153954706,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524787992
    },
    {
        "content": "<p>Hi Jessica,</p>\n<p>That's sounds like a great idea. In the Netherlands we have the <a href=\"http://www.medicalintelligence.info/\" target=\"_blank\" title=\"http://www.medicalintelligence.info/\">Medical Intelligence</a> initiative, which is a collaboration between Dutch academic hospitals and Furore to build a generic architecture and share knowledge on clinical data collection for research and quality measurement. The first hospitals now started to investigate the possibilities of FHIR. </p>\n<p>One of them is using Questionnaire and QuestionnaireResponse to automatically extract data from their EHR and send it to the auditing party. Another one has built a <a href=\"https://fire.ly/vonk/vonk-fhir-facade/\" target=\"_blank\" title=\"https://fire.ly/vonk/vonk-fhir-facade/\">Vonk Facade server</a> as a layer above their custom non-fhir data warehouse. The Vonk Facade server provides the mappings to FHIR resources, which are sent to an application researchers use for data collection of their patients. If you are interested, there's a tutorial online on how to build a Vonk Facade Server: <a href=\"http://docs.simplifier.net/vonk/facade/facadestart.html\" target=\"_blank\" title=\"http://docs.simplifier.net/vonk/facade/facadestart.html\">http://docs.simplifier.net/vonk/facade/facadestart.html</a></p>\n<p>Good luck!</p>\n<p>Lilian</p>",
        "id": 153954934,
        "sender_full_name": "Lilian Minne",
        "timestamp": 1525074835
    },
    {
        "content": "<p>Hi - thanks all!<br>\n<span class=\"user-mention\" data-user-id=\"191808\">@Wayne Kubick</span>   thanks - I do know Dan actually and I'll follow-up with him on the bulk data work. I'm also following the <a class=\"stream\" data-stream-id=\"179200\" href=\"/#narrow/stream/179200-biopharma\">#biopharma</a> stream now as well, thanks. <br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks - I'll look into that HL7 workgroup. If we wanted a research stream here, how would you suggest we solicit interest? It would be great to connect with others doing this work.<br>\n<span class=\"user-mention\" data-user-id=\"193983\">@Lilian Minne</span>  - I'll take a look at that tutorial and see if it's something we might use.</p>\n<p>We're just starting to write out the FHIR JSON structure in Notepad as a starting point for 3 data quality metrics we're interested in</p>",
        "id": 153961363,
        "sender_full_name": "Jessica Malenfant",
        "timestamp": 1526415261
    },
    {
        "content": "<p>Let's start this way: Who would join a research stream if we created one?  Give a thumbs-up to this post if you would :)</p>",
        "id": 153961364,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526415357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span></p>",
        "id": 153961446,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1526454299
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - I think there is a community here - some of us follow biopharma - some topics are covered there but we have a different focus. Especially those of us who work on study sites. I could count 40-50 friends &amp; acquaintances in clinical research also dealing with FHIR for the purpose. Having a clinical research Stream would greatly help having those discussions here and not elsewhere.</p>",
        "id": 153982198,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533490869
    },
    {
        "content": "<p>Very well.  <a class=\"stream\" data-stream-id=\"135\" href=\"/#narrow/stream/135-research\">#research</a> now exists :)</p>",
        "id": 153982239,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533513127
    }
]