[
    {
        "content": "<p>Hello, my name is Marissa Radensky, and I am a rising third-year computer science PhD student at the University of Washington, currently interning at Microsoft. I am looking to recruit participants for a research study aimed at understanding how users may interact with an AI clinical decision-support tool.</p>\n<p>Participation entails completing two surveys and an interview to gather reactions to PowerPoint mock-ups of an AI clinical decision-support tool for evaluating chest x-rays for pneumonia. The study will be conducted over Microsoft Teams and will take one hour. The study’s findings will contribute towards improving AI-assisted decision-making in healthcare.</p>\n<p>If you have any experience in evaluating chest x-rays (as a radiologist, nurse practitioner, medical student, etc.) and would be interested in participating, please fill out this short survey: <a href=\"https://forms.office.com/r/pw0T4VAbLB\">https://forms.office.com/r/pw0T4VAbLB</a>.</p>\n<p>Thank you!<br>\nMarissa</p>\n<p>If you have any questions about this project, please let me know.<br>\nContact: <a href=\"mailto:t-mradensky@microsoft.com\">t-mradensky@microsoft.com</a> (Marissa Radensky), <a href=\"mailto:duburson@microsoft.com\">duburson@microsoft.com</a> (Dustin Burson), Microsoft Health and Life Sciences Cloud and Data Team, One Microsoft Way, Redmond, WA 98052, USA. |<br>\nExternal Participants: <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\">https://privacy.microsoft.com/en-US/data-privacy-notice</a><br>\nMicrosoft Employees: <a href=\"https://privacy.microsoft.com/en-us/privacystatement\">https://privacy.microsoft.com/en-us/privacystatement</a></p>",
        "id": 251483544,
        "sender_full_name": "Marissa Radensky",
        "timestamp": 1630457287
    },
    {
        "content": "<p>Hi Marissa, you may want to contact <a href=\"http://siim.org\">SIIM</a> or the RSNA. They can put you in touch with radiologists, Rad techs, and others familiar with reading images. I can connect you if you’d like. </p>\n<p>Also note, that SIIM will be running its C-MIMI (conference on machine intelligence in medical imaging) in a couple of weeks, and it may be worth it for you to attend. I don’t know if they can give your research a shout out, but it couldn’t hurt to ask.</p>",
        "id": 251491460,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1630464403
    },
    {
        "content": "<p>Hi Elliot, thanks so much for the tips! If you would be able to connect me to SIIM or RSNA, I would greatly appreciate it. My email is <a href=\"mailto:t-mradensky@microsoft.com\">t-mradensky@microsoft.com</a>.</p>",
        "id": 251590201,
        "sender_full_name": "Marissa Radensky",
        "timestamp": 1630514352
    },
    {
        "content": "<p>Hello Everyone,</p>\n<p>My name is Razib, and I work for the Product team at Medchart. We are currently building a new set of APIs to enable apps to connect their users' health and medical data.</p>\n<p>Every week as a team we connect with our users and potential users to have conversations to learn about the challenges you might be facing. </p>\n<p>If anyone here is interested to chat for 30-40 min with my team let me know. </p>\n<p>Excited and looking forward to our chat.</p>\n<p>Razib</p>",
        "id": 253146374,
        "sender_full_name": "Razib",
        "timestamp": 1631561470
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 253175191,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1631575045
    }
]