[
    {
        "content": "<p>Hi All, just signed in to the chat...</p>\n<p>I’m a data architect want to know what tools HL7 uses to author and maintain FHIR standards. I’m maintaining our internal data schemas,  and want to conform to FHIR as much as possible. However there is always need for further restrictions/extensions in some specific scenarios. I’m interested in best practices of authoring these “restricted/extended” schemas, and would like to learn from you all :-)</p>\n<p>Thanks!</p>",
        "id": 246530789,
        "sender_full_name": "Yvonne Yang",
        "timestamp": 1626740385
    },
    {
        "content": "<p>Welcome <span class=\"user-mention\" data-user-id=\"427728\">@Yvonne Yang</span>.  Constraining the base standard is done through a process called <a href=\"http://hl7.org/fhir/profiling.html\">profiling</a>.  To extend you make use of <a href=\"http://hl7.org/fhir/extensibility.html\">extensions</a>.  Neither involve making any changes to the schema.  Adding new elements to the schema is actually non-conformant - and won't interoperate with anyone or with the standard tools.</p>\n<p>The FHIR core specification is published using a set of custom Java code managed <a href=\"https://github.com/hl7/kindling\">here</a>.  In general, no-one should need that other than HL7.  Implementation Guides (which is how you define your particular sets of constraints and usage of extensions) can be published using either <a href=\"https://simplifier.net\">Simplifier</a> or using the <a href=\"https://wiki.hl7.org/IG_Publisher_Documentation\">HL7 IG Publisher</a></p>",
        "id": 246531232,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626740755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thank you for your quick response! I will look into those <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 246531532,
        "sender_full_name": "Yvonne Yang",
        "timestamp": 1626741017
    }
]