[
    {
        "content": "<p>I would like community feedback on where I should drive active discussions on improving FHIR guidance on Security and Privacy? Should this continue to be topics within \"Implementers\" to get broad read, or should we create a dedicated stream so that the interested few can more easily find the discussions.</p>",
        "id": 153948203,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522092422
    },
    {
        "content": "<p>I'm not sure about this. Generally, from experience, specific subjects have to be compelling in their own right to create enough impetus for their own streams. only about 1/3 of created stream gather critical mass. This is an important subject, and worth considering, but I'm not sure it's separate enough. Note, though, that the penalty for a stream failing is very low</p>",
        "id": 153948214,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522095747
    },
    {
        "content": "<p>Personally, I would appreciate a <code>security</code> stream as it would make it easier for me to follow. Implementers receives so much traffic (most of which isn't in my wheelhouse) that I end up just skimming the topics each day and only stopping if a topic catches my eye.</p>\n<p>I understand the desire to only create streams that can stand on their own and garner enough traffic. I think security should be able to sustain that.</p>",
        "id": 153948271,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522113483
    },
    {
        "content": "<p>I was teaching a class and told them there was a security stream they could direct security topics to, and then went to show them how to find it and discovered it doesn't exist.  So definitely a +1 from me :)</p>",
        "id": 153948277,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1522114657
    },
    {
        "content": "<p>We will discuss on today's FHIR Security call at 2:00 Eastern.. All are welcome to HL7 WG calls, just please identify yourself.</p>",
        "id": 153948373,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522158023
    },
    {
        "content": "<p>John, what is the info. for the call? Thanks!</p>",
        "id": 153948476,
        "sender_full_name": "Julie Maas",
        "timestamp": 1522174868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194368\">@Julie Maas</span> - <a href=\"http://wiki.hl7.org/index.php?title=HL7_FHIR_Security_2018-03-27\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=HL7_FHIR_Security_2018-03-27\">http://wiki.hl7.org/index.php?title=HL7_FHIR_Security_2018-03-27</a></p>",
        "id": 153948478,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1522175418
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 153948484,
        "sender_full_name": "Julie Maas",
        "timestamp": 1522176861
    },
    {
        "content": "<p>I did create a Security and Privacy stream this morning. Please direct your security and privacy geeks toward this stream for a focused discussion of all things security and privacy. Note that Grahame has also create a stream to focus on advocacy of consumer empowerment.</p>",
        "id": 153949797,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522673928
    }
]