[
    {
        "content": "<p>Is this a big deal for some potential adopters, or just a clever hack, or a cloud of smoke, or...?</p>\n<p><a href=\"https://aws.amazon.com/blogs/architecture/building-a-serverless-fhir-interface-on-aws/\" target=\"_blank\" title=\"https://aws.amazon.com/blogs/architecture/building-a-serverless-fhir-interface-on-aws/\">https://aws.amazon.com/blogs/architecture/building-a-serverless-fhir-interface-on-aws/</a>?</p>",
        "id": 177494710,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1570431365
    },
    {
        "content": "<p>I think it's real and useful for some implementers</p>",
        "id": 177502618,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570439840
    },
    {
        "content": "<p>Separate from the tech in the article, this opening text \"wins the internet\" as best-ever non-health-IT layman's intro to what FHIR's about!</p>\n<blockquote>\n<p>Technology is revolutionizing the healthcare industry but it can be a challenge for healthcare providers to take full advantage because of software systems that don’t easily communicate with each other. A single patient visit involves multiple systems such as practice management, electronic health records, and billing. When these systems can’t operate together, it’s harder to leverage them to improve patient care.</p>\n<p>To help make it easier to exchange data between these systems, Health Level Seven International (HL7) developed the Fast Healthcare Interoperability Resources (FHIR), an interoperability standard for the electronic exchange of healthcare information.</p>\n</blockquote>",
        "id": 177505310,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1570442406
    },
    {
        "content": "<p>Useful for implementors who don't mind vendor lockin with a monopoly.  Good luck in trying to migrate your infrastructure away from AWS after setting some of those lambda functions up.   They brand it as 'serverless', but the fact of the matter is that there are servers involved, and Amazon is controlling them and just not exposing their interface to you.</p>",
        "id": 178689414,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1571686427
    },
    {
        "content": "<p>This particular article talks about how one could put together a serverless FHIR Server, but the reality is, it's still using a Java based server on the backend, it just doesn't have assigned infrastructure or a whole lot of typical \"Server\" state mechanics.   As a POC (proof of concept),  it's got a huge cool factor.  For production, it's probably got a different letter at the end of the acronym.</p>",
        "id": 180395858,
        "sender_full_name": "Keith Boone",
        "timestamp": 1573445569
    }
]