[
    {
        "content": "<p>1 . The security label can be applied to the elements’ layer rather than resources.<br>\nFor example, the consent of the owner of the health information only applies to the part of the CONDITION resource instead of the entire resource.</p>\n<ol start=\"2\">\n<li>\n<p>A separate triage tag can be specified out of  the meta.tags for priority and time sensitivity of patient safety resource information. This triage tag can enable the system to push the information to the registered endpoints instead of waiting for the pull.</p>\n</li>\n<li>\n<p>A guideline should provide suggestions on the number of reference layers to leverage smooth message exchanges without triggering a storm.</p>\n</li>\n</ol>",
        "id": 277912324,
        "sender_full_name": "Thomas Zhou",
        "timestamp": 1649178649
    },
    {
        "content": "<ol>\n<li>That was reviewed and rejected as unneeded by the large majority of the community by the FHIR team </li>\n<li>That can be added by creating a custom profile.  If you wish to see it added to the Core spec, you can add a ticket in <a href=\"http://jira.hl7.org\">jira.hl7.org</a></li>\n<li>If you wish to see it added to the Core spec, you can add a ticket in <a href=\"http://jira.hl7.org\">jira.hl7.org</a> with suggested language</li>\n</ol>",
        "id": 277916113,
        "sender_full_name": "David Pyke",
        "timestamp": 1649180197
    },
    {
        "content": "<p>With respect to #3, it's hard to define guidance that applies universally because there is such variation in architecture, requirements and expectations.  For some systems and types of exchanges, multiple messages an hour is overload.  For others, less than 100/second is a sign some of their participants are probably having network issues.  Guidance about things like \"number of layers\" almost always belongs in an implementation guide where the implementation guide can establish a shared set of expectations in which establishing such architectural expectations is reasonable/realistic.</p>",
        "id": 277938230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649190085
    },
    {
        "content": "<p>I need to develop a HMIS software for a hospital. who can help me?</p>",
        "id": 278000362,
        "sender_full_name": "maisam Ali",
        "timestamp": 1649238856
    },
    {
        "content": "<p>That would depend on what help you need.  Can you ask a more specific question?</p>",
        "id": 278018599,
        "sender_full_name": "David Pyke",
        "timestamp": 1649249588
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 278032591,
        "sender_full_name": "Angelo Ferreira",
        "timestamp": 1649255717
    }
]