[
    {
        "content": "<p>Seeing yet another of <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> 's courteous \"Please introduce yourself on #social, not here\" notes <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>, and having recently been new here, and being all about clarity, I wonder:</p>\n<p>Would there be a better name for that stream?  #Announcements-Official?  #Announcements-Important?</p>\n<p>Long ago I noticed that there's a special \"ouch\" to joining a community and discovering that the first thing I do is a mistake, attracting a correction. No matter how gentle the correction might be, I always think \"I wish they'd SAID this wasn't for that kind of post.\"</p>\n<p>(Don't anyone say \"But it's in the description,\" because that's not user-centered thinking, now is it? :-) \"You would have known better, if you weren't so stupid\" is not my style :-))</p>",
        "id": 170579506,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562792549
    },
    {
        "content": "<p>Since the creation of the \"work opportunities\" stream, which is restricted to certain people posting, I've been wondering why we don't do the same thing with Announcements? If you have an announcement, ask an admin to post it.</p>",
        "id": 170581201,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1562794175
    },
    {
        "content": "<p>we try to keep a gentle hand on the admin, but perhaps this is justified</p>",
        "id": 170582683,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562795630
    },
    {
        "content": "<p>The signal/noise ratio is quite acceptable up to now, which fits with the spirit of the community. Closing things down to admin is only applicable if there's a very good reason for doing so. I'd question why the job opportunities stream is 'closed', but I recognize HL7 is trying to get some money out of (FHIR) job postings on its website [it's a 'membership advantage'], so that may (or may not) be a factor.</p>",
        "id": 170601573,
        "sender_full_name": "René Spronk",
        "timestamp": 1562820399
    },
    {
        "content": "<p>Don't think it's a money thing - just that Grahame is the curator...</p>",
        "id": 170602708,
        "sender_full_name": "David Hay",
        "timestamp": 1562822352
    },
    {
        "content": "<p>I'd love for Zulip to have \"sticky topics\" that  always stay on top of a stream and give information about the dos and don'ts.</p>",
        "id": 170606141,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1562827180
    },
    {
        "content": "<p>Sticky topic is on Zulip todo list</p>",
        "id": 170609367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562830517
    },
    {
        "content": "<p>I/we don’t charge for job opportunities stream. I moderate that to ensure discipline on its use - both who posts and when, and what they say, so that it’s high signal to noise ratio</p>",
        "id": 170609436,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562830578
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> which \"this\" is perhaps justified? My rename proposal or closing access?</p>\n<p>Another option is a separate stream #Introduce-yourself. The SPM forum has that, and its purpose and scope are obvious to newbies. (But that only addresses one source of misposts.)</p>",
        "id": 170627776,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562848223
    },
    {
        "content": "<p>what do other people think about an #introduce-yourself stream?</p>",
        "id": 170668026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562876117
    },
    {
        "content": "<p>closing access. maybe</p>",
        "id": 170668027,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562876117
    },
    {
        "content": "<p>I don't see a need.  Most people don't bother.  I think it would create noise - because for every introduction there'd be multiple welcomes and I  don't think we want to devote additional moderator support to that</p>",
        "id": 170681592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562887305
    },
    {
        "content": "<p>I don't see the need for a moderator either. The FHIR chat is very disciplined compared to other platforms.</p>",
        "id": 170697911,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1562912431
    }
]