[
    {
        "content": "<p>See JSON, RDF and XSD files in the download section at <a href=\"https://www.hl7.org/fhir/downloads.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/downloads.html\">https://www.hl7.org/fhir/downloads.html</a>. Does UML files such as XMI or EAP exist? </p>",
        "id": 153840561,
        "sender_full_name": "Parris Lucas",
        "timestamp": 1469200988
    },
    {
        "content": "<p>Not at present.  The UML diagrams are generated directly.  When we last looked, the consistency of XMI to represent diagrams was low and others who cared about UML representations were happy enough to drive from the schemas or the reference implementations.  Having XMI is really just waiting on having someone who wants it enough they're willing to write the converter from the StructureDefinitions and test the result with various tools.</p>",
        "id": 153840670,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469217717
    },
    {
        "content": "<p>there is an eCore generated model. That is something that is more sensible to generate that XMI. What do you want to do with XMI?</p>",
        "id": 153840677,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469218947
    },
    {
        "content": "<p>We are developing complete round-trip conversion between FHIR STU3 StructureDefinition and UML as part of the Model Driven Health Tools (MDHT) project, now part of <a href=\"http://Eclipse.org\" target=\"_blank\" title=\"http://Eclipse.org\">Eclipse.org</a>.  We intend use the UML models and associated tooling for FHIR profile design, model transformation, mapping, and code generation.  As part of MDHT, we are developing a UML profile for FHIR.  Still work in progress, but coming along well.  Per Lloyd’s comment, we are focused on the model representation, not including diagrams.  Any UML 2.5 tool could be used to create the diagrams.<br>\n  See <a href=\"https://projects.eclipse.org/projects/modeling.mdht\" target=\"_blank\" title=\"https://projects.eclipse.org/projects/modeling.mdht\">https://projects.eclipse.org/projects/modeling.mdht</a></p>",
        "id": 153840730,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1469300604
    },
    {
        "content": "<p>I just created a temporary channel 'hacking-health' to support the Australian hacking Health event. And for hacking health to evluate the use of a chat channel</p>",
        "id": 153840839,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469414182
    }
]