[
    {
        "content": "<p>This isn't really FHIR-related (or even HL7-related), but it's a question I had that I couldn't find an answer to elsewhere, so I figured asking this community of bright people had as good odds of getting me an answer as anywhere :)</p>\n<p>I know there's significant work underway to create, test and eventually roll out (on a scale more massive than ever before accomplished) a vaccine that will protect against COVID-19.  However, I also know that there's been minimal success in developing vaccines that are effective against the common cold which is also a corona virus and that vaccines against the flu (a set of related corona viruses) have limited effectiveness because there are multiple strains, each of which requires different vaccine components to deliver protection and because of the continuing evolution of those strains.  (If my layman's understanding in the preceding paragraph is out to lunch/inaccurate in any way, feel free to correct.)</p>\n<p>So, given those challenges with other corona viruses, is it realistic to be optimistic that an effective vaccine can be developed and delivered before this virus splits into numerous strains, each requiring their own vaccine development and essentially turning into the same whack-a-mole that we play with influenza, though on a far more deadly scale?</p>\n<p>I very much would love for the answer to be 'yes' - i.e. regardless of how things go over the next little while, we can be relatively confident that in 2-ish years, enough people will be vaccinated that we can get back to semi-normal behavior.  However, if the answer is 'no' or 'we're not sure', it would be good to know...</p>",
        "id": 191044302,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584566753
    },
    {
        "content": "<p>I'm not qualified to have much of an opinion on vaccine development but just as a background point - the common cold is mostly rhinoviruses, plus a few coronaviruses, and some other stuff. Coming up with a vaccine for this entire zoo may be impossible, but that has no bearing on the new coronavirus.</p>",
        "id": 191046846,
        "sender_full_name": "Paul Church",
        "timestamp": 1584568148
    },
    {
        "content": "<p>From what I can understand, the current virus is similar to the SARS virus, and there were vaccines developed for it, but never made it to production, because there was no need. That makes me think that a vaccine for COVID-19 is very much possible.</p>",
        "id": 191048880,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1584569181
    },
    {
        "content": "<p>Apparently no SARS vaccine made it beyond phase I safety trials before the disease vanished and funding dried up.</p>",
        "id": 191052604,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1584571724
    },
    {
        "content": "<p>my opinion (worth what you are paying for it): anyone can come up with a candidate vaccine. Producing it at volume and showing through a series of trials that (a) it works and (b) doesn't have side effects that make it non-viable are the hard slow expensive things to do. The available candidates haven't got that far through this process</p>",
        "id": 191061486,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1584579064
    },
    {
        "content": "<p>As I understand it, the geneticists have already identified at least one COVID-19 mutation already.  But that's pretty typical.  On average, viruses can mutate 2 to 6 times a month.  But most mutations are negligible.  The question is whether it's a mutation that can achieve homeostasis, which usually means sort of forking itself into a different metabolic or epigenenetic pathway.  And those only happen every.... idk few thousand mutations, or every 5 or 10 years.  </p>\n<p>For instance, SARS was estimated as the same mutation rate as HIV, which means it's not particularly mutagenic as far as viruses go.  <br>\n<a href=\"https://bmcevolbiol.biomedcentral.com/articles/10.1186/1471-2148-4-21\" target=\"_blank\" title=\"https://bmcevolbiol.biomedcentral.com/articles/10.1186/1471-2148-4-21\">https://bmcevolbiol.biomedcentral.com/articles/10.1186/1471-2148-4-21</a></p>\n<p>tl;dr - yes, reason to be cautiously optimistic.  But it's the $64K question, and the longer that it goes uncontained without a vaccine, the more risk we have of it becoming seasonal.  We want to be working on getting that vaccine ASAP.  Just because you're playing roulette with a 20 chamber gun instead of a 6 chamber gun, doesn't mean you want to continue playing roulette just for kicks.</p>",
        "id": 191068501,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584588041
    }
]