[
    {
        "content": "<p>Hi all, I'm a veterinary informaticist working for VCA (a large hospital and lab services provider in the companion animal domain).  I understand that veterinary involvement in FHIR has been pretty light so far, and I'm hoping to promote FHIR use within the profession (as there is fairly poor standards adoption industry-wide, largely due to the lack of consumer or government pressure to do so). Incidentally, the Association for Veterinary Informatics (<a href=\"http://avinformatics.org\" target=\"_blank\" title=\"http://avinformatics.org\">http://avinformatics.org</a>) is the best single place to find informatics-savvy veterinarians, if that is helpful. Anyway, glad to be participating. Thanks for pointing me here, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>.</p>",
        "id": 153943112,
        "sender_full_name": "Dennis Ballance",
        "timestamp": 1520537240
    },
    {
        "content": "<p>Welcome :)  If you find anything that you don't think meets the needs of the veterinary community, please holler.</p>",
        "id": 153943115,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520538296
    },
    {
        "content": "<p>Great timing <span class=\"user-mention\" data-user-id=\"195400\">@Dennis Ballance</span>  I was just at WVC and approached all the practice management software vendors and urged them to take a peek at FHIR.  I got middling responses as you may expect.  But I hoped to at least plant the seed.  I must admit I didn't even know there was a Veterinary informatics out there.</p>",
        "id": 153943175,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520564238
    },
    {
        "content": "<p>A FHIR talk at a Fetch conference would be a great place to start.</p>",
        "id": 153943176,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520564536
    },
    {
        "content": "<p>and I must admit I failed to stop by the VCA booth at WVC</p>",
        "id": 153943177,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520564605
    },
    {
        "content": "<blockquote>\n<p>and I must admit I failed to stop by the VCA booth at WVC</p>\n</blockquote>\n<p>Not to worry - VCA software dev isn't represented at the booth anyway. ;) I am going to push for VCA to take a leadership role in this. I also will be talking to Banfield next week, so between us we may be able to kick start some adoption.  </p>\n<p>A couple years ago a few of us put together a green CDA version of a radiology report for telemed companies to use to share content. Nobody has implemented it, but I'm working on a JSON/FHIR-based sample doc, which I hope to hand off to Antech Imaging Services.</p>",
        "id": 153944031,
        "sender_full_name": "Dennis Ballance",
        "timestamp": 1520898015
    }
]