[
    {
        "content": "<p>Various national organisations in Ireland have asked me to present a training course on HL7v2-advanced and FHIR. Part of the course (today is the last day) is to make them aware of the value of a forum like this, and in general that there's excellent value to be had in participating actively within the international HL7 community.<br>\nIf you could share a word of encouragement (to share, to participate) I'm sure the Irish attendees will appreciate it. Thanks.</p>",
        "id": 185188500,
        "sender_full_name": "René Spronk",
        "timestamp": 1578553923
    },
    {
        "content": "<p>Welcome to the community. This forum and the community behind it is one of the great things about FHIR. <br>\nYou can easily reach to others, asking beginner questions to speed up the learning or asking for very complicated stuff. You can also exchange opinions about implementation, the tools, etc.</p>",
        "id": 185189085,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578554861
    },
    {
        "content": "<p>No specification can ever cover every nuance.  It's platforms like this that help implementers to align and increase <em>real</em> interoperability.  It's also the community that helps to make sure the specification evolves in useful ways and is meeting the needs of those who use it.  Plus sometimes there's poetry :)</p>",
        "id": 185189842,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578556014
    },
    {
        "content": "<p>Should that be welcome to FHEire?</p>",
        "id": 185189905,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1578556095
    },
    {
        "content": "<p>welcome to the community too!</p>",
        "id": 185190756,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1578557117
    },
    {
        "content": "<p>Also please contribute to the v2 Stream of the non-FHIR Zulip if you have questions about that standard. While it's a stable and well implemented standard, new questions do come up from time to time and that's a great place to get input from the community.</p>",
        "id": 185211013,
        "sender_full_name": "Craig Newman",
        "timestamp": 1578576066
    },
    {
        "content": "<p>I was one of the attendees on René's most informative two-day course. I am very encouraged following reading the subsequent comments and look forward to making contact with you in future!</p>",
        "id": 185231956,
        "sender_full_name": "Maureen Harte",
        "timestamp": 1578589109
    },
    {
        "content": "<blockquote>\n<p>Plus sometimes there's poetry</p>\n</blockquote>\n<p>Not always good poetry :)</p>",
        "id": 185233698,
        "sender_full_name": "David Hay",
        "timestamp": 1578590040
    },
    {
        "content": "<p>Welcome.  Also, I feel obligated to point out that there is an active Whiskey SIG (special interest group) at pretty much every meeting.</p>",
        "id": 185234154,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1578590308
    },
    {
        "content": "<p>Re: poetry, don't forget about <a class=\"stream\" data-stream-id=\"197113\" href=\"/#narrow/stream/197113-FHIR-Poetry\">#FHIR Poetry</a> ;-)</p>",
        "id": 185237596,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1578592522
    },
    {
        "content": "<p>And there's a chocolate group as well.</p>",
        "id": 185239729,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578593832
    },
    {
        "content": "<blockquote>\n<p>I feel obligated to point out that there is an active Whiskey SIG (special interest group) at pretty much every meeting.</p>\n</blockquote>\n<p>I'm doing my best to process the idea that there's a guilt-nagging <em>obligation</em> to talk about whiskey.  <span aria-label=\"crazy\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"crazy\">:crazy:</span></p>\n<p>Unless maybe in the sense that whiskey has been called FHIR-water.</p>",
        "id": 185279927,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1578627742
    }
]