[
    {
        "content": "<p>hi all.</p>\n<p>For me, this WGM has been unlike any other, of course. In some ways, it's been better; in many other ways, a far inferior experience that has considerably exceeded my fears. A little of that has been because we are still learning how to do this - and I'm sure that HL7 will follow up with a 'how did we do' survey. But next week I'm going to a FHIR product director post, and I'm going to talk a little about the virtual meeting. I'm looking for feed back - not 'how did we (HL7) do?' but 'how did you do?': what has your personal experience of this meeting been like?</p>\n<p>Mine:</p>\n<ul>\n<li>staying home, trying to half convert timezones, and joining virtually has been more tiring than actually travelling to USA for a week</li>\n<li>real life keeps interfering in a way it never did while I was physically absent. On the other hand... being able to take Kath for an xray of her foot... priceless (not broken, and she's mending ok)</li>\n<li>not seeing my HL7 friends in person is sad. Till we meet again...</li>\n<li>I just feel not quite so connected as I usually do.  But at least we have Zoom and Zulip... yay (not quite so yay for Whova but it's been getting better through the week)</li>\n</ul>",
        "id": 211276397,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601049238
    },
    {
        "content": "<p>feel free to post on your personal experience here, or to me privately. I'm going to add a couple of paragraphs of aggregate summary to my Product Director post, and I'm just looking to get the balance right to represent us all</p>",
        "id": 211276536,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601049297
    },
    {
        "content": "<p>I second what you said, but will add another note about the physical drain: since even the social interactions are all virtual, I'm essentially chained to my desk for the entire duration.  That confinement makes it much more draining (for me) than being at a conference where you move around more. <br>\n(I do recognize that it's partly situational - the kitchen and a restroom are within 10 ft of my desk so I don't have many excuses to move around.)</p>",
        "id": 211277665,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1601049745
    },
    {
        "content": "<p>I had a massive issue with dayjob interference.  Not being away from my desk (despite my calendar being blocked off) means that meetings were booked \"since you're around anyway\". And I really miss seeing people in person.</p>",
        "id": 211278039,
        "sender_full_name": "David Pyke",
        "timestamp": 1601049905
    },
    {
        "content": "<p>My thoughts:</p>\n<ul>\n<li>I have felt \"not quite in the moment\".  The sessions I've been at have typically accomplished pretty much what I would have expected to at a face-to-face meeting, but the level of energy hasn't been the same.  It's Friday of a WGM and I don't feel brain-dead.  But I sort of wish I did.</li>\n<li>At a face-to-face meeting I'd have been running all hours, generally from 7-8am to 11pm+ local time.  At this meeting I've had a few gaps where nothing was scheduled and the days weren't nearly as long.  (Which is good because home time probably wouldn't have accommodated more hours than I was putting in, and I've been able to devote a bit of time to fighting fires on a project that blew up during the meeting.)</li>\n<li>This meeting didn't really offer an opportunity for the side-bar conversations that typically happen in the halls or at cookie break where someone new would walk up and ask me a question or share a problem.  To a certain extent, Zulip is serving that purpose, but it's not the same and doesn't build the same sort of personal relationship.  Not sure if an 'office hours' concept like we had at DevDays makes sense - there are tons of people at HL7 who are worth approaching.  I'm concerned that the virtual format may make it feel harder for new people to jump in.</li>\n<li>I miss the cookies and food, but my waistline certainly doesn't</li>\n<li>Definitely miss seeing everyone, being able to give hugs to our awesome staff and the late-night discussions that left me super-pumped when I got back home.</li>\n</ul>",
        "id": 211278174,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601049972
    },
    {
        "content": "<p>I have to walk inside, so I get a little exercise. And since Kath sprained her ankle, I have to go to the gate to meet courier delivery (since that's the only way we can shop right now). My office is the dark smaller square bottom rightish (partly under trees): <a href=\"https://earth.google.com/web/@-37.7211705,145.21974721,107.57568227a,82.02599928d,35y,0.69124887h,8.21074044t,360r\">https://earth.google.com/web/@-37.7211705,145.21974721,107.57568227a,82.02599928d,35y,0.69124887h,8.21074044t,360r</a></p>",
        "id": 211278357,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601050062
    },
    {
        "content": "<p>Nice, though clicking the link does give a warning message that explains so much about this year: <a href=\"/user_uploads/10155/Gt3FhvbyPeqwLL-lYN8bF3Mq/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Gt3FhvbyPeqwLL-lYN8bF3Mq/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/Gt3FhvbyPeqwLL-lYN8bF3Mq/image.png\"></a></div>",
        "id": 211278815,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1601050295
    },
    {
        "content": "<p>So you've probably got more fresh air at this meeting than at a regular face-to-face because you actually had to go outside - even if momentarily <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 211278980,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601050351
    },
    {
        "content": "<p>indeed that's true</p>",
        "id": 211279131,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601050418
    },
    {
        "content": "<p>We will continue to try and find ways to make those coffee breaks happen, and side meets up available.  I completely understand the pains there.  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I would constantly look for you at breaks to introduce you to someone who came to the desk with questions and then I could bring them straight to you.  We did have a First Timers event to try to help them a bit more as well.  Bottom line is you just cannot replace that F2F interaction.  However, we will continue to try as this organization is all about community, so we need to find ways to keep that alive!</p>",
        "id": 211280728,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1601051229
    },
    {
        "content": "<p>Please keep the suggestions coming.</p>",
        "id": 211280882,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1601051298
    },
    {
        "content": "<p>A zoom background of that we can all use at cookie break that looks like we're in the same room</p>",
        "id": 211280961,
        "sender_full_name": "David Pyke",
        "timestamp": 1601051339
    },
    {
        "content": "<p>I miss the social interaction and the discussions that take place in the hall ways and on breaks.  I've been pleasantly surprised about what we have been able to accomplish this week and the quality of the conversation.  Still learning with Whova especially when you're chairing a session and you're in Zoom but everyone else in in Whova.  All in all, I think it was a good week and exceeded my expectations.  Nothing like being F2F, but we're making the best of it and still getting work done.</p>",
        "id": 211281786,
        "sender_full_name": "Melva Peters",
        "timestamp": 1601051696
    },
    {
        "content": "<p>I think the virtual meeting made it easier for some meetings to have a larger participation than they would have in face to face meetings. I agree with Gino about the draining aspect of being stuck to the computer for all meetings and inter-meetings interactions...</p>",
        "id": 211282068,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1601051826
    },
    {
        "content": "<p>My experience should be tagged as \"Only attended one WGM, new to HL7, and not as a member of any WG. It was a blur.\" So I have no intimate history to have lost. So, for me there's little DIFF.</p>\n<p>I totally agree about all the issues.  I stumbled on, and stuck to, the mental model that my home office is WGM World, and I transform in and out of it through the portal called \"the door.\" I can go for a walk around the block, go get the mail, go to the kitchen etc.  And I let myself exit and re-enter as I want .... which is not at all what you \"elders\" are missing.</p>\n<p>I cannot wait for the end of this virus, and I'm hoping there will be enough of America left that it's possible to attend.</p>",
        "id": 211284274,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601052890
    },
    {
        "content": "<p>Re: being chained to the desk, I found myself making trade-offs -- e g., turning off video during many sessions so I could pace or move around, even though I generally prefer sharing video.</p>",
        "id": 211298413,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1601059767
    },
    {
        "content": "<p>If there was a session where I wasn't presenting or taking notes, I would go mobile and walk during sessions. Also found the 30 minute times between sessions a good time to get out. Everything has a mobile app... but it was still good to use at least half 15 of those minutes \"disconnected\" and not looking at a screen if possible.</p>",
        "id": 211299533,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1601060266
    },
    {
        "content": "<p>You can't walk + be social, which is definitely different than the breaks at HL7 typically.</p>",
        "id": 211299841,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1601060400
    },
    {
        "content": "<p>I agree with others that there has been much of \"the same but different\":</p>\n<ul>\n<li>Almost the same day length but mostly due to more actual meeting time and obviously less social time</li>\n<li>that surprisingly has left me with the same sense as <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> in that usually at the end I am bone-dead brain-tired but this time the feeling is more simply frazzled with feeling not quite in tune. I find this very surprising due to the intensity and length of the meetings.<ul>\n<li>That may in part be because I was able to maintain my very early workout schedule here at home?</li>\n</ul>\n</li>\n<li>Virtual hugs and face-time in no way makes up for being close to everyone and I miss that <strong>very much</strong></li>\n<li>I walk around and turn off video all the time anyway and agree moving about is critical</li>\n<li>in part a takeaway for me is that this type of meeting for a working conference like ours is a poor substitute, but perhaps I'm just not excited about <em>this</em> particular type of change</li>\n</ul>",
        "id": 211302723,
        "sender_full_name": "Robert McClure",
        "timestamp": 1601061365
    },
    {
        "content": "<p>30 minutes between sessions was <em>super</em> valuable.  This would have been much less manageable without</p>",
        "id": 211309353,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601063482
    },
    {
        "content": "<p>I agree, especially for those not in the US timezone - with those 30min breaks one could squeeze in dinner, breakfast, necessary snacks, telcos and so on</p>",
        "id": 211309656,
        "sender_full_name": "Reinhard Egelkraut",
        "timestamp": 1601063636
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179160-social/topic/WGM.20Experience/near/211298413\">said</a>:</p>\n<blockquote>\n<p>so I could pace or move around, even though I generally prefer sharing video.</p>\n</blockquote>\n<p>I think this is a \"personal sustainability\" issue. Umpty-twelve hours of being glued to the cam is a whole different challenge from umpty-twelve hours moving around in (for instance) the building where you hosted DevDays, with its variety of different spaces.</p>",
        "id": 211312535,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601065110
    },
    {
        "content": "<p>After the truly exhausting Whova experience at DevDays (so much confusion about which tab was what), I accelerated purchase of my next Mac, and this time used this three-screen setup with two computers. <br>\n<a href=\"/user_uploads/10155/tyhRnWjKDuhJ_vdw56Lz3xF0/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/tyhRnWjKDuhJ_vdw56Lz3xF0/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/tyhRnWjKDuhJ_vdw56Lz3xF0/image.png\"></a></div>",
        "id": 211312807,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601065224
    },
    {
        "content": "<p>As a minute-taking co-chair, the computer on the right was my Zoom&amp;Share machine, and the second monitor was where I ran Whova so I could be sure of what others were seeing.  <em>I never had to change which was what.</em></p>",
        "id": 211313020,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601065317
    },
    {
        "content": "<p>The machine on the left was for everything else except live sessions.  Texting to my co-presenter, Zulip, and - importantly - all the stuff  you would normally do on your own computer at a \"real\" WGM while in sessions.</p>",
        "id": 211313152,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601065369
    },
    {
        "content": "<p>The thing that cinched this need for me was the realization - too late - at DevDays that on one of my short talks, my broadcast had completely failed: the wrong PPT screen was projected.  </p>\n<p>I know this is purely technological, not dealing with the social unity aspect.  But I found this time that my mind was much more available to engage because the tech was not being a puzzle.</p>",
        "id": 211313618,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601065562
    },
    {
        "content": "<p>welcome to the club (people who can't work with a single screen any more)</p>",
        "id": 211316112,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601066853
    },
    {
        "content": "<p>Wasn't there but a couple of comments:</p>\n<ul>\n<li>\n<p>Zoom does have the ability to do 'break-out rooms'; was that or could that be used to give those 'side discussions' Lloyd mentioned?</p>\n</li>\n<li>\n<p>one advantage is that for some companies (or people within those companies) this virtual meeting might be more financially acceptable.  (at my previous company I never got the management approval to go to any HL7 WGM unless it was 'in my backyard' so they didn't have to pay for travel expenses)</p>\n</li>\n<li>\n<p>hopefully having it virtual allowed more participation than normal for cost, travel, personal and other reasons that would typically keep people from attending.</p>\n</li>\n</ul>",
        "id": 211318041,
        "sender_full_name": "John Silva",
        "timestamp": 1601068052
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"298707\">John Silva</span> <a href=\"#narrow/stream/179160-social/topic/WGM.20Experience/near/211318041\">said</a>:</p>\n<blockquote>\n<ul>\n<li>hopefully having it virtual allowed more participation than normal for cost, travel, personal and other reasons that would typically keep people from attending.</li>\n</ul>\n</blockquote>\n<p>Whova currently shows 447 attendees - last year's Plenary WGM in Atlanta attracted 778 participants.</p>",
        "id": 211318965,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1601068602
    },
    {
        "content": "<p>Does that include connectathon participants though? (the Atlanta numbers)</p>",
        "id": 211322048,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1601070527
    },
    {
        "content": "<p>Breakouts were disabled because they created (more?) issues with Whova.  Also, breakouts tend to be in the control of chairs - which may not work well for spontaneous side discussions.</p>",
        "id": 211322542,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601070849
    },
    {
        "content": "<p>Yes Gino, the Atlanta numbers do include connectathon numbers.  If we did that here, we would be over the number in Atlanta.  For our connectathon, we had 607 at the Connectathon this time for the virtual event, nearly double the F2F event</p>",
        "id": 211322879,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1601071119
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223704\">@Mary Ann Boyle</span>  for a true comparison, it would be interesting to know how many attended both the Connectathon and WGM this month.</p>\n<p>There are also other (minor) factors to consider as some of the meetings that would be held during a F2F WGM (e.g. International Council &amp; Board) took place in the week before the WGM. In fact, there may be a case for moving more governance meetings outside of a Virtual WGM - particular if key participants attend only those meetings (e.g. GOC).</p>",
        "id": 211323484,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1601071559
    },
    {
        "content": "<p>I wish that participants could create their own breakouts. There's times when it would be very appropriate.</p>",
        "id": 211333824,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601082600
    },
    {
        "content": "<p>The latest version of Zoom, 3.5.0. as of September 21, allows attendees to move themselves between breakout rooms. Breakout rooms can be given a name. This will be a very powerful feature for this type of online conference, especially in supporting the social component. </p>\n<p>I skipped the WGM - most sessions were evening/night time for me, and unlike Grahame I don't have a private shed to work and sleep, so taking part would impact my family too much. I'm aware that optimizing the time slots for 'all of the world'  doesn't work, but the current compromise as to the timing of the events certainly didn't work for me.</p>",
        "id": 211349116,
        "sender_full_name": "René Spronk",
        "timestamp": 1601108440
    },
    {
        "content": "<p>I'm with <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> on that one. Those US timeslots does not compute with a european household with small kids</p>",
        "id": 211351450,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1601112468
    },
    {
        "content": "<p>I would like that the next meeting is in the European timezone</p>",
        "id": 211381822,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601152871
    },
    {
        "content": "<p>Well, that would turn an inconvenience into a near impossibility for Kiwis - particularly if it's held in January when we are UTC +13.  Last week was fun to observe from this distance, but active participation was tricky at times (whisky tasting sessions at morning tea anyone?). </p>\n<p>However, the overarching issue is what is the best method for HL7 to conduct its business, virtually, over the whole of 2021. Will we need to bring such a large section of the community together 3 times? What's the best way for individual work groups to function - regular Zoom meetings and/or Whova gatherings? Certainly, Connectathons and  governance meetings can take place outside of WGMs.  Maybe a healthy community needs to meet in a large group on a regular basis? Continued revenue generation for HL7 International during The Pandemic is another factor.</p>\n<p>Overall, I thought the wonderful HL7 International staff did brilliantly last week, particularly in trying to make the best of an app (Whova) that's clearly better suited to presentation-style events, rather than one with concurrent interactive , and sometimes ad-hoc, sessions.</p>",
        "id": 211383715,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1601156139
    },
    {
        "content": "<p>I think most of use would prefer to use zoom outside Whova, but Whova otherwise is a pretty good way to run the meeting.</p>",
        "id": 211383902,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601156471
    },
    {
        "content": "<p>Given what we do, I really don't see any way to get round the timezone issue but to take turns sucking it up. European timezone would suit me only a little more than USA but it would suit my family more - night owls that they are</p>",
        "id": 211383951,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601156538
    },
    {
        "content": "<p>FWIW, from Boston, I can't imagine any other fair / sane approach than to give each third of the world its turn, and share the understanding that the outcomes of such meetings may need a period of adjustment afterward. </p>\n<p>Hey, I wonder about adding something to the culture of the WGM: encourage WGs to publish daily summaries of what was done (or reasonably comprehensive minutes), so that interested members &amp; visitors can catch up when they wake. We tried to do that in Patient Empowerment but without conscientious planning the results were fitful.  If done well, it might greatly shorten the period of adjustment.</p>\n<p>In fact, hm, if Tuesday minutes were published Tuesday night (conference time), then off-cycle members could reply in their daytime  (\"overnight\" conference time) and their thoughts might get woven into the next day's discussions.</p>\n<p>A question to ponder: would we rather that a WGM end with more work advanced, but less-finished?  Or somewhat less work, more-finished?</p>",
        "id": 211386468,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601161155
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179160-social/topic/WGM.20Experience/near/211386468\">said</a>:</p>\n<blockquote>\n<p>FWIW, from Boston, I can't imagine any other fair / sane approach than to give each third of the world its turn, and share the understanding that the outcomes of such meetings may need a period of adjustment afterward. </p>\n</blockquote>\n<p>While I think that's a laudable suggestion, I'm (almost) constantly reminded that approximately 75% of the HL7 'Workforce' resides in the USA so I don't believe it's practical to base Virtual WGMs on European or APAC time zones. Certainly, there is nowhere near sufficient active participation in Oceania to justify it. Different case for some groups with broad and equal worldwide representation - notably International Council.</p>",
        "id": 211388680,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1601165000
    },
    {
        "content": "<p>I do think that there's a mexican stand off here - HL7 has little participation in the dark zone because it's the dark zone, and it's the dark zone because there's little participation. (where darkzone is night time during normal calls)</p>\n<p>OTOH, as Peter says, most participation is from Americas timezone, and the second biggest group is Europe. We here in oceania have to suck it up, as does everyone across to about India. Then it <em>starts</em> getting better...</p>",
        "id": 211388921,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601165410
    },
    {
        "content": "<p>.. .on the bright side, I didn't miss the long journey home from a Plenary WGM, arriving back in NZ at 5am and desperately trying to stay awake to re-adjust to local time (always found jumping forward in time far tougher).</p>",
        "id": 211389127,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1601165835
    },
    {
        "content": "<p>yes. that bit is AWESOME</p>",
        "id": 211390406,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601168188
    },
    {
        "content": "<p>Well, from the European perspective there's sufficient participation - at the affiliate level. In the US there's sufficient participation - at its own realm level (and yes, its a sizable realm in terms of participants). How do we encourage people to work on truly international things that may not directly benefit the problems they have in their own realm? How do you convince their bosses to pay them for working on such issues? <br>\nRealm-specific topics can be discussed whenever it's a convenient time for that realm, but the 'truly international' stuff (in principle that's a much smaller group of persons, and a smaller set of topics) would need participation around the globe. (slowly this thread merges with some of the topics raised on the \"re-envisioning HL7\" thread).</p>",
        "id": 211404304,
        "sender_full_name": "René Spronk",
        "timestamp": 1601193667
    },
    {
        "content": "<p>This is where I believe it's important to separate the concerns of pure standards development - which should be an international activity - and producing implementation guides. The later, for the most part, is realm-specific, with obvious exceptions such as the International Patient Summary. As <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  says, this inevitably leads into the Re-Envisioning HL7 Thread - particularly the Global Relevance topic.</p>",
        "id": 211406190,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1601196848
    },
    {
        "content": "<p>Implementation guides aren't necessarily realm-specific.  I think the question is what the motivators are for participants to tackle problems with the broader international scope.  And those are:</p>\n<ul>\n<li>many product vendors (software and hardware) market across international borders</li>\n<li>much of clinical practice (and 'best practice') is not national in scope</li>\n<li>the fact that your particular realm doesn't have a requirement 'yet', doesn't mean that it's not coming 'soon' (so a spec that reflects and allows for requirements elsewhere, can actually provide longer-term stability for use in your own realm)</li>\n<li>many hands make light work</li>\n</ul>\n<p>The last may be less a concern in the U.S. where they already have quite a few hands, but I think the others still hold</p>",
        "id": 211418803,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601216716
    },
    {
        "content": "<p>Without disagreeing with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I'd  say that most IGs relating to specific projects, services or workflows are realm-specific and increasingly these will be derived from a National Base FHIR IG. Certainly, it's insightful for the non-US community to look at US core artefacts, and in NZ we've adapted US IGs in the past, however suffice to say that the US has a fairly 'unique' healthcare system and that healthcare policy varies a great deal from country to country as we're seeing in the responses to COVID-19!</p>\n<p>Tacking back to the WGM experience, I'll be interested to know how many participants were from outside the US (I believe the figure was 85 from 607 Connectathon attendees).</p>",
        "id": 211427420,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1601230031
    },
    {
        "content": "<p>In terms of overall volume, sure, most are going to be national.  But there are a decent number of HL7-authored international IGs - and I expect there will be more over time.</p>",
        "id": 211429154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601232875
    },
    {
        "content": "<p>I agree with lots of the points above. Happy to see that \"I miss my HL7 friends\" features prominently.  And that is maybe, for me, one of the most interesting points: the \"HL7 community\" is not a fixed group. Some have left us over the years, others have joined.  I think it's far harder for new people to become part of the community if you don't have to possibility to meet face to face.  You get to know each other's quirks, silly jokes and how someone reacts when agreeing/disagreeing.  Across cultures, this is even more important.  Very hard to jump into a discussion (for most) if you don't get to know each other like that.</p>\n<p>Currently, that's dictated by COVID, but even after, I wonder how many employers will allow their employees to travel x times a year and pay for hotels - so this might become a fixed factor even post-covid.</p>",
        "id": 211482237,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1601294292
    },
    {
        "content": "<p>I do not have silly jokes!!</p>\n<p>(Except that my granddaughter, now age 7, has twice (years apart) told me my jokes aren't funny, with a look that suggests she therefore wonders why I bother saying them...)</p>",
        "id": 211491705,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601299612
    },
    {
        "content": "<p>Of course, I wasn't talking about you ;-)  ;-)</p>",
        "id": 211492083,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1601299805
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179160-social/topic/WGM.20Experience/near/211333824\">said</a>:</p>\n<blockquote>\n<p>I wish that participants could create their own breakouts. There's times when it would be very appropriate.</p>\n</blockquote>\n<p>They can! = )  There is a section in Whova called Virtual Meet ups.  We had several groups who did in fact schedule these as the meeting went on.</p>",
        "id": 211493927,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1601300768
    },
    {
        "content": "<p>And there's the 'financial incentive' part that helps drive standards development (focus).   Of course this is important for product vendors and (private maybe public) providers and, in the US (not sure about rest of world) insurance companies that leads the focus on particular areas.   It seems to me (IMHP) that these financial concerns that drive many development efforts are mostly country or region specific.  (other than international product vendors)</p>",
        "id": 211494278,
        "sender_full_name": "John Silva",
        "timestamp": 1601300964
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191427\">Jens Villadsen</span> <a href=\"#narrow/stream/179160-social/topic/WGM.20Experience/near/211351450\">said</a>:</p>\n<blockquote>\n<p>I'm with <span class=\"user-mention silent\" data-user-id=\"191372\">René Spronk</span> on that one. Those US timeslots does not compute with a european household with small kids</p>\n</blockquote>\n<p>We completely understand, that was why there were no set quarters for this meeting.  Wayne thought it would be best to keep the scheduling open 24 hours.  If  WGs needed to meet at 10pm ET (or whatever time really), they could, and a few did do this.  We will have to see what we can do for January. Maybe set a \"fixed time\" with 4-6 quarters instead of having it open to try to accommodate everyone, as it sounds like some were not able to make the open schedules work for their WGs.</p>",
        "id": 211494376,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1601301005
    },
    {
        "content": "<p>Well, we spoke about the 'dark zone' and the chicken and egg problem of not getting enough attendees from certain time zones vs scheduling stuff at inconvenient hours for those time zones. Still, there are e.g. some overlapping hours between Europa and the US (IMHO 10am US eastern up to 1 or 2 PM US Eastern) , so let's make the most of these hours for generic/international topics. Likewise, European topics (if we were to combine WGMs with national events hosted by the affiliates on these very same dates, which seems sensible to me) could be done during hours where there's little or no daytime overlap with other continents. <br>\nBut we may have to provide stronger guidance to WGs to schedule according to the relevance of the topic to others around the world, and to optimize attendance not just based on one single country, but to get the best representation of all of our stakeholder groups around the world. <br>\nIt may have to become standard practice to have 2 sessions per 24-hour day on the same topic: one (e.g.) for US/Europe, and one for US/Australasia. The second recaps the first, and seeks additional input. This challenge calls for creative solutions.</p>",
        "id": 211496834,
        "sender_full_name": "René Spronk",
        "timestamp": 1601302058
    },
    {
        "content": "<blockquote>\n<p>It may have to become standard practice to have 2 sessions per 24-hour day on the same topic</p>\n</blockquote>\n<p>That seems very difficult to me. It has 2 very obvious problems:</p>\n<ul>\n<li>it could be useful for gathering input, but it completely would not work for making decisions</li>\n<li>it turns on timezone group into the arbiter of the other 2 groups</li>\n</ul>",
        "id": 211544950,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601324369
    },
    {
        "content": "<p>It also means that you either have people showing up for the same discussion twice (which both wastes their time, but also gives them more influence over outcome) or people who only get to participate once and have less influence and don't necessarily hear all the salient points.</p>",
        "id": 211546100,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601324960
    },
    {
        "content": "<p>FWIW we're facing the same in discussions about DevDays. Of course it's a vastly smaller enterprise but it seems to be unavoidable that by eliminating travel, we swap it out for the penalty of not all being in the same time zone.  In that sense our collective productivity takes a hit until the virus is solved.</p>\n<p>In the case of DevDays there's undeniably a root deep in the turf in Fire.ly's home Amsterdam/ET; sessions are 1-5 pm that time zone, which is 7-11 Boston time and 4 am to 8 am California.  The other root is currently in Boston/New York/ Atlanta, where 1-5 pm is 9-1 in Amsterdam.</p>",
        "id": 211548799,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601326331
    },
    {
        "content": "<p>DevDays is shorter and fewer tracks overall, but not sure I'd call it 'smaller'</p>",
        "id": 211550414,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601327158
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179160-social/topic/WGM.20Experience/near/211550414\">said</a>:</p>\n<blockquote>\n<p>DevDays is shorter and fewer tracks overall, but not sure I'd call it 'smaller'</p>\n</blockquote>\n<p>Each has a longitudinal community, but last week I learned how VERY strong the work ethic is at WGM, and how much people depend on  getting together to <em>get work done</em> on their causes.</p>\n<p>It was my first WGM as a participant.</p>",
        "id": 211551074,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601327470
    }
]