[
    {
        "content": "<p>Without getting HL7-nerdy, is there a generic term the general public understands as meaning \"Name, address, DOB etc\", vs \"my medical data\"?</p>\n<p>(Why I'm asking: <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span>  and  <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>  and I are on the weekly call about defining an implementation guide of the Patient Corrections workflow.   This question came up in passing, because we want all this to be as clear and \"accessible\" as possible to ordinary citizens.)</p>",
        "id": 206506032,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597089478
    },
    {
        "content": "<p>you mean patient demographics?</p>",
        "id": 206506350,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597089619
    },
    {
        "content": "<p>I assume that's what it's call in HL7 and/or FHIR, but we're thinking ahead to patient-facing apps/tools, and wondering what would be clear for people to read in this situation:</p>\n<hr>\n<ul>\n<li>What kind of change are you requesting?<ul>\n<li>Correction to medical record</li>\n<li>Change to personal information (address, insurance, phone, etc)</li>\n</ul>\n</li>\n</ul>\n<hr>\n<p>Is there anything more concise than that?</p>\n<p>I hear that \"personal information\" is called \"demographics\" in FHIR-speak, but that's not ordinary-person language.</p>",
        "id": 206507767,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597090375
    },
    {
        "content": "<p>I thought demographics was more common. Personal information seems common. <br>\nThen again, my English vocabulary is nerd English.. I leave it to the natives.</p>",
        "id": 206510580,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597092056
    },
    {
        "content": "<p>Personal information is fine.  Demographics is the correct term, but not something people outside will know.</p>",
        "id": 206512328,
        "sender_full_name": "David Pyke",
        "timestamp": 1597093062
    },
    {
        "content": "<p>It's called Demographics across the board in information handling situations (not just health)</p>",
        "id": 206512410,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597093086
    },
    {
        "content": "<p>demographics for sure</p>",
        "id": 206512486,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597093135
    },
    {
        "content": "<p>in my experience no one says demographics outside of IT, or news/research about populations etc, and that is a different sense \"the demographics of cinema goers has changed since the 70s\".</p>",
        "id": 206512545,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597093179
    },
    {
        "content": "<p>statisticians do - but then again ... they are not real humans <span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span></p>",
        "id": 206512759,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597093277
    },
    {
        "content": "<p>only 1 in 3 of them are</p>",
        "id": 206513776,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597093829
    },
    {
        "content": "<p>I agree that \"demographic information\" is the best nerdy term, \"personal information\" with the examples  is less intimidating.</p>",
        "id": 206539948,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1597121346
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179160-social/topic/What's.20the.20conversational.20term.20for.20.22demographics.22.3F/near/206512545\">said</a>:</p>\n<blockquote>\n<p>in my experience no one says demographics outside of IT, or news/research about populations etc, and that is a different sense \"the demographics of cinema goers has changed since the 70s\".</p>\n</blockquote>\n<p>Thank you for putting your finger on what I was trying to identify!  Yes - in ordinary conversations I've heard, people talk about a TV show or a politician \"not attracting the right demo[graphic]\".   They're talking about things like age, income, education, location ... all of it is the <em>organization's</em> perspective, not the consumer/citizen/patient's.  </p>\n<p>So, at least right now, I'm thinking \"personal information\" is more like what I have in mind.  Of course this isn't normative - I'm just proactively working to introduce the ordinary person's POV into these conversations.</p>",
        "id": 206625288,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597176816
    },
    {
        "content": "<p>As a sidebar grouse about this general subject, I'll never forget in 2002 when I was permanently annoyed by the desk staff at my new PCP's office. I imagine they were efficient, but oy what dorks.  They couldn't even have a friendly voicemail announcement:  \"To leave, a non ... eMERgent ... message, press 1 ...\"  I never succeeded in convincing them that ordinary people don't know what \"emergent\" means in this context, and they were annoyed at me for not seeing things their way. (Really.)</p>\n<p>So I left them, and got connected with this guy named @Danny Sands, who I later learned had co-authored the first JAMIA paper on <a href=\"https://academic.oup.com/jamia/article/5/1/104/766196\">how to do doctor-patient email</a>, just 4 years earlier.  And 5 years after that, the connection helped save my life, because he was modern in other ways too, including connecting me with an expert e-patient community.</p>",
        "id": 206626087,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597177241
    },
    {
        "content": "<p>btw, for exactly the same reason, I object to calling insurers \"payers.\"  They are ONLY that in the perspective of the payee (e.g. the hospital).  To patients, they are too often the party who says \"No, we're NOT paying for that,\" violating the implicit agreement we expect when we BOUGHT their line of crap.</p>\n<p>The above obviously doesn't apply to anyone with good ethics and transparent policies.  Still, the <em>class</em> should not be called payers. Not from the patient POV ... and the patient is the party for whom the whole stinkin industry exists.</p>",
        "id": 206626387,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597177422
    },
    {
        "content": "<p>\"Contact Information\"</p>",
        "id": 206688675,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597236366
    },
    {
        "content": "<p>I dont find that maritalstatus is part of my \"contact information\" - unless im about to do shady business</p>",
        "id": 206721592,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597251827
    },
    {
        "content": "<p>Neither do i find my phone number as \"personal information\"</p>",
        "id": 206722144,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1597252088
    },
    {
        "content": "<p>It's \"personal\" meaning is \"related to you\"</p>",
        "id": 206737857,
        "sender_full_name": "David Pyke",
        "timestamp": 1597259660
    },
    {
        "content": "<p>Can always fall back to \"About You\" or \"General Information\" <span aria-label=\"info\" class=\"emoji emoji-2139\" role=\"img\" title=\"info\">:info:</span></p>",
        "id": 206738332,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1597259911
    }
]