[
    {
        "content": "<p>I'm also going to be gone for a bit (though not for as long or to anywhere as exciting as Grahame - just to a scout jamboree).  I'll be back in commission again sometime on the 14th.  I may have intermittent online access, but don't know for sure.  And I certainly won't be in a position to fix anything.  <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> can assist if there are build environment issues and <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> can assist with terminology service issues.  If you can all keep it to 5000 posts or fewer between now and then, that'll make catching up easier ;)</p>",
        "id": 169734971,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562359517
    },
    {
        "content": "<p>Pictures please :)</p>",
        "id": 169735129,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562359712
    },
    {
        "content": "<p>Hope you have fun. And hope you have internet :)</p>",
        "id": 169735132,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562359728
    },
    {
        "content": "<p>I'm back.  If you're waiting on something from me, send me a PM.</p>",
        "id": 170899477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563201899
    },
    {
        "content": "<p>The World Scout Jamboree in WV? Were you on staff? Love to catch-up. I've been on a few Wood Badge staffs but never a World Jamboree.</p>",
        "id": 173052009,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1565637815
    },
    {
        "content": "<p>Unfortunately, no.  It sounds like it was amazing.  I was at the Canadian Pacific Jamboree.  About 2000 youth.  (An order of magnitude less than in West Virginia. :))</p>\n<p>At the moment, I  do cubs.  However,the scout section lead had a health issue, so I volunteered to help.  It was a great week.</p>",
        "id": 173083324,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565668930
    }
]