[
    {
        "content": "<p>Has anyone experimented with webhooks with zulip. <br>\nI'm wondering if it would be possible to hook into a stream (e.g. UK stream) and get messages sent to another service (Ryver). Skimming through the zulip API it seems possible (can't be two way as ryver is more limited but the discussion was to encourage use of zulip anyway) <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span></p>",
        "id": 173377526,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1565965579
    },
    {
        "content": "<p>Yes, this is definitely doable. There's an overview at <a href=\"https://zulipchat.com/api/integrations-overview\" target=\"_blank\" title=\"https://zulipchat.com/api/integrations-overview\">https://zulipchat.com/api/integrations-overview</a> -- and since Ryver supports Zapier integration, you might follow <a href=\"https://zulipchat.com/integrations/doc/zapier\" target=\"_blank\" title=\"https://zulipchat.com/integrations/doc/zapier\">https://zulipchat.com/integrations/doc/zapier</a> to see if you can get Zulip -&gt; Zapier -&gt; Ryver without having to write any code.</p>",
        "id": 173402636,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1565985219
    },
    {
        "content": "<p>(If you do want to roll your own, it's pretty simple too. The best client libraries are in Python.)</p>",
        "id": 173402756,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1565985301
    },
    {
        "content": "<p>We have 2 streams here that are bi-directional - <a class=\"stream\" data-stream-id=\"179244\" href=\"/#narrow/stream/179244-snomed\">#snomed</a>  and <a class=\"stream\" data-stream-id=\"179238\" href=\"/#narrow/stream/179238-Zulip\">#Zulip</a></p>",
        "id": 173403990,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565986322
    },
    {
        "content": "<p>Not the same thing, but is it possible to get an email when a thread is updated? Not using zulip every day, I tend to miss mentions and late updates to threads, amongst all the volume.</p>",
        "id": 173875198,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1566475068
    },
    {
        "content": "<p>Mentions should definitely email you.  Go into Settings, Notifications, Private Messages... and make sure email is turned on.  You can also set up keywords that will behave the same as an @mention.  Unfortunately there's no way to subscribe to a particular thread and get emails when it's updated.  (At least not that I've found...)</p>",
        "id": 173876737,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566476322
    },
    {
        "content": "<p>I was wondering about mentions, I think my need is similar to Riks. I think I'd want to be notified when a thread is updated and/or when a comment is made on a stream (e.g. UK stream). <br>\nI've also been thinking the best way of monitoring or filtering the implementation stream - I'm interested in content from UK + DSTU3 and tend to skim read international R4/5 content.</p>",
        "id": 173880158,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1566478871
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  noticed I have settings for Alert words. Just set that up and see how it goes.</p>",
        "id": 173880338,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1566478989
    }
]