[
    {
        "content": "<p>I have a question about this</p>",
        "id": 153912768,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507240554
    },
    {
        "content": "<p>is there a way we can get the connectathon process to work with this?</p>",
        "id": 153912770,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507240650
    },
    {
        "content": "<p>I would think so. If you could provide me a link for the next connectathon and/or the connectathon process I could discuss further considerations.</p>",
        "id": 153912779,
        "sender_full_name": "Aslan Brooke",
        "timestamp": 1507241265
    },
    {
        "content": "<p>from yesterday's announcement:</p>",
        "id": 153912782,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507241318
    },
    {
        "content": "<p>A reminder that proposals for tracks in the January 2018 Connectathon in New Orleans should be created by 18th October.</p>\n<p>Here's an overview of the process: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_Track_Process\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_Track_Process\">http://wiki.hl7.org/index.php?title=FHIR_Connectathon_Track_Process</a><br>\nThe Connectathon page itself is here: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_17\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_17\">http://wiki.hl7.org/index.php?title=FHIR_Connectathon_17</a> (It's a work in progress of course, but it does have a link to the tracks<br>\nTracks are listed here: <a href=\"http://wiki.hl7.org/index.php?title=Category:201801_FHIR_Connectathon_Track_Proposals\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Category:201801_FHIR_Connectathon_Track_Proposals\">http://wiki.hl7.org/index.php?title=Category:201801_FHIR_Connectathon_Track_Proposals</a><br>\nAnd the main wiki page (with links to these two) is here: <a href=\"http://wiki.hl7.org/index.php?title=FHIR\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR\">http://wiki.hl7.org/index.php?title=FHIR</a></p>\n<p>Feel free to contact me with any queries...</p>",
        "id": 153912783,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507241320
    },
    {
        "content": "<p>[me] is <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span></p>",
        "id": 153912784,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507241335
    },
    {
        "content": "<p>but <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> might have some ideas on this. But I think it would help if we have a 2-3 paragraph summary of the kinds of things that you can get through the ZyncHealth API for FHIR developers to help this discussion along</p>",
        "id": 153912786,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507241426
    },
    {
        "content": "<p>Ok, currently the Zynx API is in beta and we are making PlanDefinition resources available that come from years of producing/selling ordersets and plans of care to hospitals.  The PlanDefinition is the only resource we have now but we are looking to expand into the breadth of the Clinical Reasoning Module in FHIR.</p>",
        "id": 153912788,
        "sender_full_name": "Aslan Brooke",
        "timestamp": 1507241556
    },
    {
        "content": "<p>The Innovation Challenge has a total of $20,000 in awards along with an established timeline with the first phase completing on December 1, 2017. So, the timeline will prevent a tight coupling to the connectathon, however we will work on submitting a track proposal that could use the Zynx API regardless.</p>",
        "id": 153912799,
        "sender_full_name": "Aslan Brooke",
        "timestamp": 1507244151
    },
    {
        "content": "<p>Sure, that's kind of what I was thinking. And the connectathon is not suitable as a place to run a contest like this, so it's more about cross-fertilization of ideas and continuity. Though timelines on these things often slip ;-)</p>",
        "id": 153912800,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507244322
    },
    {
        "content": "<p>From the examples at <a href=\"https://github.com/zynxhealth/documentation/blob/master/README.md\" target=\"_blank\" title=\"https://github.com/zynxhealth/documentation/blob/master/README.md\">https://github.com/zynxhealth/documentation/blob/master/README.md</a> it does not seem that the Zynx API is FHIR - it might return FHIR resources but the request URL are different: <code>.../order-sets/c1d06f95-c9f4-436d-ae8b-4de9c141867b</code></p>",
        "id": 153912872,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1507313665
    },
    {
        "content": "<p>...or is this something new in the specs that I missed?</p>",
        "id": 153912873,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1507313675
    },
    {
        "content": "<p>no that's not conformant</p>",
        "id": 153912875,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507313898
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193942\">@Aslan Brooke</span> we've been running various scenarios related to Clinical Reasoning (including PlanDefinition and ActivityDefinition) at the last several connectathons. I'd love to see a scenario that involved consumers either ingesting or realizing a plan definition from Zynx. We also have a fairly generic open source environment that can run plan definitions (though it's pretty early days right now).</p>",
        "id": 153912904,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1507327940
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-email=\"grahame@healthintersections.com.au\" data-user-id=\"10\">@Grahame Grieve</span> no that's not conformant</p>\n</blockquote>\n<p>We realize the ZYNX API is not FHIR compliant at the API interface level at this time, though the resources are FHIR PlanDefinition resources (so at that level they are compliant, if such a division is legal). Currently we are working under the consideration that all our resources will support the FHIR standard but the API may be custom.  This allows us the flexibility to create an API that may have functionality not in FHIR but still return FHIR resources. Any thoughts  on this approach are welcome?</p>",
        "id": 153912917,
        "sender_full_name": "Aslan Brooke",
        "timestamp": 1507333898
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> ...or is this something new in the specs that I missed?</p>\n</blockquote>\n<p>See my comments above, but we are using the FHIR resources, however the API interface to them is being created custom to Zynx. We will have API endpoints that have functionality beyond whats in FHIR but still return FHIR resources. Therefore the ability to use the resources would be in alignment with the FHIR standard, however the interface to them may be Zynx specific and allow us to define functionality not in FHIR. Any thoughts on this approach, or alternatives is welcome?</p>",
        "id": 153912918,
        "sender_full_name": "Aslan Brooke",
        "timestamp": 1507334233
    },
    {
        "content": "<p>My thought is that It will force people to write custom clients - that sorts of defeat the purpose of using a standard. Use standard FHIR searches instead of custom request URLs maybe?</p>",
        "id": 153912920,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1507339378
    },
    {
        "content": "<p>+1, there's nothing that says you can't do more than the FHIR spec, but at least having FHIR-standard requests for supported functionality would be good.</p>",
        "id": 153912921,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1507342141
    },
    {
        "content": "<p>What are the capabilities you're trying to expose that can't be expressed through existing FHIR capabilities?</p>",
        "id": 153912924,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507342601
    },
    {
        "content": "<p>@mimo <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  </p>\n<p>We are going to support PlanDefinition endpoint based on the community feedback. It will most likely be in our next beta release.</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<p>The few change requests we have submitted would be the type of capability we could support ahead of them being in the existing standard. We will have others I'm sure, and while we will submit change requests, I imagine we'll support the capabilities if we need them ahead of a release of the standard.</p>\n<p>An aside, we are steadfast in support of the data structures that are in FHIR. The only dependency to date is the API to those data structures. Which I think is in alignment with alternative paradigms for transmission of those data resources (e.g. a CCD made up of FHIR data structures)</p>",
        "id": 153913393,
        "sender_full_name": "Aslan Brooke",
        "timestamp": 1507673824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193942\">@Aslan Brooke</span> that's great!</p>",
        "id": 153913405,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1507726421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193942\">@Aslan Brooke</span> I'm not clear on how the change requests would affect the URL paths?</p>",
        "id": 153913559,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507788933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I think your correct about the existing change requests submitted that I've been involved with. My comments were a bit more general about implementing API capabilities not yet in the standard. </p>\n<p>My overall take though on the feedback I've gotten so far is that its OK to have an API that has additional endpoints/capabilities, but that we should also support the associated portions of the standard that have similar capabilities. </p>\n<p>For example, the one identified initially, if we wanted to have \"order set\" and \"plan of care\" end points, we should also support access to all of those resources through the more general \"PlanDefinition\" endpoint since below all three end points is the same data structures. The \"order set\" endpoint would just be a way to know you were getting order set resources specifically.</p>",
        "id": 153913740,
        "sender_full_name": "Aslan Brooke",
        "timestamp": 1507849908
    },
    {
        "content": "<p>It's allowed - but it's outside the spec and therefore limits who can interoperate with you.  I guess the question is whether there's a need to have distinct endpoints for those purposes.  PlanDefinition has a flag that lets you filter to only include order sets.  And \"plan of care\" sounds like CarePlan.  If most systems will be exposing PlanDefinitions via a single endpoint - and that's what FHIR intends to happen, you should have a good reason for doing things differently - because that imposes costs on everyone who talks to you.</p>",
        "id": 153913742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507851121
    }
]