[
    {
        "content": "<p>Liebe ISiK-Community, mit Hinblick auf Stufe 2 der Spezifikation und einem potentiellen Ausbau von Anforderungen, würden wir gerne evaluieren, ob es derzeitig Client-Systeme gibt welche die Suchparameter \"_include\" und \"_revinclude\" verwenden oder gerne verwenden würden. Wir würden um entsprechendes Feedback bitten. Gerne freuen wir uns auch auf Feedback von Server-Entwicklern, ob diese Features bereits vorhanden sind oder für eine Implementierung vorgesehen sind.</p>",
        "id": 262882896,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1638032441
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193430\">Alexander Zautke</span> has marked this topic as resolved.</p>",
        "id": 262883276,
        "sender_full_name": "Notification Bot",
        "timestamp": 1638032890
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193430\">Alexander Zautke</span> has marked this topic as unresolved.</p>",
        "id": 262883279,
        "sender_full_name": "Notification Bot",
        "timestamp": 1638032893
    },
    {
        "content": "<p>Unsere Client-Anwendung (careIT Pro) benötigt beide Suchparameter. Und unser Server (SmileCDR) ist natürlich in der Lage zu liefern.  Ohne sie ist es nicht möglich, ernsthafte Anwendungen zu entwickeln. Daher würde ich es begrüßen, wenn ISiK dies ebenfalls vorschreiben würde. Andernfalls müssten die Entwickler ihre Client-Anwendungen künstlich verschlimmbessern, um die unzureichende Unterstützung zu kompensieren. <br>\nAus der Sicht des Clients gibt es eine Reihe von Problemen, wenn \"_include\" und \"_revinclude\" vom Server nicht unterstützt werden, z. B. Geschwindigkeit - man muss zusätzliche Anfragen für die Ressourcen stellen, die sonst eingeschlossen wären. Dies führt u.A. zu zusätzlichem Aufwand bei der Synchronisation der Antworten, die wahrscheinlich asynchron ausgeführt werden. <br>\nWenn also \"_include\" und \"_revinclude\" vom Server nicht unterstützt werden, muss der Client ihre Funktionalität nachbilden. Und das ist, denke ich, nicht im Sinne des Erfinders.</p>",
        "id": 262923648,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1638099009
    }
]