[
    {
        "content": "<p>Nachdem wir uns schon seit einigen Meetings um die Entscheidung drehen, welche Aspekte des Encounter-Modells wir in ISiK Stufe 2 verpflichtend einführen wollen, müssen wir nun zu einer Entscheidung kommen.<br>\nUm alle Beteiligten nochmal abzuholen, haben wir die verschiedenen Sichtweisen nochmal dargestellt und übereinandergelegt: (Folien 1-8)<br>\n<a href=\"https://docs.google.com/presentation/d/1BOqx5sLmuzLzHatg2Y6jGdjqvNGj6k_ths9IsUwgCeM/edit#slide=id.g11d661b0a78_0_233\">https://docs.google.com/presentation/d/1BOqx5sLmuzLzHatg2Y6jGdjqvNGj6k_ths9IsUwgCeM/edit#slide=id.g11d661b0a78_0_233</a></p>",
        "id": 276051835,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647870153
    },
    {
        "content": "<p>Weiterhin haben wir einen Vorschlag erarbeitet, wie das Modell für ISiK aussehen könnte (favorisierte Sichtweise der letzten Meetings): Folie 10</p>",
        "id": 276051966,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647870218
    },
    {
        "content": "<p>Um die Problematik zu entschärfen, dass die (Abrechnungs-)Fallnummer, die heute in der Subsystemkommunikation führend ist, in einer Ressource abgebildet wird (Account), die für klinische Systeme eigentlich uninteressant ist, bilden wir diese nochmal zusätzlich in Encounter.account.identifier ab, so dass diese explizit in allen Encountern eines Abrechnungsfalles zu finden ist (auch ohne jedes Mal dem Account-Link folgen zu müssen)</p>",
        "id": 276052376,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647870372
    },
    {
        "content": "<p>Um das Modell so einfach wie möglich zu halten, wurde zuletzt favorisiert, den Encounter ausschließlich in der Bedeutung des \"Besuchs\" (Patient kommt  - Patient geht) zu verwenden und die Klammerung mehrerer Encounter zu einem gemeinsamen Kontext zunächst nur in der Sichtweise \"Abrechnungsfall\" verpflichtend zu machen, da dies die mutmaßlich in den Systemen am häufigten anzutreffende Art der Gruppierung darstellt.</p>",
        "id": 276053286,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647870746
    },
    {
        "content": "<p>Die medizinische Sichtweise des \"Behandlungsfalles\" (EpisodeOfCare) und die Kontaktverfolgungssicht der MI-I (\"Multi-Level-Encounter\") werden zunächst nicht verpflichtend, eine Implementierung dieser Sichtweisen steht jedoch auch nicht im Widerspruch zum ISiK Modell.</p>",
        "id": 276053545,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647870868
    },
    {
        "content": "<p>Mir fehlt ein wenig die Einordnung des Encounter s in Benzug auf andere Entitäten wie Order. Dazu müsste ich wahrscheinlich irgendwo in das gesamte Datenmodell schauen oder?</p>",
        "id": 276053926,
        "sender_full_name": "Thomas Freier",
        "timestamp": 1647871045
    },
    {
        "content": "<p>Bei einer der ersten Sitzungen wurde mit knapper Mehrheit präferiert, den Einrichtungskontakt verpflichtend zu machen. Die shat sich jedoch im Verlauf der Diskussion immer wieder als große Herausforderung erwiesen.<br>\n<strong>Nachteile:</strong></p>\n<ul>\n<li>Die Existenz mehrere Ebenen von Encountern und die Möglichkeit, auf jeder dieser Ebenen Dokumentation zuzuordnen erhöht die Komplexität massiv</li>\n<li>Änderungen eines Encounters auf einer der unteren Ebenene muss immer \"nach oben propagiert\" werden, das Synchron halten der Daten wird erschwert. </li>\n<li>\n<p>Einige sehen den Einrichtungskontakt als ein vituelles Konstrukt, das zur Laufzeit aus den Daten von Account und den Abteilungskontakten \"konstruiert\" wird, dies macht jedoch die Frage ob und wann dort dann auch Dokumentation zugeordnet werden kann nicht einfacher und stellt den Sinn und Zweck dieses Objektes in Frage (wenn es eh nur Informationen enthält, die schon an anderer Stelle zu finden sind).<br>\n<strong>Vorteile:</strong></p>\n</li>\n<li>\n<p>Beim \"einfachen Modell\" ohne den Einrichtungskontakt stehen Clients vor der Herausforderung, den richtigen Encounter/Abteilungskontakt für die Zuordnung ihrer Dokumentation finden zu müssen. Die Fallnummer ist kein eindeutiges Kriterium, es müssen ggf. weitere Kriterien wie Fallart, Status oder Datum hinzugezogen werden. Der \"Fallnummer und gut\"-Ansatz von HL7 V2 (ORU, MDM...) funktioniert nicht mehr uneingeschränkt. Der Einrichtungskontakt wäre der einzige Encounter, der eindeutig mit einer Fallnummer assoziiert werden und als Kontext für medizinsiche Dokumentation dienen könnte.</p>\n</li>\n</ul>",
        "id": 276054873,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647871433
    },
    {
        "content": "<p>In der Diskussion am Donnerstag (24.3. 11:30-12:30) sprechen wir die beiden Alternativen (mit/ohne Einrichtungskontakt) nochmal durch treffen dann per Abstimmung die finale Entscheidung. <a href=\"https://teams.microsoft.com/l/meetup-join/19%3ameeting_NDg1ZGNmNzEtMDUzYS00ODg5LWEyNjgtOGEzNDJiMmNhZTYw%40thread.v2/0?context=%7b%22Tid%22%3a%2230092c62-4dbf-43bf-a33f-10d21b5b660a%22%2c%22Oid%22%3a%2275818d5c-55b0-4e8b-9176-980e5d0eac41%22%7d\">(Einwahllink)</a></p>",
        "id": 276055105,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647871531
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197146\">Thomas Freier</span> <a href=\"#narrow/stream/287581-german.2Fisik/topic/.5BBASIS.5D.20Encounter-Modell/near/276053926\">said</a>:</p>\n<blockquote>\n<p>Mir fehlt ein wenig die Einordnung des Encounter s in Benzug auf andere Entitäten wie Order. Dazu müsste ich wahrscheinlich irgendwo in das gesamte Datenmodell schauen oder?</p>\n</blockquote>\n<p>Order wäre ein ServiceRequest mit Bezug zu einem Encounter (Abteilungskontakt). Befunde, Dokumente, Messergebnisse werden dann mit Bezug zu diesem ServiceRequest und dem Encounter versehen. <br>\nAllerdings ist Order-Entry in ISiK Stufe 2 zunächst noch Out of Scope.</p>",
        "id": 276055366,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647871646
    },
    {
        "content": "<p>Wer für den Abstimmungstermin keine Zeit, aber Trotzdem eine Frage oder eine Meinung hat: bitte hier äußern!</p>",
        "id": 276057472,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647872609
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/tZnSI3QZvvSg6yYitHavFZoi/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/tZnSI3QZvvSg6yYitHavFZoi/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/tZnSI3QZvvSg6yYitHavFZoi/image.png\"></a></div>",
        "id": 276462653,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1648121904
    },
    {
        "content": "<p>Ziemlich eindeutiges Ergebnis heute <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 276462681,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1648121928
    },
    {
        "content": "<p>Heute? War der Termin nicht kranheitsbedingt abgesagt?</p>",
        "id": 276474378,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1648128121
    },
    {
        "content": "<p>Nope, der war krankheitsbedingt von letzter auf diese Woche verschoben worden...</p>",
        "id": 276591244,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1648198830
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> , ist heute kein Encounter-Termin?</p>",
        "id": 277255056,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1648719352
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193971\">@Stoyan Halkaliev</span>, das heutige Treffen wurde krankheitsbedingt abgesagt. (Absage ging Diensag abend raus)</p>",
        "id": 277255997,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1648719810
    },
    {
        "content": "<p>Danke <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> , ich habs letzte Woche verpasst, daher wollte ich auf Nummer sicher gehen :-)</p>",
        "id": 277261291,
        "sender_full_name": "Stoyan Halkaliev",
        "timestamp": 1648723314
    }
]