[
    {
        "content": "<p>Wir haben im letzten Meeting einige UseCases für die <a href=\"https://profiles.ihe.net/ITI/MHD/ITI-67.html\">Transaktion  ITI-67: Find DocumentReference</a> gesammelt.<br>\nIch habe diese mal in einem Dokument zusammengestellt und jeweils bewertet, welche Aspekte davon im Rahmen von MHD/XDS umsetzbar sind, und wo ggf. darüber hinausgehend im Rahmen von ISiK eine Umsetzung möglich wäre.<br>\nBitte gerne kommentieren: <br>\n<a href=\"https://github.com/gematik/ISiK-Dokumentenaustausch/blob/master/Materialien/UseCases_ITI-66-67.md\">https://github.com/gematik/ISiK-Dokumentenaustausch/blob/master/Materialien/UseCases_ITI-66-67.md</a></p>\n<p>Wer noch weitere USeCases hat, einfach hier in diesem Thread kommentieren, dann erweitere ich das Dokument entsprechend.</p>",
        "id": 256402550,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633523552
    },
    {
        "content": "<p>Bisher hatten wir noch keine UseCases für <a href=\"https://profiles.ihe.net/ITI/MHD/ITI-66.html\">ITI-66: Find Document Lists</a> genannt.<br>\nHierbei geht es um die Abfrage von Dokumenten anhand der Ordner, in denen sie einsortiert sind. Fall jemandem dazu noch ein UseCase einfällt...</p>",
        "id": 256402794,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633523673
    },
    {
        "content": "<p>Danke an <span class=\"user-mention\" data-user-id=\"359133\">@Daniel Sänger</span> für die Bereitstellung der UseCases, die in das Dokument eingeflossen sind!</p>",
        "id": 256402875,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633523726
    },
    {
        "content": "<p>Der Use Case von Andreas Henkel habe ich als Use Case #4 hinzugefügt.</p>",
        "id": 256429194,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633533682
    },
    {
        "content": "<p>Ich erhebe zum jetzigen Zeitpunkt keinen Anspruch darauf, dass die Beurteilung der Umsetzbarkeit der einzelnen UseCases mittels MHD vollständig und korrekt sind und werde das Dokument anpassen, sobald ich neue Erkenntnisse gewinne.</p>\n<p>Ich bitte weiterhin zu beachten, dass die unter \"Umsetzung im Rahmen von ISiK\" genannten Punkte nicht im Widerspruch zu MHD/XDS stehen sollen, sondern als mögliche Erweitung der Funktionalitäten von MHD/XDS zu betrachten sind.</p>",
        "id": 256429979,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1633533927
    },
    {
        "content": "<p>Wir haben einige weitere Use Cases zusammengetragen, die wir im Rahmen des ISiK Dokumentenaustausch-Moduls für relevant halten:</p>\n<ul>\n<li>Filterung nach Dokumentenstatus</li>\n</ul>\n<p>o   Szenario: Der Anwender möchte Dokumente angezeigt bekommen, die eine bestimmte Freigabestufe erreicht haben.<br>\no   Wir nehmen dabei an, dass Dokumente je nach Fertigstellungsgrad einen unterschiedlichen Bearbeitungsstatus im KIS mitführen.<br>\no   Da viele Dokumente nach ihrer Revision nicht gänzlich gelöscht sondern nur formal ersetzt werden sollen, würden Altversionen als „deaktiviert“ und endgültige Versionen als „final“ markiert werden können.<br>\no   Beispiel: eine erste Ausleitung eines technischen Befunddokuments erfolgt in Freigabestufe 2 als „vorläufig“ und „nicht freigegeben“, eine erneute Ausleitung erfolgt nach erfolgter finaler Freigabe in Stufe 4 als „final“ und „freigegeben“, während die Vorversion als „deaktiviert“ markiert wird.<br>\no   Neben dem Bearbeitungs- bzw. Freigabestatus würde auch das Freigabedatum per ISiK übermittelt werden können.</p>\n<ul>\n<li>IHE-konforme Metadatenanreicherung</li>\n</ul>\n<p>o   Szenario: Zwecks automatischer Weiterverarbeitung in einer XDS-fähigen Datenverteilungsplattform sollen Dokumente aus dem KIS heraus mit IHE-konformen Metadaten angereichert werden.<br>\no   Wichtig als Zusatzinformationen zu herkömmlichen MDM-Informationen sind insbesondere passende Value Sets für classCode, typeCode, practiceSettingCode und confidentialityCode. Hierfür könnten die von IHE Deutschland genutzt werden, für den typeCode alternativ auch die KDL.</p>\n<ul>\n<li>Digitale Signatur</li>\n</ul>\n<p>o   Szenario: Der Anwender möchte zwecks Nachverfolgung des Freigabeprozesses eine Liste von Dokumenten angezeigt bekommen, welche noch keine digitale Signatur bekommen haben.<br>\no   Nebenbedingung: Nur bestimmte Signaturarten werden zwecks Weiterverarbeitung der Dokumente anerkannt (eIDAS/QES).</p>",
        "id": 257041389,
        "sender_full_name": "Marc Herrmann",
        "timestamp": 1633946960
    },
    {
        "content": "<p>Danke! Ich habe die UseCases in die Übersicht aufgenommen: <a href=\"https://github.com/gematik/ISiK-Dokumentenaustausch/blob/master/Materialien/UseCases_ITI-66-67.md\">https://github.com/gematik/ISiK-Dokumentenaustausch/blob/master/Materialien/UseCases_ITI-66-67.md</a></p>",
        "id": 257423794,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1634153509
    }
]