[
    {
        "content": "<p>Info für alle, die sich für's Modul \"Dokumentenaustausch\" interessieren:<br>\nIch habe die relevanten Profile für die Dokumenten-Metadaten  IHE-MHD in das ISiK-Projekt übernommen und tentativ die Bindings auf die Deutschen IHE-ValueSets ergänzt. Damit können wir uns beim nächsten Termin einen Überblick verschaffen, wie ein IHE-kompatibles Profil aussehen würde und überlegen, welche Metadaten wir unbedingt brauchen, bzw. welche optional bleiben können.<br>\nInsbesondere würde ich dies gerne im Hinblick auf mögliche Szenarien für die Suche/Abfrage von Dokumenten auf Plausibilität hin überprüfen.<br>\nBisher sind die Profile nur in GitHub als Quesllcode zu finden: <a href=\"https://github.com/gematik/ISiK-Dokumentenaustausch/tree/master/Profilierung/fsh-generated/resources\">https://github.com/gematik/ISiK-Dokumentenaustausch/tree/master/Profilierung/fsh-generated/resources</a><br>\nSobald es eine menschenlesbare Repräsentation in Simplifier zum Ankucken gibt, ergänze ich den entsprechenden Link</p>",
        "id": 253576790,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1631797108
    },
    {
        "content": "<p>Das Simplifier-Projekt ist jetzt öffentlich verfügbar: <a href=\"https://simplifier.net/isik-dokumentenaustausch\">https://simplifier.net/isik-dokumentenaustausch</a></p>",
        "id": 254665719,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1632470259
    },
    {
        "content": "<p>Bis jetzt sind drin:</p>\n<ul>\n<li>Ein <a href=\"https://simplifier.net/isik-dokumentenaustausch/isikdokumentenmetadatenminimal\">ISiK-DocumentReference-Minimal-Profil</a> auf Basis von IHE MDM [Minimal DocumentReference] <a href=\"https://profiles.ihe.net/ITI/MHD/4.0.1/StructureDefinition-IHE.MHD.Minimal.DocumentReference.html\">https://profiles.ihe.net/ITI/MHD/4.0.1/StructureDefinition-IHE.MHD.Minimal.DocumentReference.html</a>, bei dem die ValueSet-Bindings tentativ auf die von IHE-DE vorgeschlagenen ValueSets gesetzt wurden.</li>\n<li>\n<p>Ein <a href=\"https://simplifier.net/isik-dokumentenaustausch/isikdokumentenmetadatenoptimal\">ISiK-DocumentReference-Optimal-Profile</a> auf Basis des o.g. Profile, bei dem die Pflichtfelder äquivalent zu IHE MDM <a href=\"https://profiles.ihe.net/ITI/MHD/4.0.1/StructureDefinition-IHE.MHD.UnContained.Comprehensive.DocumentReference.html\">Comprehensive DocumentReference</a> gesetzt wurden. <br>\nDieses Profil stellt die Minimalanforderungen für ein Mapping auf XDS dar.</p>\n</li>\n<li>\n<p>Ein <a href=\"https://simplifier.net/ISiK-Dokumentenaustausch/ISiKDokumentenSuchergebnisseOptimal/~xml\">ISiK-Bundle-ISiKDokumentenSuchergebnisseOptimal-Profil</a>, das die Repräsentation der Suchergebnisse darstellt, analog zu IHE MHD <a href=\"https://profiles.ihe.net/ITI/MHD/4.0.1/StructureDefinition-IHE.MHD.FindDocumentReferencesComprehensiveResponseMessage.html\">Find DocumentReferences Comrehensive Response Message</a></p>\n</li>\n</ul>",
        "id": 254666889,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1632470877
    },
    {
        "content": "<p>Für das nächste Meeting am 4.10. würde ich vorab gerne UseCases und Beispiele für die Verwendung von <a href=\"https://profiles.ihe.net/ITI/MHD/ITI-67.html\">ITI-67 Find DocumentReferences</a> und <a href=\"https://profiles.ihe.net/ITI/MHD/ITI-66.html\">ITI-66 Find Document Lists</a> sammeln.</p>\n<p>Anhand dieser Beispiele wollen wir dann gemeinsam versuchen auszuloten, ob IHE MDM diese UseCases abdeckt, ob es optionen in MDM gibt, die für den ISiK-Kontext nicht relevant sind, oder ob wir zusätzliche Features brauchen (Spoiler: Ja, brauchen wir: Fallbezug!).</p>\n<p>Insbesondere wollen wir uns über die Relevanz und die Verwendung von Lists im ISiK-Kontext (für XDS-Menschen: \"Folder\") Gedanken machen.</p>\n<p>Bitte schickt mir UseCase-Ideen der Art </p>\n<ul>\n<li>\"Für die Auswahl von Dokumenten auf einem Tablet sollten alle Dokumenten-Metadaten zu einem Fall abgefragt und in chronologischer Reihenfolge sortiert angezeigt werden können\"</li>\n<li>\"Ein Anwender in der Hygiene-Abteilung möchte den letzten mikrobiologischen Befundbericht eines Patienten aufrufen\"</li>\n<li>\"Ein Anwender möchte den Entlassbrief des vorherigen stationären Aufenthaltes eines Patienten sehen\"</li>\n</ul>",
        "id": 254668129,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1632471534
    },
    {
        "content": "<p>Danke für die Ausarbeitung <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> ! Ist die Dokumentenübernahme aus einem Subsystem im Primärsystem auch geplant? Darin sehe ich speziell die MUSS-Anforderungen des KHZG wie: <br>\n*FTB 2.A:<br>\n...</p>\n<ul>\n<li>\n<p>es den Patientinnen und Patienten ermöglichen, ihre Behandlungsunterlagen sowie weitere zur Aufnahme und Behandlung relevante Daten und Unterlagen, insbesondere den <strong>bundeseinheitlichen Medikationsplan (Barcode-Scan zur strukturieten Weiterverarbeitung</strong>), vorab online hochzuladen, oder dem Leistungserbringer im Rahmen einer vom Patienten oder der Patientin digital erteilten temporären Berechtigung (Consent) den Zugriff auf diese Daten (z. B. in einer existierenden elektronischen Akte) zu ermöglichen,<br>\n...</p>\n</li>\n<li>\n<p>es vorgelagerten Leistungserbringern ermöglichen, Überweisungsscheine bereits vorab online der Klinik zukommen zu lassen,<br>\n...</p>\n</li>\n<li>\n<p>Schnittstellen zu bestehenden KIS und/oder ERP-Systemen vorweisen, sodass die <strong>digital erfassten Daten der Patientin/des Patienten</strong> auch für nachgelagerte organisatorische Prozesse sowie Prozesse der Ressourcenplanung (z. B. Personalplanung oder Bettenmanagement) automatisch und <strong>interoperabel zur Verfügung</strong> stehen. *</p>\n</li>\n</ul>\n<p>Während die Anamnese m.E. über ein Bundle mit Composition aus dem Repertoire des ISIK v1 übermittelt werden kann, sollte für die Dokumentenübermittelung basierend auf dem IHE MHD Profil ein Bundle mit List und DocumentReference im ISIK v2 genommen werden.</p>\n<p>Somit wären die weiteren Usecases:</p>\n<ol>\n<li>Ein Patient lädt seinen BMP in das Portal der Klinik hoch (Subsystem) und teilt ihn (strukturiert) mit dem Primärsystem im Kontext des anstehenden Termins/Falls.</li>\n<li>Ein Patient lädt seinen Überweisungsschein in das Portal der Klinik hoch und teilt ihn (strukturiert oder unstrukturiert) mit der Klinik. Die Aufnahmestelle im KH prüft den Überweisungsschein in Vorbereitung auf die administrative Aufnahme.</li>\n</ol>\n<p>Freue mich die Meinungen der Community zu hören.</p>",
        "id": 254690841,
        "sender_full_name": "Pavlo Dyban",
        "timestamp": 1632484177
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"251855\">@Pavlo Dyban</span> , danke für den Hinweis!<br>\nJa, ITI-65 (Provide Document) ist auch im Scope dieses Moduls. Allerdings nehmen wir das erst als zweiten Meilenstein in Angriff.<br>\nEs ist leichter, erst mit der Abfrage anzufangen, daraus die relevanten Metadaten abzuleiten und diese dann bei der Dokumentenbereitstellung verpflichtend zu forder, als anders herum...</p>\n<p>Ich nehme deine Use Cases mit auf in die Modulbeschreibung...</p>",
        "id": 254692181,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1632484873
    },
    {
        "content": "<p><a href=\"https://github.com/gematik/ISiK-Dokumentenaustausch/blob/master/Materialien/Modulsteckbrief_Dokumentenaustausch.md\">https://github.com/gematik/ISiK-Dokumentenaustausch/blob/master/Materialien/Modulsteckbrief_Dokumentenaustausch.md</a></p>",
        "id": 254692427,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1632485027
    },
    {
        "content": "<p>Zur Info und mit der Bitte um Review: <br>\nIch habe das Profil jetzt vom zugrunde liegenden IHE-Profil losgelöst, damit wir die besprochenen Abweichungen pre-adopten können (date als Pflichtfeld entfernen, context.encounter erlauben etc.)<br>\nDie Doku ist noch nicht vollständig, aber ich habe die entsprechenden Kapitel im IG schon mal erstellt: <br>\n<a href=\"https://simplifier.net/guide/isik-dokumentenaustausch/DatenobjekteDocumentReference#DocumentReferenceInteraktionen\">https://simplifier.net/guide/isik-dokumentenaustausch/DatenobjekteDocumentReference#DocumentReferenceInteraktionen</a></p>",
        "id": 260402057,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1636117471
    },
    {
        "content": "<p>Ich habe die KDL momentan sowohl unter type als auch unter context.event reingesliced. Da können wir beim nächsten Termin dann hoffentlich eine Entscheidung treffen, welche von beiden Varianten wir nehmen wollen.</p>",
        "id": 260402063,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1636117474
    },
    {
        "content": "<p>Dieses und weitere Themen habe ich schon mal für's nächste Meeting getagged.</p>",
        "id": 260402134,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1636117515
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  <br>\nIch habe mir den Leitfaden angeschaut, sieht soweit gut aus. <br>\nUnter \"Abweichungen vom IHE-Profil\" im zweiten Bullet-Point ist wohl der Link zum IHE Issue 88 zu viel.</p>",
        "id": 260782418,
        "sender_full_name": "Thorsten Conrad",
        "timestamp": 1636456202
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191876\">Thorsten Conrad</span> <a href=\"#narrow/stream/287581-german.2Fisik/topic/.5BDOK.5D.20IHE-Profile.20f.C3.BCr.20Dokumenten-Metadaten/near/260782418\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191450\">Simone Heckmann</span>  <br>\nIch habe mir den Leitfaden angeschaut, sieht soweit gut aus. <br>\nUnter \"Abweichungen vom IHE-Profil\" im zweiten Bullet-Point ist wohl der Link zum IHE Issue 88 zu viel.</p>\n</blockquote>\n<p>Danke für den Hinweis!<br>\nIst korrigiert.</p>",
        "id": 260958215,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1636532818
    },
    {
        "content": "<p>Ich habe das Profil gemäß der heute morgen besprochenen Änderungen angepasst:<br>\n<a href=\"https://simplifier.net/isik-dokumentenaustausch/isikdokumentenmetadaten\">https://simplifier.net/isik-dokumentenaustausch/isikdokumentenmetadaten</a></p>",
        "id": 261239984,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1636716605
    },
    {
        "content": "<p>Offen sind noch die Fragen:</p>\n<ul>\n<li>wie verbindlich muss der docStatus (preliminary | final | amended | entered-in-error) sein?</li>\n<li>brauchen wir context.practiceSetting und context.facilityType (ggf. im ISiK-Kontext hartcodiert auf \"KHS\")?</li>\n<li>brauchen wir noch irgenetwas aus der XDS eventCodeList (Fallnummer und KDL haben wir ja bereits verarztet)?</li>\n<li>was machen wir mit content.format (Binding gem. IHE-DE: <a href=\"https://simplifier.net/packages/de.basisprofil.r4/1.0.0/files/397796\">https://simplifier.net/packages/de.basisprofil.r4/1.0.0/files/397796</a>)?</li>\n</ul>",
        "id": 261240752,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1636717106
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191450\">Simone Heckmann</span> <a href=\"#narrow/stream/287581-german.2Fisik/topic/.5BDOK.5D.20IHE-Profile.20f.C3.BCr.20Dokumenten-Metadaten/near/261240752\">said</a>:</p>\n<blockquote>\n<p>Offen sind noch die Fragen:</p>\n<ul>\n<li>wie verbindlich muss der docStatus (preliminary | final | amended | entered-in-error) sein?<br>\n...</li>\n</ul>\n</blockquote>\n<p>Wir haben im heutigen Workshop unter anderem über die alternative Verwendung der eventCodeList sprechen können, allerdings ist die Frage des Must Support bzw. der verpflichtenden Übermittlung des Parameters docStatus meines Erachtens noch nicht endgültig ausdiskutiert worden. <br>\nAus unserer Sicht wäre zumindest das Must Support wichtig, damit sinnvolle Use Cases grundsätzlich möglich werden wie  beispielsweise \"der Chefarzt möchte in einer speziellen App auf dem Tablet die Liste der Dokumente abrufen und ggf. einsehen, welche den Status 'vorläufig' haben, evtl. auch in Kombination mit dem Ersteller\".<br>\nDa ein Dokument möglicherweise nicht immer einen Status zugeordnet bekommt, würde die Verpflichtung der Übermittlung u.U. dazu führen, dass ein Standardwert gesetzt werden müsste, was ebenfalls zu diskutieren wäre.</p>",
        "id": 262788688,
        "sender_full_name": "Marc Herrmann",
        "timestamp": 1637927633
    }
]