[
    {
        "content": "<p>Hallo zusammen,<br>\nich habe es urlaubsbedingt leider veräumt, die Termine für 2022 rechtzeitig nachzupflegen.<br>\nDas ist jetzt nachgeholt:<br>\n<a href=\"https://simplifier.net/isik-dokumentenaustausch\">https://simplifier.net/isik-dokumentenaustausch</a></p>\n<p>Ich bitte um Beachtung: Der nächste Termin findet DIESEN Freitag von 10-11:30h statt!!</p>",
        "id": 268254374,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1642416626
    },
    {
        "content": "<p>In Vorbereitung auf den Termin morgen habe ich, wie beim letzten mal versprochen, die verschiedenen Optionen zur Herstellung von Patienten- und Encounterkontext für die Dokumente zusammengeschrieben:</p>\n<p><strong>Herstellung von Patient- und Encounterkontext</strong><br>\nVor der Bereitstellung von Dokumenten muss ein Client einen Patienten- und Encounterkontext herstellen, damit das Dokument serverseitig anhand der Patient- und Encounter-Verlinkungen in der DocumentReference korrekt zugeordnet werden kann. Zur Herstellung des Kontextes sind folgende Verfahren möglich:</p>\n<ul>\n<li><strong>SMARTApp Launch</strong>: Wenn der Aufruf der App im Rahmen des SMART-Frameworks erfolgt, kennt der Client bereits beim Start den aktuellen Patienten- und ggf. den Encounterkontext. Dabei wählt ein Anwender im Primärsystem (Server) einen Patienten und Fall aus und startet in diesem Kontext die App. Referenzen auf Patient und Encounter werden im Zuge der Autorisierung von Server an Client übermittelt. (Siehe Modul \"Sicherheit - Launch Context und Scopes).</li>\n<li><strong>bekannte Fallnummer:</strong> Der Client kennt die Fallnummer (z.B. durch das Einscannen eines Barcodes, aus einer V2 MDM-Nachricht). Der Client sucht den Encounter der Ebene 1 (Einrichtungskontakt) anhand der Fallnummer. Wenn auf dem Server kein eindeutiger Treffer gefunden werden kann, stellt dies einen Fehlerzustand dar. Die Auswahls muss dann ggf. manuell erfolgen (siehe Punkt \"manuelle Auswahl\".). Wenn ein eindeutiges Ergebnis gefunden wurde, kann der Patientenkontext aus der subject-Referenz des Encounters entnommen werden. Wenn das Dokument auf Abteilungsebene zugeordnet werden soll, muss der Client in einem weiteren Schritt alle dem Einrichtungskontakt über die partOf-Referenz zugeordneten Encounter der Ebene 2 abfragen und (bei mehr als einem Ergebnis, z.B. aufgrund fachabteilungsübergreifender Verlegung oder mehrere Vor-/Nachstationärer Besuche) eine Auswahl durch den Benutzer anfordern, sofern keine automatische Auswahl möglich ist.</li>\n<li><strong>Arbeitsliste:</strong> Der Client ruft auf dem Server eine Arbeitsliste ab (z.B. Liste aller Encounter, die aktuelle auf einer bestimmten Station/Ambulanz stattfinden, Liste aller ServiceRequests/Tasks, die durch den Client abgearbeitet werden müssen (aktuell noch nicht im Scope der ISiK-Spezifikationen!!) und etabliert den Kontext nachdem der Benutzer einen Eintrag der Liste ausgewählt hat.</li>\n<li><strong>manuelle Auswahl:</strong> Nach dem Start des Clients verwendet der Benutzer eine Suchmaske, in der anhand von Patientennummer oder anderer demografischer Daten gesucht werden kann. Der Client verwendet die Patient-Interaktionen des ISiK-Basismoduls, um auf dem Server nach zutreffenden Patienten zu suchen. Der Anwender wählt den gesuchten Patienten aus der Liste der Suchtreffer aus. Im Anschluss listet der Client mit Hilfe der Encounter-Interaktionen des ISiK-Basismoduls die relevanten Besuche des ausgewählten Patienten auf. (Anm.: Welche Besuche als \"relevant\" erachtet werden, liegt im Ermessen des Clients. Es könnte z.B. anhand eines Zeitfensters, der Fallart oder der Encounter-Ebene (Einrichtungskontakt oder Abteilungskontakt) gefiltert werden.) Der Anwender wählt den zutreffenden Encounter aus.</li>\n</ul>",
        "id": 268679559,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1642678905
    },
    {
        "content": "<p>...das werden wir morgen gemeinsam besprechen, gerne aber auch schon mal hier Kritik üben!</p>",
        "id": 268679646,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1642678946
    }
]