[
    {
        "content": "<p>Hallo in die Runde!<br>\nHier noch ein Kommentar zur vorgeschlagenen Integration (vgl. Usecase-Diagramme auf Github).</p>\n<p>Mittels der vorgeschlagenen Integration lässt sich ein Frontend (Client) für die Terminbuchung zusammen mit einem bestätigungsrelevanten System (Server) verwenden. Der Server stellt dafür die Business-Logik für das Frontend zur Verfügung und verwaltet die beplanbaren Ressourcen.</p>\n<p>Es sollen auch Client-Server Integrationen berücksichtigt werden, bei denen der Client das gesamte Buchungsmanagement übernimmt und die Ressourcenplanung verwaltet. In diesem Szenario würde die Synchronisation des Regelwerks (z.B. Besuchsgründe, Öffnungszeiten) und der Termine zwischen dem Client und dem Server ausreichen. Die Terminplanung kann sowohl im Server als auch im Client stattfinden. Speziell relevant in Situationen wo Ressourcen in ambulanten und stationären Terminplanungen gebucht werden (z.B. Leistungsstellen). </p>\n<p>Das beschriebene Integrations-Szenario kommt auch ohne eine Slot-Logik aus, da der Client die Verfügbarkeiten (Slots) selbst verwaltet. Notwenig ist dafür, dass das KIS Termine auch ohne die Referenz auf einen Slot importieren kann.</p>\n<p>Mittels der vorgeschlagenen Integration ist es auch möglich komplexe Terminarten (Multiressourcenplanung, Terminketten) durch die Business-Logik im Client abzubilden. Es würde dafür ausreichen, gebuchte Termine zwischen den Client und Server zu synchronisieren.</p>\n<p>Freue mich auf den fachlichen Austausch.</p>",
        "id": 259858655,
        "sender_full_name": "Pavlo Dyban",
        "timestamp": 1635770512
    },
    {
        "content": "<p>In guter IHE-Tradition würde man dann nicht Systeme beschreiben, sondern \"Actors\" im Sinne von Systemrollen.</p>",
        "id": 259910510,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1635795739
    },
    {
        "content": "<p>Danke <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> ! Der Vorschlag gefällt mir, da er einen klaren Rahmen für die Definition der Transaktionen zwischen den Akteuren vorgibt. Siehe Vorschlag unten.<br>\n<a href=\"/user_uploads/10155/mgYHrtttpuf39XPO9aRl0SZm/Screenshot-2021-11-02-at-16.33.57.png\">Screenshot-2021-11-02-at-16.33.57.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/mgYHrtttpuf39XPO9aRl0SZm/Screenshot-2021-11-02-at-16.33.57.png\" title=\"Screenshot-2021-11-02-at-16.33.57.png\"><img src=\"/user_uploads/10155/mgYHrtttpuf39XPO9aRl0SZm/Screenshot-2021-11-02-at-16.33.57.png\"></a></div>",
        "id": 260013090,
        "sender_full_name": "Pavlo Dyban",
        "timestamp": 1635867400
    },
    {
        "content": "<p>Ich glaube, ich schulde eine Erklärung zum Diagramm im Beitrag oben. Im letzten AG-Termin wurde gebeten, die Rollen der Akteure zu definieren und die Namen zu erklären.</p>\n<ol>\n<li>Appointment Consumer:</li>\n</ol>\n<ul>\n<li>Funktion:<ul>\n<li>Der Akteur empfängt und stellt Termine dar. Termine werden entgegengenommen und optional gespeichert. </li>\n<li>Der Akteur unterhält kein Regelwerk. </li>\n<li>Der Appointment Consumer schickt keine Termine nach außen. Termine anlegen oder modifizieren kann nur ein Appointment Source oder ein Appointment Supplier.</li>\n</ul>\n</li>\n<li>Bsp:<ul>\n<li>Bsp: das Bedside Terminal fragt in der Appointment Repository (z.B. KIS) die Liste der anstehenden stationären Untersuchungstermine und zeigt sie dem Patienten.</li>\n<li>Bsp: der Checkin Kiosk im Empfangsbereich eines KH fragt die Liste der Termine für den authentifizierten Patienten an und prüft, ob der Patient an dem Tag einen Termin hat.</li>\n<li>Bsp: ein Patientenportal fragt die Termine für einen Patienten aus der Appointment Repository an und zeigt diese dem Patienten in der App.</li>\n</ul>\n</li>\n</ul>\n<ol start=\"2\">\n<li>Appointment Supplier:</li>\n</ol>\n<ul>\n<li>Funktion:<ul>\n<li>Erstellt Termine nach einer Verfügbarkeitsabfrage im Availability Supplier (z.B. KIS)</li>\n<li>Termine werden mit einer Referenz auf die Slots aus dem Availability Supplier an die Appointment Repository geschickt.</li>\n</ul>\n</li>\n<li>Bsp: <ul>\n<li>Patient kann einen Termin im Online Portal buchen. Das Portal unterhält keine Liste der Termine, sondern fragt die Verfügbarkeiten an und speichert die Termine in der Terminbuchungssoftware.</li>\n</ul>\n</li>\n</ul>\n<ol start=\"3\">\n<li>Appointment Source:</li>\n</ol>\n<ul>\n<li>Funktion:<ul>\n<li>Erstellt Termine ohne eine Verfügbarkeitsabfrage im Availability Supplier. </li>\n<li>Der Appointment Source unterhält ein eigenes Regelwerk. Die Appointment Repository speichert die Termine ohne eine Validierung des Regelwerks.</li>\n<li>Der Akteur schickt Termine an die Appointment Repository mit einem Slot-Bezug, wobei der Slot nicht von einem Availability Supplier, sondern vom Akteur selbst vergeben wird. (Der Slot kann z.B. als Contained in der Appointment Ressource an die Appointment Repository mitgeschickt werden.)</li>\n</ul>\n</li>\n<li>Bsp:<ul>\n<li>Bsp: MFA bucht einen Termin in ihrer Terminmanagement-Software, die Termine ins KIS spiegelt. Es bedarf keine Prüfung der Regelwerks im KIS, da das Regelwerk in der Terminmanagement-Software die Hoheit für die Termine trägt.</li>\n<li>Bsp: RIS bucht einen Termin und informiert das KIS über die verbindliche Terminbuchung.</li>\n<li>Bsp: ein KAS bietet einen eigenen Terminplaner. Die Termine werden in den Terminplaner des KIS synchronisiert.</li>\n<li>Bsp: Zuweiser bucht einen Termin im Zuweiserportal. Die Terminbuchung ist verbindlich. Der Termin wird direkt in die Appointment Repository geschrieben und er bedarf keiner Bestätigung.</li>\n</ul>\n</li>\n</ul>\n<ol start=\"4\">\n<li>Appointment Repository:</li>\n</ol>\n<ul>\n<li>Funktion:<ul>\n<li>Der Akteur empfängt und speichert Termine. </li>\n<li>Der Akteur erlaubt eine Synchronisation der Ressourcen und Termine mit anderen (Sub-)Systemen (Appointment Consumer).</li>\n<li>Termine werden mit Slot-Bezug gespeichert. Die Slots können von einem Availability Supplier oder einem anderen Appointment Source vergeben sein.</li>\n<li>Die Richtigkeit der Buchung wird im Falle einer Transaktion mit einem Appointment Supplier validiert. Termine von Appointment Source werden ohne eine Validierung direkt gespeichert.</li>\n</ul>\n</li>\n<li>Bsp:<ul>\n<li>Der KIS Terminplaner speichert eigene Termine und empfängt Termine aus anderen (Sub-)Systemen im KH</li>\n</ul>\n</li>\n</ul>\n<ol start=\"5\">\n<li>Availability Supplier:</li>\n</ol>\n<ul>\n<li>Funktion: <br>\n    * Unterhält eine Liste der Verfügbarkeiten. Beantwortet Anfragen zu den Verfügbarkeiten je nach Behandlungsleistungen/Ressourcen → Slots.</li>\n</ul>\n<p>Der Unterschied zwischen dem Appointment Source und dem Appointment Supplier liegt darin, ob eine Verfügbarkeitsabfrage im Vorfeld der Terminbuchung nötig ist oder nicht (nein und ja, entsprechend).</p>\n<p>Freue mich über euer Feedback.</p>",
        "id": 260822725,
        "sender_full_name": "Pavlo Dyban",
        "timestamp": 1636475245
    }
]