[
    {
        "content": "<p>Verschoben von <a href=\"#narrow/stream/179183-german-.28d-a-ch.29/topic/ISIK-Stream\">https://chat.fhir.org/#narrow/stream/179183-german-.28d-a-ch.29/topic/ISIK-Stream</a></p>",
        "id": 238119517,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1620643444
    },
    {
        "content": "<p>Der Diagnosetyp ist eine Eigenschaft des Encounters und nicht der Condition. Abgebildet werden sollte dies per Encounter.diagnosis.use. Siehe <a href=\"https://ig.fhir.de/basisprofile-de/stable/Ressourcen-Condition-TypenundRangfolgen.html\">https://ig.fhir.de/basisprofile-de/stable/Ressourcen-Condition-TypenundRangfolgen.html</a></p>",
        "id": 238119849,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1620643618
    },
    {
        "content": "<p>Aus Sicht der Deutschen Basisprofile und ISiK gibt es jedoch hier keine Vorgaben zur Kodierung. Somit kann dies erstmal beliebig erfolgen.</p>",
        "id": 238119962,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1620643678
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 238120737,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1620644098
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> Alles klar, vielen Dank. Ich hatte bei Encounter.diagnosis nur die Referenz auf die Condition auf dem Radar.</p>",
        "id": 238127509,
        "sender_full_name": "Thomas Zacher",
        "timestamp": 1620647709
    },
    {
        "content": "<p>In Reaktion auf die Anfrage nach der Angabe von Diagnosetypen und der fehlenden Guidance werden wir in IsiK folgende Anpassung vornehmen: </p>\n<p>Die Verlinkung von Procedure.encounter und Condition.encounter auf einen Encounter wird zur Pflicht, sofern es sich um codierte Diagnosen/Prozeduren handelt. <br>\nEine Verlinkung von Encounter auf Condition über Encounter.diagnosis ist nur dann erforderlich, wenn einer Condition im Kontext eines Encounters eine besondere Rolle (Aufnahmediegnose, Entlassdiagnose etc) zugewiesen werden kann. Encounter.diagnosis.use wird damit zu einem Pflichtfeld. Encounter.diagnosis bleibt insgesamt jedoch optional.</p>\n<p>Gibt es dazu Kommentare/Fragen/Bedenken?</p>",
        "id": 238750879,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1620991269
    },
    {
        "content": "<p>Das Grundproblem für mich ist der Scope des Encounters. Eigentlich bildet dieser nur den Patientenkontakt ab. MIt dem Vorschlag werden dann aber Aspekte des Kontakts und des Abrechnungsfalls vermischt. Meines Erachtens können wir das nur auflösen, wenn wir dieses Abgrenzung sauber auflösen. Vielleicht braucht es auch gar andere FHIR Resource. Siehe hierzu die Diskussion in der WG Patient Admin.</p>",
        "id": 239245571,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1621341649
    },
    {
        "content": "<p>Das ist zweiseitig:<br>\nZum einen, was soll der Encounter abbilden, zum anderen wofür wird er genutzt? Ich denke, dass an beiden Enden nachgebessert werden muss..</p>",
        "id": 239424083,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1621431056
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197429\">Axel Biernat</span> <a href=\"#narrow/stream/287581-german.2Fisik/topic/Diagnosetyp/near/239245571\">said</a>:</p>\n<blockquote>\n<p>MIt dem Vorschlag werden dann aber Aspekte des Kontakts und des Abrechnungsfalls vermischt. </p>\n</blockquote>\n<p>Das sehe ich eigentlich nicht so. Die Fragestellung \"Was hatte der Patient zum Zeitpunkt der Aufnahme, wie war sein Zustand bei der Entlassung, welche Erkankung steht im Fokus des Aufenthaltes?\" sind zunächst rein klinische Aspekte. </p>\n<p>Mit den Rollen der Diagnose im Kontext der Abrechnung (Fachabteilungshauptdiagnose, Abrechnungsdiagnose etc.) müssen wir uns dann bei der Modellierung des Accounts auseinandersetzen. Das ist hier zunächst out of scope.</p>",
        "id": 239429311,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1621432973
    }
]