[
    {
        "content": "<p>Hi - I am new and learning more about FHIR and FHIR-Client.JS.  I have read a lot and watched lectures, but no learning is better than practical application.  So I am trying my first  FHIR application:</p>\n<p>Getting the following error with my launch.html code:<br>\n\"Uncaught (in promise) Error: No server url found. It must be specified as iss or as fhirServiceUrl parameter\"</p>\n<p>Code is at FiddleJS:</p>\n<p><a href=\"https://jsfiddle.net/j8d7vhsb/1/\">https://jsfiddle.net/j8d7vhsb/1/</a></p>\n<p>Both URLs are working. Looks like my syntax is appropriate - can someone point me to the issue why this error is occuring? Thanks</p>",
        "id": 241150304,
        "sender_full_name": "Del D",
        "timestamp": 1622641377
    },
    {
        "content": "<p>Hel Del, it looks like you are missing a few parameters that are required in the launch sequence.  The documentation for SMART App Launch (specifically, <a href=\"http://hl7.org/fhir/smart-app-launch/#step-1-app-asks-for-authorization\">parameters for standalone launch</a>) lists what they are.</p>\n<p>The error you are seeing is because you aren't passing in either an <code>aud</code> or <code>iss</code> parameter.</p>\n<p>Hope this helps!</p>",
        "id": 241155520,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1622643662
    },
    {
        "content": "<p>Thanks Gino.  I am not using the Smart Library.  I am using the FHIR-Client.JS library.  </p>\n<p>However, as I have learned the two most popular libraries for FHIR are apparetly Smart and FHIRKit, so now I am transitioning to them to learn more.  I am going to abandon FHIR-CLient.JS and try Smart lib first.. thanks</p>",
        "id": 241157742,
        "sender_full_name": "Del D",
        "timestamp": 1622644591
    },
    {
        "content": "<p>No problem!  The parameter is required to perform a SMART app launch (how the user authenticates and authorizes the application).  It looks like the library you were using was specifically saying you needed the FHIR server URL to either appear as <code>iss</code> or <code>fhirServiceUrl</code> in the object you are passing to <code>FHIR.oauth2.authorize</code>.</p>\n<p>The documentation <a href=\"http://docs.smarthealthit.org/client-js/api#authorizeoptions-promisenever\">here</a> is a little unclear, but it says under 'Common Options' that <code>iss</code> is how you do a Standalone Launch (e.g., you are launching your app yourself, not from within the EHR).  Under 'Advanced Options' it explains <code>fhirServiceUrl</code>, and that it should only be used in development.</p>\n<p>So, your fiddle needs to add a line <code>iss: '{url of FHIR server}'</code> (I don't know the URL for the server you are trying to connect to), and it should work.</p>",
        "id": 241159587,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1622645296
    }
]