[
    {
        "content": "<p>Hello, cross-posting from <strong>Announcements</strong>  to share that Commure unveiled its FHIR developer platform today. Check it out at <a href=\"https://developer.commure.com/\" target=\"_blank\" title=\"https://developer.commure.com/\">https://developer.commure.com/</a> -- note that if you are outside the US geo, you'll need a VPN to access for now.</p>\n<p>Commure is an API-first platform that provides many different types of interfaces for building and managing FHIR-native healthcare applications -- from FHIR APIs to UI frameworks.</p>",
        "id": 187606642,
        "sender_full_name": "Miriam",
        "timestamp": 1581040273
    },
    {
        "content": "<p>Looks very cool! Congratulations on the release. Can you comment on the licensing for the JS libraries / components, <span class=\"user-mention\" data-user-id=\"197011\">@Miriam</span> ? Also, can these components be used to connect to any SMART on FHIR sever (e.g., the SMART Launcher, or the Logical sandbox,  or <a href=\"http://open.epic.com\" target=\"_blank\" title=\"http://open.epic.com\">open.epic.com</a>) or only the Commute platform?</p>",
        "id": 187633953,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1581077818
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> ! We're very excited to finally be able to talk about it. As for right now, it's under our commercial license, but the detailed terms of that and any future plans, I'm not sure - you'd need to talk to either our sales or our open source team. I'd be happy to connect you or anyone else interested.<br>\nYes, all of the API boundaries in the Commure platform are built to be 100% FHIR interoperable, so if a FHIR API is compliant, it will work.</p>",
        "id": 187760933,
        "sender_full_name": "Miriam",
        "timestamp": 1581258824
    },
    {
        "content": "<p>Thanks! Perhaps someone from the open source team could share an overview here?</p>",
        "id": 187760990,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1581258935
    }
]