[
    {
        "content": "<p>I wanted to ask if there was a case to allow user configurable headers to be passed from the config to the Http client. It seems like it is very straight forward to add this, by adding a copyConfig line to the config middleware, however, I am not sure if there are other implications or if it has been a conscious decision to not include headers at this time. </p>",
        "id": 153824909,
        "sender_full_name": "Cole Diffin",
        "timestamp": 1462589174
    },
    {
        "content": "<p>I don't currently have a use case, but I think it's a good addition. </p>",
        "id": 153824913,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462598121
    },
    {
        "content": "<p>This would need to be aware of the CORS implications of this on servers too.</p>",
        "id": 153825275,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1462646324
    },
    {
        "content": "<p>Can you Elaborate <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ? CORS is handeled by the serve in my experience. (Or are you referring to the fact that if you add some extra headers, that the srver has t explicitly allow those headers?</p>",
        "id": 153825772,
        "sender_full_name": "Cole Diffin",
        "timestamp": 1462744336
    },
    {
        "content": "<p>Yes, if you want to add extra headers the CORS has to explicitly permit them. There are no wildcards permitted in there for the headers if i remember rightly. And if you ask for one the server doesn'r permit, it doesn't just mask it, it blocks the call with an access denied message.<br>\n(Could be wrong, but think this is what I experienced recently in IE, could also be browser specific)</p>",
        "id": 153825779,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1462767318
    },
    {
        "content": "<p>New PR with Headers support. </p>\n<p>I've also raised some tickets on github to track recent additions potentially missing from the angular adapter</p>",
        "id": 153825783,
        "sender_full_name": "Cole Diffin",
        "timestamp": 1462774744
    },
    {
        "content": "<p>Yep that recollection of CORS and headers matches my understanding. </p>\n<p>However, in some situations, it is required (or beneficial) to supply headers along with the request. For example, the server that I work with, requires an API key to be included in requests depending on the method that I authorise to the server with. Without the ability to add custom servers to my request, I don't have a way to use fhir.js with that particular authorization mechanism. I'll add a note to the readme about CORS requirements. </p>\n<p>Thanks for your input :-)</p>",
        "id": 153825784,
        "sender_full_name": "Cole Diffin",
        "timestamp": 1462775034
    },
    {
        "content": "<p>Thanks! @<strong>nicola</strong> do you have time to review?</p>",
        "id": 153825816,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462796106
    },
    {
        "content": "<p>Yes, i'll do it tomorrow </p>",
        "id": 153825903,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1462803726
    },
    {
        "content": "<p>Any Progress in this review?</p>",
        "id": 153826700,
        "sender_full_name": "Cole Diffin",
        "timestamp": 1462936928
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  @<strong>nicola</strong> Id there anything I can do to speed up the review of my Latest PR?</p>",
        "id": 153827897,
        "sender_full_name": "Cole Diffin",
        "timestamp": 1463352584
    }
]