[
    {
        "content": "<p>Hello, I'm working with the FHIR.js library <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> @<strong>nicola</strong> and I'm wondering if there is a way to dynamically create IDs. I am creating a communication resource, which contains a patient, relatedperson and organization resource. I know the library will return an ID for the communication resource when posted to the UHN's test server, however, the contained relatedperson references the contained patient, which both require IDs and the contained patient resource references the contained organization as a contact</p>",
        "id": 153836602,
        "sender_full_name": "Tara Oskam",
        "timestamp": 1467820568
    },
    {
        "content": "<p>is there a way to dynamically reference them on create, or should I self-assign these ids?</p>",
        "id": 153836603,
        "sender_full_name": "Tara Oskam",
        "timestamp": 1467820587
    },
    {
        "content": "<p>Currently FHIR.js doesn't provide any tools for creatring or manipulating FHIR resources; it focused on the HTTP API, and expects the developer to effectively \"deal with FHIR resources as JSON\". It would be great to have a (separate?) helper library for <strong>that job</strong>, which is an idea that aligns well with some thoughts from <span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span> .</p>",
        "id": 153836643,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1467831990
    },
    {
        "content": "<p>Cool.  Yes. Big fan of small single purpose libraries. It seems (on superficial examination) that reusability of much of the Fhir code would be increased if it was decomposed a bit more. Not sure what you mean by \"deal with\" tho <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> </p>",
        "id": 153836765,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467895849
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I'm curious about the value that a javascript library offers for the HTTP API given that HTTP requests are pretty well covered in javascript anyway (at least in the two framework contexts I have experience with: D3 and AngularJS).  Is it more that they provide a (small) domain-oriented abstraction at the CRUD layer - read/create/search etc?<br>\nI can see value in a library that makes it simpler to deal with all the optionality that might exist between the JSON object you have and the nested value you want to get to.  A fluentpath implementation maybe?</p>",
        "id": 153836855,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1467931515
    },
    {
        "content": "<p>utils - fluentpath, validation, terminology service abstraction, profile reasoning</p>",
        "id": 153836870,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467935540
    },
    {
        "content": "<p>Well, most lying it handles search parameters, and does a bit of bundle parsing and reference resolute logic. It just doesn't going \"inside\" of the resources (they're just JSON passed through). </p>",
        "id": 153836999,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1468015334
    }
]