[
    {
        "content": "<p>Is <a href=\"https://github.com/FHIR/fhir.js/\">fhir.js</a> still maintained? It is woefully out of date and is a dependency for <a href=\"https://github.com/smart-on-fhir/client-js\">client.js</a>.</p>",
        "id": 272697470,
        "sender_full_name": "David Winters",
        "timestamp": 1645454881
    },
    {
        "content": "<p><a href=\"https://github.com/smart-on-fhir/client-js\">https://github.com/smart-on-fhir/client-js</a> has been more of a focus for the SMART team, but hasn't seen a lot of features (or requests) over the past year, aside from work on supporting SMARTv2. I don't think fhir.js should be a technical dependency if you're using the current client-js version -- see <a href=\"http://docs.smarthealthit.org/client-js/v2.html\">http://docs.smarthealthit.org/client-js/v2.html</a> docs</p>",
        "id": 272699236,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645455741
    },
    {
        "content": "<p><a href=\"http://docs.smarthealthit.org/client-js/#fhirjs-integration\">http://docs.smarthealthit.org/client-js/#fhirjs-integration</a> specifically</p>",
        "id": 272699282,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645455766
    },
    {
        "content": "<p>It does show up as a dev dependency: <a href=\"https://github.com/smart-on-fhir/client-js/blob/master/package.json#L51\">https://github.com/smart-on-fhir/client-js/blob/master/package.json#L51</a><br>\nIs it still used at all or could it be removed?</p>",
        "id": 272719470,
        "sender_full_name": "David Winters",
        "timestamp": 1645466432
    },
    {
        "content": "<p>As a dev dependency it is not required and not included in your builds, unless you import it manually somewhere. It is only included there for testing...</p>\n<p>Client-js does not need Fhir.js but is able to integrate with it at runtime:</p>\n<ol>\n<li>In browsers, if fhir.js is included via script tag and globally available, then the client objects created by client-js will have some additional functionality</li>\n<li>In node, the same thing will happen if fhir-js is imported and put into the global namespace</li>\n</ol>\n<p>Older versions of client-js did depend on fhir.js but that was very difficult to maintain. That is why it is now \"optional\", for those who want to use it, and may even be completely removed in future versions if people are not interested in using it.</p>",
        "id": 272721436,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1645467848
    },
    {
        "content": "<p>Hello everyone!<br>\nI came accross this question and I believe there is no need to create a new thread, since the topic is similar.</p>\n<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> so I understand that the SMART on FHIR JS Library was initially written by you but then at a certain stage it has been maintained by SMART, which hasn't been changing it much, am I right in stating this?</p>\n<p>I was looking though for some guidance, not sure if this is the correct place, but I'll expose my doubt nevertheless.<br>\nI maintain a SMART on FHIR app that performs the OAuth2 handshake using the SMART on FHIR JS Library.<br>\nA client of mine works with EPIC and they just got a quarterly update that broke the connectivity between my app and their EHR system. When they questioned EPIC about the broken connectivity with one their partners (us) they got this back: </p>\n<p><em>\"To match HL7 FHIR specifications, the OAuth2.0 token endpoint (for example, https://&lt;Interconnect Server URL&gt;/oauth2/token) returns a token type value of “Bearer” instead of \"bearer.\" If your app-orchard application is designed to receive case-specific “bearer,\" authentication will fail. We need to verify that a token type value of “Bearer” does not interrupt the authentication process.\"</em></p>\n<p>The error following the attempted handshake is: <em>Error: invalid_grant: Invalid launch token</em></p>\n<p>Have you come accross this before with other vendors? Does it ring any bell at all?<br>\nI have searched fhir-client.js for matches of 'bearer', 'Bearer', etc. but haven't found anything that seemed to be what we I was looking for.<br>\nAny tips, guidance, comments, etc. would be useful!<br>\nThanks in advance!</p>",
        "id": 276592527,
        "sender_full_name": "Angelo Miguel Ferreira",
        "timestamp": 1648199710
    },
    {
        "content": "<p>Can you clarify what library are you are using and your software, at what version? This thread was originally about a library called FHIR.js, which is not actively maintained to my knowledge. But smart still maintains a JavaScript client library at <a href=\"http://docs.smarthealthit.org/client-js/\">http://docs.smarthealthit.org/client-js/</a></p>",
        "id": 276616817,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1648214262
    },
    {
        "content": "<p>In any case, none of these tools should care much about the capitalization of the word \"Bearer\" in the access taken response JSON  payload, but It's possible there is a bug. It would be helpful to know what you were using.</p>",
        "id": 276617038,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1648214360
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> for your comment.<br>\nThe system uses that exact library to perform the connection to the EHR system - <a href=\"http://docs.smarthealthit.org/client-js/\">http://docs.smarthealthit.org/client-js/</a><br>\nIts usage on the system I am currently maintaining was not coded by myself and I have been trying to figure out how is it being used, but it has been a painful process due to the lack of documentation. Without understanding it it's difficult to debug and spot where issues are actually happening.<br>\nThe system is launched using the EHR Launch flow, meaning that the ISS parameter - their FHIR server - is passed by our client.<br>\nIs there any kind of workflow that describes what happens when <strong><em>FHIR.oauth2.authorize</em></strong> is executed?<br>\nThere is this, but it isn't helping much - <a href=\"http://docs.smarthealthit.org/client-js/api.html\">http://docs.smarthealthit.org/client-js/api.html</a><br>\nI have found out this, from cerner, and I could infer from what happens on the code that the <strong><em>FHIR.oauth2.authorize</em></strong> goes through all the authentication process until getting the actual access token that can be further used to query the FHIR server for clinical data, but it's a shame that all of that happens in a blackbox.<br>\nBased on this, do you have anything you think could provide some guidance?</p>",
        "id": 276661592,
        "sender_full_name": "Angelo Miguel Ferreira",
        "timestamp": 1648233451
    },
    {
        "content": "<p>Do you have suggestions for a different API design that would be more useful? For near term debugging, are you seeing errors connecting to the Epic sandbox, or only at certain customer endpoints? Being able to reproduce any errors would be very helpful.</p>",
        "id": 276665149,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1648235186
    }
]