[
    {
        "content": "<p>I am using the <a href=\"http://docs.smarthealthit.org/client-js/\">FHIR Client JS</a>. T<br>\nrying to launch and authorize a SMART on FHIR app, gets the error \"Error: No server url found. It must be specified as iss or as fhirServiceUrl parameter\".<br>\nAccording to the <a href=\"https://docs.smarthealthit.org/client-js/api.html\">documentation</a> 'iss' should only be included for a standalone launch; I am trying to get an EHR launch working through the Epic sandbox. I believe I have added my clientId, redirectUri, and scope correctly.</p>",
        "id": 257562395,
        "sender_full_name": "Corey Wen",
        "timestamp": 1634228208
    },
    {
        "content": "<p>In EHR launch the <code>iss</code> parameter will be passed to your <code>launch_uri</code> by Epic. Are you sure you have configured your client (in Epic) correctly?<br>\nYou should have separate <code>launch_uri</code> page/route which is what Epic will call initially, and a <code>redirect_uri</code> page/route which is where your app actually is.</p>",
        "id": 257570640,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1634231335
    },
    {
        "content": "<p>Could you describe in more detail how one would check if the client in Epic is configured correctly/what would make a client be configured incorrectly?<br>\nAs for the launch and redirect page routes, I believe I have those set up correctly as I do have two separate routes. <br>\nMy app follows the example from the documentation for the <a href=\"https://codesandbox.io/s/fhir-client-react-react-router-context-0q3n8?file=/src/components/Launcher.js\">React example</a>. I have a Launcher component w/ smart.authorize() which redirects to a route that renders the FhirClientProvider component which has smart.ready()<br>\nThe smart.authorize seems to fail in the Launcher component and goes into the catch block I added: <code>smart.authorize.catch</code><br>\nThe app works with the <a href=\"http://launch.smarthealthit.org/?auth_error=&amp;fhir_version_2=r4&amp;iss=&amp;launch_ehr=1&amp;launch_url=&amp;patient=&amp;prov_skip_auth=1&amp;provider=&amp;pt_skip_auth=1&amp;public_key=&amp;sde=&amp;sim_ehr=1&amp;token_lifetime=15&amp;user_pt=\">smarthealthit launcher</a> and Logica sandbox. The situation is the app is launching from an Epic BPA which comes from a CDS service. The CDS card returned has the url for the launcher component of the app (the url is the root path, similar to the example linked)</p>",
        "id": 257577759,
        "sender_full_name": "Corey Wen",
        "timestamp": 1634234210
    },
    {
        "content": "<p>Yes, sorry. I meant that you might have swapped the launch and redirect URLs in your Epic client configuration. If that is not the case, and if it works with the launcher and Logica, then the next logical step would be to debug and see if the app is being passed that <code>iss</code> parameter.  If it isn't, then it is some kind of CDS problem.</p>\n<p>I have not followed CDS for a while so I don't even remember if CDS Hooks supports EHR launch?</p>\n<p>I also can't understand what you mean by   \"(the url is the root path, similar to the example linked)\"</p>",
        "id": 257729788,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1634316949
    },
    {
        "content": "<p>I believe the launch/redirect URLs are correct in the Epic client configuration.<br>\nCould you explain more how one would debug to see if the app is being passed the <code>iss</code> parameter/what one would look for to spot issues? The only error message I am able to get is the 'No server URL found, it must be specified as 'iss' or 'fhirServiceUrl'. I am unable to open developer tools to look at any console.log statements as developer tools are disabled in the window the app opens in.<br>\nI believe CDS hooks supports EHR launch as I had done some testing in the <a href=\"https://sandbox.cds-hooks.org/\">CDS sandbox</a> with a card that launches the app.<br>\nWhat I mean by \"(the url is the root path, similar to the example linked)\" is  the app's launch path is something like <code>my-app.com</code> and the redirect is to `my-app.com/the-app'.</p>",
        "id": 258078749,
        "sender_full_name": "Corey Wen",
        "timestamp": 1634582623
    },
    {
        "content": "<p>In your launch endpoint:</p>\n<ul>\n<li>You can comment out the <code>authorize</code> call so that it does not redirect and then look at the URL.</li>\n<li>If you don't see the url either, then you can add <code>alert(location.href)</code> before <code>authorize</code> is called.</li>\n</ul>",
        "id": 258212303,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1634656361
    }
]