[
    {
        "content": "<p>I'm interested in providing a R4 client in JS for US-Core/Argonaut that supports Smart App Launch and that seamlessly handles R2 -&gt; R4 servers transparently to the app. Is anyone else interested in this?</p>",
        "id": 156495814,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548014979
    },
    {
        "content": "<p>Definitely interested -- and we should think about resources to build/support this among folks here. Always curious to hear perspectives from developers using (and perhaps struggling with) multiple version of FHIR in JS today. e.g. <span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> have you thought about this use case before?</p>",
        "id": 156798346,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1548357622
    },
    {
        "content": "<p>in js this problem doesn’t look too critical because of duck-typing ;) But yes we need versions transform library for js, not sure it should be as complex and non-DRY as fhir mapping language, envision something simpler. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  can you share most complicated version translation case?</p>",
        "id": 156806360,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1548363921
    },
    {
        "content": "<p>and still dream about backward and forward compatible version-less FHIR in future ;)</p>",
        "id": 156806541,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1548364121
    },
    {
        "content": "<p>today i updated project from java 8 to 11 and everything works - so it possible</p>",
        "id": 156806596,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1548364191
    },
    {
        "content": "<p>the version transforms use the most complicated features of the transform language - sending content to different places based on the value of another element, using terminology services to lookup data, combining information into a list with controlled order</p>",
        "id": 156806843,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548364443
    },
    {
        "content": "<p>but I'm not sure that an implementation of the transform language is the right solution (even though it's basically simple if you have a FHIRPath implementation)</p>",
        "id": 156806878,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548364493
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> can you give more details about this most complicated case?</p>",
        "id": 156808076,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1548365406
    },
    {
        "content": "<p>An issue I ran into yesterday along these lines was trying to write a FHIR query (using the <a href=\"https://github.com/FHIR/fhir.js/\" target=\"_blank\" title=\"https://github.com/FHIR/fhir.js/\">fhir.js</a> client) to query the latest Observation without a focus.  It turns out that R3 servers do know about the \"focus\" parameter and return an error.  It would be nice if the client could do that translation for me so I could write one thing that would work with either R3 or R4 servers.</p>",
        "id": 157878388,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1549648658
    },
    {
        "content": "<p>that's the kind of thing it would do</p>",
        "id": 157915155,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1549687561
    },
    {
        "content": "<p>Symptomatic has tentative R2-R4 support with Smart App Launch client (with longitudinal timeline and CCD viewer).  We just added algorithm selection support to our switchboard, and will soon be providing mapping services and functionality. [Symptomatic.Switchboard.png]<br>\n(<a href=\"user_uploads/10155/R9uL66XmdpigGOB5MkKBax5c/Symptomatic.Switchboard.png\" target=\"_blank\" title=\"user_uploads/10155/R9uL66XmdpigGOB5MkKBax5c/Symptomatic.Switchboard.png\">https://chat.fhir.org/user_uploads/10155/R9uL66XmdpigGOB5MkKBax5c/Symptomatic.Switchboard.png</a>)</p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/10155/R9uL66XmdpigGOB5MkKBax5c/Symptomatic.Switchboard.png\" target=\"_blank\" title=\"https://chat.fhir.org/user_uploads/10155/R9uL66XmdpigGOB5MkKBax5c/Symptomatic.Switchboard.png\"><img src=\"user_uploads/10155/R9uL66XmdpigGOB5MkKBax5c/Symptomatic.Switchboard.png\"></a></div>",
        "id": 159482758,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1551243253
    },
    {
        "content": "<p>Is this easily useable as a general purpose JS client outside symptomatic?</p>",
        "id": 159488154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551251723
    },
    {
        "content": "<p>Eh... depends on what you mean by 'easy'.  </p>\n<p>The switchboard component itself uses React and Minimongo and Simpl-Schema and Material UI, which are fairly opinionated and maybe not so easy to just drop into apps that are not prepared for it.   </p>\n<p>We could certainly compile the switchboard panel into a general purpose utility that could be easily installed and used outside Symptomatic.  I've been bouncing back-and-forth between deploying it as a downloadable utility versus offering it as SaaS, but the switchboard doesn't necessarily need to be shipped with the timeline and CCD viewer.  So... yes?  But what's the business model there?  </p>\n<p>If you're desiring an underlying javascript library without GUI to just handle data transformations, we could refactor a few things and provide a scaffold of what that would we're using.  We have a <code>MedicalRecordsImporter</code> object that is starting to collect  methods for parsing and transforming specific versions.  We usually do it a CCD/Bundle at a time with custom mappings and using minimongo cursors, rather than try to do something algorithmically with JsonSchema (we're moving in that direction, but still evaluating implementation pattern).</p>",
        "id": 159527375,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1551283680
    }
]