[
    {
        "content": "<p>The following questions were raised by Gunjit Chhatwal in the <a href=\"http://code.cerner.com\" target=\"_blank\" title=\"http://code.cerner.com\">code.cerner.com</a> google group that are better are addressed here for everybody's benefit.</p>\n<p>-----Start question ----<br>\nIt was mentioned during the FHIR connectathon discussions that every time a CDS hook is invoked for ePDX scenario a new allergy would have to written so that it shows up as a new entry. </p>\n<p>From Hans B -<br>\n\"As a user story reminder @Viet Nguyen , when the same allergy is re-written for a different date, we still only show one allergy (being de-duped), so need different allergies for the patient to show more clearly it was received.\"</p>\n<p>Queries:<br>\n1. Could you please share similar guidelines for Medications, allergies and document reference resources so that every time this workflow is executed booth visitors can see something new in the Cerner EMR patient chart?<br>\n2. Demo patient Dara does not have any allergies as per her medical history. Is that only from the EMR system perspective? Is there a list of allergies that we can use for posting to make this interaction more realistic?<br>\n3. We are planning to send a care plan as part of document reference POST. Would Cerner prefer receiving a CDA care plan document or an HTML document?</p>\n<p>Thanks,<br>\nGunjit</p>",
        "id": 156633670,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1548186562
    },
    {
        "content": "<p>Responses in concext:</p>\n<p>1. Could you please share similar guidelines for Medications, allergies and document reference resources so that every time this workflow is executed booth visitors can see something new in the Cerner EMR patient chart?  HJB: At the booth we have the views available to show this that a Cerner associate (Drew Torres or Yegor Hanov) will navigate.  This is not capability that is available in the sandbox.<br>\n2. Demo patient Dara does not have any allergies as per her medical history. Is that only from the EMR system perspective? Is there a list of allergies that we can use for posting to make this interaction more realistic?  HJB: <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> was going to provide allergies to be used for what demo that are clinically reasonable so they don't overlay.<br>\n3. We are planning to send a care plan as part of document reference POST. Would Cerner prefer receiving a CDA care plan document or an HTML document?  HJB: Per earlier post on DocumentReference create, we can accept XHTML per tech specifications section Create (see: <a href=\"https://fhir.cerner.com/millennium/dstu2/infrastructure/document-reference/#create\" target=\"_blank\" title=\"https://fhir.cerner.com/millennium/dstu2/infrastructure/document-reference/#create\">https://fhir.cerner.com/millennium/dstu2/infrastructure/document-reference/#create</a>).</p>",
        "id": 156634071,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1548186893
    }
]