[
    {
        "content": "<p>We are increasingly using SNOMED in our value sets these days and are binding value sets to our user interface. <br>\nA question has been raised from a colleague regarding the synonyms available in SNOMED, they (often) don't match with the expectations of our clinical user base and as such this causes tension.</p>\n<p>When creating a value set, then something along the lines of the following could be used:</p>\n<p><a href=\"/user_uploads/10155/0DGQnGxAh_w-EGJS5KWW-FHR/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/0DGQnGxAh_w-EGJS5KWW-FHR/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/0DGQnGxAh_w-EGJS5KWW-FHR/image.png\"></a></div><p>I'm aware that if for any \"code\" the \"display\" is not provided in the value set then when $expanded the \"preferred term\" is used, so actually if the preferred term is fine this does not need to be present in the value set definition.</p>\n<p>However, if a \"display\" is present, I am assuming this should really be a synonym for the concept in question.  Technically <em>anything</em> can be placed here but based on the correct usage of SNOMED is it correct that only synonyms should be used?</p>",
        "id": 238753481,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1620992503
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> Correct. ValueSet.compose.include.concept.display can be something the value set author creates specifically in the context of that value set as noted in the comment on this element \"The value set resource allows for an alternative display to be specified for when this concept is used in this particular value set. See notes in the value set narrative about the correct use of this element.\" What is critical is this <strong>SHALL NOT be used to change the meaning in any way</strong> [my personal emphasis here.] So yes, you can use a synonym and <strong>no</strong> you can not put anything there.</p>",
        "id": 238773983,
        "sender_full_name": "Robert McClure",
        "timestamp": 1621001930
    },
    {
        "content": "<p>Thank you  <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  what I am unclear about is whether \"Synonym\" is based on the SNOMED definition or whether it is the dictionary definition. A slightly different, though related, issue is when we have UI  constraints where the length of the SNOMED term is too long.</p>",
        "id": 238779221,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1621003946
    },
    {
        "content": "<p>as far as I'm concerned, it's the dictionary definition. I wrote about the underlying ideas at play here: <a href=\"http://www.healthintersections.com.au/?p=1716\">http://www.healthintersections.com.au/?p=1716</a>. Snomed Intl might say that you should always pick one of their pre-approved synonyms, but I don't. I do say that you should be super careful choosing your display, but ignoring the context and picking a pre-approved SCT display is also potentially careless.</p>",
        "id": 238828736,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621025913
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> If I was to offer a technically specific answer, I'd say that as long as you use a word/phrase that has the same or nearly the same meaning as the code system defined preferred name, but does not match any other concept description ( or synonym) in the code system, you are ok. You are <em>always</em> ok selecting a code system defined synonym for the concept.</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>linked  blog post illustrates that when considering a UI <em>for picking data entry</em> you can improve the process by keeping selection context in mind. It also treds on the what to do when you want to make the UI different than Value set content and the importance of including that in originalText. I'll note that IMO the comment discussion there needlessly intermingles  data collected (yes put selected text into the instance originalText) with What do I display when viewing information.</p>",
        "id": 238919916,
        "sender_full_name": "Robert McClure",
        "timestamp": 1621106800
    },
    {
        "content": "<p>Hi, I'm only beginning with FHIR but I've got some years of studying SNOMED CT. The correct way when you need a new synonym in SNOMED CT is to create it in your national or local extension so it can be properly maintained, shared and versioned. If that synonym is not in English, then it should be added by your national release center to the national extension as affilies may not translate by themselves. This rule exists to protect against poor translations and drifts in meaning which can very easily happen to people unused to creating SNOMED CT content. If your SNOMED concepts lack expressivity, SNOMED international is always happy to receive feedback and consider new synonyms, as are most NRCs. Which (preferred) synonym should be displayed to the user given a specific context can be determined using the language refsets in SNOMED CT. You can for example have a patient language refset to display your SNOMED CT disease concept in a simpler language that the patient can grasp more easily when the data are displayed in the patient held record. There is a default context for SNOMED CT concepts which is defined by the concept model. If you specify another context in another field, that's a decision of FHIR ressource data model or you need to do postcoodination. Changing the default context of a SNOMED CT procedure or disorder concept means you're changing the hierarchy and using Situation with explicit context concepts. Don't know if it helps.</p>",
        "id": 253116016,
        "sender_full_name": "Lambot Marie-Alexandra",
        "timestamp": 1631549310
    }
]