[
    {
        "content": "<p>Hello there. We are students completing a project in the area of allergy management. Our project involves simplifying the current list of allergens in our electronic medical record (Epic) and ensuring that these are linked to our electronic menu management system (Delegate). </p>\n<p>We are hoping that you could help us with a technical question we have encountered while doing this project. Currently, our allergens are coded with the SNOMED terminologies, as well as HL7 and RxNorm coding. Could you tell us a bit about what the difference between these codings are and whether they relate to one another?</p>\n<p>We also found that there are many duplicate names of similar foods eg. tree nut and tree nuts, green bean and green beans <br>\nand we were unsure why this is.<br>\nWe have contacted SNOMED international and they have mentioned that the terminologies they produce are singular, and that we should contact HL7 to inquire further.</p>\n<p>Here are more examples of duplicates:<br>\n95323   TREE NUTS   Tree Nuts   Drug Class  Food    RxNorm  13577000<br>\n82953   TREE NUT    tree nut    Drug Ingredient Food    RxNorm   13577000</p>\n<p>84857     ENGLISH WALNUT            English walnut         Drug Ingredient   Food       RxNorm    256352005<br>\n85312       ENGLISH WALNUT HULL  english walnut hull     Drug Ingredient   Food       RxNorm    256352005 </p>\n<p>91088   ALBUMEN (EGG WHITE)      albumen (egg white)  Drug Ingredient Food   RxNorm 256443002<br>\n91855   EGG WHITE                       egg white                  Drug Ingredient Food   RxNorm 256443002</p>\n<p>Thank you very much for your time and we look forward to hearing from you soon.</p>\n<p>Kindest regards.</p>",
        "id": 179377232,
        "sender_full_name": "Vivian Kristina",
        "timestamp": 1572385396
    },
    {
        "content": "<blockquote>\n<p>Currently, our allergens are coded with the SNOMED terminologies, as well as HL7 and RxNorm coding</p>\n</blockquote>\n<p>I'm not sure what you mean by \"hl7 coding\" there.</p>",
        "id": 179381091,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572387766
    },
    {
        "content": "<p>regarding your RxNorm questions, these codes are differentiating between the item as a food directly, and it's use as an ingredient in other things. For medication use, those are pretty different concepts, but I think that in a menu management context, it's a more slippery distinction</p>",
        "id": 179381276,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572387864
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194260\">@Patrick McLaughlin (NLM)</span> might want to say more about RxNorm than that</p>",
        "id": 179381324,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572387901
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Thank you very much for your reply.</p>",
        "id": 179878496,
        "sender_full_name": "Vivian Kristina",
        "timestamp": 1572902893
    },
    {
        "content": "<p>I'm also confused by the question and listed examples. Perhaps you could explain what one of those lines is supposed to be telling us and where you obtained it?</p>",
        "id": 180919475,
        "sender_full_name": "Robert McClure",
        "timestamp": 1573923173
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"247153\">@Vivian Kristina</span> <br>\nYou need to clarify these codes/concepts' source terminologies/vocabularies.  Maybe they come from some local or vendor's terminologies/vocabularies.  Clearly, some codes  (e.g., 256352005) in your examples come from SNOMED CT, but others are from unknown sources (e.g., 84857) as the following instance shows:</p>\n<p>84857     ENGLISH WALNUT            English walnut         Drug Ingredient   Food       RxNorm    256352005</p>",
        "id": 212961213,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602414793
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> is right.  Terminologically speaking, esp. in clinical terminologies such as LOINC, SNOMED CT and RxNorm, say, commonly called food and food ingredients are different although they likely have identical names/synonyms.</p>",
        "id": 212961410,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602415195
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192103\">@Lin Zhang</span> Impressively old thread to be commenting on. I was trying to get some specifics on the lines provided, are you suggesting you know the details on these examples?  The SCT concept Walnut - nut (substance)|256352005 is indeed representing the substance class for that object. Perhaps that is what you mean by \"food ingredient\" and I'd love to hear of a system matching food ingredients in a dietary ordering system to SCT. The code 84857 is not in RxNorm so not sure what that is supposed to mean.  The RxNorm focus is drugs, so the aligned but very different thing is walnut allergenic extract| 314470. Aligning all this in a workflow-appropriate system is complicated and honestly, knowing the extract to use to determine allergic responsiveness (the allergenic extract) is pretty useless in the context of food-prep allergy avoidance.</p>",
        "id": 212968544,
        "sender_full_name": "Robert McClure",
        "timestamp": 1602428445
    },
    {
        "content": "<p>The example line was taken from <span class=\"user-mention\" data-user-id=\"247153\">@Vivian Kristina</span> 's original question.  And I don't know their source(s).  All those example lines don't include RxNorm codes although some text strings could be found in RxNorm.</p>\n<p>SCT provides those substances (as the code you further confirmed) for allergens.  And another closely related CodeSystem is LOINC, which provides a wide range of lab test codes for allergens.</p>",
        "id": 212986849,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602459297
    }
]