[
    {
        "content": "<p>Attempting to deduce SNOMED coding for family history - we receive text for mother, father, grandfather etc - which we can easily match.</p>\n<p>However, sometimes we receive data like \"Parents\", \"Grandparents\" (i.e. plurals) which don't seem to be in SNOMED, yet other plurals do exist.</p>\n<p>Two questions,<br>\n1) Why does SNOMED have some plurals but not others (e.g. Elderly Parents, Homosexual Parents)<br>\n2) Any suggestion on whether SNOMED can be used for these (I'm guessing not)</p>",
        "id": 182396643,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1575325505
    },
    {
        "content": "<ol>\n<li>I would think most of these plurals in SNOMED are editorial errors - see <a href=\"https://confluence.ihtsdotools.org/display/DOCEG/Plurals\" target=\"_blank\" title=\"https://confluence.ihtsdotools.org/display/DOCEG/Plurals\">https://confluence.ihtsdotools.org/display/DOCEG/Plurals</a></li>\n<li>I don't follow the question - to what does \"these\" refer and what does \"used\" mean?  Used where and how?</li>\n</ol>",
        "id": 182399492,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1575328260
    },
    {
        "content": "<blockquote>\n<ol start=\"2\">\n<li>I don't follow the question - to what does \"these\" refer and what does \"used\" mean?  Used where and how?</li>\n</ol>\n</blockquote>\n<p>If I have a family member history declared as pertaining to \"parents\" then we can not use SNOMED to represent this as \"parents\" is not a concept in SNOMED - that's how I read this.</p>",
        "id": 182458624,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1575386346
    },
    {
        "content": "<p>Parents could be expressed as mother AND father using SNOMED CT Expression Constraint Language (ECL).</p>\n<p>And a singular \"parent\" eqals mother OR father.</p>",
        "id": 212962478,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602417163
    },
    {
        "content": "<p>ECL is not valid as a code.  It is not to be confused with the SNOMED Compositional Grammar (SCG) which is used to construct Post Coordinated Expressions (PCEs).  However, beware that the PCE \"mother + father\" is a concept that represents something that is both mother and father at the same time -- note that conjunction is not aggregation. <br>\nIn the case here you want, I think, \"parent\" (singular) because it doesn't really make sense to have a single family history that pertains to two people; you should have one for each.  Hence, I would expect the concept to be 40683002 |Parent|</p>",
        "id": 212994143,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1602472768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> Hi, I see you've tired to express relatives in SNOMED CT for family history and I need to do the same. What did you pick as concepts, the children of 303071001 |Person in the family (person)|, of 125677006 |Relative (person)| of did you use the children of 444148008 |Person in family of subject (person)|? I'm wondering about the use of the last one as for me the default SNOMED CT context is that the concept applies to the subject of record. So I'd rather take say for \"sister\" 27733009 |Sister (person)| then 444304005 |Sister of subject (person)|. What did you choose? If your refset available somewhere so I'd not duplicate the same job needlessly? Thanks</p>",
        "id": 253117343,
        "sender_full_name": "Lambot Marie-Alexandra",
        "timestamp": 1631549761
    }
]