[
    {
        "content": "<p>Hello, I am currently looking for Snomed binding of FHIR resources and elements of FHIR resources. I found the page <a href=\"http://build.fhir.org/mappings.html\" target=\"_blank\" title=\"http://build.fhir.org/mappings.html\">http://build.fhir.org/mappings.html</a> on which two links to such bindings are mentioned (SNOMED CT Concept Domain Binding and SNOMED CT Attribute Binding). Unfortunately both links are dead. Has anyone working links for those resources ? Or are they offline because of digital rights issues ? Or has anyone another recommendation which resources exist on this topic ?<br>\nGreetings<br>\nGeorg</p>",
        "id": 153984049,
        "sender_full_name": "Georg Fette",
        "timestamp": 1533801696
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192077\">@Linda Bird</span></p>",
        "id": 153984051,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533802271
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>  I'm sorry to see that there are dead links in that page and I will follow up on that with HL7.   Those links _look_ like they might be intended to link into our SNOMED CT Glossary since the text under the links looks like the sort of thing we would have on such a page.    </p>\n<p>In terms of the information you seek, the HL7 TermInfo project has previously attempted to supply suggested bindings from FHIR Resources to SNOMED CT and these can be found by drilling down into each resource element.   For example in the Medication Resource you would find a link to <a href=\"http://build.fhir.org/valueset-medication-codes.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-medication-codes.html\">http://build.fhir.org/valueset-medication-codes.html</a></p>\n<p>More recently, SNOMED International in collaboration with HL7 has been running a \"SNOMED on FHIR\" group who have been working through a number of resources on a 2-weekly Tuesday call where we attempt to improve on the current suggested bindings.  You'd be most welcome to join us on that, if only to find out who else is attempting this work and what other documentation might be out there - which we'd also be interested in!   We have regular input from the NHS (UK) who are going through the same exercise.    The resources that we've visited so far are listed here:  <a href=\"https://confluence.ihtsdotools.org/display/FHIR/Resource+bindings\" target=\"_blank\" title=\"https://confluence.ihtsdotools.org/display/FHIR/Resource+bindings\">https://confluence.ihtsdotools.org/display/FHIR/Resource+bindings</a>     Best Wishes, Peter Williams</p>",
        "id": 153984728,
        "sender_full_name": "Peter Williams",
        "timestamp": 1533885165
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192993\">@Peter Williams</span> I've just fixed all the dead links - no need for you to worry</p>",
        "id": 153984737,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533887118
    }
]