[
    {
        "content": "<p>Hi all. I am on Firely .NET sdk (lib) latest version. The lib sends POSTs to a Snowstorm server (trying to read SNOMED CT data) that speaks FHIR. I have GET samples that work in the browser, but cant get the parameters right for the POSTs in the lib. I keep getting \"Compose element(s) or 'url' parameter is expected to be present for an expansion, containing eg <a href=\"http://snomed.info/sct?fhir_vs=ecl/\">http://snomed.info/sct?fhir_vs=ecl/</a> or <a href=\"http://snomed.info/sct/45991000052106?fhir_vs=ecl/\">http://snomed.info/sct/45991000052106?fhir_vs=ecl/</a>)\" whatever i do. I have tried using all three overloads of Expand method in the lib, but getting none to work. @Ward Weistra do you know if there are known issues with the lib regarding code systems or Snowstorm? Pls forgive me for crossposting...</p>",
        "id": 219323363,
        "sender_full_name": "Bjørn Erik Nordal",
        "timestamp": 1607512891
    },
    {
        "content": "<p>Have you tried with the url set to the implicate valueset plus the ECL statement - e.g. \"url=http://snomed.info/sct?fhir_vs=ecl/&lt;&lt;48176007 \" ?</p>",
        "id": 219359196,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1607530619
    },
    {
        "content": "<p>Yes I have tried that. Same error...funny thing is I can list the value sets with Search&lt;&gt; but nor $expand them with var result = client.ExpandValueSet(). I have tried all three overloads of the function</p>",
        "id": 219457145,
        "sender_full_name": "Bjørn Erik Nordal",
        "timestamp": 1607597734
    },
    {
        "content": "<p>How are you supplying the parameters?  For a POST they need to be in the body as a Parameters resource.</p>",
        "id": 219602495,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1607691637
    },
    {
        "content": "<p>It may be that Snowstorm does not support POST, and POST is not recommended for $expand unless you're actually sending the ValueSet itself since POST cannot be cached, while GET can</p>",
        "id": 219602607,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1607691706
    }
]