[
    {
        "content": "<p>What are some thoughts around the requirement to specify the snomed edition when including SCT concepts in a value set definition? </p>\n<p>The edition uri (i.e. without a specific version) can be included as a value of  ValueSet.compose.include.version. The concern is if value sets bound in a profile do not explicitly state the edition, expansion and validation results may differ depending on the jurisdiction in which the resource is being interacted with. I note the ValueSet.jurisdiction element, but not sure if this is the best place to describe this type information. Is this only a problem when a resource instance crosses jurisdictional borders or is best practice to explicitly state the edition to ensure a terminology server processes it.</p>\n<p>Another consideration is that a value set definition may be perfectly sensible regardless of the edition. (E.g. &lt; 363679005 |Imaging (procedure)| ) and that the edition or local requirement belongs in the binding?</p>\n<p>Thanks</p>",
        "id": 171573686,
        "sender_full_name": "Liam Barnes",
        "timestamp": 1563936208
    },
    {
        "content": "<p>jurisdiction is irrelevant in this regard</p>",
        "id": 171601762,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1563971682
    },
    {
        "content": "<p>If you don't specify the edition or version, your outcomes will vary across versions and editions, yes. that's a feature, not a bug, if you don't want that to happen, be specific</p>",
        "id": 171601877,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1563971766
    },
    {
        "content": "<p>Thanks Graham. I wasn't suggesting it was a bug, but rather just wondering if others have had a requirement to explicitly state the edition in value sets and for what reasons. The second part was that if you do explicitly state the edition in the value set, then you limit that value set to a specific implementation scenario. I wondered if that was something you should do in the value set or the profile...or perhaps even an implementation guide?<br>\nI'm hearing you believe that's for the value set to do. Thanks again.</p>",
        "id": 171650358,
        "sender_full_name": "Liam Barnes",
        "timestamp": 1564009556
    },
    {
        "content": "<p>My expectation is that, if you need it, you would specify the specific SNOMED CT edition in the definition (.compose) of the value set which is bound in a particular profile that is part of an implementation guide that you are publishing (at least that would be the typical case).</p>",
        "id": 171654882,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564015791
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>. That's nice and clear.</p>",
        "id": 171659147,
        "sender_full_name": "Liam Barnes",
        "timestamp": 1564022947
    },
    {
        "content": "<p>it is done in the value set, but it would be part of a set of implementation guidance, and matched to the scope of the implementation guidance. e.g. if a domain such as 'cardiaology' were to publish a set of profiles they would not bind to a particular edition. Where as if an Australian national standards body did, they would obviously bind to at least a particular edition</p>",
        "id": 171668645,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564038257
    },
    {
        "content": "<p>Unless, of course, there might be other valid \"sub-Editions\" (eg a QHealth extenstion of SCT-AU) -- note this is a real edge case</p>",
        "id": 171747225,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1564116191
    }
]