[
    {
        "content": "<p>Unsere Biobankler haben moniert, dass das Biobank-Profil keine Verbindung zum Fall hat in dem die Probe entnommen wurde, sondern nur zum Patienten. Man kann zwar über den Startzeitpunkt irgendwie zu dem Fall kommen, das bedarf dann aber immer irgendeiner Verrechnerei. Wäre es nicht besser das Subject generell über den Fall laufen zu lassen, so dass das einfacher wäre zu diesem Fall zu kommen und den Patienten hat man dann auch immer da der Fall an diesem PAtienten hängt ?</p>",
        "id": 270511650,
        "sender_full_name": "Georg Fette",
        "timestamp": 1643875131
    },
    {
        "content": "<p>Subject wird uns durch FHIR vorgegeben, hier sind nur (Patient | Group | Device | Substance | Location) möglich, wobei wir das ja für die MII auf Patient beschränkt haben. Man könnte über den serviceRequest für das Specimen gehen, der wiederrum ein Encounter verlinken würde. Aber sobald wir die Fall-Thematik aufmachen kommen dann neue Fragen (welche Ebene des Fall-Modells? Wie umgehen mit Kohortenproben ohne Behandlungskontext?). Was für Infos aus dem Fall könnte man denn über das aktuelle Modell nicht bekommen?</p>",
        "id": 270512829,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1643875991
    },
    {
        "content": "<p>Ich bin in der konkerten Thematik nicht so tief drin, aber ich könnte mir z.B. einen Anwedungsfall vorstellen, in dem der Fall z.B. eine Krebs-Sache ist bei der Informationen über die Kodierung von Diagnose-Codes oder bestimmte zusätzliche Observations, die konkret an einem Fall dran hängen und man die übrigen Daten des Patienten nicht dabei haben möchte.</p>",
        "id": 270513543,
        "sender_full_name": "Georg Fette",
        "timestamp": 1643876530
    },
    {
        "content": "<p>Ok, konkret dafür würde ich jetzt wieder auf das Onko Modul verweisen, das dem aktuellen Stand nach Bioproben referenzieren wird :) Ich möchte das Einfügen eines Fall-Kontextes jetzt nicht kategorisch ablehnen, aber da das keine ganz triviale Sache ist wäre ein Anwendungsfall, den man dann in die Diskussion auch mit den Biobankern einbringen könnte, sehr hilfreich. Vor allem müsste man dann auch evaluieren wie viele Biobanken den Fall Kontext überhaupt kennen, je nach lokaler Struktur ist die Trennung zwischen Biobankendaten und \"Versorgungsdaten\" wohl recht strikt.</p>",
        "id": 270514576,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1643877225
    },
    {
        "content": "<p>Die Trennung von Biobankdaten und Versorgungsdaten ist ein guter Punkt. Nichtdestotrotz ist es bei vielen meiner Studien so, dass zur Eingrenzung des Kontextes eines Faktes (wie hier eines Biosamples) anstatt eines temporalen Intervalles um den Erhebungszeitpunktum des Faktes sehr gerne der dazugehörige Fallkontext genommen wird. Das bringt natürlich wieder andere Probleme mit sich, liegt aber im Ermessen des Anfragenden Forschers diesen Weg zu wählen. Dies gilt eigentlich für alle Daten.</p>",
        "id": 270521391,
        "sender_full_name": "Georg Fette",
        "timestamp": 1643881067
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"196537\">Georg Fette</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BBIOBANK.5D.20Verbindung.20zum.20Fall/near/270521391\">said</a>:</p>\n<blockquote>\n<p>, liegt aber im Ermessen des Anfragenden Forschers diesen Weg zu wählen.</p>\n</blockquote>\n<p>Wenn dann aber nur 20% der Standorte den Fall-Kontext haben und die Anfrage beantworten können hat man halt leider wieder wenig gewonnen.... Den Zeitpunkt müssen aufgrund des 1..1 alle haben (und den haben - zumindest den Rückmeldungen folgend- idR auch alle) . Aber ich kann das gerne mitnehmen für eine 2.0 Version und dann schauen, was für Rückmeldungen aus der Biobanken-Szene kommen.</p>",
        "id": 270524203,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1643882452
    }
]