[
    {
        "content": "<p>Kurzer Hinweis zum Start des MII-Projectathon:<br>\nEinige Personen weisen derzeitig darauf hin, dass die Beispiele im Simplifier Projekt für die Diagnose \"kaputt\" oder \"falsch\" seien, da der .NET FHIR-Validator hier Fehler ausgibt. Beispielsweise: \"<a href=\"https://simplifier.net/medizininformatikinitiative-moduldiagnosen/condition-example/$validate\">https://simplifier.net/medizininformatikinitiative-moduldiagnosen/condition-example/$validate</a>\"</p>\n<p>Das hat verschiedene Gründe:<br>\n1) Das Simplifier-Projekt ist derzeitig nicht an einen externen Terminologie-Server angeschlossen, d.h. nur expandierte ValueSets welche auf Simplifier hochgeladen wurden, werden bei der Validierung berücksichtigt. In jedem ImplementationGuide wird im Abschnitt \"Terminologie\" darauf hingewiesen, dass nicht für alle CodeSystem ein separates ValueSet publiziert wird. Alle CodeSysteme enthalten jedoch ein implizites  ValueSet (siehe CodeSystem.valueSet). Falls eine Implementierung ein explizites ValueSet benötigt, da die Validierung ansonsten lokal nicht funktioniert, müsste dieses manuell angelegt werden (left as an exercise to the reader...).</p>\n<p>2) Fallback ICD-10 CodeSystem: Für die Validierung von ICD-10-GM Codes muss ein Terminologie-Server bereitgestellt werden, welcher die Kreuz-Stern-Notation mit all ihren Ausnahmen kennt und unterstützt. Derzeitig wird als FHIR-CodeSystem nur der aktuelle 2020 Katalog publiziert. Da kein zugehöriges ValueSet veröffentlicht wird (weitere Jahresversionen müssten bei Bedarf angefragt werden und in einem ValueSet zusammengeführt werden) erfolgt ein Fallback auf ein Test-CodeSystem aus den deutschen Basisprofilen: <a href=\"https://simplifier.net/packages/de.basisprofil.r4/0.9.6/files/129525\">https://simplifier.net/packages/de.basisprofil.r4/0.9.6/files/129525</a>. Hier finden sich jedoch nur eine handvoll Test-Codes. Somit meckert der FHIR-Validator einen an, dass ein Code, obwohl dieser valide ist, nicht im ValueSet gefunden werden kann.</p>\n<p>TLDR: Die Beispiele erstellt von <span class=\"user-mention\" data-user-id=\"237806\">@Miriam Hübner</span> sind korrekt, für die ICD-10 / OPS Validierung braucht man jedoch gute Terminologie-Server</p>\n<p><span class=\"user-mention\" data-user-id=\"195372\">@Matthias Löbe</span> Wie möchte die MII dies übergreifend lösen? Gibt es dazu schon Ideen?</p>",
        "id": 200015768,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1591521623
    },
    {
        "content": "<p>Eine übergreifende Lösung ist mir derzeit nicht bekannt. Jedes Konsortium hat in Eigenregie Terminologieserver angeschafft. Ich werde aber das Problem auf eine virtuelle Liste aufnehmen, dafür machen wir ja die Projektathons.</p>",
        "id": 200121470,
        "sender_full_name": "Matthias Löbe",
        "timestamp": 1591632985
    }
]