[
    {
        "content": "<p>Wenn Condition.code.coding mit dem Slice für ICD10 befüllt wird, sind verschiedene Extensions vorgesehen.<br>\nDie Kernfrage ist: Gibt es ein Mapping von HL7v2 auf diese Extensions, bzw. gibt es überhaupt einen Ort, wo in HL7v2 die Inhalte dieser Extensions gespeichert werden können?<br>\nWenn nicht, sind dann Inhalte der Extensions mit Bestandteilen des ICD10-Kodes redundant? (Ich bin gerade erst dabei mich in die Besonderheiten von ICD10-GM einzulesen, hoffe also, dass die Frage nicht zu unsinnig ist.)</p>",
        "id": 221923775,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1610013796
    },
    {
        "content": "<p>Außerdem ist mir nicht klar: Welche Inhalte sollen die Extensions für ICD-10 Kodes genau haben? Wenn ich also z. B. Beispiel-/Testressourcen erstellen möchte, was darf/sollte ich in die Extensions schreiben?</p>",
        "id": 221924395,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1610014312
    },
    {
        "content": "<p>Die v2 Frage kann ich leider nicht beantworten, aber wenn es um die Extensions wie hier <a href=\"http://ig.fhir.de/basisprofile-de/stable/Diagnosen.html\">http://ig.fhir.de/basisprofile-de/stable/Diagnosen.html</a> beschrieben geht, dann enthalten die Extensions die einzelnen Bestandteile des kompletten ICD-10-GM Codes, der in code eingetragen ist. Also quasi die \"aufgesplitteten\" Teile des Codes. Details stehen auch in den Beschreibungen der Extensions. <a href=\"http://ig.fhir.de/basisprofile-de/stable/BeispielICD-CodemitAusrufezeichen-Notation.html\">Hier</a> ist auch ein Beispiel.</p>",
        "id": 221937752,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1610023861
    },
    {
        "content": "<p>Danke! Insbesondere die Beispiele sind sehr hilfreich.</p>",
        "id": 221945577,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1610028785
    },
    {
        "content": "<p>Wahrscheinlich ist die v2-Frage damit auch schon beantwortet, da dann die Gesamtheit der Kodes vermutlich in DG1.3.1 stehen sollte, und zum Aufteilen in die FHIR-Extensions nur noch geparst werden muss. Ein Bestätigung, ob das tatsächlich so beabsichtigt ist, wäre natürlich trotzdem schön...</p>",
        "id": 221946703,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1610029414
    },
    {
        "content": "<p>Eine Nachfrage zu den Beispielen: Dort wird die url \"<a href=\"http://fhir.de/StructureDefinition/icd-10-gm-haupt-kreuz\">http://fhir.de/StructureDefinition/icd-10-gm-haupt-kreuz</a>\" für die Erweiterungen benutzt. Diese ist aber im Simplifier (<a href=\"https://simplifier.net/MedizininformatikInitiative-ModulDiagnosen/Diagnose/~overview\">https://simplifier.net/MedizininformatikInitiative-ModulDiagnosen/Diagnose/~overview</a>) im Diagnoseprofil nicht zu finden. Sind die Beispiele veraltet, oder fehlt im Simplifier etwas?</p>",
        "id": 221953339,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1610032464
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256468\">Abel Stolz</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BDIAGNOSE.5D.20ICD10-extensions/near/221946703\">said</a>:</p>\n<blockquote>\n<p>Wahrscheinlich ist die v2-Frage damit auch schon beantwortet, da dann die Gesamtheit der Kodes vermutlich in DG1.3.1 stehen sollte, und zum Aufteilen in die FHIR-Extensions nur noch geparst werden muss. Ein Bestätigung, ob das tatsächlich so beabsichtigt ist, wäre natürlich trotzdem schön...</p>\n</blockquote>\n<p>Genau so ist es. Wobei das \"Zerlegen\" eines postkoordinierten Codes in seine Einzelteile und die Verwendung der Extensions freiwillig ist. Das Profil sagt sinngemäß nur: Wenn ihr das unbedingt Zerlegen wollt, dan macht das bitte mot diesen Extensions.<br>\nICD selbst verlangt das eigentlich nicht. Ein Postkoordinierter Code ist <em>ein</em> Code. Allerdings gibt es einige Austauschformate (§301/21) bei denen postkoordinierte Codes immer in der aufgedröselten Form übermittelt werden, weshalb vermutlich einige Systeme die Verwendung der Extensions implementieren werden...</p>",
        "id": 222068418,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1610110328
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256468\">Abel Stolz</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BDIAGNOSE.5D.20ICD10-extensions/near/221953339\">said</a>:</p>\n<blockquote>\n<p>Eine Nachfrage zu den Beispielen: Dort wird die url \"<a href=\"http://fhir.de/StructureDefinition/icd-10-gm-haupt-kreuz\">http://fhir.de/StructureDefinition/icd-10-gm-haupt-kreuz</a>\" für die Erweiterungen benutzt. Diese ist aber im Simplifier (<a href=\"https://simplifier.net/MedizininformatikInitiative-ModulDiagnosen/Diagnose/~overview\">https://simplifier.net/MedizininformatikInitiative-ModulDiagnosen/Diagnose/~overview</a>) im Diagnoseprofil nicht zu finden. Sind die Beispiele veraltet, oder fehlt im Simplifier etwas?</p>\n</blockquote>\n<p>Das <a href=\"http://ig.fhir.de/basisprofile-de/stable/BeispielICD-CodemitAusrufezeichen-Notation.html\">Beispiel</a> dürfte veraltet sein, wir hatten m.W.  die Extensions kürzlich umbenannt... <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> ...?</p>",
        "id": 222068668,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1610110528
    },
    {
        "content": "<p>Korrekt, das Beispiel ist veraltet.</p>",
        "id": 222073903,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1610113925
    },
    {
        "content": "<p>Dankeschön. Ich denke, damit sind alle Fragen beantwortet.</p>",
        "id": 222266480,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1610350334
    },
    {
        "content": "<p>In den P21-Daten kommen Primär- und Sekundärdiagnosen vor, jeweils mit Seitenlokalisation und Diagnosesicherheit.<br>\nWenn ich z.B. Folgendes in P21 finde:<br>\n<a href=\"/user_uploads/10155/O3FFWDfk_sMIrTZ8mqTJHLbQ/image.png\">image.png</a><br>\nWie wird das in der Condition-Ressource abgebildet? Ich dachte bisher, die Kodes werden zu einem einzigen Kode zusammengefasst, also im Beispiel \"I10.00 Y84.9!\", und dann in ein coding geschrieben, wobei ich wahlweise die extensions für verschiedenen Kodetypen (Ausrufezeichen, Manifestation, Primär) mit den Einzelkodes befülle. Allerdings gibt es dann jeweils nur eine Möglichkeit, Seitenlokalisation und Diagnosesicherheit einzutragen, funktioniert also nicht.<br>\nAlso müsste ich zwei codings anlegen. Ist das richtig? Was schreibe ich jeweils in die beiden codings rein?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/O3FFWDfk_sMIrTZ8mqTJHLbQ/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/O3FFWDfk_sMIrTZ8mqTJHLbQ/image.png\"></a></div>",
        "id": 227948531,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1614355440
    },
    {
        "content": "<p>Das ist leider gerade ein offenes Problem. <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> ist genau da auch schon reingelaufen. Wir sind im Austausch mit der KBV um eine Empfehlung zu erarbeiten.</p>",
        "id": 227957615,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1614358981
    },
    {
        "content": "<p>Super, dass schon dran gearbeitet wird. Freue mich, dann zu erfahren, wie es gelöst wurde!</p>",
        "id": 228189370,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1614582487
    },
    {
        "content": "<p>Josef Schepers:<br>\nIch kann darauf hinweisen, dass die Kassenärztliche Bundesvereinigung wenig mit DRGs zu tun hat. Die DRGs sind nämlich die Abrechnungsform des Stationären Sektors, in dem die Krankenhäuser direkt (einstufig) mit den Krankenkassen abrechnen. <br>\nIm Unterschied dazu erfolgt im GKV-Teil des ambulanten Sektors die Honorierung zweistufig. Dort bekommen die 17 Kassenärztlichen Vereinigungen in jedem Bundesland (NRW hat 2) das Geld von den Kassen und verteilen es (nach Abzug der Funktionärsgehälter) an die Kassenärzte in ihrem Gebiet. Im ambulaten Sektor ist es üblich zu den Diagnosen Diagnosesicherheiten anzugeben. Pro \"Schein\" gibt es aber meisten nur eine Diagnose mit einer Sicherheit.</p>\n<p>Für den Entgeltbereich DRG und PSY im stationären Sektor werden zu den Diagnosen keine Diagnosesicherheiten angegeben. Die Felder bleiben leer.<br>\nEine Sonderstellung nehmen die Psychiatrischen Institutsambulanzen ein. Für diese können bei Diagnosen Diagnosesicherheiten  angegeben werden. Diesbezüglich schlage ich Euch aber vor, Kontakt zum InEK in Bad Siegburg aufzunehmen. Dort laufen die Datensätze gemäß § 21 KHEntgG zusammen und dort werden die Regeln gemacht. Kommt es tatsächlich vor, dass die Diagnosesicherheiten von PD und SD in den PIAs verschieden sind? Kommt mir blödsinnig vor.<br>\nNicht missverstehen: zwischen Fällen (= Einrichtungskontakte im MII KDS) und Diagnosen (Conditions)  besteht eine 1:n-Beziehung und natürlich können Fälle in den PIAs verschiedene Diagnosen mit verschiedenen Sicherheiten haben. Dafür gibt es dann aber neue Zeilen.</p>\n<p>Habt Ihr auch Probleme mit unterschiedlichen Seitenlokalisationen von Primär- und Sekundärdiagnose? Ihr könntet auch diesbezüglich mal in Bad Siegburg nachfragen, ob es in einem der jährlich 20 Millionen dort eingereichten Datensätze vorkommt, dass die Seitenlokalisationen bei PD und SD verschieden sind.</p>",
        "id": 232344232,
        "sender_full_name": "Josef Schepers",
        "timestamp": 1617055900
    },
    {
        "content": "<p>Weitere Diskussion hierzu bitte in <a href=\"#narrow/stream/179183-german-.28d-a-ch.29/topic/Breaking.20Change.3A.20Condition\">https://chat.fhir.org/#narrow/stream/179183-german-.28d-a-ch.29/topic/Breaking.20Change.3A.20Condition</a></p>",
        "id": 233622676,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1617872791
    }
]