[
    {
        "content": "<p>Dokumentationsdatum und klinisch relevanter Zeitraum sind momentan verpflichtend im Diagnose-Profil. Im Rahmen von Studien habe ich die Informationen evtl. aber nicht, z.B. <em>Patient hat Diabetes ja/nein</em>. Könnten wir für Condition.(onset[x]|recordedDate) wieder auf [0..1] gehen?</p>",
        "id": 199639863,
        "sender_full_name": "Julian Sass",
        "timestamp": 1591200599
    },
    {
        "content": "<p>Condition.onset[x] verstehe ich. Aber wieso ist recordedDate nicht verfügbar?</p>",
        "id": 199642517,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1591201741
    },
    {
        "content": "<p>Ah ich ging davon aus, recordedDate sei hier Datum der Erst-Dokumentation. Jetzt nochmal im IG nachgelesen. Alles ok, dann könnte man recordedDate auf das Datum setzen, wann bspw. die Condition für ein CRF erfasst wurde.</p>",
        "id": 199646209,
        "sender_full_name": "Julian Sass",
        "timestamp": 1591203459
    },
    {
        "content": "<p>Bewegen wir uns dann aber hier nicht im Grenzbereich zur Observation?</p>",
        "id": 199656974,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1591208504
    },
    {
        "content": "<p>Ja naja, es handelt sich dabei immernoch um diagnostizierte Erkrankungen, da würde ich ungern vom Konzept der Condition abweichen. Für den UseCase scheint primär clinicalStatus relevant und weniger der genaue Zeitpunkt/-raum. Vorschlag daher nur Condition.onset[x] auf 0..1 zu ändern.</p>",
        "id": 199674850,
        "sender_full_name": "Julian Sass",
        "timestamp": 1591217391
    },
    {
        "content": "<p>Wie ist die Meinung der anderen Modulbeteiligten? Wäre eine Änderung von onset im current build möglich?<br>\n<a href=\"https://simplifier.net/medizininformatikinitiative-moduldiagnosen/~issues/828\">https://simplifier.net/medizininformatikinitiative-moduldiagnosen/~issues/828</a></p>",
        "id": 201020193,
        "sender_full_name": "Julian Sass",
        "timestamp": 1592316517
    },
    {
        "content": "<p>Im IG finde ich immer noch die Angabe zu Dokumentationsdatum und Feststelldatum. Das RecordedDate entspricht m.E. dem Dokumentationsdatum. Soll das onsetDateTime das Feststelldatum sein? Das ist doch eigentlich auch ein Unterschied...</p>",
        "id": 201027688,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1592319503
    },
    {
        "content": "<p>Ja auf jeden Fall ein Unterschied, recordedDate ist das Dokumentationsdatum und onsetDateTime das Feststellungsdatum bzw. kann auch der klinisch relevante Zeitraum sein.</p>",
        "id": 201032866,
        "sender_full_name": "Julian Sass",
        "timestamp": 1592321524
    },
    {
        "content": "<p>Dann ist das \"Feststelldatum\" rausgeflogen oder habe ich es nur nicht mehr gefunden?</p>",
        "id": 201033994,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1592322061
    },
    {
        "content": "<p>Im Diagnose-Profil ist es drin: Condition.onset[x]:onsetDateTime</p>",
        "id": 201034652,
        "sender_full_name": "Julian Sass",
        "timestamp": 1592322341
    },
    {
        "content": "<p>Das meinte ich, also setzen wir Feststellung mit \"Onset\" gleich (eigentlich gibt es ja 3 Daten: Auftreten, Feststellung, Dokumentation). Bsp.: Eine Patientin hat seit 5 Jahen Diabetes (unentdeckt, aber anamnestisch \"gesichert\", also klassische Symptome), vor 4 Jahren wurde die Diagnose bei der Hausärztin gestellt, vor 2 Wochen bei uns im KH erstmalig dokumentiert. Ich bin kein FHIR-Experte, wenn es erst formal eine \"Condition\" ist, wenn es eine formale Diagnosestellung gibt, dann passt alles. Ansonsten bräuchte man <em>theoretisch</em> noch ein weiteres Datum...</p>",
        "id": 201035267,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1592322595
    },
    {
        "content": "<p>ob man das <strong>praktisch</strong> braucht, ist eine andere Frage...</p>",
        "id": 201035346,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1592322617
    },
    {
        "content": "<p>Ich kann mir nicht vorstellen, dass das \"Auftreten\" (\"unentdeckt, aber anamnestisch gesichert\") in einem System strukturiert vorliegt, da es ja nie ein konkretes Datum sondern immer eine geschätzte Vermutung sein wird.<br>\nKlar, man kann in FHIR partielle Daten angeben. Aber dennoch riecht \"Patientin hatte zum Erstdiagnosezeitpunkt schon seit etwa einem Jahr typische Symptome\" am ehesten nach Annotation.</p>",
        "id": 201049164,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1592328923
    },
    {
        "content": "<p>Wie würde ich dann die Fraktur von \"Sturz am 26.12.2019, Vorstellung am 1.1. bei ausbleibender Besserung, Röntgen im Dienst: Fraktur, Diagnosedokumentation am 2.1. durch Dokumentarin.\" ablegen? Da ist ja das Datum der Diagnose (Sturz) ein anderes als das der Diagnosestellung per Bildgebung und das wieder ein anderes als das der Dokumentation. Die Unterschiede der Daten haben aber doch eine gewisse Relevanz (Verspätete Diagnosestellung um 6 - nicht um 7 - Tage).</p>",
        "id": 201103535,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1592372593
    }
]