[
    {
        "content": "<p>Bei unseren Mappingüberlegungen der SAP Daten auf die 3 Fallebenen sind uns folgende Schwierigkeiten aufgefallen:</p>\n<ol>\n<li>Die SAP Bewegungsdaten bieten bei uns jeweils einen Beginn-Zeitstempel, jedoch keinen Ende-Zeitstempel. Mit welchem Wert soll Encounter.period.end befüllt werden?</li>\n<li>Wie geht man mit Bewegungen um, die „punktuell“ sind, wie z.B. ambulante Besuche (die meist ohne Dokumentation z.B. zum Quartalsende enden)? Uns ist bewusst, dass dies noch nicht Teil des einfachen Aufbaumodells ist, aber vielleicht gibt es hierzu schon Gedanken.</li>\n<li>Aus den SAP Daten ließen sich Einrichtungskontakte und Versorgungsstellenkontakte direkt ableiten, die Abteilungskontakt-Ebene müssten wir „künstlich“ erzeugen. Eine Überlegung war dabei 1 Versorgungsstellenkontakt = 1 Abteilungskontakt anzulegen. Würde gegen diese Handhabung etwas sprechen?</li>\n<li>Prozeduren werden in SAP vorwiegend fallbezogen (Einrichtungskontakt), aber z.T. auch bewegungsbezogen (Versorgungsstellenkontakt) dokumentiert. Wie geht man mit den fallbezogenen Prozeduren um, wenn man hier keine Referenz auf den Versorgungsstellenkontakt herstellen kann?</li>\n</ol>\n<p>Wir haben zu allen Schwierigkeiten schon Lösungsideen, möchte hiermit aber nachfragen, ob auch andere Standorte schon die gleichen Schwierigkeiten feststellen konnten und ggf. welche Lösungen schon gefunden wurden. Wir freuen uns auf Rückmeldungen!</p>",
        "id": 274518695,
        "sender_full_name": "Stefanie Schild",
        "timestamp": 1646733767
    },
    {
        "content": "<p>Hier ein friendly reminder, ob jemand auf ähnliche Schwierigkeiten gestoßen ist?<br>\nFolgende Lösungsideen haben wir diskutiert:</p>\n<ol>\n<li>Wir nehmen als Ende-Zeitstempel jeweils den Beginn-Zeitstempel der nachfolgenden Bewegung. Bei der „letzten“ Bewegung, dann das Entlassdatum vom Einrichtungskontakt. Das funktioniert so voraussichtlich für stationäre Bewegungen. Bei der Stornierung einer einzelnen Bewegung müssten man eventuell nochmal alle Kontakte neu bauen. Problematisch wird das wahrscheinlich, wenn man diese Taktik zukünftig z.B. auf vorstationäre/nachstationäre Besuche übertragen möchte, die auch außerhalb des Einrichtungskontakt Zeitraumes liegen.</li>\n<li>Man könnte jeweils das Quartalsende „manuell“ berechnen. Wir sind uns nur nicht schlüssig, ob es besser ist, einen Wert in die Ressource zu schreiben, der so nie tatsächlich dokumentiert wurde, oder für alle ambulanten Fälle dann eine Data Absent Reason einzufügen.</li>\n<li>Das wäre auf diese Art aktuell wahrscheinlich die einfachste Lösung. Allerdings hat man dann natürlich keine „mehrere-Versorgungsstellenkontakte-übergreifenden“ Abteilungskontakte, welche vermutlich häufig für Auswertungen interessant sind.</li>\n<li>Der Einrichtungskontakt referenziert alle Prozeduren. Prozeduren enthalten keine Referenz mehr auf einen Encounter, nur falls explizit ein Versorgungsstellenkontakt dokumentiert wurde.</li>\n</ol>",
        "id": 275820088,
        "sender_full_name": "Stefanie Schild",
        "timestamp": 1647618061
    },
    {
        "content": "<p>Zu 2.) Ambulante Fälle enden m.W. normalerweise immer spätestans nach 24h. Der \"Quartalsfall\" ist ja ein reinies Abrechnungskonstrukt und wäre als solches in FHIR über den Account repräsentiert (Account dauert von Beginn bis Ende des Quartals, alle Encounter, die im Quartal gemeinam abgerechnet werden, verweisen auf diesen Account). Aber das wäre im MI-I Modell meines Wissens Out-Of-Scope</p>",
        "id": 276036654,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647862131
    },
    {
        "content": "<p>zu 4.) Die Referenz von Encounter.diagnosis auf Procedure/Condition dient eigentlich nur dazu, einzelne Procedures oder Conditions in einem Fallkontext zu <em>qualifizieren</em> (\"Aufnahmediagnose\", \"Hauptprozedur\" o.ä.\"). Der generische \"Fallkontext\" ergibt sich aus der Referenz von  Procedure auf Encounter. Bei der Diskussion des Encounter-Modells in ISiK wurde uns (u.a. auch von SAP) das Feedback gegeben, dass die Verlinkung von medizinischen Daten nur auf Ebene des Abteilungskontaktes oder Versorgungsstellenkontaktes vorkommen kann, nicht auf Einrichtungskontaktebene, da mindestens eine verantwortliche Fachabteilung benannt sein muss.</p>",
        "id": 276037454,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647862675
    },
    {
        "content": "<p>Der Umgang mit fehlendem Enddatum bei ambulanten Besuchen z.B. innerhalb stationärer Fälle müsste m.E. trotzdem dringend konsentiert werden. Wir können diese Bewegungen nie auf Encounter.status = finished setzen, wenn wir da kein Enddatum einfügen. Das verhindert dann aber sinnvolle Auswertungen. Wir setzen daher Startdatum = Enddatum, zusätzliche Daten können wir nicht erfinden.</p>",
        "id": 276172604,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1647947740
    },
    {
        "content": "<p>…oder jemand entfernt die Constraint \"mii-enc-1\" aus dem Profil (falls der Encounter abgeschlossen wurde muss ein Enddatum bekannt sein) 😉</p>",
        "id": 276173615,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1647948346
    }
]