[
    {
        "content": "<p>Ich setze mich gerade mit den Ebenen des Falles auseinander. Oben steht:</p>\n<blockquote>\n<p>Proaktiv umgesetzt werden im Einfachen Aufbaumodell zunächst nur die Einrichtungskontakte, die durch die Aufnahmen und Entlassungen von „Krankenhausfällen“ definiert sind, und eine definierte Auswahl von Versorgungsstellenkontakten – so wie sie für die Mehrheit der Use Cases benötigt werden. Die Abteilungskontakte können aus den Versorgungsstellenkontakten, die Angaben zur verantwortlichen Abteilung beinhalten, hergeleitet werden.</p>\n</blockquote>\n<p>Das verstehe ich so als seinen die Versorgungsstellenkontakte das wichtigere und die Abteilungskontakte eher \"Platzhalter\".<br>\nAber weiter unten steht</p>\n<blockquote>\n<p>Im Einfachen Aufbaumodell ist die Darstellung des Versorgungsstellenkontaktes optional. Die abstrakte OE „Ärztlicher Stationsdienst“ der bettenführenden Fachabteilungen kann wegen der 1:1 Beziehung zur Fachabteilung integriert in den Abteilungskontakt berücksichtigt werden.</p>\n</blockquote>\n<p>Jetzt bin ich verwirrt. Kann im einfachen Aufbaumodell nur mit zwei Ebenen (Einrichtungskontakt und Abteilungsfall) gearbeitet werden? oder soll man immer einen \"Dummy-Versorgungstellenkontakt\" „Ärztlicher Stationsdienst“ anlegen? Wie ist dabei die erste Aussage zu verstehen?</p>\n<p>Und darf ich die Aufnahme/Entlassangaben aus P21 wie im Beispiel über alle Ebenen verteilen? Oder wird das final erst im Ausbaumodell geklärt?</p>",
        "id": 231762271,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1616660658
    },
    {
        "content": "<p>Die Aufbau und Entlassgründe würde ich nur auf der obersten Ebene im Einrichtungskontakt angeben. Das Ebenenkonzept ist erstmal optional, deshalb würde ich davon ausgehen, dass einige Systeme nur diese Ebene verarbeiten können.</p>",
        "id": 231762961,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1616661060
    },
    {
        "content": "<p>Ich hätte gesagt, wenn der Versorgungsstellenkontakt keine weiteren Informationen beinhaltet, dann muss man keinen Dummy anlegen</p>",
        "id": 231763257,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1616661228
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span> Wie siehst du das?</p>",
        "id": 231763333,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1616661255
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193430\">Alexander Zautke</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BFALL.5D.20Einfaches.20Aufbaumodell/near/231763333\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"196447\">Andrea Essenwanger</span> Wie siehst du das?</p>\n</blockquote>\n<p>Seh ich genauso, die Stelle ist tatsächlich etwas unglücklich formuliert. Es soll wirklich so sein, dass solange der Versorgungsstellenkontakt nicht benötigt wird, dass es ausreichen sollte den Abteilungskontakt zu benutzen. Beim einfachen Aufbaumodell ist es sogar eher so gedacht, dass man erstmal nur eine 1:1-Beziehung zwischen dem Abteilungs- und dem Versorgungsstellekontakten abbilden braucht, wenn man diese Kontaktebene verwenden möchte. Alles weitere kommt erst mit dem komplexen Ausbaumodell. (<span class=\"user-mention\" data-user-id=\"197535\">@Josef Schepers</span> korrigieren oder ergänzen, falls ich was vergessen haben sollte <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 231817663,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1616684706
    },
    {
        "content": "<p>Sehe ich es richtig, dass Diagnosen in diesem Fall \"in der Luft hängen\" (bzw. frei am Patienten, ohne Fall) weil sie höchstens auf den optionalen Versorgungsstellenkontakt referenzieren würden?</p>",
        "id": 231821100,
        "sender_full_name": "Marvin Kampf",
        "timestamp": 1616685698
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"196715\">Marvin Kampf</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BFALL.5D.20Einfaches.20Aufbaumodell/near/231821100\">said</a>:</p>\n<blockquote>\n<p>Sehe ich es richtig, dass Diagnosen in diesem Fall \"in der Luft hängen\" (bzw. frei am Patienten, ohne Fall) weil sie höchstens auf den optionalen Versorgungsstellenkontakt referenzieren würden?</p>\n</blockquote>\n<p>Nein, die Diagnosen werden vom Encounter referenziert, der auch bestimmen kann, was für eine Art Diagnose wir haben (Bsp. Haupt-, Nebendiagnose), und hängen somit nicht in der Luft. Die Referenz ist nur andersherum als wir es von den heutigen Systemen gewohnt sind.</p>",
        "id": 231947728,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1616757286
    },
    {
        "content": "<p>Oh, da muss ich ein Votum einlegen!</p>\n<p>Die Verknüpfung klinischer Ressourcen zu einem Aufenthalt geschieht in erster Linie über das context -Element.<br>\nEin Diagnose, Prozedur, Medikation etc. sollte also immer mit einem Encounter verknüpft sein. Über diesen Link erfolgt auch die Zuordnung der Klinischen Informationen zu einem Encounter-Compartment (=\"Fallakte\").</p>\n<p>Der \"Rückwärts-Link\" vom Encounter auf die Diagnose dient nur dazu, einzelnen Diagnosen eine besondere Relevanz zu geben (Ranking, Haup-/Nebendiagnose). Dies ist jedoch hauptsächlich für den Abrechnungskontext relevant und wird daher von klinischen Systemen tendentiell kaum Beachtung finden. Es wird bei HL7 momentan sogar darüber diskutiert, die Qualifikation der Diagnosen über den Account und nicht den Encounter vorzunehmen, da es sich ja eigenltich um Abrechnungsdaten handelt.</p>\n<p>tl;dr: <br>\nDer Link von Condition/Procedure/Observation.context auf Encounter sollte <em>immer</em> gesetzt werden, der Backlink von Encounter zu Condition ist zweitrangig.</p>",
        "id": 231954616,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1616761261
    },
    {
        "content": "<p>OK, das ist aber ein ganz schöner Wechsel vom bisherigen Modell in der MII... (In der ersten Version von Diagnose war Condition -&gt; Encounter ja sogar noch verboten..) Wie geht man dann mit chronischen Krankheiten um? Also auf welches Encounter verweist z.B. der chronische Diabetes?</p>",
        "id": 231957589,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1616762826
    },
    {
        "content": "<p>Sorry, ich habe etwas zu sehr verallgemeinert. Encounter.context ist kein Pflichtfeld. Was ich meinte war: <em>Wenn</em> eine Diagnose einen Fall-Kontext hat, sollte context immer gefüllt sein...</p>",
        "id": 231960386,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1616764025
    },
    {
        "content": "<p>Ich denke, dass Systeme die Query \"zeige mit alle Diagnosen zum Fall XY\" stets mit /Condition?context=xy abfragen wollen würden (analog zu Procedure, Observation etc.)</p>\n<p>Würde man dafür den Backlink vom Encounter verwenden, müsste man mit reverse chaining arbeiten, also /Condition?_has:Encounter:diagnosis:_id=xy.  </p>\n<p>...das erscheint mir deutlich obskurer...</p>",
        "id": 231961631,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1616764532
    },
    {
        "content": "<p>(Wurde im MII-Projectathon so gemacht mit Reverse-Chaining..) Aber dann läuft man halt in das Problem mit chronischen Conditions. Der Diabetes ist ja mgl. in meheren Fällen relevant, aber es ist ja immer der gleiche und kein neuer? Ich habe dazu in der Spec gerade nichts gefunden. Das ist mit den Referenzen von Encounter -&gt; Condition halt kein Problem.</p>",
        "id": 231972823,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1616768683
    },
    {
        "content": "<p>Immer Kümmererteam hatten wir Condition.encounter immer als den Kontext angesehen in dem die Condition festgestellt wird</p>",
        "id": 231975094,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1616769440
    },
    {
        "content": "<p>Deshalb die Aussage von <span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span> in den meisten Fällen weiß ich es nicht und lasse den Encounter auf die Condition zeigen (auf Basis der Abrechnungsdaten o.Ä.)</p>",
        "id": 231975316,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1616769505
    },
    {
        "content": "<p>In diese Richtung kann ich dann auch die Diabetes allein stehen lassen (weil kein Kontext wirklich existiert) + Encounter auf Condition zeigen lassen da diese für den Encounter als Nebendiagnose relevant ist</p>",
        "id": 231975569,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1616769595
    },
    {
        "content": "<p>Werden chronische Diagnosen aber nicht in der Praxis für jeden Fall immer wieder neu dokumentiert (mit jeweils aktuellem recorded Zeitstempel)? Ich erinnere mich vage an solche Fehlermeldungen wie \"Das Diagnosedatum darf nicht ausserhalb des Aufenthaltsdatums liegen\" aus KISsen, was das Diagnosen-Recycling ja von vorne herein ausschließen würde...</p>",
        "id": 231987594,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1616773759
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193430\">Alexander Zautke</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BFALL.5D.20Einfaches.20Aufbaumodell/near/231762961\">said</a>:</p>\n<blockquote>\n<p>Die Aufbau und Entlassgründe würde ich nur auf der obersten Ebene im Einrichtungskontakt angeben. Das Ebenenkonzept ist erstmal optional, deshalb würde ich davon ausgehen, dass einige Systeme nur diese Ebene verarbeiten können.</p>\n</blockquote>\n<p>Hallo, dann habe ich glaube einen Fehler in den MII-Beispielen gefunden. Im Beispiel Abteilungskontakt unter \"<a href=\"https://www.medizininformatik-initiative.de/Kerndatensatz/Modul_Fall/EncounterKontaktGesundheitseinrichtung.html\">https://www.medizininformatik-initiative.de/Kerndatensatz/Modul_Fall/EncounterKontaktGesundheitseinrichtung.html</a>\" wird dann u.a. die Hospitalization angebeben, die eine Ebene höher angesiedelt sein sollte.  In dem genannten Beispiel fehlt dann entsprechend auch der serviceType, oder wird das durch den ServiceproviderID abgebildet?</p>",
        "id": 233301875,
        "sender_full_name": "Jan Maluche",
        "timestamp": 1617708050
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"265219\">@Jan Maluche</span> Danke für die Hinweise! Da scheint unser CORD-MI Converter mist gebaut zu haben, ich passe das manuell an und gebe die Infos bei uns weiter <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 233440222,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1617778736
    },
    {
        "content": "<p>Also ja, da gehört die Hospitalization gar nicht hin und auch der ServiceType sollte mit rein <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 233440270,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1617778780
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span>  vielen Dank :)</p>",
        "id": 233442234,
        "sender_full_name": "Jan Maluche",
        "timestamp": 1617779318
    },
    {
        "content": "<p>Hallo, beim Validieren im Simplifier erhalte ich den folgenden Fehler bei den Abteilungskontakten. So wie ich das bisher verstanden hatte ist dieser Encounter ja nur ein SubEncounter vom Einrichtungskontakt, welcher zwar PartOf Einrichtungskontakt ist, aber keine angehangenen Diagnosen haben sollte?<br>\nMit der Erklärung von <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  müsste zusätzlich noch der Constraint aufgehoben sein, wenn der Link Encounter-&gt;Condition nur Optional ist?</p>\n<div class=\"codehilite\"><pre><span></span><code>Instance failed constraint mii-enc-2 &quot;Falls der Encounter abgeschlossen wurde muss eine Diagnose bekannt sein&quot;\n</code></pre></div>",
        "id": 233819394,
        "sender_full_name": "Jan Maluche",
        "timestamp": 1617974489
    },
    {
        "content": "<p>Der Constraint sollte aufgehoben werden, bitte 1x ein Issue im Simplifier Projekt aufmachen, dann berücksichtigen wir das Problem beim nächsten Update</p>",
        "id": 233829608,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1617978296
    },
    {
        "content": "<p>Das ganze war für den Einrichtungskontakt gedacht, aber da die Kontaktebenen nun optional sind, können wir das nicht einschränken</p>",
        "id": 233829759,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1617978360
    },
    {
        "content": "<p>Ist erledigt</p>",
        "id": 233833697,
        "sender_full_name": "Jan Maluche",
        "timestamp": 1617979654
    },
    {
        "content": "<p>Für mich ergeben sich aus der Diskussion oben folgende Fragen:<br>\nIm Profil für den Encounter steht derzeit</p>\n<div class=\"codehilite\"><pre><span></span><code>mii-enc-2:Falls der Encounter abgeschlossen wurde muss eine Diagnose bekannt sein\nstatus = &#39;finished&#39; implies diagnosis.exists()\n</code></pre></div>\n<p>Andersherum soll Condition immer Encounter referenzieren. Als ich beide Referenzen bei uns am Standort implementiert hatte, war einer unserer FHIR-Server unglücklich, weil sich die Ressourcen zirkulär referenziert haben. Ist das schon berücksichtigt worden?</p>",
        "id": 235633975,
        "sender_full_name": "Abel Stolz",
        "timestamp": 1619077452
    },
    {
        "content": "<p>Das kann ich bestätigen. Vonk/Firely kann in Transaktionen keine zirkulären (hier ja sogar: bidirektionalen) Referenzen in eine Transaktion bringen. <a href=\"https://docs.fire.ly/firelyserver/features/restful_api.html#transaction\">https://docs.fire.ly/firelyserver/features/restful_api.html#transaction</a> Also: entweder Fall --&gt; Diagnose oder umgekehrt. Gemischt (z.B. AD Encounter --&gt; Condition, sonst Condition --&gt; Encounter) ist sicher keine gute Option. Ich habe damit Probleme MII übergreifende Anfragen POLAR_MI oder Testdaten dazu zu erzeugen.   Alles andere als (nur) Diagnose --&gt; Fall erscheint mir  recht un-orthogonal gegenüber anderen Resourcen.  Was ist richtig - Stand heute?</p>",
        "id": 236130148,
        "sender_full_name": "Frank Meineke",
        "timestamp": 1619421440
    },
    {
        "content": "<p>Wobei man Fall-&gt;Diagnose ja braucht, da man nur diese Releation um Informtionen zur Art der Diagnose (Aufnahme-,Entlass usw.) anreichern kann. Die Relation Diagnose-&gt; Fall sieht das nicht vor.</p>",
        "id": 236139389,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1619426632
    },
    {
        "content": "<p>Danke für den Hinweis, ich hab das Problem an den Firely Support weitergegeben. Wir schauen uns an, ob wir das kurzfristig fixen können. Ansonsten müsste man als Workaround zwei Transactions versenden.</p>",
        "id": 236154095,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1619434855
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"370380\">Frank Meineke</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BFALL.5D.20Einfaches.20Aufbaumodell/near/236130148\">said</a>:</p>\n<blockquote>\n<p>Das kann ich bestätigen. Vonk/Firely kann in Transaktionen keine zirkulären (hier ja sogar: bidirektionalen) Referenzen in eine Transaktion bringen. <a href=\"https://docs.fire.ly/firelyserver/features/restful_api.html#transaction\">https://docs.fire.ly/firelyserver/features/restful_api.html#transaction</a> Also: entweder Fall --&gt; Diagnose oder umgekehrt. Gemischt (z.B. AD Encounter --&gt; Condition, sonst Condition --&gt; Encounter) ist sicher keine gute Option. Ich habe damit Probleme MII übergreifende Anfragen POLAR_MI oder Testdaten dazu zu erzeugen.   Alles andere als (nur) Diagnose --&gt; Fall erscheint mir  recht un-orthogonal gegenüber anderen Resourcen.  Was ist richtig - Stand heute?</p>\n</blockquote>\n<p>Encounter (Einrichtungskontakt) -&gt; Diagnose wird wahrscheinlich das meiste abdecken. Diagnose -&gt; Encounter (meines Erachtens nach, siehe Thread) nur wenn der Encounter ein Versorgungsstellenkontakt oder Abteilungskontakt ist in dem die Diagnose festgestellt wurde. Hierbei ist dann zu beachten, dass dies bei Nebendiagnosen nicht möglich sein wird. Was wäre hier der Use Case die Verknüpfung in diese Richtung zu haben?</p>",
        "id": 236154823,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1619435281
    },
    {
        "content": "<p>Hallo zusammen, <br>\nist das sinnig, dass die DiagnosisRole in der der Encounter.diagnosis eine 1..1-Kardinalität besitzt? Eine Diagnose kann doch theoretisch Aufnahmediagnose UND Hauptdiagnose und eventuell bei der Entlassung sogar als Nebendiagnose gelten. Diese Relation würde aktuell verloren gehen, oder übersehe ich etwas? Was spricht gegen 1..* bei der diagnosis.use ?<br>\nÜbrigens hätten wir auch noch <em>Behandlungsdiagnosen</em> als DiagnosisRole im Angebot, für die ich aktuell keinen Eintrag im VS finden kann.</p>",
        "id": 278699869,
        "sender_full_name": "David Meyers",
        "timestamp": 1649773439
    },
    {
        "content": "<p>diagnosis.use besitzt auch im Basisprofil nur eine 0..1 Kardinalität. Der Fall, dass eine Diagnose mehrere Rollen einnimmt, kann durch mehrfache Nutzung von Encounter.Diagnosis abgebildet werden</p>",
        "id": 278703459,
        "sender_full_name": "Daniel Schmitz",
        "timestamp": 1649774932
    },
    {
        "content": "<p>Dann würde in meinem obigen Beispiel allerdings die Relation von Aufnahmediagnose -&gt; Hauptdiagnose und Entlassdiagnose -&gt; Nebendiagnose verloren gehen oder nicht? Dann hätten wir die Condition-Referenz 4 x mit insgesamt 4 verschiedenen Rollen. Kann ja durchaus sein, dass besagte Relation keinen Mehrwert hinsichtlich Auswertungen/Fragestellungen bringt, ich wollte mich nur vergewissert haben ;-)</p>",
        "id": 278705486,
        "sender_full_name": "David Meyers",
        "timestamp": 1649775696
    },
    {
        "content": "<p>Wenn Referenzen auf die selbe Condition-Ressource verweisen ist doch ersichtlich, dass dieselbe Diagnose mehrere Rollen einnimmt</p>",
        "id": 278707819,
        "sender_full_name": "Daniel Schmitz",
        "timestamp": 1649776561
    },
    {
        "content": "<p>Na gut, ich versuchs mal anders auszudrücken: Es wird also vermutlich nie eine Fragestellung / ein Szenario geben, bei der es erforderlich ist, auf alle <strong>Aufnahmediagnosen</strong> mit ICD-Code XYZ zu filtern, die <strong>zeitgleich auch Hauptdiagnosen</strong> sind  ? <br>\nMit der aktuellen Umsetzung würden ja auch die Kombinationen Entlassdiagnose + Hauptdiagnose mitselektiert werden und es gäbe einen Informationsverlust bei Szenarien ala: Code XYZ war bei Aufnahme zunächst als Nebendiagnose dokumentiert und bei Entlassdiagnose als Hauptdiagnose.</p>",
        "id": 278713765,
        "sender_full_name": "David Meyers",
        "timestamp": 1649779228
    }
]