[
    {
        "content": "<p>Auch auf die Gefaht, dass das schon Abgedeckt ist (Die Diskussion um die Encounter-Hierarchie verstehe ich leider nur teilweise - also die technischen implikationen): Ist sichergestellt, dass ich alle Fälle/Personen identifizieren kann, die an <strong>einem Ort</strong> (Zimmer, Station...) behandelt worden sind? Wäre ja für jegliche Kontaktverfolgung interessant...</p>",
        "id": 204633706,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1595398826
    },
    {
        "content": "<p>Ort ist Location ..</p>",
        "id": 204644176,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1595408786
    },
    {
        "content": "<p>Ja, das ist möglich, vorausgesetzt, dass man die Location-Hierarchie \"flachklopft\".<br>\nLocation  kann ja sowohl für Bettplatz, als auch Zimmer als auch Station verwendet werden.<br>\nUrsprünglich (STU3) war der Gedanke, dass die Angabe der untersten Location-Ebene (Bettplatz) ausreicht, da sich Zimmer und Station aus der Hierarchie ergeben.<br>\nDas macht aber erstens die Suche nach allen Patienten auf einer Station / in einem Zimmer sehr aufwändig und zweitens fliegt das Konzept komplett in die Luft, wenn es polyhierarchische  Strukturen gibt (z.B. ein Bettplatz wird von verschiedenen Stationen genutzt).<br>\nDaher wurde der Location in R4 der physicalType hinzugefügt, um alle Hierarchie-Ebenen direkt am Encounter explizit angeben und differenzieren zu können.</p>\n<p>Der Encounter verfügt dann - um beim Beispiel zu bleiben - ggf. über drei Location-Referenzen, eine mit dem PhysicalType \"bed\", eine mit \"room\" und eine mit \"ward\".</p>",
        "id": 204649997,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1595413564
    },
    {
        "content": "<p>In dieser Beziehung könnte man übrigens das Encounter-Profil der MI-I noch etwas nachschärfen! Da ist der Verweis auf die Location m.E. ziemlich unspezifisch...</p>",
        "id": 204650164,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1595413722
    },
    {
        "content": "<p>Danke für die Erläuterung! Dann würde ich demnach  alle Encounters mit der Location, die meinem Zimmer-of-Interest entspricht, suchen und käme damit auf die Patienten. Richtig?</p>",
        "id": 204664072,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1595424222
    },
    {
        "content": "<p>Hallo zusammen,<br>\nfalls ich den Weg der 3 Location-Referenzen (Bed, Room, Ward) wähle, wie von <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> vorgeschlagen wurde, muss dann jede Referenz mit einer eigenen (redundanten) Period versehen werden oder gibt es eine andere Lösung? Die Encounter-Ressource bietet zwar das Setzen von 0:n Location an, allerdings stehen physicalType und Period stets auf einer Hierarchieebene?</p>\n<p>Hintergrund meiner Nachfrage:<br>\nWenn ich eine Fall-Verlegungshistorie abbilden will, mit 1:n Verlegungen innerhalb eines Falles, von denen jedes wiederum bis zu 3 Location-Referenzen hat, entsteht durch Redundanzen in den Zeiträumen dann doch ein wenig unnötiger Overhead. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> <br>\nDanke!</p>",
        "id": 206002382,
        "sender_full_name": "David Meyers",
        "timestamp": 1596618905
    },
    {
        "content": "<p>Spontan würde ich sagen, dass die (mögliche) Redundanz hier in Kauf genommen werden muss. Ansonsten wäre es ja schwer, einen reinen Zimmer- oder sogar nur Bettenwechsel anzugeben (für den man kein neues Encouter eröffnen möchte).</p>",
        "id": 206002943,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1596619428
    }
]