[
    {
        "content": "<p>Ich hätte mal eine Frage zur angedachten Abteilungsfall-Hierarchie: Mir wurde eine Folie (ich glaube von <span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span> ) vom Projectathon zugespielt, auf der von Abteilungsfällen 1. und 2. Ordnung die Rede ist. Wenn ich das richtig verstehe, geht es um Abteilungsfälle, die <em>partOf</em> anderer Abteilungsfälle sind? Das ist aber nach den aktuellen Profilen ja nicht möglich, da Abteilungsfälle nur <em>partOf</em> eines Versorgungsfalles sein können.</p>",
        "id": 200246430,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1591716629
    },
    {
        "content": "<p>Hi Noemi! Ja, mir ist auch im Nachhinein aufgefallen, dass sich da der eine oder andere Fehler in die Abbildungen reingeschlichen haben, diese werden zur Webko am Freitag korrigiert angezeigt <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> Abteilungsfälle können nur <em>partOf</em> Versorgungsfall sein. Das was man da als Abteilungsfall <em>partOf</em> Abteilungsfall missverstehen könnte, ist dass Abteilungsfälle 2. Ordnung während ein Abteilungsfall 1. Ordnung im Hintergrund läuft laufen könnten, diese sind aber wie gesagt nicht als Teil des Abteilungsfalls 1. Ordnung zu sehen.</p>",
        "id": 200386246,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1591774863
    },
    {
        "content": "<p>Abteilungsfälle 2. Ordnung können stattfinden, ohne dass der Aufenthalt auf der Station (und somit der Abteilungsfall 1. Ordnung) beendet wird.</p>",
        "id": 200386299,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1591774914
    },
    {
        "content": "<p>Das ergibt mehr Sinn, Danke für die Erklärung!</p>",
        "id": 200390680,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1591778448
    },
    {
        "content": "<p>np! <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 200390749,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1591778512
    }
]