[
    {
        "content": "<p>Hallo zusammen,<br>\nim 1.0 Labor release ist ja auch valueCodeableConcept erlaubt (<span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span>). Leider ist min. ein Coding trotzdem Pflicht. Nun haben wir leider etliche freitext-Ergebnisse in unseren Laborwerten, die auch zu heterogen sind um sie mit einem einfachen Text-parsing (\"Negativ\" -&gt;  \"<a href=\"https://acme.lab/resultcodes#NEG\">https://acme.lab/resultcodes#NEG</a>\")  nachträglich zu codieren. Im Zweifelsfall würden wir zur Zeit einfach ein Coding mit data-absent Extension auf system und value setzen und in CodeableConcept.text unseren Wert eintragen. Fällt jemandem eine elegantere Lösung ein? Den text als code mit data-absent system zu setzten fühlt sich sehr falsch an...</p>",
        "id": 206834648,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1597334654
    },
    {
        "content": "<p>Aus den Beiträgen schließe ich indirekt, dass es den Beteiligten hier insbesondere um einheitliches Vorgehen beim \"use case\" Datenkonvertierung aus Primärdaten vor Nutzung für die Forschung geht. Nicht aber um praxistaugliche Verfahren zur primären Erfassung der Laborwerte für Versorgungszwecke.</p>",
        "id": 206849244,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1597341967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217202\">@Andreas Bietenbeck</span> <span class=\"user-mention\" data-user-id=\"194875\">@Danny Ammon</span> Können wir das noch korrigieren?</p>",
        "id": 206850944,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1597342876
    },
    {
        "content": "<p>Da hier das Thema Praxistauglichkeit angesprochen wurde: <span class=\"user-mention\" data-user-id=\"195854\">@Maximilian Reith</span> Gäbe es aus eurer Richtung Anmerkungen hierzu?</p>",
        "id": 206851355,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1597343095
    },
    {
        "content": "<p>Hallo Alex,</p>\n<p>wir sind gerade in der Erarbeitung und können deshalb zu genau dem Thema aus unserer Perspektive noch keine andere Option anbieten. Gerade bei Codes muss man allerdings mit der \"Scheingenauigkeit\" aufpassen, dass man bei den heterogenen Texten nicht irgendwas codiert, daher wäre ich jetzt auch erstmal dafür die Pflicht 1..* bei coding zu entfernen, aber eine kurzfristige Lösung könnte sein:</p>\n<p>system = <a href=\"http://terminology.hl7.org/CodeSystem/data-absent-reason\">http://terminology.hl7.org/CodeSystem/data-absent-reason</a><br>\ncode = temp-unknown oder as-text    (The content of the data is represented in the resource narrative.)???</p>\n<p>text = der Freitext</p>\n<p>und das müsste man mal diskutieren vielleicht auch ohne extension...</p>\n<p>Gruß Max</p>",
        "id": 206902666,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597387031
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195854\">@Maximilian Reith</span>  Aber hat man dann nicht eine Observation, die aussagt: \"Der Labortest kommt zu dem Ergebnis, dass der (zB) Hämoglobinwert temporär unbekannt ist\"? (Dabei hat man das Ergbnis ja, nur nicht codiert. Und wenn der zB schon ein Jahr alt ist, ändert sich daran wahrscheilich auch nichts mehr).</p>",
        "id": 206908031,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1597393372
    },
    {
        "content": "<p>Ja das ist die Frage, denn einerseits ist ja der code (temp-unknown) in coding und das sagt m.E. nach erstmal nur dass das coding nicht verfügbar ist, da der Text ja gefüllt ist. Aber ich schätze da wird es auch genauso andere Meinungen geben, da der scope der Aussage temp-unknown nicht 100%ig definiert ist. Ich fände ja auch as-text gut, aber da steht resource narrative also resource.text?</p>",
        "id": 206909970,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1597395479
    },
    {
        "content": "<p>Was sind das denn für Ergebnisse, die als Text nicht kodiert werden können? <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> , kannst du mal Beispiele schicken? Wir schreiben z.B. häufig auch zusätzlich Text in das Ergebnisfeld, der eigentlich aber ein Kommentar und kein echtes Ergebnis ist.</p>",
        "id": 206911430,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1597396877
    },
    {
        "content": "<p>zB 20393-5 mit \"schwach hämolytisch\" oder auch mal \"nicht messbar\" u.ä. Vieles davon könnte man wahrscheinlich codieren, aber es kann auch jederzeit ein noch nicht berücksichtigter Fall dabei sein...</p>",
        "id": 206915902,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1597400802
    },
    {
        "content": "<p>schwach hämolytisch könnte man mMn. besser unter Observation.note unterbringen. \"Nicht messbar\" heißt dann wahrscheinlich entweder \"nicht nachweisbar\" und könnte als \"&lt; XX\" (mit XX der Nachweisgrenze) oder vielleicht tatsächlich als data-absent bei organistorischen Problemen kodiert werden. Diese Entscheidungen sind zugegeben sehr aufwendig zu treffen, brauchen wir hier einen Platzhalter um erst einmal starten zu können?</p>",
        "id": 206918287,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1597403138
    },
    {
        "content": "<p>Genau. Das könnte man alles noch schöner machen, es wäre aber gut, ein allgemeines \"fallback\" zu haben für Sachen, die man noch nicht behandelt hat.</p>",
        "id": 206918659,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1597403504
    },
    {
        "content": "<p>Wir könnten Freitext auch immer in note packen. \"significant, unexpected or unreliable results values\" würde ja ganz gut passen. Allerdings müsste man sich dann wieder was für den value überlegen.</p>",
        "id": 206918892,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1597403725
    },
    {
        "content": "<p>Ok, ich glaube auch, dass wir hier einen Fallback benötigen. Vielleicht doch ein besonderen data-absent reason? Ich denke nochmal nach, bin aber ab gleich ca. 1 Woche ohne stabiles Internet.</p>",
        "id": 206919307,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1597404063
    },
    {
        "content": "<p>Ich stimmte zu, dass das data-absent-reason CodeSystem hier nicht passend ist. Finden sich jedoch nicht bestimmte SNOMED Qualifier Values welche man hier verwenden könnte?</p>",
        "id": 208813028,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1599048204
    },
    {
        "content": "<p>Schritt zurück. Wegen \"ein Jahr alt\" und so. Es gibt IMHO einen grundsätzlichen Unterschied zwischen Dokumentation von \"data absent\" durch den primären Observer (dann sollte es wohl ein Code an gewohnter Stelle des Messergebnis sein) und der sekundären Dokumentation (Ergebnis nicht lesbar, unverständlich, nicht verwendbar etc.), was nicht an Stelle der Beobachtung tritt, sondern jene bewertet, (dis-)qualifiziert. Im direkten Versorgungszusammenhang erscheint mir diese Unterscheidung wichtig.</p>",
        "id": 208885436,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1599079636
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> Wäre denn \"data absent\" durch den primären Observer nicht sowas wie \"nicht auswertbar\"? Das wäre ja das, wenn ich es richtig verstehe, was <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> ausdrücken wollen würde. Könnte man sowas nicht z.B. durch  Indeterminate (qualifier value) SCTID: 82334004 u.Ä. beschreiben?</p>",
        "id": 209030491,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1599167711
    },
    {
        "content": "<p>'Nicht auswertbar' ist eine Spezialisierung eines data absent reasons, wenn die Probe bspw. verschmutzt ist.</p>",
        "id": 209062122,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1599203790
    },
    {
        "content": "<p>Ich könnte jedoch aus dem CodeSystem (<a href=\"https://www.hl7.org/fhir/valueset-data-absent-reason.html\">https://www.hl7.org/fhir/valueset-data-absent-reason.html</a>) nur \"unknown\" auswählen, alles andere finde ich nicht wirklich passend</p>",
        "id": 209062271,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1599203925
    },
    {
        "content": "<p>Bei nicht-auswertbar könnte man noch \"not-performed\" auswählen, sobald jedoch die Untersuchung gelaufen ist, aber keine Ergebnisse vorliegen, wären wir dann wahrscheinlich wieder bei der Aussage von Christof, dass man es anders kodieren sollte</p>",
        "id": 209062405,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1599204043
    },
    {
        "content": "<p>Der wichtigste Unterschied ist vermutlich \"nicht nachweisbar\", \"nicht messbar\" im Sinne von \"ohne Befund\", vs \"nicht gemessen\", \"Probe kaputt\" usw. Das ist in der Versorgung jedenfalls ein wichtiger Unterschied.</p>",
        "id": 209075557,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1599213974
    },
    {
        "content": "<p>Im Sinne von \"Keine Vorerkrankungen bekannt\" vs \"keine Aussage zu möglichen Vorerkrankungen\"</p>",
        "id": 209075797,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1599214173
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193430\">Alexander Zautke</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BLabor.5D.20Text.20Werte/near/209030491\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"193991\">Christof Gessner</span> Wäre denn \"data absent\" durch den primären Observer nicht sowas wie \"nicht auswertbar\"? Das wäre ja das, wenn ich es richtig verstehe, was <span class=\"user-mention silent\" data-user-id=\"221444\">Noemi Deppenwiese</span> ausdrücken wollen würde. Könnte man sowas nicht z.B. durch  Indeterminate (qualifier value) SCTID: 82334004 u.Ä. beschreiben?</p>\n</blockquote>\n<p>Man sollte hier auf jeden Fall zwischen: nicht-auswertbar (ich habe es versucht, ging aber nicht), unbestimmt (nicht eindeutig) und nicht bekannt unterscheiden.</p>",
        "id": 209275549,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1599471251
    }
]