[
    {
        "content": "<p>Ich hab eben noch aus der Modul-Beschreibung gefischt:</p>\n<blockquote>\n<p>In einer ersten Ausbaustufe sollen bis Ende 2018 Angaben zu zusatzentgeltfähigen Medikamenten (nach OPS Klasse 6, Typ 1) vorgehalten werden. Bis 2020 sollen detaillierte strukturierte Angaben (ggf. für Teilkollektive wie z.B. Intensivstationen) sowie zur bekannten Medikationen im Rahmen des Medikationsplans verfügbar gemacht werden.</p>\n</blockquote>\n<p>In unseren aktuellen Profilen kommt aber noch gar kein OPS vor, oder übersehe ich was...?</p>",
        "id": 174152884,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566834256
    },
    {
        "content": "<p>ja darum müssen wir uns auch kümmern. Aber sind OPS Codes nicht fehl am Platz in z.B Medication.code und sollten besser in der Procedure Resource bleiben? Dann referenzieren wir von MedicationAdministration auf Procedure</p>",
        "id": 174154762,
        "sender_full_name": "Julian Sass",
        "timestamp": 1566835551
    },
    {
        "content": "<blockquote>\n<p>ja darum müssen wir uns auch kümmern. Aber sind OPS Codes nicht fehl am Platz in z.B Medication.code und sollten besser in der Procedure Resource bleiben? Dann referenzieren wir von MedicationAdministration auf Procedure</p>\n</blockquote>\n<p>Jopps, OPS in Medication.code ist fehl am Platz, es wird mittels des OPS Codes ja nur das Zusatzentgelt für bestimmte Medikamente festgehalten.</p>",
        "id": 174168320,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1566846641
    },
    {
        "content": "<p>Ich sehe den OPS code hier nur in der Abrechnung, oder eben in einer Procedure.<br>\nMotivation dahinter vermute ich ist der 301 Datensatz, da hier der Abrechnungsdatensatz mal wieder genutzt wird um überhaupt struktiurierte Medikationsinformationen zu erhalten.</p>",
        "id": 174168480,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1566846760
    },
    {
        "content": "<p>Ah, man könnte den OPS code als zusärtliche Kodierung in .code stellen, also ein OPS Slice, würde aber die Hauptcodierung (PZN?) nicht ersetzen. Sonst kann man diese Daten schwer mit nicht OPS Medications zusammenführen.</p>",
        "id": 174168603,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1566846846
    },
    {
        "content": "<p>Ich denke, das hängt hauptsächlich von der Semantik der OPS Codes ab. Hat jemand ein Beispiel?</p>",
        "id": 174207692,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566894998
    },
    {
        "content": "<blockquote>\n<p>Ich denke, das hängt hauptsächlich von der Semantik der OPS Codes ab. Hat jemand ein Beispiel?</p>\n</blockquote>\n<p><a href=\"/user_uploads/10155/a4m9KrKNcqqPNsrWHDNlbVoW/2019-08-27-11_00_41-Fallpauschalenkatalog-2019_180928.xlsx-Excel.png\" target=\"_blank\" title=\"2019-08-27-11_00_41-Fallpauschalenkatalog-2019_180928.xlsx-Excel.png\">2019-08-27-11_00_41-Fallpauschalenkatalog-2019_180928.xlsx-Excel.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/a4m9KrKNcqqPNsrWHDNlbVoW/2019-08-27-11_00_41-Fallpauschalenkatalog-2019_180928.xlsx-Excel.png\" target=\"_blank\" title=\"2019-08-27-11_00_41-Fallpauschalenkatalog-2019_180928.xlsx-Excel.png\"><img src=\"/user_uploads/10155/a4m9KrKNcqqPNsrWHDNlbVoW/2019-08-27-11_00_41-Fallpauschalenkatalog-2019_180928.xlsx-Excel.png\"></a></div>",
        "id": 174209483,
        "sender_full_name": "Julian Sass",
        "timestamp": 1566896602
    },
    {
        "content": "<p><span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> sieht fast nach einem MedicationAdministration-<em>Profil</em> aus. Mit fester UCUM Einheit 'mg', min und max Werten für valueQuantity, route fest auf 'parenteral' und einem fixen Medikamenten-Code/-Link...?</p>",
        "id": 174217368,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566903492
    },
    {
        "content": "<p>..der OPS-Code würde dann in der Instanz nicht mehr vorkommen, höchstens in der Profil-URL...</p>",
        "id": 174217450,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566903576
    },
    {
        "content": "<p>Ha! MedicationAdministration.instantiates --&gt; OPS <br>\nDas wäre eigentlich semantisch die richtige Verknüpfung.</p>",
        "id": 174217682,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566903736
    },
    {
        "content": "<p>Man könnte aus der Kenntnis einer OPS mit Bezug zu einem Patienten und einem Zeitstempel vermutlich problemlos eine vordefinierte MedicationAdministration instantiieren. Das Mapping könnte man sogar in FHIR als StructureMap ausdrücken. (Gell, <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>? ;-) )</p>",
        "id": 174217840,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566903926
    },
    {
        "content": "<p>...vorausgesetzt, es ließe sich jedem OPS-Code eindeutig ein PZN oder ATC-Code für die verabreichte Medikation zuordnen...</p>",
        "id": 174218959,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566905036
    },
    {
        "content": "<blockquote>\n<p><span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> sieht fast nach einem MedicationAdministration-<em>Profil</em> aus. Mit fester UCUM Einheit 'mg', min und max Werten für valueQuantity, route fest auf 'parenteral' und einem fixen Medikamenten-Code/-Link...?</p>\n</blockquote>\n<p>MedicationAdministration-Profil stimme ich zu. Die Einheiten und routes sollten wir aber offen halten. Der OPS kennt da noch einige weitere Varianten je nach Medikation</p>",
        "id": 174222807,
        "sender_full_name": "Julian Sass",
        "timestamp": 1566908440
    },
    {
        "content": "<p>Ich meinte eher <em>ein</em> Profil <em>pro</em> OPS-Code...</p>",
        "id": 174223422,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566908987
    },
    {
        "content": "<p>Die Mengen im OPS sind ja eher als Scores zu sehen. Kann man nicht über die terminologische Abbildung eines OPS Codes, der ja genau einen Wirkstoff beschreibt, auf ein Medikament schließen, in dem dieser Wirkstoff als Ingredient vorkommt? Umgedreht geht das natürlich auch.</p>",
        "id": 174370042,
        "sender_full_name": "André Sander",
        "timestamp": 1567004102
    },
    {
        "content": "<p>Zur allg. Info hier noch eine Aussage von Martin Boeker zur Frage, ob MedicationAdministration.dosage ein Pflichtfeld sein sollte, oder nicht:</p>\n<blockquote>\n<p>ich würde es nicht zur Pflicht machen, da schon unser sog. \"Level 1\" Episode auf Basis von OPS-Codes dann nicht mehr vollständig abgebildet werden könnte, da es da Fälle ohne Dosierung gibt.</p>\n<p>Ich würde die derzeitigen Profile sehr \"offen\" formulieren (also so gut wie alles optional) und dann im Implementation Guide für bestimmte Anforderungen Constraints formulieren</p>\n</blockquote>\n<p>Also dann doch OPS-Codes in MedicationAdministration!?</p>",
        "id": 174469846,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567096291
    },
    {
        "content": "<p>Wir waren jetzt in Procedure ausgegangen, dass wir dort OPS kodieren und ihr eine Referenz aus MedicationAdministration erzeugt</p>",
        "id": 174470311,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1567096651
    },
    {
        "content": "<p>Oder hab ich den Thread komplett falsch verstanden?</p>",
        "id": 174470346,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1567096682
    },
    {
        "content": "<p>Nee, ist schon richtig, es gibt nur leider zwei Threads, einen  hier und einen per eMail. Ich versuche mich gerade als c&amp;p Broker...</p>",
        "id": 174472190,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567098133
    },
    {
        "content": "<p>ok, langsam klärt sich's . <br>\nZu meinem Hinweis, dass OPS als Procedure abzubilden wäre:</p>\n<blockquote>\n<p>das ist auf jeden Fall richtig und entspricht ja unser Anforderung, die wir \"Level 1\" nennen (aus OPS Kapitel 6 die entsprechenden MedicationAdministration zu generieren (Mapping Tabelle für die OPS Kapitel 6 Codes gibt es, liegt im Sharepoint). Es gibt im ArtDecor Modell dafür eine entsprechende Beschreibung, die man dann so wie im FHIR Profil Procedure mit .partOf auf die entsprechende MedicationAdministration abbilden könnte.</p>\n<p>Ich füge, sobald ich Zeit habe, aber noch vor dem NSG eine Beschreibung dazu in den ImplementationGuide des Medications Moduls und da kann man auf diese Link zu Procedure hinweisen.</p>\n</blockquote>\n<p>--Martin</p>",
        "id": 174472528,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567098377
    },
    {
        "content": "<p>Ich würde dem \"partOf\"-Link entgegen meiner vorherigen Aussage zu \"instantiates\" zustimmen, da es sich bei den OPS-Procedures ja nicht um Definitionen der Prozedur handelt, sondern je ebenfalls bereits Instanzen von für einen konkreten Patienten zu einem konkreten Zeitpunkt erbrachte Leistungen.</p>",
        "id": 174472660,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567098486
    },
    {
        "content": "<p>Haben wir bei Procedure exakt so eingeplant</p>",
        "id": 174472681,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1567098511
    },
    {
        "content": "<p>Ok, wusste ich nicht, daher --&gt; Verwirrung</p>",
        "id": 174472723,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567098545
    },
    {
        "content": "<p>Heißt aber, wenn die Datenquelle (§301?) nur eine OPS-Ziffer und vll. noch ein Datum hergibt, dass man eine MedicationAdministration <em>ohne</em> Angabe einer Dosis erstellen müsste, da die OPS ja nur einen min/max Bereich definiert, die konkret verabreichte Menge jedoch unbekannt ist...?  Dann wären aber die aus den Ziffern 6-002.4c-g (aus Beispieltabelle oben) erzeugten MedicationAdministrations nicht mehr unterscheidbar, obwohl ganz klar unterschiedliche Dosen gegeben wurden. Den Unterschied könnte man nur sehen, wenn man die Procedure mit dem OPS-Code wieder heranzieht.</p>",
        "id": 174473186,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567098900
    },
    {
        "content": "<p>Wäre es da nicht sinnvoller, in der Administration wenigstens den Mittelwert anzugeben, vll. mit einer Extension, die selbigen als \"geschätzt\" ausweist...?</p>",
        "id": 174473249,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567098956
    },
    {
        "content": "<p>oder- noch einfacher: man könnte den Text aus der OPS-Tabelle \"30mg bis unter 40mg\" in dosage.text übernehmen</p>",
        "id": 174473395,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567099074
    },
    {
        "content": "<p>Konntest du auch noch nicht :P War nur eine Info.</p>",
        "id": 174482878,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1567105504
    },
    {
        "content": "<p>dosage.text ist hier sicher das sinnvollste.<br>\nGerade bei Zytostatika (wie Topotecan) sollte man nicht aufgrund rechnerischer Annahmen hantieren, die dann in einem numerischen Datenelement mit Einheit stehen ...<br>\n(Die genannte Genauigkeits-Extension wäre genau genommen eine modifierExtension)</p>\n<p>Mal abgesehen davon, dass die Absolutdosis bei den meisten Zytostatika ohne die Kenntnis des Körpergewichts relativ aussagefrei ist. Aber das führt hier sicher zu weit.</p>",
        "id": 174484561,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567106862
    },
    {
        "content": "<p>Btw. wird in klinischen Studien und auch in Tumordokumentationen (sofern dort so detailliert dokumentiert wird) oft präferiert die Dosis in mg/kg Körpergewicht angegeben und evtl. zusätzlich (oder alternativ) noch die Absolutdosis in mg.</p>",
        "id": 174484774,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567107004
    },
    {
        "content": "<p>Das wäre ja kein Problem, dafür hat Gott die doseRatio geschaffen ;-)<br>\nWorauf ich eigentlich hinaus will ist, dass es keinen guten Grund gibt, dosage bei Administration auf 0..1 zu belassen. OPS würde mir als Grund genannt, warum die Dosis manchmal weggelassen können werden müsse...</p>",
        "id": 174485050,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567107237
    },
    {
        "content": "<p>(Gibt es eine Obergrenze für Hilfsverben in einem Satz!?)</p>",
        "id": 174485135,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567107286
    },
    {
        "content": "<p>A) Ja genau (ratio), wollte nur drauf hinweisen</p>\n<p>B) naja, wie bildet man ab \"es wurden Biphosphonate verabreicht\"?</p>\n<p>C) Ja, denn das Universum ist endlich</p>",
        "id": 174485409,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567107495
    },
    {
        "content": "<p>zu B kann man natürlich auch die absentReason-Extension nehmen, wenn man das Profil streng machen will</p>",
        "id": 174485584,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567107652
    },
    {
        "content": "<p>Kommt B denn oft vor? Ich bin davon ausgegangen, dass nichts-genaues-weiß-man-nicht-Medikationen eher als MedicationStatement abgebildet würden. Aber dein Beispiel wäre ja tatsächlich ein Fall, wo man genau weiß dass, wer und wann das Medikament verabreicht wurde, nur die Menge nicht...</p>",
        "id": 174485868,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567107863
    },
    {
        "content": "<p>Das war jetzt ein Beispiel aus DMP Brustkrebs.<br>\nDa das eine nachgelagerte Dokumentation ist, würde man das wahrscheinlich tatsächlich eher als MStatement abbilden, mit Status taken.</p>\n<p>Spontan fällt mir jetzt noch die antihormonelle Therapie ein, wo die Patienten z.B. 5 Jahre täglich eine Tablette nehmen.<br>\nAber auch das wäre ggf. eher ein MStatement.</p>\n<p>Die Frage bei MAdministration ist wohl eher, ob die Dosis in der Realität immer dokumentiert ist.<br>\nAndererseits wenn ich lese, dass man bei den MII-Laborprofilen sogar die Uhrzeit verbindlich vorschreiben will (ist das noch aktuell?), würde 1..1 eher passen.<br>\nabsentReason-Ext. würde ich aber auf jeden Fall vorsehen.</p>",
        "id": 174496608,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1567116238
    }
]