[
    {
        "content": "<p>Bei MedicationStatement wäre momentan noch einiges erlaubt, was m.E. ein Interoperabilitäts-Foul darstellen würde.<br>\nz.B.:</p>\n<ul>\n<li>MedicationStatement ohne Angabe einer Dosis</li>\n<li>Dosis ohne text und ohne Angabe von Timing (weder Code noch text)</li>\n<li>Dosis ohne text und ohne Angabe von Dose <br>\n...es gibt sicherlich noch mehr, wenn man genauer hinschaut.</li>\n</ul>\n<p>Diese Dinge sollten ggf. über Invarianten abgefangen und wenn schon nicht als Fehler bei der Validierung, dann doch zumindest als Warnung ausgegeben werden...</p>",
        "id": 174220484,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566906379
    },
    {
        "content": "<p>Im klinischen Kontext würde ich MedicationRequest ohnehin vorziehen. Die medikamentöse Therapie sollte man mit MedicationRequest--&gt; MedicationAdministration abbilden. Auf der FHIR Webseite steht ja dazu:</p>\n<p>\"A medication statement is not a part of the prescribe -&gt; dispense -&gt; administer sequence, but is a report by a patient, significant other or a clinician that one or more of the prescribe, dispense or administer actions has occurred, resulting is a belief that the patient is, has, or will be using a particular medication.\"</p>\n<p>Mit einer sauberen MedicationAdministration lässt sich um Übrigen bei der Entlassung eines Patienten dann auch der korrekte OPS Code aus dem Kapitel 6 ermitteln.</p>",
        "id": 174370995,
        "sender_full_name": "André Sander",
        "timestamp": 1567004498
    },
    {
        "content": "<p>D'accord. Im klinischen Kontext sehe ich MedicationStatement höchstens im Sinne von \"Informationen über Medikationen, die der Patient von extern mitgebracht hat, bzw. selbst angegeben hat\" und als \"empfohlene Medikation nach Entlassung\".</p>\n<p>Alles dazwischen ist MedicationAdministration. Ob man den kompletten Workflow MedicationRequest -&gt; -Dispense -&gt; -Adminstration in FHIR abbilden mag oder lediglich die erfolgte Administration in FHIR dokumentiert sei mal dahingestellt. Für die MI-Initiative spielt vermutlich nur letzteres eine Rolle...</p>",
        "id": 174430385,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567063795
    },
    {
        "content": "<p>FYI <span class=\"user-mention\" data-user-id=\"213583\">@André Sander</span> , das MedicationAdministration-Profil ist hier: <a href=\"https://simplifier.net/Sandbox/MedicationAdministration/~overview\" target=\"_blank\" title=\"https://simplifier.net/Sandbox/MedicationAdministration/~overview\">https://simplifier.net/Sandbox/MedicationAdministration/~overview</a></p>",
        "id": 174430729,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567064225
    },
    {
        "content": "<p>Da ist dosage auch noch 0..1, was noch weniger Sinn macht, als bei MedicationStatement...</p>",
        "id": 174430758,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567064279
    },
    {
        "content": "<p>Ich würde vorschlagen, MedicationAdministration.dosage auf 1..1 zu setzen mit einer Invariante dass in dosage mindestens entweder dosage.dose, dosage.rate oder dosage.text gefüllt sein muss.</p>",
        "id": 174431033,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567064565
    },
    {
        "content": "<p>Ja, eine Dosierung sollte zwingend vorgeschrieben sein. Allerdings gibt es einen tatsächlichen Use-Case: und zwar, wenn ein Medikament als Template verschrieben wird und die Dosierung später festgelegt wird. Diesen Use-Case sollte man aber m.E. nicht unterstützen.</p>",
        "id": 174439234,
        "sender_full_name": "André Sander",
        "timestamp": 1567072438
    },
    {
        "content": "<p>MedicationAdministration ist ja keine Verschreibung, sondern eine Verabreichung. Bei MedicationStatement ist schon eher denkbar, dass dosage nicht angegeben werden kann, z.B. weil der Patient sich nicht erinnert etc, aber ich finde es wäre nicht zu viel verlangt, diesen Umstand dann zumindest als Freitext einzugeben....</p>",
        "id": 174439928,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567073034
    },
    {
        "content": "<p>Sorry, mein Fehler! Ich meinte natürlich MedicationRequest - da gibt es möglicherweise keine \"DosageInstruction\". Beim MedicationAdministration gibt es keinen vernünftigen Grund (im klinischen Umfeld) die Dosierung wegzulassen.</p>",
        "id": 174440452,
        "sender_full_name": "André Sander",
        "timestamp": 1567073501
    },
    {
        "content": "<p>Fun Fact: MedicationStatement wird in R5 anscheinend in MedicationUsage umbenannt. Es gibt wohl zuviele Missverständnisse darüber, was ein MedicationStatement ist und nicht ist. ;-)<br>\n<a href=\"http://build.fhir.org/medicationusage.html\" target=\"_blank\" title=\"http://build.fhir.org/medicationusage.html\">http://build.fhir.org/medicationusage.html</a></p>",
        "id": 174465971,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567093314
    }
]