[
    {
        "content": "<p>Hallo, Wir haben bei uns COPRA auf der Intensiv im Einsatz und wir modellieren gerade das Mapping der Daten von dort auf das Medikations-Modul. Dabei habe ich folgendes Problem: Die Medikationen in COPRA sind als Mixtures von Drugs modelliert, d.h. in einer Applikation können mehrere Medikamente enthalten sein. Die Applikation mit Dosis, Route, Volume hängen an der Mixture. Im FHIR-Profil der MedicationAdministration ist nur genau eine Referenz auf ein Medikament erlaubt. Wenn ich auf dieses FHIR-Modell mappen möchte, dann würde ich die Mixture durch partOf-Referenzen auf eine Mantel-MedicationAdministration bauen, die die dosage-Information enthält und die Kinder-MedicationAdministrations haben die verschiedenen Referenzen auf die Medikamente. Die Kinder-Administrations haben die dosage entweder leer oder redundant identisch zu der Mantel--Administration.<br>\nAls nächstes haben wir einen zeitlichen Verlauf der Applikationen bei dem sich die dosage über die Zeit ändern kann. Im Profil ist die dosage in der Administration mit drin. Ich würde diesen zeitlichen Verlauf also eher weglassen, da ich ihn nicht in die Profil-Modellierung rein bekomme.<br>\nHört sich das richtig an ?<br>\nHat ansonsten hier im Forum ebenfalls jemand COPRA im Einsatz und hat ähnliche Überlegungen beim Mapping ?</p>",
        "id": 224156828,
        "sender_full_name": "Georg Fette",
        "timestamp": 1611739652
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>, warum bildet ihr die Mixtures nicht über Medication-Ressourcen ab und referenziert dann aus der MedicationAdminstration auf diese Mixture Medication?</p>",
        "id": 224161052,
        "sender_full_name": "Julian Sass",
        "timestamp": 1611742285
    },
    {
        "content": "<p>Hm, das könnte man machen. Das nimmt den Medication-Resourcen jedoch ihren Charakter als Metadaten. Jede Verabreichung würden wir dann mit einem Medikament verbinden (die Mixture), welches als Ingredients andere Medikamente haben (die Inhalte der Mixtures) welche dann mit ihren Substances verbunden sind. Im Moment haben wir ca. 150.000 Einträge in ConfigDrugs und ca. 6 Mio Einträge in Mixture. Danach hätten wir 6.15 Mio Medication Resourcen.</p>",
        "id": 224162369,
        "sender_full_name": "Georg Fette",
        "timestamp": 1611743129
    },
    {
        "content": "<p>Wie sehr darf mit solchen hierarchischen Mechanismen wie Ingredient oder partOf gespielt werden ? Das läßt einem ja schon einiges an Freiheiten in der lokalen Modellierung. Wenn jeder Standort das anders macht, wie sehr werden die verschiedenen Endprodukte interoperabel sein ?</p>",
        "id": 224162660,
        "sender_full_name": "Georg Fette",
        "timestamp": 1611743290
    },
    {
        "content": "<p>Also wir sind hier mit der Implementierung nicht besonders weit, aber hatten schon mal in die Mixtures in COPRA geguckt. Die sollten nach meinem Verständnis Medications mit mehreren ingredients sein. Wenn du jetzt die Bestandteile der Mixtur auf mehrere Adminstrations aufteilst, hast du eine Adminstration in der du nur das Lösungsmittel NaCl oder so verabreichst. Das stimmt ja so egtl. nicht. Ok du hast die Mantel-Administration drum herum, aber das scheint mir weniger praktikabel und sinnvoll als die Mixtures einmal über Medication zu erfassen. Wenn sich die dosage über die Zeit ändert, würde ich daraus einzelne Administrations machen, den Zeitraum jeweils über effectivePeriod dokumentieren, aber auf die selbe Medication Ressource referenzieren. Diese Administrations dann über partOf zusammenfassen, weil eine Infusion etc.</p>",
        "id": 224175197,
        "sender_full_name": "Julian Sass",
        "timestamp": 1611751649
    },
    {
        "content": "<p>Wir sollten vielleicht beim nächsten MII Projectathon wieder einen Medication Track machen, sonst macht es sicherlich jeder Standort am Ende anders.</p>",
        "id": 224175344,
        "sender_full_name": "Julian Sass",
        "timestamp": 1611751730
    },
    {
        "content": "<p>Hallo,<br>\nalso ich habe das am Standort Jena über Bundle gelöst. Wird eine drug mixture verabreicht, dann wird ein bundle erstellt, dass aus 1-n MedicationAdministrations, jeweils einer verknüpften Medication besteht und einem Patient. Das Bundle kann noch durch andere Ressourcen  erweitert werden. Die Medication ist dabei bspw. über die PZN identifizierbar und ist damit keine drug mixture mehr, sondern das einzelne Medikament. Ich habe das Ganze auch im SMITH confluence dokumentiert. Eventuell kann ich es als PDF exportieren und euch zukommen lassen.</p>",
        "id": 224308876,
        "sender_full_name": "Christian Schubert",
        "timestamp": 1611830308
    },
    {
        "content": "<p>Mal bei der HL7 Pharmacy WG nachfragen? Konkrete Beispiele aus der Praxis sind immer sehr wertvoll! <a href=\"#narrow/stream/179249-Medication\">https://chat.fhir.org/#narrow/stream/179249-Medication</a></p>",
        "id": 224386267,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1611864825
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"382750\">Christian</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BMedication.5D.20Hierarchische.20Kombination.20von.20Medikationen/near/224308876\">said</a>:</p>\n<blockquote>\n<p>also ich habe das am Standort Jena über Bundle gelöst.</p>\n</blockquote>\n<p>Ich bin ein bisschen out-of-the-loop hier, aber Bundle klingt falsch. Das würde die Informationen ja nur zum Zeitpunkt des Versandes gruppieren.  Und aus der Tatsache, dass die MedicationAdministrations zu einem Bundle aggregiert wurden zu schließen, dass die Medikamente gemischt wurden ist, m.E. ein gewagter Schluss.</p>",
        "id": 224387060,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1611865231
    },
    {
        "content": "<p>Wir haben dazu auch Beispiele im IG. Medication Ressource für Infusionslösung: <a href=\"https://simplifier.net/MedizininformatikInitiative-ModulMedikation/Medication-example-Infusionsloesung/~json\">https://simplifier.net/MedizininformatikInitiative-ModulMedikation/Medication-example-Infusionsloesung/~json</a> <br>\nDie Administration dazu: <a href=\"https://simplifier.net/MedizininformatikInitiative-ModulMedikation/MedicationAdministration-example/~json\">https://simplifier.net/MedizininformatikInitiative-ModulMedikation/MedicationAdministration-example/~json</a></p>",
        "id": 224396791,
        "sender_full_name": "Julian Sass",
        "timestamp": 1611870267
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  Danke für den Hinweis! Ich baue die IDs nach Copra IDs auf, d.h. die MedicationAdministration ID ist die DrugMixture ID + die Medication ID. Um es noch klarer hervorzuheben hatte ich noch eine extension in jede MedicationAdministration hinzugefügt, welche nur die DrugMixture ID enthält. So erhält man bei der Suche nach einer identischen DrugMixture ID alle MedicationAdministrations, welche zu einer Gabe gehören.</p>\n<p>PS: Vielleicht wäre es auch eine Möglichkeit nur eine MedicationAdministration zu nutzen, die auf die Medication (DrugMixture) verweist und diese dann in den ingredients auf die \"eigentlichen\" Medikamente zeigt?</p>",
        "id": 224448390,
        "sender_full_name": "Christian Schubert",
        "timestamp": 1611913425
    },
    {
        "content": "<p>Das Thema mit in den Projectathon zu nehmen ist eine gute Idee. Ich würde die Modellierung aber auch auf anderen Ebenen gerne weiter diskutieren. Wer hat denn von den Medics die Medikation bisher wie gelöst ? Da die Profile einige Freiheiten erlauben würde mich mal interessieren was es an Lösungen gibt und wie kompatibel die sind ? Die Beiträge hier sind ja schonmal recht interessant. Es sollte insgesamt ja auf eine einzelne Lösung konvergieren, und man wird das eigene Mapping wahrscheinlich etwas anpassen müssen. Freiheitsgrade sehe ich bisher a) bei den verschiedenen Intervallen mit unterschiedlichen Abgabemengen in einer Application und b) bei den Mixtures der Medikamente. Von der Modellellierung der Mixtures als Medications mit anderen Medications als partOf würde ich mich überzeugen lassen. Gibt es dafür aber einen Konsens ?</p>",
        "id": 225529857,
        "sender_full_name": "Georg Fette",
        "timestamp": 1612783219
    },
    {
        "content": "<p>Hallo an alle, ich habe eben etwas im MII Kerndatensatz herumgestöbert und mir ist eine Unklarheit aufgefallen:</p>\n<p><a href=\"https://simplifier.net/guide/MedizininformatikInitiative-ModulPerson-ImplementationGuide/BeschreibungModul\">In der Beschreibung des IG zu Person</a> findet sich folgender Satz: <em>Als weiteres, in bestimmtem Rahmen gut identifizierendes Merkmal kann für GKV-Patienten (90 % der Bevölkerung in Deutschland) die Versicherungsnummer genannt werden. Diese findet sich allerdings bis auf Weiters im Modul FALL.</em><br>\nIch vermute, da sollte Person stehen oder direkt auf das Profil PatientIn verwiesen werden?</p>",
        "id": 225548326,
        "sender_full_name": "Yannick Börner",
        "timestamp": 1612793164
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"260054\">Yannick Börner</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BMedication.5D.20Hierarchische.20Kombination.20von.20Medikationen/near/225548326\">said</a>:</p>\n<blockquote>\n<p>Hallo an alle, ich habe eben etwas im MII Kerndatensatz herumgestöbert und mir ist eine Unklarheit aufgefallen:</p>\n<p><a href=\"https://simplifier.net/guide/MedizininformatikInitiative-ModulPerson-ImplementationGuide/BeschreibungModul\">In der Beschreibung des IG zu Person</a> findet sich folgender Satz: <em>Als weiteres, in bestimmtem Rahmen gut identifizierendes Merkmal kann für GKV-Patienten (90 % der Bevölkerung in Deutschland) die Versicherungsnummer genannt werden. Diese findet sich allerdings bis auf Weiters im Modul FALL.</em><br>\nIch vermute, da sollte Person stehen oder direkt auf das Profil PatientIn verwiesen werden?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span></p>",
        "id": 225582855,
        "sender_full_name": "Julian Sass",
        "timestamp": 1612807133
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"260054\">Yannick Börner</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BMedication.5D.20Hierarchische.20Kombination.20von.20Medikationen/near/225548326\">said</a>:</p>\n<blockquote>\n<p>Hallo an alle, ich habe eben etwas im MII Kerndatensatz herumgestöbert und mir ist eine Unklarheit aufgefallen:</p>\n<p><a href=\"https://simplifier.net/guide/MedizininformatikInitiative-ModulPerson-ImplementationGuide/BeschreibungModul\">In der Beschreibung des IG zu Person</a> findet sich folgender Satz: <em>Als weiteres, in bestimmtem Rahmen gut identifizierendes Merkmal kann für GKV-Patienten (90 % der Bevölkerung in Deutschland) die Versicherungsnummer genannt werden. Diese findet sich allerdings bis auf Weiters im Modul FALL.</em><br>\nIch vermute, da sollte Person stehen oder direkt auf das Profil PatientIn verwiesen werden?</p>\n</blockquote>\n<p>hm.. weder noch, der Satz klingt an der Stelle überflüssig und eig auch nicht ganz richtig. Ich nehme den mal raus... (wisst ihr noch wo der her kam <span class=\"user-mention\" data-user-id=\"194875\">@Danny Ammon</span>  <span class=\"user-mention\" data-user-id=\"197535\">@Josef Schepers</span> ?)</p>",
        "id": 225677148,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1612870975
    },
    {
        "content": "<p>Ganz frühe Version und dann vergessen? <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 225677283,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1612871001
    },
    {
        "content": "<p>oh ich merke gerade erst, dass wir in einem thematisch unpassenden Thread drin sind, <span class=\"user-mention\" data-user-id=\"260054\">@Yannick Börner</span> , bei neuen Themen sollten wir drauf achten auch neue Threads aufzumachen wenn es nichts passendes gibt, sonst kommt man da iwann durcheinander <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span></p>",
        "id": 225677618,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1612871059
    },
    {
        "content": "<p>Hallo Yannick,<br>\nvielen Dank fürs aufpassen.<br>\n\"90 % der Bevölkerung sind GKV-versichert.\" Das sieht wie mein Fußabdruck aus.<br>\nRichtig ist , dass die IK-Nummer der Krankenversicherung und die (fast eindeutige) Versicherungsnummer der Patientperson sich im Datensatz gemäß § 21 KHEntgG in der Tabelle FALL finden. Im MII KDS gehören beide mit Beginn- und eventuell Endekennung  in das Modul PERSON, Resource Patientin.<br>\nBG Josef</p>",
        "id": 225679878,
        "sender_full_name": "Josef Schepers",
        "timestamp": 1612872086
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span>  Hi Andrea, ich glaube da wurde zu unvorsichtig geklickt  :D Verzeihung!</p>",
        "id": 225998147,
        "sender_full_name": "Yannick Börner",
        "timestamp": 1613053766
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span> <span class=\"user-mention\" data-user-id=\"194952\">@Julian Sass</span>  Ich habe das Ausgangsthema und eine Möglichkeit der Modellierung  mal als Grafik dargestellt. <a href=\"/user_uploads/10155/LVhd9pcFrMWyQkC9BNVGG5cF/MedicationAdministration_copra.jpg\">MedicationAdministration_copra.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/LVhd9pcFrMWyQkC9BNVGG5cF/MedicationAdministration_copra.jpg\" title=\"MedicationAdministration_copra.jpg\"><img src=\"/user_uploads/10155/LVhd9pcFrMWyQkC9BNVGG5cF/MedicationAdministration_copra.jpg\"></a></div>",
        "id": 226796599,
        "sender_full_name": "Christian Schubert",
        "timestamp": 1613647584
    },
    {
        "content": "<p>Ja das sieht gut aus. So hatten wir uns den Aufbau im Modul Medikation auch gedacht.</p>",
        "id": 226798759,
        "sender_full_name": "Julian Sass",
        "timestamp": 1613649033
    },
    {
        "content": "<p>Ja, sehr schön. In unserem Copra hängen die Wirktstoffe an den Configs dran, aber ansonsten recht analog.</p>",
        "id": 226799322,
        "sender_full_name": "Georg Fette",
        "timestamp": 1613649400
    },
    {
        "content": "<p>In den Mappings hängen bei uns die gesamt-aggregierten Daten zu effectivePeriod und dose an der Mixture und nicht an der Application. Die Applications sind dann die Klein-Segmente von Dosis-Änderungen und dem jeweiligen Zeitraum, wie es auch im Kommentar im Diagramm steht</p>",
        "id": 226800007,
        "sender_full_name": "Georg Fette",
        "timestamp": 1613649744
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>  Die Periode der Mixtur müsste aber der gesamte Zeitraum der Gabe sein, also auch Ratenänderung mit einbezogen. Wenn das so ist, dann sollte man das mit beachten, d.h. man muss die Ratenänderung ja mit darstellen. Daher hatte ich gedacht, man nimmt nur den Zeitraum der Verabreichung. Mehrere Verabreichungen (durch MedicationAdministrations dargestellt) decken damit den gesamten Zeitraum der Gabe der Mixtur.</p>",
        "id": 226886354,
        "sender_full_name": "Christian Schubert",
        "timestamp": 1613684878
    },
    {
        "content": "<p>Ja, die Mixture hat das komplette Mantel-Intervall, die Verabreichungen nur das Intervall mit der jeweiligen Rate. In den FHIR-Applications müsste das dann analog abgebildet werden oder man läßt den Teil mit den einzelnen Rate-Intervallen weg.</p>",
        "id": 226939753,
        "sender_full_name": "Georg Fette",
        "timestamp": 1613727355
    },
    {
        "content": "<p>Da wir die Flussraten in Jena mit modellieren wollten, hatten wir heut noch eine Ergänzung zu \"<span class=\"user-mention silent\" data-user-id=\"382750\">Christian</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BMedication.5D.20Hierarchische.20Kombination.20von.20Medikationen/near/226796599\">said</a>\" überlegt. <br>\nEine übergeordnete MedicationAdministration, welche die Copra Mixtur wiedergibt und auf die Applikation(en) / \"unter\" MedicationAdministration(s) verweist, in denen die Flussratenersichtlich sind. Die Verlinkung(en) sollten über supportingInformation(Reference) aus der \"über\" MedicationAdministration erfolgen. So hätte man auch die Möglichkeit die \"unter\" MedicationAdministrations herauszufiltern, wenn die Flussraten keine Rolle spielen sollten. Eine Alternative wäre, den Zusammenhang der MedicationAdministrations der Applikation ohne Mixtur MedicationAdministration über identifier herzustellen. Dieser Zusammenhang wird dann evntl. nicht über das bloße Ansehen der FHIR Ressourcen ersichtlich und die gesamte Dauer der Gabe müsste \"errechnet\" werden.</p>",
        "id": 228426995,
        "sender_full_name": "Christian Schubert",
        "timestamp": 1614698381
    },
    {
        "content": "<p>Nur weil es zwischendurchmal um Medication als \"Metadaten\" ging: Mit MedicationKnowledge könnte man wohl auch solche Mixturen beschreiben (in einem Catalog).  Und dann über MedicationAdministration.medication.concept referenzieren - also \"by class\", und nicht \"by instance\".  Und/oder das gleiche eine Ebene tiefer für die einzelnen ingredient-Medications.</p>",
        "id": 228474577,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614714972
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span>  Danke für den Hinweis! MedicationKnowledge würde damit die \"über\" Medication ersetzen. Es würden aber immer noch mehrere MedicationAdministrations benötigt werden, um die Flussraten einer Gabe zu dokumentieren, da in MedicationKnowledge einer Dosierung kein Zeitraum zugordnet werden kann, wenn ich das richtig sehe.</p>",
        "id": 228933661,
        "sender_full_name": "Christian Schubert",
        "timestamp": 1614941624
    },
    {
        "content": "<p>Hättest Du Interesse, das Thema mal kurz auf Englisch in ein paar PPT-Seiten zusammen zu fassen? Dann stelle ich (oder Du) das gerne in der HL7 Pharmacy WG mal vor. Immer Montags 22-23 Uhr.</p>",
        "id": 228959447,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614953516
    }
]