[
    {
        "content": "<p>Hallo zusammen,<br>\nWir arbeiten gerade an der Abbildung von Aufnahme und Entlassmedikation. Aufgrund der Vorarbeiten beim Bundeseinheitlichen Medikationplan hätten wir hier spontan MediationStatements verwendet. (Falls jemand hier schon Feedback hat, gerne her damit!) <br>\nWir überlegen jetzt, wie wir aus einem Haufen MedicationStatments die herausfinden könne, die Aufnahme- und Entlassmedikation eines Aufenthaltes waren. Spontan fällt uns nur Zeitstempel ein, aber das wird schnell komplex. Dabei ist das ja eigentlich prinzipiell was anderes als Verordnungen/Gaben während eines Aufenthaltes. <br>\nKennen andere dieses Problem? Wie habt/hättet ihr es denn gelöst?</p>",
        "id": 252636511,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1631198159
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span></p>",
        "id": 252639711,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1631199210
    },
    {
        "content": "<p>An der Stelle sind wir zwar derzeit noch nicht in der Detailbetrachtung, aber mal folgende erste Überlegungen:</p>\n<p>Streng genommen ist \"Aufnahmemedikation\" bzw. \"Entlassmedikation\" keine medizinische, sondern eine organisatorische Information. Das ist einfach die (Liste der) Medikationen, die \"zufällig\" zu einem gewissen Zeitpunkt, (Aufnahme in das bzw. Entlassung aus dem Krankenhaus) gültig war.<br>\nPlatt formuliert: das sind auch nur 2 Medikationspläne und zu deren Abbildung würde ich mich sehr stark am Medikationsplan Plus  orientieren (Achtung: der MP Plus ist noch FHIR STU3).</p>\n<p>MP Plus verwendet hier eine List-Ressource, um die betreffenden MedicationStatements zu bündeln: <a href=\"https://simplifier.net/medikationsplanplus/medicationstatementlist-1\">https://simplifier.net/medikationsplanplus/medicationstatementlist-1</a><br>\nList.code könnte dann, abweichend vom MP Plus Profil, Codes für \"Aufnahmemedikation\" und \"Entlassmedikation\" enthalten.</p>",
        "id": 252748092,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1631261115
    },
    {
        "content": "<p>List.Code ist eine sehr gute Idee. Mir wäre noch eine Composition  eingefallen wenn man das als Dokument sehen würde</p>",
        "id": 252767972,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1631271569
    },
    {
        "content": "<p>Aber List ist deutlich leichtgewichtiger falls das kein Dokument darstellen soll.</p>",
        "id": 252768057,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1631271605
    },
    {
        "content": "<p>Als Dokument sehe ich das eher nicht, da es hier ja doch eher um die Verwendung der Informationen im klinischen Workflow geht (und evtl. später dann zur Einbindung z.B. in einen Entlassbrief, wobei dann der Entlassbrief das Dokument ist, aber nicht der Medikationsplan)</p>",
        "id": 252913510,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1631370943
    },
    {
        "content": "<p>siehe dazu auch aktuelle Arbeiten in der HL7 Pharmacy WG, Thema “Medication List Guidance project”, Notizen auf <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=79496279\">https://confluence.hl7.org/pages/viewpage.action?pageId=79496279</a></p>",
        "id": 253283206,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1631638082
    },
    {
        "content": "<p>Das Thema hat noch mehr Aspekte, u.a. dass die Aufnahmemedikation z.B. in einer Anamnese vom Patienten erfragt wurde, während die Entlassmedikation ja eine Art Empfehlung für die Weiterbehandlung ist. Ich fände das sinnvoll, wenn das jeweils in einem \"einzelnen\" MedicationStatement bereits ersichtlicht ist. Welche Möglichkeiten gäbe es da noch, neben z.B. einer Nutzung von informationSource und category?</p>",
        "id": 256703472,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1633680590
    }
]