[
    {
        "content": "<p>Hallo, ich bin dabei Medikamenten-Verordnungen auf Intensivstationen zu modellieren. Das <code>Modul Medikation</code> beschreibt die Verwendung der FHIR-Ressourcen <code>MedicationAdministration</code> und <code>MedicationStatement</code>. Ich bin etwas verunsichert wie Verodnungen von Medikamenten (Medikationspläne in einer Intensivstation) abgebildet werden sollten.<br>\nNach meinem Verständnis wird die eigentliche Verabreichung mit Hilfe der <code>MedikationAdministration</code> abgebildet.<br>\nWas hat es nun mit <code>MedicationStatement</code> auf sich?</p>\n<p>Die Medikamentenverordnung sollte meiner bescheidenen Meinung nach mit der Ressource <code>MedicationRequest</code> abgebildet werden, von der im <code>Modul Medication</code> aber gar nicht die Rede ist. Ist hier etwa<code>MedicationStatement</code> für die Verordnung vorgesehen?<br>\nViele Grüße</p>",
        "id": 217407675,
        "sender_full_name": "Christian Nau",
        "timestamp": 1605882749
    },
    {
        "content": "<p>MedicationStatement kommt typischerweise im Patienten-bezogenen Medikationsplan vor und sagt im Prinzip aus: Der Patient nimmt dieses Medikament (entw. laut eigener Aussage oder laut einer Verordnung), es sagt aber nichts darüber aus, ob und wann der Patient das Medikament tatsächlich <em>ein</em>genommen hat (Patient kann lügen oder sein Rezept nicht einlösen...)<br>\nMedicationAdministration dient tatsächlich dazu den verifizierten Akt einer Medikamentengabe zu dokumentieren. Wäre in deinem UseCase also mutmaßlich das Mittel der Wahl.</p>",
        "id": 217416232,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605886624
    },
    {
        "content": "<p>Paradebeispiel für MedicationStatement:<br>\n<a href=\"/user_uploads/10155/15dV_DnB7Kel6XYZADVO78GY/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/15dV_DnB7Kel6XYZADVO78GY/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/15dV_DnB7Kel6XYZADVO78GY/image.png\"></a></div>",
        "id": 217416431,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605886705
    },
    {
        "content": "<p>Also weder eine Verordnung noch die Dokumentation einer konkreten Einnahme, sondern irgendwas dazwischen...</p>",
        "id": 217416551,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605886764
    },
    {
        "content": "<p>Auf ICU würde ich am ehesten das Pärchen  MedicationRequest (Arzt ordnet an) / MedicationAdministration (Pflege hat verabreicht) sehen...</p>",
        "id": 217417119,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605886991
    },
    {
        "content": "<p>Danke für die schnelle Rückmeldung <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> !<br>\nNa dann lag ich mit meinem Plan ja schon genau richtig. Danke für das Feedback und die Klarstellung für was <code>MedicationStatement</code> zum Einsatz kommt.</p>",
        "id": 217417841,
        "sender_full_name": "Christian Nau",
        "timestamp": 1605887287
    },
    {
        "content": "<p>Medication Statement ist eine Aussage über die Medikation außerhalb des primären controlled Workflow request-administration-dispensation, also quasi \"aus zweiter Hand\".</p>",
        "id": 217443329,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1605898403
    },
    {
        "content": "<p>Ok super, danke. Das bestätigt nochmal, dass ich für meinen Use-Case korrekterweise auf die Verwendung von <code>MedicationStatement</code> verzichte und anstatt dessen <code>MedicationRequest</code> + <code>MedicationAdministration</code> verwende.</p>",
        "id": 217768253,
        "sender_full_name": "Christian Nau",
        "timestamp": 1606231524
    },
    {
        "content": "<p>Vielleicht mit der Ausnahme: Was über die Medikation im Vorfeld des ICU-Aufenthaltes so alles bekannt ist. Denn das wären vermutlich Medication Statements, zumindest teilweise.</p>",
        "id": 217816814,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1606253764
    }
]