[
    {
        "content": "<p>Heute wurde im POLAR-Kreis die Medication-Ressource diskutiert und dabei auf die Abbildung der <code>ingredients</code> über <code>Wirkstofftyp</code> und <code>Wirkstoffrelation</code> eingegangen. Es ging insbesondere um die physikalisch existierenden ingredients (z. B. das Salz eines Wirkstoffs) vs. den \"virtuellen\" ingredients, welche die effektive Wirkstoffkonzentration widerspigeln, die sich aus den phyikalischen ingredients ergibt.</p>\n<p>Die Frage dazu: Dies ist ja vermutlich keine nationale Besonderheit – wie kommt es, dass wir es in den MII-KDS-Profilen über Extensions abbilden und nicht im R4-Standard? Wie wird dies denn anderenorts auf der Welt abgebildet?</p>",
        "id": 232444870,
        "sender_full_name": "Marcus Wurlitzer",
        "timestamp": 1617117885
    },
    {
        "content": "<p><span aria-label=\"notifications\" class=\"emoji emoji-1f514\" role=\"img\" title=\"notifications\">:notifications:</span> <span class=\"user-mention\" data-user-id=\"194952\">@Julian Sass</span></p>",
        "id": 232543407,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1617172833
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"263785\">@Marcus Wurlitzer</span>, wir haben damals bei der Recherche in der KDS Gruppe auch international keine vergleichbare Umsetzung gefunden und haben dann nach FHIR 80/20 gesagt, dass <code>Wirkstofftyp</code> und <code>Wirkstoffrelation</code> in die 20% fallen und die Extensions definiert. Die Terminologie hinter <code>Wirkstofftyp</code> hat RxNorm zum Vorbild.</p>",
        "id": 232545975,
        "sender_full_name": "Julian Sass",
        "timestamp": 1617174815
    },
    {
        "content": "<p>Die Resourcen aus dem Medications Modul wurden entworfen, um den Gebrauch von Arzneimitteln in der Versorgung zu unterstützen (z. B. Medication: \"This resource is primarily used for the identification and definition of a medication for the purposes of prescribing, dispensing, and administering a medication as well as for making statements about medication use.\"). <br>\nFür Arzneimittelinformationen mit mehr Details, die darüber hinausgehen, gibt es eine ganze Reihe von Resourcen, die für den regulatorischen Bereich der Arzneimittelzulassung entworfen wurden. z. B. gibt es in <code>MedicinalProductIngredient.specifiedSubstance.strength.referenceStrength</code> die oben angesprochene Möglichkeit, die Wirkstärke bezogen auf unterschiedliche (\"virtuelle\") Referenzsubstanzen zu anzugeben.</p>",
        "id": 232563164,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1617184146
    },
    {
        "content": "<p>Danke <span class=\"user-mention\" data-user-id=\"194952\">@Julian Sass</span> und <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span>, das schaue ich mir einmal an. Die Frage, wie viel \"Katalogwissen\" in eine Medication-Ressource fließen soll, ist sicherlich interessant. Es entstand bei mir schon der Eindruck, dass sich sowohl die Suche via FHIR Search wie auch die spätere Datenauswertung vereinfachen lässt, wenn man tendenziell etwas mehr Informationen in die Medication-Ressource schreibt – zumal diese ja bestenfalls pro FHIR Server entsprechend des jeweiligen Hauskatalogs (und vielleicht sogar MII-weit) einmalig sind.</p>",
        "id": 232577004,
        "sender_full_name": "Marcus Wurlitzer",
        "timestamp": 1617191705
    },
    {
        "content": "<p>In Richtung \"Kataloge\" gedacht, wird außerdem noch an <code>MedicationKnowledge</code> gearbeitet - die liegt sozusagen \"zwischen\" der <code>Medication</code>und den regulatorischen (IDMP-)Resourcen, ergänzt dazu noch einiges wie z. B. Preisinformationen <code>cost</code>. Aber Wirkstärke via Referenzsubstanz scheint da auch nicht drin zu sein. Vielleicht wäre das hier eine sinnvolle Ergänzung..? Ich spreche das demnächst mal an in der HL7 PHARM WG.</p>",
        "id": 232634640,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1617212651
    }
]