[
    {
        "content": "<p>Die die Zuordnung Medikation / Fall gerade ua in POLAR Thema ist: Könnte man da (ähnlich wie bei den Diagnosen) noch Guidelines erarbeiten, auf welche \"Ebene\" (Einrichtingskontakt, Versorgungsstelllenkontakt usw) eines Falles der MedicationAdministration bzw Statement .context zeigen soll. Ob das nun eher in der Zustänigkeit des Medikation- oder des Fall-Teams liegt kann ich gerade nicht zuordnen.</p>",
        "id": 258536620,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1634819713
    },
    {
        "content": "<p>Aus praktischen Gründen würde ich mir die oberste Ebene (Einrichtungskontakt?) wünschen ;)</p>",
        "id": 258536846,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1634819798
    },
    {
        "content": "<p>Unbedingt, dies ist gerade auch in der Abstimmung mit der gematik ein Thema. Oberste Ebene (Einrichtungskontakt) wäre erstmal unter Vorbehalt die Empfehlung.</p>",
        "id": 258541241,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1634821442
    },
    {
        "content": "<p>Wir sind gerade bei ISiK (in Abstimmung mit MI-I) dabei, das zu klären. Einrichtungskontakt wäre natürlich das einfachste, ist aber nach Aussage einiger Primärsystemhersteller (z.B. SAP, ISHmed) gar nicht möglich.</p>\n<p>Es wäre wünschenswert, dass die Verlinkung auf allen Ebenen möglich ist (z.B. Krankenhaus-Haupdiagnose, Behandlungsvertrag auf Ebene 1; Fachabteilungshauptdiagnose, Medikation (in Verantwortung der Fachabteilung) auf Ebene 2; Konsil-Dokumentation, OP-Dokumentation auf Ebene 3. <br>\nEs sollte für Clients aber dennoch einfach möglich sein, alle Infos zu einem Patienten mit einer Query zu finden und nicht mehrfach und in unterschiedlichen Tiefen in die Encounter reinchainen zu müssen.</p>\n<p>Eine Möglichkeit dafür wäre es, alle Encounter eines Falles (auf allen Ebenen) mit ein und dem selben Account (Abrechnungsfall) zu verknüpfen, der dann auch die Fallnummer als Identifier trägt. <br>\nDamit wäre es möglich, mit eine Query der Form <code>/&lt;ResourceType&gt;?encounter.account.identifier=1234</code>alle Instanzen von &lt;ResourceType&gt; mit dem selben (Abrechnungs-)Fallkontext abzufragen, unabhängig von der Encounter-Ebene, an der sie hängen.</p>\n<p>Kommentare dazu sind herzlich willkommen!!!</p>",
        "id": 258543281,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1634822289
    },
    {
        "content": "<p>Ich finde die Idee klingt gut, v.a. wenn man wie im gerade angelaufenen Projectathon Fälle zählen möchte. Dann zählt man die Accounts und kann mit zweimal _has auf die eigentlichen medizinischen Daten. An welcher Encounterbene die dann hängen wäre egal. <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 258544552,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1634822794
    }
]