[
    {
        "content": "<p>Hallo zusammen, <br>\nbei Modul Person haben wir gerade folgendes Problem: (<a href=\"https://simplifier.net/medizininformatikinitiative-modulperson/patientin/~issues/1010\">issue #1010</a>)<br>\nDie Hersteller von MPI Systemen hatten während der Kommentierungsphase geäußert, dass die Erfassung von mehr als einer Adresse Probleme beim Patienten-Matching verursachen könnte. Da bis zu dem Zeitpunkt auch kein Use-Case bekannt war in dem mehr als eine Adresse verwendet werden sollte, haben wir auch nur eine Adresse erlaubt. Jedoch scheint es  jetzt doch einen Use-Case zu geben wo dies von Relevanz sein könnte, nämlich bei der Covid-19 Rückverfolgung. Hier handelt sich aber laut Issue Meldung eher um die weitere Erfassung der Adresse des Arbeitgebers und nicht des Patienten selbst... Wir haben uns hierbei gefragt ob es Probleme gäbe wenn wir die Kardinalität wieder hoch setzen um wirklich alle Use-Cases abzudecken. Wenn weitere Constraints rein sollen, kann das ja eig. auch bei Bedarf \"lokal\" gelöst werden.<br>\nWas wäre generell eure Meinung zur Problematik?</p>",
        "id": 215820801,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1604654213
    },
    {
        "content": "<p>ich sehe auch so, dass mehreren Adressen in einer Ressource abgebildet werden sollen. Es werden bestimmt noch mehr Use-Cases kommen, in denen mehr als eine Adresse benötigt wird, deswegen bin auch für die Aufhebung der Einschränkung auf einer Adresse, und wie Andrea schon gesagt hat, die Constrains könnten evtl. lokal gelöst werden, umgekehrt aber nicht</p>",
        "id": 215826864,
        "sender_full_name": "Kutaiba Saleh",
        "timestamp": 1604658068
    },
    {
        "content": "<p>Dem kann ich ebenfalls nur zustimmen. Es wäre schade Informationen in der FHIR-Ausgabe verwerfen zu müssen, obowohl diese Vorhanden sind und auch für eventuellen Analysen genutzt werden könnten. Falls es irgendwo doch  Probleme mit mehr als einer Adresse geben sollte (wie hier beschrieben <a href=\"https://simplifier.net/medizininformatikinitiative-modulperson/patientin/~issues/1010\">https://simplifier.net/medizininformatikinitiative-modulperson/patientin/~issues/1010</a>) dann könnte die Einschränkung auf das use-Attribut stattfinden. Darüber könnte man eine Adresse herausfiltern.</p>",
        "id": 215830473,
        "sender_full_name": "Alexander Helhorn",
        "timestamp": 1604660274
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> für die Aufhebung der Max Kardinalität, da dadurch eine Inkompatibilität zu einigen anderen Deutschen Patienten-Profilen entsteht, die mehr Adressen erlauben (KBV Basis, Gematik(Isik), ...)</p>",
        "id": 216247508,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605030646
    },
    {
        "content": "<p>Grundsätzlich ja, das hat aber Auswirkungen auf die Systemarchitektur für/von Anwendungen..</p>",
        "id": 216313993,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1605079007
    },
    {
        "content": "<p>Die Adresse des Arbeitgebers kann doch über \"contact\" abgebildet werden, ohne das eigentliche Adressfeld zu verbiegen, oder interpretiere ich das falsch?</p>",
        "id": 216317927,
        "sender_full_name": "Detlef Kraska",
        "timestamp": 1605083195
    },
    {
        "content": "<p>Die Adresse des Arbeitgebers ist nicht meine Arbeitsadresse.</p>",
        "id": 216320717,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1605085379
    },
    {
        "content": "<p>Wäre das evtl. was für postal und physical? Also meine Arbeitsadresse -&gt; work &amp; physical, Adresse meines Arbeitgebers -&gt; work &amp; postal?</p>",
        "id": 216323204,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1605086906
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191549\">Frank Oemig</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BPERSON.5D.20Adressen.20Kardinalit.C3.A4t/near/216320717\">said</a>:</p>\n<blockquote>\n<p>Die Adresse des Arbeitgebers ist nicht meine Arbeitsadresse.</p>\n</blockquote>\n<p>Genau.</p>\n<p>Der Vorschlag von Detlef war Patient.contact.where(relationship = 'E').address  zu verwenden, nicht Patient.address .where(use='work')</p>\n<p>In diesem Fall die korrekte Abbildung.</p>",
        "id": 216323820,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605087244
    },
    {
        "content": "<p>Nichts desto trotz bleibe ich aber bei der Auffassung, dass die Kardinalität gelockert werden sollte.<br>\nEs gibt ja auch Situationen, wo der Patient eine \"zu Hause\"-Adresse hat, aber Mo-Fr. in eine andere Stadt pendelt, wo er/sie einen Zweitwohnsitz hat. Das wäre dann tatsächlich eine weitere Patient.address, unabhängig von der Adresse des Arbeitgebers.</p>",
        "id": 216324313,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605087583
    },
    {
        "content": "<p>Aus meiner Sicht sollten wir eine möglicherweise etwas aufwändigere, aber dafür nachhaltigeren Lösung wählen:<br>\nKardinalität lockern;<br>\n jede Adresse bekommt (ggf. optional) einen Gültigkeitszeitraum (Patienten ziehen um, Arbeitgeber wechseln, Kontaktadressen wechseln, ...), gerade für Auswertungen mit Regionalbezug ist der zeitliche Verlauf von Adressänderungen relevant;<br>\njede Adresse bekommt einen Adresstyp, mit dem gekennzeichnet werden kann, ob es tatsächlich die Meldeadresse oder eine andere Adresse ist. Dann ist auch klar, welche der ggf. mehreren Adressen beim Matching im MPI zu verwenden ist.</p>",
        "id": 216432023,
        "sender_full_name": "Thomas Wendt",
        "timestamp": 1605162153
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> Um Systeme nicht auszuschließen, die mit maximal einer Adresse umgehen können, wäre es sinnvoll ein eindeutiges Kriterium zu definieren, welches die \"wichtigste/primäre\" Adresse ist, so dass diese Systeme aus einer Ressource mit mehreren Adressen die geeignetste auswählen können.</p>",
        "id": 216446382,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605174176
    },
    {
        "content": "<p>Das sollte dann typischerweise die erste sein... für Systeme, die mit all den Attributen nichts anfangen können</p>",
        "id": 216536452,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1605218985
    },
    {
        "content": "<p>Wie wäre es, wenn wir die Kardinalität von 1..1 auf 1..* setzen, jedoch ein closed-slicing draus machen, mit einem Default-Slice mit required Elementen für Address.use und Address.type? Dann könnte ich immer über diese beiden Werte differenzieren.</p>",
        "id": 217268782,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1605792726
    },
    {
        "content": "<p>Würden wir dann davon ausgehen, dass die primäre Adresse die Adresse ist die entweder \"both\" oder \"postal\" im type hat ohne einen weiteren Discriminator?</p>",
        "id": 217414099,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1605885694
    },
    {
        "content": "<p>...davon kann es halt mehrere geben...</p>",
        "id": 217415346,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605886279
    },
    {
        "content": "<p>Die Frage wäre also: Wenn es mehrere gibt, ist die primäre dann einfach die erste (was bei der (De-)Serialisierung potentiell durcheinander geraten kann) oder muss es einen konkreten weiteren Indikator geben?</p>",
        "id": 217415518,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605886357
    },
    {
        "content": "<p>Deswegen hätte ich eine Kombi von .type und .use vorgeschlagen.</p>",
        "id": 217415801,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1605886454
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"312186\">@Thomas Wendt</span> <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> <span class=\"user-mention\" data-user-id=\"197079\">@Alexander Helhorn</span> <span class=\"user-mention\" data-user-id=\"193846\">@Kutaiba Saleh</span> Könntet ihr mit eueren Daten 1x testen, ob dieses Kriterium eindeutig ist?</p>",
        "id": 217417587,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1605887177
    },
    {
        "content": "<p>Ja. Fühlt sich ein bisschen nach Overkill an, aber ist die einzige Möglichkeit hier zu differenzieren...<br>\nAlternativ wäre halt die Annahme \"immer die erste\". Ist zwar kein guter Stil in FHIR, aber m.W. dürfte die Reihenfolge wiederholbarer Elemente bei Verwendung der gängigen Implementierungen stabil bleiben...</p>",
        "id": 217417593,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1605887180
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196715\">@Marvin Kampf</span></p>",
        "id": 217418054,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1605887399
    },
    {
        "content": "<p>Wenn ich die Frage richtig verstehe, geht es darum, ob eine primäre Adresse anhand von <code>.type==postal || .type==both</code> und <code>.use==home</code> eindeutig erkennbar ist?</p>\n<p>(Und wie würde die Adress-Historie abgebildet werden? Ich sehe für das Merkmal <code>.use</code> gibt es den Wert \"old\". Aber ein Zeitraum wäre vermutlich auch interessant, wenn man die Historie mit abbilden möchte, oder?)</p>\n<p>Leider kann ich noch keine eindeutige Antwort für Erlangen geben, da ich zum einen gerade keinen Zugriff auf die Daten habe und zum anderen noch nicht alle Unklarheiten bzgl. der Interpretation des DB-Schemas geklärt sind, aber ich bleibe dran.<br>\nGrundsätzlich haben wir im patientenführenden System (SAP) nicht beliebig viele Adressen pro Patient, sondern ich glaube maximal 2 oder 3 plus spezielle Adressen der Angehörigen oder Kontaktpersonen.<br>\nAber gerade letzteres bringt mich zu der Annahme, dass \"postal\" + \"home\" als Kriterium evtl. nicht ausreichen wird.</p>",
        "id": 217432552,
        "sender_full_name": "Marvin Kampf",
        "timestamp": 1605893121
    },
    {
        "content": "<p>Alte Adresse könnte ich mit .use = 'old' und einem Zeitraum in .period kennzeichnen.</p>",
        "id": 217439640,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1605896500
    },
    {
        "content": "<p>Kontaktpersonen ist kein Problem, da dies unter Patient.contact.address abgebildet werden sollte und nicht Patient.address.</p>",
        "id": 217439789,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1605896575
    },
    {
        "content": "<p>Wir haben eine kleine Prüfung bei uns vorgenommen. Im SAP ist es bei uns genauso wie es <span class=\"user-mention\" data-user-id=\"196715\">@Marvin Kampf</span> bereits geschrieben hat. Wir halten max. zwei Adressen für den Patieten vor. Adressen für Kontaktpersonen zählen da nicht rein. Eine Unterscheidung welche Adresse wichtiger oder weniger wichtig ist (Hauptwohnsitz, Nebenwohnsitz, ...) wird m.E. nicht vorgenommen. Wenn zwei Adressen angegeben werden, sind beide gleich relevant. Beide Adressen können auch <code>use=home</code> und <code> type==pyhsical </code> aufweisen.</p>\n<p>Auch wenn die Einschränkung wegen der MPI-Thematik auf eine Adresse wäre, wüssten wir also nicht welche der beiden Adressen wir entfernen müssten.  Meiner Meinung nach muss ein MPI-System auch mit mehreren Adressen umgehen können. Auch über die HL7v2-Strecke können doch mehrere Adressen übergeben werden? Wie erfolgt da der Umgang?</p>",
        "id": 218108065,
        "sender_full_name": "Alexander Helhorn",
        "timestamp": 1606493810
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 218440350,
        "sender_full_name": "Kutaiba Saleh",
        "timestamp": 1606838029
    },
    {
        "content": "<p>Auf welcher Basis wird dann entschieden welche Adresse für die Kommunikation mit dem Patienten verwendet wird?</p>",
        "id": 218664253,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1606983856
    },
    {
        "content": "<p>Ich denke, es wird Adresse 1 probiert und wenn da der Kontaktversucht fehlschlägt, nimmt man Adresse 2. Ein anderes Kriterium gibt es ja nicht…</p>",
        "id": 218679049,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1606993641
    },
    {
        "content": "<p>Wenn ich einen Brief schreiben wollte, wäre meine erste Wahl type=postal|both und use!=work|old<br>\nBei null Treffern nehme ich einfach die erste in der Liste...</p>",
        "id": 218683006,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1606996188
    },
    {
        "content": "<p>Hallo,<br>\nmöglicherweise wäre auch eine Orientierung an der OSCI XMELD 242 Spezifikation denkbar: <a href=\"http://www.osci.de/xmeld242/2019-01-31_OSCI-XMeld_242_Spezifikation_final.pdf\">http://www.osci.de/xmeld242/2019-01-31_OSCI-XMeld_242_Spezifikation_final.pdf</a>. Diese wird für Abrufe bei Melderegistern eingesetzt. Dabei wird in Wohnungsart (quasi für die Wohnhistorie, V.B.2.59 Wohnungsart, Seite 1532) und Wohnungsstatus (V.B.2.60 Wohnungsstatus, Seite 1533) unterschieden. Letzteres deklariert per Code=1, die Wohnung als Hauptwohnung.  VG Martin</p>",
        "id": 218819597,
        "sender_full_name": "Martin Bialke",
        "timestamp": 1607080419
    }
]