[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span> </p>\n<p><a href=\"https://simplifier.net/medizininformatikinitiative-modulprozeduren/~issues/877\">https://simplifier.net/medizininformatikinitiative-modulprozeduren/~issues/877</a></p>\n<p>Vielen Dank für deine Gegenüberstellung was bei euch im Primärsystem bezüglich der Prozeduren vorhanden ist und was bei uns im IG steht.<br>\nIch werde mich jedoch erstmal nur auf die offenen Punkte im IG beziehen, alles andere ist erstmal out-of-scope. Es darf natürlich in der FHIR Ressource zusätzlich ausgebildet werden.</p>\n<p>Procedure.bodySite: Hier geht es um eine genaue per SNOMED kodierte Körperstelle. Das altbekannte R/L/B sollte bitte als Extension in  Procedure.code:ops abgebildet werden. Eine entsprechender Hinweis findet sich nun im IG.</p>\n<p>Procedure.status: Welche Infos würdest du dir hier wünschen? Im MII Kontext wäre ich davon ausgegangen, dass meistens nur abgeschlossene Prozeduren sich im DIZ befinden würden. Ansonsten bietet sich immer der Wert \"unknown\" an.</p>",
        "id": 205511169,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1596132104
    },
    {
        "content": "<p>PING <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span></p>",
        "id": 206110065,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1596697146
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> ,<br>\nOh, ich hatte deine Frage in dem Post ganz überlesen, tschuldigung.<br>\nIch hatte nicht gesehen, dass im Profil die verschiedene Auswahlmöglichkeiten drin sind, irgendwie hatte ich gedacht das sei ein string-Feld. Bei uns würde ich überall \"completed\" eintragen. Ich denke das wird wahrhscheinlich bei allen Standorten so sein, da alle die Daten aus der Tabelle mit den durchgeführten OPS-Codes beziehen, aber die anderen Wahlmöglichkeiten dürften sicherlich nicht schaden.</p>",
        "id": 206110796,
        "sender_full_name": "Georg Fette",
        "timestamp": 1596697940
    },
    {
        "content": "<p>Kein Problem :) Also darf ich aus deiner Sicht dein Issue schließen? Oder besteht noch Änderungsbedarf?</p>",
        "id": 206110823,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1596698005
    },
    {
        "content": "<p>ja, kannst du machen</p>",
        "id": 206110932,
        "sender_full_name": "Georg Fette",
        "timestamp": 1596698131
    }
]