[
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"213004\">@Mike Wähnert</span>  <span class=\"user-mention\" data-user-id=\"238760\">@Christoph Döllinger</span> <span class=\"user-mention\" data-user-id=\"263785\">@Marcus Wurlitzer</span> <br>\nbzgl. <a href=\"https://simplifier.net/medizininformatikinitiative-modulbiobank/~issues/1637\">https://simplifier.net/medizininformatikinitiative-modulbiobank/~issues/1637</a><br>\nhaben wir die Kardinalität von fastingStatus auf 0..1 gesetzt. Es bleibt aber weiter MustSupport, wir würden in dem Zusammenhang nochmal darauf hinweisen wollen das 'Not Given' hier auch eine Option ist.<br>\nDamit sollte das Issue gelöst sein?</p>",
        "id": 258334003,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1634720256
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span>, danke für die Rückmeldung. Das Weglassen des <code>fastingStatus</code> an Stelle von 'Not Given' würde ich bei solchen Proben bevorzugen, wo der fastingStatus nicht relevant ist und/oder nicht bekannt sein kann. Beispiele: Tumorbiopsie, Gewebeproben aus Autopsien. <code>fastingStatus = 'Not Given'</code> wäre entsprechend für solche Proben, wo der fastingStatus im Prinzip interessant wäre, aber explizit nicht bekannt ist. Sehe ich das in etwa richtig? Ansonsten hätte ich keine weiteren Anmerkungen zu dem Issue.</p>",
        "id": 258354052,
        "sender_full_name": "Marcus Wurlitzer",
        "timestamp": 1634731044
    },
    {
        "content": "<p>\"Not Given - Patient was not asked at the time of the procedure.\"<br>\nAlso wenn man den fastingStatus sicher nicht erhoben hat. Autopsien wären vermutlich einer der wenigen Fälle wo auch dieser Code \"not applicable\" ist. Einen leeren Status würde ich außer \"not applicable\" sonst als \"Diese Information gibt es möglicherweise, aber wir haben sie gerade nicht im System (sondern uU in einer anderen Datenbank oder auf Papier)\" interpretieren. Nach dem Feedback was wir erhalten haben ist gerade letzteres wohl häufiger der Fall.</p>",
        "id": 258355258,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1634731632
    },
    {
        "content": "<p>Was würdest du dann bei Autopsieproben angeben? 'Not Given' oder weglassen? Aus Implementierungssicht wäre meine Denkweise, dass <code>fastingStatus</code> hier keine Rolle spielt und daher nicht als Datenitem auftaucht.</p>",
        "id": 258386263,
        "sender_full_name": "Marcus Wurlitzer",
        "timestamp": 1634743055
    },
    {
        "content": "<p>Sehr gute Frage. Den Buchstaben nach 'Not Given', weil man den Patienten ja nicht mehr fragen kann. Wobei die Sinnhaftigkeit hier natürlich grenzwertig ist. Hat jemand hier uU schon Erfahrungen mit diesen Codes und kann dazu etwas beitragen? Ansonsten würde ich das wieder mit in die Biobanken-EpxtertInnenrunde nehmen und dort vorlegen.</p>",
        "id": 258496934,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1634799743
    },
    {
        "content": "<p>Bei Pathologieproben spielt der fastingStatus tatsächlich keinerlei Rolle und wird daher weder mitgeteilt noch abgefragt = 'Not Given' oder weglassen. Not applicable träfe nicht zu, da es ja eine Antwort geben könnte.</p>",
        "id": 259058125,
        "sender_full_name": "Gunter Haroske",
        "timestamp": 1635231371
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221444\">Noemi Deppenwiese</span> has marked this topic as resolved.</p>",
        "id": 261504771,
        "sender_full_name": "Notification Bot",
        "timestamp": 1636987126
    }
]