[
    {
        "content": "<p>Eine Frage zum Modul Fall bzw. dem Profil \"Kontakt mit einer Gesundheitseinrichtung\".<br>\nBezieht sich dieses Profile auf den Abrechnungsfall oder auf eine Aufnahme?<br>\nBeispiel wäre ein Patient der 2 mal (in einem kurzem Zeitraum) ambulant aufgenommen wird. Dieser hätte in unserem Quellsystem nur einen Abrechnungsfall, jedoch 2 Aufnahmen.<br>\nWenn ich das Profil richtige verstehe würde es hier zu 2 FHIR Ressourcen kommen, für jede ambulante Aufnahme eine Ressource.<br>\nEine andere Möglichkeit wäre nur eine Ressource für den Abrechnungsfall zu erstellen unter dem beide Aufnahmen fallen, und dann den Verlauf über die ClassHistory abzubilden.<br>\nDie 3. Option wäre natürlich FHIR-Ressourcen sowohl für den Abrechnungsfall als auch die 2 Aufnahmen zu erstellen, und die Aufnahmen dann über das Part-Of Feld mit den Abrechnungsfall zu verbinden. Hier wäre dann nur die Frage welche Encounter Ressource für die Context-Referenz von zB Medikation, Diagnose, und Labor verwendet werden soll.</p>\n<p>Welche Variante wäre hier zu implementieren?</p>",
        "id": 267706022,
        "sender_full_name": "Dorian Quell",
        "timestamp": 1641983267
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"388365\">Dorian Quell</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/.5BFALL.5D.20Interpretationfrage.20zum.20Encounter-Profil/near/267706022\">said</a>:</p>\n<blockquote>\n<p>Eine Frage zum Modul Fall bzw. dem Profil \"Kontakt mit einer Gesundheitseinrichtung\".<br>\nBezieht sich dieses Profile auf den Abrechnungsfall oder auf eine Aufnahme?</p>\n</blockquote>\n<p>Aufnahme, den Abrechnungsfall haben wir bei der ersten Modellierungsphase aufgrund der laufenden Diskussionen zu der Zeit (zum Thema Account oder Encounter) rausgelassen. </p>\n<blockquote>\n<p>Beispiel wäre ein Patient der 2 mal (in einem kurzem Zeitraum) ambulant aufgenommen wird. Dieser hätte in unserem Quellsystem nur einen Abrechnungsfall, jedoch 2 Aufnahmen.<br>\nWenn ich das Profil richtige verstehe würde es hier zu 2 FHIR Ressourcen kommen, für jede ambulante Aufnahme eine Ressource.</p>\n</blockquote>\n<p>korrekt</p>\n<blockquote>\n<p>Eine andere Möglichkeit wäre nur eine Ressource für den Abrechnungsfall zu erstellen unter dem beide Aufnahmen fallen, und dann den Verlauf über die ClassHistory abzubilden.<br>\nDie 3. Option wäre natürlich FHIR-Ressourcen sowohl für den Abrechnungsfall als auch die 2 Aufnahmen zu erstellen, und die Aufnahmen dann über das Part-Of Feld mit den Abrechnungsfall zu verbinden. Hier wäre dann nur die Frage welche Encounter Ressource für die Context-Referenz von zB Medikation, Diagnose, und Labor verwendet werden soll.</p>\n<p>Welche Variante wäre hier zu implementieren?</p>\n</blockquote>\n<p>Ja, wäre vom Prinzip her möglich und tatsächlich auch ursprünglich so ähnlich gedacht, nur erstmal auf stationäre Fälle begrenzt. Die Kontaktarten vorstationär, nachstationär und ambulant sind im einfachen Aufbaumodell vom Modul Fall erstmal unberücksichtigt geblieben. Ansonsten ist es aber mit den Kontaktebenen so gedacht: Versorgungsstellenkontakt &lt;partOf&gt; Abteilungskontakt &lt;partOf&gt; Einrichtungskontakt. Wobei Einrichtungskontakt den zeitlichen Verlauf von der Aufnahme bis zur Entlassung enthalten sollte. Den Verlauf über die classHistory abzubilden ist auch ein Ansatz der im Rahmen von ISiK Stufe 2 diskutiert wurde um den zeitlichen Verlauf zu weiteren vor-/nachstationären Fällen zu integrieren. Was aber das Ganze ziemlich durcheinander geraten lassen würde, weil der übergreifende Einrichtungskontakt dann Daten in classHistory hätte, die in der Zukunft  liegen und somit auch über die Verweildauer hinweg gehen würden... Zur Zeit gehen wir so vor, dass sowas wie die Diagnose vom Einrichtungskontakt aus über .diagnosis referenziert wird. Sollte die Diagnose auf Encounter referenzieren wollen, muss hierbei drauf geachtet werden, dass es sich hierbei um den Kontakt handeln soll im Rahmen dessen die Diagnose festgestellt wurde, wäre also meistens eher ein Abteilungskontakt. Ansonsten soll aber generell die Doku am Einrichtungskontakt hängen. </p>\n<p>Wir werden die nächsten Wochen das Modul Fall inkl. IG auf aktualisieren. Im Rahmen der Projectathon sollte aber dennoch meines Wissens nach das zuletzt veröffentlichte Package verwendet und somit nur das einfache Aufbaumodell implementiert werden.</p>",
        "id": 268015289,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1642168033
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"388365\">Dorian Quell</span> has marked this topic as resolved.</p>",
        "id": 268350966,
        "sender_full_name": "Notification Bot",
        "timestamp": 1642489823
    }
]