[
    {
        "content": "<p>Hallo,</p>\n<p>gibt es in der MI-Initiative die Absicht, eine standardisierte Schnittstelle für die Anbindung von Anonymisierung- und Pseudonymisierungsdiensten zu spezifizieren? Falls ja: basierend auf FHIR oder anders?</p>",
        "id": 154020062,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542793624
    },
    {
        "content": "<p>Es gibt hierzu bereits inoffizielle Überlegungen innerhalb von HIGHmed, da wir in Heilbronn für den Datenschutz in HIGHmed zuständig sind werden wir eine Schnittstelle mittels FHIR vorschlagen.</p>",
        "id": 154020111,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1542799937
    },
    {
        "content": "<p>Top! Ich melde hiermit im Namen der Projektgruppe „KI“ des bvitg ebenfalls Interesse sowie Kooperationswillen an :)</p>",
        "id": 154020115,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1542801511
    },
    {
        "content": "<blockquote>\n<p>Es gibt hierzu bereits inoffizielle Überlegungen innerhalb von HIGHmed, da wir in Heilbronn für den Datenschutz in HIGHmed zuständig sind werden wir eine Schnittstelle mittels FHIR vorschlagen.</p>\n</blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>  das ist ja super - habe ich da was verpasst? Wir setzen gerade eine Pseudonymisierungs Schnittstelle in FHIR für das nNGM (<a href=\"https://www.nngm.de/\" target=\"_blank\" title=\"https://www.nngm.de/\">https://www.nngm.de/</a>) um. Wir verwenden dabei den Pseudonymisierungsdienst des DKTK (im Prinzip die Mainzelliste). Weitere Komponenten sind ein Physician Master Index (<a href=\"https://clinicalsite.org/\" target=\"_blank\" title=\"https://clinicalsite.org/\">https://clinicalsite.org/</a>) und eine MPI (sagen wir MPI-ähnliches Konstrukt)  - im Prinzip ist die Schnittstelle vom Pseudonymisierungsdienst und EMPI an sich unabhängig.</p>\n<p>Welche Szenarien musst du genau abdecken? Mich würde sehr interessieren wie du deine Bundles aufteilst ... Arbeitest du auf encounter oder auf episode Ebene? Können wir die Extensions vergleichen (u.a. ResearchSubject) - idealerweise gleichen wir sie an. Vielleicht kürzen wir die Sache mit einem telefonat morgen ab!?</p>\n<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>, <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>   you too?</p>",
        "id": 154021112,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1543340666
    }
]