[
    {
        "content": "<p>Für ein internes Projekt möchten wir die IK-Nummer anderer Krankenhäuser/Ärzte/etc. gerne auflösen, v.A. für Zuverlegungen. Gibt es hierzu bereits eine ConceptMap o.Ä., die wir auf dem Terminologieserver einbinden können? Andernfalls müsste man betreffende Information aus den Stammtabellen des KIS ziehen. Als Problem sehen wir hier die fehlende Aktualität/Vollständigkeit: eine neue IK-Nummer in der Stammtabelle muss erst in die ConceptMap eingetragen werden.</p>",
        "id": 239557331,
        "sender_full_name": "Christoph Müller",
        "timestamp": 1621501413
    },
    {
        "content": "<p>Auf was soll den aufgelöst werden? Also IK-Nummer geht rein, aber was soll rauskommen?</p>",
        "id": 239558343,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1621501940
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221444\">Noemi Deppenwiese</span> <br>\nGenau, die IK-Nummer geht rein. <br>\nRaus kommen sollte mind. Name der Einrichtung und Adresse.</p>",
        "id": 240432529,
        "sender_full_name": "Christoph Müller",
        "timestamp": 1622102821
    },
    {
        "content": "<p>Das ist IMHO dann kein Fall für eine ConceptMap, sondern eine Suche nach einer Organization anhand des Identifiers mit dem system '<a href=\"http://fhir.de/NamingSystem/arge-ik/iknr\">http://fhir.de/NamingSystem/arge-ik/iknr</a>' und der jeweiligen IK Nummer als value. In der Organizatio kann man dann weitere Daten wie Name, Adresse usw. auch strukturiert hinterlegen. Man müsste also mMn eher über ein Organization-basiertes Verzeichnis aller Einrichtungen mit IK-Nummern nachdenken.</p>",
        "id": 240440660,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1622108143
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> vielen Dank erstmal für die Antwort! :) </p>\n<p>\"ein Organization-basiertes Verzeichnis aller Einrichtungen mit IK-Nummern\"  würde es natürlich gleich alles auf einmal erschlagen! So etwas wäre dann aber zu pflegen durch die arge-Ik, oder? Würde man sowas beim Interop-Forum ansprechen?</p>\n<p>Für den Moment würden wir da wohl unser eigenes Verzeichnis aufbauen aus den Stammdaten des  KIS.</p>",
        "id": 257047065,
        "sender_full_name": "Christoph Müller",
        "timestamp": 1633950050
    }
]