[
    {
        "content": "<p>Hallo, was gibt es bisher in der MII an Überlegungen Data-Provenance in Resourcen zu dokumentieren ? Es gibt ja ein Provenance Profil. Gibt es bereits Standorte, die so etwas benutzen um diese Aspekte in ihren FHIR-Stores abzudecken ? Müsste man sowas nicht für die anstehenden Audits bezüglich Data-Quality mit drin haben, oder kann man darauf verzichten ?</p>",
        "id": 226484583,
        "sender_full_name": "Georg Fette",
        "timestamp": 1613463872
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>, Provenance war von Anfang ein Thema das auf der Roadmap der Taskforce Kerndatensatz stand und auch weiterhin steht. Das Problem ist hier, dass alle beteiligten Personen zu sehr ausgelastet sind um hier die Vorgaben auszuarbeiten und es in einem IG zu dokumentieren.</p>",
        "id": 226488407,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1613466637
    },
    {
        "content": "<p>Generell würde ich erwarten, dass in vielen Fällen ein Import aus einem Primärsystem aus einem Bundle von Ressourcen besteht. Pro Bundle würde ich eine Provenance Ressource mit Links auf alle Ressourcen im Bundle generieren.</p>",
        "id": 226488567,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1613466753
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193430\">Alexander Zautke</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/Data-Provenance/near/226488407\">said</a>:</p>\n<blockquote>\n<p>Hi <span class=\"user-mention silent\" data-user-id=\"196537\">Georg Fette</span>, Provenance war von Anfang ein Thema das auf der Roadmap der Taskforce Kerndatensatz stand und auch weiterhin steht. Das Problem ist hier, dass alle beteiligten Personen zu sehr ausgelastet sind um hier die Vorgaben auszuarbeiten und es in einem IG zu dokumentieren.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span> Bei MII Kunden von uns ist es definitiv ein Thema. <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>- geht es darum das die Anforderungen nicht klar sind?  Der Bedarf ist ziemlich fundamental und straight forward. Die wichtigsten Szenarien sind Abbildung von Qualität und Latenz von 'gleichen' Daten. Beispiel §21 Schnittstelle und Krebsregister Schnittstelle - hohe Latenz aber gute Qualität.  Die gleichen Datenelemente aus dem KIS - schnell aber lückenhaft . Wenn ich eine retrospektive Analyse mache ist die Latenz unwichtig. In Echtzeit-Monitoring und Pre-Screening schon. Dann haben wir das Thema der Intention - Provenance.entity.role  z.B. bei §21 Abrechnung vs. klinisch um ein Beispiel zu nennen.  Was gibt es sonst für Szenarien?</p>",
        "id": 226992852,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1613753623
    },
    {
        "content": "<p>Ich sehe anhand des Feedbacks ist das Thema nicht wirklich eine Prio für die MI-I Entscheider. <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> - wäre das etwas was wir bei den deutschen Basisprofilen aufnehmen könnten?</p>",
        "id": 229878423,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1615479726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> : Inwieweit muss die Ressource auf deutsche Gegebenheiten angepasst werden? Wenn ich mir die Ressource anschaue, bin ich da etwas unsicher, was gemacht werden muss, wenn wir Deutschland allgemein anschauen.</p>",
        "id": 230260105,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1615747542
    },
    {
        "content": "<p>Ja, sehe ich genau so. Provenance kann alles Mögliche sein von \"diese Infos hat der Patient mitgebracht\" zu \"diese Ressourcen hat der Kommserver aus einer V2-Nachricht extrahiert\" oder auch \"ich will einfach nur diese Ressourcen mit einer externen Signatur versehen\"...<br>\nWo sind da die gesamtdeutschen Gemeinsamkeiten...?<br>\nIch denke ein Provenance-Profil macht immer nur im Kontext eines Konkreten Anwendungsfalles Sinn.<br>\nIIRC hat IHE ein Provenance Profil für den Use Case \"Diese Ressourcen wurden aus einem Strukturierten Dokument extrahiert\" in <a href=\"https://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_mXDE.pdf\">mXDE</a></p>",
        "id": 230319598,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615802778
    },
    {
        "content": "<p><a href=\"https://github.com/IHE/fhir/blob/master/StructureDefinition/structuredefinition-IHE_QEDm_Provenance.xml\">https://github.com/IHE/fhir/blob/master/StructureDefinition/structuredefinition-IHE_QEDm_Provenance.xml</a></p>",
        "id": 230320192,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1615803068
    },
    {
        "content": "<p>ja sehe ich auch so - aber worauf ich mich mit der Frage beziehe ist genau die Aussage \"Provenance kann alles Mögliche sein\"</p>\n<p>Und gerade weil es anscheinend eine gute Abstimmung zwischen IsiK, Basisprofile von HL7 Deutschland, die Spezifikationen der KBV inbes. die KBV-Basisprofile die ,eRezept/eAU UND die Kerndatensatz-Module der MI-I gibt stelle ich die Frage. </p>\n<p>Aber wir können das auf die MI-I begrenzen. Was ist für die MI-I hinsichtlich provenance infos relevant wenn ein Medic Daten an das Konsortium sendet - \"diese Ressourcen kommen vom Kommserver oder von Subystem X/Y\" Punkt. Ist das ausreichend? Gibt es interkonsortial eine Erwartung über das absolute Minimum an Informationen?</p>",
        "id": 230578670,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1615923997
    },
    {
        "content": "<p>Und wenn das als ausreichend gesehen wird dann ist die Konsequenz dass wir keine Aussage über Qualität oder Latenz für die spätere Verwertung der Daten haben. Diese Informationen können ja aktuell nur über eine extension in proveneance abgebildet werden.</p>",
        "id": 230581772,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1615925117
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"194020\">Gustav Vella</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/Data-Provenance/near/230578670\">said</a>:</p>\n<blockquote>\n<p>Und gerade weil es anscheinend eine gute Abstimmung zwischen IsiK, Basisprofile von HL7 Deutschland, die Spezifikationen der KBV inbes. die KBV-Basisprofile die ,eRezept/eAU UND die Kerndatensatz-Module der MI-I gibt stelle ich die Frage. </p>\n</blockquote>\n<p>IsiK ist mit MI-I und KBV Basis harmonisiert, IsiK, MI-I und KBV basieren auf den Deutschen Basisprofilen.<br>\neinzig eAU und eRezept schlagen hier ein Stück weit aus der Art, da es sich dabei um hochspezialisierte Profile handelt, die div. gesetzliche/datenschutzrechtliche Vorgaben einhalten müssen und daher sehr stark constraint sind, was zu Inkompatibilitäten mit den anderen Spezifikationen führt.</p>",
        "id": 230834885,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1616060154
    },
    {
        "content": "<p>Wer Inkompatibilitäten zwischen Isik, MI-I, HL7-DE Basis und KBV Basis findet, darf diese gerne hier melden. Alle beteiligten Organisationen sind bestrebt, diese zu vermeiden/zu minimieren.</p>",
        "id": 230835285,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1616060309
    }
]