[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span> Folgendes Ticket müsste im Modul Diagnose noch aufgelöst werden: <a href=\"https://simplifier.net/medizininformatikinitiative-moduldiagnosen/~issues/831\">https://simplifier.net/medizininformatikinitiative-moduldiagnosen/~issues/831</a></p>\n<p>Könntest du erläutern zu welchem Zweck Diagnose.encounter bei euch im <a href=\"http://bbmri.de\">bbmri.de</a> IG verwendet wird?</p>\n<p>Das Problem, dass das Kümmererteam hier vermeiden wollte ist, dass man Diagnose.encounter leichtfertig verwendet. Nicht das ich sage, dass ihr es macht! Die Diagnose sollte für sich alleine stehend sein und der Encounter sollte entsprechender darauf referenzieren. Die Befürchtung ist, dass Condition.encounter verwendet wird für mehr als den Kontakt in dem die Diagnose festgestellt wird. Dies kann immer nur ein \"Versorgungsstellen-Kontakt\" sein, um im MII Modell zu bleiben. In den meisten Fällen sollte jedoch der Einrichtungskontakt auf die entsprechend relevanten Diagnosen verweisen (Sorry, Encounter.diagnose mit 1..1 war keine schlaue Idee...).</p>",
        "id": 214814618,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603879196
    },
    {
        "content": "<p>Ich würde vorschlagen, Diagnose.encounter wieder zu erlauben. Jedoch fällt mir wenig ein als eine fette Warnung im IG, dass man bitte genau hinschauen soll, welchen Encounter man dort referenziert.</p>",
        "id": 214814739,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603879264
    },
    {
        "content": "<p>PING <span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span></p>",
        "id": 214814759,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603879281
    },
    {
        "content": "<p>Ich beantworte das mal aus meiner Sicht in MIRACUM: Wichtig wäre v.A. die Verknüpfung zwischen Fall und Diagnose. Der Argumentation, dass man die Diagnosen auch an den \"richtigen\" Fall hängt, kann ich folgen. Für MIRACUM war es die schnellste Lösung, aufgrund der 1..1-Begrenzung den Encounter in der Diagnose zu erlauben, weil die Quellsysteme die Diagnosen meist so liefern (zugegebenermaßen nicht immer am \"richtigen\" Fall).</p>",
        "id": 214817124,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1603880630
    },
    {
        "content": "<p>In den Quellsystemen wird eben die Diagnose nicht mit einer gewissen Gültigkeit an die Person gehängt (wie es klinisch durchaus sinnvoll ist) sondern aus Abrechnungsgründen (und nahezu nur deswegen) an den Fall. Das ist einfach ein Problem der Sekundärdatennutzung. Die Information \"Von wann bis wann war der Patient an XY erkrankt.\" wird in absehbarer m.E. Zeit nicht so einfach verfügbar sein...</p>",
        "id": 214817306,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1603880752
    },
    {
        "content": "<p>Wenn der Encounter (ungeachtet der Ebene) 1..* Diagnosen erlauben würde, würde sich dann das Problem aus deiner Sicht erledigen?</p>",
        "id": 214817602,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603880906
    },
    {
        "content": "<p>Aus der Hüfte geschossen: Ja. Aber die Details der Modellierung kann <span class=\"user-mention\" data-user-id=\"221444\">@Noemi Deppenwiese</span>  immer besser abschätzen ;)</p>",
        "id": 214817658,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1603880950
    },
    {
        "content": "<p>Somit könnte ich immer alle Aufnahme Diagnosen und alle weiteren entstehenden Diagnosen an den Fall hängen (am Besten an den Einrichtungskontakt, falls man die Info hat)</p>",
        "id": 214817694,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603880973
    },
    {
        "content": "<p>Diagnose.encounter zu erlauben und eine Warnung dazuzuschreiben (meinetwegen auch ein warning-Constraint, ob man dieses feld WIRKLICH benutzen will) wäre meine favorisierte Lösung. Ich habe halt allgemein Bauchschmerzen, bei einem so nicht-speziellen Profil (es geht ja um alle Diagnosen im Klinikum, nicht nur z.B. um Diagnosen aufgrund von Genanalysen) ein Feld komplett zu verbieten. Wenn man dann noch einen internationalen IG implementieren will, der dieses Feld benutzt, dann hat man ein Problem.<br>\nIch kann mir auch gerade im Onko-Kontext vorstellen, dass es schon interessant ist zu wissen, in welchem Fall as in Einrichtungskontakt eine Diagnose gestellt wurde, ohne sich hilfsweise auf das Datum verlassen zu müssen. <span class=\"user-mention\" data-user-id=\"197482\">@Jori Kern</span></p>",
        "id": 214820011,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1603882367
    },
    {
        "content": "<p>Ich möchte zum einen unterstützen, dass Diagnose.encounter mit 1..1 wieder erlaubt wird. Speziell im Fall MIRACUM/Erlangen liegen die Diagnosen mit Referenz auf ihren Fall vor. Mit Fall meine ich in diesem Fall, was hier (so glaube ich) als Versorgungsfall betitelt wird (also jene Entität, die eine offizielle Fallnummer hat).</p>\n<p>Allerdings fällt mir kein Fall ein, für den auch Encounter.diagnosis auf z.B. 1..* gesetzt werden müsste. Kann mich da jemand aufklären? Es wäre jedenfalls (in meinem speziellen Fall) zusätzlicher (evtl. unnötiger?) Implementierungsaufwand.</p>",
        "id": 214820738,
        "sender_full_name": "Marvin Kampf",
        "timestamp": 1603882814
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"196715\">Marvin Kampf</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/encounter.20Feld.20verboten/near/214820738\">said</a>:</p>\n<blockquote>\n<p>Ich möchte zum einen unterstützen, dass Diagnose.encounter mit 1..1 wieder erlaubt wird. Speziell im Fall MIRACUM/Erlangen liegen die Diagnosen mit Referenz auf ihren Fall vor. Mit Fall meine ich in diesem Fall, was hier (so glaube ich) als Versorgungsfall betitelt wird (also jene Entität, die eine offizielle Fallnummer hat).</p>\n<p>Allerdings fällt mir kein Fall ein, für den auch Encounter.diagnosis auf z.B. 1..* gesetzt werden müsste. Kann mich da jemand aufklären? Es wäre jedenfalls (in meinem speziellen Fall) zusätzlicher (evtl. unnötiger?) Implementierungsaufwand.</p>\n</blockquote>\n<p>Vielen Dank für dieses Beispiel, ich gehe mal davon aus dass mit dem ersten Teil gemeint ist, dass die Diagnose und Fall Information in diesem Zusammenhang in HL7 v2 so vorliegt. In FHIR sollte die Information jedoch genau andersherum gespeichert werden (Encounter.diagnosis -&gt; Condition). Der Kontakt der die Fallnummer ist immer eine Versorgungsfall  (nach der Ballotierung nun in Einrichtungskontakt umbenannt). Diese sollte nicht in Condition referenziert werden, die Referenz sollte falls überhaupt notwendig auf einen Abteilungsfall (neu: Versorgungsstellenkontakt) zeigen.</p>",
        "id": 214825481,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603885918
    },
    {
        "content": "<p>Der Use Case für 1..* in Encounter.diagnosis ist dass ich alle Haupt- und Nebendiagnosen abbilden kann</p>",
        "id": 214825630,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603886010
    },
    {
        "content": "<p>Und in beiden Fällen komme ich immer über ein Reverse Chaining auf dem FHIR Server an die Diagnose wieder dran.</p>",
        "id": 214825730,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603886072
    },
    {
        "content": "<p>In der Implementierung müsste somit zunächst der Einrichtungskontakt angelegt werden (Encounter.period.start und Fall Nr. kann angeben werden). Anschließend würde ich die Condition angelegen und dann den Encounter updaten mit einer Referenz auf die neu erstelle Diagnose.</p>",
        "id": 214825878,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603886175
    },
    {
        "content": "<p>Wichtig ist vor allem auch, dass eine Diagnose nicht selber von sich aus sagen kann was sie ist im Rahmen eines Falls. Ob diese eine Haupt- oder Nebendiagnose ist z.B. würde man NUR über Encounter.diagnosis sagen können. Die Condition.encounter Referenz würde hierbei nur ausdrücken, dass die Diagnose in dem Fall festgestellt wurde.</p>",
        "id": 214829164,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1603888312
    }
]