[
    {
        "content": "<p>Hallo,<br>\ngibt es bei der dosage.route in der MedicationStatement-Ressource irgendwelche Präferenzen bezüglich Codesystem-Usage? Beim EDQM-System gibt es ein Binding zu einem definierten ValueSet, allerdings scheinen dort einige Verabreichungsformen in unserem System keinen Zielterm zu finden (z.B.: Peridural, Parenteral, Periokular,...). <br>\nFehlen die im ValueSet oder sind die schlicht nicht existent im Katalog ? <br>\nAlternativ könnten wir für alle Ressourcen an dieser Stelle ein zusätzliches SNOMED-Mapping integrieren, sodass die meisten Ressourcen dann mit EDQM UND SCT-Verabreichungsform versehen werden, einige dann wiederum ausschließlich mit SCT-Term.</p>",
        "id": 267453457,
        "sender_full_name": "David Meyers",
        "timestamp": 1641828769
    },
    {
        "content": "<p>Als Zweck der EDQM Standard Terms erscheint primär eine systematische Beschreibung der Darreichungsform (pharmaceutical dose Form). In vielen Fällen impliziert die Dose form die Route of Administration, allerdings ggf. nur insofern dies für die Unterscheidung der Dose Form relevant ist. Einige der genannten Begriffe finden sich außerdem in den \"internal controlled vocabularies for pharmaceutical dose forms\" ( <a href=\"https://www.edqm.eu/sites/default/files/standard_terms_internal_vocabularies_for_pharmaceutical_dose_forms.pdf\">https://www.edqm.eu/sites/default/files/standard_terms_internal_vocabularies_for_pharmaceutical_dose_forms.pdf</a> ), sie können also auch aus der dose form abgeleitet werden, insbesondere aus \"intended site\".  Siehe Menüpunkt \"Pharmaceutical Dose Forms by Intended Site\" (<a href=\"https://standardterms.edqm.eu/browse/get_concepts_by/ISI/PDF\">https://standardterms.edqm.eu/browse/get_concepts_by/ISI/PDF</a>).</p>\n<p>In Bezug auf die elemente Dosage.route, <a href=\"http://Dosage.site\">Dosage.site</a> und Dosage.method  erscheint mir EDQM daher nicht als die maximal trennscharfe Lösung, ist für Zwecke der med. Dok. in Patientenversorgung aber vielleicht auch nicht erforderlich. Ein ergänzendes Codieren mit SNOMED CT ist vermutlich sinnvoll, falls der Use Case das erfordert.</p>",
        "id": 267461633,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1641831847
    },
    {
        "content": "<p>\"parenteral\" steht bei EDQM übrigens unter Intended Site, verbunden mit Infusion oder Injection unter Administration Method. Auch hier also Unterschiede in der Granularität und bei der Zuordnung der Konzepte zu route/site/method.</p>",
        "id": 267463634,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1641832646
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"263786\">@David Meyers</span>,  schauen uns das gerade hier am Standort auch an für die OPS Codes für Medikamente und es gibt nicht immer passende EDQM Route of Administration Terms. Auf dem MII Sharepoint gibt es eine Mapping Tabelle für OPS Medikamente zu EDQM und auch den von <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> erwähnten EDQM internal vocabularies. Das ValueSet im KDS ist komplett, die passenden Terms gibt es nur nicht immer im Katalog. Ihr könnt alternativ auch SNOMED nehmen. Die Vorgaben im KDS sind relativ frei bisher. Gerade was SNOMED angeht, müssten wir vom KDS noch genauere Vorgaben machen für Dosage.route und <a href=\"http://Dosage.site\">Dosage.site</a>. SNOMED hat Parenteral zB als site <code>738984000 |Parenteral (intended site)|</code>.</p>",
        "id": 267562120,
        "sender_full_name": "Julian Sass",
        "timestamp": 1641896885
    }
]