[
    {
        "content": "<p>Hi guys, I am wondering how can I install / Use an Implementation Guide. Unfortunately I couldn't find much documentation how to use them. I want to use \"GECCO\" implementation guide. Thanks</p>",
        "id": 274865844,
        "sender_full_name": "John",
        "timestamp": 1646932314
    },
    {
        "content": "<p>Sure, what is it exactly that you want to do? Install the conformance resources on a server?</p>",
        "id": 274944490,
        "sender_full_name": "Julian Sass",
        "timestamp": 1646987412
    },
    {
        "content": "<p>Actually we have COVID clinical data and we would like to make use of GECCO profiles and resources, wondering if the work you have done could already give us a head start.</p>",
        "id": 274949365,
        "sender_full_name": "John",
        "timestamp": 1646990279
    },
    {
        "content": "<p>I guess what you want to do is implement some sort of ETL pipeline and get your clinical data into FHIR format and then test your implementation by validating against e.g. the GECCO profiles. I would start by choosing a library from here: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=35718838\">https://confluence.hl7.org/pages/viewpage.action?pageId=35718838</a> which will make implementation easier. And then in a second step you can install the implementation guide on a server or use the validator locally.</p>",
        "id": 274951326,
        "sender_full_name": "Julian Sass",
        "timestamp": 1646991410
    },
    {
        "content": "<p>Thanks for your quick response. We do have clinical synthetic data in FHIR Format as well as real data which we are working to transform in FHIR JSON. What is causing problem is to how to connect these two things. i.e. Clinical Data and Gecco profiles. I guess I need to use a Validator which checks the data conformance against the Gecco profiles ? </p>\n<ul>\n<li>do you know any validator which checks against a particular IG ? I used a standard validator which only checks whether the data is formulated according to FHIR standards or not</li>\n<li>Is there a way / tool to tranform local fhir data / Synthetic data to comply with GECCO specifications ?</li>\n<li>How can I used Gecco IG on Firely Server / any other FHIR server (HAPI) ? I couldn't find an option to use a customised IG ?<br>\nPls excuse me if those questions sound naive but I have done some work with profiling and now trying to make things work together.</li>\n</ul>",
        "id": 274959373,
        "sender_full_name": "John",
        "timestamp": 1646996047
    },
    {
        "content": "<ul>\n<li>\n<p>the FHIR validator can check against a particular IG. It's described here: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=35718580#UsingtheFHIRValidator-Validatingagainstanimplementationguide\">https://confluence.hl7.org/pages/viewpage.action?pageId=35718580#UsingtheFHIRValidator-Validatingagainstanimplementationguide</a> <br>\nYou need to set the <code>-ig</code> parameter to e.g. <code>-ig de.gecco#1.0.5</code> or any other IG.</p>\n</li>\n<li>\n<p>I assume there is no such tool because your source data will differ from the data at other hospitals, so you'll need to handle this transformation step yourself. This is specific to CDSIC ODM as source but could be helpful: <a href=\"https://github.com/num-codex/odm2fhir\">https://github.com/num-codex/odm2fhir</a> </p>\n</li>\n<li>Firely and HAPI servers have config settings where you can specify which IGs to load on startup. <br>\nFirely Server docs: <a href=\"https://docs.fire.ly/projects/Firely-Server/en/latest/features/conformanceresources.html#conformance-import\">https://docs.fire.ly/projects/Firely-Server/en/latest/features/conformanceresources.html#conformance-import</a><br>\nHAPI starter <a href=\"https://github.com/hapifhir/hapi-fhir-jpaserver-starter\">https://github.com/hapifhir/hapi-fhir-jpaserver-starter</a> there is an application.yaml with an option to import IGs</li>\n</ul>",
        "id": 274962130,
        "sender_full_name": "Julian Sass",
        "timestamp": 1646997754
    },
    {
        "content": "<p>Great, thanks a lot</p>",
        "id": 274967899,
        "sender_full_name": "John",
        "timestamp": 1647001729
    }
]