[
    {
        "content": "<p>Innerhalb des Moduls 'Fall' entstand der Bedarf, Details rund um die Aufbauorganisation der einzelnen Stationen, OEs, etc. zu dokumentieren. Im Modul Fall werden aufgrund dessen nun temporär Vorgaben rund um die Location / Organization gemacht. Diese können anschließend optional mit dem Encounter verknüpft werden. In einem weiteren Schritt sollen diese Strukturen ('einfaches Ausbaumodell') konzeptionell überarbeitet werden und in das Modul Strukturdaten überführt werden. Dieser Thread soll dazu dienen erste Ideen für dieses Erweiterungsmodul zu dokumentieren.  Das Kümmererteam freut sich immer über euren Input :)</p>",
        "id": 214547800,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603702752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197535\">@Josef Schepers</span> <span class=\"user-mention\" data-user-id=\"195372\">@Matthias Löbe</span></p>",
        "id": 214547823,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1603702774
    },
    {
        "content": "<p>Bin wieder da. Das Bestimmungswort des einfachen Modells (EAM) heißt übrigens Aufbau. Das komplex(er)e Modell (KAM) hat das Bestimmungswort Ausbau. Wie die MII-Phasen Aufbauphase und Ausbauphase.<br>\nAm einfachsten ist es, die Strukturdaten im einfachen Auffffbaumodell (EAM) ganz eng an die Strukturdaten im Abrechnungsfall - sprich P21-Fall - anzulehnen.</p>\n<p>Zentrales Strukturelement des <strong>Einrichtungskontaktes</strong> ist demnach die IK-Nummer der Einrichtung, ergänzt um den Namen des Krankenhauses in der Tabelle Krankenhaus.csv.</p>\n<p>Zentrales Strukturelement des <strong>Abteilungskontaktes</strong> ist der sechsstellige Schlüssel Fachabteilung in der Tabelle FAB.csv.<br>\nDie ersten beiden Stellen dienen der Unterscheidung von Hauptabteilung (HA), Belegabteilung (BA) und Besonderer Einrichtung (BE). Stellen 3 bis 6 sind eigentlich eine Fachrichtungsangabe anstelle einer Fachabteilungsangabe. Im einfachen Aufffbaumodell (EAM) muss das genügen.</p>\n<p>Der <strong>Versorgungsstellenkontakt</strong> ist im EAM noch nachrangig. Ich schlage eine Fokussierung auf den abstrakten Ärztlichen Stationsdient der Fachabteilung (Klinik) ohne Angabe eines Location-Bezugs vor. Die Versorgungsstelle ist nämlich wie die Fachabteilung selbst regelmäßig eine ortsunabhängige organisatorische Einheit (wie Kostenstelle und Personalstelle). Beispiele für Versorgungsstellen des Ärztlichen Stationsdienstes:</p>\n<ul>\n<li>Ärztlicher Stationsdienst Normalstationen Innere Medizin - ÄSD-N-0100</li>\n<li>Ärztlicher Stationsdienst Normalstationen Chirurgie - ÄSD-N-1500</li>\n<li>Ärztlicher Stationsdienst Intensivstationen Kardiologie - ÄSD-I-0300</li>\n<li>Ärztlicher Stationsdienst Stroke Unit Neurologie - ÄSD-I-2800</li>\n<li>Ärztlicher Stationsdienst Intensivstationen Intensivmedizin - ÄSD-I-3600</li>\n</ul>\n<p>Die Unterscheidung von Normalstationsdienst und Intensivstationsdienst (für SMITH Use Case ASIC) könnt Ihr natürlich auch anders einrichten (siehe auch \"Kennung Intensivbett ja/nein\" in der FAB.csv).</p>\n<p>############</p>\n<p>Krankenhausbezogene Daten (\"Krankenhaus.csv\" des P21)<br>\nInstitutionskennzeichen des Krankenhauses M n9<br>\nName des Krankenhauses M an..50<br>\nArt des Krankenhauses M an1<br>\nArt der Trägerschaft M an1<br>\nAnzahl der aufgestellten Betten (DRG) M n..4<br>\nAnzahl der aufgestellten Intensivbetten (DRG) M n..4<br>\nAnzahl der aufgestellten Betten (PSY) M n..4<br>\nAnzahl der aufgestellten Intensivbetten (PSY) M n..4<br>\nMerkmal Zu-/Abschläge K an..6<br>\nRegionale Versorgungsverpflichtung M an1 ’0’|’1’ (siehe Hinweise)</p>\n<p>Fachabteilungsangaben (wiederholbar) fallbezogen (\"FAB.csv\" des P21)<br>\nStandortnummer Behandlungsort M n..9<br>\nFachabteilung M an6<br>\nDatum der Aufnahme in die Fachabteilung M an12 JJJJMMTTHHMM<br>\nDatum der Verlegung-/Entlassung aus der Fachabteilung M an12 JJJJMMTTHHMM<br>\nKennung Intensivbett M an1 J oder N</p>\n<p>Fachabteilung (Merkmal in der \"FAB.csv\" des P21)<br>\nDie Fachabteilung ist an dieser Stelle analog der Übermittlung nach § 301 SGB V einschließlich der Pseu-dofachabteilungen ‚0001’ (Rückverlegung), ‚0002’ (Wiederaufnahme), ‚0003‘ (externer Aufenthalt mit Ab-wesenheit über Mitternacht im BPflV-Bereich) oder ‚0004’ (Pseudofachabteilung für Zeitraum ohne direkten Patientenkontakt (bei stationsäquivalenter Behandlung)) anzugeben.<br>\nDem Fachabteilungsschlüssel ist bei Fachabteilungen das Präfix ‚HA’ (Hauptabteilung) oder ‚BA’ (Beleg-abteilung), bei Besonderen Einrichtungen das Präfix ‚BE’ voranzustellen.<br>\nBei Angabe der Pseudofachabteilungen ‚0001’, ‚0002’, ‚0003‘ und ‚0004’ ist als Präfix ‚HA’ anzugeben.</p>",
        "id": 214555881,
        "sender_full_name": "Josef Schepers",
        "timestamp": 1603707500
    },
    {
        "content": "<p>Der Bedarf bestand schon vorher, (auch) deswegen gibt es ja das Erweiterungsmodul Strukturdaten. Das Modell des Teams orientierte sich zuerst an den strukturierten Qualitätsberichten des GBA. Danach wurden die Anforderungen aus den MII-Konsortien eingearbeitet (soweit bekannt). Wir haben nun für die intendierte Version 1 des Moduls ein recht einfaches Schema erstellt und die Arabesken heben wir uns für eine Version 2 auf. Es soll nach Wunsch des NSG alles eher schnell gehen. Die P21-Merkmale wollte erst einmal noch niemand, danke für den Hinweis.</p>",
        "id": 215320513,
        "sender_full_name": "Matthias Löbe",
        "timestamp": 1604325191
    }
]