[
    {
        "content": "<p>Hallo,</p>\n<p>hat jemand einen aktuellen Stand / Link was das Thema \"Laborprofile\" anbelangt?</p>",
        "id": 162508948,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554370883
    },
    {
        "content": "<p>Hi, es gibt bislang nur die Arbeiten im ART-DECOR. Im Team für die Laborprofile hatten wir uns bislang Beispiele für FHIR-Ressourcen aus einzelnen Uniklinika erarbeitet und angeschaut, die eigentliche Profilierung liegt noch vor uns. Hier wird es am 18.4. einen ersten Vor-Ort-Termin in München geben! <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> ist hier auch eingebunden. Wir können / sollten dann auf alle Fälle hier informieren, wie es weitergeht!</p>",
        "id": 162509120,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1554371047
    },
    {
        "content": "<p>Danke Danny! Wir haben eine Einladung für den Termin in München erhalten, aber das war leider zu kurzfristig, als dass Stefan oder ich hätten teilnehmen können. Wäre schön, wenn ihr uns (und den lauernden Rest der Welt) hier auf dem Laufenden halten könntet! :)</p>",
        "id": 162509539,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554371500
    },
    {
        "content": "<p>Ja, bitte!</p>",
        "id": 162509600,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1554371547
    },
    {
        "content": "<p>Wegen den Empfehlungen der europ. Kommission zum “Thema EHR Exchange Format” (auch für Labordaten) möchte ich auch gerne auf dem Laufenden bleiben.</p>",
        "id": 162510102,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1554372094
    },
    {
        "content": "<p>Wahrscheinlich wird es wohl eher darauf hinauslaufen, dass wir in einem Folgetermin nochmal auf euer aller Expertise zurückgreifen :D, aber klar, ich werde berichten! Im ersten Schritt wurden / werden übrigens EPD- und elga-Laborbefund-Templates reviewt, also das Anlehnen an bestehende Leitfäden ist definitiv ein Ziel! Es bleibt natürlich trotzdem bei der Profilierung in FHIR…</p>",
        "id": 162510998,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1554372992
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> Hast du vielleicht ein paar Links parat in Hinblick darauf was alles zu beachten wäre? Dann könnte man ja von Anfang an eine Harmonisierung anstreben.</p>",
        "id": 162512272,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1554374306
    },
    {
        "content": "<p>Ich lege das Labor-(Observation)-Profil aus dem International Patient Summary mal hier hin: <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Observation-laboratory-uv-ips.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Observation-laboratory-uv-ips.html\">https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Observation-laboratory-uv-ips.html</a></p>",
        "id": 162513478,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554375602
    },
    {
        "content": "<p>Vielen Dank für den informativen Link. In Simplifier finde ich dazu noch nichts, oder? Mich würde auch der DiagnosticReport interessieren. Dann habe ich noch eine Frage zu der Gruppierung von Analysen. In FHIR 4 wird dazu Observation.Component verwendet, in IPS Observation.hasMember. Gibt es einen Grund für diesen Unterschied? Ist irgendwo festgelegt, welche Analyse ich unter welchem Panel zu erwarten habe? Der Kommentar zu <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Observation-laboratory-uv-ips-definitions.html#Observation.hasMember\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Observation-laboratory-uv-ips-definitions.html#Observation.hasMember\">https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Observation-laboratory-uv-ips-definitions.html#Observation.hasMember</a> liesst sich so, als könnte diese Zuodnung fast beliebig ausfallen (...group a collection of observations, [...], or because they share a common interpretation comment ...) . Spricht für den reinen Datenaustausch etwas dagegen, alle Analysen erst einmal ungruppiert abzulegen?</p>",
        "id": 162888125,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1554795564
    },
    {
        "content": "<p>Hi zusammen, ganz kurzes Feedback vom Treffen in München: Wir haben uns für die Laborbefunde der MI-Initiative auf folgende Dinge geeinigt:<br>\n– Profilierung in FHIR R4 (sobald Forge / Simplifier es unterstützen)<br>\n– Ableitung der MII-Laborbefund-Profile aus den Profilen des International Patient Summary<br>\n– Profile für die Ressourcen DiagnosticReport, Observation, ServiceRequest und Speciment werden erstellt<br>\n– einige übergreifende Punkte, z.B. Canonical URL für Profile etc. wurden besprochen und Vorschläge dafür erstellt<br>\nErste Details dazu, was wir an den Ressourcen profilieren würden, haben wir dokumentiert und würden wir, sobald es dann technisch unterstützt wird, gern auch auf dem nächsten dann folgenden Interop-Forum vorstellen!</p>",
        "id": 164243790,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1556268586
    },
    {
        "content": "<p>Wir haben uns gerade hier in München getroffen um weiter an den Laborprofilen für die MII zu arbeiten. Das Ergebnis ist jetzt unter <a href=\"https://simplifier.net/MedizininformatikInitiative-Laborprofile\" target=\"_blank\" title=\"https://simplifier.net/MedizininformatikInitiative-Laborprofile\">https://simplifier.net/MedizininformatikInitiative-Laborprofile</a> einsehbar. Natürlich ist noch nichts davon offiziell aber wir freuen uns trotzdem schon über Rückmeldung.</p>",
        "id": 171000278,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1563292719
    },
    {
        "content": "<p>in Observation.category habt ihr einerseits ein Slice welches fixed values aus LOINC enthält + fixed values auf category direkt.</p>",
        "id": 171001391,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1563293446
    },
    {
        "content": "<p>Dies widerspricht sich, lässt sich aber leicht durch Entfernen des slices lösen. Das es eine Laboruntersuchung ist sieht man bereits am value aus <a href=\"http://terminology.hl7.org/CodeSystem/observation-category\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/observation-category\">http://terminology.hl7.org/CodeSystem/observation-category</a></p>",
        "id": 171001914,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1563293764
    },
    {
        "content": "<p>bei der DiagOrder.category würde ich auch das preferred ValueSet dem LOINC term vorziehen.</p>",
        "id": 171002138,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1563293890
    },
    {
        "content": "<p>Danke, ich überprüfe das (Observation.category slices) mal. Wir haben über diesen Punkt länger diskutiert, Ziel war  jeder Observation die category 'Labor' (aus LOINC) zuzuordenen, zusätzlcih aber noch weitere Categorien zu erlauben.</p>",
        "id": 171002153,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1563293904
    },
    {
        "content": "<p>Das ist nachvollziehbar. Wenn man die codes aus  <a href=\"http://terminology.hl7.org/CodeSystem/observation-category\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/observation-category\">http://terminology.hl7.org/CodeSystem/observation-category</a> nutzt ist man sehr wahrscheinlich international interoperabel.</p>",
        "id": 171002244,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1563294000
    },
    {
        "content": "<p>Und die Zuordnung, dass eine Observation eine Laboruntersuchung ist kann ich ja mit dem hl7 codesystem gleichwertig ausdrücken.</p>",
        "id": 171002419,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1563294115
    },
    {
        "content": "<p>Mir fehlt da der Überblick was international besser kompatibel ist. Wenn HL7 besser ist,  dann gerne auch das, ihc bin da völlig schmerzfrei und stelle das gerne zur Diskussion.</p>",
        "id": 171002915,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1563294398
    },
    {
        "content": "<p>In Observation.valueQuantity wollt ihr unit nutzen. Habt ihr überlegt präziser system + code zu benutzen?  Observation.valueQuantity habt ihr auf 1:1. Sollte dies nicht auf 0:1 bleiben? Wenn ich den dataAbsentReason benutze, kann ich kein value angeben. Über interpretation könnte man auch noch nachdenken, wie es <a href=\"https://www.hl7.org/fhir/cholesterol.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/cholesterol.html\">hier</a> verwendet wird. Wollt ihr am Ende eine Observation pro Laborwert herstellen oder eine für alle Laborwerte nehmen?</p>",
        "id": 171007201,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1563297506
    },
    {
        "content": "<p>Vielleicht ist es so vielseitiger. Denn: Von diesem Profil wäre dann ein weiteres Profil als constraint ableitbar, in dem die Unit garantiert auch codiert ist. Oder sogar: in UCUM codiert ist. Das a priori verpflichtend zu machen, könnte das Profil hingegen für einige Zwecke unbrauchbar machen.</p>",
        "id": 171008264,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1563298397
    },
    {
        "content": "<p>Bezüglich Observation.category / DiagnosticReport.category: Diese LOINC Codes wurden bewusst gewählt, da sie von unseren lieben Nachbarn in Österreich in ihren Laborbefunden verwendet werden. Wir hatten leider nicht darauf geachtet, dass im Core das ein preferred Binding ist. Ich denke es würde jedoch wenig dagegensprechen dies als weiteres Coding mit aufzunehmen. Das fixed value ist noch ein Fehler aus alten Versionen. Generell war es jedoch schon angedacht für Auswertungszwecke nur eine Catgeory d.h. ein CodeableConcept mit n Codings zuzulassen.</p>",
        "id": 171008878,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563298824
    },
    {
        "content": "<p>Die dataAbesentReason wird noch auf 0..0 gesetzt um hier konform zur IPS zu sein. Entweder eine Observation hat ein Value oder eine data-absent-reason Extension wird an ihrer Stelle verwendet.</p>",
        "id": 171009093,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563298998
    },
    {
        "content": "<p>1 Observation pro Laborwert + einen DiagnosticReport um alles zu bündeln.</p>",
        "id": 171009116,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563299023
    },
    {
        "content": "<p>Bei valueQuantity sollte eigentlich auch unit und code verpflichtend sein um die Systeme auf UCUM zu verpflichten. Das ist irgendwie in Forge abhanden gekommen :/</p>",
        "id": 171009289,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563299138
    },
    {
        "content": "<p>system und code.</p>",
        "id": 171009442,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1563299220
    },
    {
        "content": "<p>Ahm ja :D</p>",
        "id": 171009468,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563299236
    },
    {
        "content": "<p>und system fixed to UCUM?</p>",
        "id": 171009607,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1563299303
    },
    {
        "content": "<p>Das war eigentlich geplant. Ich finde schon das es das Ziel sein sollte die Systeme und Hersteller dazu zu bewegen dies umzusetzen.</p>",
        "id": 171009862,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563299441
    },
    {
        "content": "<blockquote>\n<p>Die dataAbesentReason wird noch auf 0..0 gesetzt um hier konform zur IPS zu sein. Entweder eine Observation hat ein Value oder eine data-absent-reason Extension wird an ihrer Stelle verwendet.</p>\n</blockquote>\n<p>Ok das wusste ich nicht. Warum verwendet man den dataAbsentReason aus der Observation nicht?</p>",
        "id": 171010081,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1563299587
    },
    {
        "content": "<p>Wie oben gesagt, bin ich mit diesem Ziel voll einverstanden. Aber in Kenntnis von Bestandssystemen bin ich skeptisch. Eine Abstufung im Sinne von “erstmal LOINC, dann UCUM” könnte pfiffig sein.</p>",
        "id": 171010099,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1563299606
    },
    {
        "content": "<blockquote>\n<p>Das war eigentlich geplant. Ich finde schon das es das Ziel sein sollte die Systeme und Hersteller dazu zu bewegen dies umzusetzen.</p>\n</blockquote>\n<p>Ich denke auch, dass wir UCUM auf jeden fall fordern sollen. In der MII können ja zur Not noch Transformationsschritte zwischengeschaltet werden um valide UCUM-Einheiten zu erzeugen, wenn das in den Primärsystemen noch nicht geht. Aber ein Vergleich von verschiedenen Standorten hinweg ohne UCUM erscheint mir nur schwer möglich.</p>",
        "id": 171069617,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1563363454
    },
    {
        "content": "<p>Alle handwerklichen Fehler die oben genannt wurden sollten nun behoben sein. Nach interner Abstimmung wird das system für valueQuantity auf UCUM gesetzt. Über Feedback welche Systeme hiermit nicht kompatibel wären und auch nicht gemappt werden können würden wir uns sehr freuen :)</p>",
        "id": 171247380,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563533327
    },
    {
        "content": "<p>Ich würde ganz gerne folgende Invariante aus den R4 US Core Laborprofilen hier mal zur Diskussion stellen. \"us-core-1: Datetime must be at least to day\" (<a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-observation-lab.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-observation-lab.html\">https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-observation-lab.html</a>) definiert für effectiveDateTime. Im Endeffekt kann ich die Gründe nachvollziehen, was genau nützt es mir zu wissen aus welchem Jahr oder Monat die Observation stammt. Sollten wir diese Invariante mit aufnehmen, Meinungen?</p>",
        "id": 171879771,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1564301430
    },
    {
        "content": "<p>CC: <span class=\"user-mention\" data-user-id=\"217202\">@Andreas Bietenbeck</span></p>",
        "id": 171879775,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1564301462
    },
    {
        "content": "<p>Gute Idee. Ich habe sogar im Implementation Guide sogare geschrieben, das man mindestens die Minute benötigt. Das ist wichtig um die Ergebnisse im Zeitverlauf ordenen zu können. Im Krankenhaus ist es auch durchaus üblich pro Stunde mehrere Proben pro Stunde zu bekommen, z.B. Blutgasanalysen. Fährst du morgen nach Berlin? Wenn sich da noch diese \"Verschärfung\" durchsetzen ließe, wäre ich stark dafür.</p>",
        "id": 171881358,
        "sender_full_name": "Andreas Bietenbeck",
        "timestamp": 1564304624
    },
    {
        "content": "<p>Kann mir jemand inhaltlich begründen, warum ein MII Laborbefund eine Referenz bzw. die Ressource ServiceRequest benötigt? Ich hänge hier gedanklich grade.</p>",
        "id": 261001242,
        "sender_full_name": "Björn Schreiweis",
        "timestamp": 1636556226
    },
    {
        "content": "<p>In der initialen Auswertung der Papierbefunde auf denen der DiagnosticReport basiert hatten wir festgestellt, dass dort immer ein Identifier für die Anforderung drauf steht. Für die meisten Systeme ist dieser Identifier der Einstieg in die Ergebnisse.</p>",
        "id": 261020259,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1636563816
    },
    {
        "content": "<p>Passt auch in das Event Pattern <a href=\"http://build.fhir.org/event.html\">http://build.fhir.org/event.html</a> als Event.basedOn</p>",
        "id": 261029824,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1636567621
    },
    {
        "content": "<p>ok, damit hätte man ja die Kardinalität 0..* festsetzen können. Gibt es auch aus medizinischer bzw. medizinisch-forschender Sicht eine Begründung?</p>",
        "id": 261030732,
        "sender_full_name": "Björn Schreiweis",
        "timestamp": 1636567900
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196447\">@Andrea Essenwanger</span> Wie sieht es aus der Seite der Datenauswertung aus? Ich könnte mir vorstellen, dass das die Verknüpfung wichtig ist um an die richtigen Observations zu kommen?</p>",
        "id": 261035905,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1636569911
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"261098\">@Björn Schreiweis</span> In welchem Use Case bricht das Ganze denn gerade?</p>",
        "id": 261035957,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1636569941
    },
    {
        "content": "<p>Wir sind da bei einem internen Review hängen geblieben und haben eben keinen Use Case gefunden.</p>",
        "id": 261104187,
        "sender_full_name": "Björn Schreiweis",
        "timestamp": 1636618139
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193430\">Alexander Zautke</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/MII.20Laborprofile/near/261035905\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"196447\">Andrea Essenwanger</span> Wie sieht es aus der Seite der Datenauswertung aus? Ich könnte mir vorstellen, dass das die Verknüpfung wichtig ist um an die richtigen Observations zu kommen?</p>\n</blockquote>\n<p>Im Pathobefund ist sowas relevant ja, weswegen das auch bei uns mandatory wäre. Wir würden hier ja auch gerne darstellen können, welche Proben und Untersuchungen zu einem bestimmten Untersuchungsauftrag gehören. Der End-Befund selbst, kann dann ja sogar 1..* Untersuchungsaufträge haben mit ggf. unterschiedlichen Auftraggeber und Auftragnehmer. Auch Einsender und Entnehmer können sich ja unterscheiden, was für die Erfassung der Daten beim Modul auch somit eine klinische Relevanz hätte. Jedoch könnte ich da nicht sagen ob das auch für die allgemeinen Laboruntersuchungen wichtig wäre. Spontan erscheint es mir sinnvoll, ich schaue aber wahrscheinlich zu sehr mit der Patho-Brille drauf.</p>",
        "id": 261614669,
        "sender_full_name": "Andrea Essenwanger",
        "timestamp": 1637054427
    },
    {
        "content": "<p>Im IG des Labormodules fehlt die explizite Dokumentation der Extension \"Quelle klinisches Bezugsdatum\" (sollte vermutlich auf einer Unterseite zu Observation sein) <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 264979242,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1639557944
    }
]