[
    {
        "content": "<p>Guten Morgen aus Lübeck,</p>\n<p>wir sind dabei, den Patientensimulator 'synthea' (<a href=\"https://github.com/synthetichealth/synthea\">https://github.com/synthetichealth/synthea</a>) dahingehend anzupassen, dass auch FHIR-Ressourcen gemäß des aktuellen Arbeitsstandes für die Kerndatensatz-Module generiert werden können, die wir dann z.B. als Testgrundlage für die Einrichtung des SMICS im UC IC von HiGHmed einsetzen können.</p>\n<p>Damit Synthea authentische, aber vollständig synthetische, Patientenakten generiert, verwendet die Applikation Module, die das Verhalten der simulierten Agenten beeinflussen. Natürlich sind diese Module stark auf den US-amerikanischen Markt zugeschnitten, sodass wir viele Eigenheiten des deutschen Gesundheitswesen und Anforderungen der Kerndatensatz-Module nur durch Mapping und Erweiterungsmodule abbilden können.</p>\n<p>In meiner konkreten Frage geht es um den Versorgungsfall, in dem verpflichtend (1..1) eine Referenz auf eine Condition (Profil 'Diagnose') angegeben werden muss. In der simulierten Welt wird das sicherlich für stationäre Aufenthalte auch möglich sein, jedoch kann es auch vorkommen, dass ein Patienten-Agent bei einem niedergelassenen Arzt für sogenannte 'wellness encounter' (SNOMED CT: <code>185349003|Encounter for check up|</code>) vorstellig wird. Bei gesunden Patienten können dann zwar Prozeduren (z.B. Blutpanels oder Impfungen) durchgeführt werden, aber eine Diagnose wird nicht immer gestellt werden können.</p>\n<p>Ich stimme zu, dass in den meisten Fällen eine solche Angabe sehr wichtig und erforderlich ist. In einem solchen Fall finde ich die Abbildung jedoch schwierig. Möglichkeiten für die Abbildung, die ich sehe, sind a) eine Diagnose mit z.B. dem SNOMED-Code <code>|160245001|No current problems or disability (situation)|</code> und/oder ICD-10 <code>|Z00.0|Ärztliche Allgemeinuntersuchung bei Personen ohne Beschwerden oder angegebene Diagnosen|</code> anzulegen - dann sehe ich aber Probleme darin, das <code>onset</code> und den <code>clinicalStatus</code> dieser Diagnose zu bestimmen oder b) die Extension <code>data-absent-reason</code> wie oben beschrieben zu verwenden oder c) die Kardinalität von <code>Encounter.diagnosis</code> anzupassen. Welche Lösung würdet Ihr da bevorzugen?</p>",
        "id": 200983251,
        "sender_full_name": "Joshua Wiedekopf",
        "timestamp": 1592294331
    },
    {
        "content": "<p>Wir hatten das Thema ja eben auch in der Projectathon-TelKo. Ich hatte auch dafür argumentiert, auf verpflichtende Angaben bzw. verpflichtende Referenzen von Diagnosen im Modul Fall zu verzichten.  Aus meiner Sicht schaffen wir mit einer Pflicht zur Diagnoseangabe eine unnötige \"Strenge\", die ein schrittweises Vorgehen an den Standorten (ohne für mich erkennbaren Grund) erschwert. Das gilt insbesondere in solchen Integrationsszenarios, in denen Diagnosedaten erst nachträglich per P21-Export oder nur separat per BAR-Nachricht zur Verfügung stehen.<br>\nWelche in der MII relevanten Auswertungsfragestellungen können wir NICHT beantworten, wenn wir auf die Pflicht verzichten?</p>",
        "id": 201003460,
        "sender_full_name": "Thomas Wendt",
        "timestamp": 1592308436
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"312186\">Thomas Wendt</span> <a href=\"#narrow/stream/179307-german.2Fmi-initiative/topic/Modul.20Fall.20-.20Diagnosereferenz.20verpflichtend/near/201003460\">said</a>:</p>\n<blockquote>\n<p>Wir hatten das Thema ja eben auch in der Projectathon-TelKo. Ich hatte auch dafür argumentiert, auf verpflichtende Angaben bzw. verpflichtende Referenzen von Diagnosen im Modul Fall zu verzichten.  Aus meiner Sicht schaffen wir mit einer Pflicht zur Diagnoseangabe eine unnötige \"Strenge\", die ein schrittweises Vorgehen an den Standorten (ohne für mich erkennbaren Grund) erschwert. Das gilt insbesondere in solchen Integrationsszenarios, in denen Diagnosedaten erst nachträglich per P21-Export oder nur separat per BAR-Nachricht zur Verfügung stehen.<br>\nWelche in der MII relevanten Auswertungsfragestellungen können wir NICHT beantworten, wenn wir auf die Pflicht verzichten?</p>\n</blockquote>\n<p>Hab ein Issue daraus gemacht.</p>",
        "id": 201031590,
        "sender_full_name": "Thomas Wendt",
        "timestamp": 1592321038
    }
]