[
    {
        "content": "<p>Hallo zusammen, im Zuge der Umsetzung unserer Use Cases würden wir gern die FHIR-Ressourcen ResearchStudy und Questionnaire einsetzen, um zu verdeutlichen, dass die Umsetzung eines Use Cases eine klinische Studie ist und diese zusätzlich auch einen eCRF beinhaltet (der als Questionnaire abgebildet werden soll). Gibt es eine Möglichkeit, eine Questionnaire-Ressource mit einer ResearchStudy zu verlinken, ohne dass eine Extension notwendig ist? Ich habe keine Möglichkeit gesehen, übersehe aber vielleicht etwas…</p>",
        "id": 154022432,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1543826805
    },
    {
        "content": "<p>Nein gibt es nicht. Die Extension is notwendig. Ausserdem ist das aktuelle Modell von ResearchSubject <a href=\"http://build.fhir.org/researchsubject.html#statemachine\" target=\"_blank\" title=\"http://build.fhir.org/researchsubject.html#statemachine\">http://build.fhir.org/researchsubject.html#statemachine</a> konzeptionell problematisch. Speziell hinsichtlich Screening und Consent. Das haben Pharma Menschen modelliert, die Abläufe im Krankenhaus nicht wirklich kennen. Dazu gibt es in Treffen Anfang Januar. </p>\n<p>Ich sehe du sitzt gereade mir gegenüber ;-) sprich mich in der Mittagspause an.</p>",
        "id": 154023435,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1544094546
    },
    {
        "content": "<p>ich spreche gerne mit</p>",
        "id": 154023439,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1544094877
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/extension-workflow-researchstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-workflow-researchstudy.html\">http://build.fhir.org/extension-workflow-researchstudy.html</a> ?</p>",
        "id": 154023440,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1544094883
    },
    {
        "content": "<p>Hallo zusammen, eine Frage von \"Dummy\": Würde man den auf einem Maturity Level 1 schon mit Extentions arbeiten? Sollte man nicht die bestehenden Resource selbst anpassen? Das was wir brauchen klingt ja nicht nach dem 20%-Bedarf. Ich entschuldige mich schon mal, falls meine Frage unsinnig ist. Liebe Grüße, Robert Gött</p>",
        "id": 182438527,
        "sender_full_name": "Robert Gött",
        "timestamp": 1575372757
    },
    {
        "content": "<p>Wenn man Ressourcen selbst anpasst, ist es nicht mehr der FHIR-Standard. Erlaubt sind grundsätzlich Custom Resources, aber die sind eben nicht interoperabel, weil sie ebenfalls nicht Bestandteil des Standards sind. Gedacht also primär für rein systeminterne oder hausinterne Benutzung.</p>\n<p>Der \"saubere\" Weg ist:<br>\n- In der Community (also hier im Chat) das Problem/fehlende Elemente schildern. Manchmal klärt sich dann schon ein Verständnisproblem, weil man auf einen anderen Ressourcentyp hingewiesen wird.<br>\n- Ansonsten, sofern offensichtlich wird, dass im Standard (z.B. der Maturiy Level 1 Ressource) etwas fehlt, sollte man einen Change Request einreichen. Ein Account bei <a href=\"https://jira.hl7.org/\" target=\"_blank\" title=\"https://jira.hl7.org/\">https://jira.hl7.org/</a> kostet nichts und ist auch nicht an Mitgliedschaft o.ä. gebunden.<br>\n- Bis die Änderung in FHIR einfließt, oder ggf. eben auch nicht oder anders, je nach Diskussionsergebnis der zuständigen Arbeitsgruppe, sollte man tatsächlich eine Extension verwenden. Dies aber in dem Wissen, dass man diese mit einer späteren FHIR-Version durch das passende neue FHIR-Element ersetzt.</p>",
        "id": 182439392,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1575373620
    },
    {
        "content": "<p>An den Arbeitsgruppen kann man sich übrigens auch beteiligen, oder im Change Request anfordern, dass man bei der Besprechung des Issues dabei sein möchte (Telko oder vor Ort auf einem Working Group Meeting)</p>",
        "id": 182439615,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1575373828
    },
    {
        "content": "<p>Ok, das hilft sehr! Vielen Dank!<br>\nAktuell bilden wir (im MIRACUM) sehr essentielle Daten, wie zB das Studienakronym, in Extentions ab. Dadurch bin ich über dieses Gedanken gestolpert.</p>",
        "id": 182439869,
        "sender_full_name": "Robert Gött",
        "timestamp": 1575374052
    },
    {
        "content": "<p>Diese mustergültige Antwort von Stefan wünsche ich mir im FAQ-Bereich des Deutschen Implementierungsleitfadens :)</p>",
        "id": 182441181,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1575375042
    }
]