[
    {
        "content": "<p>Hi zusammen, eine Frage über die rätselhafte Genese bestimmter Entscheidungen in der MII Architektur: In der HiGHmed- aber meines Wissens auch in der SMITH Architektur, vielleicht  MII Übergreifend!? wird für den Workflow eine BPMN-Fähige Business Process Engine – vorausgesetzt. Regelsätze werden über eine Task Ressource ausgetauscht. </p>\n<p>Nun hier mein Verständnis von Tasks, wie sie sinnvoll verwendet werden:  Ich habe ein PlanDefinition und ein ActivityDefinition. Die Activity instanziiere ich durch eine Task Ressource.   Die Task State Machine führt sie mir aus.  Ich brauche keine weitere Software.</p>\n<p>Alternativ, wenn ich wirklich hartes Zeug machen möchte, hänge ich ein Verweis auf die Regelsätze eines proprietären CDS (wie z.VB. Arezzo) oder irgendwelche  Files für ein Fancy-Reasoner (z.B. SKOS Regeln wenn ich mich in der RDF/OWL Welt austobe) </p>\n<p>… oder wiederum… ich packe ein Verweis auf BPMN Regelsätze,  wie in der MII, und brauche dann dafür eine BPMN-Fähige Business Process Engine</p>\n<p>Ich frage mich nur was diese Entscheidung rechtfertigt. Wo im Austausch Workflow (denn nur da wird das Stipuliert) habe ich ein Workflow Szenario, der nicht mit der Task State Machine auskäme?</p>\n<p>Am I missing something?</p>",
        "id": 162271722,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1554147472
    },
    {
        "content": "<p>Ich glaub, das vermischt zwei verschiedene Ansprüche: 1) Visualisierung von Datenaustauschszenarien (nur dafür wurde BPMN bislang genutzt, schlicht weil es verbreitet ist und die Prozesse halbwegs anschaulich visualisiert) und 2) technische Umsetzung des Datenaustauschs (der wurde bislang interkonsortial in der letzten AG-Sitzung erstmals beleuchtet). M.E. spricht nichts dagegen, Einzelszenarien, die bislang z.B. Teil eines Data-Sharing-BPMN sind, nachvollziehbar in Zustände einer State Machine eines Tasks zu überführen und dann in FHIR-Ressourcen ausführbar zu gestalten – im Gegenteil, das fände ich eine spannende Umsetzung!</p>",
        "id": 162272241,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1554147830
    }
]