[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span> <span class=\"user-mention\" data-user-id=\"408480\">@Christopher Haskew</span> Sharing some thoughts on process</p>\n<p>Following up from the last call .. Should we try and set up specific topics or threads for each of the priority areas we need to work on for emCare? Ideally each one has an owner and an associated doc where we can delve into requirements and try and discuss asynchronously. Then we can use the Tuesday calls to surface issues or identify the need for deeper dives. Some of the \"big\" topics that I think are relevant are:</p>\n<p>Specific to emCare priorities shared on Tuesday:</p>\n<p>Data sync and conflict handling</p>\n<ul>\n<li>IG Deployment and design for the SDK (filtering based on role?)</li>\n<li>Client DB duplicates management</li>\n<li>FHIR Analytics (lower priority)</li>\n<li>General priority areas for the SDK</li>\n</ul>\n<p>Workflow/Task Management</p>\n<ul>\n<li>CQL Evaluation</li>\n<li>Auth needs (for implementing more granular access controls)</li>\n<li>Sync patterns</li>\n<li>Security (as raised by Carl)</li>\n</ul>\n<p>cc: <span class=\"user-mention\" data-user-id=\"401347\">@Matt Berg</span> <span class=\"user-mention\" data-user-id=\"356307\">@Kunjan Patel</span></p>",
        "id": 268808432,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1642753523
    },
    {
        "content": "<p>yes.  and I think that this document is not specific to emCare but for any \"SMART Guidelines\" app.  I have been trying to draft out some architectural assumptions on this here:   <br>\n<a href=\"https://docs.google.com/presentation/d/1tklkYEJAeSqvpOx8txEgEmeWRbiBm5QaQYh_qMtE7tQ/edit#slide=id.g10aa2e78e3f_0_97\">https://docs.google.com/presentation/d/1tklkYEJAeSqvpOx8txEgEmeWRbiBm5QaQYh_qMtE7tQ/edit#slide=id.g10aa2e78e3f_0_97</a><br>\nbut it is still a work in progress.</p>",
        "id": 268841428,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1642771564
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span> thanks for sharing this.  Could we setup a time to go through this when you have some time. I think <span class=\"user-mention\" data-user-id=\"315122\">@Fred Hersch</span> and others would be interested too</p>",
        "id": 269203042,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643079463
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"315122\">@Fred Hersch</span> sorry I missed your message as part of this thread earlier.  Those all sound good. I think in general what would be really helpful is a more detailed overview of the requirements for emCare. We can also work to better share the different requirements we are working towards.  The document shared so far relating to this is this which is similar to the list of items you've shared. <a href=\"https://worldhealthorg-my.sharepoint.com/:x:/g/personal/haskewc_who_int/EfD5cfUdJmdNlk-nXw8tRCwBvAsXlXD3Qck3YPF-cPtqAA?e=DYXygF\">https://worldhealthorg-my.sharepoint.com/:x:/g/personal/haskewc_who_int/EfD5cfUdJmdNlk-nXw8tRCwBvAsXlXD3Qck3YPF-cPtqAA?e=DYXygF</a></p>",
        "id": 269473877,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643227791
    },
    {
        "content": "<p>I think these high level things are good.  There are a lot of other functionality though that I think would probably need to be in a system (ones we are thinking about).  It would be great to know if there is overlap and if so is there a way to potentially we can as a community divide up some of the work.</p>",
        "id": 269474061,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643227883
    },
    {
        "content": "<p>Some of the questions include:</p>",
        "id": 269474075,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643227891
    },
    {
        "content": "<ul>\n<li>Need for P2P</li>\n</ul>",
        "id": 269474084,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643227896
    },
    {
        "content": "<ul>\n<li>Web interface for viewing and managing patient data</li>\n<li>web interface for data entry via questionnaires and web based data extraction</li>\n<li>Scheduling</li>\n</ul>",
        "id": 269474307,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643228008
    },
    {
        "content": "<p>Those are a few examples.  Others are more on the implementation side like authentication strategies, strategies for sync, etc.  I think this is what we're trying to discuss more.</p>",
        "id": 269474438,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643228063
    },
    {
        "content": "<p>Third are just a lot of the pragmatic issues.  Things we are encountering like:</p>\n<ul>\n<li>data extraction performance</li>\n<li>data validation performance in SDC</li>\n<li>$evaluate and $apply early implementation issues that need to be tested and worked on</li>\n</ul>",
        "id": 269474843,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643228195
    },
    {
        "content": "<p>It's this last item in particular that I'd love to eventually see getting more people in the community testing, providing feedback and helping to improve.  We're starting to see that with SDC on the SDK which is exciting. So that's something that will come I'm sure with broader adoption.</p>",
        "id": 269477020,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643228959
    },
    {
        "content": "<p>It would be great if we can start to use this channel more active discussion on specific items on the above.</p>",
        "id": 269477103,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643229000
    },
    {
        "content": "<p>The better we have understanding of people's needed timelines too it would really help.  In an ideal world, I'd love to be able to see different groups being able to pick up different functionalities they can then contribute back.</p>",
        "id": 269478847,
        "sender_full_name": "Matt Berg",
        "timestamp": 1643229703
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span> <span class=\"user-mention\" data-user-id=\"408480\">@Christopher Haskew</span> wanted to bring up an issue that we discussed on our call with Google today.   There are some general risks around the SDK in terms of performance that I think we should be looking at as a community.  Namely CQL evaluations can be quite slow (especially on lower end devices).  Similarly things like data extraction can be very slow.  This relates to optimizations that are needed in the HAPI library.  <span class=\"user-mention\" data-user-id=\"366686\">@Jing Tang</span> can provide more details.   We'll try and provide more details but generally we see data extractions taking several seconds on a modern device.  However, on an older 1G 1.3GHZ android device it was taking over 10 minutes.  So there may be some memory based limitations with our current SDK architecture.  I'm flagging this because I think these are issues that may need to take time to resolve and it may take coordination involvement outside of what Google alone can do.   Since we've been trying to build out a lot of app functionality on top of the SDK we might be hitting these issues earlier than others.   This would be a great topic to discuss when / if we get a governance call setup.  Basically - I think we'll need to ensure CQL library performance for Android is prioritized in addition to HAPI optimizations (both libraries were written for servers so this is not to knock them).</p>",
        "id": 271840401,
        "sender_full_name": "Matt Berg",
        "timestamp": 1644851966
    },
    {
        "content": "<p>I think require a bigger effort so don't want people to be surprised later</p>",
        "id": 271840551,
        "sender_full_name": "Matt Berg",
        "timestamp": 1644852028
    },
    {
        "content": "<p>even on faster devices the experience isn't optimal</p>",
        "id": 271840646,
        "sender_full_name": "Matt Berg",
        "timestamp": 1644852076
    },
    {
        "content": "<p>Let me know thoughts on best way to discuss.  It would be great if we can collaborate and coordinate to figure out best way to first better understand this issue and then tackle it</p>",
        "id": 271843145,
        "sender_full_name": "Matt Berg",
        "timestamp": 1644853112
    },
    {
        "content": "<p>Speaking to Vitor some of these issues may also be related to needing to preloading libraries so will try and provide more clarity if there is guidance when implementing we can provide.  I think regardless I think there will need to be some continued investment in some of the libraries the SDK is dependent on.</p>",
        "id": 271852349,
        "sender_full_name": "Matt Berg",
        "timestamp": 1644856584
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"401347\">Matt Berg</span> <a href=\"#narrow/stream/310477-who-smart-guidelines/topic/community-process/near/271840401\">said</a>:</p>\n<blockquote>\n<p>hi <span class=\"user-mention silent\" data-user-id=\"191604\">Carl Leitner</span> <span class=\"user-mention silent\" data-user-id=\"408480\">Christopher Haskew</span> wanted to bring up an issue that we discussed on our call with Google today.   There are some general risks around the SDK in terms of performance that I think we should be looking at as a community.  Namely CQL evaluations can be quite slow (especially on lower end devices).  Similarly things like data extraction can be very slow.  This relates to optimizations that are needed in the HAPI library.  <span class=\"user-mention silent\" data-user-id=\"366686\">Jing Tang</span> can provide more details.   We'll try and provide more details but generally we see data extractions taking several seconds on a modern device.  However, on an older 1G 1.3GHZ android device it was taking over 10 minutes.  So there may be some memory based limitations with our current SDK architecture.  I'm flagging this because I think these are issues that may need to take time to resolve and it may take coordination involvement outside of what Google alone can do.   Since we've been trying to build out a lot of app functionality on top of the SDK we might be hitting these issues earlier than others.   This would be a great topic to discuss when / if we get a governance call setup.  Basically - I think we'll need to ensure CQL library performance for Android is prioritized in addition to HAPI optimizations (both libraries were written for servers so this is not to knock them).</p>\n</blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"401347\">@Matt Berg</span>  sorry for the late reply... <span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span>  and I chatted to Vitor about the CQL work last night. From what I understand - yes we're aware that the compiled CQL files are +++ in size and we need to find ways to optimise sync to mobile. Vitor is continuing to work on that. </p>\n<p>Once on the device, Im not aware of issues re: time to evaluate the compiled CQL though.  <span class=\"user-mention\" data-user-id=\"458846\">@Vitor Pamplona</span> have you tested this yet? Are both issues linked?</p>",
        "id": 278699076,
        "sender_full_name": "Christopher Haskew",
        "timestamp": 1649773087
    },
    {
        "content": "<p>Tagging also <span class=\"user-mention\" data-user-id=\"356307\">@Kunjan Patel</span> and <span class=\"user-mention\" data-user-id=\"453326\">@Patrick Delcroix</span></p>",
        "id": 278699230,
        "sender_full_name": "Christopher Haskew",
        "timestamp": 1649773157
    }
]