[
    {
        "content": "<p>One of the <a href=\"https://confluence.hl7.org/display/GP/Topic%3A++FHIR+to+SDC\">Gemini SDPi+FHIR topics</a> that was recently added had to do with the representation of information from a FHIR-based source (e.g., a lab result observation) that is brought into a BICEPS-enabled device or application.  NOTE: that the DoF IGs have focused on Device-to-FHIR information flow, not the opposite direction.  <span class=\"user-mention\" data-user-id=\"303041\">@Stefan Schlichting</span>  mentioned that this FHIR resource info would be represented in a BICEPS SystemContext ... somewhere ... somehow ...  <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span>   How's that supposed to work?  Any place where this has been documented, prototyped, hack-a-thon'd ...   We need content for that confluence page!</p>",
        "id": 198366587,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1590090014
    },
    {
        "content": "<p>A lab result would be represented as part of the WorkflowContextState/WorkflowDetail. The results of the performed lab tests is communicated using the PerformedOrderDetail/ResultingClinicalInfo. If you have a specific example I can probably generate an example instance.</p>",
        "id": 198369729,
        "sender_full_name": "Stefan Schlichting",
        "timestamp": 1590091495
    },
    {
        "content": "<p>OK ... but let's stay general for a moment - I like arm chairs!    <br>\nIf I have a FHIR  Bundle \"My Way Kwol Bundle\" that contains a set of  resources and data elements that do not map to the core BICEPS model objects &amp; attributes (e.g., something outside the MDS-VMD-Channel-Metrics or Alerting etc. definitions) is there a general way that I could integrate it into BICEPS Context specifications somewhere?  Or will it be on a resource-by-resource basis and possibly requiring use of the SDC extension model at some point?  </p>\n<p>Or am I lost out in left field ... again ...?</p>",
        "id": 198370702,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1590091897
    },
    {
        "content": "<p>Most information will be mapped into the WorkflowContext, but depending on your resource different attribute and elements will be filled.<br>\nAt some point in time you may need the extension model as BICEPS really focused on the B - Basic.</p>",
        "id": 198381585,
        "sender_full_name": "Stefan Schlichting",
        "timestamp": 1590097685
    }
]