[
    {
        "content": "<p>This is the Zulip topic for discussion during the FHIR CAT 26 (2021-01) Isolation Bed Use Case Track</p>",
        "id": 222670854,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1610587448
    },
    {
        "content": "<p>Remember that we kick off the FHIR CAT for this Isolation Bed Gemini track at 0900 today ... focus will be on detailing the use case and exploring various tools &amp; FHIR resources / IG etc. that we can leverage, as well as related IHE FHIR-based profiles.</p>",
        "id": 222722025,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1610633785
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span>  FWIW I will not be able to join the track until closer to the start time of 0900 Pacific</p>",
        "id": 222732599,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1610638095
    },
    {
        "content": "<p>Are y'all recording your sessions? I won't be able to make your track but I am interested in learning what y'all are working on.</p>",
        "id": 222750975,
        "sender_full_name": "Camila Altman",
        "timestamp": 1610645048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300989\">@Camila Altman</span>  sorry but no, we aren't recording the sessions today - we are just working through the use case ... we'll be heads down doing that today and tomorrow ... but if you pop in and want to ask questions - go for it!  We can always \"take a break\" ... probably will NEED a break!</p>",
        "id": 222761667,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1610649292
    },
    {
        "content": "<p>Updated the Isolation Bed track schedule to join the V2-to-FHIR discussion at 1400 Pacific to review ORU mapping in detail ... join us!</p>",
        "id": 222790304,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1610661398
    },
    {
        "content": "<p>Sorry saw this too late. Hopefully can catch the highlights tomorrow</p>",
        "id": 222807152,
        "sender_full_name": "Camila Altman",
        "timestamp": 1610672635
    },
    {
        "content": "<p>Note that we have finished this track for this CAT 26 ... pretty spent at 11:30 Pacific Friday!!!  Thanks for those who popped into the sessions ... we will be spending a bit more time today getting the notes pulled together - and before we forget EVERYTHING!!!  See many of you next week and at the upcoming HL7 DEV WGMs!</p>",
        "id": 222912881,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1610739313
    },
    {
        "content": "<p>Note this thread <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/DeviceDefinition.20as.20CatalogEntry/near/224002953\">DeviceDefinition as CatalogEntry</a> and the related discussion at the (FHIR CAT 2101-01 Isolation Track narrative) around application of the Point-of-Care Identity Management (IHE DEV PCIM) profile that takes this to the next step of managing the association/disassociation of devices and patients and the possible use of <a href=\"http://build.fhir.org/workflow.html#relationships\">FHIR Workflow constructs</a> ... to be discussed during tomorrow's HL7 DEV Devices on FHIR session Q1</p>",
        "id": 224043520,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1611670277
    },
    {
        "content": "<p>For the next <a href=\"https://confluence.hl7.org/x/-Jc7Bg\">HL7 FHIR CAT 2021-05 event</a>, we just posted a draft (VERY draft) proposal for the <a href=\"https://confluence.hl7.org/x/eaU7Bg\">2nd Isolation Point-of-Care Gemini Device Interoperability track</a>.  Please give it a look ... help fill in some of the blanks or leave comments re. what you would like explained or included.  Note this is a continuation of the January '21 track and we plan to have the 3rd push in the 28th FHIR CAT later this year.</p>",
        "id": 228832879,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1614885328
    },
    {
        "content": "<p>Not able to get into virtual meeting with the link that I have - \"you'll join the call when someone lets you in\". Anyone getting in?</p>",
        "id": 239249615,
        "sender_full_name": "John Rhoads",
        "timestamp": 1621343122
    }
]