[
    {
        "content": "<p>One of the topics that the IHE / HL7  Devices community worked on was patient-device association management.  IHE crafted a V2-based profile (PCIM) to support enterprise capabilities, but this does not address the \"from the device interface\", device-to-device, integration around the bedside.  How should we handle this capability in the SDPi+FHIR world?</p>",
        "id": 200277358,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1591730486
    },
    {
        "content": "<p>Hi Todd,</p>\n<p>Contextual information that may be relevant for the interpretation of information from the device is captured in the “System Context” of the device. Especially for device-patient association there exists the so-called „Patient Context“ that allows to convey the association status of a patient to a specific device. As all context elements in SDC, the „Patient Context“ has a list of 0..n validators that allow to capture who has validated an association (Validator).<br>\nThe interesting question is how the “Patient Context” is \"filled\". In SDC there exists multiple ways depending on the scenario that is supported in the environment.<br>\n•   The “Patient Context” might be manually set/proposed from an application that associates the patient with the device, e.g. in an OR.<br>\n•   The “Patient Context” might be set/proposed automatically based on other context infor-mation, e.g. “Location Context” or “Ensemble Context” or “Workflow Context”.<br>\n•   The device discovers possible “Patient Context” and either automatically assigns it or pro-poses it to the operator for confirmation.</p>\n<p>Automatic proposal generation may be based on a centralized service provider in the SDC network that provides a lists of “Workflow Context” elements that comprises the mapping between patient assigned location and the subject patient as part of the WorkflowDetail. The centralized service pro-vider might get that data using the PCIM workflow based on HL7 v2 or FHIR and map it into the SDC “Workflow Context” structure for communication to the device. The last remaining part for Indirect Device-Patient Association is how the device knows its location, which can be solved by manual configuration (based on SDC-based topology discovery), LLDP or other location tracking technologies. By the nature of SDC this allows subscription to that Workflow Context on the centralized service provider to receive updates of the context association status,</p>",
        "id": 200409875,
        "sender_full_name": "Stefan Schlichting",
        "timestamp": 1591792709
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"303041\">@Stefan Schlichting</span>  So we could define an SDC Participant that acts as a \"PCIM\" SERVICE PROVIDER and thus a \"source of truth\" ... using FHIR-based &amp; V2-based IHE profile transactions / services to integrate the context elements needed?  Also, this would be additional profiling that we would do within IHE SDPi &amp; HL7 DoF ... not something that is explicitly on the map today but should probably be queued up in the Parking Lot to be ubered in the future.</p>",
        "id": 200463111,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1591816510
    },
    {
        "content": "<p>Yes, you are right :) and it sounds like a good plan to include it...later if needed ;)</p>",
        "id": 200463311,
        "sender_full_name": "Stefan Schlichting",
        "timestamp": 1591816593
    }
]