[
    {
        "content": "<p>WE discussed the notion of a default list on the Call today and need to follow up offline to flesh out what we mean and whether we want it in scope for the  project.</p>\n<p>A default lists is part of discovery of list of lists?</p>\n<p>This is different from What list am I allowed to see. It is which list you <em>should</em> start with.</p>\n<p>e.g., when you sign in and run a provider app, you might want to have a list visible right away, without having to choose anything. Just \"the default list\" for the user, given the launch context.</p>\n<p>Questions</p>\n<ul>\n<li>is it property of user or list?</li>\n<li>display on user start?</li>\n<li>How does app know what the system default is?</li>\n</ul>\n<p>TODO: decide which, if any of these requirements to support</p>\n<ul>\n<li>[ ] User sets default within app (app-specific default)</li>\n<li>[ ] Does this get propagated to the EHR?</li>\n<li>[ ] User set default within the EHR, and apps learns</li>\n<li>[ ] Source set default within the EHR, and apps learns</li>\n<li>[ ] Default lists are out of scope</li>\n</ul>",
        "id": 200494575,
        "sender_full_name": "Eric Haas",
        "timestamp": 1591834792
    },
    {
        "content": "<p>Just a reminder, Argo PL Call this Wednesday.</p>\n<p>Agenda: </p>\n<ol>\n<li>Decide on Default lists - see the <a href=\"#narrow/stream/227046-Argo-Patient.20Lists/topic/Default.20Patient.20List/near/200494575\">above post </a></li>\n<li><span class=\"user-mention\" data-user-id=\"233081\">@Carl Anderson</span>  to present some supplemental developer materials (introductory how-to guides) for the Patient Lists argonaut project to help drive more detailed discussion.</li>\n<li>API design proposals</li>\n</ol>",
        "id": 201757874,
        "sender_full_name": "Eric Haas",
        "timestamp": 1592934036
    },
    {
        "content": "<p><a href=\"https://docs.google.com/document/d/1fvb36PLO789YEkj24KrGa8YvacWMx3iRUT3fKVUUDLA/edit?usp=sharing\">Notes</a>  from today's Call</p>",
        "id": 201882908,
        "sender_full_name": "Eric Haas",
        "timestamp": 1593021994
    }
]