[
    {
        "content": "<p>While looking at the sample Synthea data I generated for the connectathon, I realized that all the Locations and Organizations generated were totally flat, even though the resources allow for a <a href=\"https://www.hl7.org/fhir/location.html#example\">nested structure</a> to be built up.</p>\n<p>For example, it's possible to have something like this:</p>\n<div class=\"codehilite\"><pre><span></span><code># Organizations\nUnityPoint Health\n\n# Locations\nUnityPoint Health\n  managingOrganization: UnityPoint Health (org)\n\nUnityPoint Health - Meriter\n  managingOrganization: UnityPoint Health (org)\n\nMeriter Hospital ED\n  managingOrganization: UnityPoint Health (org)\n  partOf: UnityPoint Health - Meriter (loc)\n\nFloor 1\n  partOf: UnityPoint Health - Meriter (loc)\n\nBed 1\n  partOf: Floor 1 (loc)\n</code></pre></div>\n\n\n<p>My first question is - for those who know what real data in real systems looks like - to what degree are Locations and Organizations nested / structured?</p>\n<p>My follow-up thought is - supposing someone wants a list of 'all the <code>UnityPoint Health - Meriter</code> patients', but that Location actually consists of 448 'bed' Locations that are within 200 'rooms' among 4 'floors'.  Given this, each patient potentially has a hierarchy of both location and organization.  If a lists' characteristics includes a Location or Organization (or both) - then that characteristic reference must appear <em>somewhere</em> within the relevant hierarchy attached to each patient member.  Am I thinking about that right?</p>",
        "id": 211030589,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1600879810
    },
    {
        "content": "<p>On the follow-up question: when searching for lists by location, the <em>specific</em> location (not a sub- or super-location) mentioned in the search needs to appear in the list characteristics.</p>\n<p>(More advanced behavior might be possible with chained searches and <code>Location.partOf</code>, but I wouldn't try to get ahead of ourselves here; even flat characteristics seem like a bit of a reach, and hierarchical characteristics are a bridge too far.)</p>",
        "id": 211032399,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600880640
    },
    {
        "content": "<p>In an unrelated vein,  I am also trying to make some more test data based on pre-existing  Alerts data I had already created from Synthea and loaded on the test server.  I still can't get my head around organization as a characteristic vs organization as a managingEntity.   The difference to me is not clear.</p>",
        "id": 211497910,
        "sender_full_name": "Eric Haas",
        "timestamp": 1601302560
    }
]