[
    {
        "content": "<p><a href=\"/user_uploads/10155/lKIMs7rIeeXdE7vniJ2XuLML/fhir-openehr-1.png\" target=\"_blank\" title=\"/user_uploads/10155/lKIMs7rIeeXdE7vniJ2XuLML/fhir-openehr-1.png\">fhir-openehr-1.png</a> <br>\nWhat would you all like to change in this?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/lKIMs7rIeeXdE7vniJ2XuLML/fhir-openehr-1.png\" target=\"_blank\" title=\"/user_uploads/10155/lKIMs7rIeeXdE7vniJ2XuLML/fhir-openehr-1.png\"><img src=\"/user_uploads/10155/lKIMs7rIeeXdE7vniJ2XuLML/fhir-openehr-1.png\"></a></div>",
        "id": 153818963,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1459289890
    },
    {
        "content": "<p>I prefer the term 'implementers' to 'software developers' in relation to FHIR - but whatever term is used should encompass architects and specifiers, rather than create an impression that FHIR is only aimed at coders.</p>",
        "id": 153818966,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1459290883
    },
    {
        "content": "<p>I'm sure others will comment but:</p>\n<ul>\n<li>FHIR is also aimed at clinicians (that's why we have a 'clinician's on fhir' event at all WGMs) - it's that the focus is on implementability</li>\n<li>Extended resources are interoperable internationally as the definitions can be retrieved and programmatically processed, and content that must be understood by the recipient for clinical safety can be indicated. </li>\n</ul>\n<p>cheers...</p>",
        "id": 153818968,
        "sender_full_name": "David Hay",
        "timestamp": 1459291793
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/NQfujR4zHsv0DFr18e5sWkJ1/fhir-openehr-v01.pptx\" target=\"_blank\" title=\"fhir-openehr-v01.pptx\">fhir-openehr-v01.pptx</a> </p>\n<p>I am attaching a first draft of three slides here. That amouont of content would be enough. Layout can definately be improved, perhaps spread the table over two slides to increase readability with some rows on the one page and the rest on a following page.</p>\n<p>The third slide about \"Options when using FHIR and openEHR\" is the newest and least thought through, feel free to suggest improvments</p>\n<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> I tried to add your input without killing the direct quote.<br>\n<span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> I tried to add info about the proccessability/readability of data from extended resources. The part about aimed at clinicians I did not understand where to put in - feel free to suggest concrete change - and both openEHR and FHIR are of course targeting both techies and clinicians - this comparison just highlights the main focus differences as described by core FHIR people in this dialogue.</p>",
        "id": 153818990,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1459297500
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> and <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> please have a look at the slides and give some feedback. I'll also discuss them with HL7 Sweden.</p>",
        "id": 153818991,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1459297603
    },
    {
        "content": "<p>For me the most important question to address would be to explain to an audience that's only heard the FHIR and OpenEHR buzzwords, but knows no details: when would you use one, when would you use another? The slide on intra versus interoperability addresses that point (its too text-rich, but that can be reworked). IMHO most of the aspects covered on slide 2 are more or less the same, and to a lay audience won't mean anything. Slide 3 is true, and useful for us as insiders, but not for a lay audience. </p>",
        "id": 153819005,
        "sender_full_name": "René Spronk",
        "timestamp": 1459307123
    }
]