[
    {
        "content": "<p>Hi, I want to create a FHIR profile equivalent to an examination archetype (using the resource Observation) on openEHR to capture the information of various types of examination (for example, Examination of a burn etc.). Kindly help me. Thanks in advance</p>",
        "id": 153892894,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496916161
    },
    {
        "content": "<p>well, that's on my schedule for the next few weeks, to do with <span class=\"user-mention\" data-user-id=\"191388\">@Thomas Beale</span> and <span class=\"user-mention\" data-user-id=\"191650\">@Ian McNicoll</span>, but I'm waiting for <span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span> to give me some code before getting going .</p>",
        "id": 153892895,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496917426
    },
    {
        "content": "<p>Ok could you please help me?</p>",
        "id": 153892950,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496920493
    },
    {
        "content": "<p>Actually, the archetypes have some items and items in turn contain clusters. So, if I create a fhir profile,how can I attach a cluster to my fhir profile?</p>",
        "id": 153892952,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496920713
    },
    {
        "content": "<p>you can't, directly</p>",
        "id": 153892958,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496925326
    },
    {
        "content": "<p>Then how can I do it?</p>",
        "id": 153892959,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496925535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - I looked at the  AllergyIntolerance resource to see how multiple Reaction details are handled (an internal cluster in openEHR) this seems to be represented by a BackboneElement in FHIR which, if I understand correctly is untyped, acts like container i.e can have child elements. if so does cluster not map to BackboneElement.. or ??</p>",
        "id": 153894207,
        "sender_full_name": "Ian McNicoll",
        "timestamp": 1497619060
    },
    {
        "content": "<p>it's analogous in some ways but not others. In particular, it's a fixed set of elements</p>",
        "id": 153894208,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497619425
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> your work on mapping archetypes to profiles may not be finished, but could you already tell a little more on this? We are developing an EHR, and now is the time to choose the data model. The alternatives are a custom in-house model, and an OpenEHR-based one, both under requirement of mapping the data to FHIR. Since you started the mapping tool project, there must be an approach that you believe could work. If developed properly, how successful could it eventually be?</p>",
        "id": 153908977,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1505815517
    },
    {
        "content": "<p>well, how successful? whether it can be mapped at all depends on whether the archetype contains different and incompatible decisions with the contents of the resources in FHIR. And sometimes, that's the case - for various reasons, the community has decided to handle the same challenge quite differently, and it's not something you can overcome with mapping.</p>",
        "id": 153908986,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505823336
    },
    {
        "content": "<p>a good example of this is the difference in the way that 'no known allergy' or 'no known allergy to X' is handled between openEHR and FHIR - for infrastructural / architectural reasons, these are represented quite differently</p>",
        "id": 153908987,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505823392
    },
    {
        "content": "<p>what this means is that some things can't be mapped. And the openEHR community can't go off and made decisions in a vacuum - nor can the FHIR community ignore openEHR comments. (we try not to ignore any comments)</p>",
        "id": 153908989,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505823476
    },
    {
        "content": "<p>ok, having crossed that barrier, it's my expectation that a combination of general mapping rules, and specific mark up in archetypes (as the source) will enable the automated generation of FHIR profiles.</p>",
        "id": 153908990,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505823643
    },
    {
        "content": "<p>the question that endures is: does that leave so much mark up in the archetype so as to be unmanageable? That we will have to find out....</p>",
        "id": 153908991,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505823699
    },
    {
        "content": "<p>Perhaps direct mapping is the wrong way to approach the co-mingling of openEHR Archetypes and FHIR Resources? If <span class=\"user-mention\" data-user-id=\"191574\">@David Booth</span> is listening in, i'd ask him to please speak to RDF's potential to help in this situation by \"standardizing the standards\" as the Yosemite Project promises RDF is able to do. I'd like to know whether or not the idea of using RDF to bridge the gaps between Archetypes and Resources has any merit, and if not, I'd be curious why, since that capability seems to be a key aspect of the Yosemite Project.  ~ TJL</p>",
        "id": 153909584,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1505957295
    },
    {
        "content": "<p>my perspective on that is that there's 2 different choices here:<br>\n- mapping by decoration from the side vs mapping as a core property of the source<br>\n- the syntax in which you express your mapping</p>",
        "id": 153909585,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505957674
    },
    {
        "content": "<p>the first is more important then the second</p>",
        "id": 153909586,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505957685
    },
    {
        "content": "<p>Excellent question.  We had some discussion about this in May: <a href=\"https://www.w3.org/2017/05/30-hcls-minutes.html\" target=\"_blank\" title=\"https://www.w3.org/2017/05/30-hcls-minutes.html\">https://www.w3.org/2017/05/30-hcls-minutes.html</a>  <span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span> and Eric Prud'hommeaux (W3C) were working on defining a use case, and we have been trying to schedule an opportunity for further discussion with <span class=\"user-mention\" data-user-id=\"191388\">@Thomas Beale</span> and others about it on our weekly FHIR RDF call.  <span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span> set up a doodle poll to help find a date, but it has not yet been scheduled.   Claude, do you have some dates to suggest?</p>",
        "id": 153910579,
        "sender_full_name": "David Booth",
        "timestamp": 1506389780
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193029\">@Vladimir Smirnov</span> - sorry coming a bit late to this conversation. I a,m interested in your project and have been in conversation with Grahame and others about potential mappings between openEHR and FHIR. My company has just kicked off a small open source project to develop mappings between openEHR and the UK-Care-connect FHIR profiles based on HAPI-FHIR. My take is that for most of the more concrete resources eg. Allergies , conditions etc there is just a bit of a one-off hack to do the transforms. The tricky aspect is always going to be the semantic questions (as per Grahame's 'no known allergies' example) not the technical coding.</p>\n<p>Obviously being able to do this work once for a broad aspect of the openEHR community will substantially reduce the effort overall, bearing in mind that the actual transforms are going to be between openEHR templates and FHIR profiles with quite a bit of localisation. <br>\nThe more generic FHIR classes like Observation do provide an interesting opportunity to do something more interesting around automation, with the more concrete openEHR Observation archetypes being used to auto-create FHIR Observation profiles.</p>",
        "id": 153912956,
        "sender_full_name": "Ian McNicoll",
        "timestamp": 1507395671
    },
    {
        "content": "<blockquote>\n<p>My company has just kicked off a small open source project to develop mappings between openEHR and the UK-Care-connect FHIR profiles based on HAPI-FHIR. </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191650\">@Ian McNicoll</span> Has your company's \"small open source project\" been made public yet, and if so, could you please provide a link to it's repository? </p>\n<p>Thanks,<br>\nThomas</p>",
        "id": 153913541,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1507763233
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192005\">@Thomas Lukasik</span> </p>\n<p>We are not quite ready to share the code ;( Needs a bit of work but I will ping here when it is up on a git repo.</p>\n<p>Ian</p>",
        "id": 153914030,
        "sender_full_name": "Ian McNicoll",
        "timestamp": 1508144490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191650\">@Ian McNicoll</span> have you done work on observation mapping’s to Fhir - mostly interested around snomed codes you’ve used.</p>",
        "id": 153914109,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1508162342
    },
    {
        "content": "<blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"192005\">@Thomas Lukasik</span> <br>\nWe are not quite ready to share the code ;( Needs a bit of work but I will ping here when it is up on a git repo.<br>\nIan</p>\n</blockquote>\n<p>Thanks <span class=\"user-mention\" data-user-id=\"191650\">@Ian McNicoll</span>..  I'll be looking forward to a glimpse at that solution.. and if there is anything that I can do to help the effort in the meantime, please let me know.</p>\n<p>Thomas</p>",
        "id": 153914116,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1508168712
    },
    {
        "content": "<p>How crazy would it be to create profiles from generic FHIR resources for each entity in an archetype and share them as bundles?</p>",
        "id": 153973153,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1530631683
    },
    {
        "content": "<p>it woudn't be that crazy to create profiles for archetypes. <span class=\"user-mention\" data-user-id=\"191650\">@Ian McNicoll</span> and I are going to set up a general infrastructure for that some day</p>",
        "id": 153973213,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530648096
    },
    {
        "content": "<p>I'm not sur about the each entity and the bundle bit - those sound like packaging granularity questions</p>",
        "id": 153973214,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530648126
    },
    {
        "content": "<p>Focus on observations. Loads of concrete archetypes begging to be used to profile generic fhir observations. <span class=\"user-mention\" data-user-id=\"191708\">@Diego Bosca</span>  let's talk</p>",
        "id": 153973223,
        "sender_full_name": "Ian McNicoll",
        "timestamp": 1530648920
    }
]