[
    {
        "content": "<p>The debate continues <a href=\"https://www.digitalhealth.net/2020/03/time-to-light-the-fhir-and-get-to-grips-with-standards/\" target=\"_blank\" title=\"https://www.digitalhealth.net/2020/03/time-to-light-the-fhir-and-get-to-grips-with-standards/\">https://www.digitalhealth.net/2020/03/time-to-light-the-fhir-and-get-to-grips-with-standards/</a></p>\n<p>See the comments section</p>",
        "id": 190156161,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1583833896
    },
    {
        "content": "<p>I read the comments section  - which I usually don't anymore. Higher s/n ratio than the usual comments, but where does that leave things? Real standardization is hard.</p>",
        "id": 190156461,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583834134
    },
    {
        "content": "<p>I'm not sure the debate will ever end. Fundamentally openEHR and FHIR are different and as such there will always be tension.<br>\nAs I am now a supplier - I follow the direction set by the NHS as per the following, which says use FHIR (Section 8)<br>\n<a href=\"https://assets.nhs.uk/prod/documents/NHS_Digital_Health_Technology_Standard_draft.pdf\" target=\"_blank\" title=\"https://assets.nhs.uk/prod/documents/NHS_Digital_Health_Technology_Standard_draft.pdf\">https://assets.nhs.uk/prod/documents/NHS_Digital_Health_Technology_Standard_draft.pdf</a></p>",
        "id": 190157456,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1583835054
    },
    {
        "content": "<p>The debate will never end, and there will always be tension between those who have a chosen side. But there may be some new people reading in that forum who are not entrenched, and it is good if they can be made aware of the facts. Some misinformation to be countered e.g. FHIR can't be made to work without profiles, so we have to wait (and implying maybe the need for something else...)</p>",
        "id": 190160390,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1583837780
    },
    {
        "content": "<p><span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span></p>",
        "id": 190164804,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1583841979
    },
    {
        "content": "<p>Maybe being optimistic but I could see some pragmatism coming into the conversation. <br>\nI see the debate holding us back, many providers are not anywhere near a structured EHR and in some areas we are only just moving to PDF/html. <br>\nI feel we need to agree in some areas to make progress. As Ian M mentioned we need to avoid the model jihadis.</p>",
        "id": 190168562,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583845332
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191687\">Kevin Mayfield</span> <a href=\"#narrow/stream/179174-openehr/topic/UK.20Discussion.20on.20FHIR.20and.20openEHR/near/190168562\" title=\"#narrow/stream/179174-openehr/topic/UK.20Discussion.20on.20FHIR.20and.20openEHR/near/190168562\">said</a>:</p>\n<blockquote>\n<p>I feel we need to agree in some areas to make progress. As Ian M mentioned we need to avoid the model jihadis.</p>\n</blockquote>\n<p>Well, that's everyone. All FHIR resources are models, as are all profiles. So are openEHR artefacts. So the only interesting questions really are: how well do the models actually work in representing a) clinical / healthcare need and /or b) data that are in existing systems? Is the modelling approach scalable, implementable and governable? How strong are the connections between domain experts and the model structures? Are the models re-usable or do implementers have to keep creating new, local ones?</p>\n<p>If FHIR already has all this worked out, then there's nothing to talk about, and nothing to hold anyone back. I suggest however, that a more objective look at things might be useful. Here's an example: <a href=\"https://wolandscat.net/2020/03/09/fhir-fixes-the-choice-construct-part-i/\" target=\"_blank\" title=\"https://wolandscat.net/2020/03/09/fhir-fixes-the-choice-construct-part-i/\">https://wolandscat.net/2020/03/09/fhir-fixes-the-choice-construct-part-i/</a></p>",
        "id": 190199891,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1583860850
    },
    {
        "content": "<p>Or this: <a href=\"https://wolandscat.net/2019/11/14/fhir-fixes-why-a-type-hierarchy-would-help/\" target=\"_blank\" title=\"https://wolandscat.net/2019/11/14/fhir-fixes-why-a-type-hierarchy-would-help/\">https://wolandscat.net/2019/11/14/fhir-fixes-why-a-type-hierarchy-would-help/</a></p>",
        "id": 190201000,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1583861376
    },
    {
        "content": "<p>I think we need to tackle basics, does it matter what model I use? We dont have a standard way of sending service requests around. The closest we have in the uk is html based CDA (which has limited amount of structure) (sic).</p>\n<p>It also seems adoption is inversely related to structured models, the more complex the exchange the less it is adopted. If structured can be avoided, it is. <br>\nThe html CDa I mentioned has issues - clinical safety, but these can be resolved (clincially) by producing better html.</p>",
        "id": 190257642,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583913839
    },
    {
        "content": "<p>Sure, but it all comes in the end if you are obligated by regulations. If a national rule tells you to send structured data you do. Nobody does work without the need</p>",
        "id": 190269575,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1583924462
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191687\">Kevin Mayfield</span> <a href=\"#narrow/stream/179174-openehr/topic/UK.20Discussion.20on.20FHIR.20and.20openEHR/near/190257642\" title=\"#narrow/stream/179174-openehr/topic/UK.20Discussion.20on.20FHIR.20and.20openEHR/near/190257642\">said</a>:</p>\n<blockquote>\n<p>It also seems adoption is inversely related to structured models, the more complex the exchange the less it is adopted. If structured can be avoided, it is. </p>\n</blockquote>\n<p>Well, complex exchange doesn't  relate only to the level of structuring of the data, it relates heavily to the complexity of the protocol, how hard to implement, how easy to solve common cases etc. If structure really is the problem in the UK, then I would think the NHS should be doing something other than recommending FHIR to try to solve interoperability. </p>\n<p>My concerns with FHIR aren't that it can't work, it's that with some modifications on various questions of modelling and methodology, it can work <em>much better</em> than without.</p>",
        "id": 190270317,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1583925057
    },
    {
        "content": "<p>true and in several areas, html plus structured Patient is being mandated - plus Encounter, Practitioner and Organisation.</p>",
        "id": 190270318,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583925060
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191388\">@Thomas Beale</span> I'm not arguing about the merits of openehr or fhir ... what I am saying is we need to be more pragmatic. </p>\n<p>What <span class=\"user-mention\" data-user-id=\"191650\">@Ian McNicoll</span> has here is fine: <a href=\"https://openehr.org/ckm/templates/1013.26.267\" target=\"_blank\" title=\"https://openehr.org/ckm/templates/1013.26.267\">https://openehr.org/ckm/templates/1013.26.267</a></p>\n<p>It is a form, a form with coding. The addition of coding is slightly more advanced than many forms products common to the UK market but most could implement something like it. My belief is these products should support coding and it is something we should push (push coding rathe than FHIR or openEHR - maybe coding should be mandated?).  </p>\n<p>Going for the archetype or a complex set of FHIR resources isn't going to work, it's too far from what people are currently familiar with. <br>\nYou could move this archetype on the wire (to infection control) as a FHIR QuestionnaireResponse (part of a FHIR Service Request message), this is a simple resource and similar to what is being asked for.</p>",
        "id": 190275124,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583929484
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191687\">Kevin Mayfield</span> <a href=\"#narrow/stream/179174-openehr/topic/UK.20Discussion.20on.20FHIR.20and.20openEHR/near/190275124\" title=\"#narrow/stream/179174-openehr/topic/UK.20Discussion.20on.20FHIR.20and.20openEHR/near/190275124\">said</a>:</p>\n<blockquote>\n<p>Going for the archetype or a complex set of FHIR resources isn't going to work, it's too far from what people are currently familiar with. <br>\nYou could move this archetype on the wire (to infection control) as a FHIR QuestionnaireResponse (part of a FHIR Service Request message), this is a simple resource and similar to what is being asked for.</p>\n</blockquote>\n<p>Good suggestion. <span class=\"user-mention\" data-user-id=\"191708\">@Diego Bosca</span> is working on that kind of thing, but we could try to make that route as a more mainstream activity in our community.</p>",
        "id": 190276465,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1583930568
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191708\">@Diego Bosca</span> not going to say this is exact version of the openEhr covid-19 (I'm using covid-19 as a use case for some patient-referral work I'm doing). Some parts may be useful <a href=\"https://project-wildfyre.github.io/careconnect-messaging-r4/Questionnaire-covid-19-public.html\" target=\"_blank\" title=\"https://project-wildfyre.github.io/careconnect-messaging-r4/Questionnaire-covid-19-public.html\">https://project-wildfyre.github.io/careconnect-messaging-r4/Questionnaire-covid-19-public.html</a></p>",
        "id": 190303643,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583945060
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> </p>\n<p>to be clear, this is not actually a form - it is the dataset definition for a form, completely based on archetypes - most of which are standard re-useable ones off CKM and the data stored against these definitions is agnostic to the form or composition document - so it can be queryed at granular level not just a sa form.</p>\n<p>Under the hood are archetypes that roughly equate to some FHIR resources e.g sympt0m-&gt;Observation. The data is code. structured and fully queryable by any openEHR CDR - by this weekend it will be deployed on 3 different  CDRs from different suppliers and completely different apps. Forms are being built - some automatically from the template data definition, others by hand.</p>\n<p>The junction for your infection control message would be that the 'service request' archetype stores the fact of infection control referral (Domed coded) and if that team is not on an openEHR system, this is what would send your message</p>\n<p>DIPS do not need to do this, since their infection control system (or referral mgt)  is inside the same openEHR system. In their case a simple notification is probably all that is required and then the in control folks just query to get the original request and the full assessment, so a message not necessary. But, as you say this will be a mixed economy for a long time so both approaches are valid and needed.</p>",
        "id": 190344439,
        "sender_full_name": "Ian McNicoll",
        "timestamp": 1583970433
    },
    {
        "content": "<p>Re ServiceRequest message, it is a notification.</p>\n<p>Which I why I’m keen to make a distinction between the workflow/action part (the message) and the clinical content (as document,  archetype, questionnaire, etc). </p>\n<p>Combining this action with the archetype/document information makes it a more complicated problem to solve (correct me if I'm wrong but I believe your interpretation of messaging is both action and information). The notification can be generic and not tied to any system, service or department.</p>",
        "id": 190359441,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583993695
    },
    {
        "content": "<p>Another reason for decoupling - we know it works. NHS 111, has effectively decoupled its HL7v3 into action and information. <br>\nI strongly suspect it is now exchanging both unstructured and bespoke structured covid-19 questions and answers.</p>",
        "id": 190364565,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1584000769
    }
]