[
    {
        "content": "<p>starting message</p>",
        "id": 153812976,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1456092475
    },
    {
        "content": "<p>This stream is for (mainly technical) issues associated with the use of FHIR by openEHR based systems, and/or other issues relating to fhir + openehr co-existence</p>",
        "id": 153812977,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1456093006
    },
    {
        "content": "<p>I'm interested in exploring a number of FHIR topics here, probably in separate threads (topics?).</p>\n<p>1. how to use FHIR over openEHR? We already generate REST API URIs from openEHR content models (e.g. see  <a href=\"https://www.ehrscape.com/api-explorer.html\" target=\"_blank\" title=\"https://www.ehrscape.com/api-explorer.html\">https://www.ehrscape.com/api-explorer.html</a>), and we don't really want to do endless manual mapping of those to FHIR resources/profiles. Is there a better way?</p>\n<p>2. the more general (and controversial) question of whether we (or anyone) can add new resources to FHIR to represent their 'reference model', so that profiling on those is then a direct map of source archetypes to FHIR profiles. See this post for the general idea - <a href=\"http://wolandscat.net/2015/12/20/making-fhir-work-for-everybody/\" target=\"_blank\" title=\"http://wolandscat.net/2015/12/20/making-fhir-work-for-everybody/\">http://wolandscat.net/2015/12/20/making-fhir-work-for-everybody/</a> .</p>\n<p>3. I wonder whether FHIR profile logic needs to be any different from ADL logic. Can we create a single formalism that does both jobs?</p>\n<p>I realise some of these topics may jar with FHIR-as-usual thinking, but I am genuinely interested in finding commonalities and joining up major e-health technologies and getting rid of needless silo-ed architectures.</p>\n<p>Also, these issues are generic and would apply to any other model-based architecture (e.g. BRIDG or even non-health), so consider openEHR as a surrogate for other such technologies.</p>",
        "id": 153812978,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1456093038
    }
]