[
    {
        "content": "<p>Hello, we are 3 delphi developers looking into the pascal version of FHIR for Norwegian FHIR projects, there is not so much discussion in the pascal stream so I was just wondering if you know other places where people also discuss FHIR for Delphi, or is the pascal community for FHIR not so big yet? We have our own skype channel where we discuss FHIR so we dont disturb you with all our internal beginner problems. :)</p>",
        "id": 154059238,
        "sender_full_name": "Torgeir Amundsen",
        "timestamp": 1546206694
    },
    {
        "content": "<p>pascal community is not that big yet. To my knowledge, there is no other place to discuss things, and if people contact me directly, I refer questions here</p>",
        "id": 154059286,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1546206760
    },
    {
        "content": "<p>I see, would you prefer that we try to discuss more here instead so other people can maybe learn from our problems or is it better to keep it in our internal chat? :)</p>",
        "id": 154059299,
        "sender_full_name": "Torgeir Amundsen",
        "timestamp": 1546206833
    },
    {
        "content": "<p>hard to say; typically, in my experience. such chats are a mix of things interesting to other people, and things that are not, and pulling them apart is difficult</p>",
        "id": 154059339,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1546206876
    },
    {
        "content": "<p>True, maybe we can make some posts later of what we think could be of interest to others from our internal chat. Husin Alkatiri is one of the 3, he already asked some questions here. It seems like things are working better now, after some problems to begin with.</p>",
        "id": 154059404,
        "sender_full_name": "Torgeir Amundsen",
        "timestamp": 1546207050
    },
    {
        "content": "<p>well, it's always good to know what problems there are.</p>",
        "id": 154059409,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1546207078
    }
]