[
    {
        "content": "<p>I'm looking for a definition of FHIR Resources (Patient, Appointment etc) in Pascal/Delphi. <a href=\"http://github.com/grahamgrieve/fhirserver\">github.com/grahamgrieve/fhirserver</a> seemed very promising. Unfortunately I’m not able to use it as described in „Using the library for a single version“. I keep getting errors in the IndyOpenSSL files. I managed to solve the unknown ppByte and pppByte types but now I’m stuck with the unknown pIdC_TM type in IdOpenSSLHeaders_asn1.pas<br>\nI’ve tried to use the units in a RAD Studio 10.4 Delphi project.</p>",
        "id": 225674444,
        "sender_full_name": "Regine Mayer",
        "timestamp": 1612869807
    },
    {
        "content": "<p>that's odd, I'm using 10.4, and not having that problem. Are you using the openssl headers in the fhirserver code?</p>",
        "id": 225746632,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612900118
    },
    {
        "content": "<p>Yes, I'm using them. I added searchpaths to the directories below C:\\work\\fhirserver\\dependencies\\Indy10. In which file is pIdC_TM type defined?<br>\nIn the meantime I tried to compile the FHIRToolkitR4 project and get a file not found error for ..\\library\\version\\FHIR.Version.Client.pas <br>\nThere is no  such file in the branch. Do I have to replace version for fhir4? So it would be the file ..\\library\\fhir4\\fhir4_client.pas ?</p>",
        "id": 225813756,
        "sender_full_name": "Regine Mayer",
        "timestamp": 1612950615
    },
    {
        "content": "<p>I fixed the problem with the unknown type pIdC_TM type, searchpath was missing the indy10\\system directory.</p>",
        "id": 225816521,
        "sender_full_name": "Regine Mayer",
        "timestamp": 1612952407
    },
    {
        "content": "<p>Next error is<br>\ndcc32 Fatal error] IdAntiFreezeBase.pas (180): F2051 Unit IdIOHandlerSocket was compiled with a different version of IdGlobal.IdDisposeAndNil)<br>\nI guess I have to disable Indy Packages contained in 10.4 because it's a conflict between them and the Indy files of fhirserver. <br>\nCan't do that at the moment because I have to compile a new release and need a stable 10.4 installation. Will try next week.</p>",
        "id": 225820104,
        "sender_full_name": "Regine Mayer",
        "timestamp": 1612954893
    },
    {
        "content": "<p>All problems solved, it was my mistake. I included far too many files from ..library\\fhir4 in my project. After removing them the errors disappeared, I apologize for the hassle!</p>",
        "id": 225825070,
        "sender_full_name": "Regine Mayer",
        "timestamp": 1612958009
    },
    {
        "content": "<p>no problems.</p>",
        "id": 225899830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612987863
    },
    {
        "content": "<p>the FHIRTooklitR4 problem is some missing unit aliases.</p>",
        "id": 225899865,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612987877
    },
    {
        "content": "<p>though do you really need that to compile?</p>",
        "id": 225899886,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612987884
    },
    {
        "content": "<p>No, I don't need the toolkit. Yesterday I managed to parse XML into TFHIRPatient or TFHIRAppointment! I'm going to look into Bundles now.<br>\nThank you for the help and for providing the fhirserver!</p>",
        "id": 225972952,
        "sender_full_name": "Regine Mayer",
        "timestamp": 1613040179
    }
]