[
    {
        "content": "<p>Are there any git projects which uses fhirserver ? This will help us to understand how other applications are using fhirserver.<br>\nCurrently our imaging systems support HL7 v2. We use Mirth Connect as interface engine.<br>\nAfter we found fhirserver (which supports HL7 v2, FHIR, SNOMED, etc) which is also developed using Delphi, we are thinking of using fhirserver, removing Mirth Connect.<br>\nWhich means, we want to use fhirserver for the below functionalities,</p>\n<ol>\n<li>\n<p>Run a process which will wait for HL7 v2 messages (Example: ORM). Once received, we want to write to DB or other repository where our systems consumes them.<br>\n• After I see your library, I understand that it supports till 2.7. This is fine for us.</p>\n</li>\n<li>\n<p>Create a small FHIR server, which will receive the FHIR messages (Orders) and in turn these FHIR messages in our server are consumed by our systems.</p>\n</li>\n<li>Convert the received HL7 v2 messages to FHIR messages, send them to our FHIR server, and in turn these FHIR messages are consumed by our systems.<br>\n• To support our existing customers who send HL7 v2 messages to us.<br>\n• Internally we want our systems to understand FHIR xml’s rather than HL7 v2’s position based messages.</li>\n</ol>\n<p>Are these supported?</p>",
        "id": 209364861,
        "sender_full_name": "Anil TA",
        "timestamp": 1599558150
    },
    {
        "content": "<p>who uses it: there are all these forks: <a href=\"https://github.com/grahamegrieve/fhirserver/network/members\">https://github.com/grahamegrieve/fhirserver/network/members</a>  I don't know what that means ....</p>",
        "id": 209368158,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599560335
    },
    {
        "content": "<p>Thank you. I can review the forks and find out the client applications which are using fhirserver as a library.</p>",
        "id": 209368615,
        "sender_full_name": "Anil TA",
        "timestamp": 1599560702
    },
    {
        "content": "<p>well, they might be...</p>",
        "id": 209368637,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599560723
    },
    {
        "content": "<p>Can we run a process using fhirserver classes and wait for incoming HL7 v2 messages using MLLP protocol ? We are currently using Mirth Connect interface engine. Now we want to replace with fhirserver for receiving incoming HL7 messages.</p>",
        "id": 212824516,
        "sender_full_name": "Anil TA",
        "timestamp": 1602249759
    },
    {
        "content": "<p>Using MLLP protocol</p>",
        "id": 212825415,
        "sender_full_name": "Anil TA",
        "timestamp": 1602250242
    },
    {
        "content": "<p>I have not created this functionality</p>",
        "id": 212860573,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602268205
    },
    {
        "content": "<p>Ok. I was seeing a thread <a href=\"http://www.delphigroups.info/2/a4/157245.html\">http://www.delphigroups.info/2/a4/157245.html</a>, where you mentioned about this link,</p>\n<p><a href=\"https://github.com/graemeg/indy/blob/master/Lib/Protocols/IdHL7.pas\">https://github.com/graemeg/indy/blob/master/Lib/Protocols/IdHL7.pas</a></p>\n<p>which means Grieve, can i use this ldHL7.pas for listener and use your 'v2' component in fhirserver for parsing and creating HL7 messages?</p>",
        "id": 212899972,
        "sender_full_name": "Anil TA",
        "timestamp": 1602307297
    },
    {
        "content": "<p>yes, though that is for Indy 9. If you want indy10, you need to use FHIR.v2.protocol</p>",
        "id": 212985650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602457187
    }
]