[
    {
        "content": "<p>We've had a few people report bugs against HAPI FHIR lately where the investigation revealed that the reported was actually using an invalid FHIRPath expression (typically in a custom SearchParameter).</p>\n<p>The common error is around addressing choice[x] types. People seem to often write expressions like this:</p>\n<p><code>Patient.extension('http://foo').valueString</code></p>\n<p>This of course returns no matches because there is no element called <code>valueString</code>. I'm wondering if it would be reasonable for FHIRPath to allow for this syntax. Or perhaps even if the spec doesn't explicitly allow it, for the implementations to be a bit more lenient and accept it. Anecdotal experience certainly seems to suggest that people find the current way counterintuitive.</p>",
        "id": 210128877,
        "sender_full_name": "James Agnew",
        "timestamp": 1600176554
    },
    {
        "content": "<p>fhirpath.js for a while only supported \".valueString\" for something like that (because it didn't have data from the FHIR spec), and now supports both \".value\" and \".valueString\" to be more compliant.   So, I am in favor of James' proposal, even though at this point we are adding more type information from the FHIR spec for other things.</p>",
        "id": 210154919,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600188213
    },
    {
        "content": "<p>The other thing you could do is validate the fhirpath expression and report that out. We have code like that in our server and also in forge to check the expression works in the context.</p>",
        "id": 210189132,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600203265
    },
    {
        "content": "<p>But there are edge cases on it too.</p>",
        "id": 210189168,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600203277
    },
    {
        "content": "<p>But I too support being more lenient on it at execution.</p>",
        "id": 210189221,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600203305
    },
    {
        "content": "<p>I'm not sure about changing the spec, but I can change the HAPI processor to be not so strict on request.</p>",
        "id": 210202012,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600210648
    },
    {
        "content": "<p>I'm going to extend the tests for this</p>",
        "id": 210202049,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600210679
    },
    {
        "content": "<p>ok so I did that and ran into an additional problem in testing for error handling, so I cleaned the error codes up. Here's my changes:</p>\n<p><a href=\"https://github.com/FHIR/fhir-test-cases/pull/74/files\">https://github.com/FHIR/fhir-test-cases/pull/74/files</a></p>",
        "id": 210211803,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600218562
    },
    {
        "content": "<blockquote>\n<p>This of course returns no matches because there is no element called <code>valueString</code>. I'm wondering if it would be reasonable for FHIRPath to allow for this syntax. Or perhaps even if the spec doesn't explicitly allow it, for the implementations to be a bit more lenient and accept it. Anecdotal experience certainly seems to suggest that people find the current way counterintuitive.</p>\n</blockquote>\n<p>It would force implementations to have access to the type information for the resources and datatypes - mine does not yet.  Without this type information, there's no way to know that \"value\" is an element name, and \"String\" a type.  The current <code>.value.ofType(String)</code> does not have that disadvantage.  If we would want to extend that principle to the use of FhirPath in discriminators and searchparameter definitions, this would also make those areas harder to implement.  It's no free lunch, that's for sure.</p>",
        "id": 210233603,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1600244449
    },
    {
        "content": "<p>that's why I added it as a test mode.</p>",
        "id": 210240444,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600249689
    },
    {
        "content": "<p>but I think your argument is incomplete - you can't not have knowledge to make it work properly</p>",
        "id": 210240462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600249709
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191328\">Ewout Kramer</span> <a href=\"#narrow/stream/179266-fhirpath/topic/Addressing.20choice.5Bx.5D.20types/near/210233603\">said</a>:</p>\n<blockquote>\n<p>It would force implementations to have access to the type information for the resources and datatypes</p>\n</blockquote>\n<p>That is exactly the opposite of what I found, and I wonder why.  In fhirpath.js, the JSON field in the resource being processed says \"valueString\", not \"value\", so in order to know that it should be \"value\", we have to pull in type information for resources.   XML also says \"valueString\" in the tag, so I wonder how you are getting to \"value\" without that type information, and having gotten there, why is difficult to know it was once valueString?</p>",
        "id": 210259637,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600262355
    },
    {
        "content": "<p>I agree with Paul there - for FHIR. But it's the opposite way around for, say, CDA. I know that most of you don't care about that ;-)</p>",
        "id": 210330355,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600297243
    },
    {
        "content": "<p>(yet)</p>",
        "id": 210330379,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600297268
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179266-fhirpath/topic/Addressing.20choice.5Bx.5D.20types/near/210330355\">said</a>:</p>\n<blockquote>\n<p>I agree with Paul there - for FHIR. But it's the opposite way around for, say, CDA. I know that most of you don't care about that ;-)</p>\n</blockquote>\n<p>That's exactly it, <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> - my FhirPath engine has no idea it's working with Fhir, so Fhir specific things like <code>valueString</code> (i.e. having the typename appended to the element name) etc have been abstracted away by the parsing layer.  I then need type information to add it back - but that's also why this would be a backwards move for me.</p>",
        "id": 210356637,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1600328282
    }
]