[
    {
        "content": "<p>I downloaded the zip file of ballot spreadsheets, but I can't see one that looks like it is for the FHIRPath ballot.  If it is there, what is its file name?</p>",
        "id": 162249500,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1554132588
    },
    {
        "content": "<p>There's a code for each ballot that you can see on the ballot desktop.  Any of the ones that start with FHIR should work for you</p>",
        "id": 162250371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554133155
    },
    {
        "content": "<p>I do not see codes on the ballot desktop.  Each row of \"Ballot Consensus Groups in which you ARE Participating\" contains a link to the same ZIP file, which contains 44 spreadsheets.  I thought were were supposed to pick the spreadsheet that corresponded to the ballot we were reviewing.  I found spreadsheets for the other ballots I'm reviewing, but not for FHIRPath.</p>",
        "id": 162251626,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1554133947
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span>  - what's the best way for a balloter to figure out which spreadsheet to use?</p>",
        "id": 162252753,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554134697
    },
    {
        "content": "<p>It should be the one whose name matches the unique ballot id. BUt I often get them mucked up. FHIRPath has NMN in the ballot id, for its historical name of \"Neutral Mapping Notation\"</p>",
        "id": 162253419,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1554135166
    },
    {
        "content": "<p>Is that something that can be fixed going forward?</p>",
        "id": 162255972,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554136955
    },
    {
        "content": "<p>Certainly, if I remember to do it...</p>",
        "id": 162256695,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1554137459
    },
    {
        "content": "<p>Thanks, I see the NMN one.  I guess I also could have found it by searching on file contents rather than just the file names.</p>",
        "id": 162258805,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1554138890
    }
]