[
    {
        "content": "<p>As I mentioned on the <a href=\"#narrow/stream/102-questionnaire/topic/Multiple.20unit.20choices.20for.20an.20answer\" title=\"#narrow/stream/102-questionnaire/topic/Multiple.20unit.20choices.20for.20an.20answer\">questionnaire stream</a> we have a need to do a calculation using a Quantity whose unit dimension is known but whose precise unit is not known in advance, and which will need to be converted to a known unit in order to be used in the FHIRPath formula.  Should this functionality of converting one Quantity to another of a different unit be added to FHIRPath?</p>\n<p>The actual work of writing a converter for UCUM units is already done (see for instance https://github.com/lhncbc/ucum-lhc)-- we would just need some syntax for it in FHIRPath, and then of course FHIRPath engines would need to include such a library to support it.</p>",
        "id": 154015264,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1541187796
    },
    {
        "content": "<p>That's an interesting problem, and I guess would need to write a custom function to perform this action (not something that is supported in fhirpath).<br>\nI'm also interested in if others think this is something to add in.<br>\n(If you do come up with a custom implementation, let me know what you decide to call it and I'll add it to our implementation too)</p>",
        "id": 154015364,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541208533
    },
    {
        "content": "<p>How about:  convert('target-ucum-unit').  If the input collection (the left of .convert) is an array of Quantities, the result will be the Quantities in the target unit.  If any element of the input array is not a Quantity or is not convertible an error would be raised.</p>\n<p>Unless someone has a better solution, I will open a GForge ticket for this.</p>",
        "id": 154015687,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1541437101
    },
    {
        "content": "<p>What about toQuantity('mm') or is that feeling more like a type conversion</p>",
        "id": 154015782,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541456627
    },
    {
        "content": "<p>The bare convert just looks to open to missinterpretation</p>",
        "id": 154015783,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1541456655
    },
    {
        "content": "<p>Yes, toQuantity('ucum type') is probably better.</p>",
        "id": 154015786,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1541457110
    },
    {
        "content": "<p>I just realized that Quanitity in FHIR (an object with fields) is different than a quantity in FHIRPath (looks like:  4 'mm').  What would toQuantity(unit) operate on?  I would like it to operate on FHIR Quantity objects.  Perhaps then it would need to be added to FHIR extensions to FHIRPath, rather than to FHIRPath core.</p>",
        "id": 154016274,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1541613382
    },
    {
        "content": "<p>what's special about FHIR quantities as opposed to FHIRPath quantities?</p>",
        "id": 154016983,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541723254
    },
    {
        "content": "<p>FHIR quantities support a comparator.</p>",
        "id": 154017001,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1541727042
    },
    {
        "content": "<p>And, FHIR quantities are an object.  I suppose internally  4 'mm' would be some sort of object too, but FHIR Quantity is a specific kind of object with defined fields.  It might be that the section on converting FHIR primitive types into FHIRPath types (<a href=\"http://hl7.org/fhir/2018Sep/fhirpath.html#types\" target=\"_blank\" title=\"http://hl7.org/fhir/2018Sep/fhirpath.html#types\">http://hl7.org/fhir/2018Sep/fhirpath.html#types</a>) could include Quantity (though that might not be primitive?) but I don't see anything about such a conversion at present.</p>",
        "id": 154017197,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1541780813
    },
    {
        "content": "<p>I guess we should add that too. I use FHIR quantities internally for a FHIRPath quantity, and silently carry the comparator, though calculations on that can be fun</p>",
        "id": 154017261,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541795341
    }
]