[
    {
        "content": "<p>In our implementation, only certain functions will work on repeating fields (i.e. an \"input collection\" with more than one item).  <br>\nI am never sure if this is correct or not...are all functions supposed to work over multiple elements?<br>\nIf not, is there a way to tell if a function <em>should</em> work over multiple inputs?</p>\n<p>Recently this came up on <a href=\"#narrow/stream/179175-argonaut/topic/Conditions.20warning.20constraint.20bug\">https://chat.fhir.org/#narrow/stream/179175-argonaut/topic/Conditions.20warning.20constraint.20bug</a> and so I thought that would be a good example to drive discussion.</p>",
        "id": 275502979,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1647433524
    },
    {
        "content": "<p>In the type system, yes, everything is a collection, but certain functions require singleton collections, as documented in the signature of the function. From the <a href=\"https://hl7.org/fhirpath/#functions\">Functions</a> topic: </p>\n<blockquote>\n<p>If the function expects the argument passed to a parameter to be a single value (e.g. startsWith(prefix: String)) and it is passed an argument that evaluates to a collection with multiple items, or to a collection with an item that is not of the required type (or cannot be converted to the required type), the evaluation of the expression will end and an error will be signaled to the calling environment.</p>\n</blockquote>",
        "id": 275517442,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1647440676
    },
    {
        "content": "<p>So if the signature indicates the argument is of some type, rather than a <code>collection</code>, then it expects a singleton of that type.</p>",
        "id": 275517586,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1647440730
    },
    {
        "content": "<p>thanks Bryn.  I read that section as being specific to the arguments/parameters of a function (passed within <code>()</code>) and not to the input collection.  is that wrong?</p>",
        "id": 275532403,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1647446296
    },
    {
        "content": "<p>In some cases, the function definition explicitly states that an input collection must have a single item.<br>\nFor example, for <code>toString() : String</code> it says:</p>\n<blockquote>\n<p>If the input collection contains multiple items, the evaluation of the expression will end and signal an error to the calling environment.</p>\n</blockquote>",
        "id": 275535269,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1647447165
    },
    {
        "content": "<p>But other methods, like <code>length() : Integer</code> have no indication one way or the other</p>\n<blockquote>\n<p>Returns the length of the input string. If the input collection is empty ({ }), the result is empty.</p>\n</blockquote>",
        "id": 275535430,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1647447222
    },
    {
        "content": "<p>What should <code>length()</code> do if the input is a collection?</p>",
        "id": 275535481,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1647447240
    },
    {
        "content": "<p>FWIW there are just a few functions that don't define what they should do (I thought there were more)...so maybe the answer is to open a JIRA so that we can get clarifications on each one individually?</p>",
        "id": 275537908,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1647448062
    }
]