[
    {
        "content": "<p>Hello,<br>\n I am new to FHIRPath. I am trying to extract data from the PractitionerRole resource as well as the included Practitioner resource and the included HealthcareService&gt;location.address. Is it possible to write a single FHIRPATH query that extracts the Practitioner Name, Practitioner.identifier(NPI) and the Practitioner.HealthcareService.location.address-postalcode? I was trying to split each one separately . e.g. For Practitinoer Name I wrote PractitionerRole.practitioner.resolve().name, and I get the names back but in the process I lose the traceability . I mean the Practitioner is referenced to which PractitionerRole resource, this I am unable to extract from the query. Is there a way to do this? Similarly, if i have to drill down to extract the PractitionerRole.healthcareService.location.address-code, then is that even feasible?Your suggestions would be most helpful. I have been reading the spec but it doesn't contain such examples as far as I could see. Thank you!!! <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span></p>",
        "id": 248907491,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1628542922
    },
    {
        "content": "<p>I'm not fully understanding what you're trying to do.  Are you wanting to create a single string that concatenates name, id and postal code?  Are you using this FHIRPath in an invariant, discriminator or something else?</p>",
        "id": 248908259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628543283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I am trying to extract data. The scenario is that we are trying to extract Practitioners belonging to a certain zip code. A fhir query may not help here as it will return PractitionerRole resources where address is belonging to a certain zip code in the PractitionerRole.HealthcareService.location.address. But it's possible that a single Practitioner may be referenced in multiple PractitionerRole resources. So we decided to use FHIRPath to extract this data. Now the address is taken from PractitionerRole as thats where the location as to where they practice is captured. But the name has to be extracted from the Practitioner resource itself. So while we do this we have to ensure that Practitioner names that hare returned also contain the <a href=\"http://PractitionerRole.id\">PractitionerRole.id</a> as well to maintain the traceability. Hope it gives some clarity. In essence, would there be a way to write the FHIRPath like PractitionerRole.practitioner.resolve().name wher i get the names as well as the Resource ID for the PractitionerRole back?</p>",
        "id": 248909318,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1628543770
    },
    {
        "content": "<p>I'm still not really understanding.  Are you writing CQL?  FHIRPath isn't a query language.  You're first going to need to query your data.  You can then execute FHIRPath against it.</p>",
        "id": 248909955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628544091
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Yes I am extracting the resources  from the FHIR query that I am using. This is the FHIR query that I am using [base]/PractitionerRole?_profile=http://hl7.org/fhir/us/davinci-pdex-plan-net/StructureDefinition/plannet-PractitionerRole&amp;_include=PractitionerRole:practitioner&amp;_include=PractitionerRole:service&amp;_include:iterate=HealthcareService:location&amp;service.location.address-code=97401. The resources returned are used to POST as bundle on the HAPI server base/api/main/test/querybundle?fhirpath=PractitionerRole.practitioner.resolve().name. It returns a set of names like:<br>\n{<br>\n  \"resourceType\": \"Parameters\",<br>\n  \"parameter\": [ {<br>\n    \"name\": \"expression\",<br>\n    \"valueString\": \"PractitionerRole.practitioner.resolve().name\"<br>\n  }, {<br>\n    \"name\": \"result\",<br>\n    \"valueHumanName\": {<br>\n      \"use\": \"official\",<br>\n      \"family\": \"Marks\",<br>\n      \"given\": [ \"Rudy\" ],<br>\n      \"suffix\": [ \"APRN\" ]<br>\n    }<br>\n  }, {<br>\n    \"name\": \"result\",<br>\n    \"valueHumanName\": {<br>\n      \"use\": \"official\",<br>\n      \"family\": \"Howell\",<br>\n      \"given\": [ \"Aimee\", \"Justa\" ],<br>\n      \"suffix\": [ \"MD\" ]<br>\n    }<br>\n  }, {<br>\n    \"name\": \"result\",<br>\n    \"valueHumanName\": {<br>\n      \"use\": \"official\",<br>\n      \"family\": \"O'Hara\",<br>\n      \"given\": [ \"Stacia\" ],<br>\n      \"suffix\": [ \"MD\" ]<br>\n    }<br>\n  }, <br>\nBUt i dont know how to ensure that it also returns the <a href=\"http://Practitioner.id\">Practitioner.id</a> value with it. That's the challenge am facing<br>\nAs an approach do you think exporting data for such data asks using FHIRPath is the most efficient approach?</p>",
        "id": 248911434,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1628544911
    },
    {
        "content": "<p>I'm not familiar with HAPI's querybundle functionality at all - that's not part of the FHIR spec.  What you're trying to do <em>seems</em> like something that GraphQL would be more suited to than FHIRPath.  FHIRPath will only give you a collection of existing FHIR types - and all must be of the same type.  You can't have a collection that mixes 'id' and 'HumanName'.</p>",
        "id": 248916276,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628547596
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span>  thank you for the feedback.</p>",
        "id": 248921601,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1628551121
    }
]