[
    {
        "content": "<p>I am using FHIRPath (C# libraries v3.2.0) to locate target node(s) in a somewhat deeply nested QuestionnaireResponse. When I have found an ITypedElement of interest (using Select(...)), I want to navigate to it's parent and sibling nodes. I haven't yet been able to figure out how to do this. I'd be grateful if someone could point me in the right direction.</p>",
        "id": 238076975,
        "sender_full_name": "David Fallas",
        "timestamp": 1620611266
    },
    {
        "content": "<p>There's no ability to navigate to parents, ancestors or siblings in FHIRPath.  What are you trying to do that requires that sort of navigation?</p>",
        "id": 238079976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620614745
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks for the response and apologies for my tardy rejoinder. I have restructured the select string to retrieve the ancestor that I want by having a couple of and predicates.For posterity, the select is \"item.descendants().where('{0}'.indexOf($this.linkId) &gt;= 0 and $this.descendants().where('{1}'.indexOf($this.linkId) &gt;= 0 and answer.value=true))\" (the two place-holders are lists of Coagulation analytes).<br>\nNow that I have the item I want, I have run into problems with the ToPoco&lt;&gt;() call - it throws 'System.MissingMethodException : Cannot create an abstract class'. Any thoughts anyone?</p>",
        "id": 238387291,
        "sender_full_name": "David Fallas",
        "timestamp": 1620769857
    },
    {
        "content": "<p>OK - I get it, it is the QuestionnaireResponse.ItemComponent that cannot be instantiated. So now that I have the ITypedElement node of interest, it finally dawns on me that I must use the interface to explore the node's Children collection(s). For sure, previous experience with XPath was getting in the way, and I had unwarranted expectations of FHIRPath (put that down to a 'senior moment').</p>",
        "id": 238529598,
        "sender_full_name": "David Fallas",
        "timestamp": 1620847150
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 238551842,
        "sender_full_name": "RP",
        "timestamp": 1620857280
    }
]