[
    {
        "content": "<p>I see the spec says, \"implementations should use fixed-precision decimal formats\".  Does that refer to keeping the same number of digits after the decimal point for all numbers?  (I am used to \"precision\" meaning \"number of significant digits\", which can include digits the left of the decimal.)</p>",
        "id": 153999484,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1537811391
    },
    {
        "content": "<p>I think that the point is to preserve significant digits, so 2.10 must not be changed to 2.1.</p>",
        "id": 153999677,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1537839983
    },
    {
        "content": "<p>While I agree with you that 2.10 means something more precise than 2.1, the FHIRPath spec (6.1.2, Equivalent) says that for decimals, \"comparison is done on values rounded to the precision of the least precise operand. <em>Trailing zeroes are ignored in determining precision.</em>\"   That last sentence would mean that 2.10 ~ 2.11.  I am not sure if that was the intent.</p>",
        "id": 153999744,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1537884471
    },
    {
        "content": "<p>I'm not sure about the sentence - sounds like an error to me</p>",
        "id": 153999886,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537949204
    },
    {
        "content": "<p>I suspect it might have just been a compromise to keep things from getting too complex.  If you do not ignore trailing zeros, then you have to keep track of the \"scale\" (digits the right of the decimal), and internally the Decimal type becomes a structure to carry that information around.  Once you do that you open up questions of what happens when (for example) two Decimals are multiplied-- does the scale get reduced, and by how much?  These questions would be answerable if we converted all numbers to scientific notation and used the concept of significant digits, but then FHIRPath would have to answer the question of how to convert an input of say, \"20\" into scientific notation -- would \"20\" mean two significant digits or just one?  So, I can see why FHIRPath does not use significant digits.</p>",
        "id": 153999948,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1537971882
    }
]