[
    {
        "content": "<p>Hello, I am new to this chat server and to FHIR and FHIRPATH, hopefully my noob questions are ok here.  I'm curious how the different versions of FHIRPATH map to the different versions of FHIR format.  For instance would FHIRPATH STU1 support R4 FHIR?  would FHIRPATH N1 support FHIR DSTU2 ?   thanks in advance.</p>",
        "id": 200479723,
        "sender_full_name": "Tim Harsch",
        "timestamp": 1591824725
    },
    {
        "content": "<p>FHIRPath syntax is independent of the model you're using it with.  (FHIRPath can be used against models that aren't FHIR at all...)</p>",
        "id": 200480425,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591825100
    },
    {
        "content": "<p>However, tools that support FHIRPath may have limitations on what versions of FHIR they support.</p>",
        "id": 200480460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591825130
    },
    {
        "content": "<p>Also, FHIR R4 defines extensions to FHIRPath, and I think those extensions are based on N1 (release 2) of FHIRPath.  <a href=\"https://www.hl7.org/fhir/fhirpath.html\">https://www.hl7.org/fhir/fhirpath.html</a> says:  \"The FHIR Specification uses FHIRPath (release 2)....\"</p>",
        "id": 200481152,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1591825526
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179266-fhirpath/topic/mapping.20revisions.20of.20FHIRPATH.20to.20FHIR.20format/near/200480460\">said</a>:</p>\n<blockquote>\n<p>However, tools that support FHIRPath may have limitations on what versions of FHIR they support.</p>\n</blockquote>\n<p>For instance, fhirpath.js only has model information for STU3 &amp; R4.</p>",
        "id": 200481258,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1591825569
    },
    {
        "content": "<p>you can use newer versions of FHIRPath with older versions of FHIR, but not the other way around - R4 depends on N2 of FHIRPath throughout the specification</p>",
        "id": 200481589,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591825773
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"195344\">Paul Lynch</span> <a href=\"#narrow/stream/179266-fhirpath/topic/mapping.20revisions.20of.20FHIRPATH.20to.20FHIR.20format/near/200481258\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179266-fhirpath/topic/mapping.20revisions.20of.20FHIRPATH.20to.20FHIR.20format/near/200480460\">said</a>:</p>\n<blockquote>\n<p>However, tools that support FHIRPath may have limitations on what versions of FHIR they support.</p>\n</blockquote>\n<p>For instance, fhirpath.js only has model information for STU3 &amp; R4.</p>\n</blockquote>\n<p>What does that mean in practical terms if I'm attempting to query DSTU2 with fhirpath.js.   I guess I don't understand the role of the model information?  will it just make certain operations in FHIRPATH N1 (release 2) not possible?  or could I get incorrect results?  or path expressions rejected in some cases?</p>",
        "id": 200583740,
        "sender_full_name": "Tim Harsch",
        "timestamp": 1591899006
    },
    {
        "content": "<p>Without the model information, fhirpath.js will still mostly work, but type information will be absent, so things like the \"as\" operator won't work.  Also, choice type support will be lacking, so you won't be able to do Observation.value, but would have to write Observation.valueString (which is the actual field name in the JSON).</p>",
        "id": 200584561,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1591899365
    },
    {
        "content": "<p>FYI, if the FHIR definitions are in the same format for DSTU2 as for STU3 (which I have not checked), it would not be difficult to generate model information for DSTU2 and add that to fhirpath.js.  If that is something you need, you could request it by raising the issue on <a href=\"https://github.com/HL7/fhirpath.js/issues\">fhirpath.js</a>.</p>",
        "id": 200585367,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1591899744
    },
    {
        "content": "<p>Thank you!   <br>\nSo, my overall objective is to take a code that is currently broken because it seems to have supported a format similar to FHIR, but perhaps not conformant, and fix/replace it to match DSTU2 (what most of our providers are going to give us).    So I query for a give resource type out of a DSTU2 server (specifically from running this container <a href=\"https://hub.docker.com/layers/smartonfhir/hapi/r2-smart/images/sha256-080668a9cf3d02b5bb2b38e25c5d910e78d6bacdffea376d42d66154e9f705ad?context=explore\">https://hub.docker.com/layers/smartonfhir/hapi/r2-smart/images/sha256-080668a9cf3d02b5bb2b38e25c5d910e78d6bacdffea376d42d66154e9f705ad?context=explore</a> )  (NOTE the JSON I shared with you for DanielJohnson was DSTU3 and I'm now working with DSTU2) .   So I'm thinking if I could create a fhirpath expression that could extract all the blood pressure readings from an Observation record (for a given patient) then I could feed it to this code that charts the data  via some React element <code>&lt;ObservationsTableValueBar value={value} unit={unit} low={low} high={high} /&gt;</code><br>\nSo I guess the short answer is that I would potentially need the model information for DSTU2 (we will be supporting that for a long time I think).   But, for the short term, maybe it's not a show stopper, because if can just get the quoted values I'd probably be OK as I likely wouldn't be doing range queries on the values using FHIRPATH.    Long term we would likely use FHIRPATH expressions of varying type on DSTU2.</p>",
        "id": 200590206,
        "sender_full_name": "Tim Harsch",
        "timestamp": 1591902073
    }
]