[
    {
        "content": "<p>I have some questions about the tree in \"2. Navigation model\" on <a href=\"http://hl7.org/fhirpath/2018May/index.html\" target=\"_blank\" title=\"http://hl7.org/fhirpath/2018May/index.html\">http://hl7.org/fhirpath/2018May/index.html</a>, <br>\n1) Do I understand correctly that this tree represents the context (%context) against which the FHIRPath expression is evaluated?<br>\n2) When one has an expression like \"Observation.code\", will that pick up (at most) only one Observation's code (assuming the context is an Observation)?<br>\n3) Is it possible to have a situation in which the context might be both an Observation and a Patient, e.g., in part of a Questionnaire linked to an Observation for a particular patient?<br>\n4) (Which might answer 2 &amp; 3):  Since FHIRPath seems to operate on collections everywhere, is there really a single root in the navigation model, or might there be a collection of roots, i.e. a forest of trees?</p>",
        "id": 153975800,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1531846737
    },
    {
        "content": "<p>1) Yes, FHIRPath expressions are evaluated against a context (the initial root node passed to the evaluation engine) and that node is always available via the <code>%context</code> environment variable.<br>\n2) Yes, if the context is an Observation, a reference to the path <code>code</code> will return codes for that Observation.<br>\n3) The context itself will always be a single root resource, but you can access other resources, either contained or through reference tracing using the <code>.resolve()</code> function.<br>\n4) Yes, FHIRPath is collections everywhere, but there really is a single root node in which the path is evaluated. Passing a \"list\" of resources as the context root is not currently a supported use case.</p>",
        "id": 153975824,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1531855944
    },
    {
        "content": "<p>Thanks, Bryn!</p>",
        "id": 153975829,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1531858419
    }
]