[
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-28443\">FHIR#28443</a> proposes defining a new convenience operation (or set of operations?) to allow easy comparison of date, dateTime and instant with a Period.  Please share your thoughts on:<br>\na) whether that is something that should be added<br>\nb) what you think it should look like</p>",
        "id": 268984809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642893980
    },
    {
        "content": "<p>This would indeed be useful - I'd use it.</p>",
        "id": 268999382,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1642916849
    },
    {
        "content": "<p>(though haven't used an equivalent as yet)</p>",
        "id": 268999425,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1642916884
    },
    {
        "content": "<p>The proposed operation is pretty far afield from what we currently do in FHIRPath for this sort of thing. It would be important to work through some specific examples. It's proposed as a shorthand, but there isn't a lot of detail about what it's actually a shorthand for.</p>",
        "id": 269135543,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1643043457
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"237342\">@ryan moehrke</span> ?</p>",
        "id": 269167530,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643055834
    },
    {
        "content": "<p>I'm not sure what bonus functionality you'd get from adding the list of datetime search prefixes as comparison functionality in fhirpath besides being able to deal with periods<br>\n(adding functionality for datetime periods would be really interesting because: it would allow miss-matched precision to be compared instead of not being possible in fhirpath) <br>\nAs long as we ignore 'ap' - which if someone thinks it could be useful I have no qualms, I just don't personally see much need for it at all - <br>\nthen the only search prefixes we don't already have (with = != &gt;= &gt; &lt;= &lt;) are sa and eb, which both hold no meaning if the comparison isn't a period<br>\nSo what I'm seeing is actually a request to support periods natively (i.e. defining what the above operators mean when one or both sides are a period, defining how and when to implicitly convert between periods and datetimes, and deciding on if we want an explicit starts-after and ends-before method that can compare with start/end values if compared to a period but can default to &lt; or &gt; functionality when only a single value is given)<br>\nnote, this is really complicated which is why we've had multiple long discussions and plenty of detail and rewriting in the fhir spec about what their search prefixes actually do, (and that's with the simplification that one <em>must</em> be a single value of any precision), but going through the effort to do this instead I think would actually suffice a need instead of duplicating FHIR Search functionality that isn't necessarily applicable</p>",
        "id": 269202229,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1643078677
    }
]