[
    {
        "content": "<p>[Deleted].  I found more information in the FHIRPath doc, and might against again later after some more thought.</p>",
        "id": 153991377,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1535496264
    },
    {
        "content": "<p>After further thought about how ofType is supposed to work, I do have a few questions:</p>\n<p>1) B.3.4. says, \"In FHIR, only concrete core types are allowed as an argument.\"  Where is the list of the types that are \"concrete core types\", preferably as JSON (but XML is fine too)?</p>\n<p>2) When one is applying FHIRPath to a FHIR resource, the nodes of the FHIR resource do not themselves contain the type information needed to handle the ofType call.  Presumably that type information needs to be obtained from the StructureDefinition for the resource, correct?</p>\n<p>3) It looks like I can find StructureDefinitions in profiles-resources.json.  Does that include information for extensions, like questionnaire-itemControl?  I don't see it there.  Where would I find type information for extensions?</p>\n<p>4) If someone is using our JavaScript FHIRPath engine in a context where there are custom resources, how would the FHIRPath engine know about the types in the custom resources?</p>",
        "id": 153991670,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1535567530
    },
    {
        "content": "<p>I think, implicit meta-information usage in FHIR path is a heavy duty (it brings metadata, FHIR version dependency/hell, etc), may be move it into optional extension - make core explicit? <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153991674,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1535570912
    },
    {
        "content": "<p>profiles-others.json</p>",
        "id": 153991925,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1535637462
    },
    {
        "content": "<p>but type is explicit in the extension syntax</p>",
        "id": 153991926,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1535637471
    },
    {
        "content": "<p>ofType does require the type infrastructure to be there, yes. I'm not sure about moving it into an extension space. There's several operations that require quite a bit of support to implement</p>",
        "id": 153991927,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1535637531
    },
    {
        "content": "<p>Is there a particular part of profiles-others.json I should be looking at for the \"concrete core types\" for ofType?  I found a number of lists of data types, seemingly  for specific purposes.   \"concrete\" was not in the file; \"core\" was in the file but always with \"level\".</p>",
        "id": 153991970,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1535647612
    },
    {
        "content": "<p>also profiles-types.json. Abstract is explicit in the structure definition</p>",
        "id": 153992016,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1535664040
    },
    {
        "content": "<p>Or take <a href=\"http://hl7.org/fhir/valueset-resource-types.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-resource-types.html\">http://hl7.org/fhir/valueset-resource-types.html</a> in json / xml format</p>",
        "id": 153993757,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1536237622
    },
    {
        "content": "<p>It would be nice do not do this at all in fhirpath.js -  give to Caesar the things that are Caesar's  - give to dynamic lang the things that are dynamic</p>",
        "id": 153993838,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1536244059
    },
    {
        "content": "<p>Otherwise we will get all this version hell, profiles hell and so on. Can we do this things implicitly - enumerate properties?</p>",
        "id": 153993839,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1536244269
    },
    {
        "content": "<p>my fhirpath evaluator has a modular approach for defining functions, so I can delegate these things to the FHIR object provider</p>",
        "id": 153994107,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536271348
    }
]