[
    {
        "content": "<p>The description for supersetOf contains the following paragraph:</p>\n<p>\"Conceptually, this function is evaluated by testing each element in the other collection for membership in the input collection, with a default of false. This means that if the input collection is empty ({ }), the result is false, otherwise if the other collection is empty ({ }), the result is true.\"</p>\n<p>Some questions:</p>\n<p>1) Are paragraphs like this that are introduced by \"conceptually\" a part of the requirements, or merely helpful explanatory text?</p>\n<p>2) In the first sentence, why would the default not be true, just as it is for subsetOf?  In my code I am setting the default to true and then exiting the comparison loop as soon as it finds an element of the \"other\" collection that is not present in the input collection.  It is actually the same code as for subsetOf, just that the input and other collections are swapped.</p>\n<p>3) If both the input and other collections are empty, should it not be true that \"input\" is a superset of \"other\" (as in mathematics)?  Usually if two sets are equal, they are both supersets and subsets of one another.  Yet the second sentence here says the return should be false if the input collection is empty.  I suspect there was an editing mistake from the description of subsetOf.</p>",
        "id": 153990866,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1535148951
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> , you are correct, the text isn't quite right there. To answer the first question, the intent of the paragraph is to provide clarification, and yes, <code>X.subsetOf(Y)</code> should always be the same as <code>Y.supersetOf(X)</code> and if two sets are equal, they are both supersets and subsets of each other. So in the second paragraph, yes the default would be true, and if the _other_ collection is empty, the result is true, otherwise if the _input_ collection is empty, the result is false.</p>",
        "id": 153990910,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535319019
    },
    {
        "content": "<p>Thanks.  Would it be helpful for me to open a GForge ticket for that edit?</p>",
        "id": 153991027,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1535384484
    },
    {
        "content": "<p>I've made a note of it and plan to submit it as a ballot comment.</p>",
        "id": 153991681,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535571629
    }
]