[
    {
        "content": "<p>When there is more than one version of FHIRPath, will each version of FHIR require a particular version of FHIRPath?</p>",
        "id": 154009471,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1539714266
    },
    {
        "content": "<p>I don't think so, the intent was that all changes to the FHIRPath spec are aligned with the FHIR specification such that the normative specification should be able to be used by all the versions.</p>",
        "id": 154009522,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1539718617
    },
    {
        "content": "<p>R4 will specify and use the latest versions. The older specs use an older version, but I think it doesn't matter (I didn't use any of the type features were things changed)</p>",
        "id": 154009526,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539718781
    },
    {
        "content": "<p>That sounds safer to me.  I was thinking that someone might send an R4 Questionnaire containing 1.1 of FHIRPath to system that understands R4 but only 1.0 of FHIRPath, but if R4 specifies 1.1 (or whatever), then it should be fine.</p>",
        "id": 154009529,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1539718916
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I might have misunderstood your comment, but I was thinking that the page <a href=\"http://build.fhir.org/fhirpath.html\" target=\"_blank\" title=\"http://build.fhir.org/fhirpath.html\">http://build.fhir.org/fhirpath.html</a> would (by R4) contain a mention of a particular version of the FHIRPath spec.</p>",
        "id": 154027044,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1545660327
    },
    {
        "content": "<p>well, there's a challenge there. FHIR R4 depends on the fhirpath spec that isn't yet published. We're still considering what to do about that</p>",
        "id": 154027073,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1545730240
    }
]