[
    {
        "content": "<p>I am trying to figure out the proper execution of this test case <code>Patient.name.first().subsetOf($this.name)</code>. In this expression, what is populating $this? The fact that its name is accessed seems to suggest that the entire patient should be in $this, but I cannot find any documentation that would suggest that $this = %context?</p>",
        "id": 267366502,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1641747295
    },
    {
        "content": "<p>$this is definitely not %context</p>",
        "id": 267379556,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1641765094
    },
    {
        "content": "<p>My understanding is that it should be the name value, but I'll take a closer look.</p>",
        "id": 267379610,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1641765156
    },
    {
        "content": "<p>(I.e. I don't understand what it's doing here or if it's valid)</p>",
        "id": 267379636,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1641765199
    },
    {
        "content": "<p>I think it's invalid.</p>",
        "id": 267380454,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1641766333
    },
    {
        "content": "<p>As $this represents a currently processing item in the evaluation of a function that takes an expression. Which in this case would be the name is the value, not the patient.</p>",
        "id": 267380483,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1641766422
    },
    {
        "content": "<p>%context is the start point for the entire evaluation, also note in the fhir spec the %resource and %root Resource which are also closely related.</p>",
        "id": 267380618,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1641766571
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/vefS9RSiC7YMs2Wfp1tmpVy9/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/vefS9RSiC7YMs2Wfp1tmpVy9/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/vefS9RSiC7YMs2Wfp1tmpVy9/image.png\"></a></div>",
        "id": 267380651,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1641766680
    },
    {
        "content": "<p>thanks, maybe I expressed myself a bit unclear. I am aware that %context and $this are two different things. I am using $this in expressions of aggregator and .where and understand how it holds the currently iterated item. For this subsetOf example (again taken from the FHIRPath test suite) I don't understand what it should be populated with and because of which part of the spec. Since the author of the test is trying to access a .name property on it, I think it must somehow be the patient, but I don't get what would make the patient go into $this. In the fhirpath.js this test passes. When I rewrite it to Patient.name.first().subsetOf(%context.name) it will also pass.</p>",
        "id": 267381321,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1641767742
    },
    {
        "content": "<p>Maybe it's accidentally passing as comes out with an empty set or something.</p>",
        "id": 267386312,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1641775298
    },
    {
        "content": "<p>I'm still trying to get a full understanding of the proper application of $this. If I have the expression <code>(0|1).iif($this = 0, $index, false)</code>, what should be the proper way to think about this? Should <code>$this</code> be unpopulated, because <code>iif</code> is not designed to iterate over an input collection? Or should <code>iif</code> be executed 2 times, each time providing a single item (0, and 1) in $this, and the corresponding index in $index? Or put (0|1) into $this and set $index to 0? I'm trying to find the answer from reading the spec and not just by executing fhirpath.js and then doing whatever it does, without understanding why (fhirpath.js puts [0, 1] into $this, and empty collection into $index).</p>",
        "id": 267758257,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1642008661
    },
    {
        "content": "<p>Sorry, still trying to get any input on the proper handling of $this. I have thus far tried several implementations of FHIRPath, they all behave different, and I'm really unclear how to read the spec. When I do something like <code>Patient.name.iif(true, $this, 0)</code>, I have seen the following behaviours:</p>\n<ul>\n<li>engine signals error</li>\n<li>engine puts a list of the names into $this</li>\n<li>engine puts the entire patient resource into $this</li>\n</ul>\n<p>The FHIRPath test suite contains tests which imply that the last option (entire patient) is the right one, but I have only seen this behaviour on the HAPI FHIRPath engine, and cannot find something about this in the spec.</p>",
        "id": 268047816,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1642182420
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span></p>",
        "id": 268071372,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642193665
    },
    {
        "content": "<p>I agree that's pretty unclear in the spec. The section discussion says \"The functions in this section operator on collections with a single item\", which makes sense for all the other functions in that section (conversion functions), but <code>iif</code> isn't really a conversion function, it's more a conditional operator, so it's not clear that that applies. The examples in the spec of <code>iif</code> are all stand-alone (i.e. not invoked using the <code>.</code> notation), which is how I have always used <code>iif</code>. So I would expect <code>Patient.name.iif(true, $this, 0)</code> to be invalid, I would write <code>Patient.name.select(iif(true, $this, 0)</code>, and then the $this is clearly iterating over the names.</p>",
        "id": 268086829,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1642202248
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  that makes a lot of sense. The other item that I'm still trying to figure out is a test case from the test suite, also related to $this. It is this one: <code>Patient.name.supersetOf($this.name.first()) = true</code>. For this one, the HAPI FHIRPath engine puts the Patient resource into $this, (and also in the iif-example I gave, it is the engine that put the entire patient into $this)). Is there any explanation from the spec for that behaviour, or is this in your mind also something that should behave differently or not at all?</p>",
        "id": 268091245,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1642205683
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192169\">@Tilo Christ</span> the spec says that <code>$this</code> is only used when the function takes an <code>expression</code> as a parameter, and <code>supersetOf</code> explicitly takes a collection (i.e. it's not an interating operator). So I think this test is, based on the spec, invalid. It seems like the implementations took the approach of considering the root evaluation an \"iteration\" context so that <code>$this</code> would be available, but I don't see any language in the spec that supports that.</p>",
        "id": 269134366,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1643043004
    }
]