[
    {
        "content": "<p>I  would like to try to create a composite measure with \"Opportunity\" as its Composite Scoring Method.   Our component measures are Proportion and Non-patient based measure.  I have defined all required populations in the composite measure (i.e. IPP, DENOM, DENEX and NUMER).  However, I am not sure how the Opportunity scoring works on the performance rate calculation.  Do we need to define a function that calculates the performance rate or it will be taken care by some back-end programs?  Your response is appreciated.  Thank you.</p>\n<p>TT</p>",
        "id": 225074506,
        "sender_full_name": "Tien Thai",
        "timestamp": 1612383152
    },
    {
        "content": "<p>The CQL-based HQMF IG (and soon the QM IG) specify how to calculate opportunity scoring measures from the component measures. There is no need to specify additional calculation semantics within the measure itself. In the same way that a proportion measure doesn't need to specify how to calculate the performance rate.</p>",
        "id": 225085913,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1612388064
    },
    {
        "content": "<p>I am creating a composite measure in which I added every single risk adjustment variables from both component measures.  However, when clicking on \"Create Package and Export\" I am getting an error saying that \"Every Risk Adjustment Variable in a component measure must also be present in the composite measure\".  Am I missing any steps along the way?  For your reference, attached is the error message that I am getting.  Many thanks for your help.</p>\n<p>TT <a href=\"/user_uploads/10155/ItTaLMMMl8RHs0d5L1Xg_msl/Capture.JPG\">Capture.JPG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ItTaLMMMl8RHs0d5L1Xg_msl/Capture.JPG\" title=\"Capture.JPG\"><img src=\"/user_uploads/10155/ItTaLMMMl8RHs0d5L1Xg_msl/Capture.JPG\"></a></div>",
        "id": 225922079,
        "sender_full_name": "Tien Thai",
        "timestamp": 1612996432
    }
]