[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192017\">@Nagesh Bashyam</span>  as it seems MedMorph will be moving to use the R5 backport for subscriptions will the IG be defining a mapping from events to topic urls for use in the Subscription extension?  Or are you expecting sites to provide that mapping for the clients to use?</p>",
        "id": 224756734,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1612198751
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"214452\">Rob Dingwell</span> <a href=\"#narrow/stream/265512-medmorph/topic/Subscription.20Backport/near/224756734\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"192017\">Nagesh Bashyam</span>  as it seems MedMorph will be moving to use the R5 backport for subscriptions will the IG be defining a mapping from events to topic urls for use in the Subscription extension?  Or are you expecting sites to provide that mapping for the clients to use?</p>\n</blockquote>\n<p>Rob,Nagesh</p>\n<p>Was this question ansered?  Should we be building the FHIR servers with R5 rather than R4.0.1?</p>",
        "id": 238760146,
        "sender_full_name": "Edward Castagna",
        "timestamp": 1620996176
    },
    {
        "content": "<p>It would not be so much moving from R4 to R5 but instead of using the base R4 Subscription resource utilizing the R5 Subscription Backport IG <a href=\"http://build.fhir.org/ig/HL7/fhir-subscription-backport-ig/StructureDefinition-backport-subscription.html\">http://build.fhir.org/ig/HL7/fhir-subscription-backport-ig/StructureDefinition-backport-subscription.html</a>   This is an IG that profiles some of the concepts of the R5 Subscription resource onto the R4 Subscription resource.</p>",
        "id": 238775354,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1621002460
    },
    {
        "content": "<p>As a note, FMG approved adding <code>SubscriptionTopic</code> and <code>SubscriptionStatus</code> to R4B, so the IG will be updated to use those resources instead of the compromises that are in the current version.</p>\n<p>The <code>Subscription</code> resource remains unchanged, but this makes moving from R4 to R5 mostly painless.</p>",
        "id": 238781407,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1621004844
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> so the extensions for things like heartbeat, timeout, payload-content .... Those are not going to be in the backport subscription anymore?  OR do you mean that the additional resource have been approved but the current backport Subscription profile remains unchanged?</p>",
        "id": 238833371,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1621028311
    },
    {
        "content": "<p>The extensions on <code>Subscription</code> will remain as they are today, since the resource is unchanged from R4 to R4B.  The difference is that in R4B there will be definitions for <code>SubscriptionTopic</code> and <code>SubscriptionStatus</code>.</p>\n<p>On the definitional side, instead of leaving topic definition out of scope, we will be able to link it properly to <code>SubscriptionTopic</code> definitions.</p>\n<p>On the notification side, we can get rid of all the profiles on <code>Parameters</code> and just use <code>SubscriptionStatus</code>.  Note that the new bundle type could not be added, so it will still be a <code>history</code> bundle in the backport as well.</p>",
        "id": 238833611,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1621028468
    }
]